{"search_metadata": {"id": "60827aaa1e803f37a1bff767", "status": "Success", "json_endpoint": "https://serpapi.com/searches/1e59bf9d0555430f/60827aaa1e803f37a1bff767.json", "created_at": "2021-04-23 07:43:38 UTC", "processed_at": "2021-04-23 07:43:38 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28consultant%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=130", "raw_html_file": "https://serpapi.com/searches/1e59bf9d0555430f/60827aaa1e803f37a1bff767.html", "total_time_taken": 1.32}, "search_parameters": {"q": "(consultant) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "130"}, "jobs_results": [{"title": "Systems Consultant (Infrastructure and Database Department) [NIE]", "company_name": "National Institute Of Education", "location": "Singapore (+1 other)", "via": "via Glints", "description": "The Academic Computing and Information Services (ACIS) at the National Institute of Education (NIE) invites suitable candidates to serve as a Systems Consultant in the Infrastructure and Database Department. This is a contract position and will expire by 31 Mar 2023.\n\nJob Description\n• Manage and support the delivery of in-house and outsourced IT projects and services to meet IT initiatives of academic and research users.\n• Manage and support the in-house research operations and management system and provide awareness and training to the academic and research community.\n• Provide technical advice and consultancy to the academic and research community on IT policy, proposal, procurement and all IT-related matters.\n• Plan, design, implement, manage and maintain the server, storage and virtualised infrastructure deployed in the data centre.\n• Manage system availability, capacity, incident, problem resolution and asset lifecycle management.\n• Develop and review research-related policies... procedures and documentation for research operations and management, and server, storage and virtualisation platform.\n• Evaluate, recommend and acquire systems and products for the Institute.\n• Provide IT support for research conferences and standby technical support outside office hours.\n• Participate in developing and implementing business continuity and disaster recovery plans.\n• Work on weekend occasionally for preventive maintenance and project related activities, provide on-call rotational support coverage and 24-hour response for emergencies.\n\nRequirements\n• A Degree in Computer/Electrical/Electronics Engineering or its equivalent.\n• At least 2 years of project management and business process management experience in a research environment.\n• 2 to 3 years’ working experience in server, storage administration and virtualisation management.\n• Working knowledge in the administration of CMS (WordPress, Joomla, Moodle, Drupal), research tools (EndNote, SAS, SPSS, NVivo), Microsoft products (Active Directory, SharePoint, SQL) and VMware products (vSphere, vCenter).\n• Working knowledge of Server and Storage technologies, Virtualization, SAN, NAS, zoning, LUN masking, NFS, CIFS and replication technologies.\n• Experience in ISO 22301 Business Continuity Management System and ISO 27001 Information Security Management System are preferred.\n• Certifications such as CITPM, PMP, VCP, ITIL and CCNA are preferred.\n• Self-motivated team player with positive attitude and ability to work independently.\n• Strong analytical and problem solving skills.\n• Good communication, interpersonal and presentation skills.\n• Experience working in a research environment and knowledge of research processes will be an advantage.\n\nInterested candidates, please click here to apply", "extensions": ["23 days ago", "Full–time"], "detected_extensions": {"posted_at": "23 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTeXN0ZW1zIENvbnN1bHRhbnQgKEluZnJhc3RydWN0dXJlIGFuZCBEYXRhYmFzZSBEZXBhcnRtZW50KSBbTklFXSIsImNvbXBhbnlfbmFtZSI6Ik5hdGlvbmFsIEluc3RpdHV0ZSBPZiBFZHVjYXRpb24iLCJjb21wYW55X21pZCI6Ii9tLzA5dGRqYyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IlZpc3ljZmRPMVE4V1JfQndBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVvc0NDc3dCUVU1VlgwNXhWSEl0TTBWcFEyMU5aRWhCVVU1R2NqQnRiR3Q0Y1VWSFRHcDZXSGh5VEVaTFJURXdla1l3VkMxWU1DMXVTM1ZMZUdsRVIzWTFaRGw0V0RZNVJHcHVMVE0yVUVwRllrVTViSHB1VFdWamNrVnFSVmhETkhBeE4yZFVSREUyZDA1TVpraG1TVUpoTm1STU1WWTJMVGw0TTFNNFNXMHdjRWQ1WlZadlozUndPR0p1YkRGVFZIVmhZbkI0T0dWU2NGTk1RazFYZG5RMlMyUklPRFYzZUZoQllucFVOVFJVYjNsRFkwZzNUblZQTlVkeFUxUnhaa040YjNFM1l5MVJTRkZUTVVSb2RsTTBFaFp4Ym5GRFdVcHhja3RaYVVSMFVXRllha3B5VVVKbkdpSkJUMDFaVW5kRFRrNHRjV2RxYVRobWNHcExWM1pHUjBkT1dsQTRTVTltUm1SQiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzciLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gR2xpbnRzIiwibGluayI6Imh0dHBzOi8vZ2xpbnRzLmNvbS9vcHBvcnR1bml0aWVzL2pvYnMvc3lzdGVtcy1jb25zdWx0YW50LWluZnJhc3RydWN0dXJlLWFuZC1kYXRhYmFzZS1kZXBhcnRtZW50LW5pZS9iNzRlMzdmNy05YmI0LTQyNzMtOTQ3Ny1iNWEzZGQ1ZGM3M2I/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Principal Consultant", "company_name": "Eames Consulting Group (singapore) Pte. Ltd.", "location": "Singapore (+1 other)", "via": "via Monster Singapore", "description": "• Brand Ambassador and market leading consultant in own discipline.\n\n• Proven track record of securing new clients for the group.\n\n• Frequently secures exclusive and / or retained work.\n\n• Lead on client presentations, pitches and RFI’s on behalf of the team and group.\n\n• Able to either independently complete RFI’s or contribute in a timely manner as requested.\n\n• Act as a positive role model for the firm, positively conveying and supporting senior management messages.\n\n• Provide management with data and objective feedback on market or discipline related issues and topics.\n\n• Able to articulate the Eames vision and demonstrates the ECG values, setting an example for other team members.", "extensions": ["7 days ago", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcmluY2lwYWwgQ29uc3VsdGFudCIsImNvbXBhbnlfbmFtZSI6IkVhbWVzIENvbnN1bHRpbmcgR3JvdXAgKHNpbmdhcG9yZSkgUHRlLiBMdGQuIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJ5cTJqZWgyLXF5MWR3bWprQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1vbnN0ZXIgU2luZ2Fwb3JlIiwibGluayI6Imh0dHBzOi8vd3d3Lm1vbnN0ZXIuY29tLnNnL2pvYi9wcmluY2lwYWwtY29uc3VsdGFudC1lYW1lcy1jb25zdWx0aW5nLWdyb3VwLXNpbmdhcG9yZS1wdGUtbHRkLXNpbmdhcG9yZS0yMzg0OTc0P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Salesforce Business/ Functional Analyst", "company_name": "Accenture", "location": "Singapore", "via": "via Accenture", "description": "About Accenture\n\nAccenture is a global professional services company with leading capabilities in digital, cloud and security. Combining unmatched experience and specialized skills across more than 40 industries, we offer Strategy and Consulting, Interactive, Technology and Operations services—all powered by the world’s largest network of Advanced Technology and Intelligent Operations centres. Our 506,000 people deliver on the promise of technology and human ingenuity every day, serving clients in more than 120 countries. We embrace the power of change to create value and shared success for our clients, people, shareholders, partners and communities. Visit us at www.accenture.com.\n\nYour Role\n\nWe are currently looking for a Salesforce Consultant to join our Salesforce Business Group, with the focus on Salesforce projects. You will become part of the Global Salesforce Business Group practice and you will be working on a project basis in a multi-disciplinary team engaged in a wide range... of Salesforce projects. Candidates for this role should possess a knowledge of public cloud applications with a focus on Salesforce.com & the application landscape around it.\n\nThe Salesforce Consultant supports the implementation from proposal to delivery. This includes developing a thorough understanding of the Client’s requirements then applying industry best practices and detailed knowledge of the Salesforce solution to design an optimal solution that supports the business process and meets/exceeds functional requirements. This position builds a trusting relationship with major project stakeholders and leads them to the adoption of the best solution. Specifically, this role guides teams that will successfully deliver the Salesforce project.\n\nYour Responsibilities\n• Deliver, oversee and ensure quality of Salesforce implementation projects from start to finish on time and within budget.\n• Performs “As-Is” and Fit/Gap analyses in to map the Cloud technology’s offerings and capabilities to the Client business needs.\n• Works closely with technical architects to make the bridge between the business team and IT team.\n• Presents and leads sessions and requirement workshops, based on Waterfall or Agile Delivery Methods.\n• Has sufficient knowledge of the Salesforce platform to make adequate design decisions & propose solutions to requirements based on industry & technology best practices.\n• Understands the importance and is able to design Salesforce solutions integrated in the IT application landscape (example: integrations to ERP & reporting systems)\n• Manages teams of highly qualified functional and technical resources (both on-shore and off-shore).\n• Defines test cases and leads contractual testing to confirm that solution performs as per the business requirements.\n• Coordinates releases and post Go-Live materials (e.g. training documentation, training sessions", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTYWxlc2ZvcmNlIEJ1c2luZXNzLyBGdW5jdGlvbmFsIEFuYWx5c3QiLCJjb21wYW55X25hbWUiOiJBY2NlbnR1cmUiLCJjb21wYW55X21pZCI6Ii9tLzAxcnAyYyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6InduZzJ2eUF2QjdVWklHYmhBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhWSGRqT1c1RlREQjVVSEZCUzI5b1VUVmtaMHhGYWpaNGRtRjJaMjQwWld0WGFHMWxRMmM1TFhwc05WRnhSbEZmY2xSUmRubDBja2xpU0RaUFpGcFhTa042VlRsVGQwRkpRVXhLVWt3MVVFRnJTakZaU0VSVGVFbERkMVZhVHpZek1EZ3hWVmR6UjFOMGFVdHNWWEpZUTJWMFJVODVheTF0WTBSRVVrVkJVRTlRUlZsRE1VMXBSVGhCVldOcWRYazBMVTl5TkdGS1ZHbEhUVWRuRWhaeGJuRkRXVXB4Y2t0WmFVUjBVV0ZZYWtweVVVSm5HaUpCVDAxWlVuZERNa05CUzJ0NFRWZE9USEZPU0VOc09HZGtWa1JYVFV4MmFrMW4iLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18xOSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBBY2NlbnR1cmUiLCJsaW5rIjoiaHR0cHM6Ly93d3cuYWNjZW50dXJlLmNvbS9zZy1lbi9jYXJlZXJzL2pvYmRldGFpbHM/aWQ9MDA4OTU0MTBfZW5cdTAwMjZ1dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "IT Audit - Senior Consultant / Manager", "company_name": "Deloitte SEA", "location": "Singapore", "via": "via Jobs At Deloitte Southeast Asia - Deloitte", "description": "Title: IT Audit - Senior Consultant / Manager (IT & Specialised Assurance)\n\nWhat impact will you make?\n\nAt Deloitte, we offer a unique and exceptional career experience to inspire and empower talents like you to make an impact that matters for our clients, people and community. Whatever your aspirations, Deloitte offers you a highly inclusive, collaborative workplace and unrivalled opportunities to realize your full potential. We are always looking for people with the relentless energy to push themselves further, and to find new avenues and unique ways to reach our shared goals.\n\nSo what are you waiting for? Join the winning team now.\n\nWork you’ll do\n• Understand objectives for stakeholders, clients and Deloitte whilst aligning own performance to objectives and sets personal priorities.\n• Perform IT audit, regulatory compliance assessment (e.g. MAS) and IT risk assessment, in areas covering IT general controls, application controls, business cycle and IT security review.\n• Understand... third party assurance framework (i.e. ISAE, SSAE, AICPA).\n• Able to evaluate IT internal controls and identify opportunities for controls improvement.\n• Able to Identify and evaluate complex technology and business risks and internal controls which mitigate risks, and related opportunities for internal control improvement.\n• Able to identify other areas of business initiatives and changes in the business environment and assess their impact on the business control environment.\n• Develop themselves by actively seeking opportunities for growth, shares knowledge and experiences with others, and acts as a strong brand ambassador.\n• Seek opportunities to challenge themselves, collaborate with others to deliver and takes accountability for results.\n• Build relationships and communicates effectively in order to positively influence peers and stakeholders.\n• Work effectively in diverse teams within a highly inclusive team culture where everyone is supported, respected and recognized for their contribution.\n• Experience in leading teams in performing IT audits and risk assessment assignments.\n• Strong understanding of complex business and IT processes, and their related risks.\n• Build and nurture positive working relationships with clients with the intention to exceed their expectations.\n\nRequirements\n• Minimum 5 years and above of work experience in the field on IT audit and/or risk assessment.\n• Degree in Information Systems, Information Technology, Computer Science, Business Studies, Accounting or Cyber Risks or equivalent.\n• Pursing or certified with certifications such as CIA, ISMS Lead Auditor, CISA, CEH, GPEN or GCIH is preferred, but we will sponsor the successful candidate to attain such certification\n• Excellent Microsoft Office skills (i.e. pivot table, formula, formatting, charts & graphs etc.)\n• Good understanding of ISAE 3402/3000, SSAE 3402/3000, SOC 1 and SOC 2, COSO, COBIT, ISO/IEC 27000, ISO 31000 or equivalent standards\n• Good understanding of business and IT processes, and their related risks.\n• Good understanding of general IT controls, with ability to recommend opportunities for controls improvement\n• Good logical thinking skills (analytical skills would be added advantage)\n• Excellent language skills (spoken & written) in English, Mandarin would be an added advantage\n• Experienced professionals with more than 2 years of working experience are encouraged to submit your application. Working experience in Big Four audit firm would be added advantage.\n• Team player and/or team lead with excellent interpersonal skills\n\nDue to volume of applications, we regret only shortlisted candidates will be notified", "extensions": ["19 days ago", "Full–time"], "detected_extensions": {"posted_at": "19 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJJVCBBdWRpdCAtIFNlbmlvciBDb25zdWx0YW50IC8gTWFuYWdlciIsImNvbXBhbnlfbmFtZSI6IkRlbG9pdHRlIFNFQSIsImNvbXBhbnlfbWlkIjoiL2cvMTFmX2c0eDlkXyIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Ijd1MHB6V0ltdUF6RXg4RS1BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhVWE41YkdWQ2RWWkRPR2xaVjNKSGNEZDFXRXRzVnpKUFNYbEdNbUp3WVRneWN6SnRTbFF4YzBoUmJTMW5Ra1ZuTVVSd2EwZHNkMDUwZWtkWlkyUnJjRzlKY1ZkT1ZsVlJNRUUyY1hCblJrcHpObmx4WWxwc2ExVnNSa2RCWm0xR1NsTldiMjlhTmpWVU1YRldXa1l5ZW1vNVkxSmZaRE42UjFkcFIzWlJNbEY2U1UxRFpXNDBSSHBxV0ZoblpXc3dSVEV3U1ZOb2JsWk9ia3huRWhaeGJuRkRXVXB4Y2t0WmFVUjBVV0ZZYWtweVVVSm5HaUpCVDAxWlVuZENOMGQyZG1rdGJ6TkxkV1ZDT0hOU00zQXRTRGxSZW0xSlRsQkIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18yNSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIEF0IERlbG9pdHRlIFNvdXRoZWFzdCBBc2lhIC0gRGVsb2l0dGUiLCJsaW5rIjoiaHR0cHM6Ly9qb2JzLnNlYS5kZWxvaXR0ZS5jb20vam9iL1NpbmdhcG9yZS1JVC1BdWRpdC1TZW5pb3ItQ29uc3VsdGFudC1NYW5hZ2VyLzU3OTQwNjExMC8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Lead Consultant, Systems", "company_name": "Singtel Group", "location": "Singapore", "via": "via Singtel Careers", "description": "Responsibilities\n• Hands-on experience on Solaris virtualization technology (LDoms and Zones).\n• Hands-on experience on Oracle Solaris Cluster.\n• Experience in working virtually with development teams to troubleshoot application issues, network issues and application performance tuning\n• Rapid response to business critical incidents.\n• Working closely with Linux/UNIX engineering and third party vendor to explore new technologies.\n• Capability to plan and execute Linux/UNIX Security and Compliance requirements\n• Work with project delivery team on various projects for Linux/UNIX infrastructure.\n• Interface with IT and business clients at all levels of the organization\n• Perform standard OS upgrades and patching of current environment.\n• Experience with working on Apache web server on Linux is a plus.\n• Good knowledge in Amazon cloud technology and basic services\n• Provide technical leadership and decisions for projects.\n• Manage, plan, and coordinate efforts and resources on portfolio... and functional projects.\n• Review and provide requirements for Concept Design Docs.\n• Creating and updating formal documents/reports\n• Experience managing multiple projects and day to day activities.\n• Work closely with project managers to create and update project plans.\n• Ability to work independently as well as part of a team.\n• Ability to lead junior members of the team with very little input from upper management.\n• Write and maintain technical documentation for Standard Operating Procedures for Linux/UNIX environment.\n• Some out of hours and weekend work will be required to comply with applicable change windows.\n• Review/approval/implement Change Requests.\n\nQualifications\n• 10+ years of experience with Linux (SuSE or Red Hat) and Unix (Solaris, AIX)\n• 10+ years of experience with systems administration: upgrades, patching and configuration management, performance management, troubleshooting, analysis and capacity planning.\n• Ad hoc / on-call support during weekdays and weekend work is required\n• Strong skills in TCP/IP Networking & advanced systems tuning, network topology and firewalled environments.\n• Full understanding the principles of routing, client/server programming, the design of consistent network-wide file system layout, Ethernet, bonding, PCIe Technologies.\n• Knowledge and working experience with various protocols & services: NFS, NIS, DNS, DHCP, IP, TCP, UDP, IGMP, FTP, TFTP, NTP, SSH.\n• Experience installing layered products in a timely fashion, analyzing & troubleshooting complex systems and familiarity with ITSM procedures.\n• Skill set of different storage technologies\n• Strong problem solving skills with ability to work in a highly pressurized multitask environment\n• With ITIL v3 certification will be an added advantage.\n• Skills of writing Unix shell scripts (KSH & Perl. Python & C++) will be an added advantage.\n• Knowledge and experience in DR test support will be an added advantage.\n• Certified with AWS cloud certification, Oracle Solaris, Red Hat RHCSA/RHCE\n• Minimum educational qualification: University graduates with a Bachelor’s Degree", "extensions": ["27 days ago", "Full–time"], "detected_extensions": {"posted_at": "27 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJMZWFkIENvbnN1bHRhbnQsIFN5c3RlbXMiLCJjb21wYW55X25hbWUiOiJTaW5ndGVsIEdyb3VwIiwiY29tcGFueV9taWQiOiIvbS8wMjB6ZmwiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJxUG1SUHplSnBqRDlQSVl1QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VW14ME5YRlNaWGxrTmpSYVIyUjRWR0pFVUd4Vk5GSnNjR0ZMZGpWcGMyMDBiazlvWVUxcVZ6RmlTVlZFZDAwMVRGaElZVVJ3V0ZkcmRVMTZRVWRLU0VwQ2MwUmpRakIwWnpGeldEWm9aVmhUY1ZjNWJuWjFXa2cwZFRFNWJtZFVRMDlPYlVnME1GZ3dTa05XVGtaS2RIY3hUWGR5YVhwNVFqSXlWekJ3UTE5WVQwc3lORE5xV21SV1JGZDViVFJQTTA5b1kySlhlbVoyWldGbkVoWnhibkZEV1VweGNrdFphVVIwVVdGWWFrcHlVVUpuR2lKQlQwMVpVbmRDZEVOVVFtdG1kR1V3UjA1Uk1XZG9TMU0wZG5sTFJraGZiWHBCIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMzIiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gU2luZ3RlbCBDYXJlZXJzIiwibGluayI6Imh0dHBzOi8vZ3JvdXBjYXJlZXJzLnNpbmd0ZWwuY29tL2pvYi9MZWFkLUNvbnN1bHRhbnQlMkMtU3lzdGVtcy1TaW5nLzU4MDEwODcxMC8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Senior Sap Hcm Payroll Consultant   Employee Central", "company_name": "ABEAM CONSULTING (SINGAPORE) PTE. LTD.", "location": "Singapore (+1 other)", "via": "via MNC Jobs Singapore | MNC Jobs In Singapore", "description": "Job Title: Senior SAP HCM Payroll Consultant - Employee Central\n: This is both SAP project delivery-focused and AMO/Support role, managing complex SAP ERP implementation & configuration, as well as taking care of the tickets issue from several clients to support their queries. Consultant must be able to travel frequently locally.\nResponsibilities:\n• As ABSG Senior SAP HCM Payroll Consultant, you will be working with our client with cross-functional teams. IT development team and business users as consulting level.\n• Involved in the full process of data gathering and analysis on user requirement, project design, strong project implementation in HCM modules, post-implementation support and roll-out.\n• Identifies, assesses and solves complex business problems for area of responsibility, where analysis of situations or data requires an in-depth evaluation of variable factors\n• You will be involved in carrying out SAP HCM-SuccessFactors integration projects; defining iflows, local ... exception sub-process, value mapping artifacts.\n• SuccessFactors integration related configuration in SAP HCM system (Example- field mapping for hiring candidates etc)\n• Employee Central Foundation Objects, Generic Objects, Event Reasons Derivations, Business Rules and Notifications, Custom MDFs and XML\n• You will also be involved in SAP HCM ABAP configuration with other basic modules\n• Strong function and/or technical skills in all areas of the HCM modules in a consulting environment in various industries\n\nRequirements:\n• Must have more than 5 years of SAP HCM Payroll Consultant - Employee Central experience\n• Certified in SuccessFactors Employee Central with experience of working as a functional consultant for integration to external system using SAP Cloud platforms (SCP/HCI/CPI)\n• At least 3 full cycles of complex project implementations should be completed in SAP HCM / HR\n• Implementation of experience of Employee Central for Singapore clients\n• Strong knowledge of Employee Central Foundation Objects, Generic Objects, Event Reasons Derivations, Business Rules and Notifications, Custom MDFs and XML\n• Should be experienced in Benefits and Leave configuration for Singapore clients.\n• Should understand the HCM requirements and develop the functional design,\\ configuration workbook, workflows\n• Strong Knowledge on HR Business Processes and Singapore regulations\n• Techno Functional experience and expert in liaising with client HR team\n• Strong integration knowledge with SAP HCM Payroll will be added advantage.\n• Experience on SF-Compensation module will be added advantage for us.\n• OpenText Extended ECM for SAP SuccessFactors knowledge is preferred.\n• Professional Certification in SuccessFactors Employee Central is preferred\n• Presales experience will be added advantage.\n• Please note that salary is determined on related experience and skill\nPersonal Attributes:\n• You must have excellent analytical, presentation and soft skills including communication on how to handle existing clients and be client oriented with excellent problem-solving skills\n• You must possess a personal attribute such as creativity, positive thinking, quick learning, imagination, leadership, judgment and maturity, curiosity, strong interpersonal skills, professional integrity and initiative\n• Confident in communicating and presenting at business level to MNC clients.\n\nTake this opportunity to join an international team of professionals, implement and develop software and consulting solutions in international projects and gain cultural experience, to set a serious foundation for future career steps.\nFor this position, interested applicants can apply directly by clicking \"Apply Now\"\nABeam Consulting (S) Pte Ltd\n18 Cross Street #10-05/09 China Square Central Singapore 048423\nTel: +65 6922 5270\nWebsite: www.abeam.com\nWe regret to inform you that only shortlisted candidates will be notified.\nAdditional note to applicants\n• Only candidates with profiles and CV’s matching job requirements will be considered and contacted for interviews. In case you do not receive any response from us within four weeks of your application it means that your application was not considered. Due to the high number of applications we receive we cannot entertain each individual follow-up.\n• Processing of applications will start approximately two weeks after job posting date. Selection process is expected to take another two to four weeks.\n\nPlease note that this is for direct hiring only, NOT open to recruiters.\n\nminimumYearsExperience : 5\n\n[CANDIDATES WHO REQUIRE WORK PASSES NEED NOT APPLY", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU2FwIEhjbSBQYXlyb2xsIENvbnN1bHRhbnQgICBFbXBsb3llZSBDZW50cmFsIiwiY29tcGFueV9uYW1lIjoiQUJFQU0gQ09OU1VMVElORyAoU0lOR0FQT1JFKSBQVEUuIExURC4iLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Ik9uelNEX3Q4dWlxb2hyZUVBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTU5DIEpvYnMgU2luZ2Fwb3JlIHwgTU5DIEpvYnMgSW4gU2luZ2Fwb3JlIiwibGluayI6Imh0dHBzOi8vc2cubW5jam9iei5jb20vam9icy9zZW5pb3Itc2FwLWhjbS1wYXlyb2xsLWNvbnN1bHRhbnQtZW1wbG95ZWUtY2VudHJhbC1zaW5nYXBvcmUtMTgyNTczP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Senior Security Consultant", "company_name": "NCC Group", "location": "Singapore (+1 other)", "via": "via LinkedIn", "description": "Role: Senior Security Consultant\n\nLocation: Singapore\n\nThanks for checking out our job opening; we are excited that you are interested in learning more about NCC Group.\n\nWe are on a mission to make society a safer and more secure place. Our people are the ones who make that possible; a global community of talented individuals working together towards a safer future.\n\nWe aim to create an environment where everyone can reach their full potential. We work together, we are brilliantly creative, we embrace difference and we want you to join our mission.\n\nTake a look at our website here to learn more about why we’re one of the leading global Cyber Security and Risk Mitigation businesses… https://www.nccgroup.com/au/our-services/cyber-security/\n\nThe Opportunity\n• Assist in the identification, resolution and documentation of security incidents\n• Providing technical scoping advice and assisting pre sales where necessary.\n• Conducting focused research when not engaged on client billable... projects.\n• Responsible for adhering to all internal policy and security procedures\n\nThe Challenge\n• 2-3 years’ experience in web app, infra testing (Red team)\n• Proficiency in the use and application of security technologies\n• Ability to travel to clients sites to perform security engagements as required\n• Delivering high quality technical solutions to clients\n• Developing self-skills on internal security projects.\n• Ability to lead technical teams on client engagements\n\nExperience\n• Strong networking and associated protocol knowledge and experience\n• Applied cryptography, mathematics or computer science experience\n• Mobile security knowledge and experience (OS, RF and App)\n• Applied security research\n• Application security threat modelling\n• Cloud Service testing (AWS / Azure)\n• SDLC Implementation and Testing\n• Software development or programming/scripting abilities\n• Source code review\n• Reverse engineering\n• Fuzzing\n\nEssential Skills / Certifications\n• Use of a variety of network security testing tools\n• Identify vulnerabilities and be able to recommend corrective action\n• Ability to explain the output of a penetration test to a non-technical client\n• Industry standard qualifications such as OSCP or CREST CRT\n\nWhat’s in it for you? NCC offers a lot of benefits not limited to:\n• Exposure to industry research and conferences\n• Opportunities for accelerate your career\n• Friendly, supportive environment\n• Flexibility - Working from home\n• Great Singapore location\n• Casual dress code\n\nLife @ NCC\n\nWhat matters to you when you’re looking for your next career move?\n\nWhat about somewhere with incredible and diverse career and development opportunities – where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust – where everyone has a voice? If so, then NCC could be your next career challenge.\n\nIf we have just described you, get excited! You may have just secured yourself an invitation to work within a highly certified, high caliber Cyber Security Team who will welcome your proven record of testing complex systems and critical infrastructure environments.\n\n“NCC Group is an equal opportunities employer and welcomes applications from all sections of society and does not discriminate on grounds of race, religion or belief, ethnic or national origin, disability, age, marital, domestic or civil partnership status, sexual orientation, gender identity, or any other basis as protected by applicable law.”", "extensions": ["13 hours ago", "Full–time"], "detected_extensions": {"posted_at": "13 hours ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU2VjdXJpdHkgQ29uc3VsdGFudCIsImNvbXBhbnlfbmFtZSI6Ik5DQyBHcm91cCIsImNvbXBhbnlfbWlkIjoiL20vMGNxang3MyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjNrMi1fTENDRHV2bjZRbThBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhVa0YwWWxoaGJESjBhV2hvZGtwRVdUbHdSSGMwTVhGUWREZDJjRlZoZDNneWJWOVJPVlJFV1hndFZsOU9XalZpUzNWSlQzQjJla0ozZDNoNlVsTnRUVlJPYlZWaVJWOUNSa2RFYnpkRVlWaEdRMlZFT0dwc1NGTllNRmxWUnpkVUxWbEpSVkY0ZWxWeVRYUTRiRFZzUWtsV1NEUTJSbnBrVFV3dGFWUmtOWEpQVmxFMGVIbFJjREZrVkZsTGNsaElOMjlhVTA4eVNXRXpjelZSRWhaeGJuRkRXVXB4Y2t0WmFVUjBVV0ZZYWtweVVVSm5HaUpCVDAxWlVuZEVkVWhJTjFWT1VEZHdjMTlZT0RNeGJHWkpUblJUYUcxaE1uVkIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY180NCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL3NnLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvc2VuaW9yLXNlY3VyaXR5LWNvbnN1bHRhbnQtYXQtbmNjLWdyb3VwLTI1MTU3NDk1Njg/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Security Consultant", "company_name": "SearchElect Pte Ltd", "location": "Singapore", "via": "via Jobs | Fidanto", "description": "Key Words: OSCP, Offensive Security Certified Professional, CCT INF, CREST Certified Infrastructure Tester, CCT APP, CREST Certified Web Application Tester, ICS Security, Penetration Testing, Ethical Hacking, Vulnerability AssessmentRole: Security Consultant (Penetration Tester)Industry: Public Sector, Banking, Security, Information TechnologyFunction: Penetration TesterLocation: SingaporeAbout Our ClientOur client is a global MNC overseeing cybersecurity strategy, operation, education, outreach, and ecosystem development. They are expanding their cyber-defense capabilities and are working on multiple projects prominently in the banking and financial institutions and the Singapore government sector. About the Security Consultant (Penetration Tester)You will conduct of in-depth vulnerability assessment, penetration testing and red teaming of systems. You are also required to:Manage and allocate tasks within the team and oversee the technical skills development of team members.Work... closely with respective stakeholders to facilitate the tests, provide technical consultancy and conduct technical sharing.Develop continually your managerial and technical competencies to meet the requirements of this job.About YouPlease note: Interested Applicants must be able to work in Singapore and preferably a Singapore Citizen or Permanent resident due to the nature of projects that these roles will be responsible for.Have some prior experience in conducting vulnerability assessments and penetration testsBe comfortable with working on various platforms and operating systems (e.g. Windows, Linux, Kali)Understand the OWASP testing methodology and have knowledge of penetration testing toolsBe able to work as part of a team, and at the same time being an independent self-starterHave strong analytical, problem solving and inter-personal skillsCommands excellent written and oral communication skills with the ability to present ideas and results to technical and non-technical audiencesPreferably possess professional certifications such as OSCP/CREST and/or GIAC (GXPN, GPEN, GWAPT, etc.)If you are interested to learn more about the above job role or any other job opportunities, please apply to this job advertisement or alternatively contact the following consultant:Danielle Tan+65 65898787danielle@searchelect.comSearchElect Pte. Ltd. adheres to the Singapore Ministry of Manpower Tripartite guidelines on Non-Discriminatory Job Advertisements which you can find more information about HERE. If you feel any part of this job advertisement is discriminatory please immediately raise to our attention via webadmin@searchelect.com. We take these matters seriously and thank you for your cooperation", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZWN1cml0eSBDb25zdWx0YW50IiwiY29tcGFueV9uYW1lIjoiU2VhcmNoRWxlY3QgUHRlIEx0ZCIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiUm5PZm1DaFp5MjJMM0czUEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIHwgRmlkYW50byIsImxpbmsiOiJodHRwczovL3NnLmZpZGFudG8uY29tL2pvYnMvam9iLW9wZW5pbmcvc2VjdXJpdHktbWFuYWdlbWVudC1zcGVjaWFsaXN0cy9zZWN1cml0eS1jb25zdWx0YW50LTI3NTIxODg4NT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Application Consultant (Pega)", "company_name": "Central Provident Fund Board", "location": "Singapore (+1 other)", "via": "via NodeFlair", "description": "Information Technology\n\nIT systems form the backbone of our operations. We are looking for individuals with passion and IT expertise, to help us improve the delivery of our systems and services. The Board’s IT systems support a high daily volume of financial transactions for CPF members. In addition to keeping the lights on, the Board also keeps pace with the external environment through innovation in its IT systems.\n\nResponsibilities\n\nYou will be involved in the software development lifecycle activities such as analysis, design, development, implementation and maintenance of Pega platform.\n\nRequirements\n• IT working experience in end-to-end SDLC cycle from requirement gathering, analysis, design, testing and implementation\n• Experience in developing process-based solutions or BPM (Business Process Management)\n• Experience in various rules and features i.e. flows, activities, user interface, flow actions, SLA, correspondence, Single Sign-On, SOAP services, etc\n• Familiarity in Java... J2EE, relational database (DB2/Oracle) and DevOps preferred\n• Certified in PEGA CLSA would be a plus\n• Strong collaboration, prioritization and adaptability skills\n• Position will be on a 2-year contract\n• Candidates with no working experience may apply\n\nAll applicants will be notified on whether they are shortlisted or not within 4 weeks of the closing date of this job posting", "extensions": ["Over 1 month ago", "Contractor"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Contractor"}, "job_id": "eyJqb2JfdGl0bGUiOiJBcHBsaWNhdGlvbiBDb25zdWx0YW50IChQZWdhKSIsImNvbXBhbnlfbmFtZSI6IkNlbnRyYWwgUHJvdmlkZW50IEZ1bmQgQm9hcmQiLCJjb21wYW55X21pZCI6Ii9tLzA2MTVxYiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IlJiaV92RDRUOHRyVzRkakhBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVvc0NDc3dCUVU1VlgwNXhVVzVYVm14S1FuUTBlRU5CWDFCcGMzbFVTRXc0VHpsUWNsZDBkR1Y0YTFVNWRFZFlVbWx6WkVwUlYwaFRhMEZTTXpCR1dYcGxiRVZ4YzFwMVJFOURhbVZaY1ROcVkyeGFjRlpHY0RGelJGUk9WemxKVFRWWmVucFFkemQ0YTNndGRVNHRTbFpYZUdOSVpuSkROMFZOZVUwNFdGUlVNRmRxV1MxQ2R6UnBiMkZFU0VOd2VVNXFhWHBIU0RSS1QzQjNlWEZ5UVVwWGRHOWpXalZ5VjNwRk5WcGlUVk5MWmtoV05IRmtUMHMyUlVOck0yRlpaWGRVTFd0cmVYWmhZV3d0UVdvd1VuUTJFaFp4Ym5GRFdVcHhja3RaYVVSMFVXRllha3B5VVVKbkdpSkJUMDFaVW5kQ1JHSnJUelpOTVhKTVdXeHFZbEJCTkhadFoxaEZhMG80TUVGbiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzU1IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE5vZGVGbGFpciIsImxpbmsiOiJodHRwczovL25vZGVmbGFpci5jb20vam9icy9saXN0aW5ncy83MTkwP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Talent Assessment and Experience, Senior Consultant - HR Consulting", "company_name": "Marsh & McLennan", "location": "Singapore", "via": "via Bayt.com", "description": "At Mercer, we believe in building brighter futures. Together, we’re redefining the world of work, reshaping retirement and investment outcomes, and unlocking real health and well-being. We do this by understanding data and applying it with a human touch across a dynamic Health, Wealth and Career business portfolio. For 75 years, our employees have been turning ideas into action to build healthier and more sustainable futures for our clients, colleagues and communities and people.\n\nTo strengthen our growing business in Singapore, we are looking for talent to join our Talent Solutions business, as an Talent Assessment and Experience Senior Consultant - HR Consulting\n\nMercer Talent Solutions business: Mercer Singapore’s Talent Solutions business helps clients navigate the Future of Work. With the strongest Workforce Products & Insights database the market, we bring Reward and Talent expertise together to improve the way work works – from organization design, to strategic workforce... planning, to identifying future work, skills needed, skill-gaps, action plans for transformation, to performance and total rewards.\n\nTalent Assessment and Experience Senior Consultant - HR COnsulting\n\nOur Culture: Entrepreneurial, Data-hungry, Curious, Energetic and Ambitious\n\nSkills we really care about: Problem-Solving, Creative Thinking, Collaboration, Adaptability\n\nWhat can you expect ?\n• Lead sales and client engagement in talent assessment, employee experience and engagement\n• Provide thought leadership by developing points-of-view and opinion papers as well as research efforts relevant to those areas.\n• Support client engagement and project delivery in other complementary areas, as needed\n\nWe will count on you to\n• Develop assessment strategies, including value differentiators, go-to-market plans and channel management plans for Mercer’s solutions in the practice area\n• Lead business development efforts including the generation of leads and engagement with prospects, build a strong and sustainable business development pipeline\n• Lead proposal shaping, solution design fit to client needs and nurture upselling/ cross-selling client opportunities\n• Lead, direct and guide consulting engagements by providing appropriate guidance to project teams to deliver client value\n• Manage projects to time, quality, budget while building team skills\n• Support team engagement and well-being, build a high performing team\n\nWhat You Need To Have\n• 8-10 years’ experience in HR consulting across various domains such as Talent Management, Assessment, Performance, OD\n• Deep expertise in Talent Assessment, Psychometrics, building upskilling plans and project management\n• Led small and large HR consulting and products sales\n\nWhat Makes You Stand Out\n• Thrive in problem-solving, shaping solutions, understanding and solving for client needs\n• Drive a positive, constructive, engaging work and high-performance culture by espousing appropriate behaviors and inspiring others in the team to do likewise\n• Take ownership in the career development needs and champion the professional development of consultants in the team\n• Champion change management efforts for strengthening Mercer’s overall business and financial performance\n\nAbout Mercer\nMercer builds brighter futures by redefining the world of work, reshaping retirement and investment outcomes, and unlocking real health and well-being. Mercer’s employees are based in 44 countries and the firm operates in over 130 countries. Mercer is a business of Marsh & McLennan (NYSE: MMC), the world’s leading professional services firm in the areas of risk, strategy and people, with 75,000 colleagues and annualized revenue approaching $17 billion. Through its market-leading businesses including Marsh, Guy Carpenter and Oliver Wyman, Marsh & McLennan helps clients navigate an increasingly dynamic and complex environment. For more information, visit www.mercer.com. Follow Mercer on Twitter @Mercer", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJUYWxlbnQgQXNzZXNzbWVudCBhbmQgRXhwZXJpZW5jZSwgU2VuaW9yIENvbnN1bHRhbnQgLSBIUiBDb25zdWx0aW5nIiwiY29tcGFueV9uYW1lIjoiTWFyc2ggXHUwMDI2IE1jTGVubmFuIiwiY29tcGFueV9taWQiOiIvbS8wNTNydyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Imk2U3hOQTRwMkZNS1R3WkhBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2WUJDcmNCUVU1VlgwNXhWREJPWkVsM1NGTTFiVzU0VTFWYUxUUkZObUphV1ZaYVltSTJPRGwwV0hOb1VuSkNlbE5LTjBReWJYZDBVakpSVVRaNVJsbFdjVmhRYVVoeWVISm9SVFZ6YzI1QlRsUnZNRXgyYW5SblVtNUZaMUJLU0hKeFpYZG9SMWR6VG5KbFowNXVSVTVNTFhSV2VYaFlla0UwYjJJM1VrcGxXak5WZEdWM1JqRmlObUl6TlRWQ1RYQkVaSE5yVm5Fd1JGZG5jM2xoZFRCTU15MU9lV3MwYjFCVVgwODBOWEl4YkRoTGVFbDRObFl3Y1c0NEVoWnhibkZEV1VweGNrdFphVVIwVVdGWWFrcHlVVUpuR2lKQlQwMVpVbmREZUZBeGFIcHRZbDlZTFdobmNrVnhaWFZSWVU5clRHSjZPVEJCIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNjMiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQmF5dC5jb20iLCJsaW5rIjoiaHR0cHM6Ly93d3cuYmF5dC5jb20vZW4vc2luZ2Fwb3JlL2pvYnMvdGFsZW50LWFzc2Vzc21lbnQtYW5kLWV4cGVyaWVuY2Utc2VuaW9yLWNvbnN1bHRhbnQtaHItY29uc3VsdGluZy01OTAxNDYwOS8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Business Operations", "value": "GC06"}, {"text": "Human Resources", "value": "GC15"}, {"text": "Accounting and Finance", "value": "GC01"}, {"text": "Sales and Retail", "value": "GC26"}, {"text": "Protective Services", "value": "GC23"}, {"text": "Science and Engineering", "value": "GC27"}, {"text": "Management", "value": "GC18"}, {"text": "Advertising and Marketing", "value": "GC03"}, {"text": "Legal", "value": "GC17"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Customer Service", "value": "GC10"}, {"text": "Social Services and Non-Profit", "value": "GC28"}, {"text": "Art, Fashion and Design", "value": "GC05"}, {"text": "Healthcare", "value": "GC14"}, {"text": "Energy and Mining", "value": "GC21"}, {"text": "Sports Fitness and Recreation", "value": "GC29"}, {"text": "Education", "value": "GC11"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "Consultant", "value": "consultant"}, {"text": "Senior consultant", "value": "senior consultant"}, {"text": "Security consultant", "value": "security consultant"}, {"text": "Recruitment consultant", "value": "recruitment consultant"}, {"text": "Lead consultant", "value": "lead consultant"}, {"text": "Associate consultant", "value": "associate consultant"}, {"text": "Principal consultant", "value": "principal consultant"}, {"text": "Associate", "value": "associate"}, {"text": "Financial consultant", "value": "financial consultant"}, {"text": "Functional consultant", "value": "functional consultant"}, {"text": "Presales consultant", "value": "presales consultant"}, {"text": "Technical consultant", "value": "technical consultant"}, {"text": "Application consultant", "value": "application consultant"}, {"text": "Devops consultant", "value": "devops consultant"}, {"text": "Pre-sales consultant", "value": "pre-sales consultant"}, {"text": "Consultants", "value": "consultants"}, {"text": "Development consultant", "value": "development consultant"}, {"text": "Engineer", "value": "engineer"}, {"text": "Hr consultant", "value": "hr consultant"}, {"text": "It consultant", "value": "it consultant"}, {"text": "Senior", "value": "senior"}, {"text": "Services consultant", "value": "services consultant"}, {"text": "Solution consultant", "value": "solution consultant"}, {"text": "Solutions consultant", "value": "solutions consultant"}, {"text": "Business", "value": "business"}, {"text": "Business consulting", "value": "business consulting"}, {"text": "Consulting", "value": "consulting"}, {"text": "Director", "value": "director"}, {"text": "Education consultant", "value": "education consultant"}, {"text": "Hcm consultant", "value": "hcm consultant"}, {"text": "Infrastructure", "value": "infrastructure"}, {"text": "Investment consultant", "value": "investment consultant"}, {"text": "Manager", "value": "manager"}, {"text": "Project manager", "value": "project manager"}, {"text": "Recruitment consultants", "value": "recruitment consultants"}, {"text": "Sap consultant", "value": "sap consultant"}, {"text": "Software engineer", "value": "software engineer"}, {"text": "Specialist", "value": "specialist"}, {"text": "Support consultant", "value": "support consultant"}, {"text": "Systems consultant", "value": "systems consultant"}, {"text": "Technology consulting", "value": "technology consulting"}, {"text": "Academy", "value": "academy"}, {"text": "Accountant", "value": "accountant"}, {"text": "Architect", "value": "architect"}, {"text": "Cloud consultant", "value": "cloud consultant"}, {"text": "Consultancy", "value": "consultancy"}, {"text": "Data engineer", "value": "data engineer"}, {"text": "Deputy director", "value": "deputy director"}, {"text": "Electrical engineer", "value": "electrical engineer"}, {"text": "Employee", "value": "employee"}, {"text": "Finance consultant", "value": "finance consultant"}, {"text": "Financial services", "value": "financial services"}, {"text": "Gastroenterologist", "value": "gastroenterologist"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Internship", "value": "INTERN"}, {"text": "Part-time", "value": "PARTTIME"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Accounting", "value": "/business/naics2007/5412"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Engineering Services", "value": "/business/naics2007/5413"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Real Estate", "value": "/business/naics2007/53"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Wholesale", "value": "/business/naics2007/42"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "SingTel", "value": "/m/020zfl"}, {"text": "EY", "value": "/m/0g9jc"}, {"text": "Infosys", "value": "/m/01k8x6"}, {"text": "SearchAsia Consulting Pte Ltd", "value": "/g/11fy260nhz"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "Deloitte SEA", "value": "/g/11f_g4x9d_"}, {"text": "Geco Asia", "value": "/g/11gk72_bt_"}, {"text": "OAKTREE CONSULTING", "value": "/g/11g70jfhtq"}, {"text": "Central Provident Fund Board", "value": "/m/0615qb"}, {"text": "NCS", "value": "/m/0282746"}, {"text": "Trustwave", "value": "/m/0n3xjf5"}, {"text": "Ensign InfoSecurity", "value": "/g/11g4jhymjr"}, {"text": "HCL SINGAPORE PTE. LTD.", "value": "/g/11fy25ngsv"}, {"text": "Horangi", "value": "/g/11fm41wdh3"}, {"text": "LINKBYNET", "value": "/g/11f00s44gb"}, {"text": "NTT", "value": "/m/05mybp8"}, {"text": "RECRUIT EXPRESS PTE LTD", "value": "/g/11g706hzhq"}, {"text": "Randstad", "value": "/m/08pt1z"}, {"text": "Randstad Singapore", "value": "/g/11g70b50mr"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "UBS", "value": "/m/031rxp"}, {"text": "Xcellink Pte Ltd", "value": "/g/11c73prcqy"}, {"text": "Alight", "value": "/g/11fj9r012s"}, {"text": "Avanade", "value": "/m/094456"}, {"text": "Avensys Consulting", "value": "/g/11g7022gjf"}, {"text": "CBRE", "value": "/m/090r7m"}, {"text": "Golder", "value": "/m/02qx9bq"}, {"text": "Hitachi Solutions", "value": "/g/121lyvj9"}, {"text": "IBM", "value": "/m/03sc8"}, {"text": "Marsh & McLennan", "value": "/m/053rw"}, {"text": "Mott MacDonald", "value": "/m/043l4j"}, {"text": "NTT Ltd.", "value": "/m/01c3fq"}, {"text": "Qualtrics", "value": "/m/080nnft"}, {"text": "SAP", "value": "/m/01pf4l"}, {"text": "Techcom Solutions Pte Ltd", "value": "/g/11c73vztx3"}, {"text": "Turner & Townsend", "value": "/m/0cfy6xp"}, {"text": "Thatz", "value": "/g/11dxpx4g1l"}]}]}