{"search_metadata": {"id": "608279c529d1772a590e9a56", "status": "Success", "json_endpoint": "https://serpapi.com/searches/6b5ab7dffe4bdc68/608279c529d1772a590e9a56.json", "created_at": "2021-04-23 07:39:49 UTC", "processed_at": "2021-04-23 07:39:49 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28data+scientist%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=70", "raw_html_file": "https://serpapi.com/searches/6b5ab7dffe4bdc68/608279c529d1772a590e9a56.html", "total_time_taken": 7.41}, "search_parameters": {"q": "(data scientist) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "70"}, "jobs_results": [{"title": "LECTURER - DATA SCIENCE & ARTIFICIAL INTELLIGENCE (AI) (FIXED-TERM)", "company_name": "Ngee Ann Polytechnic", "location": "Singapore (+1 other)", "via": "via Neuvoo", "description": "Roles & Responsibilities\n\nAt least 3 years of relevant work experience in the implementation of Data Science, Data Analytics and/or AI solutions. Proficient in Analytical Programming using Python and/or other related programming languages. Experience in Data Analytics platforms such as Tableau, Power BI and CRISP-DM or SEMMA framework or Deep Learning frameworks such as TensorFlow or PyTorch. Ability to apply Machine Learning, Deep Learning and/or Reinforcement Learning using large-scale real-world data. Knowledge of Data Ops or Robotic Process Automation (RPA) will be an advantage Candidates are required to perform the following tasks for our full-time and part-time course offerings:\n• Design and develop curriculum, facilitate student learning, supervise projects, conduct assessments and perform associated tasks for modules related to Data Analytics, Data Engineering, Machine Learning, Deep Learning and other ICT related modules;\n• Support student development in areas of Education... and Career Guidance;\n• Solicit internship opportunities with industry partners and supervise student internships; and\n• Participate in ad hoc projects pertaining to academic enhancement, student development, publicity and outreach and Continuing Education and Training (CET).\n\nCheck out the details of the position and submit online at Careers@Gov. Be part of an institution with that something xtra.\n\nTell employers what skills you have\n\nAnalysis\nBusiness Strategy\nCurriculum Design\nData Analysis\nE-Learning\nEnglish\nHigher Education\nLeadership\nLecturing\nManagement\nMatlab\nProgramming\nProject Management\nPublic Speaking\nQualitative Research\nResearch\nScience\nStatistics\nTeaching\nUniversity Teaching", "extensions": ["14 days ago", "Full–time"], "detected_extensions": {"posted_at": "14 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJMRUNUVVJFUiAtIERBVEEgU0NJRU5DRSBcdTAwMjYgQVJUSUZJQ0lBTCBJTlRFTExJR0VOQ0UgKEFJKSAoRklYRUQtVEVSTSkiLCJjb21wYW55X25hbWUiOiJOZ2VlIEFubiBQb2x5dGVjaG5pYyIsImNvbXBhbnlfbWlkIjoiL20vMDU0NTF5IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiUTJnemJzSHM5OGE5ZzgwYkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZZQkNyY0JRVTVWWDA1eFV5MUpWMnRMVEhCQ2RGcDJkQzE0VWxOcVRWaFhUa053YVRGNVRXcHNiMWR2VEZndGFsbE9NRWQ2V0ROcFIyTTBiRWh2Um5CNWVXNWZMV2t4ZWtneFFYWkZiMXByWDBWTVNWOVZOVk5PVDBOVE5HSmlka2hQVUdsSVVGaGljR0p1VkdnM1ZFSXRhbmQwT1VWdVdVZEhWVkpRVWpkUVdWWm5hRmhxWjA0elFsTkRaSGt4V0UxeU1GWjZkbGhSV1RkR09VbEhhR2RrWmtKQ1NFSnlSbVF3VDFVdFpYVldRV3RYV1ZCWWJsSndUSEpyRWhaNlNHMURXVWxwYlVGWmVWRmZVV0ZDTWxseVdVTm5HaUpCVDAxWlVuZENTR3hmYlRoVFl6Vm9lbEJMTVRoQ1N5MUZSM1kzVEdSVmNUWlIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY183IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE5ldXZvbyIsImxpbmsiOiJodHRwczovL3NnLm5ldXZvby5jb20vdmlldy8/aWQ9ZWIwZmUzOGJiYzRmXHUwMDI2dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Research Associate - Computer Science-Data Science", "company_name": "Nanyang Technological University", "location": "Singapore (+1 other)", "via": "via Monster", "description": "Job Description :\nA Research Associate position is available at the School of Computer Science and Engineering, Nanyang Technological University, Singapore. The Nanyang Technological University is fast growing. Singapore is also actively pursuing the vision of smart nation. Thus, a plenty of opportunities for future long-term career are available.\nKey Responsibilities:\nThe Research Associate will be conducting research and development in the area of spatiotemporal and graph data mining and learning.\nThe Research Associate will be researching, designing and developing models and algorithms for mining spatiotemporal and graph data.\nJob Requirements\n• Master degree in Computer Science and Data Science discipline\n• Research and development experience on spatiotemporal and graph data\n• Programming skills and good knowledge and experience on Software Engineering are an asset\n• English writing and speaking skills\n\nWe regret that only shortlisted candidates will be notified.Hiring... Institution: NTU", "extensions": ["25 days ago", "Full–time"], "detected_extensions": {"posted_at": "25 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJSZXNlYXJjaCBBc3NvY2lhdGUgLSBDb21wdXRlciBTY2llbmNlLURhdGEgU2NpZW5jZSIsImNvbXBhbnlfbmFtZSI6Ik5hbnlhbmcgVGVjaG5vbG9naWNhbCBVbml2ZXJzaXR5IiwiY29tcGFueV9taWQiOiIvbS8wbDQ5ayIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Ik5rdWFKZ2RlVGtDRUxGV3hBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVxRUNDdUlCUVU1VlgwNXhVbGd5Tm1aTVpEbDFXR1p4Tm1oUll6bHdSMlZOY1c5RVpHVkhMVTF1V25SSVZYWkJabXhvVVRkUGF6bE1OM3B1TkY5V1JUbHlRMWRqY1RKTWVURlFVRVV5UlVkVE1qRmpNMnRzTVhkNVJ6SnJkalZFTVZONFpXSTBhak5FVWpNd1VUY3RkbnBGVGs0emFrdDRhWFoyVDFJd05uTjZTa2hZTlZOVGFXUTNTMUZYU2pWWGJURnpPRUV5YVhSUVVISndUVTlFVEZkNlNEQk9UWFJCWW5GQmRETkdXblZPUlRWbWRVOWtZbXg1VVZaaVZVMDFaVE5aUzJ4VlVucGhaWEpFUkZRNGVGQXdaRE00U0ZVd05FNVZiMWRYZDNCYVN6ZEtaMVpJZHhJV2VraHRRMWxKYVcxQldYbFJYMUZoUWpKWmNsbERaeG9pUVU5TldWSjNRMDU0VUdGRFJubEJhRTVGWTNocGVsZFdPRTVGZFZSUE9IQkhRUSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzE1IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1vbnN0ZXIiLCJsaW5rIjoiaHR0cHM6Ly93d3cubW9uc3Rlci5jb20uc2cvYW1wL2pvYi12YWNhbmN5LXJlc2VhcmNoLWFzc29jaWF0ZS1jb21wdXRlci1zY2llbmNlLWRhdGEtc2NpZW5jZS1uYW55YW5nLXRlY2hub2xvZ2ljYWwtdW5pdmVyc2l0eS1zaW5nYXBvcmUtMjY3MjY0NTkuaHRtbD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Data Scientist- Consultant", "company_name": "Charterhouse Partnership Singapore, EA Licence No: 16S8066", "location": "Singapore", "via": "via Laimoon.com", "description": "Reporting into the head of AI & Solutions, the individual will play a key role in applying data science methods and analytics into solving practical problems and identifying business opportunities.\n\nYou will be responsible for:\n• Translating customer pain-points into problem statements, architect analytics solution, and engagingly present results and learnings to both technical and non-technical audiences.\n• Develop and manage entire end-to-end lifecycle of scoping of data inputs, data cleaning and pre-processing, feature engineering, building models, deploying to production and improving models by iterations\n• Build and deploy highly valuable, efficient, scalable advanced analytics models in production systems\n• Design and develop sophisticated visualizations and dashboards to explain the actionable insights\n• Work closely with project manager and technical leads to provide regular status reporting and support them to refine issues/problem statements and propose/evaluate relevant... analytics solutions\n\nTo be successful, individual must possess:\n• A recognized degree in Computer Science, Mathematics, Engineering, or a Quant subject\n• Experience data scientist with at least 3 years of relevant experience\n• Expertise in Python/R, Apache Spark (or similar scripting language) coding capability to operationalize data analytics workflows & processes\n• Experience in data visualisation tools and libraries such as Tableau, Qlik, Shiny Plotly, ggplot2, etc\n• Experience in machine learning model management and deployment tools using containerisation (Docker, Kubernetes)\n• You have experience in bringing automation and data quality together with model operationalization.\n• You have experience in developing AI/Deep Learning Solution-Deep understanding on distributed computing and skilled on various linux command related to data processing.\n• Strong communication skill to present insights with data\n\nOnly successful candidates will be notified.\n\nFor interested applicants, kindly send your updated resume to marieg@charterhouse.com.sg.\n\nEA License No: 16S8066 | Registration No. R1331783\n\nConsultancy", "extensions": ["17 days ago", "Full–time"], "detected_extensions": {"posted_at": "17 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEYXRhIFNjaWVudGlzdC0gQ29uc3VsdGFudCIsImNvbXBhbnlfbmFtZSI6IkNoYXJ0ZXJob3VzZSBQYXJ0bmVyc2hpcCBTaW5nYXBvcmUsIEVBIExpY2VuY2UgTm86IDE2UzgwNjYiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Inh1VG5XMElwaHcxSEFxTC1BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGFpbW9vbi5jb20iLCJsaW5rIjoiaHR0cHM6Ly9qb2JzLmxhaW1vb24uY29tL2pvYnMvZXh0ZXJuYWx2aWV3LzIzMzE5NTU3P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Machine Learning Engineer (Recommendation), TikTok e-Commerce", "company_name": "TikTok", "location": "Singapore", "via": "via Bayt.com", "description": "TikTok is the leading destination for short-form mobile video. Our mission is to inspire creativity and bring joy. TikTok has global offices including Los Angeles, New York, London, Paris, Berlin, Dubai, Mumbai, Singapore, Jakarta, Seoul and Tokyo. About our team\nWe are a group of applied machine learning engineers and data scientists that focus on e-Commerce recommendations. We are developing innovative algorithms and techniques to improve user engagements and satisfaction, converting creative ideas into business-impacting solutions. We are interested and excited in applying large scale machine learning to solve various real-world problems in e-Commerce. Responsibilities\n1. Participate in building large-scale (10 million to 100 million) e-Commerce recommendation algorithms and systems, including commodity recommendations, live stream recommendations, short video recommendations etc in TikTok.\n2. Build long and short term user interest models, analyze and extract relevant information... from large amounts of various data and design algorithms to explore users' latent interests efficiently.\n3. Design, develop, evaluate and iterate on predictive models for candidate generation and ranking (e.g. Click Through Rate and Conversion Rate prediction), including but not limited to building real-time data pipelines, feature engineering, model optimization and innovation.\n4. Design and build supporting/debugging tools as needed.\n1. Bachelor's degree or higher in Computer Science or related fields. 2. Strong programming and problem-solving ability. 3. Experience in applied machine learning, familiar with one or more of the algorithms such as Collaborative Filtering, Matrix Factorization, Factorization Machines, Word2vec, Logistic Regression, Gradient Boosting Trees, Deep Neural Networks, Wide and Deep etc. 4. Experience in Deep Learning Tools such as Tensorflow/Pytorch.\n5. Experience with at least one programming language like C++/Python or equivalent. Preferred Qualifications\n1. Experience in recommendation system, online advertising, information retrieval, natural language processing, machine learning, large-scale data mining, or related fields.\n2. Publications at KDD, NEURIPS, WWW, SIGIR, WSDM, ICML, IJCAI, AAAI, RECSYS and related conferences/journals, or experience in data mining/machine learning competitions such as Kaggle/KDD-cup etc", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJNYWNoaW5lIExlYXJuaW5nIEVuZ2luZWVyIChSZWNvbW1lbmRhdGlvbiksIFRpa1RvayBlLUNvbW1lcmNlIiwiY29tcGFueV9uYW1lIjoiVGlrVG9rIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJQYUYzM21mc1dOWEE5V2xHQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJheXQuY29tIiwibGluayI6Imh0dHBzOi8vd3d3LmJheXQuY29tL2VuL3NpbmdhcG9yZS9qb2JzL21hY2hpbmUtbGVhcm5pbmctZW5naW5lZXItcmVjb21tZW5kYXRpb24tdGlrdG9rLWUtY29tbWVyY2UtNTgzNTQ4MTYvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Data Scientist (BB-E9AA2)", "company_name": "DUN & BRADSTREET (SINGAPORE) PTE. LTD.", "location": "Singapore (+1 other)", "via": "via BeBee", "description": "Roles & ResponsibilitiesDun & Bradstreet (S) Pte Ltd is looking for a passionate certified Data Scientist. The successful candidate will turn data into information, information into insight and insight into business decisions.Responsibilities: Provide data analytics planning and strategy that involves data analytics visioning and road mapping, business case development, implementation planning, organizational planning, budget and risk management planning. Gather and document business requirements from business stakeholders, scope the problem and develop business case to transform data into critical information and knowledge that are essential for policy making and streamlining operations. Perform data cleaning, pre-processing and feature engineering that will aid in the process of meaningful analysis. Design predictive modelling and credit risk management solution. Monitor and design dashboards and interactive visualization for customer solution delivery. Present data insights to... business users and stakeholders. Work with stakeholders to ensure smooth deployment and adoption of new solution To succeed in this role, you are likely to have the following attributes : Diploma / Degree in Mathematics, Statistics, Business Analytics, Computer Science, Information Systems or related fields. Proficiency in Business Intelligence (BI) tools, such as Power BI, Tableau or other BI softwares. R Language / Python for statistical modelling and machine learning. Competent in SQL to query databases. Possess good communication and presentation skills to explain the findings to business stakeholders. Possess strong logical reasoning and analytical skills to merge statistical insights with business realities.Tell employers what skills you haveBusiness CaseDataData AnalysisData MiningDevelopmentHadoopJavaMachine LearningPythonRSchedulingStatisticsinsightData analysespassionateimplementation planning", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEYXRhIFNjaWVudGlzdCAoQkItRTlBQTIpIiwiY29tcGFueV9uYW1lIjoiRFVOIFx1MDAyNiBCUkFEU1RSRUVUIChTSU5HQVBPUkUpIFBURS4gTFRELiIsImNvbXBhbnlfbWlkIjoiL2cvMTFnOW1wcDJwaCIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IkN3dC1FWkY1VGtwYUtCOHlBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVyWUNDdmNCUVU1VlgwNXhWRE14U1doWlVqSkNRMjF6VVhwMWQxcG5SVzVSVVVWaGNtRjBNblZYYVdnNE0zQkpXblZ5ZG5wTlJUaEdkVFYzYjNWUmIyOXlZVmxLVjBsemFubERWa1JUVGkxUlkxTnpSRGxsWVZsRFZ6ZEZiaTAwWDFoSlYwdzBNMjAzT0ZwVWJISnhOWGhoVTNCclltdGlUM3BVYURReFUybFNUbGhvYW14NFgyZEliMWxpTWs1dmJEUnVhRVF3Um0xWVFWSnpXbW93V0VOclJrRlRWMEZKY1Vzd1pubE9aMmcyTlRWUE5UUXlWUzF1Y0dSeWRHVnZiMWRMWmtKRU4xZDZUWEZTZFhCclZXWklkRGt0U1Y5SU5EbG1ibXhIUmpReGJUVXhURFp3YUZSNGFUUkJlRlZKVlRGSmNsVnFSa1EwYzAxUFVSSVdla2h0UTFsSmFXMUJXWGxSWDFGaFFqSlpjbGxEWnhvaVFVOU5XVkozUkhka1JVUkdaamRVVURjNWRrUjVUMWRoWlRGa1RrVkdWVFJCZHciLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18zMCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCZUJlZSIsImxpbmsiOiJodHRwczovL3NnLmJlYmVlLmNvbS9qb2IvMjAyMTA0MTctODY2Yjg3OWQxZWU3MTc2NDM4N2YxNTdiZWQ2ZTlhYTI/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Associate - Data Analyst - Operations Intelligence - Data Science - SG Consumer Banking Operations - Technology and Operations - WD21106", "company_name": "Dbs Bank Ltd.", "location": "Singapore", "via": "via Monster Singapore", "description": "Business Function\n\nGroup Technology and Operations (T&O) enables and empowers the bank with an efficient, nimble and resilient infrastructure through a strategic focus on productivity, quality & control, technology, people capability and innovation. In Group T&O, we manage the majority of the Bank's operational processes and inspire to delight our business partners through our multiple banking delivery channels. Operations Intelligence (OI) under SG Consumer Banking Operations, enables Operations to make data-driven decisions for proactive management of service, productivity, and risk.\n\nResponsibilities\n• Collaborate with cross-functional teams/stakeholders to identify opportunities, gather requirements and prioritize actionable insights through application of Machine Learning (ML) /Deep Learning (DL) Models to solve complex problems for proactive management of service, productivity, and risk.\n• Responsible for full AI/ML model life cycle management, industrialisation and... operationalisation including data gathering, development, model training, deployment, monitoring and performance optimization using ADA platform and tools.\n• Closely partner stakeholders to design experiments, perform data iterations and present/share the results of the data with relevant stakeholders (e.g. Management, squad members) in an easily digestible format.\n• Provide analytics support for different purposes such as managing digital exceptions during production issues, improving productivity and mitigating risks.\n• Good Business knowledge in ‘connecting the dots’ from the data to solving business problems using, but not limited to, classification, regression, clustering and deep learning algorithms\n• Ability to understand the business operations as a whole and translate questions into effective analysis\n• Innovate to deal with data imperfections; data munging and using algorithms to efficiently organize large data sets.\n• Design and build automated reporting dashboards on our data visualization platforms\n\nRequirements\n• Minimally University degree in mathematics, applied statistics, data mining, machine learning, computing or related quantitative discipline with a strong background in statistical concepts and calculations\n• At least 2 years of experience in model development, validation and testing, deployment and model performance monitoring.\n• Good understanding of statistical and predictive modelling concepts, machine learning approaches, NLP concepts and deep learning\n• Strong programming and modelling skills in the following:\n• Python, Pyspark, Spark SQL, MySQL\n• Hadoop eco-system (Hive, HDFS, Pig etc.)\n• Data engineering pipeline experience including real time data computation\n• End to end data science workflow experience, starting from data extraction, wrangling, modelling and deployment in production environment\n• Deep and practical understanding on implementing high performance, well-behaved analytics applications; data ingestion, feature engineering, model selection, training, validating and deployment\n• Experience manipulating structured and unstructured data sources for analysis\n• Familiar with the use of Qlikview/ Tableau for both development and insights reporting.\n• Business Knowledge or prior experience in the consumer banking area would be advantageous\n\nCore Competencies\n• Strong combination of analytical skills, intellectual curiosity, and with a strong appetite for challenges\n• Highly adaptable with big data technologies, able to pick up new methods and techniques quickly and apply towards solving a problem at hand\n• Comfortable working in a fast paced, hypothesis driven, collaborative, and iterative engineering environment\n• Comfortable deconstructing complex/open-ended problems which may not yield a clear-cut solution\n• Meticulous and structured individual with good time management to oversee/ manage or prioritize multiple deliverables\n• Integrity and maturity to manage the sensitivity of data\n• Excellent written and verbal communication skills\n• Good team player with the ability to work collaboratively as part of a squad while maintaining the ability to work independently in carrying out tasks to completion aligned to original goals with minimal supervision\n\nRequirements (Nice to have)\n• Experience on Cloud computing platform.\n• Experience on Data Science Workbench (Cloudera, AWS)\n• Exposure to McKinsey’s problem solving techniques, analytics translator.\n\nApply Now\n\nWe offer a competitive salary and benefits package and the professional advantages of a dynamic environment that supports your development and recognises your achievements", "extensions": ["8 days ago", "Full–time"], "detected_extensions": {"posted_at": "8 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBc3NvY2lhdGUgLSBEYXRhIEFuYWx5c3QgLSBPcGVyYXRpb25zIEludGVsbGlnZW5jZSAtIERhdGEgU2NpZW5jZSAtIFNHIENvbnN1bWVyIEJhbmtpbmcgT3BlcmF0aW9ucyAtIFRlY2hub2xvZ3kgYW5kIE9wZXJhdGlvbnMgLSBXRDIxMTA2IiwiY29tcGFueV9uYW1lIjoiRGJzIEJhbmsgTHRkLiIsImNvbXBhbnlfbWlkIjoiL20vMDFxN241IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiaElvTDd0YjFOZ20tSmVvY0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFVUbEJibkZSUW5sV1h6ZEZiMjlKYVVGamRuTnlaRWhWVEhwZlRGOVNTbU4wTlhsdFYza3llWEJ6YVVoemRFUm9aRmxyVVc5dFVITlFjbFpoTkdaakxVWm1MVEJvVUVwQ04weHlNVTV0YUZjdGVIVkVSMUp4TTE5UFkyWkJOME5yYW1oTmVsRm1kbW8wY1V4VFlWWktTWEpRYkdoNlYwMTVTVVV3VGtFMFJVbG1OalZDYlhKNFgwZGpkMmgyVG04eGNHMVZZamswUzNFMU1EbG5FaFo2U0cxRFdVbHBiVUZaZVZGZlVXRkNNbGx5V1VObkdpSkJUMDFaVW5kRVFWWTFabFI2V0hST1VuRTNTM1ZITmtad05XaFdNM0V0YzJObiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzM3IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1vbnN0ZXIgU2luZ2Fwb3JlIiwibGluayI6Imh0dHBzOi8vd3d3Lm1vbnN0ZXIuY29tLnNnL2FtcC9qb2ItdmFjYW5jeS1hc3NvY2lhdGUtZGF0YS1hbmFseXN0LW9wZXJhdGlvbnMtaW50ZWxsaWdlbmNlLWRhdGEtc2NpZW5jZS1zZy1jb25zdW1lci1iYW5raW5nLW9wZXJhdGlvbnMtdGVjaG5vbG9neS1hbmQtb3BlcmF0aW9ucy13ZDIxMTA2LWRicy1iYW5rLWx0ZC1zaW5nYXBvcmUtMjc3MjU1MzMuaHRtbD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior Machine Learning Engineer", "company_name": "Air Liquide", "location": "Singapore", "via": "via Neuvoo", "description": "Company presentation\n\nALBS is an Air Liquide entity in Kuala Lumpur, regrouping for the APAC scope its Business Service Centers (Kuala Lumpur and Shanghai) as well as the two Global Functions (IT, Digital and Procurement).\n\nDesigned to derive optimal value by better leveraging technology, people and competencies, the ultimate goal is to boost efficiency and deliver outstanding and sustainable performance while keeping a strong focus on customer centricity.\n\nThis Organization is striving for excellence, adopting the Best in Class models to deliver value through simplification and standardization of processes, while adhering to Internal controls and compliance requirements.\n\nEntity and activity description\n\nWe are looking for a senior machine learning engineer who will support our business with insights gained from analyzing company data. The ideal candidate is adept at using large data sets to find opportunities for business optimization and using models to test the effectiveness of... different courses of action. They must have strong experience using a variety of data mining/data analysis methods, using a variety of data tools, building and implementing models, using/creating algorithms and creating/running simulations. They must have a proven ability to drive business results with their data-based insights. They must be comfortable working with a wide range of stakeholders and functional teams. The right candidate will have a passion for discovering solutions hidden in large data sets and working with stakeholders to improve business outcomes\n\nMissions and Responsibilities\n• To lead AI /Machine learning projects for the APAC digital team.\n• Designing and developing machine learning and deep learning systems\n• Running machine learning tests and experiments Implementing appropriate ML algorithms\n• Study and transform data science prototypes\n• Able to support chatbot deployment in countries with software engineer experiences\n• Design machine learning systems\n• Research and implement appropriate ML algorithms and tools\n• Develop machine learning applications according to requirements\n• Select appropriate datasets and data representation methods\n• Run machine learning tests and experiments\n• Perform statistical analysis and fine-tuning using test results\n• Train and retrain systems when necessary\n• Extend existing ML libraries and frameworks\n• Keep abreast of developments in the field\n\nCompetencies and Profile\n• MSc or BSc graduate in Statistics, Mathematics or Computer Science\n• 5 - 7 years of relevant work experience in data science field\n• Proven experience as a Machine Learning Engineer or similar role\n• Understanding of data structures, data modeling and software architecture,Experience using statistical computer languages (R, Python, SLQ, etc.) to manipulate data and draw insights from large data sets.\n• Deep knowledge of math, probability, statistics and algorithms\n• Knowledge of a variety of machine learning techniques (clustering, decision tree learning, artificial neural networks, etc.) ,including Linear Regression, Decision Trees, Random Forest, Deep Learning, etc.\n• Familiarity with machine learning frameworks (like Keras or PyTorch) and libraries (like scikit-learn)\n• Excellent written and verbal communication skills for coordinating across teams.\n• A drive to learn and master new technologies and techniques.\n• Experience visualizing/presenting data for stakeholders\n• Ability to work as part of a distributed team.\n• Ability to utilize and lead interns on projects.\n• Specific Training or Certification; Data Science, R or Python", "extensions": ["10 days ago", "Full–time"], "detected_extensions": {"posted_at": "10 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgTWFjaGluZSBMZWFybmluZyBFbmdpbmVlciIsImNvbXBhbnlfbmFtZSI6IkFpciBMaXF1aWRlIiwiY29tcGFueV9taWQiOiIvbS8wNzl0Z2IiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJFV3BfbE5idl9wZHZKT3FnQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VkdkcVoydFROV0V0TkUxMGVISnRRUzFFWW0xdVgyZE1NVTFSUmpnemEzbGFjMEpxV0RsblptTldTMW95U2xFemVXMXplREZXUjNVeWVGVTRRMVptVW1zd2RXbGpiRXhtT0hodFJWSnZhMWR5VVhscVdYVTJOalZVUzNaTGFEQTRVVFEwZUZGcFgzWmlPRkJoYkRSUFgwNURhRkZCU1c1UFpXWkxSRXRRU0VseGJEZFZWWGQ2VFV0UWFVaFhlSFpIVmxCWlMwVTNlbXByTUd4UkVoWjZTRzFEV1VscGJVRlplVkZmVVdGQ01sbHlXVU5uR2lKQlQwMVpVbmRCWVRFeGMwY3dZamhpTFVwRFRIRXpNbUZWYlU1VkxYQjBaSGQzIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNDQiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTmV1dm9vIiwibGluayI6Imh0dHBzOi8vc2cubmV1dm9vLmNvbS92aWV3Lz9pZD1iMDA2MTQyNDg1OGRcdTAwMjZ1dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Data Scientist - Geo", "company_name": "Shopee", "location": "Singapore (+1 other)", "via": "via Karkidi", "description": "Job Description:\n• Work cross-functionally with business owners/product managers/developers to uncover insights, build state-of-the-art algorithms and geographic based solutions to support e-commerce business.\n• Develop, deploy, and maintain scalable services running machine learning and optimisation models supporting various business directions in Geo (maps, routes and POIs) and Delivery (First and last mile delivery, food delivery etc.).\n• Extract data insights from massive user data sets, explore and leverage open source geographic data to build geographic visualisation tools.\n• Design and conduct data science experimental framework to enable organization-wide data-driven practice.\n• Contribute to team’s innovation and IP creation\n\nRequirements:\n• Master or PhD in Computer Science, Mathematics, Operations Research or relevant fields with minimum 2 years working experience in Maps and Geographic information System, or Logistics and Delivery Industry.\n• Deep understanding in... fundamentals of Machine Learning (especially NLP) and Operations Research, experience in geographic tools such as JOSM, OSRM, QGIS etc. will be preferred.\n• Passionate towards data-driven solutions with strong motivation to learn. Excellent communication skills with the ability to explain and share data insights to stakeholders.\n\nPreferred Qualifications:\n• Relevant experience in Maps and Geographical tools (JOSM, OSRM etc.)\n• Practical experience in building search engines and such as Elasticsearch.\n• Proficient in programming languages such as Java and Golang", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEYXRhIFNjaWVudGlzdCAtIEdlbyIsImNvbXBhbnlfbmFtZSI6IlNob3BlZSIsImNvbXBhbnlfbWlkIjoiL2cvMTFnaDNmazM0ciIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6InlrMUU1bndxVkRYMFZDRmtBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhVMEZoVVZwV1RESjJWMnBFTFc4eGJHOTJOVzF2UVhNeFdXdDBORWxqVVdwVlkxOW5kVGxXU25waWVrVXphbVZDVDFJNE5XeHNSV3gzUVRFM01FeHdWbnBLYTJGMVMwVXlTbWhDVDJWV2JqQkxNVVJKYzFWVVRqRjNNbHBvT1doTVNrazJZMWhSTVRoeFdXWnBYMlJwYkVoRFJsSlVhSFpWUTB0Sk5qWnpVa2w0VTFaVFpuWXhPV2h1WVdKWVYzWjVXWHBJTmxSeloxRnplbUYzRWhaNlNHMURXVWxwYlVGWmVWRmZVV0ZDTWxseVdVTm5HaUpCVDAxWlVuZEVjemczVFVJMFlVRnlYeTEzWlhCVlNsSXdZMll0VUhoSlgydDMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY181MiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBLYXJraWRpIiwibGluayI6Imh0dHBzOi8vd3d3LmthcmtpZGkuY29tL2pvYi1kZXRhaWxzLzExODM/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Machine Learning Engineer - Recommendations Platform", "company_name": "Twitter", "location": "Singapore (+1 other)", "via": "via Bayt.com", "description": "The Position\n\nWho We Are:\n\nTwitter is serving the public conversation, and conversations are happening on Twitter every day about every subject and any event. The Recos Platform team’s job is to connect our users to the conversations and people that are relevant to them.\n\nRecos Platform builds infrastructure and models to support this mission across multiple product areas. We are responsible for the recommendations you see under Search, Explore, Trends, Topics, the Home Timeline. The unrivaled challenges that we face at Twitter are both the data scale and the real-time nature of the product. How do you find the most meaningful content among hundreds of millions of new tweets for hundreds of millions of users every day at Twitter? We build large scale personalized recommendation engines utilizing different kinds of signals such as social network, user activity, and geolocation. We work on machine learning, trend detection, search understanding and retrieval, graph algorithms... recommendation systems, distributed systems, and social graph analysis.\n\nWhat You’ll Do:\n• Improve existing recommendation systems, experiment with new directions and provide ML solutions in recommendation systems within Twitter.\n• Build models and algorithms to understand user interest, user intent, and improve content relevancy.\n• Build features and develop new ranking algorithms.\n• Work closely with live production systems and product teams, and deliver ML solutions at scale within the Twitter tech stack.\n\nQualifications\n\nWho you are:\n\nYou are a machine learning software engineer with a passion for working on exciting algorithmic and deep infrastructure issues in ML environments. More specifically, you are doing the following kind of Machine Learning work:\n• Thrive on working in concert with other smart people, including from distributed offices.\n• Communicate fluidly, at the level of your audience, and seek to understand and be understood.\n• Have the ability to take on complex problems, learn quickly, iterate, and persist towards a good solution.\n• Take pride in polishing and supporting our products.\n• In the role, you are employing a basic understanding of one or more of these concepts: Information Retrieval, Recommendation Systems, Social Network Analysis.\n• You regularly verify the performance & correctness of the implementations of ML techniques. You are able to triage and fix bugs/issues when they arise.\n\nRequirements:\n• We are currently looking for candidates across the board with a BS, MS or PhD in Computer Science, to Staff level candidates with 5+ years of experience.\n• Fluent in one or more languages like Java, Scala, C++, Python\n• Experience with offline and online data processing frameworks\n• Knowledgeable of core CS concepts such as common data structures and algorithms\n• Comfortable conducting design and code reviews\n\nCompany Description\n\nTwitter serves the public conversation because conversation is a force for good in the world. The opportunity to help the world connect, debate, learn, and solve problems is what draws us to careers at Twitter, and it’s what keeps us here", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJNYWNoaW5lIExlYXJuaW5nIEVuZ2luZWVyIC0gUmVjb21tZW5kYXRpb25zIFBsYXRmb3JtIiwiY29tcGFueV9uYW1lIjoiVHdpdHRlciIsImNvbXBhbnlfbWlkIjoiL20vMGhuMXZjZyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Il9wd2FjemhEYlVvVjhiZVVBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhVV1kxYW13M2RURTJiRWx0T0ZkSlluQlZhR0ZQVEROS1RHdDZNbXRsVW0xNWVHcEdVWGRNVDB0SVREbHROVUo2WDNsV1JubHFjMFJXZDNCSE0xZFhRbUV0VFdKcGJuZHpNVkZSYW5kZk5YcERhVmQyZFVaZkxXNWhUazR4ZVdWRFZsaEdiV1JvZFcxdVZFaElOR295TXpKNmJUTkVVWGwxT1ZwRWMxRklTa0ZUWVMxVlJTMTVWekk1Y1dSUGEwZG5RMGRzV1hkMllqWjBWRjkzRWhaNlNHMURXVWxwYlVGWmVWRmZVV0ZDTWxseVdVTm5HaUpCVDAxWlVuZEVjRUpyVTBveFMySlZTMmwzYWtWek9IVmhRemh1WTIxV01uVjMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY181OSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCYXl0LmNvbSIsImxpbmsiOiJodHRwczovL3d3dy5iYXl0LmNvbS9lbi9zaW5nYXBvcmUvam9icy9tYWNoaW5lLWxlYXJuaW5nLWVuZ2luZWVyLXJlY29tbWVuZGF0aW9ucy1wbGF0Zm9ybS01ODAxMTUwMi8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Machine Learning Engineer Intern", "company_name": "Dathena Science", "location": " (+1 other)", "via": "via Neuvoo", "description": "Dathena Science Dathena is a deep-tech company that brings a new paradigm to data privacy and security solutions. In a world of ever-growing information, regulation, and consumer privacy expectations, enterprises around the globe rely on Dathena to identify, classify and control sensitive data, reduce risks, and enhance data protection framework. Leveraging the power of modern AI technologies, Dathena delivers breakthrough, petabyte-scale solutions with unprecedented accuracy, efficiency and speed that build consumer trust in a digital world and ensure the “privacy and data security protection journey.” Founded in 2016, Dathena continues to grow with its latest round of funding. With offices in Singapore, Bangkok, Geneva, Lausanne, Paris, and New York City, Dathena employs more than 70 people, including the world’s top data scientists and information risk experts. For more information, go to www.dathena.io/.\n\nJob Purpose\n• We are looking for a ML Engineer Intern that will join our R&D... team in Artificial Intelligence to help us optimize and deploy Machine Learning algorithms in production.\n• You will be able to work on challenging big data projects and help us building and improving our products' scalability.\n• Your focus will be to optimize current implementations of ML algorithms.\n• While it is essential that the intern brings efficient and effective behaviour to increase the productivity of the organization, is it also critical that the intern retain the creative spark that drives Dathena’s vision and values.\n• This is an iterative and on-going work.\n\nResponsibilities\n• Support the deployment and release of new projects/integrations working with Big Data team\n• Benchmark different solution approaches and analyse performances.\n• Optimize code and resource usage\n• Get involved in pipeline design\n• Participate in the team's sprints and attend daily stand-ups\n\nSkills & Qualifications\n• Strong programming skills in at least one of Scala/Java/Python.\n• Distributed system experience is needed (Spark, PySpark, Hadoop).\n• Experience with at least one database language (SQL, NoSQL)\n• Experience working with Unix.\n• Basic knowledge in Machine Learning and Statistics is required\n• Software engineering best practices: continuous integration with git, Jira, BitBucket\n• Natural Language Processing experience is a plus.\n• Some knowledge of functional programming is nice to have.\n\nSoft Skills\n• Good oral and written communication skills\n• Time management\n• Interpersonal skills\n• Critical thinking\n• Proactive and interested in the area of data security and governance. This temporary position may be converted into a full-time job. Location: Singapore R&D Office Apply for this job", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJNYWNoaW5lIExlYXJuaW5nIEVuZ2luZWVyIEludGVybiIsImNvbXBhbnlfbmFtZSI6IkRhdGhlbmEgU2NpZW5jZSIsImNvbXBhbnlfbWlkIjoiL2cvMTFkeHByZG42eSIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Ing4X0gwSGkxTHlIUE5LZlJBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2WUJDcmNCUVU1VlgwNXhVa1p6YWtKbmJVTmxSMlZJVmxOcVUzaHdhVjlrTlV4VVkwbGZObk5YTnpOd1dIRXpSazFLT1hWcWJXVTVWMGxNVDNVeFJHMHdRV28xY0VKeFMzcDRNSGhHVjBGR016SnViMEV4WkdNM1FucElZbmg2VVVsaVRpMUdhWEV3Y0hGamVVdDFhV0YzTmtOdFJXNXNRazlJT0Vod2NGaEplbkZFV2tkRGVVOW5VM1JZVDJSNlluWXRaa2M1YlZST1RIRkdNMFF5YUdGaVNHSlFiamx2WmxGYVpYSk1YMjFWU0ZWemRYRkpRVk5WU0dnNEVoWjZTRzFEV1VscGJVRlplVkZmVVdGQ01sbHlXVU5uR2lKQlQwMVpVbmRDT0ZSa1ZrZEtZWEp0YWtKa2FsRjZMVWRKYzFKamRuSlRTbkozIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNjciLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTmV1dm9vIiwibGluayI6Imh0dHBzOi8vc2cubmV1dm9vLmNvbS92aWV3Lz9pZD00OGM2NjQ1YWM1NWVcdTAwMjZ1dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}], "chips": [{"type": "Title", "param": "job_family_1", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Data scientist", "value": "data scientist"}, {"text": "Learning engineer", "value": "learning engineer"}, {"text": "Research associate", "value": "research associate"}, {"text": "Data science", "value": "data science"}, {"text": "Data engineer", "value": "data engineer"}, {"text": "Scientist", "value": "scientist"}, {"text": "Trainer", "value": "trainer"}, {"text": "Associate", "value": "associate"}, {"text": "Data analyst", "value": "data analyst"}, {"text": "Engineer", "value": "engineer"}, {"text": "Officer", "value": "officer"}, {"text": "Project manager", "value": "project manager"}, {"text": "Project officer", "value": "project officer"}, {"text": "Senior", "value": "senior"}, {"text": "Audit", "value": "audit"}, {"text": "Consultant", "value": "consultant"}, {"text": "Consulting", "value": "consulting"}, {"text": "Customer", "value": "customer"}, {"text": "Deputy director", "value": "deputy director"}, {"text": "Lecturer", "value": "lecturer"}, {"text": "Operations engineer", "value": "operations engineer"}, {"text": "Owner", "value": "owner"}, {"text": "Research engineer", "value": "research engineer"}, {"text": "Research scientist", "value": "research scientist"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Specialist", "value": "specialist"}, {"text": "Technical architect", "value": "technical architect"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Internship", "value": "INTERN"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Mining", "value": "/business/naics2007/21"}, {"text": "Research", "value": "/business/naics2007/5417"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Staffing", "value": "/business/naics2007/5613"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "NANYANG TECHNOLOGICAL UNIVERSITY", "value": "/m/0l49k"}, {"text": "Shopee", "value": "/g/11gh3fk34r"}, {"text": "DBS Bank Ltd", "value": "/m/01q7n5"}, {"text": "Michael Page", "value": "/m/04cxldw"}, {"text": "Micron", "value": "/m/02gdqy"}, {"text": "Air Liquide", "value": "/g/11dx9gkdhq"}, {"text": "Apple", "value": "/m/0k8z"}, {"text": "ByteDance", "value": "/g/11ghnfr0sv"}, {"text": "CTES Consulting Pte Ltd", "value": "/g/11jrn4m1xc"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "SEPPIC", "value": "/m/0g558ww"}, {"text": "Standard Chartered", "value": "/m/02hszk"}, {"text": "United Overseas Bank", "value": "/m/04gjd1"}, {"text": "AIR LIQUIDE INDUSTRIAL SERVICES PTE LTD", "value": "/g/11hg55y1rb"}, {"text": "Acronis", "value": "/m/04pjlt"}, {"text": "BIGTAPP PTE. LTD.", "value": "/g/11dxpsg5nn"}, {"text": "Burpple", "value": "/g/11dxps5yv5"}, {"text": "Covance by Labcorp", "value": "/m/03ll59"}, {"text": "DHL", "value": "/m/021086"}, {"text": "DUN & BRADSTREET (SINGAPORE) PTE. LTD.", "value": "/g/11g9mpp2ph"}, {"text": "Dathena Science", "value": "/g/11dxprdn6y"}, {"text": "EasyMile", "value": "/g/11bwh58jhs"}, {"text": "Engine Biosciences Pte. Ltd.", "value": "/g/11gxm8pr96"}, {"text": "Experis Singapore", "value": "/g/11dxpnwm3s"}, {"text": "FieldBox.ai", "value": "/g/1ptyw89vr"}, {"text": "GIC Private Limited", "value": "/g/11mpj15pxw"}, {"text": "Government Technology Agency", "value": "/g/11gh0528nq"}, {"text": "Health Sciences Authority", "value": "/m/0h7fhh"}, {"text": "Hewlett Packard Enterprise (HPE)", "value": "/g/11b804x9ty"}, {"text": "Infineon Technologies", "value": "/m/02jzkj"}, {"text": "Infinite Computer Solutions Pte Ltd", "value": "/g/11g9mj72yz"}, {"text": "Institute Of Technical Education (ITE)", "value": "/m/05_02p"}, {"text": "KPMG Singapore", "value": "/g/11dxpsb9nr"}, {"text": "Lazada", "value": "/g/1q5bfkdqp"}, {"text": "Ministry of Defence Singapore", "value": "/m/0566dt"}, {"text": "Ngee Ann Polytechnic", "value": "/m/05451y"}, {"text": "Republic Polytechnic", "value": "/m/06jgzw"}]}]}