{"search_metadata": {"id": "60827ee5033e945f922b267f", "status": "Success", "json_endpoint": "https://serpapi.com/searches/f0ef0db35e3c7c2f/60827ee5033e945f922b267f.json", "created_at": "2021-04-23 08:01:41 UTC", "processed_at": "2021-04-23 08:01:41 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28software+engineer%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=240", "raw_html_file": "https://serpapi.com/searches/f0ef0db35e3c7c2f/60827ee5033e945f922b267f.html", "total_time_taken": 1.09}, "search_parameters": {"q": "(software engineer) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "240"}, "jobs_results": [{"title": "Software Engineer / Senior Software Engineer – Gaming, Dot Net", "company_name": "None", "location": "Singapore", "via": "via Singapore", "description": "Roles & Responsibilities• Develop web based application using the Microsoft .Net technolgies• Must have experience in Kiosk hardware components and integration• Must be strong in SSRS and SSIS.• Must be strong in MVC 4 design pattern• Should have knowledge in connecting DB2/400 database from C#• Good hands on SQL tuning and database concepts• Achieve successful business outcome.• Manage project priorities and escalations• Good learning abiliity to understand the existing application and propose new ideas• Ability to understand the requirements and remove any ambiguity by proactively going back to the analyst• Ability to design the applications well enough to take right design decisions• Ability to code optimally to ensure the performance of the application is improved• Trap all the possible defects during the unit test to ensure better product delivery• Proactive in proposing any architectural or design changes to improve the system• Ability to support the testing team during the SIT... UAT, Pre-production and production environments• Ability to support user queries with the right spirit and optimal resolution time• Ability to work with the team in need and contribute individually wherever required• Should be self sufficient to manage the customer expectations• Should have good attitude to work in teams when requiredGOOD to HAVE• Experience delivering numerous web based application development within the strict timelines• Bachelors Degree in Engineering• Experience delivering projects using Agile Methodology• Experience in developing Service Oriented Architecture based solutionTechnical / Professional Skills• Must have experience in Kiosk hardware components integration with other system• Strong hands-on experience with the .NET platform (NET Framework 3.5/4.0) • Experience with ASP.NET 4.5, MVC 4, JavaScript, Ajax, JSON, jQuery, Bootstrap, SSRS and SSIS• Experience with HTML/CSS Development inclusing HTML5 & CSS3• Experience in connecting with DB2/400 type databases using C#• Experience with Microsoft SQL Server 2008/2012 working with relational models to extract, transform and manipulate data• Strong in hosting and configuring website and applications on IIS7 & above.• Complete Software Development Lifecycle experience• Good communication and interpersonal skills• Experience working with external Vendors & outsourced projectsGOOD to HAVE (Advantage)Technical certification on Microsoft TechnologiesNon-Technical / Soft Skills• Excellent Communication skills & a team player• Proven ability to work with people from different cultures• A high level of intelligence; ability to operate not only on the basis of important past experiences, but in the light of the approaches and developments that occur in the market. • Natural problem solving inclination• High level presentation and interpersonal skills• Experience decomposing complex problems into component parts for effective problem solving", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciAvIFNlbmlvciBTb2Z0d2FyZSBFbmdpbmVlciDigJMgR2FtaW5nLCBEb3QgTmV0IiwiY29tcGFueV9uYW1lIjoiTm9uZSIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiQWxEeTVxMzdKMklkY0YyMUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBTaW5nYXBvcmUiLCJsaW5rIjoiaHR0cHM6Ly9zZy5maWRhbnRvLmNvbS9qb2JzL2pvYi1vcGVuaW5nL3NvZnR3YXJlLWRldmVsb3BlcnMtYXBwbGljYXRpb25zL3NvZnR3YXJlLWVuZ2luZWVyLXNlbmlvci1zb2Z0d2FyZS1lbmdpbmVlci1nYW1pbmctZG90LW5ldC0yNzU0MzQ4MTk/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "QA Test Engineer ( Automation and Manual Testing)", "company_name": "Activate Interactive Pte Ltd", "location": "Singapore (+1 other)", "via": "via Glassdoor", "description": "Activate Interactive Pte Ltd (“Activate”) is a leading IT solution and service provider headquartered in Singapore with a presence in Malaysia and Indonesia. The homegrown company was founded in 1997 with the mission of positively impacting the lives of people around us and the environment we live in through the use of technology.\n\nWe offer quality, cost-effective and impactful IT solutions and services, including mobile and web applications and cloud technology. Over the years, we have helped government agencies and enterprises remove technology roadblocks and increase their business efficiency to better serve the communities.\n\nTo amplify our efforts in improving people’s lives, Activate also develops preventive healthcare solutions that serve to increase health awareness and improve population health.\n\nWe believe that the success of a company relies on the strengths of our employees. At Activate, we are committed to provide a conducive environment and develop our employees to... realise their full potential.\n\nFrom a three-person outfit, Activate has grown into a team of more than 150 employees, delivering more than 150 solutions and services to help our clients achieve growth and success.\n\nWe have opportunities for you to grow your career path and are looking for talented professionals to join our team.\n\nRequirements\n\nResponsibilities\n• Design and implement conventional test i.e. System Integration and User Acceptance Test\n• Design and implement functional and non-functional software validation test on iOS, Android and web platforms\n• Design and implement static and dynamic security testing (SAST & DAST)\n• Design and implement Performance Test\n• Design and implement Test Case\n• Design and maintain test environments\n• Carry out test activities according to Test Plan\n• Conduct Test Execution and prepare Test Reports\n• Maintain requirement traceability matrix\n• Develop automation test scripts in Python language\n• Support the integration of test script with the Continuous Integration and Continuous Delivery (CICD) pipeline\n• Drive product quality and Quality Assurance practices\n\nRequirements:\n• Minimum 6 years experience in conventional test\n• Minimum 3 years experience in automation testing scripting for web-portals and mobile applications\n• Experience working in Agile Scrum projects\n• Experience in developing automation testing scripts i.e. mobile (Appium) and web (Selenium)\n• Knowledge and/or Experience in Test-Driven Development (TDD) i.e. Unit Testing\n• Experience in Behaviour-Driven Development (BDD) Test\n• Experience in Non-Functional Testing i.e. security and performance test\n• Good spoken and written English\n• Strong and effective interpersonal and communication skills, motivated, good attitude, responsible, proactive and an energetic team player will be a plus\n• Systematic, meticulous and able to work independently\n\nPreference\n• Knowledge of Robot Framework (using Python language) will be advantageous\n• Knowledge of Secure Hybrid Integration Pipeline (HATS) and Hive Agile Testing Solutions (SHIP) will be advantageous\n• Knowledge in software version control systems, code review workflows and CICD will be advantageous\n\nQualifications and skills:\n• Diploma/Bachlor's degree or higher in Electronics Engineering, Computer Engineering, Computer Science or related discipline\n• A natural tenacity, resiliency and determination\n• Certifications such as Certified Software Testing Professional, Certified Software Quality Analyst and/or CREST certification will be advantageous\n• Passionate in learning and working with new technologies\n\nBenefits\n\nFlexi benefits that covers medical, gym, sports and wellness.\n\nIf you love the idea of being part of a growing company with exciting prospects in mobile and web technologies that create positive impact on people’s lives, then we would love to hear from you", "extensions": ["16 days ago", "Full–time"], "detected_extensions": {"posted_at": "16 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJRQSBUZXN0IEVuZ2luZWVyICggQXV0b21hdGlvbiBhbmQgTWFudWFsIFRlc3RpbmcpIiwiY29tcGFueV9uYW1lIjoiQWN0aXZhdGUgSW50ZXJhY3RpdmUgUHRlIEx0ZCIsImNvbXBhbnlfbWlkIjoiL2cvMTFkeHExOTJsNSIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IlZ4Zk5BeEJiWXVyS0VhZTJBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVvc0NDc3dCUVU1VlgwNXhWR1JqTkdsQlpsUkZXa3gyVm5SVGMxcFJaWEJrWkVkdmFYcGhTMDB5VDBSZldYWlRSREZpTkROc2VXMWpURGRNY2t4QmVHMXZjR2Q2Y0MxRGJGTnpXRTV1T0MxMVZFZGtWa1kyTXpsMk5EWkJNRFpDY1hwaVNVMW9iRmt0YW5CNmQxUjNibGRMZUhKV05rOXdRalpHTTBsVGEybGhWakJOZFhaVmJubE1VbXR2WTFkeFkyNUNhQzFHV0dRM2MwZEdlVFZPYkhScFkyVmthekpQVmxoNWFFTnFNa1ZrUW5SalIwTmlSek52VDJKVmRIZ3RTMnhwUVhKYVdXRkJTR1IwZWtWcVZGTlFFaFkxV0RaRFdVOXVaVTlaZVRGMFFXRjFPRWx1V1VKUkdpSkJUMDFaVW5kRFlrWmtNMDFEU1UxdVdGSmpRMWxwU0dWdmNrUm5MVzh5V2w5biIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzExIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEdsYXNzZG9vciIsImxpbmsiOiJodHRwczovL3d3dy5nbGFzc2Rvb3Iuc2cvam9iLWxpc3RpbmcvcWEtdGVzdC1lbmdpbmVlci1hdXRvbWF0aW9uLWFuZC1tYW51YWwtdGVzdGluZy1hY3RpdmF0ZS1pbnRlcmFjdGl2ZS1wdGUtSlZfSUMzMjM1OTIxX0tPMCw0Nl9LRTQ3LDcxLmh0bT9qbD0zNjU3MjUyNTA5XHUwMDI2dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Senior / Software Engineer (Oracle)", "company_name": "EPAM Systems", "location": "Singapore", "via": "via LinkedIn", "description": "EPAM is committed to providing our global team of more than 41,150 EPAMers with inspiring careers from day one. EPAMers think creatively and lead with passion and honesty. Our people are the source of our success. We value collaboration, work in partnership with our customers, and strive for the highest standards of excellence. In today’s market conditions, we’re supporting operations for hundreds of clients around the world remotely. No matter where you are located, you’ll join a dedicated, diverse community that will help you discover your fullest potential.\n\nDescription\n\nWe are looking for an experienced Senior / Software Engineer(Oracle) in Singapore to make the team stronger.\n\nResponsibilities\n• Ensure all the technical requirements are captured in the requirement specification document\n• Review the onboarding requirement specification and run-through overview sessions for our stakeholders\n• Analysis the technical documentations to identify gaps and discrepancies related to feed... configurations\n• Resolution of user queries and business engagement activities up to design sign off in a timely manner\n• Follow the standard processes to track the onboarding projects activity status throughout the project lifecycle\n• Prepare the test plan and scenarios for assigned onboarding tasks and complete the walkthrough session for our stakeholders\n• Perform integration testing, conduct root cause analysis of test defects, implement fixes and prepare UAT deployments (e.g. configuration tags)\n• Carry out detailed analysis of feed processing failures during testing and ensure that all the breaks or issues are identified and resolved in due time\n• Make sure the risks and issues in processes are identified, reported and escalated in-time\n• Support your project manager with latest status information pertaining to your feed onboarding tasks\n• Collaborate and co-ordinate with our internal development teams to identify and resolve the feed archiving related issues\n• Preparation of handover document for production support team and participate in post-production verification tasks\n\nRequirements\n• Bachelor’s degree in computer science / Engineering / Mathematics majors preferred\n• At least 6 years of analyst and development experience in wealth management or financial service industry\n• Strong knowledge and working experience in UNIX, Oracle and SQL/PL SQL technologies\n• Good knowledge on MS Office tools (Excel, Word and PowerPoint)\n• Good communication skills in English to be able to interact with our colleagues and stakeholders around the world\n• Experience in software development life cycle change implementation process with banking industry\n• Highly driven and self-motivated individual with a can-do attitude\n• Team player, interacts well and creates synergy in team environment and with our stakeholders\n• A proactive and change focused mind-set with problem solving ability to deal with challenging situations\n\nNice to have\n• Knowledge or Experience in Records management policies and procedures will be an added advantage\n• Experience in tools like Scheduling (AutoSys), Ticketing tool (GSNOW), JIRA (Tracking tool), GitLab, Confluence and SharePoint are a plus\n• Knowledge in IBM CMOD 9.5 and Open text other records management software solutions are an asset\n\nWe offer\n• Friendly team and enjoyable working environment\n• Work-life balance and flexible schedule\n• Online training library, mentoring, career development and potential partial grant of certification\n• Unlimited access to LinkedIn learning solutions\n• Referral bonuses\n• Compensation for sick leave and paid time off\n• Opportunities for self-realization", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgLyBTb2Z0d2FyZSBFbmdpbmVlciAoT3JhY2xlKSIsImNvbXBhbnlfbmFtZSI6IkVQQU0gU3lzdGVtcyIsImNvbXBhbnlfbWlkIjoiL20vMGRsbnJjIiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiQzZqX1JrM2tXYWZ4ZDc0ZkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFVXZzJPR05SYjNSRlQzVkhNMEp5VFZKNk4xZFFRVE5XTFZadVduQkpkMGN6Um5aQlQwd3RjRE41VjNCTE0xcHhjRGxxV1VWT1YzaG9SRzV2TkhWaFJIY3pSMUZFUTFaTlgwTkJYM1p1Y0Rka04xWlJkVWQzVG05TWJYZEtWV0ZMZVRCTlZuWjVXbmRvVEZCaFlUTnpORU56UkZwemIycFllV1kwV2tGNlRrRllUMmRsWlZkRVZGUnVMVEJoWkdnM2RYQlRjVkUwWHpKMGNteG5FaFkxV0RaRFdVOXVaVTlaZVRGMFFXRjFPRWx1V1VKUkdpSkJUMDFaVW5kQmF6ZzJhamRwVEdKVFpFZFZTa2hHVWs1SFJXczRaRzVZUzJGUiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzE5IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExpbmtlZEluIiwibGluayI6Imh0dHBzOi8vc2cubGlua2VkaW4uY29tL2pvYnMvdmlldy9zZW5pb3Itc29mdHdhcmUtZW5naW5lZXItb3JhY2xlLWF0LWVwYW0tc3lzdGVtcy0yNTEyMTM1NTUzP3JlZklkPWNkYjE0MTFhLTI5ZDktNDYzNy04OWI2LWViMTY0ODg2NGM4M1x1MDAyNnRyYWNraW5nSWQ9Wkl6MndiUmc3TzgzZlgvZzN1dU40USUzRCUzRFx1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Software Developer (Digital Solutions Department) [NIE]", "company_name": "Nanyang Technological University", "location": "Singapore (+1 other)", "via": "via Workday", "description": "The National Institute of Education (NIE) invites applications for a Software Developer position in the Digital Solutions Department (DSD). We are looking for a technically talented individual to add to our mobile, application, and integration team. The candidate should be a dynamic IT professional that has good expertise in web technology and API integration.\n\nResponsibilities:\n• Design, develop, deploy, and support web applications in ASP.NET C#.\n• Analyse and test programs before launch.\n• Ensure software security by developing programs efficiently.\n• Troubleshoot coding problems quickly and efficiently to ensure a productive workplace.\n• Manage queries and provide advice to users.\n• Communicate with different team members to accomplish the task.\n• The desire to work in a fast-paced environment.\n• Report to team lead and align to team objectives and technology guidelines.\n\nRequirements:\n• A Diploma in Computer Science, Information Technology, Information Systems... Info-communications, or equivalent.\n• Keen interest in innovating IT solutions with leading-edge technologies and development methodologies.\n• Good team player, able to work with tight deadlines and fluid requirements.\n• Quick learner who is passionate about the latest trends and technologies.\n• Working experience in C#, ASP.NET, JAVA, JQuery, and API technology will be a bonus.\n\nFresh Diploma graduates are welcome to apply.\n\nClosing Date\nThe closing date of the advertisement is 28 April 2021. We regret that only shortlisted candidates will be notified.\n\nOther Information\nNIE staff can take chartered buses at their own expense from or near their homes to NIE campus. This is subject to the availability of seats.\n\nHiring Institution: NIE", "extensions": ["10 days ago", "Full–time"], "detected_extensions": {"posted_at": "10 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBEZXZlbG9wZXIgKERpZ2l0YWwgU29sdXRpb25zIERlcGFydG1lbnQpIFtOSUVdIiwiY29tcGFueV9uYW1lIjoiTmFueWFuZyBUZWNobm9sb2dpY2FsIFVuaXZlcnNpdHkiLCJjb21wYW55X21pZCI6Ii9tLzBsNDlrIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiZlgtYVUzdVZzSDM0OUJ5Y0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXFFQ0N1SUJRVTVWWDA1eFVrWTVPREk1VkhoMlJ6bGlaMDFFTUVWRFNGaHlVRTk0Um1JMU5GSlJXV1k0UVdsNk5sWm5MV0p3UmpJeE55MHhkakl4Uld0QldqbHhSR3RRUjIxTVltbzFkVWh4YzNSZlpGaFhPV3hvYmt0TU1rbFpOM2RPY1ZSbE1YaG5PRlppT0hveE5TMUtNRUZXZGt0eWIyNHlTVlJQVjAxdU9IbE9MWFZhU0dWVVdqbFVXakkxVHpKb1YzbHZkbkZmYVMxVWFIYzNOV3N6YTNaNldISkhZVzlCZG5CTFpuZHJaRXRsT1hCa1QxSkdNVFJ1YUZoblpYQnZhWFJhZERoMllqZHVOVTAxTW5SUFdFTjRUVVJVYWxseFUyY3pjblpGUm5sa1JuUk5VUklXTlZnMlExbFBibVZQV1hreGRFRmhkVGhKYmxsQ1VSb2lRVTlOV1ZKM1FsSllNazFsU3pCc1pYTTJTMXBYVFdKTk5sTmpMV2RGVmxkdlVRIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMjciLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gV29ya2RheSIsImxpbmsiOiJodHRwczovL250dS53ZDMubXl3b3JrZGF5am9icy5jb20vQ2FyZWVycy9qb2IvTlRVLU1haW4tQ2FtcHVzLVNpbmdhcG9yZS9Tb2Z0d2FyZS1EZXZlbG9wZXItLURpZ2l0YWwtU29sdXRpb25zLURlcGFydG1lbnQtLS1OSUUtX1IwMDAwMDEwNT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior Software Engineer - 19386-JOB", "company_name": "None", "location": "Singapore", "via": "via Jobs", "description": "Responsibilities: Work as part of Agile scrum team (geographically distributed) to design, implement, and test our bioinformatics software that enables researchers, scientists, geneticists and clinicians manage the complex workflows required to successfully sequence the genome Transform operational/customer needs into technical description and design specification for a software system Lead the requirement gathering process and perform requirement analysis and risk analysis Assume the role of a product owner in an agile scrum team Develop, manage and prioritize the team's product backlog Act as the primary liaison to product manager, customer support and other development teams to coordinate inter-dependencies to fulfill overall product delivery Work with overall system owner and project office to align team's delivery with overall project plan Verify team's delivery against requirements to ensure the right functionality Assist in troubleshooting system problems during development and... sustaining of product Develop and review project artefacts defined in the software life cycle in conformance to regulatory requirements Required Educational Background: At least a Bachelor's degree in Computer Science, Computer Engineering, Bioengineering or engineering related area Desired Profile: At least 4 years of working experience in Life Science industry with knowledge in DNA Sequencing or at least 4 years of experience as a Business/System Analyst. (Medical Device is preferred) Certified Scrum Master or Product Owner or working experience in regulated product development environment (SDLC and ISO 13485) Strong analytical skills, problem solving and troubleshooting Strong verbal and written communication skills A track record that includes being part of a team which completed and shipped successful products Must thrive in fast-paced, dynamic environment Experience in participating in cross-organizational or inter-company collaboration Experience in developing full stack web applications in Java is a plus Experience in working with offshore teams is a plus Experience in working with customer support is a plus Experience with Lab Information Management Systems is a plus", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgRW5naW5lZXIgLSAxOTM4Ni1KT0IiLCJjb21wYW55X25hbWUiOiJOb25lIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJ4cVh6WDRNS09iN0d1ZERtQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnMiLCJsaW5rIjoiaHR0cHM6Ly9zZy5maWRhbnRvLmNvbS9qb2JzL2pvYi1vcGVuaW5nL3NvZnR3YXJlLWRldmVsb3BlcnMtc3lzdGVtcy1zb2Z0d2FyZS9zZW5pb3Itc29mdHdhcmUtZW5naW5lZXItMTkzODZqb2ItMjc1NDM2OTk0P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Senior Systems Engineer - SfB/Teams Device Responsible (Desk Phones /Conference Device) worldwide", "company_name": "Bosch Group", "location": "Singapore", "via": "via Glassdoor", "description": "Company Description\n\nRobert Bosch (South East Asia) Pte Ltd is a regional subsidiary of the Bosch Group, representing the Group's interests in Southeast Asia where it is present in all ASEAN member countries. Business operations in these countries report to Robert Bosch (South East Asia) Pte Ltd, located in Singapore. Bosch has been present in Southeast Asia since 1919, with diversified businesses in the company's four business sectors - Mobility Solutions, Industrial Technology, Consumer Goods, and Energy and Building Technology. Bosch's strategic objective is to improves quality of life with products and services that are innovative and spark enthusiasm. In short, Bosch creates technology that is “Invented for life.”\n\nJob Description\n• Liaise with external vendors for product certification and support (vendor management)\n• Lifecycle management of deskphones/conference devices for Skype and Teams (Certification, Maintenance, Monitoring, Disposal, Evaluation) with close collaboration... with Product Manager and other key stakeholders\n• Evaluation of endpoints devices for other UC projects, e.g. Smart Meeting Room\n\nQualifications\n• Bachelor in Computer Science/Engineering or Electrical/Software Engineering, or higher\n• 3 - 5 years experience in Product Lifecycle Management (Preferably in Unified Communication Domain)\n• 3 - 5 years experience in vendor management, especially with offshore teams (Operational)\n• Team player who can work and collaborate comfortably with international stakeholders\n• Backend operational experience with Skype for Business and/or MS Team (audio communication, instant messaging) will be advantageous\n• Experienced practitioner of ITIL processes and Project Management, including Agile - Advantageous to have working experience in other UCC platform/application. For example: Avaya", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU3lzdGVtcyBFbmdpbmVlciAtIFNmQi9UZWFtcyBEZXZpY2UgUmVzcG9uc2libGUgKERlc2sgUGhvbmVzIC9Db25mZXJlbmNlIERldmljZSkgd29ybGR3aWRlIiwiY29tcGFueV9uYW1lIjoiQm9zY2ggR3JvdXAiLCJjb21wYW55X21pZCI6Ii9tLzAxaG5rZiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IlpoeUpaYnZRRVcwV25fZUZBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhVVWxDWkVoTFJqWkxabmhzVG1KU2NGWlVaR2Q1UzNvek1rdFdRMVJXZDNGeVIybFViRWhSVkhsT1ZVRlhkRGgyTlZaSlRYTTBTbFV0U21wTU9WaDJUa05xTFdkdlFrMXVSRVpXUVhKdVNVczFVa3BRVFMxcWN6WTBkbXhNWVZsRlpDMUJTWE5vT0U1d1ZYQnVUV3BwTUd0ZlZ6ZGlXa05aYjJNMVQyZGlXRWh1U2pSRWExazFTbGsxVEU5VFdIQkpOMHRGYVhKVVJtUTVVMlJCRWhZMVdEWkRXVTl1WlU5WmVURjBRV0YxT0VsdVdVSlJHaUpCVDAxWlVuZENMVkJNT1ZCaFlUQk9UVXR6WkhsRVVtbHJPVzF5Y2t3eVlXZEIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18zOSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBHbGFzc2Rvb3IiLCJsaW5rIjoiaHR0cHM6Ly93d3cuZ2xhc3Nkb29yLnNnL2pvYi1saXN0aW5nL3Nlbmlvci1zeXN0ZW1zLWVuZ2luZWVyLXNmYi10ZWFtcy1kZXZpY2UtcmVzcG9uc2libGUtZGVzay1waG9uZXMtY29uZmVyZW5jZS1kZXZpY2Utd29ybGR3aWRlLWJvc2NoLWdyb3VwLUpWX0lDMzIzNTkyMV9LTzAsOTJfS0U5MywxMDQuaHRtP2psPTQwMDc5NzMzOThcdTAwMjZ1dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior / Software Engineer (Python)", "company_name": "EPAM Systems", "location": "Singapore (+1 other)", "via": "via Bayt.com", "description": "EPAM is committed to providing our global team of more than 41,150 EPAMers with inspiring careers from day one. EPAMers think creatively and lead with passion and honesty. Our people are the source of our success. We value collaboration, work in partnership with our customers, and strive for the highest standards of excellence. In today’s market conditions, we’re supporting operations for hundreds of clients around the world remotely. No matter where you are located, you’ll join a dedicated, diverse community that will help you discover your fullest potential.\n\nDESCRIPTION\nWe are looking for an experienced Senior / Software Engineer (Python).\nWhat You’ll Do\n• The role involves working together with front office trader and sales, covering all aspects of equity and rates derivatives: pricing, quoting and hedge booking\n• Passionate about building robust and scalable Java platforms\n• Analyse business requirements and design / develop robust technical solutions\n• Work as part of an agile... development team with a global technology team\n• The candidate will be expected to closely liaise with trading, sales, quants, structuring and the tech groups in the equity derivatives business. The products spread across exchange listed, OTC and exotics\n• The candidate will be able to rapidly learn in-depth knowledge and gain experience of Equity Derivatives trading / risk management from both technology and business perspective\nRequirements\n• Minimum bachelor’s degree in Computer Science / Engineering / Mathematics majors preferred\n• Strong technical background with at least 5 years of hands-on development experience using Python, core java. Restful services, microservices, cloud integration and container are a plus\n• Self-motivated with independent thinking, and a quick learner that can thrive in a fast-paced environment\n• Experience of building software with messaging related technologies such as jms, mq and/or kafka, relational database (oracle or sql server) and nosql database (mongo or cassandra)\n• Good understanding of agile based execution process and well versed with various build and deploy tools like git, jenkins, team city\n• Hands-on, experienced technical team member who has built and worked on the development of applications with modern technologies and will continue to expand their technical knowledge to deliver value to the business\n• Strong analytical and problem-solving skills, bring efficiency and performance\n• Able to interpret a business requirement and transform it into an executable code\n• Self-motivated with independent thinking, and a quick learner that can thrive in a fast-paced environment\n• Strong communication skills; Experience in working across business and IT at all levels will be a plus\n• An excellent team player with a good balance of strategic view & rapid application development\n• Strong interest in applying academic knowledge/technical skills to solving practical problems in the Investment Banking industry\nNice to have\n• Hands on development experience in Java\n• Knowledge on equity derivatives, and experience working with front office business users would be a plus but not essential\n• Good understanding of testing and familiarity with different testing approaches. Familiarity of TDD / BDD will be a plus\nWe offer\n• Friendly team and enjoyable working environment\n• Work-life balance and flexible schedule\n• Online training library, mentoring, career development and potential partial grant of certification\n• Unlimited access to LinkedIn learning solutions\n• Referral bonuses\n• Compensation for sick leave and paid time off\n• Opportunities for self-realization", "extensions": ["10 days ago", "Full–time"], "detected_extensions": {"posted_at": "10 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgLyBTb2Z0d2FyZSBFbmdpbmVlciAoUHl0aG9uKSIsImNvbXBhbnlfbmFtZSI6IkVQQU0gU3lzdGVtcyIsImNvbXBhbnlfbWlkIjoiL20vMGRsbnJjIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiMVUzdUJHWlotNWlnenpTZEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFUwczFiemx5UVRJNE1EUTBiVXBDUVZaRlpEZHJhM2hRWlRaclRXZHNZbW8xUTNsVk1IUkZRMDkwWkVsSWJWcE5TelpOZUdwaFRVcENNVWsyYjBnNU5HbG1SeTFwTkVOcGVUaGtNbVZuTm5aTldEQXpSSFYxUzJkeVRITnVUV1pHV2tSb2FGVXlkVzVWTFROeVQzZFNjM0pOU1c4M1NWZ3lVMVJIUjJGcVVsVTBha2hSZW1RME5tZzVZVFJ0TmkxUlIyOXdiemcxWTNKYU1WQm5FaFkxV0RaRFdVOXVaVTlaZVRGMFFXRjFPRWx1V1VKUkdpSkJUMDFaVW5kQlpIZDFjRnBzY1VSWFYzQkJZazVETjFCd04yZFVNRkZhYmtkUiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzQ3IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJheXQuY29tIiwibGluayI6Imh0dHBzOi8vd3d3LmJheXQuY29tL2VuL3NpbmdhcG9yZS9qb2JzL3Nlbmlvci1zb2Z0d2FyZS1lbmdpbmVlci1weXRob24tNTk0NjMyMTQvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Quality Assurance Engineer/Validator", "company_name": "Thales DIS (Singapore) Pte. Ltd.", "location": "Singapore", "via": "via Workday", "description": "Location: Singapore, Singapore\n\nThales people architect identity management and data protection solutions at the heart of digital security. Business and governments rely on us to bring trust to the billons of digital interactions they have with people. Our technologies and services help banks exchange funds, people cross borders, energy become smarter and much more. More than 30,000 organizations already rely on us to verify the identities of people and things, grant access to digital services, analyze vast quantities of information and encrypt data to make the connected world more secure.\n\nThales established its presence in Singapore in 1973 to support the expansion of aerospace-related activities in the Asia-Pacific region. Throughout the last four decades, the company grew from strength to strength and is today involved in the primary businesses of Aerospace (including Air Traffic Management), Defence & Security, Ground Transportation and Digital Identity & Security. Thales today... employs over 2,100 people in Singapore across all its business areas.\n\nA week in the life of a Software Quality Assurance Engineer:\n• Write and execute the validation test plan per validation strategy and specifications\n• Participate in defining functional and non-functional tests, including (where appropriate) Security, Performance, Load, Robustness, High Availability, Accuracy, and UX (User Experience)\n• Build the strategy for validation in the case where no SQA leader is present on the project\n• Identify, record, thoroughly document/track all software defects (bugs) and work with team members to support and help identify root cause. Upon resolution, you perform thorough regression testing\n• Report test metrics/results and provide appropriate status updates to the project team and stakeholders\n• Be vigilant about the quality of the delivery, pushing development team when needed\n• Practice and follow DIS QA process and defined best practices\n• Help prepare the Acceptance Test Plan and may execute acceptance testing with the customer when appropriate\n• Create and issue the final SQA test report\n• Where applicable, you may perform SQA Leader responsibilities for smaller projects including communicating QA progress updates, metrics, and risks to Product Leader/Mgr\n\nKnowledge, Skills and Experience:\n• Bachelor’s Degree in Computer Science of related fields\n• 1-3 years’ experience as a Quality Assurance Engineer\n• Strong knowledge of Software QA methodologies, tools and processes\n• Work experience in software development\n• Knowledge of a programming / scripting language (Java, C#)\n• Hands-on experience with automated testing tools (JMeter, SoapUI, Selenium)\n• Solid knowledge in the design, development and documentation of Test Cases, Plans and Reports\n• Strong understanding of Quality Metrics and STLC (Software Test Life Cycle)\n• Solid knowledge of Defect & Test Case Management Tools\n• Solid knowledge of SQL and scripting\n• Experience with performance and security testing\n• Knowledge of Web technologies and applications servers\n• Knowledge of data communication/networking protocols\n• Work experience with JIRA / Confluence\n• Knowledge on development tool including Jenkins, Mercurial, and etc.\n•  ISTQB® Certified Tester – Foundation Level is a ‘plus’\n\nAt Thales we provide CAREERS and not only jobs. With Thales employing 80,000 employees in 68 countries our mobility policy enables thousands of employees each year to develop their careers at home and abroad, in their existing areas of expertise or by branching out into new fields. Together we believe that embracing flexibility is a smarter way of working. Great journeys start here, apply now", "extensions": ["25 days ago", "Full–time"], "detected_extensions": {"posted_at": "25 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJRdWFsaXR5IEFzc3VyYW5jZSBFbmdpbmVlci9WYWxpZGF0b3IiLCJjb21wYW55X25hbWUiOiJUaGFsZXMgRElTIChTaW5nYXBvcmUpIFB0ZS4gTHRkLiIsImNvbXBhbnlfbWlkIjoiL2cvMTFmMDE5N3lyeiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IkVSRGt3QkVwWE5IUFRqaExBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVxRUNDdUlCUVU1VlgwNXhVVzlYTXpGUGNGVklZelptYm1GUVgxZ3pTMnBRYUcxRGVtZHhUbnBuUVZGZlNHUmFkRzlpVGpaRmVXNVphbnBKWlV4RlIwaDFiWFJsYlRacFRVVlVWbkZaY2poSk5tUXRMV1V6U0dKeE9UQmphR3hUY0dveVIxZHdOeTB4V2twS2FFVXlMV3BJWVRsWGFYRklRMll4VVZGa1duVklia2h5V1hNNFRtWTFSekp2TjBOVFNsaENjRm81YzIxc1UwcEhhV3RRTWtwSlYyTnRiazB5UkMxWlVsUnRZVzVRY0daSk1GTkRhbWs0UzFoWExUTldSVXBCWjNCU2VFTTRWM2xEWjBrNFF6bG9jbFZvTmxsS2JqTkxkRk14WjBONmVVeGpSM3BIVVJJV05WZzJRMWxQYm1WUFdYa3hkRUZoZFRoSmJsbENVUm9pUVU5TldWSjNSR3RZYURObmJqWkljRGs1VXpoVVJqSlRUVGRGYjFOR1ZFNDFadyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzU0IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFdvcmtkYXkiLCJsaW5rIjoiaHR0cHM6Ly90aGFsZXMud2QzLm15d29ya2RheWpvYnMuY29tL0NhcmVlcnMvam9iL1NpbmdhcG9yZS9RdWFsaXR5LUFzc3VyYW5jZS1FbmdpbmVlci1WYWxpZGF0b3JfUjAxMjE0NDA/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Cloud Engineer", "company_name": "iZeno", "location": "Singapore (+1 other)", "via": "via Jobs", "description": "Job Responsibilities\n• Address customer technical, development, and strategic IT requirements as the main point of contact for Professional Services team\n• Consult with customers to work on problem identification, system architecture definition, hardware and software specification and design, implementation, testing, customer training, and deployment of open source solutions\n• Use industry practices alongside company's policies and procedures to solve diverse problems\n• Analyze data to evaluate key factors in problem-solving\n• Make judgment calls to select methods and techniques for obtaining solutions\n• Routinely assess, design, and implement company's core offerings\n• Serve as a subject matter expert on-site, addressing the technical, developmental, or strategic IT needs\n• Manage problem identification, system architecture definition, software specification and design, testing, and deployment of complex open source solutions\n• Adapt to changing customer requirements\n• Respond to... incidents, escalations, and exceptions in a professional manner\n• Deliver quality results both on-site and post-engagement that are on time and within the scope of the assigned project, including project journals, status reports, and other standard documentation\n\nJob Requirements\n• Minimum 5 years’ relevant experience\n• Experience with Red Hat Enterprise Linux (RHEL) system security, system deployment, and system administration\n• Advanced knowledge of and experience with Linux kernel internals, including performance tuning, troubleshooting, bug fix updates, and core builds\n• Excellent communication and interpersonal skills\n• Demonstrated experience communicating value, progress, and status of key projects to both business-minded and technically savvy audiences\n• Highly motivated and able to learn on your own, as well as quickly pick up new technologies and best practices\n• Ability and desire to learn new technologies on your own and apply new concepts to problems\n• Ability to work as part of a geographically distributed team while demonstrating flexibility and initiative\n• Ability to communicate with in a professional manner, give presentations, and work one-on-one with customers\n• Red Hat Certified Engineer (RHCE), or plans to get certified\n• Some overseas travelling may be required for this position", "extensions": ["25 days ago", "Full–time"], "detected_extensions": {"posted_at": "25 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDbG91ZCBFbmdpbmVlciIsImNvbXBhbnlfbmFtZSI6ImlaZW5vIiwiY29tcGFueV9taWQiOiIvZy8xMWc3MGN2ejB5IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiSHZMT3NsWDFIMWxYNktQUUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXNzQkNvd0JRVTVWWDA1eFZIQlJNalkxV1haWFMwRkxlSFpEVFRWa1VHMU9UVkJZYUZoS1dEZFpaVGRrVXpReE4yZHJia0ZGY2kwM2J6Rm5Na2RyWkhSNVFsOWtRMFJDVW0xaFluTk9VbE10VFVOTVNtdGFSM042Y1hSUWJqTmFiakZ2TmxnMlJtcDBjSEpxV0VWVlpVVm5aSG96ZVROWmREQTRabkpQV0UwNVRXZE1ka3BNT1ZWNGFGWjFiRE4xYkdzU0ZqVllOa05aVDI1bFQxbDVNWFJCWVhVNFNXNVpRbEVhSWtGUFRWbFNkMEkxYjFVeGFEWkxlbUpaTXkxdFRrUlBlWEZ6UW1FdFUzaFNUMmMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY182MSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIiwibGluayI6Imh0dHBzOi8vc2cuZmlkYW50by5jb20vam9icy9qb2Itb3BlbmluZy9pbmZvcm1hdGlvbi10ZWNobm9sb2d5LXByb2plY3QtbWFuYWdlcnMvY2xvdWQtZW5naW5lZXItMjYxMzk2NTcyP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "IT Engineer", "company_name": "GMP Group", "location": "Singapore (+1 other)", "via": "via Glassdoor", "description": "Responsibilities:\n• To review the current IT infrastructure and make improvement plans.\n• Plan and implement the work based on company policy and ensure on schedule.\n• Support and maintain the MS Windows servers, SAN Storages, CISCO IP telephony and network infrastructure of the whole company.\n• To maintain and improve backup of the systems.\n\nRequirements:\n• Degree in IT, Computer Science or Diploma with at least 3 years of related working experience\n• Good knowledge in MS Windows Server Environment and CISCO IP telephony and network equipments\n• Experience in a manufacturing networking environment will be an advantage\n• Candidate with MCSA, CCNA certification is preferred\n• Candidate (s) with no experiences, but possessing relevant academic exposure can be consider.\n\nTo apply, please visit www.gmprecruit.com and search for Job Reference: 17862\n\nTo learn more about this opportunity, please contact Yingying at yingying.lai@gmprecruit.com\n\nWe regret that only shortlisted candidates will... be notified.\n\nGMP Technologies (S) Pte Ltd | EA Licence: 11C3793 | EA Personnel: Lai Yingying | Registration No: R1110239", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJJVCBFbmdpbmVlciIsImNvbXBhbnlfbmFtZSI6IkdNUCBHcm91cCIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiSU9lMWJzZVVwRWQybnpZbUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBHbGFzc2Rvb3IiLCJsaW5rIjoiaHR0cHM6Ly93d3cuZ2xhc3Nkb29yLnNnL2pvYi1saXN0aW5nL2l0LWVuZ2luZWVyLWdtcC1ncm91cC1KVl9JQzMyMzU5MjFfS08wLDExX0tFMTIsMjEuaHRtP2psPTQwNDAzNTc1MDVcdTAwMjZ1dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}], "chips": [{"type": "Title", "param": "job_family_1", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Software engineer", "value": "software engineer"}, {"text": "Engineer", "value": "engineer"}, {"text": "Senior", "value": "senior"}, {"text": "Cloud engineer", "value": "cloud engineer"}, {"text": "Test engineer", "value": "test engineer"}, {"text": "Research engineer", "value": "research engineer"}, {"text": "Assurance engineer", "value": "assurance engineer"}, {"text": "It engineer", "value": "it engineer"}, {"text": "Java engineer", "value": "java engineer"}, {"text": "Qa engineer", "value": "qa engineer"}, {"text": "System engineer", "value": "system engineer"}, {"text": "Data engineer", "value": "data engineer"}, {"text": "Devops engineer", "value": "devops engineer"}, {"text": "Network engineer", "value": "network engineer"}, {"text": "Principal engineer", "value": "principal engineer"}, {"text": "Quality engineer", "value": "quality engineer"}, {"text": "Solutions engineer", "value": "solutions engineer"}, {"text": "Technical", "value": "technical"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Associate", "value": "associate"}, {"text": "Associate engineer", "value": "associate engineer"}, {"text": "Automation", "value": "automation"}, {"text": "Design engineer", "value": "design engineer"}, {"text": "Development engineer", "value": "development engineer"}, {"text": "Development manager", "value": "development manager"}, {"text": "Engineering manager", "value": "engineering manager"}, {"text": "Firmware engineer", "value": "firmware engineer"}, {"text": "Frontend engineer", "value": "frontend engineer"}, {"text": "Hardware engineer", "value": "hardware engineer"}, {"text": "Lecturer", "value": "lecturer"}, {"text": "Manager", "value": "manager"}, {"text": "Network systems", "value": "network systems"}, {"text": "Officer", "value": "officer"}, {"text": "Principal", "value": "principal"}, {"text": "Product engineer", "value": "product engineer"}, {"text": "Programmer", "value": "programmer"}, {"text": "Project officer", "value": "project officer"}, {"text": "Research associate", "value": "research associate"}, {"text": "Science", "value": "science"}, {"text": "Security engineer", "value": "security engineer"}, {"text": "Senior engineer", "value": "senior engineer"}, {"text": "Senior lecturer", "value": "senior lecturer"}, {"text": "Senior system", "value": "senior system"}, {"text": "Senior technical", "value": "senior technical"}, {"text": "Services engineer", "value": "services engineer"}, {"text": "Software architect", "value": "software architect"}, {"text": "Software engineering", "value": "software engineering"}, {"text": "Specialist", "value": "specialist"}, {"text": "Stack engineer", "value": "stack engineer"}, {"text": "Systems analyst", "value": "systems analyst"}, {"text": "Systems engineer", "value": "systems engineer"}, {"text": "Technical marketing", "value": "technical marketing"}, {"text": "Testing engineer", "value": "testing engineer"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Wholesale", "value": "/business/naics2007/42"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Rental", "value": "/business/naics2007/532"}, {"text": "Staffing", "value": "/business/naics2007/5613"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": ".AB4Jjf.qPB6Vc{padding-right:11px}.qfpP8d{padding:7px 0 7px 11px}.S003Ke{flex:none}.ZoN4Lb{color:rgba(0,0,0,.54)}.nAXVG{color:#70757a}.IxQsL{color:rgba(0,0,0,.26)}.xFO1De{color:#fff}.ooFpK{color:rgba(255,255,255,.30)}.mtnwac{color:#4285f4}.WxeeKb{color:#34a853}.hIVRU{color:#f29900}.EXaTMc{color:#fbbc04}.sxn46d{color:#000}.gqMTF{color:#1a73e8}.zpn8Mb{color:#d93025}.dEUPmd{color:#1e8e3e}.PJNo1{color:#fbbc04}Actively Hiring", "value": "e"}, {"text": "EPAM", "value": "/m/0dlnrc"}, {"text": "VISA", "value": "/m/01kqjn"}, {"text": "Nanyang Technological University", "value": "/m/0l49k"}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Zühlke", "value": "/g/1hh_rg216"}, {"text": "HCL SINGAPORE PTE. LTD.", "value": "/g/11fy25ngsv"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "Experis Singapore", "value": "/g/11dxpnwm3s"}, {"text": "OakTree Consulting", "value": "/g/11g70jfhtq"}, {"text": "Realtek Malaysia", "value": "/m/05wrm7"}, {"text": "TikTok", "value": "/g/11fy265933"}, {"text": "UST", "value": "/m/08kb8g"}, {"text": "UrbanFox", "value": "/g/11ghs7y0w6"}, {"text": "Activate Interactive Pte Ltd", "value": "/g/11dxq192l5"}, {"text": "Cardinal Health", "value": "/m/040vzx"}, {"text": "Cognizant", "value": "/m/03bf9h"}, {"text": "Collins Aerospace", "value": "/m/0kv61y1"}, {"text": "Credit Agricole Group", "value": "/m/028vbm"}, {"text": "DELL", "value": "/m/0py9b"}, {"text": "EPS Consultants Pte Ltd", "value": "/g/11gbxgscvy"}, {"text": "GlobalTix Pte Ltd", "value": "/g/11dxpqdhrf"}, {"text": "HCL Technologies", "value": "/m/0698gv"}, {"text": "Jobline Resources Pte Ltd", "value": "/g/11gp2647pn"}, {"text": "Metropolitan Wireless International Pte Ltd", "value": "/g/11g9m_xbc4"}, {"text": "Microsec", "value": "/g/11f00w21ts"}, {"text": "NCS PTE. LTD.", "value": "/m/0282746"}, {"text": "PALO IT", "value": "/g/11dxpwj75r"}, {"text": "Singapore Press Holdings Limited", "value": "/m/0d7mwh"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "Thales DIS (Singapore) Pte. Ltd.", "value": "/g/11f0197yrz"}, {"text": "Thales Group", "value": "/m/01phj4"}, {"text": "Zendesk", "value": "/m/0wkm4pl"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "Aryan Solutions", "value": "/g/11dxptv4s4"}]}]}