{"search_metadata": {"id": "608279af17f9235151be29a2", "status": "Success", "json_endpoint": "https://serpapi.com/searches/caf73778b04490fc/608279af17f9235151be29a2.json", "created_at": "2021-04-23 07:39:27 UTC", "processed_at": "2021-04-23 07:39:27 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28product+manager%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=70", "raw_html_file": "https://serpapi.com/searches/caf73778b04490fc/608279af17f9235151be29a2.html", "total_time_taken": 3.6}, "search_parameters": {"q": "(product manager) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "70"}, "jobs_results": [{"title": "Customer Engagement Technical Expert (BB-08DE1)", "company_name": "GIVAUDAN SINGAPORE PTE LTD", "location": "Singapore (+1 other)", "via": "via BeBee", "description": "Roles & ResponsibilitiesCustomer Engagement Technical Expert - Your future position?Work location: Marsiling, SingaporeReporting to: IM&T Business Getting DomainReports to: F&F Customer Engagement Platform Manager Overall Mission· Provides Salesforce technical expertise for Sales & Customer engagements.· Defines and updates technical standards/guidelines for Salesforce. Contacts:· Product Manager· Product Designers· Solution Architect· External IT vendors and service providers· Salesforce Success Manager Main Responsibilities:• Acts as a subject matter expert to support Product teams and Architects: in Demand process in exploring solutions on a technical point of view in early stages of design phase, in guiding designers in solution design in complex problem resolution, and as L3 Support where/when appropriate • Works on proof of concepts for new technology or solutions• Ensure sustainable solution design from concept to launch• Raising License needs and tracking usage.• Coaching of... the internal Salesforce development team Product design and project execution• Contributes and Validates potential to-be technical solutions• Contributes to define high level architecture and technical requirements for projects• Review conceptual data models and interfaces design between applications.• Detects non-standard technology requirements and raise flags to the Architect & Platform manager.• Support Architects in ensuring non-functional requirements are understood and translated to technical solution• Prepares, presents, coordinates and validates technical feasibility of the design• Provides the technical frameworks to product teams• Contributes to installation procedure definition• Participates in complex problem resolution• Provides input to Platform Managers / Product Managers and Architects regarding existing and new technologies• Ensure development code meets standards and guidelines• Coaches other team members the relevant field of expertise Support Salesforce Releases:• Review Release notes of Salesforce upgrade releases and identify potential impacts on existing Givaudan’s salesforce solutions• Ensure with the product teams the necessary user stories & technical tasks are raised and solutions timely delivered for the new version go live.• Log ticket for Salesforce issues and follow up for resolution. Support User research and Innovations by:• Collaborating with product managers and product designers to identify the best experience that meets user, business and technical needs• Be data expert, provide data required for innovation experimentation and exploration phases. Documentation• Provides and maintains technical documentation, and ensures the guidelines are understood and respected You?Are you someone who wants to grow and shape your world? Who needs a new challenge and brings excellent contribution to company? Then come and join us - and impact your world. Education / Primary Qualification:• Bachelor’s degree in computer engineering or business school or design school• Any of the following certifications is preferrable: Salesforce Certified Administrator, Salesforce Certified Platform App Builder, Salesforce Certified Architect, Salesforce Certified Cloud Consultant. Professional experience:• 6+ years in Salesforce / CRM development as a designer or an analyst• Experience in Conceptual data modeling.• Knowledge and experience in Agile methodologies is a plus• Salesforce Certified (administrator) is a plus Skills:• Strong analytical & Problem Solving skills• Advanced technical skills, functional understanding• Expert in : Web technologies - Java,HTML , DB : Oracle,SQL, Postgre, Interface technologies - webmethod, web service etc• Priority Setting• Fluent in English. Additional language is a plus Our Benefits· Attractive package with benefits· Excellent opportunities for progressive learning and development· A creative team environment that will inspire you· Comprehensive healthcare plans· PTO and family leaveTell employers what skills you haveCustomer EngagementSalesforceSalesforce AdministratordesignedOracle DesignerguidelinesplatformSubject Matter Experttechnical expertiseIT Vendor", "extensions": ["20 hours ago", "Full–time"], "detected_extensions": {"posted_at": "20 hours ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDdXN0b21lciBFbmdhZ2VtZW50IFRlY2huaWNhbCBFeHBlcnQgKEJCLTA4REUxKSIsImNvbXBhbnlfbmFtZSI6IkdJVkFVREFOIFNJTkdBUE9SRSBQVEUgTFREIiwiY29tcGFueV9taWQiOiIvZy8xMWYwMHduNTE5IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiR2N3dEp0UXUxRmRHUUFhR0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRW9zQ0Nzd0JRVTVWWDA1eFUxazBaRXBpZEhaQ1MxUmZNVmc0U2pWalFUbHVUbEUxTUZKdWRYbDNRa3RmZUcxNU1USnZZbEY1WlhkTFQyVkdVV1ZzZVRKcGFIVnlSVU5CWjJGeGJtOXpkbE5mWlY5bmNrMDVSakpmY0doTk0wUnFWRGwwWHpGTk9USm1iaTFaZDNsbVowTm1hRU4zU2tKbU4yMHRUR2xaV0dRd1NtUTRhbFZsWkdKbWVsUkdiVnBVZW5CU1IxVlZjMGMwUXkwNFdYQjZWRmwyZURVNU5FeENXbXBxU2prNWNXdzFNM0V6Y1hvdFRsSTBkRXRvUldwdlIzTjNWMmMyVFhWQlEydzVjVmRxV0RBd0VoWnpibTFEV1UxbVRFaEtjVFowUVdKMk9EWXliMFIzR2lKQlQwMVpVbmRCTjJkUlZGSmtla2cxVERoTVRHZEZaVUV6WVMxNFdWazFTR2xSIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCZUJlZSIsImxpbmsiOiJodHRwczovL3NnLmJlYmVlLmNvbS9qb2IvMjAyMTA0MjItMzUxY2E3MTk0YzM2YmI0NDk1YTA4NTU4NTQ5MDhkZTE/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Product Manager [supplier / Av Prodcuts / 5days / Ubi]", "company_name": "One Vogue Pte Ltd", "location": "Singapore", "via": "via MNC Jobs Singapore | MNC Jobs In Singapore", "description": "Responsibilities\n• Market and Sell directly to end-user and within the organization for the product portfolio in charge\n• Engage directly with MNC / foreign SME's IT, AV, Admin director to executive level.\n• Involve in Design, selling and project delivery through working closely with renowned supplier, AV Designer, Engineer and Project Lead.\n• Evaluate and expand the partner that is related to unified communication\n• Solution selling for integrated audio visual and videoconferencing solutions to customer\n• Plan and execute Quarterly product promotion to different media for selective product portfolio\n• Plan and execute marketing campaigns with Partner to generate leads.\n• Review and ensure partner certification is renew or upgraded on time\nRequirement\n• Min Diploma in Engineering or related equivalent certificates\n• Highly Motivated individual with excellent sales / communication skills\n• Able to Speak and write fluently in English\n• Able to work in fast pace environment both... independently & in a team\nAndy Lee\nRegistration No: R1983024\nEA License: 19C9629\nOne Vogue Pte LtdJob Types: Full-time, PermanentSalary: $4,000.00 to $5,000.00 /monthExperience:\n• Product Management: 1 year (Preferred", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9kdWN0IE1hbmFnZXIgW3N1cHBsaWVyIC8gQXYgUHJvZGN1dHMgLyA1ZGF5cyAvIFViaV0iLCJjb21wYW55X25hbWUiOiJPbmUgVm9ndWUgUHRlIEx0ZCIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiQzBvY3RlN1Bsd3lPOWhsNkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNTkMgSm9icyBTaW5nYXBvcmUgfCBNTkMgSm9icyBJbiBTaW5nYXBvcmUiLCJsaW5rIjoiaHR0cHM6Ly9zZy5tbmNqb2J6LmNvbS9qb2JzL3Byb2R1Y3QtbWFuYWdlci1zdXBwbGllci1hdi1wcm9kY3V0cy01ZGF5cy11YmktdWJpLTc3MDg2P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Payments Product Manager", "company_name": "Space Executive Pte Ltd, EA Licence No: 15S7496", "location": "Singapore", "via": "via Laimoon.com", "description": "Responsibilities\n• Understand the payments landscape in SE Asia, act as payment expert and the primary product contact for all queries related to your product\n• End to end ownership of the product roadmap, from ideation through to execution\n• Collaborate across teams and stakeholders on integration of payment channels onto the platform, from initial stages through to go-live\n• Manage channel partners and customer relationship in any product related engagement\n• Understand user mindset & behaviour (research, observe, use techniques e.g. data mining, etc)\n\nRequirements\n\nNon negotiables:\n• Very familiar with payments providers in South East Asia\n• Fluent in spoken Mandarin (you'll be working with tech teams in China)\n• Several years of successful product delivery (0-1) under your belt\n\nNice to haves:\n• 7+ years work experience, with at least 5 years in a relevant role\n• Good understanding of industry (eCommerce, consumer facing tech/B2C etc)\n• Analytical skills, prior experience working... with data & insights to help craft a product roadmap\n• Educated to at least degree level, ideally in Computer Science/Engineering or similar\n\nThis company is at a pivotal stage of growth and currently is hiring several PMs to help them ahead of the biggest step in their payments journey, coming in 2021.\n\nIf you're interested to be a part of this growth, apply today to be considered or feel free to contact me at akeith@space-exec.com for more information.\nInformation Technology", "extensions": ["14 days ago", "Full–time"], "detected_extensions": {"posted_at": "14 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQYXltZW50cyBQcm9kdWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJTcGFjZSBFeGVjdXRpdmUgUHRlIEx0ZCwgRUEgTGljZW5jZSBObzogMTVTNzQ5NiIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoibENwVkZoRTRRUE1LQVI4REFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMYWltb29uLmNvbSIsImxpbmsiOiJodHRwczovL2pvYnMubGFpbW9vbi5jb20vam9icy9leHRlcm5hbHZpZXcvMjMzMjI4NTY/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Digital Product Manager, Data & Analytics", "company_name": "DKSH", "location": "Singapore", "via": "via LinkedIn", "description": "We’re looking for an experienced project manager to lead the data-driven digital initiative. A self-starter with an entrepreneurial mindset; Able to understand complex business problems, identify relevant data elements and navigate through internal and external obstacles to achieve the desired outcome. Your responsibilities include the coordination and completion of projects on time within budget and within scope. Oversee all aspects of projects such Set deadlines, assign responsibilities, and monitor and summarize the progress of the project. You will work with multiple stakeholders to ensure deliverables fall within the applicable scope and aligned with the digital agenda.\n\nResponsibilities:\n• Manage the data related project in Agile mode; prioritize project based on business impact\n• Assist in the definition of project scope and objectives, involving all relevant stakeholders and ensuring technical feasibility\n• Ensure resource availability and allocation\n• Develop a detailed... project plan to monitor and track progress\n• Manage changes to the project scope, project schedule and project costs using appropriate verification techniques\n• Measure project performance using appropriate tools and techniques\n• Report and escalate to management as needed\n• Manage the relationship with all the stakeholders\n• Establish and maintain relationships with third parties/vendors\n• Perform risk management to minimize project risks\n• Create and maintain project documentation\n• Track project performance, specifically to analyze the successful completion of short and long-term goals\n• Develop comprehensive project plans to be shared with stakeholders\n• Use and continually develop leadership skills\n• Experience & fair level of understanding of cloud data services (Big Data Analytics)\n• Foster a collaborative culture of trust, accountability, and performance by mentoring and supporting the team to reach their potential.\n• Manage multiple vendors to drive the project towards success.\n• Collaborate and align with other digital initiatives to bring in better business value.\n\nEducation:\n• Master’s or bachelor’s degree in IT Management, Computer Science\n• PMI-PMP or PMI-ACP preferred or\n• Certified Product Owner preferred\n\nExperience:\n• Minimum of four (4) years of experience building and leading data driven projects", "extensions": ["10 days ago", "Full–time"], "detected_extensions": {"posted_at": "10 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEaWdpdGFsIFByb2R1Y3QgTWFuYWdlciwgRGF0YSBcdTAwMjYgQW5hbHl0aWNzIiwiY29tcGFueV9uYW1lIjoiREtTSCIsImNvbXBhbnlfbWlkIjoiL20vMGRqMm5oIiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiRGFVSFQwUmhFT1VINlFVbEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXNzQkNvd0JRVTVWWDA1eFVtdzNRVkIwWHpkeWF6SnFiVzFsWkhkelJtaFlOakZRVGtOWllubGZjSGRqZDFNd2FHaE5aM3BHYlUxZmNGTklkalkwUlZrMU55MU5XV1pRYlRBeGFVeGtTMjkzVlVSMFZqQktORzluVXpGa1RubFJkbU5JVFV4R2RUQkhhR05yY1V3NFRFZGZMVFk1VFRZNU9VNXdhM2RhU0RoMmQyeFBObE5GTjBGS1UzaDVNMjF1VVhBU0ZuTnViVU5aVFdaTVNFcHhOblJCWW5ZNE5qSnZSSGNhSWtGUFRWbFNkME53VjFWUk1XRXhPVXhGZFdaSU1FcHhaV2hQZVZoaVozZ3pWM2MiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18yMSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL3NnLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvZGlnaXRhbC1wcm9kdWN0LW1hbmFnZXItZGF0YS1hbmFseXRpY3MtYXQtZGtzaC0yNDg1NTgzNTYxP3JlZklkPWM1OWI5ZTZiLTJhNjItNGIxMy1hMjU0LWVjNGJhNzZmZTNiZlx1MDAyNnRyYWNraW5nSWQ9cHRjcktnNDZoZDB6QS9kc1VjbklVdyUzRCUzRFx1MDAyNnBvc2l0aW9uPTE4XHUwMDI2cGFnZU51bT0wXHUwMDI2dHJrPXB1YmxpY19qb2JzX2pvYi1yZXN1bHQtY2FyZF9yZXN1bHQtY2FyZF9mdWxsLWNsaWNrXHUwMDI2dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Director, Multi-Currency and FX Payments Product Manager", "company_name": "BNY  Mellon", "location": "Singapore", "via": "via Jobs | Fidanto", "description": "Director, Multi-Currency and FX Payments Product Manager\n\nIn this role you would be a member of a global Product team, within Treasury Services, responsible for managing a suite of Multi-currency, FX and Mass payment solutions (referred to as SmartPay Global). This is a leadership role, within the SmartPay Global Product team covering the APAC region. You would be responsible for developing and executing a growth strategy in the region, aligned to team and group priorities. In this role you will report to the Global Head of Multicurrency and FX Payments. You would be responsible for developing an in-depth and comprehensive knowledge of our capabilities and an understanding of the firm's products and services, the marketplace and client needs. You would be responsible for enhancing SmartPay Global product performance and profitability in the region. The role will also involve increasing adoption and utilization of our solutions by our clients and new prospects through participation in... sales strategy meetings, demonstrations, presentations and client meetings as well as attending industry/professional events. You will use your in-depth knowledge of the market and competitive landscape and subject-matter expertise to identify the right solutions for clients to address specific client needs. As a member of the team you must be highly collaborative and adaptable to lead or contribute to new product developments or enhancements or projects relating to SmartPay Global or contributing to team or group objectives as well as providing subject matter expertise or knowledge to support programs or enterprise initiatives from within or outside of the team. Whilst there are no direct reports for this role at the outset, the anticipated growth of the business may lead to opportunities for team leadership in the future. Primary responsibilities would include: The development and implementation of our SmartPay Global product and growth strategy in the region End to End ownership of the regional SmartPay Global product roadmap including developing business cases aligned with overall business objectives Achievement of revenue goals/targets, profitability, and establishing pricing strategies for our products sold in the region Seeking opportunities to accelerate revenue realization and enhance client experience Leading/managing a range of products and services and introducing enhancements and improvements from development to launch Leveraging your strong market knowledge to integrate the requirements of the region into the product set and stay ahead of competitors Driving business and pipeline growth by supporting deal structuring, sales training and delivering solutions to solve client needs Develop ideas for new products and generate buy-in from the business to integrate into product pipeline To keep up to date on the competitive landscape and industry environment and provide subject-matter expertise when offering solutions to address specific client or operational/organizational needs Work closely with Markets FX Product Management, Relationship Management, Business Development, Account Management, and Product Development teams and other stakeholders to deliver on business goals Collaborate with Marketing to raise awareness and increase adoption and utilization of SmartPay Global services Work closely with Legal, Risk, and Compliance teams to ensure that solutions adhere to regulatory requirements and risks are mitigated or addressed Take an active role in the team, including development and coaching of less experienced Product Managers or team members Other responsibilities as required by the business Qualifications Prior experience and knowledge, and a strong track record of driving growth in the Multi-currency and FX payments business Prior experience in Product Management and/or Sales preferred Bachelor's degree or the equivalent combination of education and experience is required. Advanced/graduate degree preferred. 12 plus years of total work experience preferred. MBA or CFA preferred. Product Leadership Certification preferred. Applicable local/regional licenses or certifications as required by the business. BNY Mellon is an Equal Employment Opportunity Employer. Our ambition is to build the best global team - one that is representative and inclusive of the diverse talent, clients and communities we work with and serve - and to empower our team to do their best work. We support wellbeing and a balanced life, and offer a range of family-friendly, inclusive employment policies and employee forums. Primary Location: Singapore-Singapore-Singapore Job: Sales/Marketing Internal Jobcode: 70659 Organization: Global Product Management-HR07027 Requisition Number: 2106582", "extensions": ["2 days ago", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEaXJlY3RvciwgTXVsdGktQ3VycmVuY3kgYW5kIEZYIFBheW1lbnRzIFByb2R1Y3QgTWFuYWdlciIsImNvbXBhbnlfbmFtZSI6IkJOWSAgTWVsbG9uIiwiY29tcGFueV9taWQiOiIvbS8wMnZwczV4IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiNFdSLTE4aU1tWjU2YU1TakFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFZFTXhaa3d4Um0xcVZVbEdVaTE2Tkc5U1NIbHJWbTF6VWpGc01VdzFaRnBpVDBaQlRYWnlhR3d6WXpOTlNWTlJUVkZFZFhSYWJVZGZSR2xCY2tNMVJYTkdkV3RmVW5SV05rcFBNMGxyV2xoSk1WcEhMVEJTWVhSSWIyVnZUa1pKWlVwelRVbEhWalV5VTIxdVNXYzFiV3BPUVhWbVVrMVpWR3hpVG1KNmF6TldORXhQWm14MGRuTnBZek4xYmtndGMwbGxWbVpGWjJsSlNIaG5FaFp6Ym0xRFdVMW1URWhLY1RaMFFXSjJPRFl5YjBSM0dpSkJUMDFaVW5kRFluRTViMmc0UVdsQ2NFNW9hV3R4WTNKTlJEQkpWa0p1Ym1GMyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzI4IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnMgfCBGaWRhbnRvIiwibGluayI6Imh0dHBzOi8vc2cuZmlkYW50by5jb20vam9icy9qb2Itb3BlbmluZy9tYXJrZXQtcmVzZWFyY2gtYW5hbHlzdHMtYW5kLW1hcmtldGluZy1zcGVjaWFsaXN0cy9kaXJlY3Rvci1tdWx0aWN1cnJlbmN5LWFuZC1meC1wYXltZW50cy1wcm9kdWN0LW1hbmFnZXItMjc3NjE1OTI2P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Technical Product Manager", "company_name": "Microcast Pte. Ltd.", "location": "Singapore (+1 other)", "via": "via Monster", "description": "Responsibilities:\n\n/ To lead the team in the development of the software product against the roadmap via Scrum planning and execution\n\n/ To work cross-function with software systems and technologies utilizing embedded, backend, cloud, python, UI/UX, cybersecurity, etc.\n\n/ Undertake project scoping, time management, planning, and execution.\n\n/ Manage day-to-day operational aspects of the project timeline and scope.\n\n/ Prepare and gather project requirements and product backlog.\n\n/ Work with engineering teams to prioritize development and ensure that high-quality product is shipped on time\n\n/ Perform code and design reviews.\n\n/ Assisting user acceptance testing and quality assurance.\n\n/ Enforce project standards with both internal and external resources.\n\n/ To prepare, review, and amend technical documentations.\n\n/ Perform other duties and responsibilities as assigned.\n\nBasic Qualifications:\n\n/ University degree in Engineering/Computer Science or an equivalent field.\n\n/ Strong... understanding of Software development, backend, and Python.\n\n/ Knowledge of Cybersecurity or IoT is a plus.\n\n/ Strong experience and knowledge of Linux & Cloud technologies. Must be able to perform or manage minor changes and bug fixes to the existing codebase internally or with external vendors.\n\n/ Good knowledge of Agile and/or other project management methods or certification is a plus.\n\n/ Excellent written and oral communication skills; able to communicate in all forms across the company; strong presentation skills.\n\nExperience:\n\n/ Should have 2 to 6 years of experience in working with Python, Cloud, Embedded, and IoT related areas. A good foundation in Cybersecurity product suites and technologies.\n\n/ Experience in leading a technical team is plus.\n\n/ Have experience with DevOps and how to build a production environment system.\n\n/ Experienced in Agile project management and development.\n\n/ Strong strategic capability set with the ability to rigorously define, prioritize, and execute across a complex range of categories, customers, products, and functional groups", "extensions": ["4 days ago", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJUZWNobmljYWwgUHJvZHVjdCBNYW5hZ2VyIiwiY29tcGFueV9uYW1lIjoiTWljcm9jYXN0IFB0ZS4gTHRkLiIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiVGhoczJMM3pKaXBJUzAzQ0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNb25zdGVyIiwibGluayI6Imh0dHBzOi8vd3d3Lm1vbnN0ZXIuY29tLnNnL2FtcC9qb2ItdmFjYW5jeS10ZWNobmljYWwtcHJvZHVjdC1tYW5hZ2VyLW1pY3JvY2FzdC1wdGUtbHRkLXNpbmdhcG9yZS0yNjgzMjA0NS5odG1sP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Vice President & Product Manager Cum Dealer", "company_name": "Haitong International Securities (Singapore) Pte. Ltd.", "location": "Singapore", "via": "via MNC Jobs Singapore | MNC Jobs In Singapore", "description": "Roles & Responsibilities\n\nJob Summary:\n\nWork closely with the Investment Products Team in Hong Kong to support the private wealth management business franchise which services the investment products needs of high net worth clients.\n\nThe Job:\n• Assist the Private Wealth Management Department in providing the periodic investment market updates, placement and execution of the OTC and listed investment trades covering bonds, equities, investment funds and structured products.\n• Analyze business needs and competitors’ trends to co-ordinate business requirements in system enhancement projects that aim at offering a best-in-class trading platform in the market.\n• Conduct the due diligence on new investment products and performance reviews of the existing ones in the product shelf and be a contact person in driving the relationship with business counterparts.\n• Assist Hong Kong Investment Products Team to generate and distribute new investment ideas and articulate investment concepts to PWM... Marketing Team and respectively their high net worth clients.\n• Have an oversight on the dealing infrastructure / processes / systems for the investment products, and be responsible for all sales documentations, product agreements, and service level agreements.\n• Liaise effectively with all the respective stakeholders including Hong Kong Investment Products Team, Technology, Operations, Compliance and Risk Management to ensure smooth dealing and investment processes.\n• Identify changes in the regional market practice and regulatory requirements to develop and improve processes, systems and tools\n\nRequirements:\n• University graduate or Master degree in banking and finance is preferred.\n• Holder of the existing CMFAS certification (e.g. M1, M2, M5, M6, and M7) is the pre-requisite and CFA qualification is an advantage.\n• Business proficiency of written and spoken English and Mandarin, including Putonghua (in order handle queries from Putonghua and Mandarin speaking associates)\n• Ad-hoc business travel to overseas is required.\n• At least 10 years of product manager cum dealer experience in bonds, equities, funds or structured products.\n• Sound understanding of economics, best market practices and investment products in the wealth management business.\n• A team player with strong interpersonal and communication skills to work well with all levels of counterparts.\n• Willingness to work under a dynamic environment with the multi-tasking skills to handle tight and short assignment and meet project deadlines.\n[CANDIDATES WHO REQUIRE WORK PASSES NEED NOT APPLY]\n\n[CANDIDATES WHO REQUIRE WORK PASSES NEED NOT APPLY", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJWaWNlIFByZXNpZGVudCBcdTAwMjYgUHJvZHVjdCBNYW5hZ2VyIEN1bSBEZWFsZXIiLCJjb21wYW55X25hbWUiOiJIYWl0b25nIEludGVybmF0aW9uYWwgU2VjdXJpdGllcyAoU2luZ2Fwb3JlKSBQdGUuIEx0ZC4iLCJjb21wYW55X21pZCI6Ii9nLzExZzluNXZ6YmsiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiIwa05WUnNVbXN0TENzbWhKQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVDQ3FJQ1FVNVZYMDV4VXpWaU4xZHJOemw1V1daVk4zUklNM0pMZGsxWVJuSklTalJXU1ZGUGRIcG5ORzFuV25SZk16bGliakJSTlcxb2EwbHBWMnB1UlhsNFUydzRMVEJMUlZwTGVscFVOSE5PYjB0WmRHMDNia3hLTTNObWFVeEJPREJVWTIxc1VFNXpPRkZEWkZkbFpUaDJabWhwT1RsM1RIWm5iSEZZWDNKbGVWVlVTMEprVVhsVWNFVm9jbWg0T0RaNlVFSnRSR05HYUZJMlNrZFBWMmN4WkhoV1drMXNYMmxuY0RsaFRYbHBPR3hHYzBKTVZsbzRXbVEwWjNkVVJGaDRVRzlTWDNGVFR6UmphR0pYZVRCUmMzVlFOMVJJWjJaWFNFSlRjMU5TVkcxcFpFRm1UaTFUZDFoSVgwbG5NMGRmUlhWU1JqQmFiRWhpYWpsMk1EQXdlVkJZYzFadGRuWnBTMjUyTUhNeldVaHBkM0poTW5wdFptaGhlRVpaTW1KaFgwRVNGbk51YlVOWlRXWk1TRXB4Tm5SQlluWTROakp2UkhjYUlrRlBUVmxTZDBSWFFuZENWM0pyZFVzeWVFeG5OVW8zYlZKUmQzWnFhM2xLU1VFIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMzkiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTU5DIEpvYnMgU2luZ2Fwb3JlIHwgTU5DIEpvYnMgSW4gU2luZ2Fwb3JlIiwibGluayI6Imh0dHBzOi8vc2cubW5jam9iei5jb20vam9icy92aWNlLXByZXNpZGVudC1hbXAtcHJvZHVjdC1tYW5hZ2VyLWN1bS1kZWFsZXItc2luZ2Fwb3JlLTEyMTkwNz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Product Manager - Fixed Income", "company_name": "Schroders Investment Management", "location": "Singapore", "via": "via Laimoon.com", "description": "Job Summary\n\nAs the Fixed Income Product Manager at Schroders Investment Management (Singapore) Ltd, you will report to the Head of Asian Fixed Income (FI). You will be responsible for ensuring high level of quality of all client servicing activities as well as the integrity, effectiveness, clarity and repeatability of all business processes with the Asian FI team.\n\nYour Key Responsibilities include\n• Communication\n• Development and maintenance of client reporting material, new business materials, databases and general information on the product\n• Work closely with the investment team, compliance, performance attribution and risk management teams in resolving all client issues\n• Participate in the new business pitches with the portfolio manager, product specialists and members of the distribution team, and where required, in client reviews and conference calls with clients\n• Product Integrity\n• Ensuring product quality and consistency of delivery across all clients and across all... regions\n• Ensure integrity of all products, in the area of product documentation, risk management and performance attribution, and to ensure that all products are delivered according to their objectives.\n• Ownership and maintenance of all product related documentation, including process description & presentations RFP questions responses and client communication \\\n• Business Management\n• Understanding and assisting the Product Specialist and the business management team in managing the cost of product delivery due diligence work on documentation for new business signed on\n• Operational\n• Ensure a smooth handling of integrity, effectiveness, clarity and repeatability of all business processes with the Asian FI team\n• Composite performance and performance attribution sign off and correction\n• Aid the Head of Asian Fixed Income with the Schroders Investment Risk Framework \"SIRF\" oversight in relation to Asian FI portfolios\n\nEssential Skills\n• Degree holder with at least 6-8 years of relevant experience\n• Strong knowledge of Fixed Income and currencies\n• Highly methodical and enjoy working under tight deadlines\n• Prior experience and a proven track record in a client servicing role\n• Enjoy working in a team environment\n• Strong knowledge of powerpoint, excel and MS word\n• Ability to engage across teams\n• Ability to work with ambiguity and to tight deadlines\n• Strong time management and workload management skills\n• Self starter\nasset management", "extensions": ["7 days ago", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9kdWN0IE1hbmFnZXIgLSBGaXhlZCBJbmNvbWUiLCJjb21wYW55X25hbWUiOiJTY2hyb2RlcnMgSW52ZXN0bWVudCBNYW5hZ2VtZW50IiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJhR2o4UjNJQnBsNzdsRUUzQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExhaW1vb24uY29tIiwibGluayI6Imh0dHBzOi8vam9icy5sYWltb29uLmNvbS9qb2JzL2V4dGVybmFsdmlldy8yNTk1NDU0MT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Product Manager, E-commerce Solution", "company_name": "TikTok", "location": "Singapore", "via": "via Bayt.com", "description": "The E-commerce industry has seen tremendous growth in recent years and has become a hotly contested space amongst leading Internet companies, and its future growth cannot be underestimated. With millions of loyal users globally, we believe TikTok is an ideal platform to deliver a brand new and better E-commerce experience to our users. We are looking for passionate and talented people to join our product and operations team, together we can build an E-commerce ecosystem that is innovative, secure and intuitive for our users. - Work and collaborate with cross-cultural and cross-functional teams. Determine the product solution and roadmap for E-commerce major stakeholders including sellers, buyers, and creators;\n- Identify business needs, formulate product solutions and implement product features; - Gathering and unearthing user needs through data analysis, competitive research and any other relevant tools.\n- Bachelor's degree or above; - 3+ years experience in E-commerce product... management. Familiar with drafting BRD/MRD/PRD;\n- Has excellent interpersonal, communication skills and data sense, critical-thinker, and problem-solver;\n- Ability to communicate effectively and manage relationships with stakeholders coming from both technical and non-technical backgrounds", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9kdWN0IE1hbmFnZXIsIEUtY29tbWVyY2UgU29sdXRpb24iLCJjb21wYW55X25hbWUiOiJUaWtUb2siLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImJnTDM1VDl4dGFDMkpxWkhBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQmF5dC5jb20iLCJsaW5rIjoiaHR0cHM6Ly93d3cuYmF5dC5jb20vZW4vc2luZ2Fwb3JlL2pvYnMvcHJvZHVjdC1tYW5hZ2VyLWUtY29tbWVyY2Utc29sdXRpb24tNTg1MzAwNTcvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Product Localisation Manager", "company_name": "Apple", "location": "Singapore", "via": "via LinkedIn", "description": "Summary\n\nThe right product, at the right place and at the right time. That’s our mantra at Pacific Operations. Want to be a part of what it takes to bring Apple’s products to the hands of millions of customers across Greater China, North East Asia, South East Asia and Australia & New Zealand? Read on, to learn more. The Product & Launch Readiness (PLR) team is responsible for leading cross functional teams to align on the product launch strategy (timing, volume, channel coverage etc) and closely track execution, ensuring operational risks are raised and mitigated.\n\nAs a Product Localization Manager, you will lead the full compliance of our hardware products with regulations required for each country in the Pacific region (Japan, Australia, New Zealand and Asia Pacific). You will also support speed to market improvements for product launches and seamless updates to current products. You will develop in-depth knowledge in select countries and products and become the go-to subject matter... expert connecting compliance requirements to business impact. Finally, you will drive optimal business decisions regionally and globally with sound business recommendations detailing requirements, impacts, timelines and risks.\n\nThe Pacific Region’s business is growing, with all teams scaling up to support this dynamic market. This role offers the opportunity to solve some of the most challenging issues due to the complexity of emerging markets and its dynamic business environment. PLM leads the cross functional collaboration to identify solutions which ultimately include the proper localization and customization of the Bill of Materials (BOM) to ensure readiness for the market.\n\nThis role requires close collaboration across functions: Product Marketing, Operations (e.g. Supply & Demand Planning, Logistics, Reseller Channel Management), Legal, Compliance (e.g. Environmental, Regulatory, Safety & Trade) and Government Affairs.\n\nKey Qualifications\n\nDriven professional who is comfortable working in a fast-paced & dynamic environment\n\nA leader who can quickly understand the intricacy of issues/requirements, develop the business case and drive a plan to resolution\n\nExceptional project management & analytical problem solving skills\n\nExcellent time management, ability to be “hands on” with great attention to detail and ability to handle incomplete / ambiguous information with agility and comfort\n\nRemarkable ability to build relationships and operate in a matrix organization (e.g. influence without authority)\n\nExperienced in risk assessment and developing mitigation plans\n\nExceptional communicator (both written/verbal)\n\nDoes not accept status quo and can drive business process improvements\n\nMinimum 8-10 years of professional experience in developing the required Skills & Competencies, including international professional experience (Pacific Region is a plus)\n\nExperience and knowledge of multiple disciplines within supply chain operations (order to fulfilment, supply/demand planning, logistics, manufacturing, etc.) and product management (localization, certification and new product launches) is a plus\n\nBusiness proficient in Mandarin is a plus\n\nDescription\n\nDefine each NPI (new product introduction) localization requirements with WW and regional cross-functional teams\n\nEnsure flawless execution of NPI launch with accurate BOM creation\n\nExecute BOM roll-in or cut-in requirements\n\nPerform First-Article-Inspections (FAIs) on new localized product components\n\nCollaborate with global teams on the implementation of Pacific regulatory markings & artworks\n\nWork with Regulatory Compliance, Legal, Environmental, Safety, Government Affairs and Trade Compliance teams on resolving and mitigating issues relating to product regulatory requirements\n\nDevelop & execute localization solutions that are feasible (simple vs complex), scalable and cost effective to ensure products meet 100% of the in-country regulations\n\nIdentify and communicate risks and priorities to drive on-time and compliant delivery of products\n\nEducation & Experience\n\nBS/BA degree required; MBA or advanced degree a plus.\n\nRole Number: 200030313", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9kdWN0IExvY2FsaXNhdGlvbiBNYW5hZ2VyIiwiY29tcGFueV9uYW1lIjoiQXBwbGUiLCJjb21wYW55X21pZCI6Ii9tLzBrOHoiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJ0RG83SFZMd3NDeURidS1aQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFc3NCQ293QlFVNVZYMDV4VTBsblNFazVUbmx4YVV0dmVWTjNVVlYyTkV3eVRtRlRXWEpCWkRGTWQzZENObmt4ZWpsVFRVbDZhVTF3VUhoV1ZIZFZRV3hEWTNOVlJGcGFWMnR3VDAxWFExUmxTSFZNUm1ZMlNtTkNORGN4VjNvMmNFZFlWSEpUYWs0NE5FNDJSVzlqTTFwcGJWOU5kRjlwUlRGWE9HTXhjMVJzZFdadWJrNTVZMXB0U0cxUFYyWnNXa29TRm5OdWJVTlpUV1pNU0VweE5uUkJZblk0TmpKdlJIY2FJa0ZQVFZsU2QwSnNkbE5zY0ZwcVRtdFhaekZXT1RWUFIwb3liVUpFYjBVMWJIYyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzU0IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExpbmtlZEluIiwibGluayI6Imh0dHBzOi8vc2cubGlua2VkaW4uY29tL2pvYnMvdmlldy9wcm9kdWN0LWxvY2FsaXNhdGlvbi1tYW5hZ2VyLWF0LWFwcGxlLTI0OTMxNTE1Mzc/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Management", "value": "GC18"}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Business Operations", "value": "GC06"}, {"text": "Advertising and Marketing", "value": "GC03"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Accounting and Finance", "value": "GC01"}, {"text": "Legal", "value": "GC17"}, {"text": "Farming and Outdoors", "value": "GC13"}, {"text": "Human Resources", "value": "GC15"}, {"text": "Sales and Retail", "value": "GC26"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "Product manager", "value": "product manager"}, {"text": "Manager", "value": "manager"}, {"text": "Project manager", "value": "project manager"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Development manager", "value": "development manager"}, {"text": "Director", "value": "director"}, {"text": "Manufacturing manager", "value": "manufacturing manager"}, {"text": "Marketing manager", "value": "marketing manager"}, {"text": "Plant manager", "value": "plant manager"}, {"text": "Production manager", "value": "production manager"}, {"text": "Program manager", "value": "program manager"}, {"text": "Regional", "value": "regional"}, {"text": "Senior", "value": "senior"}, {"text": "Sr. manager", "value": "sr. manager"}, {"text": "Account manager", "value": "account manager"}, {"text": "Admin manager", "value": "admin manager"}, {"text": "Affairs manager", "value": "affairs manager"}, {"text": "Assistant", "value": "assistant"}, {"text": "Brand manager", "value": "brand manager"}, {"text": "Commodity manager", "value": "commodity manager"}, {"text": "Communication", "value": "communication"}, {"text": "Customer", "value": "customer"}, {"text": "Dealer", "value": "dealer"}, {"text": "Devops engineer", "value": "devops engineer"}, {"text": "Engineering", "value": "engineering"}, {"text": "Executive", "value": "executive"}, {"text": "Product specialist", "value": "product specialist"}, {"text": "Production supervisor", "value": "production supervisor"}, {"text": "Risk manager", "value": "risk manager"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Transactional", "value": "transactional"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Internship", "value": "INTERN"}, {"text": "Part-time", "value": "PARTTIME"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Toiletries", "value": "/business/naics2007/3256"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Foods & Beverages", "value": "/business/naics2007/311"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Management", "value": "/business/naics2007/55"}, {"text": "Research", "value": "/business/naics2007/5417"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "Citi", "value": "/m/01dfb6"}, {"text": "Binance", "value": "/g/11hcz1r4wl"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "Amazon", "value": "/m/0mgkg"}, {"text": "Standard Chartered", "value": "/m/02hszk"}, {"text": "United Overseas Bank", "value": "/m/04gjd1"}, {"text": "Apple", "value": "/m/0k8z"}, {"text": "Tata Communications", "value": "/m/04338k"}, {"text": "Workato", "value": "/g/11dxpy_3xd"}, {"text": "BNY  Mellon", "value": "/m/02vps5x"}, {"text": "DBS Bank", "value": "/m/01q7n5"}, {"text": "EPAM Systems", "value": "/m/0dlnrc"}, {"text": "GVT Government Technology Agency (GovTech)", "value": "/g/11gh0528nq"}, {"text": "Grab", "value": "/m/0134c_p9"}, {"text": "Paypal", "value": "/g/122s91_5"}, {"text": "PeopleSearch Pte Ltd", "value": "/g/11c73ngn0w"}, {"text": "Randstad", "value": "/m/08pt1z"}, {"text": "Singapore Airlines", "value": "/m/015f2x"}, {"text": "TEKsystems (Allegis Group Singapore Pte Ltd)", "value": "/g/11b6g4bkv0"}, {"text": "ABBOTT LABORATORIES (SINGAPORE ) PRIVATE LIMITED", "value": "/m/09m57z3"}, {"text": "ADVANCE INTELLIGENCE PTE. LTD.", "value": "/g/11dymfkxss"}, {"text": "AXA", "value": "/m/04mn99"}, {"text": "Adecco Personnel Pte Ltd", "value": "/m/08gz46"}, {"text": "Adidas Group", "value": "/m/01jtml"}, {"text": "Aetna, a CVS Health Company", "value": "/m/0kg8x"}, {"text": "Agency for Science, Technology and Research", "value": "/m/0gmjcg"}, {"text": "Alibaba", "value": "/m/07s6ctl"}, {"text": "Argyll Scott", "value": "/g/11dxpk2374"}, {"text": "Autodesk", "value": "/m/018nm3"}, {"text": "Barry Callebaut", "value": "/m/03clky2"}, {"text": "BioMind", "value": "/g/11dymfr2l6"}, {"text": "CHUBB ASIA PACIFIC PTE. LTD.", "value": "/m/09m8xyh"}, {"text": "Cargobase", "value": "/g/11dxppfsjn"}, {"text": "Cargobase Pte Ltd", "value": "/g/11fy240nxm"}, {"text": "DKSH", "value": "/m/0dj2nh"}, {"text": "Dathena", "value": "/g/11dxprdn6y"}, {"text": "Dyson", "value": "/m/05cskg"}, {"text": "Enggsol Pte Ltd", "value": "/g/11g9mnfmm1"}, {"text": "Ethos BeathChapman", "value": "/g/11c73z0xm0"}, {"text": "Eu Yan Sang", "value": "/m/03cl9hn"}, {"text": "Flintex Consulting Pte. Ltd.", "value": "/g/11h1z41pzb"}, {"text": "GIVAUDAN SINGAPORE PTE LTD", "value": "/g/11f00wn519"}, {"text": "Goldman Sachs", "value": "/m/01xdn1"}, {"text": "GovTech Singapore", "value": "/g/11dxpkfs_6"}]}]}