{"search_metadata": {"id": "60827e18eb690fd07d1d4790", "status": "Success", "json_endpoint": "https://serpapi.com/searches/0836dc99cd8196bc/60827e18eb690fd07d1d4790.json", "created_at": "2021-04-23 07:58:16 UTC", "processed_at": "2021-04-23 07:58:16 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28IT+analyst%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=0", "raw_html_file": "https://serpapi.com/searches/0836dc99cd8196bc/60827e18eb690fd07d1d4790.html", "total_time_taken": 1.16}, "search_parameters": {"q": "(IT analyst) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "0"}, "jobs_results": [{"title": "IT Systems Analyst", "company_name": "Capiteq", "location": "Singapore (+1 other)", "via": "via LinkedIn", "description": "Established in 2013, Capiteq is a Singapore based technology company with a core focus in delivering high quality I.T. services to Hedge Funds and Private Family Offices in Asia. Founded in 2013, the company has established itself as a leading technology provider focused in delivering IT Support & System Management, CTO Advisory, Cyber Security and Project Management services.\n\nAs a result of continued growth and demand for our services, we are interested to hear from IT professionals with experience in providing level 2 user helpdesk support and server/cloud administration.\n\nThe ideal candidate would be someone who possesses a technical skill set across a wide range of technologies, knowledge across Windows Server administration, Desktop support as well as solid experience in Office 365 is a requirement of the role.\n\nSuccessful candidates should be able to demonstrate knowledge in Microsoft technologies and have strong experience providing support to VIP members of staff. Experience... in Window Server Administration, backup management, patch management of systems will also be deemed advantageous.\n\nThis role will require a strong communicator as it will involve interfacing with C level staff. The position will work within a team of engineers providing support to our clients in Hong Kong and Singapore delivering.\n\nWe are looking for someone who understands service delivery and what it takes to deliver IT at the highest level.\n\nTechnical Skills Required\n• At least 6 years of Level 2 support experience (End user/ Server side)\n• Experience in Windows 10/Office 365/2016, Windows Server 2016,2019\n• Strong Microsoft Office 365 Administration,\n• Experience in administering Microsoft Windows 2016/2019 Servers\n• Experience supporting/troubleshooting trading applications e.g. Bloomberg\n• Active Directory/DHCP/DNS, Patch Management, VMware, Veeam Backup,\n• Basic Level Knowledge in IT Networks\n\nInterpersonal Skills Required\n• Strong work ethic and understanding of service delivery (Extremely important)\n• Strong team player with ability to work independently.\n• Strong communication skills as the role will involve liaising with clients on a day-to-day basis.\n• Ambition to work hard and learn/progress in the industry.\n\nCapiteq will provide the successful applicant with an opportunity to progress their career, learn new technologies as well as further advance in certification and training.\n\nYou can expect to be rewarded with a competitive remuneration package, autonomous work environment with highly experienced colleagues.\n\nPlease note that this role is based in Singapore, only candidates based in Singapore will be considered.\n\nYour cover letter and resume should be sent to recruit@capiteq.com.\n\nWe look forward to receiving your application", "extensions": ["13 hours ago", "Full–time"], "detected_extensions": {"posted_at": "13 hours ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJJVCBTeXN0ZW1zIEFuYWx5c3QiLCJjb21wYW55X25hbWUiOiJDYXBpdGVxIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJvNkdtSjVLTzVGWkNSTF9vQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExpbmtlZEluIiwibGluayI6Imh0dHBzOi8vc2cubGlua2VkaW4uY29tL2pvYnMvdmlldy9pdC1zeXN0ZW1zLWFuYWx5c3QtYXQtY2FwaXRlcS0yNTE1Nzg2NTI4P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Business Analyst", "company_name": "None", "location": "Singapore", "via": "via Jobs", "description": "• Tertiary Education in relevant fields is preferred.• Hands-on experience in related field is preferred• Hands-on experience in at least 1 full project development life cycles.• Advantageous to have:a. Consulting or Business Analysis experienceb. Business Analysis certification (Certification of Competency in Business AnalysisTM (CCBA®), Certified Business Analysis ProfessionalTM (CBAP®).c. Up to date on product trends, best practices and technologies.• Strong analytical, conceptualisation and problem solving skills.• Ability to take a broad, strategic perspective as well as drill deep to understand business needs and challenges.• Results and customer oriented.• Team player with strong organization and people handling skills.• Excellent communication skills, both oral and written, with the ability to pitch ideas and influence stakeholders.• Working knowledge of Cloud and Agile", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJCdXNpbmVzcyBBbmFseXN0IiwiY29tcGFueV9uYW1lIjoiTm9uZSIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiQTVncUtXTHJDMWJ2VHNyOEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIiwibGluayI6Imh0dHBzOi8vc2cuZmlkYW50by5jb20vam9icy9qb2Itb3BlbmluZy9idXNpbmVzcy1pbnRlbGxpZ2VuY2UtYW5hbHlzdHMvYnVzaW5lc3MtYW5hbHlzdC0yNzc4NDU4NzU/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Senior IT Systems Analyst", "company_name": "Capiteq", "location": "Singapore (+1 other)", "via": "via LinkedIn", "description": "Established in 2013, Capiteq is a Singapore/Hong Kong based technology company with a core focus in delivering high quality I.T. services to Hedge Funds and Private Family Offices in Asia.\n\nFounded in 2013, the company has established itself as a leading technology provider focused in delivering Technology Support & System Management, CTO Advisory, Cyber Security and Project Management services.\n\nDue to expansion and growth targets, we are now looking for a Senior IT Systems Analyst to be based in Singapore. Reporting into the Head of Infrastructure, this role will involve troubleshooting user client issues through our helpdesk as well as acting as a point of escalation for first responders on servers system related issues. You will also be responsible for the overall maintenance, upgrade, monitoring and patching of all related systems. Including backup management, disaster recovery testing, policy enforcement and hardening. Candidates highly proficient across managing Microsoft... technologies - 2016/2019/AD/Office 365/Azure.\n\nApplicants should be highly experienced in providing both level 2 and 3 support for companies operating in financial markets. The successful candidate should come from a support background with high exposure to server administration and Microsoft technologies. You must also be able to demonstrate solid experience across managing VMWARE, WINTEL environments and troubleshooting issues particularly across AD, SSO, DFS.\n\nThis position is best described as a hybrid role combining level 2 and 3 support levels with a strong focus in server / office 365 and azure.\n\nEnsuring server-side systems are running optimal, through stringent health checks, maintenance plans, system monitoring and security patch management / reporting.\n\nThe Successful Applicant Will Be Responsible For\n\nEnsuring clients issues are resolved/whether deskside or server side.\n• Providing troubleshooting assistance to clients with regards to system issues through our central helpdesk.\n• Acting as point of escalation for first responder team.\n• Server maintenance and patch management\n• VMware / Windows Servers maintenance / backup and patch management of all Windows Servers 2016/19 and Windows 10\n• Monitoring and Administration of Citrix Cloud\n• Administration of Office 365 Enterprise environments- policy creation / deployment / reporting\n• Maintaining Exchange Server 2013/2016 Infrastructure (advantage)\n• Basic Administration of Linux servers\n• Backup & Disaster Recovery Operation for client environments\n• Consistently Advancing and improving IT Policy/Server Architecture.\n• Maintaining Assets Tracking and Warranty/Licensing\n• IT Projects- implementing projects for system upgrades and new setups from the ground up\n• Enforcing IT Policy and hardening policy across client environments.\n• Testing of new technologies in UAT environment.\n\nTechnical Skills Required\n• At least 8 years of experience in Wintel Server, Client Administration, Windows Server 2016/2019, and Windows 10\n• Proven experience in VMware ESX / Azure\n• Experience with Citrix Administration\n• Strong across Microsoft Technologies – Office 365 Administration/Azure/Server 2016/ 2019\n• Experience using virtualized backup technologies.\n• Exposure to Citrix Technology\n• Good knowledge across hardening of devices and current auditing standards, e.g. (TRM) – (NIST)\n• Nessus - Vulnerability Scanning\n• Experience with monitoring software\n• Powershell scripting expertise (Advantageous)\n\nSoft Skills Required\n• A proactive self-starter\n• Genuine interest in furthering own technical ability and improving client environments\n• Ability to communicate with team and articulate ideas well- a strong team player\n• Ability to work well and collaborate with other team members in different geographical locations\n• Reliable, Positive with a Can-do attitude\n• Ability to translate complex issues into solutions people can understand\n• Quick-thinking; the person must be able to think on their feet and provide alternative solutions when needed\n• Ability to Multi-Task and Priorities\n\nCapiteq will provide the successful applicant with an opportunity to progress their career, learn new technologies as well as further advance in certification and training. You can expect to be rewarded with a competitive remuneration package, autonomous work environment with attractive benefits.\n\nPlease note that this role is based in Singapore, only candidates based in Singapore will be considered. Your cover letter and resume should be sent to recruit@capiteq.com. We look forward to receiving your application", "extensions": ["12 hours ago", "Full–time"], "detected_extensions": {"posted_at": "12 hours ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgSVQgU3lzdGVtcyBBbmFseXN0IiwiY29tcGFueV9uYW1lIjoiQ2FwaXRlcSIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoic3dMMEYwd29rWTdRVFJHS0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL3NnLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvc2VuaW9yLWl0LXN5c3RlbXMtYW5hbHlzdC1hdC1jYXBpdGVxLTI1MTU4MDQzNTk/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Digital Business Analyst - Agile", "company_name": "Government Technology Agency", "location": "Singapore (+1 other)", "via": "via Jobs", "description": "The Government Technology Agency (GovTech) aims to transform the delivery of Government digital services by taking an outside-in\" view, putting citizens and businesses at the heart of everything we do. We also develop the Smart Nation infrastructure and applications, and facilitate collaboration with citizens and businesses to co-develop technologies.Join us as we support Singapore’s vision of building a Smart Nation - a nation of possibilities empowered through info-communications technology and related engineering.You will be responsible for managing the Business Requirements and Functional Solution aspects of the project. As the successful candidate, you will be a member of the GovTech team in a Government Agency (Ministry/Statutory Board). You will also advise the Agency on the key ICT trends and best practices locally and internationally to meet the vertical business domain’s objectives. Assess applicability for adoption, manage user requirements, and provide IT solutions to... bridge business needs. What to Expect: Involve in Business Analysis Planning and Monitoring using Agile methodology Analyse stakeholders’ needs, scope the problem and develop business case to address the problem Assess current state, analyse stated requirements of stakeholders and accurately defines business need within specified scope Uncovering and capturing requirements as stories into a master story list Build narratives and acceptance criteria for the highest priority stories in upcoming iterations/sprints Validate the acceptance tests Progressively signoff completed stories with users Provide continual feedback to the development team How to Succeed: Graduate Degree in any discipline Minimum 4 years of working experience Experience in Agile Knowledge and experience in product / industry’s trends, best practices and technologies Consulting or Business Analysis experience Business Analysis certification, i.e. Certification of Competency in Business Analysis (CCBA), Certified Business Analysis Professional (CBAP), Agile Certified Practitioner (ACP) from the Project Management Institute (PMI), Certified Scrum Master Strong analytical, conceptualisation and problem solving skills Ability to take a broad, strategic perspective as well as drill deep to understand business needs and challenges Results and customer oriented Team player with strong organization and people handling skills Excellent communication skills, both oral and written, with ability to pitch ideas and influence stakeholders ", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEaWdpdGFsIEJ1c2luZXNzIEFuYWx5c3QgLSBBZ2lsZSIsImNvbXBhbnlfbmFtZSI6IkdvdmVybm1lbnQgVGVjaG5vbG9neSBBZ2VuY3kiLCJjb21wYW55X21pZCI6Ii9nLzExZ2gwNTI4bnEiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJ1NUhVVzhNbnkxNTJCOU5hQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFb3NDQ3N3QlFVNVZYMDV4VTFsRmJEUmlOa2RRVEcxemRqVkpRbmxZV1RJeWFHMXdZVFY1TWtvMFRISndTalZvUzFSSlUycENTVVJwVTJWWE16aFZUM00xT0RJNGNFbFljR2MxVlZKRVRYbGlOMGxSY214TmFrdGtaakEzVHpscFdUSmZRamhEZUZkVFYyMVlNM1EzTlZsQ2RrZE5URFYwYjIwMmNXRnRXSFZYWW1STk9HcElMWE5OYjJ0dGFFZGZhMWhTYXpkRE5XZHJjVTlZZWtweloxRkRRbWg0ZFZKSVIyUTJiamhPU1ZGS1FWSk5WMVZaYTI4M1p5MDNXazFXUkdkeVRrTk9XV1pHUWpSMk5IRlJiRFZrRWhaSFNEWkRXVTl1YTBadkxWTjBRV0Z5TVc4M1dVSjNHaUpCVDAxWlVuZEVZa0ZWY1RoQk9YSndSWFpwWmxGa1l6aHJlWGRMUlVFM2JVWlIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18yMSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIiwibGluayI6Imh0dHBzOi8vc2cuZmlkYW50by5jb20vam9icy9qb2Itb3BlbmluZy9idXNpbmVzcy1pbnRlbGxpZ2VuY2UtYW5hbHlzdHMvZGlnaXRhbC1idXNpbmVzcy1hbmFseXN0LWFnaWxlLTI3Nzg0NDE3ND91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "EPIC Application Analyst", "company_name": "Accenture", "location": "Singapore", "via": "via Accenture", "description": "About Accenture\n\nAccenture is a global professional services company with leading capabilities in digital, cloud and security. Combining unmatched experience and specialized skills across more than 40 industries, we offer Strategy and Consulting, Interactive, Technology and Operations services—all powered by the world’s largest network of Advanced Technology and Intelligent Operations centres. Our 506,000 people deliver on the promise of technology and human ingenuity every day, serving clients in more than 120 countries. We embrace the power of change to create value and shared success for our clients, people, shareholders, partners and communities. Visit us at www.accenture.com.\n\nWe are looking for:\n\nApplication Analysts, who will serve with Process Analysts as part of the primary support team for their designated application. They will take on more advanced issues that arise during the project for their application area and will take on more complex tasks with respect to system... configuration, testing and administration.\n\nResponsibilities:\n• Acting as the primary support contact for the application's end-users, after initial triage by help desk staff\n• Identifying issues that arise in their application area as well as issues that impact other application teams and working to resolve them\n• Guiding workflow design, completing advanced build and testing of the system\n• Identifying and implementing requested changes to the system configuration and cross-application master data files\n• Maintaining regular communication with Epic representatives, including participating in weekly project team meetings\n• Working with Epic representatives, your organization's business community, Process Analysts and end users to ensure the system meets the organization's business needs in regard to the project deliverables and timeline\n• Developing an understanding of operational and clinical needs to set the direction for the organization's workflows by attending discussion sessions\n• Critical thinking and willingness to see things in an open-minded way and examine an idea or concept from as many angles as possible\n• Seeking, logically examining, and interpreting information from different sources to determine a problem's cause and developing a course of action to resolve the problem and to prevent its recurrence\n• Relationship building to gain trust and establish effective relationships with Epic counterparts and stakeholders", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJFUElDIEFwcGxpY2F0aW9uIEFuYWx5c3QiLCJjb21wYW55X25hbWUiOiJBY2NlbnR1cmUiLCJjb21wYW55X21pZCI6Ii9tLzAxcnAyYyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IlpYdVM0U0VzSnV2TkEyUU9BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhVWGxHWkUxTFZHRjRabEJ1Wmw4dFQzbFJieTAwV25KcVJsVTJXVjlxVDFVMFFtNTZTbTVoYW10bVVYUTVOalZVYldaSU1qaDVTRzVDWld0b1ZXeHFRblJGZEd4d2FtbFRURGw2Y1VaWU1HNTRiR056WWxSaVVrOVBUM1pvWmxRNVFuWnRiMjFVTWtab2RUSlJaREF0TW1VNGNUUldiVmc0WTNOQmJVRlhWV1psU1VSdVFpMHRjakF4TjJwc1prRjFVVGRPYUZCYWMwMTRiak5SRWhaSFNEWkRXVTl1YTBadkxWTjBRV0Z5TVc4M1dVSjNHaUpCVDAxWlVuZERSVzlXYzFWaU9XczRZM1JsYjFaMmNsVnhhM1JGVTBabVpVeG4iLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18yOSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBBY2NlbnR1cmUiLCJsaW5rIjoiaHR0cHM6Ly93d3cuYWNjZW50dXJlLmNvbS9zZy1lbi9jYXJlZXJzL2pvYmRldGFpbHM/aWQ9MDA4OTU0MDZfZW5cdTAwMjZ1dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior Analyst, Cyber Security", "company_name": "e2i Job Bank", "location": "Singapore", "via": "via Why USPUR - E2I", "description": "•This role requires both broad and deep technology and information security industry knowledge, ability to design and architect cybersecurity solutions on Microsoft platform. Deep understanding of knowledge experience across the Microsoft suite of security technologies and solutions. Demonstrated ability to engage with company solution Owner and Enterprise Architecture Review Board on discussions related to agility, business value and end-to-end information technology security is a must. He/she will manage, lead and engage the complete life-cycle for large cybersecurity projects.\n•Responsible for setting up strategic security directives, design and architect on ASM cybersecurity posture such as:\n1.Identity Management (SSO, IAM, PAM, etc)\n2.Data Loss Prevention (IRM, AIP, Intune, etc)\n3.Other security solutions/services.\n•Ensure solutions and processes support the achievement of security and compliance requirements.\n•Experience in managing the team responsible for the administration... operational support, service delivery and provide recommendations.\n•Provides authoritative advice and guidance on Information assurance architecture and strategies to manage identified risk.\n•Establish a Governance program to support security and compliance (i.e. ISO27001, NIST, COBIT, GDPR) initiatives forward and increase security posture", "extensions": ["2 days ago", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQW5hbHlzdCwgQ3liZXIgU2VjdXJpdHkiLCJjb21wYW55X25hbWUiOiJlMmkgSm9iIEJhbmsiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IlV5T29mQlRKR01DRUZqRkFBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gV2h5IFVTUFVSIC0gRTJJIiwibGluayI6Imh0dHBzOi8vdXNwdXIuZTJpLmNvbS5zZy9qb2IvMzYxMy9zZW5pb3ItYW5hbHlzdC1jeWJlci1zZWN1cml0eS8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Threat and Intel Analyst", "company_name": "Singtel Group", "location": "Singapore", "via": "via Singtel Careers", "description": "• * ASOC Manager\n• - 2.4.1\n\nThe ASOC Manager’s responsibilities shall include, but not limited to the following tasks:\n• Overseeing and coordinating the activities of the ASOC personnel supporting the monitoring and incident response;\n• Collaborating with IHiS to ensure that effective monitoring is implemented for all environments;\n• Ensuring that processes and procedures are followed;\n• Leading the execution of response procedures to confirm, track and resolve cyber security incidents;\n• Advising IHiS on initial incident activities and subsequent incident activities;\n• Ensuring that IHiS’ senior management is informed of key situations that require escalation;\n• Providing weekly and monthly updates.\n• - 2.4.2\n\nThe ASOC Manager shall have the following qualifications:\n• At least FIVE (5) years of experience working in a Security Operation Center of similar size with the portfolio as a Security Operation Center Manager;\n• Relevant training on the proposed products, and has obtained... professional certification such as GIAC Continuous Monitoring Certification (GMON), GIAC Information Assurance Certified Intrusion Analyst (GCIA), GIAC Information Assurance Certified Incident Handler (GCIH) or Certified Information Systems Security Professional (CISSP), or equivalent;\n• The necessary soft skills. The ASOC Manager shall be continually assessed on his/her interpersonal skills and strong communication skills.\n• * Threat Monitoring Analyst (Security Analyst)\n• - 2.5.1\n\nThe Threat Monitoring Analyst’s responsibilities shall include, but not limited to the following tasks:\n• Providing continuous technical monitoring (such as intrusion identification, event correlation and threat containment), detection, correlation, analysis and support involving handling of cyber event such as identifying user security issues;\n• Performing initial analysis (e.g. analysing and reviewing alerts, eliminating false positives and determining severity of threats) to determine impact of compromise;\n• Determining the nature, mechanisms and scope of incident by performing event correlation and historical searches to determine the extent of a security compromise;\n• Performing event correlation across the In-Scope Institutions to identify similar attack pattern and spread of attack;\n• Handling case management, generating tickets and reports when required, and tracking open tickets until closure;\n• Generating incident or investigative reports.\n• - 2.5.2\n\nThe Threat Monitoring Analyst shall have the following qualifications:\n• At least TWO (2) years of experience working in a Security Operation Center with security monitoring and escalation of threats responsibilities;\n• Relevant training on the proposed products, and has obtained professional certification such as GIAC Information Assurance Certified Intrusion Analyst (GCIA), GIAC Information Assurance Certified Incident Handler (GCIH), or equivalent.\n• * Incident Investigation Analyst (Threat & Intel Analyst)\n• - 2.6.1\n\nThe Incident Investigation Analyst’s responsibilities shall include, but not limited to the following tasks:\n• Performing detailed system analysis and correlation to identify pattern of intrusion;\n• Creating use cases for detecting similar intrusion;\n• Identifying new or useful Indicator of Compromise;\n• Conducting researches and evaluating trends in remediation approaches;\n• Creating and maintaining procedures for utilising the EDR and NDR tools.\n• - 2.6.2\n\nThe Incident Investigation Analyst shall have the following qualifications:\n• At least FOUR (4) years of experience working in a Security Operation Center with security monitoring and escalation of threats responsibilities;\n• Relevant training on the proposed products, and has obtained professional certification such as GIAC Information Assurance Certified Intrusion Analyst (GCIA), GIAC Information Assurance Certified Incident Handler (GCIH), or equivalent;\n• The necessary soft skills. The Incident Investigation Analyst shall be continually assessed on his/her interpersonal skills and strong communication skills.\n• * Incident Responder\n• - 2.7.1\n\nThe Incident Responder’s responsibilities shall include, but not limited to the following tasks:\n• Being on standby for 24/7 to execute the incident response process according to the incident response standard operating procedure, and to work closely with the IHiS Threat Hunting team to effectively scope and contain incidents;\n• Conducting research and continuously improving investigative methodologies and techniques, including hard disk drive, network, and memory forensics and investigating systems for malware and reverse engineering malware;\n• Conducting and documenting research on IHiS and the In-Scope Institution to better understand the environment, as well as researching and documenting critical services and systems. Incident response toolkits shall be regularly tested on identified critical services and systems;\n• Regularly conducting meetings with IHiS to improve the incident response plan and associated documentation, run through table-top dry runs to drill all parties in responding effectively, present the latest threats, attacks and gaps in the In-Scope Institution's environment and work out how to improve the incident response procedures to match industry standards;\n• Creating and maintaining procedures for utilising the EDR and NDR tools;\n• Taking part in regular red/blue team exercises.\n• - 2.7.2\n\nThe Incident Responder shall have the following qualifications:\n• At least TWO (2) years of experience in hard disk drive, memory and network traffic acquisition and analysis;\n• Relevant training on the proposed products, and has obtained professional certification such as GIAC Information Assurance Certified Incident Handler (GCIH) or equivalent;\n• The necessary soft skills. The Incident Responder shall be continually assessed on his/her interpersonal skills and strong communication skills", "extensions": ["20 days ago", "Full–time"], "detected_extensions": {"posted_at": "20 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJUaHJlYXQgYW5kIEludGVsIEFuYWx5c3QiLCJjb21wYW55X25hbWUiOiJTaW5ndGVsIEdyb3VwIiwiY29tcGFueV9taWQiOiIvbS8wMjB6ZmwiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiI4ZzVzQmdmTmhMeWgwRXdIQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VVZOTk1ISmpSVFI0YzBGRVFrSnVOV2RVUzFRME1YSlFSM05tY1hKd1MzYzJkMWRQVkZsQmFEQTVNMjlUTUUxR2NXOVFSR2MwZVVNMmNXOXljMVEwWVRsVFNuSTNSbUl4ZG5Gc2VHaFBWM1l3YVdONWFWcERiekpDU1Roa1ltd3RPR1pyTWpoaGMwVkxiRWRZVGxNd1draDRVRVpMYTNOdFVYRkVZM1V4U1dwRWJtWXdSR2hsY2paTWNGWjFVMDVsZGxkbFducDBlbWt5YWsxbkVoWkhTRFpEV1U5dWEwWnZMVk4wUVdGeU1XODNXVUozR2lKQlQwMVpVbmREVUY5SlJ6ZFdWbGxDYTJ4NE1XUlVVRTkwWjI4eGVFVmliVEIzIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNDAiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gU2luZ3RlbCBDYXJlZXJzIiwibGluayI6Imh0dHBzOi8vZ3JvdXBjYXJlZXJzLnNpbmd0ZWwuY29tL2pvYi9UaHJlYXQtYW5kLUludGVsLUFuYWx5c3QtU2luZy81NzkxNTE1MTAvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Senior Business Analyst/Business Analyst", "company_name": "Activate Interactive Pte Ltd", "location": "Singapore (+1 other)", "via": "via LinkedIn", "description": "Activate Interactive Pte Ltd (“Activate”) is a leading IT solution and service provider headquartered in Singapore with a presence in Malaysia and Indonesia. The homegrown company was founded in 1997 with the mission of positively impacting the lives of people around us and the environment we live in through the use of technology.\n\nWe offer quality, cost-effective and impactful IT solutions and services, including mobile and web applications and cloud technology. Over the years, we have helped government agencies and enterprises remove technology roadblocks and increase their business efficiency to better serve the communities.\n\nTo amplify our efforts in improving people’s lives, Activate also develops preventive healthcare solutions that serve to increase health awareness and improve population health.\n\nWe believe that the success of a company relies on the strengths of our employees. At Activate, we are committed to provide a conducive environment and develop our employees to... realise their full potential.\n\nFrom a three-person outfit, Activate has grown into a team of more than 150 employees, delivering more than 150 solutions and services to help our clients achieve growth and success.\n\nWe have opportunities for you to grow your career path and are looking for talented professionals to join our team.\n\nJob Description\n\nThe Business Analyst/Senior Business Analyst is the main liaison between the business and IT in translating business needs into system solutions. The candidate is required to conduct research on client’s business needs, processes, requirements and its traceability. Develop and communicate effective system solutions.\n\nThe candidate should possess an analytical mind and is able to see interconnections in system solutions and usability. They should adopt a systematic approach in addressing complex issues with good judgement and arrive at effective solutions.\n• Bachelor’s degree in Computer-related discipline or equivalent\n• Minimum 8 years of IT experience\n• Minimum 6 years of IT Business Analysis experience\n• Minimum 2 years working in Agile development projects experience\n• Certified Business Analyst (CBA) certification will be an added advantage\n• Experience in developing Agile and/or UML requirements artifacts is mandatory\n\nPreference will be given to candidate with the following skillset\n• Liaise with stakeholders to identify business need\n• Review existing business processes to identify opportunities\n• Prepare business cases defining potential benefits, solutions to increase efficiencies of business processes and associated risks\n• Propose alternative solutions to streamline business processes\n• Establish requirements for the implementation of changes in the business processes\n• Conduct in-depth analysis of the business requirements specification and feasibility studies\n• Translate business requirements and user needs into functional specifications\n• Collaborate with developers to ensure requirements are incorporated into system design\n• Guide the team to gather and document existing system specifications\n• Function as the liaison between users and technical staff throughout the solution implementation cycle\n• Supervise User Acceptance Testing when needed\n• Supervise technical documentation and training materials\n• Manage user training to facilitate adoption of new systems features\n• Act as a point of contact for users regarding complex queries\n• Scope out statement of works setting clear expectations of deliverable and exclusions\n\nCommunication: Convey and exchange thoughts, ideas and information effectively through different mediums\n\nBusiness Needs Analysis: Identify and scope business requirements and priorities through information gathering and analysis as well as clarification of the solutions, initiatives and programme to enable effective delivery.\n\nStakeholder Management: Manage stakeholder expectations and needs by aligning those with requirements and objectives of the organisation. This involves planning of actions to effectively communicate with, negotiate with and influence stakeholders\n\nSense Making: Organise and analyse data and information accurately to identify relationships and detect patterns and trends to gain insights for decision-making\n\nBusiness Innovation: Identify and evaluate digitisation and innovative business opportunities provided by new advancements in information and communication technology to establish new services or businesses to bridge the physical and digital worlds\n\nEmerging Technology Synthesis: Monitor and integrate emerging technology trends and developments, structured data gathering for the identification of new and emerging technological products, services and techniques\n\nIf you love the idea of being part of a growing company with exciting prospects in mobile and web technologies that create positive impact on people’s lives, then we would love to hear from you", "extensions": ["12 hours ago", "Full–time"], "detected_extensions": {"posted_at": "12 hours ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQnVzaW5lc3MgQW5hbHlzdC9CdXNpbmVzcyBBbmFseXN0IiwiY29tcGFueV9uYW1lIjoiQWN0aXZhdGUgSW50ZXJhY3RpdmUgUHRlIEx0ZCIsImNvbXBhbnlfbWlkIjoiL2cvMTFkeHExOTJsNSIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IlpfbHNENVRVZzZLOHVZa1hBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVvc0NDc3dCUVU1VlgwNXhVVGxLTkc1bVR6aEZMVmxTY1Y5TlFVRklUMFV4WVd4bVRUSm5XV3BrTWkxdE5tVllZVEp4UnpOdlRXZFRkWGRVUkZkMFdEaHpTVGw2YW5kSVFXZG5VbE0wVmxCcmFsOXpVM3BtU1VVMlRISkxXR3BTUnpsc01VNHRMVUppY0MxTFNFTk5hR0kwZWpsNlZrTlFZazV2VGtrNWVFczBNRU55U2xsQmQzY3pUV1ZaWlV0RFEwaENWR0pEVFRGc2IxRnVkbU5mYzJkc1p6VTBhR055UVdKTmFFazBTVWhaUzBOQlRXNTFTSE01VmtjMFYyaEZUMkYzYWpWWlVHZ3pka1YxUW1WNFpYWllFaFpIU0RaRFdVOXVhMFp2TFZOMFFXRnlNVzgzV1VKM0dpSkJUMDFaVW5kRGRqVm5SMGxRZDBaM1NrcDJhbTV5U0ZaeFVXOUtPRGd4ZUVObiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzQ4IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExpbmtlZEluIiwibGluayI6Imh0dHBzOi8vc2cubGlua2VkaW4uY29tL2pvYnMvdmlldy9zZW5pb3ItYnVzaW5lc3MtYW5hbHlzdC1idXNpbmVzcy1hbmFseXN0LWF0LWFjdGl2YXRlLWludGVyYWN0aXZlLXB0ZS1sdGQtMjUxNTgwMjQ4NT9yZWZJZD1kN2YyMmRlZi0wNGVlLTQxYTctOGI3MC02NDQ0NDcwMGYyZjFcdTAwMjZ0cmFja2luZ0lkPWNpWEtTS1hXbEN4dmo4QU5wYTdJWnclM0QlM0RcdTAwMjZwb3NpdGlvbj0zXHUwMDI2cGFnZU51bT0wXHUwMDI2dHJrPXB1YmxpY19qb2JzX2pvYi1yZXN1bHQtY2FyZF9yZXN1bHQtY2FyZF9mdWxsLWNsaWNrXHUwMDI2dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Business Process Analyst (Asia Pacific)", "company_name": "NTT", "location": "Singapore", "via": "via Jobs", "description": "In a constantly changing world, we work together with our people, clients and communities to enable them to fulfill their potential to do great things. We believe that by bringing everyone together, we can solve problems using innovative technology that can create a world that is sustainable and secure. At NTT, we encourage you to remain continuously curious, as that is what keeps you fast, flexible and relevant. No two days will be the same but that is what will help you grow and realize your full potential.The power is in your hands to do great things. It’s time to lead the change, be the authentic you, to solve difficult challenges, to set the pace of change and to unleash your potential. Want to be a part of our team? Plans, performs and implements process improvement initiatives (such as Lean or Six Sigma). Diagrams and evaluates existing processes. Organizes, leads and facilitates cross-functional project teams. Develops metrics that provide data for process measurement... identifying indicators for future improvement opportunities. Collects data to identify root cause of problems. Measures performance against process requirements. Aligns improvement to performance shortfalls. Provides consultation on the use of re-engineering techniques to improve process performance and product quality. May deliver presentations and training courses including measurement, analysis, improvement and control. Surveys and analyzes best practices for techniques and processes. Communicates team progress. Performs cost and benefit analyses. Survey Tip: Employees at the highest levels typically have Six Sigma Black Belt or Master certification. Working at NTT Individuals in this position are responsible for the governance of process performance and process change. He/She will be accountable for process or assigned processes from end-to-end which includes implementation, maintenance and improvement of this process.Drives process improvement initiatives through the disciplined use of measurements, accountability, analysis and discussion of process alternatives in order to arrive at best practices. Will provide operational support for a business segment, group or team. Brings expertise or identifies subject matter experts in support of multi-functional efforts in process improvement, data capture and analysis, infrastructure support, tool ownership and compliance with procedures, etc. Advises business groups by providing strategic direction to initiative prioritization, integration and resource application. Ensures that policies and procedures align with corporate vision.Key roles and responsibilities:Development and documentation of an end-to-end processes aligned to policiesBenchmark processes against industry leaders and identify external best practices.Accountable for the overall performance and results of the process.Ensure the identification and management of critical process success factors.Manage process improvements, including opportunities for automation of process steps and data driven performance measures.Conduct process reviews and approve or reject process deviation requests.Agree on process responsibilities across organisational silos and drive adherence to the process.Reporting of process status, related KPI’s and progress to peers and executives.Facilitation, resolution of escalated cross-functional issues.Representation of the process to all external groups.Identify training needs and ensure that process owners educate relevant end users to operate processes effectively.General knowledge, skills and attributes:Expert knowledge on processes and up and downstream impact of process stepsFluent in change management and continuous improvement methods, such as Six Sigma or LeanExcellent problem solving and root cause analysis abilityComfortable with ambiguity and changeAbility to develop and entrench change techniques in an organisation Possess required technical skills Ability to make decisions fast and establish rules towards proper business management Qualifications and certifications:Relevant Bachelor’s degreeProject Management certificationSix Sigma or Lean or equivalent type certification Work experience:Significant relevant work experience combined with functional knowledge of work streamsExperience with project management methods like Scrum or AgileExperience constructing business process methodology toolbox What will make you a good fit for the role? Standard career level descriptor for job level:• Seasoned and experienced professional• Has full understanding of specialisation area• Resolves wide range of issues in creative ways• Fully qualified, career level, career journey-orientated• Uses good judgement in selecting tools and methods to solve problems• Networks with senior internal and external people in own area of expertise• Receives little instruction on day-to-day work, receives general instructions on new assignments• Typically requires demonstrable related experience with a Bachelor’s or equivalent degree; or moderate level experience or equivalent work experience Join our growing global team and accelerate your career with us. Apply today. Equal opportunity employer NTT is proud to be an equal opportunity employer with a global culture that embraces diversity. We are committed to providing an environment free of unfair discrimination and harassment. We do not discriminate based on age, race, color, sex, religion, national origin, disability, pregnancy, marital status, sexual orientation, gender reassignment, veteran status, or other protected category", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJCdXNpbmVzcyBQcm9jZXNzIEFuYWx5c3QgKEFzaWEgUGFjaWZpYykiLCJjb21wYW55X25hbWUiOiJOVFQiLCJjb21wYW55X21pZCI6Ii9tLzAxYzNmcSIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImJ0ZnhfRVFDV002N2k4OHVBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVzc0JDb3dCUVU1VlgwNXhVVWhITUc5d1pVVlliMVYxU21KMlJIbGFSMHhKU0dNeGNsTmZVbU5uYmxaMGMxQlpibU5SWjJnMlNFSTRYM05JUW1SVE9TMTVhMDQyV1UxaU4wbDJOM1kwUlhkUFgwNWtSM2xpVkRnMFZUSjNibGhFYVZaVk0zZFpkbk53UW1kUWRHcEJWMkZ1TW1reVpXSndablZYUzNsdWNYRlVhR1pXVEc1WVlXcEhNMnBuYkRKWlpEQVNGa2RJTmtOWlQyNXJSbTh0VTNSQllYSXhiemRaUW5jYUlrRlBUVmxTZDBGZmFYRndNa2xrTkdNd2FHUm9VeTFUY25KcFRqRXlORk4wTlZFIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNTYiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9icyIsImxpbmsiOiJodHRwczovL3NnLmZpZGFudG8uY29tL2pvYnMvam9iLW9wZW5pbmcvY29tcHV0ZXItc3lzdGVtcy1hbmFseXN0cy9idXNpbmVzcy1wcm9jZXNzLWFuYWx5c3QtYXNpYS1wYWNpZmljLTI3Nzg4ODcwOT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Associate​/Senior Associate, Digital Business Analyst", "company_name": "ENTERPRISE SINGAPORE", "location": "Singapore (+1 other)", "via": "via Learn4Good", "description": "Position: Associate/Senior Associate, Digital Business Analyst (2 Year Contract)\nRoles &\n\nResponsibilities\n\nYou will be working in a project team comprising various roles such as Project Manager, Scrum Master, Product Owners, Business Analyst, Solution Architect and the Technical Services Consultants, to deliver ICT capabilities including various system development and maintenance\n\nYour will be responsible for eliciting business needs and analysing business problems in order to define and deploy digital solutions to address the needs of citizens, businesses and/or public officers.\n\nYou will work with development teams (outsourced/co-sourced/insourced) for the delivery of defined digital solutions together with stakeholders.\n\nIn this role, you will work in a project team to:\n\nElicit, scope and manage business requirements Apply appropriate human-centric tools and techniques, including plan, design and facilitate workshops, map service journeys, identify challenges and opportunities... Prioritise product backlog through rigorous information gathering and analysis with stakeholders, and contribute to the development of the Functional/ Design specifications Develop the business case and Tender Specifications Evaluate and recommend digital solutions that best address the needs Undertake sprint planning, write user stories and define acceptance criteria with stakeholders Review testing and data conversion documents to verify that specifications are met Drive smooth deployment, adoption and operations of the solution Analyse impact of requested changes (Operations & Maintenance phase) Work with developers to understand and troubleshoot technical problems, as needed (Operations & Maintenance phase) Undertake root cause analysis for problems in order to implement preventive and corrective measures to meet business and performance needs (Operations & Maintenance phase)\n\nRequirements:\n\nPro-active, resourceful and self-motivated to innovate and take smart risks to achieve business goals and customer satisfaction\n\nAble to take a broad, strategic perspective as well as drill deep to understand business needs and challenges\n\nAble to facilitate discussions/workshops to elicit, manage and prioritise key business needs A team player with strong influencing and people handling skills Degree or Diploma in Computer Science, Information Systems, Information/Infocomm Technology, Computer or Electronics Engineering or related discipline Minimum 3 years of relevant business analysis working experience for Digital Business Analyst and 5 years of working experience for Senior Digital Business Analyst Participated in at least one full software or product development cycles, preferably using Agile Methodology with past development experience Proven experience in IT business analysis, application solutioning and design, and testing Strong analytical, conceptualisation and problem solving skills Excellent communication skills, both oral and written, with the ability to pitch ideas and influence stakeholders Advantageous To Have Consulting and vendor management experience Knowledge of Cloud, Data Analytics, Service Design/Design Thinking, Agile Agile Product Owner certification, Agile scrum master certification or similar Business Analysis certification (Certification of Competency in Business Analysis™ (CCBA®), Certified Business Analysis Professional™ (CBAP®)) or similar #WSIPTell employers what skills you have\n\nAccount Management\n\nBusiness Development\n\nBusiness Strategy\n\nCompetitive Analysis\n\nCRMEnterprise Software\n\nKey Account Management\n\nLead Generation\n\nLeadership\n\nManagement\n\nMarket Research\n\nMarketing\n\nNegotiation\n\nNew Business Development\n\nPre-sales\n\nProduct Management\n\nSales\n\nStrategic Planning\n\nStrategy\n\nTeam Management", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBc3NvY2lhdGXigIsvU2VuaW9yIEFzc29jaWF0ZSwgRGlnaXRhbCBCdXNpbmVzcyBBbmFseXN0IiwiY29tcGFueV9uYW1lIjoiRU5URVJQUklTRSBTSU5HQVBPUkUiLCJjb21wYW55X21pZCI6Ii9nLzExZ2d2d2w2Z3EiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJKSmNOc3d1c01ERDFOcTNGQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdllCQ3JjQlFVNVZYMDV4VkVaMGFFNXRhREo2WDBRM0xXOXdWazh4ZFhGRVRrSnNXVUpzUVhWak1VbHhjMlp4TmtsQ2NtODJOR3REVTFwM1dVZE1iVWh0Y21SNFptVm1iREkwVG5WWVVIUkRNR2RJTVVSaFVreE1ObUpXVTNvNVZHazFiM2h4YlRCSlVqSkVZV3hDU0hwU1EwSnRkbEpXUnpaNFdrbEJkeTAzVEdObmJFZHNTbFpxYW05VU5VSXlTbEpMWjJWbVJUaEtlakUzTVV0TVFXTmlZbkZPVGpCNFVEZHdSRVp3WjBoTGIySm5jVlpOWjBrd2VGUkJFaFpIU0RaRFdVOXVhMFp2TFZOMFFXRnlNVzgzV1VKM0dpSkJUMDFaVW5kRGNuZEdhemxZUW1adWJIVTVNV2h0VHpBeE1GTnlXakJ3U2xSMyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzYzIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExlYXJuNEdvb2QiLCJsaW5rIjoiaHR0cHM6Ly93d3cubGVhcm40Z29vZC5jb20vam9icy9zaW5nYXBvcmUvaW5mb190ZWNobm9sb2d5LzI3MTI3NTI0Ny9lLz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Business Operations", "value": "GC06"}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Accounting and Finance", "value": "GC01"}, {"text": "Science and Engineering", "value": "GC27"}, {"text": "Advertising and Marketing", "value": "GC03"}, {"text": "Customer Service", "value": "GC10"}, {"text": "Legal", "value": "GC17"}, {"text": "Management", "value": "GC18"}, {"text": "Protective Services", "value": "GC23"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Property", "value": "GC24"}, {"text": "Sales and Retail", "value": "GC26"}, {"text": "Social Services and Non-Profit", "value": "GC28"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "Business analyst", "value": "business analyst"}, {"text": "Analyst", "value": "analyst"}, {"text": "Security analyst", "value": "security analyst"}, {"text": "Systems analyst", "value": "systems analyst"}, {"text": "It analyst", "value": "it analyst"}, {"text": "Data analyst", "value": "data analyst"}, {"text": "System analyst", "value": "system analyst"}, {"text": "Support analyst", "value": "support analyst"}, {"text": "Test analyst", "value": "test analyst"}, {"text": "Associate", "value": "associate"}, {"text": "Management analyst", "value": "management analyst"}, {"text": "Operations analyst", "value": "operations analyst"}, {"text": "Soc analyst", "value": "soc analyst"}, {"text": "Research analyst", "value": "research analyst"}, {"text": "Senior", "value": "senior"}, {"text": "Senior analyst", "value": "senior analyst"}, {"text": "Control analyst", "value": "control analyst"}, {"text": "Intelligence analyst", "value": "intelligence analyst"}, {"text": "Manager", "value": "manager"}, {"text": "Project analyst", "value": "project analyst"}, {"text": "Researcher", "value": "researcher"}, {"text": "Risk analyst", "value": "risk analyst"}, {"text": "Service analyst", "value": "service analyst"}, {"text": "Technology analyst", "value": "technology analyst"}, {"text": "Accounting analyst", "value": "accounting analyst"}, {"text": "Application analyst", "value": "application analyst"}, {"text": "Behavior analyst", "value": "behavior analyst"}, {"text": "Business", "value": "business"}, {"text": "Center analyst", "value": "center analyst"}, {"text": "Compliance analyst", "value": "compliance analyst"}, {"text": "Coordinator", "value": "coordinator"}, {"text": "Desk", "value": "desk"}, {"text": "Desk analyst", "value": "desk analyst"}, {"text": "Financial analyst", "value": "financial analyst"}, {"text": "Functional analyst", "value": "functional analyst"}, {"text": "Hr analyst", "value": "hr analyst"}, {"text": "Interns", "value": "interns"}, {"text": "Operations center", "value": "operations center"}, {"text": "Process analyst", "value": "process analyst"}, {"text": "Programmer analyst", "value": "programmer analyst"}, {"text": "Project manager", "value": "project manager"}, {"text": "Qa analyst", "value": "qa analyst"}, {"text": "Senior associate", "value": "senior associate"}, {"text": "Senior consultant", "value": "senior consultant"}, {"text": "Specialist", "value": "specialist"}, {"text": "Sr analyst", "value": "sr analyst"}, {"text": "Support executive", "value": "support executive"}, {"text": "Technical analyst", "value": "technical analyst"}, {"text": "Technical architect", "value": "technical architect"}, {"text": "Trainee", "value": "trainee"}, {"text": "Treasury analyst", "value": "treasury analyst"}, {"text": "Wealth management", "value": "wealth management"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Internship", "value": "INTERN"}, {"text": "Part-time", "value": "PARTTIME"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Research", "value": "/business/naics2007/5417"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Mining", "value": "/business/naics2007/21"}, {"text": "Real Estate", "value": "/business/naics2007/53"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Engineering Services", "value": "/business/naics2007/5413"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Utilities", "value": "/business/naics2007/22"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "SingTel", "value": "/m/020zfl"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "Trustwave", "value": "/m/0n3xjf5"}, {"text": "Government Technology Agency", "value": "/g/11gh0528nq"}, {"text": "OCBC", "value": "/m/055r27"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "Credit Agricole Group", "value": "/m/028vbm"}, {"text": "HSBC", "value": "/m/01vq1f"}, {"text": "Randstad Singapore", "value": "/g/11g70b50mr"}, {"text": "UL", "value": "/m/01q1gj"}, {"text": "VISA", "value": "/m/01kqjn"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "American Express", "value": "/m/01w6dw"}, {"text": "Avensys Consulting", "value": "/g/11g7022gjf"}, {"text": "Binance", "value": "/g/11hcz1r4wl"}, {"text": "BlueVoyant", "value": "/g/11h1y4qdlf"}, {"text": "Caterpillar", "value": "/m/0319hp"}, {"text": "Cognizant Singapore, Cognizant Technology Solutions", "value": "/m/03bf9h"}, {"text": "DBS Bank Ltd", "value": "/m/01q7n5"}, {"text": "Deloitte SEA", "value": "/g/11f_g4x9d_"}, {"text": "Dyson", "value": "/m/05cskg"}, {"text": "EPAM Systems", "value": "/m/0dlnrc"}, {"text": "Experis Singapore", "value": "/g/11dxpnwm3s"}, {"text": "JPMorgan Chase & Co.", "value": "/m/01hlwv"}, {"text": "Jobline Resources Pte Ltd", "value": "/g/11gp2647pn"}, {"text": "Medtronic", "value": "/m/03z4j3"}, {"text": "Mizuho Bank", "value": "/m/022103"}, {"text": "Public Service Division", "value": "/g/11g6__bv10"}, {"text": "RECRUIT EXPRESS PTE LTD", "value": "/g/11g706hzhq"}, {"text": "RHB Singapore", "value": "/g/11c73srg7f"}, {"text": "SITA", "value": "/m/06l20z"}, {"text": "Selby Jennings", "value": "/g/11fy2ds3gn"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "Xcellink Pte Ltd", "value": "/g/11c73prcqy"}, {"text": "Xilinx", "value": "/m/03dwkc"}, {"text": "103 Golden Agri International Pte Ltd", "value": "/g/11fy210tb9"}, {"text": "Activate Interactive Pte Ltd", "value": "/g/11dxq192l5"}, {"text": "Amazon", "value": "/m/0mgkg"}, {"text": "Apple", "value": "/m/0k8z"}, {"text": "Aramco", "value": "/m/01qjg2"}]}]}