{"search_metadata": {"id": "60827aecd3aba21409dff8cf", "status": "Success", "json_endpoint": "https://serpapi.com/searches/8808162a1f593ae2/60827aecd3aba21409dff8cf.json", "created_at": "2021-04-23 07:44:44 UTC", "processed_at": "2021-04-23 07:44:44 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28solution+architect%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=160", "raw_html_file": "https://serpapi.com/searches/8808162a1f593ae2/60827aecd3aba21409dff8cf.html", "total_time_taken": 3.11}, "search_parameters": {"q": "(solution architect) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "160"}, "jobs_results": [{"title": "Solution Architect - Cloud/API", "company_name": "Michael Page", "location": "Singapore", "via": "via Neuvoo", "description": "• Newly Created Role\n• Great Working Environment\n\nAbout Our Client\n\nOur client is a well-established organisation with strong presence in Singapore. They are looking to hire a Solution Architect- Cloud/API.\n\nJob Description\n\nAs a Solution Architect-Cloud/API, you will be responsible for the following:\n• Planning and implementing the business requirements into architectural design for the business.\n• Working with internal stakeholders to understand the technical requirements and come up with the solution accordingly.\n• Identifying and defining integration best practices and ensure proper technical documentation.\n• Managing the full software development life cycle and be the subject matter expertise for business users.\n• Researching and providing technical guidance to teams on new technologies.\n\nThe Successful Applicant\n\nAs a successful candidate you will have a bachelor's degree in Computer Science or equivalent with at least 8 years of experience in software development across web and... mobile technologies, backed by a proven track record of working with API integration's. You will also be extremely familiar with major programming languages such as Java, .Net, C++ etc. You will have a strong understanding on the entire Software Development Life-cycle, Agile Techniques and DevOps Practices. Prior expereince in cloud technologies will be good to have.\n\nWhat's on Offer\n• Newly Created Role\n• Great Salary Package", "extensions": ["16 days ago", "Full–time"], "detected_extensions": {"posted_at": "16 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2x1dGlvbiBBcmNoaXRlY3QgLSBDbG91ZC9BUEkiLCJjb21wYW55X25hbWUiOiJNaWNoYWVsIFBhZ2UiLCJjb21wYW55X21pZCI6Ii9tLzA0Y3hsZHciLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJKbGZiV0lUenV5NTdidjR5QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUlCQ3FJQlFVNVZYMDV4VkVGNVkzVktaekIyWlV0aGVWVXRVazl1TFY5RlRraHVUMDFsYjJ0MGRsSlpOVGsxWVc1cWExZDBURlpSTlZOMVYxTjBORzA0UkZkVVEwSTVlV1ZwVkdsTU5tY3RhamRrUjNWNU9XcDBWMHBqU1ZnelIyRjNaVmRSZGtGdU1WSklORUZtV1VvNVRXTmZkWEZwTjBoUE5YcDFjMDlHTlV0TmJUWmpibWRuY3kxa2VtdzRhRVF3UW5aS0xWRjFMVWN0UVVGTGFqUkxlSEU1ZG10QkVoYzNibkZEV1VsbFVVMXZNbEE1VUhkUU4xOHlRekpCV1JvaVFVOU5XVkozUTNVeGJtWlNhVFJsVVVwQlFVOTRiMjVLWkhoWWNFVldURTlWVVEiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY183IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE5ldXZvbyIsImxpbmsiOiJodHRwczovL3NnLm5ldXZvby5jb20vdmlldy8/aWQ9ODQxNjFjYTIwNzgxXHUwMDI2dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Payments Technical Architect - Analyst", "company_name": "Evolution Recruitment Solutions PTE. LTD", "location": "Singapore (+1 other)", "via": "via Monster Singapore", "description": "Job Description :\nWe are looking for a strong technical architect or technical business analyst who comes from a software engineering background and experience in the payments space, specifically in the following areas:\n• Payment Services Provider / PSP onboarding flows\n• Payment Facilitator Onboarding and certification flows\n• Payment Processing Acquiring\n• Card Issuing / Scheme Onboarding (Visa, MasterCard, JCB, ...)\n• Card tokenization and wallet services\n• POS fleet management, rollout and certification (L2 / L3 certification)\n• E-money / wallet (not crypto) architecture\n• Issuer Processing\n• MOTO / Virtual Terminals\n• Core banking / Ledger implementations\n• EMV standards / ISO8583\n\nThis is an excellent opportunity for an ambitious individual to come in and help shape the technical roadmap for a leading payments company. If this sounds like something that you are passionate about and aligned with, please reach out to [Confidential Information]\nPlease contact #ConsultantFirstname... #ConsultantSurname (Reg No. #Consultant_RegNo) at #CompanyName (Licence no. #CompanyLicenceNo", "extensions": ["28 days ago", "Full–time"], "detected_extensions": {"posted_at": "28 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQYXltZW50cyBUZWNobmljYWwgQXJjaGl0ZWN0IC0gQW5hbHlzdCIsImNvbXBhbnlfbmFtZSI6IkV2b2x1dGlvbiBSZWNydWl0bWVudCBTb2x1dGlvbnMgUFRFLiBMVEQiLCJjb21wYW55X21pZCI6Ii9nLzExYzczeThrN2siLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJrWnh4dGFIeVV1OWQzZGo0QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFcmNDQ3ZjQlFVNVZYMDV4VWxOYWIwMTVUV0V3TjFoWFVVRlFhbXRhWTJWcU1WcElhVkZGUzBoQ1YzcHpUWGxIVW5saFJubExhakI0UldsMU56WjRNVmhWU0dSS2VGbFJhMlpUT1RaSU1VMVBlVk13VTJ0aVpHMDJjVTkwT0c1UlpUZFFjVlpZYTFSdE5EWllURGxaVFhVM00yZHRXazlOZUZWelNrUnFhMmc0ZUhaWFlWQlRWV3h2VkZsbU9TMHdhR1IwTTIxRmVuWXlaVkpZZGpaeGJYbGFjVkZTWVc1bmQxSnBkbk5LVUdoM09GVmxVQzFLTmxoUmFEZHdUbEprVEdkWE9HcEliVU5FV0VaNU56VnVNMkZWZW5Ca1UxRjNWVmRuYmpFeFZEaDVaSFJFYjBoNmJteG1ORWMxVFZGMFRIUXRTSFI1ZW1sS2F5MURZeElYTjI1eFExbEpaVkZOYnpKUU9WQjNVRGRmTWtNeVFWa2FJa0ZQVFZsU2QwTnVhRU5QUm5JMmJVTmhiMEp6ZUVGdWMyZDRlakJsZUc1RWVtYyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzE0IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1vbnN0ZXIgU2luZ2Fwb3JlIiwibGluayI6Imh0dHBzOi8vd3d3Lm1vbnN0ZXIuY29tLnNnL2FtcC9qb2ItdmFjYW5jeS1wYXltZW50cy10ZWNobmljYWwtYXJjaGl0ZWN0LWFuYWx5c3QtZXZvbHV0aW9uLXJlY3J1aXRtZW50LXNvbHV0aW9ucy1wdGUtbHRkLXNpbmdhcG9yZS0yNzQ4MTc1My5odG1sP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "AWS Architect", "company_name": "None", "location": "Singapore", "via": "via Jobs", "description": "The AWS Architect is at the leading edge of digital transformation with customers using AWS, helping shape the conversation with senior executives and building / creating new digital transformation opportunities. The role holder will have a real passion for AWS as a technology platform and will have practical hands on experience of designing and delivering enterprise scale solutions for customers using AWS.The role holder will be able to lead discussions with customer technical decision makers and translate business requirements into secure, reliable and highly available technology solutions that deliver real customer value. They will also need to be adept at managing constant business change, rapidly evolving requirements, adjustments in strategic direction, and keeping current on emerging technology solutions.Primary Responsibilities:· Building deep technical relationships with senior executives and designing innovative solutions for large or highly strategic accounts· Technical... leadership, design and delivery of enterprise scale solutions that deliver high levels of performance, security, scalability, maintainability and reliability· Driving a culture of IP development and reuseQualifications and Experience· 5+ years of leading consultative/complex technical sales and deployment projects, architecture, design and implementation· Demonstrated excellence with consulting skills and presenting complex development topics to both business executive and technical personnel· Proven track record of building deep technical relationships with senior executives and helping to build innovative cloud solutions in large or highly strategic accounts· AWS Solutions Architect – Professional qualification preferred; certification is expected within 12 months of joiningThe role holder is expected to be a subject matter expert in one or more of the following:· Cloud infrastructure solutions (i.e. Windows and Linux IaaS, SAP, BCDR, Security, Management, Storage, Networking, OSS, containers and Infra as a code technologies)· Cloud application development solutions (e.g. PaaS, Serverless, API Management);· Container orchestration (e.g. Kubernetes, Cloud Foundry, EKS);· Continuous integration technologies (e.g. Jenkins, Spinnaker, AWS Code* Services, Chef, Puppet);· Web application server technologies, cloud application design, software architecture and practices; (design/development/deployment, Agile, SCRUM, ALM)· Experience with scalable architectures using AWS API Gateway, API management, serverless technologies, container orchestration (e.g. EKS, Kubernetes, Cloud Foundry etc.), API management, microservice frameworks (AWS Lambda) etc", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBV1MgQXJjaGl0ZWN0IiwiY29tcGFueV9uYW1lIjoiTm9uZSIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiakkzYnVXOHI1V3VsdXYwV0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIiwibGluayI6Imh0dHBzOi8vc2cuZmlkYW50by5jb20vam9icy9qb2Itb3BlbmluZy9hcmNoaXRlY3RzLWV4Y2VwdC1sYW5kc2NhcGUtYW5kLW5hdmFsL2F3cy1hcmNoaXRlY3QtMjc1NDYxNTE1P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Senior Partner Solutions Architect - Business Consulting & Advisory Partners", "company_name": "None", "location": "Singapore", "via": "via LinkedIn", "description": "In this role, you will be responsible for evangelizing the AWS platform to the key Business Consulting & Advisory Partners (BCAP) across the ASEAN area so they can advise our joint customers on the right approach to adopt cloud. Working with these important partners is a team effort that will require cooperation and coordination with many stakeholders. You should be just as comfortable talking to technical teams as well as consultants who regularly influence the board and C-level executives of our Enterprise clients. The right candidate will have experience in leading global IT transformation and technology strategy with enterprise companies, demonstrated experience in developing strategic technical initiatives, a proven track record of leading and driving multiple complex customer engagements, and excellent communication skills.\n\nIf you are a problem solver with broad technical skills, and have the ability to drive technical initiatives with our strategic partners you will enjoy this... role.\n\nIn this role you will develop and execute workshops with partner consultants and executives, lead white boarding sessions, author white papers and blog posts, and respond to technical inquiries.\n\nAs a Solution Architect focused on our strategic business partners within Amazon Web Services (AWS), you will have the opportunity to help shape and take initiative to produce results on a strategy to build mind share and broad use of the AWS platform across our partner community.\n\nRoles & Responsibilities\n• Technical leader and trusted adviser in the area of cloud computing for the community of BCAP partners\n• Able to create business architecture models demonstrating how products, operations and systems inter operate within the organization\n• Ensure solutions developed across organization are aligned to enterprise architecture standards and principles, leverage common solutions and services, and meet financial targets (cost and benefits)\n• Assist our partners by enabling them on AWS services by delivering workshops, lead white boarding sessions & being the key technical advisor to them on AWS services.\n• Guide and mentor our strategic partner consultants by connecting them with our other teams and initiatives around Mass Migrations, SAP, Digital Innovation in order to drive common outcomes to our joint customers. You will be comfortable with both business and technical aspects of these initiatives.\n• Work with the digital and engineering groups within the BCAP partners to build up their AWS competencies and develop joint solutions.\n• Demonstrate a bias for action and deep technical skills by authoring joint technical white-papers, technical case studies, or blog posts with our partners\n• Understand diverse perspectives of technical vision, creativity, technical acumen, and deep AWS technical skills by jointly designing and developing industry and vertical solutions\n\nBasic Qualifications\n• Passion for technology with some hands on experience within the last three years\n• Able to deliver technical presentations to a wide and senior audience\n• Past experience leading white boarding sessions and delivering workshops to architects, operations staff, developers, and cloud technologists\n• Demonstrated ability to think strategically, and act tactically, about business, product, and technical challenges\n• Technology Breadth: Demonstrate architectural best practices applied across a breadth of technologies to solve organizational problems, articulate views/roadmaps for future development, and understand the interaction between infrastructure, operations, and development\n• Technology Depth: Demonstrate detailed knowledge of concepts, implementation, patterns, and issues of at least a couple of technology areas such as Machine Learning, IoT, Mobile & Analytics.\n• Exhibit the attributes of learn and be curious by demonstrating the ability to collaborate effectively with a talented team in order to incorporate information about new technologies and business models\n• 10+ years of IT experience\n• Cloud experience with at least one of the major public cloud providers (AWS, Azure, GCP)\n\nPreferred Qualifications\n• Demonstrated ownership and involvement in a recent large Enterprise IT project or software development effort\n• Experience writing technical content, white papers, technical articles, or blog posts\n• 15+ years of IT experience\n• Consulting experience\n• AWS Certifications: AWS Certified Solutions Architect - Associate Level, AWS Certified Developer - Associate Level, AWS Certified SysOps Administrator - Associate Level; and AWS Certified Solutions Architect – Professional, AWS Certified Devops Engineer - Professional\n\nAmazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer, and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, disability, age, or other legally protected status", "extensions": ["30 days ago", "Full–time"], "detected_extensions": {"posted_at": "30 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgUGFydG5lciBTb2x1dGlvbnMgQXJjaGl0ZWN0IC0gQnVzaW5lc3MgQ29uc3VsdGluZyBcdTAwMjYgQWR2aXNvcnkgUGFydG5lcnMiLCJjb21wYW55X25hbWUiOiJOb25lIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJkemIwWTMyd2x2amU1bGRKQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExpbmtlZEluIiwibGluayI6Imh0dHBzOi8vc2cubGlua2VkaW4uY29tL2pvYnMvdmlldy9zZW5pb3ItcGFydG5lci1zb2x1dGlvbnMtYXJjaGl0ZWN0LWJ1c2luZXNzLWNvbnN1bHRpbmctYWR2aXNvcnktcGFydG5lcnMtYXQtbm9uZS0yNTAwNjA5OTQ3P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Team Lead – AWS (BB-CE97C)", "company_name": "BENTEC COMPONENTS & TRADING PTE. LTD.", "location": "Singapore (+1 other)", "via": "via BeBee", "description": "Roles & Responsibilities• Act as Subject Matter Expert for AWS Services including Key services like IAM, Lambda, Elastic Search, Google Apigee Edge, RDS-MySQL, Servers, Network and Security, Automation, Devops , Migration , Serverless Cloud architecture and implementation features • Develop a library of deployable and documented AWS cloud design patterns as a basis for deploying services to the cloud• Define optimal well architected AWS design patterns and solutions for high availability and disaster recovery for applications• Ensure delivered solutions meet/perform to technical and functional/non-functional requirements• Provide technical expertise and ownership in the diagnosis and resolution of an issue, including the determination and provision of workaround solution or escalation to service owners• Ensure delivered solutions are realized in time frame committed; work in conjunction with project sponsor to size and manage scope and risk• Provide support and technical governance... expertise related to cloud architectures, deployment, and operations• Provide thought leadership in industry and to fellow team members across business and technical project dimensions solving complex business requirements• Advocate and define cloud architecture vision from a strategic perspective, including internal and external platforms, tools, and systems• Act as the coach and mentor to team members and technical staff on their assigned project tasks• Develop a cohesive team and ensure their continued success• Lead the definition and development of cloud reference architecture and management systems• Conduct work reviews with team members• Documentation - Incident Management, Change Management, Release Management and Documentations• Provide backup, recovery, housekeeping, archival and restoration management with annual server and data backup/restoration exercise• Monthly Performance and Operations Reporting 1.Graduation/ Post graduation or equivalent. B.E, B. Tech/ MCA preferred2.AWS Certification – AWS Professional Solution Architect /Sys Ops and any other AWS certification will be added advantage3.Has Helped Mid-Size or Large Enterprises in their AWS Cloud adoption Journey, Digital Transformation, Building Cloud Native and Greenfield Serverless Applications, Cloud Native Optimisations and Modernisation, SaaS , Single Tenant to Multi-Tenant Re-Architecture, Big Data and Analytics Solution, Containerisation4.5 to 6 years related experience in Architecting AWS Infrastructure , Migration , Deployment and Managed Services 5.Ability to identify problems, mediate issues, develop solutions, and implement appropriate courses of action6.Excellent oral and written English communication skills with a high attention to detail and impeccable time management skills.7.Resident of SingaporeTell employers what skills you haveAgile MethodologiesBusiness AnalysisDesign PatternsDevOpsGoogleJavaLeadershipManagementProject ManagementSearchSoftware DevelopmentTeam LeadershiparchitectingelastiCRDSMySQL server", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJUZWFtIExlYWQg4oCTIEFXUyAoQkItQ0U5N0MpIiwiY29tcGFueV9uYW1lIjoiQkVOVEVDIENPTVBPTkVOVFMgXHUwMDI2IFRSQURJTkcgUFRFLiBMVEQuIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiIwd2JPek5vdGFEUHpqd01jQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJlQmVlIiwibGluayI6Imh0dHBzOi8vc2cuYmViZWUuY29tL2pvYi8yMDIxMDQxNy01ZTFjODM2MDk5NzcwY2IyY2E4NzEyNGJhNjVjZTk3Yz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Cyber Security Lead Architect", "company_name": "Singtel Group", "location": "Singapore", "via": "via Singtel Careers", "description": "Summary\n\nThe NCS Cyber Security Engineering team is looking for a talented and highly motivated individual to take on a leadership position to lead a team and to design and build the enterprise architecture. Reporting to the Chief Information Security Officer, the Cyber Security Lead Architect is a vital member of the Cyber Risk Management & Security Leadership team. The Cyber Security Lead Architect will act as the subject-matter-expert to provide sound advice and conceptualize new security solutions to meet the challenging requirements. At NCS, the successful candidate will have the right level of autonomy to shape the enterprise architecture and make IT happen.\n\nResponsibilities:\n• Lead a cyber security engineering team and drive the enterprise security architecture model.\n• Design, build and implement enterprise security solutions to protect against advanced cyber security threats across the organization’s diverse environment.\n• Be the security engineering subject matter expert... and collaborate with infrastructure team to enhance, configure and support existing and new enterprise security solutions.\n• Plan and solution the future enterprise security architecture model including DevSecOps and Cloud environment.\n• Drive multiple security enterprise security projects to completion within the stipulated timeline.\n• Assess and identify enterprise security gaps and provide security control measure to mitigate cyber threats.\n• Responsible for the maintenance and creation of security solutions’ diagrams and documentations.\n• Engage and collaborate with security vendors to conduct Proof of Concept solutions.\n• Responsible for the remediation of enterprise security solutions' issues.\n• Provide strong engineering support for critical security operations solutions.\n• Keep abreast of the latest cyber security solutions advancement and the evolving cyber threat landscape.\n\nThe ideal candidate should have/be:\n• Degree/Diploma or higher in Computer Science, Information Systems or equivalent\n• At least one security certification is preferred, such as CISSP, Certified Information Security Management (CISM), PMP or any SANS GIAC Security Certifications.\n• At least 8 years of experience in cyber security engineering and architecture.\n• In-depth experience with security solutions like: XDR, PAM, DAM, IPS/IDS, Anti-DDoS, SIEM, MDM, Data Leakage Prevention, Data Classification, Security Orchestration, Automation and Response, Cloud Proxy and Cloud Access Security Broker.\n• Experience with providing operations support on enterprise security tools.\n• Experience in design and implementation of a secure infrastructure on major Cloud platform providers and have sound knowledge of cloud security controls, cloud security best practices and industry security requirements.\n• In-depth knowledge of Identity and Access Management System and DevSecOps.\n• Ability to lead an engineering team and work independently with minimal supervision.\n• Strong project management, problem solving, oral and written communications skills.\n• Ability to manage 3rd party vendor engagements and drive any issues to completion.\n• Ability to collaborate with internal enterprise infrastructure engineers to implement cyber security solutions.\n\nApply today to be part of the winning team that does great work!\n\n#NCSlife", "extensions": ["2 days ago", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDeWJlciBTZWN1cml0eSBMZWFkIEFyY2hpdGVjdCIsImNvbXBhbnlfbmFtZSI6IlNpbmd0ZWwgR3JvdXAiLCJjb21wYW55X21pZCI6Ii9tLzAyMHpmbCIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IklzWEF2bGZuaDUybkFiR3RBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1SUJDcUlCUVU1VlgwNXhVelpOWkVKNU0yWnpVMGt5TUZsc2RHdG5XVzlJVFRobE5YbGFVMHQ0VDA5dVNuSmFRbGg2YzFKSlFUTTJTR0pDTVdVNExUQk5ia1ZwVDBWNVgzSXhOR3BhYURWNWRraEZUREZTVTIxR2FsWnZhMUUyVjNkdFdsUk9hMHAyYUVSRldsaEdabGhIY2sxYU5XMU9NbUl0Wlc5M1JuRmtOMHBXVW5vMGRHNDFRM1UwZFU1bmNESmZla3R2TFRCTU9FaEVTRFJOZVZGeGFrbDZWVTluRWhjM2JuRkRXVWxsVVUxdk1sQTVVSGRRTjE4eVF6SkJXUm9pUVU5TldWSjNRbEpHWW04eU0wazJXVlZRZFU0MlEzaFFXbTl4ZUdoWVRpMVNVUSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzMzIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFNpbmd0ZWwgQ2FyZWVycyIsImxpbmsiOiJodHRwczovL2dyb3VwY2FyZWVycy5zaW5ndGVsLmNvbS9qb2IvQ3liZXItU2VjdXJpdHktTGVhZC1BcmNoaXRlY3QtU2luZy81Nzk5OTQ0MTAvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "#SGUnited, Pega Solutions Architect / Senior Developer", "company_name": "YM Global Technologies", "location": "Singapore", "via": "via Glassdoor", "description": "Job Code: J18SGP\n\n#SGUnited Location: Singapore Date posted: 28/12/2020 Multiple roles Email: HR@YMGIT.com We are looking for a strong PEGA Solutions Architect / Developers with good experience in banking Domain. Idle candidate must have a first class degree in Information Technology, strong Pega implementation knowledge, hands on experience and open to work on Pega Implementation / Development or support projects. Must have: Pega PRPC CSA/ /CLSA certification At least 4 years’ in-depth hands on application development experience in Pega PRPC and Pega frameworks Strong communication and analytical skills Able to work independently in gathering requirements from users, designing, implementing, maintaining application systems and project management Experience in Java, strong experience in development of multi-tier applications using JAVA, Tomcat-5.5, WebLogic servers. Familiar with web services like SOAP 1.2, WSDL 2.0 and XML 1.0. Good experience in an IT Application Support/Maintenance... or Development environment Strong analytical and communication skills Candidate having Banking domain will have an advantage\n\nLocation: Singapore\n\nStatus: Open\n\nTo Apply - Please send your detailed CV to hr@ymgit.com", "extensions": ["23 days ago", "Full–time"], "detected_extensions": {"posted_at": "23 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiIjU0dVbml0ZWQsIFBlZ2EgU29sdXRpb25zIEFyY2hpdGVjdCAvIFNlbmlvciBEZXZlbG9wZXIiLCJjb21wYW55X25hbWUiOiJZTSBHbG9iYWwgVGVjaG5vbG9naWVzIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJXR3REWlE4T1R5bDlvekJhQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEdsYXNzZG9vciIsImxpbmsiOiJodHRwczovL3d3dy5nbGFzc2Rvb3Iuc2cvam9iLWxpc3Rpbmcvc2d1bml0ZWQtcGVnYS1zb2x1dGlvbnMtYXJjaGl0ZWN0LXNlbmlvci1kZXZlbG9wZXIteW0tZ2xvYmFsLXRlY2hub2xvZ2llcy1KVl9JQzMyMzU5MjFfS08wLDUwX0tFNTEsNzMuaHRtP2psPTM3ODk0NTgxODBcdTAwMjZ1dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Cloud Infrastructure Architect", "company_name": "NTT Singapore Digital Business Solutions Pte Ltd", "location": "Singapore", "via": "via Monster Singapore", "description": "The roles of the Cloud Infrastructure Architect needs focus on a variety of activities such as :\n• Client consulting\n• Architecting and designing,\n• Deployment activities\n• As well as contributing to project delivery planning\n• Build work & hands on support\n• Migration activities planning & support\n• Testing Cloud solutions for Hybrid platforms.\n\nAs an Cloud Infrastructure Architect, you will get exposure to the following types of roles & responsibilities :\n• Public & Hybrid Cloud solutions – architecting, designing, building and testing new cloud solutions. Often large and complex projects, with inputs from multiple technology domains (network, compute, monitoring, security).\n• Cloud migrations- Apps, data and workloads, infrastructure consolidation and transformation programmes\n• Responsible for Billing(50%) & generate revenue via order booking, focus on CM% (Contribution Margin)\n\nKey Skills & Experience required\n• Cloud Infrastructure Architect should have a minimum experience... level of 12-16 years, with evidence of exposure to Enterprise Cloud Infrastructure projects during this time\n• Knowledge of the various Cloud Adoption Framework and related tools\n• Proven track record in providing design and consultancy covering cloud Infrastructure, availability, security, scalability, operability and extensibility\n• Cloud integration aspects for hybrid solutions such as WAN networking, Direct Peering, VPN, B2B, B2C, Active Directory, etc.\n• Cloud hybrid solutions such as Cloud Interconnect, Cloud VPN, Anthos, Hybrid Indentity scenariosKnowledge of cloud-native and 3rd party tools for management, monitoring security and automation\n• Exposure to cloud governance, billing and optimisation, and target operating models\n• Exposure to application discovery and dependency mapping as part of app migration and rationalisation activities and tooling\n• Architecting and deploying Enterprise Cloud Infrastructure solutions as part of Public, and Hybrid cloud platforms\n• Experience of upgrades, consolidation as well as new deployments\nCloud Infrastructure Architect Certification\n• Cloud architect certification on any one of these GCP/Azure and AWS platforms are must and knowledge of and certification any other Cloud platforms is desirable\nNTT Singapore Digital Talent Services.\nEA Reg. No. R1330510 | EA License No. 12C6296", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDbG91ZCBJbmZyYXN0cnVjdHVyZSBBcmNoaXRlY3QiLCJjb21wYW55X25hbWUiOiJOVFQgU2luZ2Fwb3JlIERpZ2l0YWwgQnVzaW5lc3MgU29sdXRpb25zIFB0ZSBMdGQiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IkxoVC1YM3hoWm8xSFU2VFlBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTW9uc3RlciBTaW5nYXBvcmUiLCJsaW5rIjoiaHR0cHM6Ly93d3cubW9uc3Rlci5jb20uc2cvam9iL2Nsb3VkLWluZnJhc3RydWN0dXJlLWFyY2hpdGVjdC1udHQtc2luZ2Fwb3JlLWRpZ2l0YWwtdGFsZW50LXNlcnZpY2VzLXB0ZS1sdGQtc2luZ2Fwb3JlLTIwMTgzODI/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "AWS Solution Architect", "company_name": "None", "location": "Singapore", "via": "via Jobs", "description": "Key responsibilities include: Independently lead client design workshops and provide tradeoffs and recommendations Design Native Cloud Application Architectures and/or optimize/modernize applications for AWS Author tech blogs,case studies and whitepapers on AWS technical and strategic topics Business Case development with solid cloud economics justification of TCO and ROI Application assessment, 6R migration planning, cloud sysops and landing zone design Contribute to the AWS community by the way of technical collaterals, knowledge assets Provide solutions to complex business problems for area(s) of responsibility where analysis of situations requires an in-depth knowledge of client organizational objectives. Set tactical and strategic direction to establish short and long term goals for area of responsibility. Qualification Minimum of 3-5 years of experience with Amazon Web Services. Candidate must have strong experience with multiple AWS services beyond traditional IaaS. Good... familiarity of AWS PaaS services e.g. RDS/Load Balancers/CludFront is a must Candidate must have at least 2 AWS Associate Certifications or 1 AWS Professional Certification Hands-on AWS experience with a minimum of 2 implementations (preferred in Enterprise scale environments) Experience with at least one programming language(compiled or scripted languages). Python is preferred. Experience with core AWS platform architecture, including areas such as: Organizations, Multi Account Design, VPCs, Subnets, Security Groups etc Backup and Disaster Recovery approach and design including multi AZ/Region recovery Environment and application automation using DevOPs and IaC (Infrastructure as Code) Cloud Formation and third-party automation tools e.g. Terraform Network connectivity, Direct Connect, VPNs, security (DDOS mitigation, WAF etc) AWS Cost Management and Optimization Candidate must have 5+ years of IT and Technical Architecture experience, including project/team management activities such as: Technical Project/Program Management Operational Budget Management Technology Delivery Lead for medium size project or greater Discussing technologies with an IT director or VP level resources Good to have – Agile and Scrum methodologies Must have excellent communication skills both written and oral Preferred Qualifications Bachelor's degree or equivalent Experienced AWS Cloud Architect with specialization in at least one of the following areas: AWS Cloud Strategy: Business Case development, application assessment and migration planning, Cloud Operating Model design AWS Security:Compliance, Cloud Security Architecture, third-party security tools/platforms, encryption/KMS/CloudHSM, Inspector, Macie, IAM policies/roles, Shield, WAF, etc. Cloud Native Application Architecture: AWS PaaS/FaaS services, Serverless architecture, Lambda, API Gateway, Containerization and Microservices, Lightweight architectures including JavaScript frameworks (Backbone.js, AngularJS, React), single page applications, and modern web/mobile applications. AWS Migration:Optimization of applications to scalable cloud designs, rearchitecting applications to modern cloud patterns, and database migration (including cross-platform) Enterprise packaged/COTS Applications on AWS: SAP / HANA, Oracle Applications,WebMethods, etc. on AWS. Big Data: NoSQL data model design, DynamoDB, Redshift design and tuning, Athena, etc. DevOps and Infrastructure as Code: AWS environment and application automation utilizing CloudFormation and third-party tools (Chef, Puppet, Ansible, etc.). CI/CD pipeline setup using AWS services such as CodeBuild/Commit/Deploy Experienced in the Software Development Lifecycle and Agile Methodologies Experience with application architecture patterns and best practices Proficient with JSON and AWS CloudFormation Ability to script in bash/Python and/or Powershell", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBV1MgU29sdXRpb24gQXJjaGl0ZWN0IiwiY29tcGFueV9uYW1lIjoiTm9uZSIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiVERXQnZzNUV6U19wb2FGZUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIiwibGluayI6Imh0dHBzOi8vc2cuZmlkYW50by5jb20vam9icy9qb2Itb3BlbmluZy9hcmNoaXRlY3RzLWV4Y2VwdC1sYW5kc2NhcGUtYW5kLW5hdmFsL2F3cy1zb2x1dGlvbi1hcmNoaXRlY3QtMjc1NDMwMDczP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Solution Architect", "company_name": "Nokia", "location": "Singapore", "via": "via LinkedIn", "description": "About Nokia\n\nAt Nokia we create the technology to connect the world. Developing and delivering the industry's only end-to-end portfolio of network equipment, software, services and licensing that is available globally. Through our research teams, including the world-renowned Nokia Bell Labs, Nokia is leading the world to adopt end-to-end 5G networks that are faster, more secure and capable of revolutionizing lives, economies and societies. Nokia adheres to the highest ethical business standards as we create technology with social purpose, quality and integrity. A truly global company, we are 160 nationalities working in more than 100 countries.\n\nAbout IP Optical Networks\n\nOur IP/Optical Networks business group (ION) includes IP, optical and network automation technologies and related services sold to our communication service provider customers as well as adjacent markets including webscale companies and enterprises. Our comprehensive wide area networking (WAN) solutions enable our... customers to build and operate automated, secure, and high-performance networks at massive scale – helping to interconnect people and things from any broadband access modality to – and among - edge clouds, central clouds, the Internet, and other services and data centers.\n\nJob Description\n\nThis is an exciting role that demands a broad and in-depth knowledge of IP/MPLS networks. The successful candidate will be tasked to design robust, scalable and resilient ISP, Mobile BackHaul and in general Telco networks. The engineer will be exposed to the latest and cutting-edge technologies such as MPLS SR, WAS SDN controller, DC Fabric and so on.\n\nJob Responsibilities & Competencies\n• Gather customer requirement\n• Liaise with pre-sales to nail down the key elements of the proposal\n• Oversee the end to end architecture including backhaul and datacenter\n• Be a single point for any escalation pertaining the design\n• Leverage on Nokia back end team to deliver the HLD, LLD and Acceptance test documents\n• Review the design documents produced by Nokia back-end team to ensure an adequate quality is met\n• Validate the solution in a lab environment whenever required\n• Handover all the documentation to the TPM and Network Integration team\n• Present the design document to the customer and carry out any amendments if required\n• Liaise with PLM for any feature gap\n• Regularly report design progress to PM and TPM\n• Actively involved in internal and external design workshops\n\nQualifications\n• Degree in Computer Science or Telecommunication\n• At least 10 years of experience in network design or similar role\n• 10 years in customer fronting role\n• Be able to present to a different type of audience\n• The candidate should possess hands on skills on carrier grade routers\n• Be a fast learner and able to self-study\n• Ideally has experience in building up complex networks spanning across DC and WAN\n• Previous experience with WAN SDN Controller is highly desirable\n• In depth knowledge of IP/MPLS networks\n• Knowledge of new technology such as Segment-Routing, EVPN and PCEP\n• Knowledge of datacenters is desirable but not mandatory\n• He/she should be a good communicator, proactive and capable to deliver complex concept in simple manner\n• He/she should be a fast learner and eager to learn new cutting-edge technologies\n• Prior experience on Nokia 7750 product family is an advantage\n• Attention to details and meticulosity are important attributes\n• An industry certification is a good to have but not a must\n• Willingness and passion to learn to technologies\n\nImagine creating technology that has the potential to change the world. Working with us, you will have a positive impact on people’s lives and help to overcome some of the world’s most pressing challenges. We act inclusively and respect the uniqueness of people. At Nokia, employment decisions are made regardless of race, color, national or ethnic origin, religion, gender, sexual orientation, gender identity or expression, age, marital status, disability, protected veteran status or other characteristics protected by law. Nokia culture welcomes people as their true selves. Come create the technology to connect the world.\n\nJob\n\nArchitecture - Customer Solutions Architect\n\nPrimary Location\n\nAsia Pacific & Japan-Singapore-Singapore-Singapore\n\nSchedule\n\nFull-time", "extensions": ["9 days ago", "Full–time"], "detected_extensions": {"posted_at": "9 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2x1dGlvbiBBcmNoaXRlY3QiLCJjb21wYW55X25hbWUiOiJOb2tpYSIsImNvbXBhbnlfbWlkIjoiL20vMDViNWMiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJpVzYyRnhOdEYyd2lzSHVjQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFc3dCQ293QlFVNVZYMDV4VkhkRlNHWkNkSEpOU1ZSc1ZDMVlWbWgyZW0xeExXYzJTRGszTkhrNFNUQTFOMGh6ZUVaMWRITXplRE5NT1dGNWRFUlJiVGx2UWtaVVlrRktRM0ZqTkV4RVdrZDBYM2xWU1daNVEzaERORTk2TjBwSUxVTjVlVm93TWpKcVNuZFlRWFpxTVVaNFEyY3hObWhZTlZRM1JrMXhPRTFzT1VWdFZHaEdSRjloUmpGalluUnZWbUVTRnpkdWNVTlpTV1ZSVFc4eVVEbFFkMUEzWHpKRE1rRlpHaUpCVDAxWlVuZERhVVJtYUZsMFJrcHhRV2c1V0ROVlRtdHJNMHhzWWkxUmR6ZFIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY181MyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL3NnLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvc29sdXRpb24tYXJjaGl0ZWN0LWF0LW5va2lhLTI0MDM3Nzg3NDk/cmVmSWQ9Yzc4NWE3YjEtYjE5OS00YTEwLTk5ZTEtOGFlYTZjMjI4M2ExXHUwMDI2dHJhY2tpbmdJZD1UbHU5QlFYY241UDJLekZOeFMyZlVRJTNEJTNEXHUwMDI2dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}], "chips": [{"type": "Title", "param": "job_family_1", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Solution architect", "value": "solution architect"}, {"text": "Solutions architect", "value": "solutions architect"}, {"text": "Architect", "value": "architect"}, {"text": "Cloud architect", "value": "cloud architect"}, {"text": "Technical architect", "value": "technical architect"}, {"text": "Enterprise architect", "value": "enterprise architect"}, {"text": "Senior", "value": "senior"}, {"text": "Consultant", "value": "consultant"}, {"text": "Financial services", "value": "financial services"}, {"text": "Infrastructure architect", "value": "infrastructure architect"}, {"text": "Manager", "value": "manager"}, {"text": "Application architect", "value": "application architect"}, {"text": "Cloud engineer", "value": "cloud engineer"}, {"text": "It architect", "value": "it architect"}, {"text": "Lead architect", "value": "lead architect"}, {"text": "Network architect", "value": "network architect"}, {"text": "Security architect", "value": "security architect"}, {"text": "Senior architect", "value": "senior architect"}, {"text": "Systems engineer", "value": "systems engineer"}, {"text": "Associate director", "value": "associate director"}, {"text": "Deputy", "value": "deputy"}, {"text": "Engineers", "value": "engineers"}, {"text": "Head", "value": "head"}, {"text": "Infrastructure", "value": "infrastructure"}, {"text": "Lab", "value": "lab"}, {"text": "Network engineer", "value": "network engineer"}, {"text": "Presales consultant", "value": "presales consultant"}, {"text": "Public sector", "value": "public sector"}, {"text": "Senior analyst", "value": "senior analyst"}, {"text": "Senior consultant", "value": "senior consultant"}, {"text": "Senior director", "value": "senior director"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Software architect", "value": "software architect"}, {"text": "Solution consultant", "value": "solution consultant"}, {"text": "System architect", "value": "system architect"}, {"text": "System engineer", "value": "system engineer"}, {"text": "Systems analyst", "value": "systems analyst"}, {"text": "Systems architect", "value": "systems architect"}, {"text": "Technical trainer", "value": "technical trainer"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Accounting", "value": "/business/naics2007/5412"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Management", "value": "/business/naics2007/55"}, {"text": "Real Estate", "value": "/business/naics2007/53"}, {"text": "Wholesale", "value": "/business/naics2007/42"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Amazon", "value": "/m/0mgkg"}, {"text": "Microsoft", "value": "/m/04sv4"}, {"text": "EPAM Systems", "value": "/m/0dlnrc"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "IBM", "value": "/m/03sc8"}, {"text": "Salesforce", "value": "/m/07btr5"}, {"text": "EY", "value": "/m/0g9jc"}, {"text": "Publicis Sapient", "value": "/m/02myjp"}, {"text": "Randstad", "value": "/m/08pt1z"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Alibaba Group Holding Limited", "value": "/m/07s6ctl"}, {"text": "Avanade", "value": "/m/094456"}, {"text": "Capgemini", "value": "/m/03vlk0"}, {"text": "Comtel Solutions Pte Ltd", "value": "/g/11dxpztgnb"}, {"text": "DELL", "value": "/g/11c54ch2jm"}, {"text": "Ericsson", "value": "/m/02kyh"}, {"text": "HTZ Resources", "value": "/g/11h21p9b4d"}, {"text": "Infinite Computer Solutions Pte Ltd", "value": "/g/11g9mj72yz"}, {"text": "Michael Page", "value": "/m/04cxldw"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "Orange Business Services", "value": "/m/08zvyz"}, {"text": "Recruitment Hub Asia Pte Ltd", "value": "/g/11dxpww_0f"}, {"text": "TEKsystems (Allegis Group Singapore Pte Ltd)", "value": "/g/11b6g4bkv0"}, {"text": "Talent Trader Group Pte Ltd", "value": "/g/11dxpmlc5b"}, {"text": "Tata Consultancy Services", "value": "/m/01psx8"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "VMware", "value": "/m/01t9k5"}, {"text": "Verizon", "value": "/m/07_dn"}, {"text": "A-Speed Infotech Pte Ltd", "value": "/g/11g9mxswl4"}, {"text": "ABeam Consulting", "value": "/g/11bc6whr_f"}, {"text": "Amazon Web Services (AWS)", "value": "/g/11dxprr2xv"}, {"text": "Amazon Web Services Singapore", "value": "/m/0rznzt1"}, {"text": "Aon", "value": "/m/0z7n"}, {"text": "Avaya", "value": "/m/01sqlk"}, {"text": "Azendian Solutions Pte Ltd", "value": "/g/11dxpvcjj2"}, {"text": "Big Cloud", "value": "/g/11c743lwsr"}]}]}