{"search_metadata": {"id": "60827ece5fc49360637caee2", "status": "Success", "json_endpoint": "https://serpapi.com/searches/08519b41d63a7033/60827ece5fc49360637caee2.json", "created_at": "2021-04-23 08:01:18 UTC", "processed_at": "2021-04-23 08:01:18 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28IT+analyst%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=230", "raw_html_file": "https://serpapi.com/searches/08519b41d63a7033/60827ece5fc49360637caee2.html", "total_time_taken": 0.9}, "search_parameters": {"q": "(IT analyst) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "230"}, "jobs_results": [{"title": "Systems Analyst (Agile DevOps)", "company_name": "Urban Redevelopment Authority", "location": "Singapore (+1 other)", "via": "via Jobs", "description": "Systems Analyst (Agile DevOps)\nAgency: Urban Redevelopment Authority\nJob no.: 547935\nWork type: Permanent/Contract\nLocation: Singapore\nCategories: InfoComm, Technology, New Media Communications\nThe Urban Redevelopment Authority (URA) is Singapore’s planning authority. Our mission is to make Singapore a great city to live, work and play. We plan and facilitate the physical development of Singapore, in partnership with agencies and the community, to create a vibrant, sustainable and cosmopolitan city of distinction.URA has undergone a digitalization journey to harness Geospatial and Data Analytics for more data-informed planning. URA was recognized as a leading organization in Digital Transformation and was the Asia Pacific 2017 regional DX Leader in Talent Acceleration, as well as the 2019 PSD Public Sector Transformation – Business Transformation Award recipient. URA is embarking on a Digitalization 2.0 effort, to go beyond Urban Analytics to use of Artificial Intelligence (AI) in our... Future Planning Processes.About Information Systems, Applications DepartmentBe part of the URA Information Systems, Application Department, where we partner closely with our Groups to plan, design, develop and deploy enterprise IT systems, e-Services, mobile apps and web portals to support work process transformation and improve service delivery for our external customers. In addition to providing IT advisory and support to continually improve our IT systems to ensure its relevance and capability to meet changing business needs, we also constantly explore new digital technologies and possibilities via collaboration with key industry players to advance strategic deployment of ICT in URA.About the jobYou will be a key member of the Digital Programme and Quality Office team, working closely with passionate Systems Analysts, driven and supportive Director and visionary CIO, to drive and transform IT processes and ensure quality implementation of IT Systems and digital services in an agile approach. If you have the following in your DNA, we would like to hear from you:\nInnovate – Always looking for ways to improve IT processes and feel motivated when your contribution makes a difference to everyone’s work, with focus on ensuring quality delivery of IT Systems and digital services;\nAgile – Lead and embrace the agile values as role of a ScrumMaster to plan, coach and operationalise processes to ensure all teams embrace agile way of application implementation; drive and manage DevOps software delivery automation.\nTech-savvy – Looking out for latest developments in the area of DevSecOps and explore useful tools to facilitate software quality assurance and software delivery automation.\nRequirements:\nDegree in Computer Science, Engineering, or related disciplines. In the alternative, candidates should at least have an additional 4 years of relevant experience\nScrumMaster certified, and any other agile related certification e.g. Product Owner, Agile Coach\nKnowledge and/or at least 3 years of relevant working experience in\nManaging projects as a Scrum Master and leading agile initiatives\nDevOps processes and tools\nSoftware development and quality assurance\nAble to work well within team and willing to learn\nEffective presentation, communication and writing skillsAdded advantage with below skills:\nExperience with project collaboration tools (e.g. Microsoft Sharepoint)\nExperience with application security implementation, OWASP understandingAppointment will commensurate with experience and entry-level applicants are welcome to apply.Advertised: 22 Mar 2021\nApplications close: 18 Apr 2021", "extensions": ["1 month ago", "$2.5K a month", "Full–time"], "detected_extensions": {"posted_at": "1 month ago", "schedule_type": "Full–time", "salary": "$2.5K a month"}, "job_id": "eyJqb2JfdGl0bGUiOiJTeXN0ZW1zIEFuYWx5c3QgKEFnaWxlIERldk9wcykiLCJjb21wYW55X25hbWUiOiJVcmJhbiBSZWRldmVsb3BtZW50IEF1dGhvcml0eSIsImNvbXBhbnlfbWlkIjoiL20vMDRkYzJnIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiRUloRTZFMFMxYkRzUlVxTEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRW9zQ0Nzd0JRVTVWWDA1eFUyazVZM0pqWTJ0alNXUk1PVlpSUzFaVk5HOURUalJqUm5GSWFYaEdlRUV3ZW00MVR6RjFlakJXZDBsSFYybGtaMmxUV2toalMxSm9ORGd3Ukd0dVdYcHBhMlp4V0VSak9UTkpXa2w1UkdOalIzSm1kaTEzWkVVM1gwdGZTVXgxV1VGT2VITnBjbUpIVm5WWE9GODBNelZaUXpodlEyMVFUbEJxYlRWU2NWRXlTbFJGUVhWTVNHUXpibWxyTFhReFdteFJZVFl0Y25Gd056UlJXVUZMU1dwTFZubzFNbGxtU2kxaU5YVmlTWEYwU0RJMFFYWmlOakJrVW5KSWVUSndkbWN4VTNsMkVoWjZialpEV1UwM1pVeEtiWFYwVVdKTk4wbFVaME5SR2lKQlQwMVpVbmRFU2xkeVdYY3RaM1ZJVDJodFZVOVRRMGg1Y2tNelJFWkRNVWxuIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIiwibGluayI6Imh0dHBzOi8vc2cuZmlkYW50by5jb20vam9icy9qb2Itb3BlbmluZy9jb21wdXRlci1zeXN0ZW1zLWFuYWx5c3RzL3N5c3RlbXMtYW5hbHlzdC1hZ2lsZS1kZXZvcHMtMjU5ODcxNzYwP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "HR Business Analyst", "company_name": "NTT MSC", "location": "Singapore", "via": "via Glassdoor", "description": "In a constantly changing world, we work together with our people, clients and communities to enable them to fulfill their potential to do great things. We believe that by bringing everyone together, we can solve problems using innovative technology that can create a world that is sustainable and secure. At NTT, we encourage you to remain continuously curious, as that is what keeps you fast, flexible and relevant. No two days will be the same but that is what will help you grow and realize your full potential.\n\nThe power is in your hands to do great things. It’s time to lead the change, be the authentic you, to solve difficult challenges, to set the pace of change and to unleash your potential.\n\nWant to be a part of our team?\nThe Business Analyst’s key function is to work with internal and external clients to determine requirements and to define solutions to address complex business, process and systems problems, and improvements in the organization. They act as a liaison among... stakeholders in order to understand the structure, policies, and operations of an organization, and to recommend solutions that enable the organization to achieve its goals.\n\nRadford reference:\n\n\"Analyzes complex business problems to be solved with automated systems. Identifies gaps and provides technical expertise in business requirements for system functional specifications and scales new and current systems, processes and procedures in a cost effective manner. Configures system settings and options; plans and executes unit, integration and acceptance testing to meet business requirements. Designs details of automated systems. May provide consultation to users in the area of automated systems. May lead cross-functional linked teams to address business or systems issues. Survey Tip: May be client-focused, working in conjunction with Professional Services and Outsourcing functions. May include company-wide, web-enabled solutions.\"\n\nWorking at NTT\n\nKey Roles and Responsibilities:\n• Act as a bridge between the business problems and the technology solutions.\n• Analyse, transform and ultimately resolve the business problems with the help of technology.\n• Work with internal clients and apply best practice methodologies to determine business requirements and to define solutions to address business, process, information and system problems, improvements or change.\n• Deliver business projects in line with sponsor requirements and enterprise architecture.\n• Proactive development and deployment of enhanced services and platforms, covering all the functional aspects from service/product definition through to build and deployment.\n• Ensure the identification and documentation of operational gaps including user guides, templates, test cases and related user training.\n• Assist with the resolution of issues pertaining to the service.\n• Adhere to and follow the relevant development and support processes.\n• Communicate and escalate if any issues arise or deliverables cannot be met and request assistance to ensure closure of issues.\n• Take responsibility for delivery of project elements with minimal supervision\n\nKnowledge, Skills and Attributes:\n• Broad understanding of business practices and processes\n• Excellent team player who displays good client service orientation with well-developed administrative and organization skills\n• Deep expertise in specific systems, processes and technologies that they will be required to analyze\n• Meticulous attention to detail whilst working under pressure\n• Excellent verbal and written communication skills\n• Ability to listen empathetically\n• Ability to build rapport and engage effectively with a variety of stakeholders\n• Knowledge of project management methodology\n• Excellent analytical skills with the ability to convert business requirements into operational deliverables (functional requirements) to meet business objectives\n• Excellent documentation skills, in particular, functional requirements, test cases, system user documentation, processes and procedures and presentations\n• Very good working knowledge of Microsoft Exchange, Word, Excel Project, PowerPoint and Visio\n\nAcademic Qualifications and Certifications:\n• Typically requires Bachelor’s degree or equivalent with related demonstrable experience\n• Project management certification would be advantageous\n• Relevant technology certification(s)\n\nRequired Experience:\n• Demonstrable experience as a Business Analyst gained within a technology services environment\n• Experience as a system administrator or developer would be advantageous\n• Demonstrable experience in coordinating and managing tasks, and small projects\n\nWhat will make you a good fit for the role?\nStandard career level descriptor for job level:\n• Seasoned and experienced professional\n• Has full understanding of specialisation area\n• Resolves wide range of issues in creative ways\n• Fully qualified, career level, career journey-orientated\n• Uses good judgement in selecting tools and methods to solve problems\n• Networks with senior internal and external people in own area of expertise\n• Receives little instruction on day-to-day work, receives general instructions on new assignments\n• Typically requires demonstrable related experience with a Bachelor’s or equivalent degree; or moderate level experience and a Master’s or equivalent degree; or a PhD or equivalent degree without experience; or equivalent work experience\n\nJoin our growing global team and accelerate your career with us. Apply today.\n\nEqual opportunity employer\n\nNTT is proud to be an equal opportunity employer with a global culture that embraces diversity. We are committed to providing an environment free of unfair discrimination and harassment. We do not discriminate based on age, race, color, sex, religion, national origin, disability, pregnancy, marital status, sexual orientation, gender reassignment, veteran status, or other protected category", "extensions": ["25 days ago", "Full–time"], "detected_extensions": {"posted_at": "25 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJIUiBCdXNpbmVzcyBBbmFseXN0IiwiY29tcGFueV9uYW1lIjoiTlRUIE1TQyIsImNvbXBhbnlfbWlkIjoiL2cvMTFmZF9uZHMyOSIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6InRCeEFJd1JnekxCMjdVMUxBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhVVzVPVFMxQk9YVkdla0pSZEVKRk1HOWZZemM0TVhGMVNEUlRUMWRoUlMwd2FsRk5NSE0zYVc5UExUVTNkSFZCVVdSbU5sVnlaVTFEVm1KMGJFVXRNbXB4U0ZvelprOVZPRlZXZWxWMlJVazFhSEpHUWpCSFVVaHVSMWRRUTJsRVoxbHJSWEkwUlZwQlZXVkJkMUpMWkdGalRYSlBWMkZrUlV0T2VYWnJXWGRGTURodlpWWmhjbVJCVFRKMlkxUTFPRTVaZFdaVkxYWjJkMnAzRWhaNmJqWkRXVTAzWlV4S2JYVjBVV0pOTjBsVVowTlJHaUpCVDAxWlVuZERWMU5JWWt0M2R6ZG1RMXBKTUVnM2QxbzFYekpWUzJOUmIwWlIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18xNSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBHbGFzc2Rvb3IiLCJsaW5rIjoiaHR0cHM6Ly93d3cuZ2xhc3Nkb29yLnNnL2pvYi1saXN0aW5nL2hyLWJ1c2luZXNzLWFuYWx5c3QtbnR0LW1zYy1KVl9JQzMyMzU0MTBfS08wLDE5X0tFMjAsMjcuaHRtP2psPTM3ODU5MzUxMThcdTAwMjZ1dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Software Test Analyst #SGUnitedJobs", "company_name": "None", "location": "Singapore", "via": "via WhatJobs", "description": "About\n\nWe are looking to hire software testers for a project at a financial services client\n\nResponsibilities:\n\nDevelop and establish quality assurance deliverables and testing framework, including create and maintain test plans and test cases in accordance with changing requirements, throughout development Conduct system integration tests with external parties, validate the output and expected outcome e.g. data to and from external parties' systems and feedback on improvement requirement Plan and coordinate user acceptance tests with users and perform insightful reporting Conduct extensive manual functional /exploratory testing, including browser testing Conduct performance and load tests, validate the output and expected outcomes and feedback on improvement required\n\nRequirements:\n\nSKILLS SET AND TRACK RECORD (MUST HAVE)\n\nAt least 3-5 years of software testing experience covering manual, functional testing Experience in Financial Services organizations Good understanding and... completion of projects using waterfall/Agile methodology Experience on database testing, ETL concepts and data analysis toolset Demonstrate knowledge of automated software testing methodologies using Selenium and Java Certified Software Testing Professional and/or Certified Software Quality Analyst or an equivalent certification will be an added advantage Knowledge on Performance Testing tools - LoadRunner, Rational Test Studio etc. Team player with ability to collaborate and work effectively within team Good written and verbal communication and interpersonal skills Passion for automation, standardization and best practices Good presentation skills is preferred\n\nInterested candidates can email their most updated resume to dipal.bhagde@theoptimum.net along with the MCF ID for applying directly", "extensions": ["4 days ago", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBUZXN0IEFuYWx5c3QgI1NHVW5pdGVkSm9icyIsImNvbXBhbnlfbmFtZSI6Ik5vbmUiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Im8zZjJ1MG9DeGdFR3YzeUpBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gV2hhdEpvYnMiLCJsaW5rIjoiaHR0cHM6Ly9lbi1zZy53aGF0am9icy5jb20vam9iLWZvci1Tb2Z0d2FyZS1UZXN0LUFuYWx5c3QtU0dVbml0ZWRKb2JzLWluLVNpbmdhcG9yZS1jb29wMTc1MTYwNDI/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Business Analyst", "company_name": "Techbridge Market Holdings Pte Ltd", "location": "Singapore", "via": "via LinkedIn", "description": "Looking for Business Analyst with one of our clients in Singapore.\n\nResponsibilities\n\nYour primary focus will be on the Business Requirements and Functional Solution aspects of the\nproject. In this role, you will work in a project team, in collaboration with Agency users, to:\nelicit, scope and manage the Agency's business requirements apply appropriate human-centric tools and techniques, including plan, design and facilitate workshops, to map customer journeys, identify challenges and opportunities prioritise product backlog through rigorous information gathering and analysis with stakeholders, and contribute to the development of the Functional/ Design specifications\n\nDevelop the business case and Tender Specifications\n\nEvaluate and recommend ICT solutions that best address the needs\n\nUndertake sprint planning, write user stories and define acceptance criteria with stakeholders\n\nReview testing and data conversion documents to verify that specifications are met\n\nDrive smooth... deployment, adoption and operations of the solution\n\nAnalyse impact of requested changes (Operations & Maintenance phase)\n\nWork with developers to understand and troubleshoot technical problems, as needed (Operations & Maintenance phase)\n\nUndertake root cause analysis for problems in order to implement preventive and corrective\n\nMeasures to meet business and performance needs (Operations & Maintenance phase)\n\nExpectations\n\nAs a Business Analyst, you are:\n\npro-active, resourceful and self-motivated to innovate and take smart risks to achieve\nbusiness goals and customer satisfaction\nable to take a broad, strategic perspective as well as drill deep to understand business needs and challenges\nable to facilitate discussions/workshops to elicit, manage and prioritize key business needs\na team player with strong influencing and people handling skills\n\nRequirements\n\nDegree or Diploma in Computer Science, Information Systems, Information/Infocomm\nTechnology, Computer or Electronics Engineering or related discipline\nMinimum 3 years of working experience for Consultant and 5 years of working experience for Senior Consultant role\nParticipated in at least one full software or product development cycles, preferably using\nAgile Methodology with past development experience\nProven experience in IT business analysis, application solutioning and design, and testing\nBasic knowledge of Cloud, Data Analytics, Service Design/Design Thinking\nStrong analytical, conceptualisation and problem solving skills\nExcellent communication skills, both oral and written, with the ability to pitch ideas and influence stakeholders\n\nAdvantageous To Have\n\nConsulting or Business Analysis experience Business Analysis certification (Certification of Competency in Business AnalysisTM (CCBA®), Certified Business Analysis ProfessionalTM (CBAP®)).\n\nKnowledge of, or experience in implementing projects in at least one of the following areas (Data Analytics, Agile Methodologies, Internet and Mobile Technologies, Customer Relationship Management, Knowledge Management, Service Design, Business Process Reengineering (BPR))\n\nInterested candidates pl mail your CV to Pradeepa.mangalasamy@techbridgemarket.com\nWith below required details.\n\nCurrent Salary\n\nExpected salary:\n\nNotice Period\n\nReason for job change:\n\nCurrent location:\n\nVisa/Nationality\n\nYears of IT experience?\nYears of experience as Business Analyst?\nYears of experience in Agile methodology?\nYears of experience in application solutioning and design, and testing?\nYears pf experience in any one is required?( Any Cloud, Data Analytics/Management/ETL, Service Design/Design Thinking\n\nRegards\nPradeepa M\nSr.Talent Manager-APAC\n\nHiring Business Analyst/Technical Business Analyst/Digital Business Analyst\n\nSkills: Business Analyst, Cloud, Agile, Data Analytics, Data Mining, Market Research, Modeling, Service Design\n\nExperience: 2.00-12.00 Years", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJCdXNpbmVzcyBBbmFseXN0IiwiY29tcGFueV9uYW1lIjoiVGVjaGJyaWRnZSBNYXJrZXQgSG9sZGluZ3MgUHRlIEx0ZCIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiZ3VTNjN3WGlOU05yTjlkQUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL3NnLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvYnVzaW5lc3MtYW5hbHlzdC1hdC10ZWNoYnJpZGdlLW1hcmtldC1ob2xkaW5ncy1wdGUtbHRkLTI0NTkxNDY4Njk/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Senior M&A and Partnerships Analyst", "company_name": "Underwriters Laboratories", "location": "Singapore", "via": "via Jobs | Fidanto", "description": "Careers | UL | Senior M&A and Partnerships Analyst in Singapore | Careers at Singapore\n\nPlease Enable Cookies to Continue\n\nPlease enable cookies in your browser to experience all the personalized features of this site, including the ability to apply for a job.\n\nWelcome page\n\nReturning Candidate?\n\nLog back in!\n\nSenior M&A and Partnerships Analyst\n\nLocation\n\nSG-Singapore\n\nJob ID\n\n2021-21290\n\n# of Openings\n\n1\n\nJob Category\n\nAccounting/Finance\n\nAt UL, we know why we come to work.\n\nThousands of us around the world wake up every day with a common purpose: to make the world a safer, more secure and sustainable place. Science is in our DNA; we are endlessly curious and passionate about seeking and speaking the truth. We take delight in knowing that our work makes a meaningful contribution to society, and we are proud that our culture is centered on integrity, collaboration, inclusion and excellence. UL stands at the forefront of technological advancement, and we are continually challenged to... find new ways to foster innovation and positive change. Satisfying? Yes. Exciting? Absolutely!\n\nUnderwriters Laboratories (UL) is the world's leading organization specializing in product safety testing and certification. Founded in 1894, UL has earned a reputation as a world leader in the development, testing and certification of product safety standards, with more than 1400 safety standards that serve as the foundation for nearly 200 industries. The UL Mark is recognized worldwide and its reputation for helping manufacturers around the world design products that are safe for users remains unmatched.\n\nWhat you’ll learn & achieve:\n\nWe are hiring for a Senior M&A and Partnerships Analyst to join the Strategy, Acquisitions and Partnerships team to support M&A and Partnerships for the Enterprise and Advisory group within UL. This person will work closely with the M&A and Partnerships leaders and interact with divisional strategy leaders and general managers. We have aggressive growth targets and this role is a key part of making this happen.\n\nThis role will cover M&A and Partnerships across three divisions working with three industry focused strategy consultants (separate job adverts) aligned to the divisions below:\n\nAsset and Sustainability Performance: SaaS and advisory businesses improving sustainability performance of assets e.g. commercial real estate, renewable energy sources and of enterprises e.g. enterprise sustainability SaaS, EHS SaaS, carbon footprinting, health and safety and learning management SaaS\nSupply Chain: SaaS, DaaS and advisory businesses ensuring the chemical compliance of products in regulated industries, monitoring of supplier chain quality and compliance with international standards and quality management systems\nProduct Lifecyle: Advisory and SaaS which supports human centered design of medical devices, information security, computational benchmarking and training compliance in the life science industry\n\nThis is a critical role to identify and support M&A and Partnerships across a wide range of businesses with complex points of interactions and potential synergies. It will provide an exciting platform to make significant impact in the businesses you cover and beyond to wider UL.\n\nWhat you’ll learn and accomplish\n\nCollect and analyze information related to M&A and partnership targets and identify value to UL. Prepare analysis and research presentations to the team. Actively read and seek out new information sources to stay abreast of industry trends.\nSupport deal pipeline management, deal sourcing, commercial due diligence and post-merger integration work initiatives\nSupport definition of a broad Partnerships strategy across UL with Partnerships lead. Prepare economic models in support of designing UL partnership programs.\nSupport periodic reporting of partnerships and M&A initiatives to senior executives\nWork with industry strategy consultants to understand the competitive position of business units, their growth plans and how external partnerships and M&A can support this.\nAct as point of contact to maintain Partnerships and M&A content including external contacts, industry research reports and data\n\nWhat makes you a great fit:\n\nUniversity degree plus generally 2-3 years of experience with a Private Equity/Venture Capital firm, M&A advisory/strategy consultancy or an in-house corporate development / strategy role with focus on M&A and Partnerships\nAbility to quickly research, synthesize, and summarize key insights on unfamiliar topics and companies\nInterest in tech-enabled businesses and experience working for/with SaaS and/or advisory business models an advantage but not essential\nConfident, analytical thinker with focus on presenting ideas/opportunities in a structured way\nAble to take work and run own time with limited oversight to successful completion\nTeam player with drive, curiosity and ‘can do’ attitude\nStrong interpersonal skills with demonstrated experience building relationships with employees at all levels of an organization\nStrong financial modelling, PowerPoint presentation, written and verbal communication skills\nAbility to effectively coordinate multiple jobs and projects simultaneously\n\nWhat you’ll experience working at UL:\n\nMission: For UL, corporate and social responsibility isn’t new. Making the world a safer, more secure and sustainable place has been our business model for the last 125 years and is deeply engrained in everything we do.\nPeople: Ask any UL employee what they love most about working here, and you’ll almost always hear, “the people.” Going beyond what is possible is the standard at UL. We’re able to deliver the best because we employ the best.\nInteresting work: Every day is different for us here as we eagerly anticipate the next innovation that our customers’ create. We’re inspired to take on the challenge that will transform how people live, work and play. And as a global company, in many roles, you will get international experience working with colleagues around the world.\nGrow & achieve: We learn, work and grow together with targeted development, reward and recognition programs as well as our very own UL University that offers extensive training programs for employees at all stages, including a technical training track for applicable roles.\n\nLearn More:\n\nCurious? To learn more about us and the work we do, visit our company page www.UL.com and division page https://www.ul.com/services/advisory\n\nOptions\n\nApply for this job onlineApplyShareEmail this job to a friendRefer\n\nSorry the Share function is not working properly at this moment. Please refresh the page and try again later.\n\nShare on your newsfeed\n\nConnect With Us!\n\nNot ready to apply? Connect with us for general consideration.\n\nIf you experience technical difficulties during the application process, please click here\n\nSoftware Powered by iCIMS\n\nwww.icims.com", "extensions": ["7 days ago", "$57,445 a year", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time", "salary": "$57,445 a year"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgTVx1MDAyNkEgYW5kIFBhcnRuZXJzaGlwcyBBbmFseXN0IiwiY29tcGFueV9uYW1lIjoiVW5kZXJ3cml0ZXJzIExhYm9yYXRvcmllcyIsImNvbXBhbnlfbWlkIjoiL20vMDFxMWdqIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoieS00MHE0aVk2SU4tTmZzMUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRW9zQ0Nzd0JRVTVWWDA1eFZFMU5SbVI0WkdsQmFVVTNaakpYTWxWRFgxaEZhMUJ2UW5JME5qVlVOVGd5V1hjMlpHcFlhRnBXU2tSeFkxQmtNM1kxWHkweWJEbHpkRlYwWVc0dGFtRm1TbFU0VGxnNU5sUkZkVlZyU0hwVlZYWm5kR2hKVVZFNGVFOVNUVTVZWkROaGFXbDVRVzEwUW5neVEzSkZZM2g2VmtFeVowTlphekJ2ZUZGMFpHVmhSa0pIWjFNMU1WcFNjbnBxTmtaUlNHRTVaV3hWTjBsS2RXZDJWbEJxTVhKaWFqTkpNMmQ1Vm5CUVl6VkhaMVJ2VjNaa1dGRk5RWEk0WVVoRk9XeFdaVk5FTkZCVEVoWjZialpEV1UwM1pVeEtiWFYwVVdKTk4wbFVaME5SR2lKQlQwMVpVbmREYUdRNU9UUklSRzFJWlhWeVp6ZG5jV2RoY21nMmVpMXBhV1IzIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMzEiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9icyB8IEZpZGFudG8iLCJsaW5rIjoiaHR0cHM6Ly9zZy5maWRhbnRvLmNvbS9qb2JzL2pvYi1vcGVuaW5nL21hbmFnZW1lbnQtYW5hbHlzdHMvc2VuaW9yLW1hLWFuZC1wYXJ0bmVyc2hpcHMtYW5hbHlzdC0yNzQ2MTc3MjE/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Technical Business Analyst", "company_name": "Daulfin Grey HR Pte Ltd", "location": "Singapore", "via": "via Glassdoor", "description": "We are looking for an Technical Business Analyst with Wealth Management experience.\n\nResponsibilities\n• Handle all aspects of business analysis, user stories, requirements gathering, BRD, technical analysis and testing.\n• Liaise closely with various business representatives, business users and development teams.\n• Write technical specifications\n• Participate in defect fixes, change requests and/or project work\n• Handle implementation of Avaloq wealth suite\n\nRequirements\n• IT diploma or degree\n• Knowledge in wealth management or financial products\n• Able to work independently as well as in a team\n• Able to drive discussions independently\n• Self-driven and results focused\n• Effective communication skills\n• Avaloq experience or certification preferred", "extensions": ["18 days ago", "Full–time"], "detected_extensions": {"posted_at": "18 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJUZWNobmljYWwgQnVzaW5lc3MgQW5hbHlzdCIsImNvbXBhbnlfbmFtZSI6IkRhdWxmaW4gR3JleSBIUiBQdGUgTHRkIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJFaG5jelVIS0twa01NVFBrQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEdsYXNzZG9vciIsImxpbmsiOiJodHRwczovL3d3dy5nbGFzc2Rvb3Iuc2cvam9iLWxpc3RpbmcvdGVjaG5pY2FsLWJ1c2luZXNzLWFuYWx5c3QtZGF1bGZpbi1ncmV5LWhyLXB0ZS1KVl9JQzMyMzU5MjFfS08wLDI2X0tFMjcsNDYuaHRtP2psPTQwMjQ3MTk0MzJcdTAwMjZ1dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "SUPERVISORY FINANCIAL MANAGEMENT ANALYST", "company_name": "Department of the Navy", "location": "Singapore", "via": "via WhatJobs", "description": "Summary\n\nYou will serve as a SUPERVISORY FINANCIAL MANAGEMENT ANALYST in the NAVY MEDICAL RESEARCH CENTER of US NAVMEDRSCHU 2/NMRC ASIA .\n\nResponsibilities\n\nYou will advise on work in any of the phases or systems of budgetadministration You will formulate budget and cost estimates You will interpret budgetary policies and practices You will present and defend budget estimates before authorities\n\nTravel Required\n\nNot required\n\nSupervisory status\n\nYes\n\nPromotion Potential\n\n13\n\nRequirements\n\nConditions of Employment\n\nYou will be required to complete training, obtain, and maintain a government credit card for travel and travel-related purchases. Must be a US Citizen. Must be determined suitable for federal employment. Must participate in the direct deposit pay program. New employees to the Department of the Navy will be required to successfully pass the E-Verify employment verification check. To learn more about E-Verify, including your rights and responsibilities, visit... www.dhs.gov/E-Verify/. Generally, current federal employees applying for GS jobs must serve at least one year at the next lower grade level. This requirement is called time-in-grade. Time-in-grade requirements must be met by the closing date of this announcement. This is an overseas position. You will be subject to and must be able to satisfy the overseas requirements of the 26Jul12 DODI 1400.25 V1230: http://www.esd.whs.mil/Portals/54/Documents/DD/issuances/140025/140025v1230.pdf Within the Department of Defense (DoD), the appointment of retired military members within 180 days immediately following retirement date to a civilian position is subject to the provisions of 5 United States Code 3326. You will be required to complete ethics orientation within three months of appointment and submit a Confidential Financial Disclosure Report, OGE-450, within 30 days of appointment. You will be required to obtain and maintain an interim and/or final security clearance prior to entrance on duty. Failure to obtain and maintain the required level of clearance may result in the withdrawal of a job offer or removal. This is a Financial Management Level III certified position per the National Defense Authorization Act (NDAA) 2012, Section 1599d. You must achieve this level within prescribed timelines. Certification requirements are in DoD Instruction 1300.26. This position may require travel from normal duty station to CONUS and OCONUS and may include remote or isolated sites. You must be able to travel on military and commercial aircraft for extended periods of time. Supervisors in the executive branch have a heightened personal responsibility for advancing government ethics. You will be required to review the 14 General Principles of Ethical Conduct at 5 CFR 2635.101. This position is eligible for part time, full time or ad-hoc telework at the discretion of management.\n\nQualifications\n\nYour resume must demonstrate at least one year of specialized experience at or equivalent to the GS-12 grade level or pay band in the Federal service or equivalent experience in the private or public sector. Specialized experience must demonstrate the following:managing a budget for an organization utilizing automated systems, overseeing cost estimates to support organization programs, plans and activities; AND experience in accounting and financial management to include overseeing fiscal operations.\n\nAdditional qualification information can be found from the following Office of Personnel Management website: .\n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., professional, philanthropic, religious, spiritual, community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment.\n\nEducation\n\nThis job does not have an education qualification requirement.\n\nAdditional information\n\nThis position is covered by the Department of Defense Priority Placement Program.\n\nAdditional vacancies may be filled by this announcement.\n\nA tentative offer of employment will be rescinded if the selectee fails to meet the pre-employment requirements, including failure to report to any of the scheduled appointments.\n\nIf you are unable to apply online and request information about the Alternate Application process, please contact the Department of Navy's Employment Information Center.\n\nPay retention may be granted when certain conditions are met.\n\nRecruitment incentives may be authorized to eligible new hires.\n\nA relocation incentive is generally a single payment intended to offset some of the relocation costs experienced by the selectee. A relocation incentive may be authorized.\n\nFederal annuitant information: The selection of an annuitant is subject to the Department of Defense and Department of the Navy policy on the employment of annuitants. Policy information may be found at:\n\nTour of duty will be 36 months.\n\nTo learn more about the living and working conditions at this military installation and additional Foreign Overseas information, go to:\n\nPriority consideration will be given to military spouse preference and family member preference eligible residing in the commute area of the duty location for this position. Commute area is defined as the geographic area surrounding the duty location in which people can reasonably be expected to travel back and forth daily.\n\nMilitary Spouses and Family Members may apply 30 days before their anticipated arrival date. However, they will not receive preference until arrival at the foreign location. Additional documentation may be required prior to granting preference.\n\nMilitary spouses and family members who are appointed may not extend longer than 2 months following the transfer of the sponsor from the commuting area of the foreign duty station; 2 months beyond the separation of the appointee's sponsor; or any time beyond the time employee ceases to be a family member.\n\nICTAP Applicants: To be considered well-qualified and exercise selection priority as an ICTAP candidate, displaced Federal employees must satisfy all qualification requirements for the position and receive a rating in the highly qualified category (score 85) or higher. ICTAP candidates must provide copies of all of the following documentation at the time of application: 1) agency notice; 2) most recent performance appraisal; and 3) most recent SF-50 or notification of personnel action that includes position, grade level, and duty location. Applicants who do not provide this documentation will not receive consideration as an ICTAP candidate. For more information about ICTAP eligibility please review the following link:\n\nHow You Will Be Evaluated\n\nYou will be evaluated for this job based on how well you meet the qualifications above.\n\nIn order to qualify for this position, your resume must provide sufficient experience and/or education, knowledge, skills, and abilities to perform the duties of the specific position for which you are being considered. Your resume is the key means we have for evaluating your skills, knowledge, and abilities as they relate to this position. Therefore, we encourage you to be clear and specific when describing your experience.\n\nWhen the application process is complete, we will review your resume to ensure you meet the hiring eligibility and qualification requirements listed in this announcement. You will be rated based on the information provided in your resume and responses to the Occupational Questionnaire, along with your supporting documentation to determine your ability to demonstrate the following competencies:\n\nACCOUNTABILITY FINANCIAL CONCEPTS POLICY AND PRINCIPLES FINANCIAL MANAGEMENT ANALYSIS MANAGING HUMAN RESOURCES\n\nYou should list any relevant performance appraisals and incentive awards in your resume as that information may be taken into consideration during the selection process. If selected, you may be required to provide supporting documentation.\n\nIf after reviewing your resume and supporting documentation, a determination is made that you inflated your qualifications and/or experience, your score may be adjusted to more accurately reflect your abilities or you may be found ineligible/not qualified.\n\nPlease follow all instructions carefully. Errors or omissions may affect your rating or consideration for employment.\n\nAll eligibility, qualifications, and time-in-grade requirements must be met by the closing date of this announcement.\n\nBackground checks and security clearance\n\nSecurity clearance\n\nSecret\n\nDrug test required\n\nNo\n\nRequired Documents\n\nYou are required to provide documentation that supports the eligibility and qualification claims made in your resume and assessment questionnaire . You must submit the applicable documents listed here and those listed with the eligibilities you select in the announcement questionnaire with your application package. Applicants who do not provide supporting documentation that fully", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTVVBFUlZJU09SWSBGSU5BTkNJQUwgTUFOQUdFTUVOVCBBTkFMWVNUIiwiY29tcGFueV9uYW1lIjoiRGVwYXJ0bWVudCBvZiB0aGUgTmF2eSIsImNvbXBhbnlfbWlkIjoiL20vMDNjdjI0IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiOF9UQ2k2UExwbkYybl9jSEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZZQkNyY0JRVTVWWDA1eFVYVXlSa0ZOU0V0algwTjNUM2xIU0c5S2JuVmpWVXRUUkU1MFFpMWpOVzVMTm1WeFFVZFNaMHhoYmpkRGNFZDZZemh4VDJOdGVqbG5UMmd4VjNObFVGUkdPVXQ1YUhscFZWOUJZemxuUzJKdWQxWnpjV1l0Tkc5M2JFcFFjVWs1VVVkbVdXdDZPSGxyVERaMlVIVm9RVzAzUjBOd1FXRnFSWGgzYm5aS2RYYzBUMlJ0YWxJM2NISlVValZOZFVSU1FrZGxUV1I2VWtob1oyeENRMEk1YTBwbWJITlZPRkpYU1hFMFIydDRUMVozRWhaNmJqWkRXVTAzWlV4S2JYVjBVV0pOTjBsVVowTlJHaUpCVDAxWlVuZERTMTlmTldsRlNuVlROVXRCT1ZRMlRsY3hWV1V4WlRGblMyZFIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY180NSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBXaGF0Sm9icyIsImxpbmsiOiJodHRwczovL2VuLXNnLndoYXRqb2JzLmNvbS9qb2ItZm9yLVNVUEVSVklTT1JZLUZJTkFOQ0lBTC1NQU5BR0VNRU5ULUFOQUxZU1QtaW4tc2luZ2Fwb3JlLXNpbmdhcG9yZS1jb29wMTc1NDc2MjQ/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Managed Risk Service Analyst", "company_name": "BlueVoyant", "location": "Singapore", "via": "via LinkedIn", "description": "Responsibilities\n• Produce formatted reports for clients to help them understand cyber risk profiles of specific networks.\n• Assist in discovery, analysis and tracking of advanced cyber threats.\n• Identify and correlate adversary tactics, techniques, and procedures (TTPs) across a range of raw data sources from host to internet.\n• Fuse internally derived and external cyber threat intelligence into techniques, analytics, and methodologies intended to detect and track advanced threats.\n• Produce high-quality threat intelligence reports.\n• Operate and populate a structured threat intelligence repository.\n• Support managed security services and incident response efforts by providing threat research and expertise.\n• Assist Customer Success in high-quality delivery\n\nBasic Qualifications\n• Demonstrated understanding of network protocols, including DNS, BGP, etc.\n• Knowledge of cyber tools and methods.\n• Ability to analyze raw data, perform research and formulate analytic conclusions.\n•... Ability to work directly with customers to understand requirements for and feedback on threat intelligence products and services.\n• Ability to present complex technical topics to a range of audiences in clear and easy to understand language (both verbal and written).\n• Strong teamwork and interpersonal skills, including the ability to work with a globally distributed team.\n• Able and willing to share on-call responsibilities during nonstandard hours and assist with onsite response efforts.\n\nEducation\n• Degree in Information Security, Computer Science, or other IT-related field preferred, but demonstrated knowledge without an IT-related degree will be considered.\n• Certified Information Systems Security Professional (CISSP) Cisco Certified Network Analyst (CCNA), Certified Ethical Hacker (CEH), Security+, and/or SANS/GIAC certifications are all pluses, and could be substituted for degree.\n\nExperience\n• One to five years of experience in cyber security, analysis, or related field.\n• Experience as a military or intelligence analyst processing collection is a plus.\n\nAbout BlueVoyant\n\nBlueVoyant is an expert-driven cybersecurity services company whose mission is to proactively defend organizations of all sizes against today’s constant, sophisticated attackers, and advanced threats.\n\nLed by CEO, Jim Rosenthal, BlueVoyant’s highly skilled team includes former government cyber officials with extensive frontline experience in responding to advanced cyber threats on behalf of the National Security Agency, Federal Bureau of Investigation, Unit 8200 and GCHQ, together with private sector experts. BlueVoyant services utilize large real-time datasets with industry leading analytics and technologies.\n\nFounded in 2017 by Fortune 500 executives, including Executive Chairman, Tom Glocer, and former Government cyber officials, BlueVoyant is headquartered in New York City and has offices in Maryland, Tel Aviv, San Francisco, London, and Latin America.\n\nAll employees must be authorized to work in Singapore. BlueVoyant provides equal employment opportunities to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. In addition to federal law requirements, BlueVoyant complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJNYW5hZ2VkIFJpc2sgU2VydmljZSBBbmFseXN0IiwiY29tcGFueV9uYW1lIjoiQmx1ZVZveWFudCIsImNvbXBhbnlfbWlkIjoiL2cvMTFoMXk0cWRsZiIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Ikg1Y2RlcTNtdEJaMXJpU01BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhVak5zUm1aZmFGb3paWGxyVHpGUVJ6RTFWemM0U0VoT09HSTBXa3RFTVRkcVdGOU5Sa1E1VFVFNGRTMTFVRmxzZW5wbE5tVXRlblp4Wkd4cWMwZG9SbUpoT0dwNVdDMU5jRmgxU20xdlJqTnNMUzFmUkV0NU1uZ3hRbTFvZEVKNE5qZFVTRTVHTVcwMFRYRm9RbkJYWms5Tk9HZHdZamxYZUU1bWIwVlliVmN4WXkxYWNsaDBSMUpFTXpWQlVtOXRRMXAxUWtkWWFsQkNZMmwzRWhaNmJqWkRXVTAzWlV4S2JYVjBVV0pOTjBsVVowTlJHaUpCVDAxWlVuZEVZM2sxVDBaS2EyTTNka05ZV21RdFFsZHlWVmQyU2t0WGVWcFIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY181MyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL3NnLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvbWFuYWdlZC1yaXNrLXNlcnZpY2UtYW5hbHlzdC1hdC1ibHVldm95YW50LTI0NTAxNzY5MTA/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "L&D Data Analyst (Manager)", "company_name": "PricewaterhouseCoopers GHRS Pte Ltd", "location": "Singapore", "via": "via Workday", "description": "Line of Service\nInternal Firm Services\n\nIndustry/Sector\nNot Applicable\n\nSpecialism\nIFS - Human Capital (HC)\n\nManagement Level\nManager\n\nJob Description & Summary\nA career at PwC is more than “just” a job. It’s about being part of a purpose-led firm that builds trust in society and solve important problems. We help our clients to make informed decisions and operate effectively within them. At PwC, we are committed to making a difference for each other, our clients, and our community — by empowering you to be the best version of yourself and investing in your growth. You’ll be able to develop as a leader, be well-connected, work in a great environment, explore our benefits and make a positive contribution.\n\nWith PwC, you’ll ignite a meaningful career while being supported by a strong coaching and people-oriented culture, our Flex policies (Flex Space, Flex Dress and Flex Time), innovative learning and development programs (training programs, digital upscaling) as well as mobility... opportunities. If you would like to be connected to like-minded individuals outside of work, we highly encourage you to be part of our people clubs and committees such as the Sports and Recreational Club, Toastmasters Club and more\n\nHow will you value add?\n\nA highly matured and independent individual responsible for performing analytics with learning data to generate insights on effectiveness of learning strategies, measure learning ROI, and propose learning solutions and design.\n\nThis individual will work cohesively with various client stakeholder groups across PwC, and display strong interpersonal and organizational skills, as well as business acumen.\n\nAdditionally, this individual will:\n• Collaborate with learning stakeholders on issue statements, and thereafter determine, design, propose and present data-validated solutions\n• Design data workflow for seamless data collection and reporting process\n• Prepare reports and create data visualisation dashboards for executive leadership that effectively communicate learning & development trends, patterns, and predictions using relevant data\n• Collaborate with programmers and organizational leaders to identify opportunities for process improvements, recommend system modifications, and develop policies for data governance.\n• Liaise with Global/Regional L&D and HR teams to introduce data solution and digital initiatives locally\n• Support any ad-hoc projects as may be required or assigned\n\nAbout you\n\nWhat we need to see in you:\n• Degree in Computer Science / Information Technology or its equivalent\n• Minimum 5 years of relevant work experience in the L&D environment and possess good data analytics skills\n• Certification in Alteryx, PowerBI, Tableau, Qlikview or UIPath preferred\n• A critical thinker with strong analytical and problem solving skills\n• Strong interpersonal and communication skills with ability to understand and communicate business needs\n• A team player with a high level of agility\n• Only shortlisted candidates will be notified due to the high number of applicants for this role.\n\nEducation (if blank, degree and/or field of study not specified)\nDegrees/Field of Study required:\n\nDegrees/Field of Study preferred:\n\nCertifications (if blank, certifications not specified)\n\nDesired Languages (If blank, desired languages not specified)\n\nTravel Requirements\nNot Specified\n\nAvailable for Work Visa Sponsorship?\nYes\n\nGovernment Clearance Required?\nNo\n\nJob Posting End Date", "extensions": ["22 days ago", "Full–time"], "detected_extensions": {"posted_at": "22 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJMXHUwMDI2RCBEYXRhIEFuYWx5c3QgKE1hbmFnZXIpIiwiY29tcGFueV9uYW1lIjoiUHJpY2V3YXRlcmhvdXNlQ29vcGVycyBHSFJTIFB0ZSBMdGQiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImRtUEFnMUxsWjBCRDltU2lBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gV29ya2RheSIsImxpbmsiOiJodHRwczovL3B3Yy53ZDMubXl3b3JrZGF5am9icy5jb20vR2xvYmFsX0V4cGVyaWVuY2VkX0NhcmVlcnMvam9iL1NpbmdhcG9yZS9MLUQtU3lzdGVtcy1hbmQtRGF0YS1BbmFseXN0XzE3OTMyNFdEP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Information Security Analyst", "company_name": "None", "location": "Singapore", "via": "via Jobs", "description": "Job Responsibilities : Provide technical guidance and support to customers, partners and subcontractors (internal and external) in order to achieve the project's security goals. Analyse the high-level security requirements at the beginning of the project; derive detailed security requirements for networks and related security appliances; for threat prevention and monitoring, for log management and monitoring; for cryptography, digital certificates and public key infrastructures (PKIs), as well as operating systems (Linux, Windows), appliances and software hardening; adhering to industry standards. Propose security controls based on security technologies evaluation; Review architecture/platforms; identify possible security threats and identifying areas of weakness; prepare cost estimates. Prepare/complete security documentation during the design/development/integration/tests stages; establish security guidelines/procedures for operational systems. Support the implementation of security... solutions; creating, transmitting, and maintaining digital keys and certificates; completing documentation. Verify security controls through system security acceptance testing; manage dynamic application security testing, static code analysis, vulnerability scans, and penetration testing; analysing and validating the test reports; detailing actions for other team members. Maintain security by ensuring compliance to standards, policies, and procedures; conducting incident response analyses; developing training programs. Prepare system security reports by collecting, analysing, and summarizing data and trends. Update job knowledge by tracking and understanding emerging security practices and standards; participating in educational opportunities; reading professional publications; maintaining personal networks; participating in professional organizations. Enhances IDEMIA agency reputation by accomplishing new and different requests for other IDEMIA projects world-wide; Job Requirements: Mininum 5 years of working experience in at least of the the following domains: Network security Data security Application security Wireless/Mobile security Cloud security For this position, the G50 clearance cat 2 is mandatory. Experience in working on highly secure systems or critical information infrastructure (CII) would be an advantage. Autonomous, with good communication skills to interface and build relationships (with customers, partners and internal teams). Demonstrate a high sense of confidence to personify our security activity. Used to work in international teams (fluent English, intercultural skills). Knowledgeable in project / product development life cycle to understand the constraints of the deployed solution and the teams and in order to support them. Readiness to work under time pressure and able to adjust quickly to project demands Technical Skills: Hands-on experience in Operating System hardening, Active Directory/LDAP, Firewalls, Proxy, Data Diode, IDS/IPS, AV, IAM, PAM, and SIEM is preferred. Good knowledge of software and applications security (SDLC, OWASP, security trends, standards, best practices, concepts and solutions); static and dynamic code analysis, vulnerabilities management. Experience in risk analysis and assessment on Information Technology (IT) and Operational Technology (OT) systems ( ISO27005). Production of security documentation. Knowledge of information security systems and associated threats (secure development, architecture, anonymization, authentication, signatures, traces, network, production environment, etc.). Knowledge of Security Testing (experience in vulnerability assessment and penetration testing will be advantageous). Knowledge/experience in major Security Standards and Guidelines would be appreciated: ISO/IEC 27001, ITIL, PCI DSS, An internationally recognised professional security certifications such as: Certified Information Systems Security Professional (CISSP), Certified Information Security Manager (CISM), Certified Information Security Auditor (CISA) Advanced Level Certification from SANS' Global Information Assurance Certification (GIAC). Documented evidence to support the claims (e.g. CISSP certification number) will be required Job Responsibilities: Provide technical guidance and support to customers, partners and subcontractors (internal and external) in order to achieve the project's security goals. Analyse the Skills: Active Directory, Computer Security, Cryptography, Disaster Recovery, Information Security, Information Security Management, Management, Network Security, Security, Windows Server, Monitoring, digital certificate Experience: 5.00-7.00 Years", "extensions": ["26 days ago", "Full–time"], "detected_extensions": {"posted_at": "26 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJJbmZvcm1hdGlvbiBTZWN1cml0eSBBbmFseXN0IiwiY29tcGFueV9uYW1lIjoiTm9uZSIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiYmhyX3pRSXAzMk1ZT2ZKWkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIiwibGluayI6Imh0dHBzOi8vc2cuZmlkYW50by5jb20vbW9iaWxlL2pvYnMvam9iLW9wZW5pbmcvaW5mb3JtYXRpb24tdGVjaG5vbG9neS1wcm9qZWN0LW1hbmFnZXJzL2luZm9ybWF0aW9uLXNlY3VyaXR5LWFuYWx5c3QtMjYxMDI0NjgzP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Business Operations", "value": "GC06"}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Accounting and Finance", "value": "GC01"}, {"text": "Science and Engineering", "value": "GC27"}, {"text": "Advertising and Marketing", "value": "GC03"}, {"text": "Legal", "value": "GC17"}, {"text": "Management", "value": "GC18"}, {"text": "Protective Services", "value": "GC23"}, {"text": "Customer Service", "value": "GC10"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Property", "value": "GC24"}, {"text": "Sales and Retail", "value": "GC26"}, {"text": "Social Services and Non-Profit", "value": "GC28"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "Business analyst", "value": "business analyst"}, {"text": "Analyst", "value": "analyst"}, {"text": "Security analyst", "value": "security analyst"}, {"text": "Systems analyst", "value": "systems analyst"}, {"text": "It analyst", "value": "it analyst"}, {"text": "Data analyst", "value": "data analyst"}, {"text": "System analyst", "value": "system analyst"}, {"text": "Support analyst", "value": "support analyst"}, {"text": "Test analyst", "value": "test analyst"}, {"text": "Associate", "value": "associate"}, {"text": "Management analyst", "value": "management analyst"}, {"text": "Operations analyst", "value": "operations analyst"}, {"text": "Soc analyst", "value": "soc analyst"}, {"text": "Research analyst", "value": "research analyst"}, {"text": "Senior", "value": "senior"}, {"text": "Senior analyst", "value": "senior analyst"}, {"text": "Control analyst", "value": "control analyst"}, {"text": "Intelligence analyst", "value": "intelligence analyst"}, {"text": "Manager", "value": "manager"}, {"text": "Project analyst", "value": "project analyst"}, {"text": "Researcher", "value": "researcher"}, {"text": "Risk analyst", "value": "risk analyst"}, {"text": "Service analyst", "value": "service analyst"}, {"text": "Technology analyst", "value": "technology analyst"}, {"text": "Accounting analyst", "value": "accounting analyst"}, {"text": "Application analyst", "value": "application analyst"}, {"text": "Behavior analyst", "value": "behavior analyst"}, {"text": "Business", "value": "business"}, {"text": "Center analyst", "value": "center analyst"}, {"text": "Compliance analyst", "value": "compliance analyst"}, {"text": "Coordinator", "value": "coordinator"}, {"text": "Desk", "value": "desk"}, {"text": "Desk analyst", "value": "desk analyst"}, {"text": "Financial analyst", "value": "financial analyst"}, {"text": "Functional analyst", "value": "functional analyst"}, {"text": "Hr analyst", "value": "hr analyst"}, {"text": "Interns", "value": "interns"}, {"text": "Operations center", "value": "operations center"}, {"text": "Process analyst", "value": "process analyst"}, {"text": "Programmer analyst", "value": "programmer analyst"}, {"text": "Project manager", "value": "project manager"}, {"text": "Qa analyst", "value": "qa analyst"}, {"text": "Senior associate", "value": "senior associate"}, {"text": "Senior consultant", "value": "senior consultant"}, {"text": "Specialist", "value": "specialist"}, {"text": "Sr analyst", "value": "sr analyst"}, {"text": "Support executive", "value": "support executive"}, {"text": "Technical analyst", "value": "technical analyst"}, {"text": "Technical architect", "value": "technical architect"}, {"text": "Trainee", "value": "trainee"}, {"text": "Treasury analyst", "value": "treasury analyst"}, {"text": "Wealth management", "value": "wealth management"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Internship", "value": "INTERN"}, {"text": "Part-time", "value": "PARTTIME"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Research", "value": "/business/naics2007/5417"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Mining", "value": "/business/naics2007/21"}, {"text": "Real Estate", "value": "/business/naics2007/53"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Engineering Services", "value": "/business/naics2007/5413"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Utilities", "value": "/business/naics2007/22"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "SingTel", "value": "/m/020zfl"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "Trustwave", "value": "/m/0n3xjf5"}, {"text": "Government Technology Agency", "value": "/g/11gh0528nq"}, {"text": "OCBC", "value": "/m/055r27"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "Credit Agricole Group", "value": "/m/028vbm"}, {"text": "HSBC", "value": "/m/01vq1f"}, {"text": "Randstad Singapore", "value": "/g/11g70b50mr"}, {"text": "UL", "value": "/m/01q1gj"}, {"text": "VISA", "value": "/m/01kqjn"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "American Express", "value": "/m/01w6dw"}, {"text": "Avensys Consulting", "value": "/g/11g7022gjf"}, {"text": "Binance", "value": "/g/11hcz1r4wl"}, {"text": "BlueVoyant", "value": "/g/11h1y4qdlf"}, {"text": "Caterpillar", "value": "/m/0319hp"}, {"text": "Cognizant Singapore, Cognizant Technology Solutions", "value": "/m/03bf9h"}, {"text": "DBS Bank Ltd", "value": "/m/01q7n5"}, {"text": "Deloitte SEA", "value": "/g/11f_g4x9d_"}, {"text": "Dyson", "value": "/m/05cskg"}, {"text": "EPAM Systems", "value": "/m/0dlnrc"}, {"text": "Experis Singapore", "value": "/g/11dxpnwm3s"}, {"text": "JPMorgan Chase & Co.", "value": "/m/01hlwv"}, {"text": "Jobline Resources Pte Ltd", "value": "/g/11gp2647pn"}, {"text": "Medtronic", "value": "/m/03z4j3"}, {"text": "Mizuho Bank", "value": "/m/022103"}, {"text": "Public Service Division", "value": "/g/11g6__bv10"}, {"text": "RECRUIT EXPRESS PTE LTD", "value": "/g/11g706hzhq"}, {"text": "RHB Singapore", "value": "/g/11c73srg7f"}, {"text": "SITA", "value": "/m/06l20z"}, {"text": "Selby Jennings", "value": "/g/11fy2ds3gn"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "Xcellink Pte Ltd", "value": "/g/11c73prcqy"}, {"text": "Xilinx", "value": "/m/03dwkc"}, {"text": "103 Golden Agri International Pte Ltd", "value": "/g/11fy210tb9"}, {"text": "Activate Interactive Pte Ltd", "value": "/g/11dxq192l5"}, {"text": "Amazon", "value": "/m/0mgkg"}, {"text": "Apple", "value": "/m/0k8z"}, {"text": "Aramco", "value": "/m/01qjg2"}]}]}