{"search_metadata": {"id": "6082796dcca01462e76729dd", "status": "Success", "json_endpoint": "https://serpapi.com/searches/a70d29e1e35fce22/6082796dcca01462e76729dd.json", "created_at": "2021-04-23 07:38:21 UTC", "processed_at": "2021-04-23 07:38:21 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28product+manager%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=50", "raw_html_file": "https://serpapi.com/searches/a70d29e1e35fce22/6082796dcca01462e76729dd.html", "total_time_taken": 1.09}, "search_parameters": {"q": "(product manager) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "50"}, "jobs_results": [{"title": "Product Manager", "company_name": "Hgx Pte. Ltd.", "location": "Singapore (+1 other)", "via": "via Monster", "description": "We are looking for a Product Manager to lead, manage, and support various products and initiatives for the exchange, which may span across related companies, as well as different departments and functions, including exchange operations, technology infrastructure, etc.\n\nRoles & Responsibilities\n• Coordinate closely with all stakeholders of the exchange: Management, Technology, Business Development, Legal/Compliance and others to identify new business opportunities, areas of improvement and to resolve open issues as they arise.\n• Prioritize, plan and manage major projects with input from Member Firms and stakeholders\n• Balance technology, user experience and revenue generation goals —innovate, make informed decisions and continuously measure processes and activities that have a significant impact on those decisions\n• Reduce entropy by managing the huge influx of ideas and data, and prioritising every task so that all stakeholders are always clear about their current goals and what's... coming up next\n• Manage exchange development and delivery closely with technology team members while consistently prioritising feature demands and backlog together with expected timelines\n• Engage and challenge stakeholders to surface problems and refine ideas, while complement that with data and research\n\nSkills & Experience Required\n• At least 5 years in the field of Product Management, preferably in a high-growth technology company\n• Experience working in financial institutions, preferably in private equities and/or stock brokerage\n• Strong understanding of product life cycles and methodologies\n• Strong understanding of a variety of digital solutions and processes\n• Able to manage multiple products concurrently, using product management tools like JIRA\n• Agile development experience\n• Strong understanding of digital processes and tools such as UX and their impact to strategic objectives\n• Basic technical skills including PHP, HTML, CSS, JavaScript , SQL and/or SAS.\n• Participate in reviewing QA and leading UAT plans\n• Preferably certified in Product Management (PMP/Prince2/CITPM)\n• A sense of ownership and take on responsibilities and challenges, thrive on logic, accept and create changes with flexibility\n\nThe Ideal Candidate Should Be\n• Able to multitask, handle additional roles and work independently in often in a time-sensitive environment\n• Passionate about finance, trading and blockchain technology\n\nIf you are interested, please send your resume to [Confidential Information]ge.\n\nOnly successful applicants will be contacted", "extensions": ["24 days ago", "Full–time"], "detected_extensions": {"posted_at": "24 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9kdWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJIZ3ggUHRlLiBMdGQuIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJUVm0tV1RrcE9aLUFHYnhEQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1vbnN0ZXIiLCJsaW5rIjoiaHR0cHM6Ly93d3cubW9uc3Rlci5jb20uc2cvYW1wL2pvYi12YWNhbmN5LXByb2R1Y3QtbWFuYWdlci1oZ3gtcHRlLWx0ZC1zaW5nYXBvcmUtMjY5Nzg1NjUuaHRtbD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Technical/product Manager", "company_name": "Enggsol Pte Ltd", "location": "Singapore (+1 other)", "via": "via MNC Jobs Singapore | MNC Jobs In Singapore", "description": ":\n\nA Work with customers to integrate in-house cyber security products into the operational environment with knowledge of network and application layer protocols.\n\nA Manage the deployment and operational support of in-house cyber security products such as conducting pre-deployment products testing.\n\nA Attend to fault calls, troubleshoot hardware and software technical problems using a range of diagnostic utility tools.\n\nA Perform routine operational preventive maintenance tasks, e.g. evaluate, test, and apply critical patches to operating systems, applications, etc.\n\nA Manage the projects' Cost, Schedule, Performance & Risks\n\nRequirements\n\nA Degree in Computer Science, Information Technology or equivalent.\n\nA Relevant work experience with at least 3 a 5 years preferred.\n\nA Candidates with PMP preferred.\n\nA Possess CCNA or Certification in Cyber Security or Information Technology Security Field will be an added advantage.\n\nA Ability to work in a team with good communication... negotiation and presentation skills.\n\n: A Work with customers to integrate in-house cyber security products into the operational environment with knowledge of network and application layer protocols.A Manage the deployment and operational support of in-house cyber sec", "extensions": ["24 days ago", "Full–time"], "detected_extensions": {"posted_at": "24 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJUZWNobmljYWwvcHJvZHVjdCBNYW5hZ2VyIiwiY29tcGFueV9uYW1lIjoiRW5nZ3NvbCBQdGUgTHRkIiwiY29tcGFueV9taWQiOiIvZy8xMWc5bW5mbW0xIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiSGg4TzRrbnBsY3BnM0N4TEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZZQkNyY0JRVTVWWDA1eFVqVkpSbVZCVERZMmFXbGhhbXN6VjBobVoxUXhYMmRVYURWaFVHUjRZVkU0TWtKWlowUlVkeTFhYXpNME5uQnVVRFEyWjJ4SFVHVjZTa2huZGxNeE1VWTVhMmhUZFdObk1uWndTa3hNV210RFl6bERlVEpZWWxKcFVIRk5kek41ZVVFMGNVWlVSMnQ2T1RGeFZuRnVjVWRNYkhGSWMxaFJUMk5hVkVaSmJYSjJkamd5VHpjMmNWTmlVSGhrVDFwV056bGxkbFpuWmtaSU1rbGZTRmRGYWpsV2NHcHhXVWt6YUcxWGJFMHdWRkZORWhaaVdHMURXVTkxYmt4eldGaDBRV0pQYW5CaU5FRm5HaUpCVDAxWlVuZENabVZqVXpoSFltNVlOV1JhUVRSak5EbHFiMUJTUzJWZk1IUm4iLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18xMCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNTkMgSm9icyBTaW5nYXBvcmUgfCBNTkMgSm9icyBJbiBTaW5nYXBvcmUiLCJsaW5rIjoiaHR0cHM6Ly9zZy5tbmNqb2J6LmNvbS9qb2JzL3RlY2huaWNhbHByb2R1Y3QtbWFuYWdlci1zaW5nYXBvcmUtNDA1OTY/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Banking Product Techno-Functional Project Manager", "company_name": "Citi bank", "location": "Singapore", "via": "via Bayt.com", "description": "The IT Project Manager provides full leadership and supervisory responsibility. Provides operational/service leadership and direction to team(s). Applies in-depth disciplinary knowledge through provision of value-added perspectives or advisory services. May contribute to the development of new techniques, models and plans within area of expertise. Strong communication and diplomacy skills are required. Generally has responsibility for volume, quality, timeliness of end results and shared responsibility for planning and budgets. Work affects an entire area, which eventually affects the overall performance and effectiveness of the sub-function/job family. Full supervisory responsibility, ensuring motivation and development of team through professional leadership to include duties such as performance evaluation, compensation, hiring, disciplinary and terminations as well as direction of daily tasks and responsibilities.\n\nResponsibilities:\n• Manages technical components of moderately... complex IT projects.\n• Coordinates activities of the project team, identifies necessary resources and develops schedules to meet completion deadlines.\n• Evaluates subordinates' performance and makes decisions on pay increases, promotions, terminations, and other personnel actions.\n• Verifies team adherence to control and risk implementations as well as standards and process changes.\n• Identifies scope and impact of project risks and issues; raises and resolves issues.\n• Applies good understanding of concepts and procedures within own IT project leadership area to resolve issues.\n• Demonstrates a comprehensive understanding of how areas of IT project leadership collectively integrate to contribute to achieving business goals.\n• Provides evaluative judgment based on analysis of factual information in complicated and unique situations.\n• Directly impacts the IT project leadership area through shared responsibility for delivery of end results and contribution to planning, budget management and formulation of procedures; influences resource planning.\n• Persuades and influences others through communication and diplomacy skills; may negotiate with external parties.\n• Has the ability to operate with a limited level of direct supervision.\n• Can exercise independence of judgement and autonomy.\n• Acts as SME to senior stakeholders and /or other team members.\n• Ability to manage teams.\n• Appropriately assess risk when business decisions are made, demonstrating particular consideration for the firm's reputation and safeguarding Citigroup, its clients and assets, by driving compliance with applicable laws, rules and regulations, adhering to Policy, applying sound ethical judgment regarding personal behavior, conduct and business practices, and escalating, managing and reporting control issues with transparency, as well as effectively supervise the activity of others and create accountability with those who fail to maintain these standards.\n\nQualifications:\n• 6-10 years experience in an IT project leadership role with commensurate people management experience.\n\nEducation:\n• Bachelor’s/University degree or equivalent experience\n\nThis job description provides a high-level review of the types of work performed. Other job-related duties may be assigned as required.\n\nBanking and Lending is a key focus area in Citi Private Bank. The key responsibility for the new hire is to be stay close with the Banking Product, Associate Bankers and Banking Operations users to facilitate business analysis, project management and develop technology solutions.\n• Manage key banking projects analysis on an end to end basis\n• Work with various functional groups to understand their requirements, analyze business requirements and recommend technical solutions\n• Manage the onsite and offshore development team to cover the development activities\n• Work with the business users to come up with Technology solutions for the business requirements\n• The candidate should be able to manage the end-to-end project and larger program management experience\n• Interact with global technology partner teams.\n\n-------------------------------------------------\n\nJob Family Group:\n\nTechnology\n\n-------------------------------------------------\n\nJob Family:\n\nTechnology Project Management\n\n------------------------------------------------------\n\nTime Type:\n\n------------------------------------------------------\n\nCiti is an equal opportunity and affirmative action employer.\n\nQualified applicants will receive consideration without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.\n\nCitigroup Inc. and its subsidiaries (\"Citi”) invite all qualified interested applicants to apply for career opportunities. If you are a person with a disability and need a reasonable accommodation to use our search tools and/or apply for a career opportunity review Accessibility at Citi.\n\nView the \"EEO is the Law\" poster. View the EEO is the Law Supplement.\n\nView the EEO Policy Statement.\n\nView the Pay Transparency Posting", "extensions": ["2 days ago", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJCYW5raW5nIFByb2R1Y3QgVGVjaG5vLUZ1bmN0aW9uYWwgUHJvamVjdCBNYW5hZ2VyIiwiY29tcGFueV9uYW1lIjoiQ2l0aSBiYW5rIiwiY29tcGFueV9taWQiOiIvbS8wMWRmYjYiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiI5YkZQNXY4ems1bjlWV0lCQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VkhwUFpHZzNlRTFUWkRoWE1ERm5hVWwwYTBGRE0xRkZXbGhhVjA5WFZtOUhPRTR6YnpocmVtNVRUVlJFYUZoWlVWUktRV1pNVTBGU2VGTTRNaTE0ZEc0MVh5MXFhbXBvYUd4SlVGVnhWblEwYVVwbVRtdG5hMW8zTjBaTVpuaGxPRXhpY25aVFlqbFlkRFY0TWpOak1WRTBaRmQ1V1c5cVVERXliazVCT0U1VlNrcDFWelZNYUdVemVrRjJSVzlPUzBNMWFEZHBlbHBGWkdaUkVoWmlXRzFEV1U5MWJreHpXRmgwUVdKUGFuQmlORUZuR2lKQlQwMVpVbmRDY1RsRWJFSkJUWEJIVVRKWWNtWjZlWGRzTVVWdGEzTnBjbU5CIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMTciLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQmF5dC5jb20iLCJsaW5rIjoiaHR0cHM6Ly93d3cuYmF5dC5jb20vZW4vc2luZ2Fwb3JlL2pvYnMvYmFua2luZy1wcm9kdWN0LXRlY2huby1mdW5jdGlvbmFsLXByb2plY3QtbWFuYWdlci01OTU3MzQ0MS8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Product Manager", "company_name": "Hodlnaut", "location": "Singapore", "via": "via LinkedIn", "description": "Due to COVID-19 and the tightened travel/work visa restrictions, Hodlnaut is currently unable to extend offers to anyone who cannot work from Singapore due to lockdown visa/travel restrictions, or other restrictive measures until further notice. We will be prioritizing candidates who can start in this location by set date as expected.\n\n﻿Company Profile:\n\nHodlnaut is the leading Crypto Borrowing and Lending Platform based in Singapore whose mission is to provide financial services to cryptocurrency users. The platform currently has over $250 Million USD of Digital Assets under Management and is growing at an average of 20% month on month.\n\nHodlnaut is a certified Fintech by the Singapore Fintech Association, an accreditation recognized by the MAS (Monetary Authority of Singapore). Hodlnaut is also currently undergoing license application under the PS Act 2019 (by the MAS) and is looking to become the first regulated entity in Singapore within the Crypto Borrowing and Lending Space.\n\nAs... Hodlnaut scales, it is looking for a Product Manager to join the team.\n\nResponsibilities:\n• Lead the ideation, technical development, and launch of innovative products\n• Product planning and design, preparing PRD, concept wire framing and product roadmap\n• Taking a user-centric approach to understanding users’ needs and pain points, in order to develop requirements and product solutions\n• Manage cross-functional and cross-department communication and coordination to ensure product quality and progress, and completion of product milestones\n• Support related business needs and achieve business goals\n• Any other ad-hoc duties\n\nRequirements:\n• Singaporeans and Singapore PR only\n• Min. Bachelor’s degree or above, educational background or work experience related to tech and/or finance.\n• 3+ years working experience in building features as a product manager or product owner\n• Strong business acumen and able to define product success metrics aligned to company’s business goals\n• Analytical and structured thinking with ability to break problems down in milestones and deliverables\n• Strong ability in managing project with tight deadlines and leading the product development to completion\n• Willingness to take end to end ownership and being accountable for the success of the product\n• Excellent communication and interpersonal skills\n\nGood to have:\n• Experience and/or knowledge in crypto would be strongly preferred\n• Work experience in a startup environment would be strongly preferred\n• Demonstrated track record of understanding and driving business requirements while working with various stakeholders\n\nAbout us:\n• Rapidly growing startup\n• Fast moving, challenging and unique business problems. Take ownership of your role and have independence to drive your own projects\n• Flat organizational structure\n• Great career development opportunities in a growing company\n• Competitive compensation structure", "extensions": ["7 days ago", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9kdWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJIb2RsbmF1dCIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoidFhQWmZrLWdWaGlXUHg3SUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL3NnLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvcHJvZHVjdC1tYW5hZ2VyLWF0LWhvZGxuYXV0LTI0ODUxMTM3MzY/cmVmSWQ9NWFhY2YxODUtYzZlNy00NDcyLWJmOWItOTg5ZTFmMDkyNGRhXHUwMDI2dHJhY2tpbmdJZD1rRUViUWhVZEdXN0JsUVJGVEY4L1JRJTNEJTNEXHUwMDI2cG9zaXRpb249MTdcdTAwMjZwYWdlTnVtPTBcdTAwMjZ0cms9cHVibGljX2pvYnNfam9iLXJlc3VsdC1jYXJkX3Jlc3VsdC1jYXJkX2Z1bGwtY2xpY2tcdTAwMjZ1dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior Product Manager", "company_name": "None", "location": "Singapore", "via": "via Jobs | Fidanto", "description": "Position Summary• Responsible for entire product life cycle management - development and management of products as per new product/service requirement and enhancement of existing products and features.• Also responsible for the augmentation of network capacity to meet growing customer needs, new technology introduction, or increasing operational efficiencies, with the objective of ensuring an increase in product and service profitability, revenue and market competitiveness; and developing and delivering effective multi-product solutions to meet customer requirements.• Drive P & L management through product strategy development and manage a group of products within a technology area across multiple regions. Works with the sales team on market strategy, pricing, and positioning of the product.• Engage and partner with technology providers to recruit new features or new products. Assess the performance of the product/service portfolio against the annual operating plan and discuss the... achievement of targets with Sales.The broad outline of the Role• Drive P & L management for product portfolio through product development and management, sales support and enablement discussions with Sales, Customers, Engineering, Operations Technology and Service Development.• Tactical role which provides a marked contribution to defining the product strategy, direction of new products, processes, standards or operational plans based upon business strategy, with a significant midterm impact on business unit overall results.• Identifies problems and suggests inputs to product development and engineering team to significantly improve a process or fulfil service realisation and operationalize product/service and associated costs, individual contributor, in regions Involved in planning and strategizing of new and existing products. The impact of decisions made is mid-term in nature.• Typically has small to medium profit and loss responsibility for a product portfolio May lead regional projects for a specific product portfolio.Minimum qualification & experience• Bachelor's degree in Engineering majoring in technology and/or telecommunications with strong working experience involving telecommunications and IT services operations• At least 10 years in the telecommunications industry in techno-commercial assignments and other related ICT experience• Strong working knowledge and ideally with Microsoft 365 Certified Teams Administration certification, MCSE, MCP or Skype for Business and other related certifications for business collaboration• Understanding of systems Polycom's and video collaboration (MS Team systems)• Problem solving and resourcefulness in conditions of ambiguity, defining approaches and processes where none exist.• Professional attitude, with excellent interpersonal skills able to present and influence internal to the company, and with external partners and customers.• Possesses good communication skills (oral and written", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgUHJvZHVjdCBNYW5hZ2VyIiwiY29tcGFueV9uYW1lIjoiTm9uZSIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiZ3JhUmEyUmQtTmN6UUx4VkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIHwgRmlkYW50byIsImxpbmsiOiJodHRwczovL3NnLmZpZGFudG8uY29tL2pvYnMvam9iLW9wZW5pbmcvbWFuYWdlcnMtYWxsLW90aGVyL3Nlbmlvci1wcm9kdWN0LW1hbmFnZXItMjc1NDMzMTg3P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "VP, Portfolio Product Manager, TMRW Digital Group - Singapore", "company_name": "United Overseas Bank (UOB)", "location": "Singapore", "via": "via JobWiz", "description": "Posting Date: 29-Mar-2021\n\nLocation: Raffles Place, Singapore, SG\n\nCompany: United Overseas Bank Limited\n\nAbout UOB\n\nUnited Overseas Bank Limited (UOB) is a leading bank in Asia with a global network of more than 500 branches and offices in 19 countries and territories in Asia Pacific, Europe and North America. In Asia, we operate through our head office in Singapore and banking subsidiaries in China, Indonesia, Malaysia and Thailand, as well as branches and offices.\n\nOur history spans more than 80 years. Over this time, we have been guided by our values - Honorable, Enterprising, United and Committed. This means we always strive to do what is right, build for the future, work as one team and pursue long-term success. It is how we work, consistently, be it towards the company, our colleagues or our customers.\n\nAbout the Department\n\nThe focus for UOB's Digital Bank is engagement and this guides the whole experience for our customers.\n\nWe serve customers across the region where they... will enjoy a fully digital experience which is intuitive, transparent and engaging - from the moment they apply, to opening an account, through to their everyday lifestyle needs. Every interaction will be designed to deepen the customer relationship through meaningful conversations and personalised engagement.\n\nThe business model is powered by next-generation artificial intelligence, machine learning, data analytics, user interface design and smartphone capabilities. These include our own digital technology innovations as well as solutions provided through our collaboration with FinTech partners.\n\nJob Responsibilities\n• Drive and manage all product performance metrics with the respective countries\n• Key country liaison\n• Work with respective COEs to design and develop the full digital journey and experience of the digital product\n• Develop the business requirements for system development\n• Ensure compliance in product governance and review requirements\n• Ensure compliance with regulatory requirements in designing product distribution process\n• Work with Partnership & Sales, Credit, E-lab and Usage COEs to drive acquisition, activation and usage, retention, cross sell and up-sell\n• Work closely with Country and Regional stakeholders on launch activities, e.g. T&C, collateral development, training, etc\n• Work closely with Country and Regional stakeholders on appropriate operational procedures for products, services and systems\n• Participate in product user acceptance testing (UAT)\n• Keep abreast with market updates to ensure product relevancy\n\nJob Requirements\n• Ability to work and engage with all levels of the business across all the Digital Bank countries\n• Degree holder with experience in product development and portfolio management for Retail products.\n• Knowledge of digital banking landscape with awareness of emerging innovation\n• Strong analytical and presentation skills, meticulous, possess drive and initiative\n• Able to work effectively independently and in a team\n• Customer Centric\n• Strong Business Acumen\n• Problem solving\n• Project management skills\n• High Proficiency in Microsoft Office Applications\n• Professional Scrum Product Owner certification will be an advantage\n\nBe a part of UOB Family\n\nUOB is an equal opportunity employer. UOB does not discriminate on the basis of a candidate's age, race, gender, color, religion, sexual orientation, physical or mental disability, or other non-merit factors. All employment decisions at UOB are based on business needs, job requirements and qualifications. If you require any assistance or accommodations to be made for the recruitment process, please inform us when you submit your online application.\n\nApply now and make a difference.\n\neFinancialcareers", "extensions": ["25 days ago", "Full–time"], "detected_extensions": {"posted_at": "25 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJWUCwgUG9ydGZvbGlvIFByb2R1Y3QgTWFuYWdlciwgVE1SVyBEaWdpdGFsIEdyb3VwIC0gU2luZ2Fwb3JlIiwiY29tcGFueV9uYW1lIjoiVW5pdGVkIE92ZXJzZWFzIEJhbmsgKFVPQikiLCJjb21wYW55X21pZCI6Ii9tLzA0Z2pkMSIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Ii1iZTJXcHMySkl2OEhJbHZBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVvc0NDc3dCUVU1VlgwNXhVMmhoWmxkNE9EUmFSbDlaWW5CQ2NUUkxOazFDV21FeGVVUm9NRVpoWW1aUmEzWjNaR0ZGVEdOT01pMDFiR0UyYkhJd1dXaEJXRWh2ZDNFemFubDRaVXRSUmtscmFscHFaRXhpVG5GTU9WRTRjVzUzVUdSRU1rRm9SVVJaY2toT1JFTjNVMjkxVDJSdGNsQkthVXRoWDBFdExWSjFjWFI1YURoR00xVkNTR1YzWHpGV1UyRkJWRkZ4YkhkcFJXRkZORWQwWVV4WFJYaFpSR3hyU2s5UE1XVXlPR0ZmVm1OTlUwdEdlR0ozUkZCNlZ6RjNVWGxNY21NdExWaFBTMWRhTWpCVk5ISXlFaFppV0cxRFdVOTFia3h6V0ZoMFFXSlBhbkJpTkVGbkdpSkJUMDFaVW5kQ2FrWk1RWEF3VjBneFZrNUpSR2huVG0xelgzbE9RME5RY2xsUiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzM1IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYldpeiIsImxpbmsiOiJodHRwczovL2pvYndpei5zZy9qb2IvQ1ItNjI3NTYxMjE2P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Manager - Brand Measurement", "company_name": "GrabTaxi Pte Ltd", "location": "Singapore", "via": "via Monster Singapore", "description": "Job Description :\nGet to know our Team:\nGrabAds allows Advertisers, Agencies, and Merchants to engage the Grab Audience via innovative online and offline advertising experiences. Through our unique ecosystem and transacting user base, our clients are able to reach their desired audiences at scale, while driving measurable business outcomes.\nWe would like You to join our journey to create value for our users, drivers, merchants, and advertising partners, while continuing to make everyday lives better across Southeast Asia.\nThe regional team is based in Singapore, and the role will require you to work hand in hand with regional product management and country teams across Grab’s eight markets, focusing on the areas that matter most to our merchants.\nGet to know the Role:\nReporting to the Head of Ad Operations, you will be leading and managing a team to ensure the successful delivery of online advertising campaigns throughout the Grab ecosystem. The successful candidate will be... responsible for making sure that the team delivers on assigned projects & making necessary optimizations across multiple platforms, creating ad hoc & weekly reports, leading client correspondence on assigned accounts, and preparing delivery data for client billing.\nCross-functional collaboration on a daily basis with Sales, Sales Ops, Marketing, Finance, Product, and Analytics orgs to support sales efforts, drive product and service requirements, and allow for accurate financial / business reporting. This is a central role which enables the scale of the entire organization.\nThe day-to-day activities\n• Lead measurement, research, and learning plans for key clients in support of their media objectives and the long-term growth of the partnership\n• Lead the strategy, prioritization and roadmap for ads measurement, insights strategy, and ways of working in partnership with Sales, Product, and Operations leadership\n• Work closely with Product and R&D teams to identify, prototype and scale new solutions or capabilities\n• Pioneer innovation areas such as online to offline (O2O) measurement in partnership with Data Science and R&D to understand the relative impact of different marketing strategies on real world outcomes\n• Train and Assist Sales, Operations, and Product stakeholders in administering various forms of 1st and 3rd party measurement.\n• Develop relationships with 3rd party measurement providers (including joint offerings)\n• Work with internal teams to uphold legal and data privacy matters\n\n​The must haves:\n• Ability to structure and conduct analyses to generate insight and recommendations\n• Clear and concise communication; comfortable with presenting insights and recommendations to senior stakeholders\n• Deep understanding of measurement concepts, solutions, and underlying statistical fundamentals leveraged in the ads efficacy and measurement ecosystem\n• Subject matter expertise in at least one of the following areas; conversion lift, brand lift, or econometrics modeling\n• Knowledge of applied statistics including sampling approaches, causal modeling, time series analysis, and data-mining techniques\n• Proficiency with advanced analytical tools (e.g. SQL, R, SAS)\n• Access, analyze, interpret, and communicate ads performance insights using a wide range of standard data science tooling\n• Understanding of the vertical needs and ability to creatively apply measurement solutions and insights in a way that improves advertiser performance and the value-proposition of Grab\n• A strong understanding of the digital advertising and measurement ecosystem", "extensions": ["4 days ago", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJNYW5hZ2VyIC0gQnJhbmQgTWVhc3VyZW1lbnQiLCJjb21wYW55X25hbWUiOiJHcmFiVGF4aSBQdGUgTHRkIiwiY29tcGFueV9taWQiOiIvbS8wMTM0Y19wOSIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6InZwSHAwX3BjMFFpZHJaMURBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2WUJDcmNCUVU1VlgwNXhWRzVWZERVeFZscGpjelZ5VEhaM1lWQlhaMjFPYW1GeVJ6ZElRalkwYVdObk1XVTBhRFpvVkVoR1ZqUmlUa1pPV0RsaE9VVTNSSE5wZEhCaWJFdGhjMlp4TVZaSldIUk1ZV1JyUVc5eWNFOHdWakpzYlZWcVQwWjRjVWRFVkdsNWRsUlFZMFZSVEdoRFpYQTFZM1pJTFVZemEyZFRTelo2U1ZOelRreDBTMDVVT0VvdFNYUnRXVFEyUkZZelRtNTFOa3BVU1VablIxQnpPRzVJVWpGWGVrNUxTemwyYW5VNFJXMUhSVEp6ZVV4dkVoWmlXRzFEV1U5MWJreHpXRmgwUVdKUGFuQmlORUZuR2lKQlQwMVpVbmRDWldZNVpTMTVkR0Z2ZDI0dFJXeGtiMHhKTUhOalUwaHBWMnhuIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNDMiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTW9uc3RlciBTaW5nYXBvcmUiLCJsaW5rIjoiaHR0cHM6Ly93d3cubW9uc3Rlci5jb20uc2cvYW1wL2pvYi12YWNhbmN5LW1hbmFnZXItYnJhbmQtbWVhc3VyZW1lbnQtZ3JhYnRheGktcHRlLWx0ZC1zaW5nYXBvcmUtMjc3NzU3OTEuaHRtbD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Fund Services Product Manager", "company_name": "Sciente Consulting Pte. Ltd", "location": "Singapore (+1 other)", "via": "via MNC Jobs Singapore | MNC Jobs In Singapore", "description": ":\n\nAa,aEURAn exciting opportunity for experienced Product Manager to be part of the Global Transaction Services (GTS) team with one ofthe leading banks of Singapore.\n\nMandatory Skill(s)\n\nBacheloraEUR(TM)s degree in business management, finance or related fields;\n\nMinimum4 years of experience in the financial services industry;\n\nMust have experience in product management;\n\nGood understanding of corporate online banking products preferably in Funds, Securities, Custody, Loans, Cash management andTrade Finance;\n\nAbility to understand and translate the business requirements to product specifications and performance improvement;\n\nStrong critical thinking and analytical skills required;\n\nAbility to work independently, manage stress and multi-task in a fast-paced environment.\n\nDesirable Skill(s)\n\nPMP certified;\n\nExperience in Banking Industry.\n\nResponsibilities\n\nRecognisegaps in the offered services and support the development of a clear product roadmap;\n\nIdentify new client opportunities... and develop client solutions;\n\nResponsible for the innovation of new products, development of market sizing and segment value propositions;\n\nKeeping close track on product performance and providing continuous support for improvisation;\n\nAct as aproduct specialist to the business regarding the scope of approved product suite;\n\nAccountable for client product satisfaction and product engagement;\n\nAssisting the team in defining product pricing, strategies, planning and issue prioritization to increase the usage of products by the customers;\n\nEnsure adequate product knowledge and training to sales, relationship management and operational teams;\n\nDrive direct marketing and campaigns to increase awareness, penetration and usage;\n\nStrong analytical skills required, including understanding and interpreting client business needs and translate them into business and functional requirements.\n\n: Aa,aEURAn exciting opportunity for experienced Product Manager to be part of the Global Transaction Services (GTS) team with one ofthe leading banks of Singapore.Mandatory Skill(s) * BacheloraEUR(TM)s degree in business management, finan", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJGdW5kIFNlcnZpY2VzIFByb2R1Y3QgTWFuYWdlciIsImNvbXBhbnlfbmFtZSI6IlNjaWVudGUgQ29uc3VsdGluZyBQdGUuIEx0ZCIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiVkViNlBDVno1QlBMaGdsY0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNTkMgSm9icyBTaW5nYXBvcmUgfCBNTkMgSm9icyBJbiBTaW5nYXBvcmUiLCJsaW5rIjoiaHR0cHM6Ly9zZy5tbmNqb2J6LmNvbS9qb2JzL2Z1bmQtc2VydmljZXMtcHJvZHVjdC1tYW5hZ2VyLXNpbmdhcG9yZS04OTkwMD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Product Manager, TikTok Growth", "company_name": "TikTok", "location": "Singapore", "via": "via Bayt.com", "description": "About TikTok\nTikTok is the leading destination for short-form mobile video. Our mission is to inspire creativity and bring joy. TikTok has global offices including Los Angeles, New York, London, Paris, Berlin, Dubai, Mumbai, Singapore, Jakarta, Seoul and Tokyo. Responsibilities: - Define and execute growth strategy with cross-functional teams to drive overall user growth of global products in the aimed country. - Improve key metrics with a specific focus on user lifetime, including user acquisition, user retention, and recalls. - Accelerate organic growth and ROI of business by optimizing product experience, establish a performance marketing strategy, and encouraging social referrals.\n- Strategic and logical thinker, with effective planning, analytical and problem-solving abilities.\n- Proven ability to lead a data-driven project. Capable of in-depth data interpretation and highly data-sensitive. a plus if can work with SQL. - Passionate about understanding user demand with different... cultural background and excellent communication skills to work cross-functionally in a globally collaborative environment. TikTok is committed to creating an inclusive space where employees are valued for their skills, experiences, and unique perspectives. Our platform connects people from across the globe and so does our workplace. At TikTok, our mission is to inspire creativity and bring joy. To achieve that goal, we are committed to celebrating our diverse voices and to creating an environment that reflects the many communities we reach. We believe individuals shouldn't be disadvantaged because of their background or identity, but instead should be considered based on their strengths and experience. We are passionate about this and hope you are too", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9kdWN0IE1hbmFnZXIsIFRpa1RvayBHcm93dGgiLCJjb21wYW55X25hbWUiOiJUaWtUb2siLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IkFIQXNZQWY5T1NCcURPbExBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQmF5dC5jb20iLCJsaW5rIjoiaHR0cHM6Ly93d3cuYmF5dC5jb20vZW4vc2luZ2Fwb3JlL2pvYnMvcHJvZHVjdC1tYW5hZ2VyLXRpa3Rvay1ncm93dGgtNTg5NTI5ODIvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Trade Product Manager (AVP), Global Trade Finance, Global Transaction Banking", "company_name": "OCBC Bank", "location": "Singapore", "via": "via Laimoon.com", "description": "Key Responsibilities\n• Perform end-to-end review of conventional trade products (Documentary Trade and Open Account) to establish product growth strategy\n• Enhance existing product features / processes for better efficiency and value proposition\n• Develop product commercialisation plan to increase the business performance\n• Work closely with sales and RMs to keep pulse of customers' evolving needs\n• Keep close to market development especially in the digital arena to evaluate the benefits to the bank\n• Work with network branches / subsidiaries to grow the regional business\n• LI-VN\n\nQualifications\nRequirements\n• 8 years experience in Trade Finance arena, especially Documentary Trade, with knowledge of product associated risks (eg. legal, compliance, credit, operation)\n• experience in Product Management role is highly preferred, with strong emphasis on new product development and product commercialisation\n• exposure to process improvement projects is an advantage\n• business orientated... enterprising and inquisitive in new way of doing things\n• strong interpersonal and communication skills to manage internal stakeholders\n• team player and willing to share knowledge\n• proficiency in Microsot Excel will be an advantage\nCorporate Banking", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJUcmFkZSBQcm9kdWN0IE1hbmFnZXIgKEFWUCksIEdsb2JhbCBUcmFkZSBGaW5hbmNlLCBHbG9iYWwgVHJhbnNhY3Rpb24gQmFua2luZyIsImNvbXBhbnlfbmFtZSI6Ik9DQkMgQmFuayIsImNvbXBhbnlfbWlkIjoiL20vMDU1cjI3IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoia0RyU09GUDgyRVdnci1QU0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFVUTnNjV1ZuY0V0WU0ydzJUMFIyTTA5dFJIQlpNMlkzU21SVllVaFFkWFIyT1hRNVozaFhaVkJPT0RaSGVXMTVXbWxSWlVGR1J6VnBTR3BJYzA1WlUzaEVPRGxOZGpkWmMxWlRNbTlmZG0xa1RHOWpaMGh6VGpBNWVHNHhVbXhuTlZFMFdGOXBjM3BEUVZacFRtZHpTVkZNU1ZCNVgxVkJlVWRGUmtkUmExcGZlVUZYUW1samEzaExaSEkwYlU5Mk9XbHFibFJKUjNsbE0wVlJFaFppV0cxRFdVOTFia3h6V0ZoMFFXSlBhbkJpTkVGbkdpSkJUMDFaVW5kRWVtdHNTM1JZUWtOalFWRjVTRXc1T1hVM2RubDFhMUV6U1RsMyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzU5IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExhaW1vb24uY29tIiwibGluayI6Imh0dHBzOi8vam9icy5sYWltb29uLmNvbS9qb2JzL2V4dGVybmFsdmlldy8yNTk4NTg1NT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Management", "value": "GC18"}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Business Operations", "value": "GC06"}, {"text": "Advertising and Marketing", "value": "GC03"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Accounting and Finance", "value": "GC01"}, {"text": "Legal", "value": "GC17"}, {"text": "Farming and Outdoors", "value": "GC13"}, {"text": "Human Resources", "value": "GC15"}, {"text": "Sales and Retail", "value": "GC26"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "Product manager", "value": "product manager"}, {"text": "Manager", "value": "manager"}, {"text": "Project manager", "value": "project manager"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Development manager", "value": "development manager"}, {"text": "Director", "value": "director"}, {"text": "Manufacturing manager", "value": "manufacturing manager"}, {"text": "Marketing manager", "value": "marketing manager"}, {"text": "Plant manager", "value": "plant manager"}, {"text": "Production manager", "value": "production manager"}, {"text": "Program manager", "value": "program manager"}, {"text": "Regional", "value": "regional"}, {"text": "Senior", "value": "senior"}, {"text": "Sr. manager", "value": "sr. manager"}, {"text": "Account manager", "value": "account manager"}, {"text": "Admin manager", "value": "admin manager"}, {"text": "Affairs manager", "value": "affairs manager"}, {"text": "Assistant", "value": "assistant"}, {"text": "Brand manager", "value": "brand manager"}, {"text": "Commodity manager", "value": "commodity manager"}, {"text": "Communication", "value": "communication"}, {"text": "Customer", "value": "customer"}, {"text": "Dealer", "value": "dealer"}, {"text": "Devops engineer", "value": "devops engineer"}, {"text": "Engineering", "value": "engineering"}, {"text": "Executive", "value": "executive"}, {"text": "Product specialist", "value": "product specialist"}, {"text": "Production supervisor", "value": "production supervisor"}, {"text": "Risk manager", "value": "risk manager"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Transactional", "value": "transactional"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Internship", "value": "INTERN"}, {"text": "Part-time", "value": "PARTTIME"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Toiletries", "value": "/business/naics2007/3256"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Foods & Beverages", "value": "/business/naics2007/311"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Management", "value": "/business/naics2007/55"}, {"text": "Research", "value": "/business/naics2007/5417"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "Citi", "value": "/m/01dfb6"}, {"text": "Binance", "value": "/g/11hcz1r4wl"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "Amazon", "value": "/m/0mgkg"}, {"text": "Standard Chartered", "value": "/m/02hszk"}, {"text": "United Overseas Bank", "value": "/m/04gjd1"}, {"text": "Apple", "value": "/m/0k8z"}, {"text": "Tata Communications", "value": "/m/04338k"}, {"text": "Workato", "value": "/g/11dxpy_3xd"}, {"text": "BNY  Mellon", "value": "/m/02vps5x"}, {"text": "DBS Bank", "value": "/m/01q7n5"}, {"text": "EPAM Systems", "value": "/m/0dlnrc"}, {"text": "GVT Government Technology Agency (GovTech)", "value": "/g/11gh0528nq"}, {"text": "Grab", "value": "/m/0134c_p9"}, {"text": "Paypal", "value": "/g/122s91_5"}, {"text": "PeopleSearch Pte Ltd", "value": "/g/11c73ngn0w"}, {"text": "Randstad", "value": "/m/08pt1z"}, {"text": "Singapore Airlines", "value": "/m/015f2x"}, {"text": "TEKsystems (Allegis Group Singapore Pte Ltd)", "value": "/g/11b6g4bkv0"}, {"text": "ABBOTT LABORATORIES (SINGAPORE ) PRIVATE LIMITED", "value": "/m/09m57z3"}, {"text": "ADVANCE INTELLIGENCE PTE. LTD.", "value": "/g/11dymfkxss"}, {"text": "AXA", "value": "/m/04mn99"}, {"text": "Adecco Personnel Pte Ltd", "value": "/m/08gz46"}, {"text": "Adidas Group", "value": "/m/01jtml"}, {"text": "Aetna, a CVS Health Company", "value": "/m/0kg8x"}, {"text": "Agency for Science, Technology and Research", "value": "/m/0gmjcg"}, {"text": "Alibaba", "value": "/m/07s6ctl"}, {"text": "Argyll Scott", "value": "/g/11dxpk2374"}, {"text": "Autodesk", "value": "/m/018nm3"}, {"text": "Barry Callebaut", "value": "/m/03clky2"}, {"text": "BioMind", "value": "/g/11dymfr2l6"}, {"text": "CHUBB ASIA PACIFIC PTE. LTD.", "value": "/m/09m8xyh"}, {"text": "Cargobase", "value": "/g/11dxppfsjn"}, {"text": "Cargobase Pte Ltd", "value": "/g/11fy240nxm"}, {"text": "DKSH", "value": "/m/0dj2nh"}, {"text": "Dathena", "value": "/g/11dxprdn6y"}, {"text": "Dyson", "value": "/m/05cskg"}, {"text": "Enggsol Pte Ltd", "value": "/g/11g9mnfmm1"}, {"text": "Ethos BeathChapman", "value": "/g/11c73z0xm0"}, {"text": "Eu Yan Sang", "value": "/m/03cl9hn"}, {"text": "Flintex Consulting Pte. Ltd.", "value": "/g/11h1z41pzb"}, {"text": "GIVAUDAN SINGAPORE PTE LTD", "value": "/g/11f00wn519"}, {"text": "Goldman Sachs", "value": "/m/01xdn1"}, {"text": "GovTech Singapore", "value": "/g/11dxpkfs_6"}]}]}