{"search_metadata": {"id": "60827a13f26ac63fe75790c6", "status": "Success", "json_endpoint": "https://serpapi.com/searches/11d0efbba6306537/60827a13f26ac63fe75790c6.json", "created_at": "2021-04-23 07:41:07 UTC", "processed_at": "2021-04-23 07:41:07 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28system+analyst%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=100", "raw_html_file": "https://serpapi.com/searches/11d0efbba6306537/60827a13f26ac63fe75790c6.html", "total_time_taken": 5.76}, "search_parameters": {"q": "(system analyst) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "100"}, "jobs_results": [{"title": "System Analyst (HRMS)", "company_name": "Sciente International Pte Ltd", "location": "Singapore (+1 other)", "via": "via Monster", "description": "Mandatory Skill-set\n• Degree in Computer Science, Information Technology or Information Systems;\n• At least 3 years of experience in at least one of the following ( SAP / Oracle / Peoplesoft ) Human Resources Management Systems;\n• Good understanding of Human Resource policy, process, guidelines and practices;\n• Exposure in User Experience ( UX ) requirement gathering and best practices;\n• Critical thinking ability, strong analytical skills and strong problem-solving capacity;\n• Ability to work independently and communicate effectively;\n• Keen to learn and take up new challenges;\n• Ability to work under pressure and tight deadlines;\n• Excellent stakeholder and vendor management.\n\nDesired Skill-set\n\nExperience in Cloud Solution implementation.\n\nResponsibilities\n• Responsible for driving the transformation and integration of Human Capital Management (HCM) systems and manage the transition;\n• Gather the core requirements of the users and design systems solutions;\n• Responsible for the... user experience of all the stakeholders and translation into systems solution;\n• Actively and professionally engage different stakeholders in streamlining processes and increase the efficiency;\n• Work with technology teams to design and develop as per the requirements;\n• Propose new solutions/directions to improve the effectiveness and efficient implementation.\nShould you be interested in this career opportunity, please send in your updated resume to apply@sciente.com at the earliest.\n\nWhen you apply, you voluntarily consent to the disclosure, collection and use of your personal data for employment/recruitment and related purposes in accordance with the SCIENTE Group Privacy Policy, a copy of which is published at SCIENTEs website (https://www.sciente.com/privacy-policy).\n\nConfidentiality is assured, and only shortlisted candidates will be notified for interviews.\n\nEA Licence No. 07C5639", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTeXN0ZW0gQW5hbHlzdCAoSFJNUykiLCJjb21wYW55X25hbWUiOiJTY2llbnRlIEludGVybmF0aW9uYWwgUHRlIEx0ZCIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiY1dtTGdmWHFwMElSa3dSU0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNb25zdGVyIiwibGluayI6Imh0dHBzOi8vd3d3Lm1vbnN0ZXIuY29tLnNnL2pvYi12YWNhbmN5LXN5c3RlbS1hbmFseXN0LWhybXMtc2NpZW50ZS1pbnRlcm5hdGlvbmFsLXB0ZS1sdGQtc2luZ2Fwb3JlLTMtOC15ZWFycy0yNjA5NjczMS5odG1sP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Technology Assistant Support Engineer Middleware Admin Data Center Operator Project Manager System Analyst,network Engineer,noc Engineer,", "company_name": "ITCAN Pte Limited", "location": "Singapore", "via": "via MNC Jobs Singapore | MNC Jobs In Singapore", "description": "Position 1:\nJob Title : Technology Assistant- Multiple positions\n\nPosition Type : Permanent with ITCan\n\nQualification : Diploma in IT or equivalent\n\nWorking Hours : Normal working hours\n\nWork Location : Island Wide\n\nBudget Range : 1800-2300 SGD\n\naEURAssistance in Installation, Configuration, and upgrading of Windows desktop operating systems.\n\naEURPerforming in first level of trouble shooting for problems related to computer hardware/software application systems in Schools advice and assistance to users on the usage of simple functional features of software and hardware peripherals.\n\naEURperform basic administrative support, asset management and routine IT Housekeeping services\n\naEURIT front desk, helping students and user in their computer issue like Wi-Fi issue, password issue, outlook issue.\n\naEURUsing active directory to lock/unlock/change password for user account\n\nPosition 2:\nJob Title : Support Engineer- Multiple positions\n\nPosition Type : Permanent with ITCan\n\nQualification ... Diploma in IT or equivalent\n\nWorking Hours : Normal working hours(Sometimes required to work on shifts)\n\nWork Location : Changi\n\nBudget Range : 5000- 5500 SGD\n\naEURAt least 5 years of experience with enterprise scale Linux and Windows administration\n\naEURFamiliar with PostgreSQL, MySQL, Oracle, and other database servers\n\naEURHands-On experience of VMware ESXi and vCenter administration (6.0 and above)\n\naEUR5 years of experience in an advanced technical support/systems administration role/vendor environment\n\naEURGood experience in monitoring systems (Centreon, Nagvis)\n\naEURFamiliarity with SAN storage, NetApp storage and tape library will be added advantage\n\naEURKnowledge in installation, configuration and administration of Network devices (e.g. Cisco Switch, Firewall, Router) will be added advantage\n\naEURScripting: Windows PowerShell, Unix Scripting will be added advantage\n\nPosition 3:\nJob Title : Application Support(Middleware Admin)- Multiple positions\n\nPosition Type : Permanent with ITCan\n\nQualification : Diploma in IT or equivalent\n\nWork Location : Newton Road\n\nWorking Hours : Normal working hours\n\nBudget Range : 5000- 5500 SGD\n\naEURAtleast 4 years of experience in middleware admin\n\naEURGood experience in weblogic and websphere\n\nThe Middleware Administrator is responsible for deplying and supporting middleware applications using JBOSS, IBM WebSphere MQ and IBM's middleware / transformation products.\n\naEURWork individually or in a team on various system projects related to UNIX, Linux, Windows and Application support\n\nPosition 4:\nJob Title : Data center operator- Multiple positions\n\nPosition Type : Permanent with ITCan\n\nQualification : Diploma in IT or equivalent\n\nWork Location : Island wide\n\nWorking Hours : 12 hours Rotation shift\n\nBudget Range : 3500 SGD\n\naEURAtleast 5 years of IT experience\n\naEURResponsible for the shift in the day-to-day smooth execution and continuous operations and ensure that standards and procedures are strictly adhered to such as:\n\naEUREnsure tasks in Ops daily checklist are being carried out in a timely manner\n\naEURCoordinate Data Centre incidents, maintenance and shutdowns\n\naEUR3 years of data center\n\naEURITIL V3 Foundation certificate\n\naEURCoordinate incident management\n\naEURAccountable for any emergency and logon id accounts, issue or use it according to instruction and procedure given and record its usage during the shift\n\naEURControl of keys kept with operations and record its usage\n\naEURAccountable for all physical security access cards available in the Data Centre\n\naEURResponsible for equipment movement in Data Centre\n\naEURCoordinate preventive maintenance for hardware equipment with vendors, where applicable\n\naEUREnsure physical environment in the Data Centre is in normal function (e.g.. UPS, temperature control, humidity, etc.)\n\naEURAccount for the inventory of hardware equipment and manage external vendors providing the support\n\naEURManage the roster in the shift\n\naEUREnsure incidents are responded and attended to, else redirect for 2nd/3rd level resolution base on criticality, impact and SLA.\n\naEURMonitor and ensure timely completion of scheduled batch jobs at end of day\n\naEURManage and mitigate escalations of high impact system failures and assist in tracking the incidents\n\naEURLead and oversee a team, maintain discipline and is responsible for team members within the shift\n\naEURAny other operational related duties as assigned\n\nPosition 5:\nJob Title : Project Management- Multiple positions\n\nPosition Type : Permanent with ITCan\n\nQualification : Diploma in IT or equivalent\n\nWork Location : Changi Business Park or City Area\n\nWorking Hours : Normal working hours\n\nBudget Range : 7500 SGD- 8000 SGD\n\naEURExperience of project management in Financial sector. If possible, with experience and knowledge in insurance sector.\n\naEURExperience of project management in the whole project process.\n\naEURExperience of project management in the multi-parties involved.\n\naEURSkill & knowledge for project management materials/documents creation.\n\naEURProactive approach and action skill & mindset for project handling\n\naEURMake a deep relationship with our customer\n\naEURExcellent documentation skill\n\naEURTo be familiar with MS Office (Word, Excel, PowerPoint) as tools.\n\naEURTo be familiar with MS Teams as tools.\n\naEURTo be familiar with MS SharePoint as tools.\n\naEURTo find the scents of project risks and rectify or handle them on the track\n\naEURExperience in SAP project\n\nPosition 6:\nJob Title : System Analyst- Multiple positions\n\nPosition Type : Permanent with ITCan\n\nQualification : Diploma in IT or equivalent\n\nWork Location : City area\n\nWorking Hours : Normal working hours\n\nBudget Range : 7500 SGD- 8000 SGD\n\naEURMore than 5years experience in IT\n\naEURGeneral knowledge of Banking Business (Remittance, Deposits and common functions preferred)\n\naEURUnderstanding on Data (Data Relation, Database System)\n\naEURExperience working in ETL or any banking SDLC waterfall project\n\naEURCore banking experience must\n\nPosition 7:\nJob Title : Network Engineer- Multiple positions\n\nPosition Type : Permanent with ITCan\n\nQualification : Diploma in IT or equivalent\n\nWork Location : Pasir Panjang\n\nWorking Hours : Normal working hours\n\nBudget Range : 5000 SGD- 5500 SGD\n\naEURThe Network Engineers shall minimally\n\naEURHave at least three (3) years hands-on practical experience in operating enterprise routers/switches, firewalls, load balancers, domain name servers (DNS), bandwidth management system, and server/platform system\n\naEURBe at least a Certified Network Administrator - Cisco Certified Network Associate (CCNA) or equivalent\n\naEURPreferably possess relevant SDN product professional certification accorded by the product principal for recognition of attaining the knowledge and skills required to implement the proposed SDN products\n\naEURHave good knowledge of SDN programmatic methodologies, tools and scripting to support the integration of SDN with the existing network, provisioning of new application profiles with policy-based control, maintaining and updating the application profiles and troubleshooting\n\naEURHave the ability to conduct network diagnosis and troubleshooting\n\naEURBe IPv6 trained and have relevant hands-on experience\n\naEURHave good working knowledge of security governance, security operations and security technologies such as system hardening, IDS/IPS, firewall, monitoring, and incident management\n\nPosition 8:\nJob Title : NOC Engineer- Multiple positions\n\nPosition Type : Permanent with ITCan\n\nQualification : Diploma in IT or equivalent\n\nWork Location : Pasir Panjang\n\nWorking Hours : 12 hours rotational shift\n\nBudget Range : 3000 SGD- 3500 SGD\n\naEURHave at least three (3) years hands-on practical experience in operating enterprise routers/switches, firewalls, load balancers, domain name servers (DNS), bandwidth management system, and server/platform system\n\naEURBe at least a Certified Network Administrator - Cisco Certified Network Associate (CCNA) or equivalent\n\naEURPreferably possess hands-on experience with Enterprise WAN Routing\n\naEURHave the ability to conduct network diagnosis and troubleshooting\n\naEURBe IPv6 trained and have relevant hands-on experience\n\naEURHave good working knowledge of security governance, security operations and security technologies such as system hardening, IDS/IPS, firewall, monitoring, and incident managementaEUR(TM)\n\nNote:\n\nAll positions are based at Singapore with IT & Banking MNCs.\n\nAll positions are permanent with benefits as per MOM guidelines\n\nIf any one interested please share your cv to Pradeep@itcan.biz\n\nPlease share if you have any references\n\nPlease advise if you have any sample documents.\n\nWe have Multiple positions open,Technology Assistant ,Support Engineer ,Middleware Admin, Data Center Operator Project Manager, System Analyst, Network Engineer,NOC engineer", "extensions": ["10 days ago", "Full–time"], "detected_extensions": {"posted_at": "10 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJUZWNobm9sb2d5IEFzc2lzdGFudCBTdXBwb3J0IEVuZ2luZWVyIE1pZGRsZXdhcmUgQWRtaW4gRGF0YSBDZW50ZXIgT3BlcmF0b3IgUHJvamVjdCBNYW5hZ2VyIFN5c3RlbSBBbmFseXN0LG5ldHdvcmsgRW5naW5lZXIsbm9jIEVuZ2luZWVyLCIsImNvbXBhbnlfbmFtZSI6IklUQ0FOIFB0ZSBMaW1pdGVkIiwiY29tcGFueV9taWQiOiIvZy8xMWR4cHN0ejl0IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiZVdYaW9CWkR2TFZhN0Q2bUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZZQkNyY0JRVTVWWDA1eFUyOUZYM1YxWlZKdFJXbENVMDkxYVVoUVFsQklhRTFUT1RsNk1GQkJNMTl1U1d4SExVeDZMVFYyVTBGd1pGUmthbE01VFY5dlFtVndaREJYTVVGRE9FNW9hVlpYTUc0MVNIZFZVSEJuUTNOYVFYZHdNR3RWWW1oRU9VZFhOSEZzTVVaVlVWTnlUVTFXTld4NmFIcHpUVVpxTm05c2VHVXhaMjVMV2xaQ1pqRmllblEyYzBkWVVHUXdSVmhmWm01TWVVSTBZa3N0YzNrek5sUjRMV1owVm5GNmVFOVNPR3gyTURCTGRqazROak13RWhaSFNIRkRXVWxYY2swNVN6UjBVV0ZxWnpWVGIwUkJHaUpCVDAxWlVuZENPREZyYzJOUFh6RXdTR1UxU0Uxd1draGtjazFQV2xKS1JFeDMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18xMCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNTkMgSm9icyBTaW5nYXBvcmUgfCBNTkMgSm9icyBJbiBTaW5nYXBvcmUiLCJsaW5rIjoiaHR0cHM6Ly9zZy5tbmNqb2J6LmNvbS9qb2JzL3RlY2hub2xvZ3ktYXNzaXN0YW50LXN1cHBvcnQtZW5naW5lZXItbWlkZGxld2FyZS1hZG1pbi1kYXRhLWNlbnRlci1vcGVyYXRvci1wcm9qZWN0LW1hbmFnZXItc3lzdGVtLWFuYWx5c3RuZXR3b3JrLWVuZ2luZWVybm9jLWVuZ2luZWVyLXNpbmdhcG9yZS0xMTY2NzU/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Project Manager / Business Analyst (BB-E8B2B)", "company_name": "Mantu", "location": "Singapore", "via": "via BeBee", "description": "The Project Manager is in charge of project success. His/her responsibilities are: To handle a highly functional project.The project manager is required to perform a dual role as a Project Manager cum Business Analyst in order to be effective.He/she needs to understand the concepts of structured products/derivatives and delta 1 products. In addition, his/her responsibilities are: Facilitate committees and work closely with the project team to deliver the project deliverables, prioritization, estimations and planningCreates partnership with product owners, stakeholders and transversal teams (security, solution architects, compliance...) and the Third Party Vendor that delivers solution to the systemEnsure the team’s adherence to delivery schedule and estimatesContributes & ensures compliance to the governance, Secure SDLC frameworksProvide regular update and reporting to his/her Division Managers (Domain Heads if required)Understand the impediments/blockers faced by the team and help... the team to remove as much as possibleManage the release planning and management of the deliveries and update necessary tools requiredAble to multi-task and work on multiple projects if required As a Business Analyst as secondary role, his/her responsibilities are: To handle other Regulatory topics if required like: AEOI/CRS, FATCA, SRD II, IRS871mGather the requirements from the Product Owner and end usersWrites GFS (or user stories) and confirm the understanding with the developers.Perform system analysis with the BA of other applications squads/teams when involved in multi-systems features and interfaces.Work with developers on system development and unit testing.Work with the testing team to conduct system integration testing to ensure quality of delivery.Support UAT (reproduce issues, monitoring, fixing with the team) About youSkills & Experience Bachelor’s Degree or equivalent experience requiredExperience in working with large distributed IT teamsAt least 5+ years of experience/exposure application development with Java technologies / Reporting systems Mandatory Exposure to applications handling Fiscal or Regulatory ReportingBanking knowledge related to Wealth ManagementHighly analytical, able to investigate, troubleshoot and determine issues at root causeExcellent communication skills, able to engage with end users and stakeholdersGood understanding of project lifecycle and experience in functional/technical specificationGreat listener, empathetic and with a ‘can-do’ attitude and interpersonal skillsExcellent written and oral communication skills Plus JIRA usage, Confluence, Release Management ToolsPrevious experience with Scrum or Agile methodology, SDLC, WaterfallExposure to applications revolving around: AAA, Olympic, Client Management Systems, Datawarehouse, Batch processing of reportsScrum Master Certification or PMP (or equivalent", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIgLyBCdXNpbmVzcyBBbmFseXN0IChCQi1FOEIyQikiLCJjb21wYW55X25hbWUiOiJNYW50dSIsImNvbXBhbnlfbWlkIjoiL20vMGI2bXhrYyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjZ5RVZKRWVtZzlNR0N0Ty1BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVzc0JDb3dCUVU1VlgwNXhWRE5aVWs1Tk5sbEhjMlpGWTFSc2MyTmxUVVZ0WkdwV1RHWXpPVFp6VXpKMk4yMWxaMGhKYWpWSFpGQkVPVGcyUzNCbE1FdEtaR2hyYzJGTVUwcHJTVmd0WW5Gd1JXZDNlVGhuWjFOS2VrUnhjMWh3VGtwQ0xYZExTMEpVWkZOTGQzVjFaVFp4TTJzdFJYazBOWFJmTVZWWlVqRnZkRlpvZUY5cFZHbzJhMmRTT0hOa2FGSVNGa2RJY1VOWlNWZHlUVGxMTkhSUllXcG5OVk52UkVFYUlrRlBUVmxTZDBFMk5UY3Raa3AzV2xBM1dFMXlhRXRIU21oeVVWTktSbEJGUzJjIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMTciLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQmVCZWUiLCJsaW5rIjoiaHR0cHM6Ly9zZy5iZWJlZS5jb20vam9iLzIwMjEwNDE3LTE0ZWE4YTZmYTgzNmQyYmVlMzFkNTVhZDQwOGU4YjJiP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Business Systems Analyst (Netsuite Administrator) - Singapore", "company_name": "Workato", "location": "Singapore", "via": "via LinkedIn", "description": "We are looking for an exceptional Business System Analyst (Netsuite Administrator) to join our growing team. In this role, you will work closely with lines-of-business teams to review/develop sound business processes and identify automation opportunities in these processes. Being the vital link between IT and business function, you will empower teams to respond quicker to changing business needs. For a glimpse into what a Business System Analyst (Integration & Automation) does in Workato, refer to our , which includes projects and processes that our team has accomplished internally over the past year.\nWorkato has a positive, diverse, and collaborative culture—we look for people who are curious, inventive, smart, hardworking and work to be a little better every day. Workato has also been recognized amongst the “Top 47 Enterprise Startups to Bet Your Career On in 2020” and the “Hottest 13 Productivity Software Startups to Watch in 2020!” by Business Insider.\n\nResponsibilities\n•... Implement, administer and manage Netsuite together with other functional units and act as the subject matter expert for all Netsuite related projects.\n• Assess and procure applications for internal use; build new connections to those applications through APIs\n• Manage and implement projects that coordinate and integrate the flow of critical business data through multiple functional areas and applications\n• Build, test and deploy robust internal applications, tools, bots, and real-time integrations that support Workato's strategic business goal\n• Document processes, applications and integrations used; educate users on the best practices of these processes\n• Develop comprehensive management reporting capabilities by using data from multiple sources and visualising to gather insights on these data\n• Assist in IT audit review to ensure that business processes are aligned across teams\n\nRequirements\n\nQualifications and Experience\n• Netsuite Certified Administrator is a Must.\n• Degree from a cross-functional background such as Business IT, Information Systems Management or other similar disciplines\n• 2 -3 years of relevant Business Systems experience. Fresh graduates with relevant internship experience are welcome to apply\n\nSkills\n• Ability to translate business requirements into technical specifications\n• Excellent written and oral communication skills in English\n• Good understanding of integration concepts, methodologies, and technologies\n• Comfortable with interpreting API documentation of cloud-based applications, know basic programming logic and SQL\n• Deep understanding of/experience in Salesforce platform(s) (e.g. Salesforce Sales Cloud, Salesforce Marketing Cloud) as you will be involved in the design and delivery of Salesforce implementations\n• Understanding of SaaS tools (e.g. Marketo, Greenhouse, Freshdesk, Netsuite) is a plus", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJCdXNpbmVzcyBTeXN0ZW1zIEFuYWx5c3QgKE5ldHN1aXRlIEFkbWluaXN0cmF0b3IpIC0gU2luZ2Fwb3JlIiwiY29tcGFueV9uYW1lIjoiV29ya2F0byIsImNvbXBhbnlfbWlkIjoiL2cvMTFkeHB5XzN4ZCIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjlPNnZwX292bTItNWpYOWZBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhVMEZKUXpkRlZUQkNhREpuYmtwcWNUWlpkMnhTZEdjelFqSTNjbmQxYldKMU0zY3lSR2N4VkdGSFZEaE9WQzF1WnkxNmJrWnNUa0pCTVdvMFlVNHdaMGRzUkdwTE9Ea3hRamRYYldSSFFWVnFiMjlrTlRWUVFqQnpTemR2TkZwdlRYTnNiSFp3YXpaelFsbFJXVlZtZWpGRFFrUnBkMlIwT1hsUWNYSmtaMUJQTkZWek9XRnJSbGMyWkZrd1pXOVZSSGhFU1ZKSGVqUk5SVXQzRWhaSFNIRkRXVWxYY2swNVN6UjBVV0ZxWnpWVGIwUkJHaUpCVDAxWlVuZEJPVXhWT0dkc05IUlRRVU5WWWpkbVJGUlhOMjlrUW5SeVpXRlIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18yNSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL3NnLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvYnVzaW5lc3Mtc3lzdGVtcy1hbmFseXN0LW5ldHN1aXRlLWFkbWluaXN0cmF0b3Itc2luZ2Fwb3JlLWF0LXdvcmthdG8tMjQ5MTg0NDAzNj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "IT Business Analyst", "company_name": "Sciente Consulting Pte. Ltd.", "location": "Singapore (+1 other)", "via": "via Jobs | Fidanto", "description": "Our client is seeking for an experience IT Business Analyst to work on regional system integration & consolidation projects.Mandatory Skill-set\nDegree in Computer Science, Engineering, Information Systems;\nHas at least 4 years of Information Technology (IT) Business Analyst experience;\nHas experience supporting the entire SDLC;\nHas experience working on system integration projects;\nGood understanding of business needs experience working on large scale project implementation;\nStrong experience in requirements gathering, impact analysis, functional testing and documentation;\nHas strong analytical, problem-solving skills and attention to detail;\nThrives in ambiguity and able to work independently without much guidance;\nStrong communication, presentation, and technical writing skills.\nDesired Skill-set\nCertified Scrum Master / Product Owner.\nResponsibilities\nResponsible for understanding the business processes and evaluate the viability and feasibility of implementing them;\nPlan and... coordinate development and testing activities among various stakeholders / teams;\nInvolve in system integration projects by providing techno-functional support;\nDevelop and document clear and detailed process maps, business requirements and workflows;\nFacilitate works across various internal and external stakeholders to ensure minimal impacts during integration and data migration work;\nSupport the respective workstreams team in monitoring and reporting of project progress, issues and risks to ensure deliverables are on track;\nMake sure that the system is built efficiently in terms of maintainability, reliability and availability;\nEnsure necessary changes / enhancements are implemented and documented as per corporate standards and guidelines. Should you be interested in this career opportunity, please send in your updated resume to apply@sciente.com at the earliest.\nWhen you apply, you voluntarily consent to the disclosure, collection and use of your personal data for employment/recruitment and related purposes in accordance with the SCIENTE Group Privacy Policy, a copy of which is published at SCIENTE's website (https://www.sciente.com/privacy-policy).\nConfidentiality is assured, and only shortlisted candidates will be notified for interviews.\nEA License: 07C5639", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJJVCBCdXNpbmVzcyBBbmFseXN0IiwiY29tcGFueV9uYW1lIjoiU2NpZW50ZSBDb25zdWx0aW5nIFB0ZS4gTHRkLiIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiN3ZHemZ5Wnl6Nmx6TGpkV0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIHwgRmlkYW50byIsImxpbmsiOiJodHRwczovL3NnLmZpZGFudG8uY29tL2pvYnMvam9iLW9wZW5pbmcvY29tcHV0ZXItYW5kLWluZm9ybWF0aW9uLXN5c3RlbXMtbWFuYWdlcnMvaXQtYnVzaW5lc3MtYW5hbHlzdC1jZW50cmFsLXNpbmdhcG9yZS0yNzU0NDM3NjE/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "First VP - VP - Senior System Analyst - Trade Transformation", "company_name": "United Overseas Bank Limited", "location": "Singapore", "via": "via Monster", "description": "Job Responsibilities\n• As part of the Trade Transformation delivery team, the position will be responsible for the delivery of Global Trade and FSCM Technology platform, managing the quality of functional delivery and ensuring the implementation of agreed functional capability\n• Contribute to building expertise by mentoring, guiding and training as appropriate\n• Functional lead for the roll-out of multi-country programs working closely with Intellect Delivery team and internal stakeholders across implementation, technology, FSCM on boarding teams.\n• Working closely with stakeholders to develop practical domain roadmaps to move the enterprise towards the future state vision, while taking into account business, technical and delivery constraints\n• Analyzing stakeholder requirements, current state architecture, and gaps to create a future state architecture vision for one or more parts of the enterprise with a focus on reduced complexity, cost efficiencies, reuse, reduced risk and/or... improved business capabilities\n• Reviewing problem ticket and incident to propose short term and long term resolution to fit with the domain roadmap\n• Guiding and challenge the project on functional architecture, design decision and performance testing\n• Reviewing non-functional requirement and proposed architecture changes to anticipate evolving non-functional requirements\n• Communicating the principles, standards, vision and roadmaps to stakeholders and proactively addressing any questions / concerns identified\n• Acting as a trusted advisor to stakeholders in both business and IT to assist in defining and delivering high quality solutions\n• Provide thought leadership on functional architectural or other topics\n• Embed Platform Thinking in everything\nJob Requirements\n• Bachelor's degree in computer science, engineering or similar domain\n• Related professional/technical qualification will be advantageous although not mandatory\n• Good understanding of Intellect Trade, FSCM platform and experience in implementing the same in Banking Environment.\n• At least 15 years’ experience in the IT industry, preferably in large, complex enterprises\n• At least 8 years of experience in banking technology\n• Deep experience delivering mission critical, enterprise scale IT solutions in a heterogeneous technology environment, both in-house built and 3rd party vendor products\n• Experience in analysis, preparing functional specifications using modelling technics (e.g. UML, ERD, ORM, OCL) and testing experience\n• Familiarity with best practice methodologies and tools for the entire solution lifecycle from ideation to requirements, design, development, testing, deployment and operations\n• Familiarity with one or more formal Architecture frameworks / methodologies (TOGAF, Zachman, BIAN, etc.)\nFunctional Expertise Required in following domains:\n• Financial Supply Chain / Open Account\n• Trade Finance\n• Payments\nCompetencies\n• Ability to communicate complex topics in an understandable way using a level of detail and terms appropriate to the situation\n• Must be a good team player and able to drive consensus amongst stakeholders with conflicting viewpoints and objectives\n• People and team management in a transversal function\n• Ability to effectively communicate, interact with and influence senior technical associates, business and operational partners and executives\n• Work effectively within a fast-paced, cohesive architecture team and willing to learn fast and adapt quickly to change\n• Possess strong understanding of business strategies and able to translate them into concrete achievable action plans\n• Able to collaborate and drive motivation across a diverse slate within and across teams and can deal with difficult conversations effectively\n• Owns and enhances workflows and processes, and delegates with clear accountabilities across the teams to meet objectives / outcomes\n• Promotes an environment of learning and development. Understand and develop team members and others to achieve their professional growth\nBe a part of UOB Family\nUOB is an equal opportunity employer. UOB does not discriminate on the basis of a candidate's age, race, gender, color, religion, sexual orientation, physical or mental disability, or other non-merit factors. All employment decisions at UOB are based on business needs, job requirements and qualifications. If you require any assistance or accommodations to be made for the recruitment process, please inform us when you submit your online application.\nApply now and make a difference", "extensions": ["5 days ago", "Full–time"], "detected_extensions": {"posted_at": "5 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJGaXJzdCBWUCAtIFZQIC0gU2VuaW9yIFN5c3RlbSBBbmFseXN0IC0gVHJhZGUgVHJhbnNmb3JtYXRpb24iLCJjb21wYW55X25hbWUiOiJVbml0ZWQgT3ZlcnNlYXMgQmFuayBMaW1pdGVkIiwiY29tcGFueV9taWQiOiIvbS8wNGdqZDEiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJkVEtsUWhqTlVPTWJabzkxQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFb3NDQ3N3QlFVNVZYMDV4VTNOV09XeERTMEo0WW5SMFRURnNha1l3TkdSd1gwbHhabVJIWmpKUmRrVmhkRXBOWlhsWFRGcDFTRlZ4YURReE4yeGtOR0pEWkRCS2J6RjVXbGhwU2pWM2JtNTJZbXBZYVZSMkxVTkxWRWRyWm1kSE1FRnJiVzUzWDE5b1VFWnFMVUZoUVVOaWRGSjFTV2RHT1RKSWRGbFVRbWx3UW10V1ZqZzNZV3QyYTFKR1NHTm1WMTl2ZFRCa2VXWnlNMEpDY204ekxYaGhVSE5zTTIxa0xYTXdSelJOU0RSVFNXd3lRekJPU1dWWGN6YzRjWGMyTTNKeFlWRnZWbVJ6VG5Kb1pETnVPSFZQRWhaSFNIRkRXVWxYY2swNVN6UjBVV0ZxWnpWVGIwUkJHaUpCVDAxWlVuZEVZbkJKZDFsS1NrbG9kWEUwUmtoYU1EbFdNVE56VTFSaGFXSm4iLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18zNiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNb25zdGVyIiwibGluayI6Imh0dHBzOi8vd3d3Lm1vbnN0ZXIuY29tLnNnL2FtcC9qb2ItdmFjYW5jeS1maXJzdC12cC12cC1zZW5pb3Itc3lzdGVtLWFuYWx5c3QtdHJhZGUtdHJhbnNmb3JtYXRpb24tdW5pdGVkLW92ZXJzZWFzLWJhbmstbGltaXRlZC1zaW5nYXBvcmUtMjY5NTc1OTcuaHRtbD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Application Support Manager", "company_name": "Ecquaria Technologies Pte Ltd", "location": "Singapore (+1 other)", "via": "via Glassdoor", "description": "Responsibilities\n• Provide Application Support to ensure that the application is properly maintained and fixed.\n• Lead a team of Software Engineers to provide production support and day-to-day operations of the system.\n• Provide efficient and effective solutions to client’s queries on usage as well as bug fixes.\n• Make technical assessment of change requests.\n\nPre-requisites\n• Computer Science background or equivalent.\n• At least 3 years’ experience in project management and 5 years’ experience in IT with good problem analysis techniques.\n• Strong written and communication skills.\n• Strong inter-personal relationship.\n• CITPM or PMP-certified will be an advantage.\n• Preferably have some knowledge of Java.", "extensions": ["16 days ago", "Full–time"], "detected_extensions": {"posted_at": "16 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBcHBsaWNhdGlvbiBTdXBwb3J0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJFY3F1YXJpYSBUZWNobm9sb2dpZXMgUHRlIEx0ZCIsImNvbXBhbnlfbWlkIjoiL2cvMTFkeHEyNnB4eiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6InpIYzZCNWdOTUFJYzhzS0xBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVvc0NDc3dCUVU1VlgwNXhWRGR3TVhKTlltSTJla2xqYlU4MVVFRlZkRGRQZUY4MVowZGxTM2xGYmpKZk5EQkZSV3R6VW5KMlEwRlJXR00zTFRkYWNqbGhkRlZvZDFkcmFHUjBaMnRDVlV3emNYRjJSa010VDBRd05rVnVORzVyZFhGSk4xRkdNa1V6U2s1cVZWSTFkVXBTYWt0VFVHTlBTMW8yVkdoV1dIQlBReTFqZVdaV1pHOUJkVWx0UzFBMGJHRnNhbGxKYjNGc1ExTkZiRXBPUjFkclZrbDBNWGRyUTNsMFl6azBjMGh1U1VKMkxXOWlabEJNVVZSV2NHaFJkVkpmTlZVMlVXdzRlbkJMWjNjemVWOVpFaFpIU0hGRFdVbFhjazA1U3pSMFVXRnFaelZUYjBSQkdpSkJUMDFaVW5kRVExZFFTVFExVWtSc1EzVTRhVTgyTkVoclkyc3dVVVIyV2taUiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzQ0IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEdsYXNzZG9vciIsImxpbmsiOiJodHRwczovL3d3dy5nbGFzc2Rvb3Iuc2cvam9iLWxpc3RpbmcvYXBwbGljYXRpb24tc3VwcG9ydC1tYW5hZ2VyLWVjcXVhcmlhLXRlY2hub2xvZ2llcy1wdGUtSlZfSUMzMjM1OTIxX0tPMCwyN19LRTI4LDUzLmh0bT9qbD0zNjU3MjMwMzU2XHUwMDI2dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "System Analyst (Coldfusion)", "company_name": "Techcom Solutions", "location": "Singapore (+1 other)", "via": "via LinkedIn", "description": "• Analyses the company problems/specifications and creates a plan for necessary developments or new versions of existing company applications/systems.\n• Designs a prototype to validate the needs of the customers which helps to specify the real amount of work involved in the development. (An adequate reporting is essential!)\n• Identifies options for potential solutions and assessing them for both technical and business suitability, this should always happen under special consideration of open source functionality available in this expertise area. In addition a special attention will be given to interfaces to related systems/programmes and necessary and relevant reports and dialog programmes.\n• Adherence to policies - Guarantee respect of planning, budget, risk management, process, guidelines, policies, standards in the scope of all applications developed. In particular, follow the change management process & incident Management Process.\n• Informs about all known risks and problems... concerning timing, budget and resources. Reports on a regular basis the progress of the development to respective Team-Manager and team-members. Keeps a clear communication to the business customer. Compiles minutes and protocols about all customer meetings concerning the development. Takes care about the version control in the development.\n• Ensures a smooth transfer from development to production phase in respect of methodology; provides technical and procedural documentation, test cases and protocols, training material, installation procedures, security concept and role assignment of customers\n• Performs all other tasks delegated by the Team Manager to optimize efficiency of the entire IT Department in the area of application development according company's management requirements. Takes also special care about his/her assigned computer/tools, especially in respect of viruses. This is also applicable to all Medias connected to it.\n• Respects all relevant company's standards (development) in his/her development, under special application of all state of the art technical and ergonomic design standards\n\nRequirements\n• Bachelor's Degree in Computer Science / Information Systems with above-average degree.\n• With at least 3+ years working experience in Web Application development.\n• Excellent knowledge of Web technologies preferably ColdFusion, PHP, HTML, JavaScript Frameworks)\n• Good working knowledge on relational database(s) (ORACLE, SQL, PL/SQL , MySQL and SQL Server).\n• Excellent Knowledge of Relational Databases (SQL Server, Oracle)\n• Awareness on all IT aspects (architecture, database, application development)\n• Ability to manage multiple activities within time and technical constraints\n• Adobe ColdFusion Certification will be given a preference\n\nInterested candidate kindly submit your updated CV in Word Format to: ******** . Only shortlisted candidates will be notify. Thank you", "extensions": ["29 days ago", "Full–time"], "detected_extensions": {"posted_at": "29 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTeXN0ZW0gQW5hbHlzdCAoQ29sZGZ1c2lvbikiLCJjb21wYW55X25hbWUiOiJUZWNoY29tIFNvbHV0aW9ucyIsImNvbXBhbnlfbWlkIjoiL2cvMTFjNzN2enR4MyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Ik9remU2UGFHajYxOEV6MFlBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2WUJDcmNCUVU1VlgwNXhVbUpxY1dzeloyZGFUVmxKT1VwTU5YZFFaVFJ1VFc1bWNqRnRZekJWWkZaTlRXWlZPRFpGYlU1blkxWjFjMGxZZFcxWloyODBhRFJKWTNneFdUQjRiMTlwZDBsVE5HczJRVVo1Um5SNmN6VnVSM2RmZDJocGFsTjVXRnBuYVVsaWFsVnRUVGw0UWtOVmJYSTVRbmRITFROaVltOWpibmhLVkd0eVgzQnRkMnhvVEd0TFJHRk5USGMxZFU5MlpsZzJVRFZzUmpKRGFYVXhTVWQ2U2pGM1RtTk1jbk5pTURSU1ZuaERhV2hTT0cxekVoWkhTSEZEV1VsWGNrMDVTelIwVVdGcVp6VlRiMFJCR2lKQlQwMVpVbmREYUUxRlVqUjRhbWhrYlZoUGFXbEZPVzF5VEZwVFFYSXhTRFJuIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNTEiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGlua2VkSW4iLCJsaW5rIjoiaHR0cHM6Ly9zZy5saW5rZWRpbi5jb20vam9icy92aWV3L3N5c3RlbS1hbmFseXN0LWNvbGRmdXNpb24tYXQtdGVjaGNvbS1zb2x1dGlvbnMtMjUxMDc1NjY2MD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior Software Engineer - 19386-JOB (BB-513F3)", "company_name": "ILLUMINA SINGAPORE PTE. LTD.", "location": "Singapore", "via": "via BeBee", "description": "Roles & ResponsibilitiesResponsibilities: Work as part of Agile scrum team (geographically distributed) to design, implement, and test our bioinformatics software that enables researchers, scientists, geneticists and clinicians manage the complex workflows required to successfully sequence the genome Transform operational/customer needs into technical description and design specification for a software system Lead the requirement gathering process and perform requirement analysis and risk analysis Assume the role of a product owner in an agile scrum team Develop, manage and prioritize the team’s product backlog Act as the primary liaison to product manager, customer support and other development teams to coordinate inter-dependencies to fulfill overall product delivery Work with overall system owner and project office to align team’s delivery with overall project plan Verify team’s delivery against requirements to ensure the right functionality Assist in troubleshooting system... problems during development and sustaining of product Develop and review project artefacts defined in the software life cycle in conformance to regulatory requirements Required Educational Background: At least a Bachelor’s degree in Computer Science, Computer Engineering, Bioengineering or engineering related area Desired Profile: At least 4 years of working experience in Life Science industry with knowledge in DNA Sequencing or at least 4 years of experience as a Business/System Analyst. (Medical Device is preferred) Certified Scrum Master or Product Owner or working experience in regulated product development environment (SDLC and ISO 13485) Strong analytical skills, problem solving and troubleshooting Strong verbal and written communication skills A track record that includes being part of a team which completed and shipped successful products Must thrive in fast-paced, dynamic environment Experience in participating in cross-organizational or inter-company collaboration Experience in developing full stack web applications in Java is a plus Experience in working with offshore teams is a plus Experience in working with customer support is a plus Experience with Lab Information Management Systems is a plusTell employers what skills you haveAgile MethodologiesBioinformaticsC++JavaJavaScriptLinuxSoftware DevelopmentSoftware EngineeringXMLSCRUM-based development environmentdesignedOracle Workflowcustomer needsdesign specificationSystem softwaretechnical description", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgRW5naW5lZXIgLSAxOTM4Ni1KT0IgKEJCLTUxM0YzKSIsImNvbXBhbnlfbmFtZSI6IklMTFVNSU5BIFNJTkdBUE9SRSBQVEUuIExURC4iLCJjb21wYW55X21pZCI6Ii9tLzA5bXhreHMiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJsMC0wMnJ2UU95dGdtdk9PQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFb3NDQ3N3QlFVNVZYMDV4VVZCeVFYUjFkMmhUU1RCc1l6VllTWFZsUkROUlFWTTFOVEF0UjJka1NGOXdMWGRsY0dOMVpYSkpiRUZzZEVWTGFXRmtlSE5mWHpGQmVHNVVWV0ZXYW1WbVZqZGFlamxwVWtoQ1VsQmZSVXd6Wmxad1IydDRZMWRTU25KQ1pEZ3hXUzFSVGxSSVlXMW5jRFJrZWxoMVVYTTRNblZhWkZoamFuQnRja2RXT1RGbk9GbDZWMDh0ZUhZeFZYUmpaa3BwVW1Wb2JERndSa3RGYjI5T1dXVnhkSEF4WTJsR1JtRktNR042YW01dWNVWjJaelJ4WkhsT2EzUlBNVTAyU1ZsUlgwWjVUMm90RWhaSFNIRkRXVWxYY2swNVN6UjBVV0ZxWnpWVGIwUkJHaUpCVDAxWlVuZERhMHRNY1hOemNuWXdhalZPWlRJd2NFRnBNMU50ZWt0RmJIZEIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY181NyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCZUJlZSIsImxpbmsiOiJodHRwczovL3NnLmJlYmVlLmNvbS9qb2IvMjAyMTA0MTctOTBhODllNmQ1ZWExODFlYTEyNTVjYTc3Njk5NTEzZjM/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "SGUnitedJob Business Analyst, SAP HR / Workday", "company_name": "None", "location": "Singapore", "via": "via Jobs | Fidanto", "description": "As a Business Analyst, you will be managing the HCM service delivery aspects of the project. You will collaborate with a team supporting a shared HR, finance and procurement system used by subscribing government agencies i.e. statutory boards. You will advise agencies on key trends and best practice for ERP solution locally and internationally to meet the business domain's objectives and solve business problems, assess applicability for adoption, manage user requirements, and provide IT solutions to bridge business needs. You are knowledgeable in SAP HCM modules or Workday. Success in this will be demonstrated by your ability to conduct business analysis, including business analysis planning and monitoring, business needs exploration and identification, requirement analysis, solution assessment and validation, and requirement management and communication. What to expect: Review and analyse agencies' ERP needs and recommend solutions within the shared System capabilities. Work with... suppliers and agency representatives to evaluate requirements, discuss solutions and develop plan of approach; analyse existing processes and make recommendations to better streamline overall processes within the ERP solution to ensure smooth deployment and adoption of new solution. Manage service delivery of shared HCM system and related sub-systems, including integration points with finance system and related technical areas. Work directly with and manage the supplier and agencies for new implementations. Manage post-implementation support and maintenance of the shared HCM system, including software patches / upgrades, disaster recovery, service quality and compliance with service levels, applicable policies, standards and processes. Assist with integration of ERP solution with other business systems and applications used by agencies and other Singapore Government shared systems and services. Validate design and effort of change requests for quality, reliability, maintainability and reasonableness. Review and analyse existing policies and processes and recommend improvements. How to succeed: Degree with major in Information Technology, Information Systems, Systems Development or closely related areas. At least 5 years' experience implementing and maintainingWorkday orSAP HCM, with hands-on SAP ECC 6.0 (Netweaver) HR ABAP/Webdynpro programming, workflow and configuration. Completed at least one full SAP project implementation and maintenance life cycle with hands-on experience. Knowledge of SAP Organisation Management, Personnel Administration, Time Management to Personnel Development including the suite of Talent Management (Appraisal, Recruitment, Talent Management & Development, Compensation and Learning Solution) functionalities and features. Experience in any of the leading cloud ERP products in HR domain will be preferred. Possess good communication, interpersonal, organizational and planning skills. Able to interact and communicate effectively with all levels of management, users and suppliers. Must be a self-starter and able to work independently with minimum supervision. Pluses Knowledge of, and experience in SAP ERP ECC 6.0 EhP 7 and related areas (e.g. process / product trends, best practices and technologies) Knowledge of Singapore Government accounting practices and policies Business Analysis certification: Certification of Competency in Business Analysis (CCBA) or Certified Business Analysis Professional (CBAP) As a Business Analyst, you will be managing the HCM service delivery aspects of the project. You will collaborate with a team supporting a shared HR, finance and procurement system used by subscribing Skills: Analysis, Business Analysis, Business Intelligence, Business Process, Business Process Improvement, Business Strategy, Change Management, Data Analysis, Leadership, Management, Management Consulting, Microsoft Office, Process Improvement, Program Management, Project Management, Requirements Analysis, Requirements Gathering, Sdlc, Sql, Strategy Experience: 5.00-7.00 Years", "extensions": ["26 days ago", "Full–time"], "detected_extensions": {"posted_at": "26 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTR1VuaXRlZEpvYiBCdXNpbmVzcyBBbmFseXN0LCBTQVAgSFIgLyBXb3JrZGF5IiwiY29tcGFueV9uYW1lIjoiTm9uZSIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiU2xOTVBhNTF3dXhfRFUtT0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIHwgRmlkYW50byIsImxpbmsiOiJodHRwczovL3NnLmZpZGFudG8uY29tL21vYmlsZS9qb2JzL2pvYi1vcGVuaW5nL2luZm9ybWF0aW9uLXRlY2hub2xvZ3ktcHJvamVjdC1tYW5hZ2Vycy9zZ3VuaXRlZGpvYi1idXNpbmVzcy1hbmFseXN0LXNhcC1oci13b3JrZGF5LTI2MTAxMjMzMz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Business Operations", "value": "GC06"}, {"text": "Accounting and Finance", "value": "GC01"}, {"text": "Customer Service", "value": "GC10"}, {"text": "Human Resources", "value": "GC15"}, {"text": "Management", "value": "GC18"}, {"text": "Education", "value": "GC11"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Protective Services", "value": "GC23"}, {"text": "Science and Engineering", "value": "GC27"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "System analyst", "value": "system analyst"}, {"text": "Systems analyst", "value": "systems analyst"}, {"text": "Business analyst", "value": "business analyst"}, {"text": "It analyst", "value": "it analyst"}, {"text": "Analyst", "value": "analyst"}, {"text": "Senior", "value": "senior"}, {"text": "Security analyst", "value": "security analyst"}, {"text": "Application analyst", "value": "application analyst"}, {"text": "Engineer", "value": "engineer"}, {"text": "Project manager", "value": "project manager"}, {"text": "Software engineer", "value": "software engineer"}, {"text": "Hris analyst", "value": "hris analyst"}, {"text": "Lecturer", "value": "lecturer"}, {"text": "Manager", "value": "manager"}, {"text": "Senior analyst", "value": "senior analyst"}, {"text": "Soc analyst", "value": "soc analyst"}, {"text": "Sr analyst", "value": "sr analyst"}, {"text": "Support analyst", "value": "support analyst"}, {"text": "Support manager", "value": "support manager"}, {"text": "System", "value": "system"}, {"text": "Systems administrator", "value": "systems administrator"}, {"text": "Technology analyst", "value": "technology analyst"}, {"text": "Test analyst", "value": "test analyst"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Internship", "value": "INTERN"}, {"text": "Part-time", "value": "PARTTIME"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Mining", "value": "/business/naics2007/21"}, {"text": "Research", "value": "/business/naics2007/5417"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Accommodation", "value": "/business/naics2007/721"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Real Estate", "value": "/business/naics2007/53"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "OCBC", "value": "/m/055r27"}, {"text": "Jobline Resources Pte Ltd", "value": "/g/11gp2647pn"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Workato", "value": "/g/11dxpy_3xd"}, {"text": "Avensys Consulting", "value": "/g/11g7022gjf"}, {"text": "Chevron", "value": "/m/01pvx3"}, {"text": "ELITEZ PTE. LTD.", "value": "/g/11dxptfkcf"}, {"text": "ILLUMINA SINGAPORE PTE. LTD", "value": "/m/09mxkxs"}, {"text": "M1 LIMITED", "value": "/m/05n486"}, {"text": "Mantu", "value": "/m/0b6mxkc"}, {"text": "Public Service Division", "value": "/g/11g6__bv10"}, {"text": "Rakuten Asia", "value": "/g/11g7072z1v"}, {"text": "Techcom Solutions", "value": "/g/11c73vztx3"}, {"text": "United Overseas Bank Limited", "value": "/m/04gjd1"}, {"text": "VISA", "value": "/m/01kqjn"}, {"text": "Venture Corporation Limited", "value": "/g/11bc61gglw"}, {"text": "Xilinx", "value": "/m/03dwkc"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "Activate Interactive Pte Ltd", "value": "/g/11dxq192l5"}, {"text": "Aramco", "value": "/m/01qjg2"}, {"text": "Avnet", "value": "/m/0c8xmc"}, {"text": "BGC Group", "value": "/g/11g0j3fjv8"}, {"text": "Bgc Group Pte. Ltd.", "value": "/g/11g9mphr4f"}, {"text": "CONNECT ENERGY SERVICES PTE. LTD.", "value": "/g/11dxptylw6"}, {"text": "Cochlear Ltd", "value": "/m/0kqqgc"}, {"text": "Crédit Agricole Corporate and Investment Bank", "value": "/m/04n1_w"}, {"text": "Ecquaria Technologies Pte Ltd", "value": "/g/11dxq26pxz"}, {"text": "Edwards Lifesciences", "value": "/m/03p20ps"}, {"text": "Equinix", "value": "/m/07btnq"}, {"text": "Experis Singapore", "value": "/g/11dxpnwm3s"}, {"text": "Flintex Consulting Pte Ltd", "value": "/g/11h1z41pzb"}, {"text": "ITCAN Pte Limited", "value": "/g/11dxpstz9t"}, {"text": "Institute of Technical Education", "value": "/m/05_02p"}]}]}