{"search_metadata": {"id": "60827a405f220352ba39682b", "status": "Success", "json_endpoint": "https://serpapi.com/searches/1537ad6f5d096544/60827a405f220352ba39682b.json", "created_at": "2021-04-23 07:41:52 UTC", "processed_at": "2021-04-23 07:41:52 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28consultant%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=100", "raw_html_file": "https://serpapi.com/searches/1537ad6f5d096544/60827a405f220352ba39682b.html", "total_time_taken": 1.48}, "search_parameters": {"q": "(consultant) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "100"}, "jobs_results": [{"title": "Senior Consultant: Security at NTT Ltd.", "company_name": "NTT Ltd.", "location": "Singapore", "via": "via BizLINKS Resources Pte Ltd", "description": "Senior Consultant: Security at NTT Ltd.\n\nJob Description\n\nThe Senior Digital Forensics & Incident Response Consultant (DFIR) will work within established Incident Response methodologies to perform a variety of related activities for NTT customers. This will include responding to Cyber Incidents, proactively hunting for adversaries in customer networks, and performing IR Readiness and Maturity Assessments, as such they will be expected to work independently with little management oversight whilst responding to customer Incidents. The Senior DFIR Consultant will also be responsible for leading and working on projects that will support tactical and strategic business objectives such as Incident Response, Incident Response Gap Analysis assessments, Table Top Exercises and proactive IR design engagements (Runbooks etc.). Demonstration of leadership abilities to provide a clear professional approach to customer facing engagements during the most trying and complex situations such as a data... breach. To provide clear and concise communication with a variety of stakeholders from customer IT staff up to C Suite. With the ability to lead during a crisis, show personal agility to adapt to changing environments, and a strong comprehension of malware, emerging threats and the ability to demonstrate risks to the customers' business as the result of a breach. NTT Security provide both first line DFIR services and extensive DFIR consultancy to large organisations where the development and maturity of customers in house DFIR capabilities is required. The consultant will be expected to work closely with other internal security teams such as SOC and Penetration Testing. A solid understanding of real life attacks is essential in the Consultant to provide high quality Incident Response services to our customers. Responsibilties Lead and perform Digital Forensic & Incident Response engagements for customers. Supporting Presales engagements and providing Subject Matter Expertise for pre sales calls and meetings. Proactively hunt for adversaries on customer networks utilising a variety of tools and techniques Responsible for Incident and Breach communications, assessments, and reports that may be both internal and customer facing, to include leadership and executive management for the purpose of enabling Senior Management to make decisions in a crisis situation. Understanding of different attacks and how best to design custom containment and remediation plans for customers Lead projects for Incident Response, which can be simple small engagements up to large multinational organisations. Develop and document processes to ensure consistent and scalable response operations Demonstrate industry leadership through blog posts and public speaking at conferences and events as well as provide mentorship to more junior staff members. Understand what sophisticated, real world attacks look like and how to identify TTP's within log data, network traffic and forensic imaging Experience, Skills And Qualifications Proven experience with Incident Response, offensive security (penetration testing), as well as detection, networking and endpoint solutions, are all distinct advantages. Be hands on familiar with IR toolsets and investigation techniques on both Windows and GNU/Linux Operating Systems Experience with enterprise level EDR and SIEM platforms. Collaborative attitude and able to serve as a liaison to different businesses and interface with fellow team members and colleagues on other security teams. Working within cyber defence for 5 years + and Incident Response for the last 2 years IT Security related degree (or show practical experience). Hold a CREST or SANS (or other industry related exam) in Incident Response (CREST Certified Incident Manager, CREST Certified Network or Host Intrusion Analyst, SANS GCIH, etc.), or be able to sit and pass one of the CREST Incident Response exam within 6 months In-depth knowledge of operating systems - Windows & Linux, firewalls, HIDS/HIPS & IDS/IPS Experience with OSINT and threat intelligence gathering methods Excellent verbal, written and presentation skills Industry standard information security certification (CISSP, CISM etc.) Deliver post event IR assessments and desktop/real life IR simulations at a technical and executive level Be able to guide, influence and provide thought leadership within incident response services Knowledge and experience with proactive threat hunting techniques and procedures 3692 Show more\n\nOriginal Joblink : https://sg.linkedin.com/jobs/view/senior-consultant-security-at-ntt-ltd-2305879291\n\nGoogle Company: https://www.google.com/search?q=Senior%20Consultant:%20Security%20at%20NTT%20Ltd", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQ29uc3VsdGFudDogU2VjdXJpdHkgYXQgTlRUIEx0ZC4iLCJjb21wYW55X25hbWUiOiJOVFQgTHRkLiIsImNvbXBhbnlfbWlkIjoiL20vMDFjM2ZxIiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiMFlad096bkUzcEVTa0ZPTkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFZFaFZibkppVmxkTk5IVlRURVZzV21zNFpHc3lhVU51WWpRNFJFWnlVbFpNTVRBdE9XeFVabWhSYVRGNVRFTXhValpIUjFkaVEweHVUMkpvVGw5TFZVbHpSRGs0VG1WbWNVdG5kbTFaVUU1eVoyVm1hREJEVkRkTFNXUlFkRXBNVEdZdE5sVkdUSE51VmxKYVowOVpSemwwVmpSS1NYRlRVMjVwWkU4emVFWkpaMWhmWVVOR1puZzBOV05YYnprd1JqWjVUMEZSZUZKeGFFdG5FaFpSU0hGRFdVMTViMGx2Y1VkelFWY3pjalF0V1VOUkdpSkJUMDFaVW5kQ1R6Vm9MVW95Y2tSbGJqVmFXRlpwVFRkV1JsRm1ZV014VGxkQiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzciLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQml6TElOS1MgUmVzb3VyY2VzIFB0ZSBMdGQiLCJsaW5rIjoiaHR0cHM6Ly93d3cuYml6bGlua3NyZXNvdXJjZXMuY29tLnNnL2luZGV4LnBocC9qb2ItbGlzdGluZ3MtcHVibGljLzk0LXNlY3VyaXR5LWVuZ2luZWVycy81MjQ0LXNlbmlvci1jb25zdWx0YW50LXNlY3VyaXR5LWF0LW50dC1sdGQ/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Recruitment Consultant / Researcher (Candidate Management - Banking and Insurance)", "company_name": "Cornerstone Global Partners", "location": "Singapore", "via": "via Management Consultants Career Center", "description": "We hire attitude over experience\n\nCornerstone Global Partners - Retail Banking and Insurance Desk is expanding!\n\nWe are hiring Recruitment Consultants in Hong Kong!\n\nIf you are interested in building a career that will allow you to:\n\n1) Work with Greater China's fastest growing Talent Acquisition firm!\n\n2) Work in a high performance yet fun environment\n\n3) Be pushed to never accept anything less than your very best. We have high expectations.\n\n4) Work alongside some of the best Recruiters in Hong Kong, Greater China, Singapore, US, Japan and a leadership team that leads by example. We have ZERO non billing leaders, every single one of our leadership team are top billers and highly respected in their sector focus\n\nThen we want to speak to YOU.\n\nResponsibilities\n\nTalent sourcing through a number of methods including Headhunting, Networking, Social Media and Advertising\n\nManaging and coaching candidates through the interview process\n\nNegotiating pay and salary rates\n\nDeveloping a good... understanding of clients and candidates to build long term relationships\n\nOur goal would be to educate and mould you as one of the future leaders of Cornerstone Global Partners, just as we have already done with some of the Recruitment Professionals who joined us as juniors.\n\nThis is the CGP Way and it is a non-negotiable quality that we are looking for", "extensions": ["7 days ago", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJSZWNydWl0bWVudCBDb25zdWx0YW50IC8gUmVzZWFyY2hlciAoQ2FuZGlkYXRlIE1hbmFnZW1lbnQgLSBCYW5raW5nIGFuZCBJbnN1cmFuY2UpIiwiY29tcGFueV9uYW1lIjoiQ29ybmVyc3RvbmUgR2xvYmFsIFBhcnRuZXJzIiwiY29tcGFueV9taWQiOiIvZy8xMWc3MDhzcmJnIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoia3RkRHZyTlB1XzAwLXBBVUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRW9zQ0Nzd0JRVTVWWDA1eFVuaHlhV2RuVUhKWFNrOXhkSE5GUjIxT01XOVNVbmxmZFZwMWVVOHdTbEZFUjNsR2NuWjBkV2R5YjJjME0wUk1TVzFqU1VWTlpGOTJWMmhoVUV0UVZrRk9ORzVyTWs1WFQzbGFWRkV4VnpaRmRubERRMVJMTWpCVlVEVndRVGRvYVdsWFIyMUdOMnR1VkhvNFNUVmZSVzVtTW0xUk0xZENWbGxLYzIxRVduWlRlREpxYTBoNlYwaFNjVzVQWkhkU2RWZFBXVUpKZUdOSVpXVlJhbEJUY0hCc2FsRkhUREZsT0ZST1RFZFJZV1pCYjBkdWRYTmxWRzFaZWs0eE16TkhWbmRRTW5nMUVoWlJTSEZEV1UxNWIwbHZjVWR6UVZjemNqUXRXVU5SR2lKQlQwMVpVbmREUTI1UWJYaG5ZbXB5YkRKa2FHcGlhRVp2ZW5vMlkwVkJWMHhSIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMTQiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTWFuYWdlbWVudCBDb25zdWx0YW50cyBDYXJlZXIgQ2VudGVyIiwibGluayI6Imh0dHBzOi8vY2FyZWVycy5idXNpbmVzc2NlcnRpZmljYXRpb24ub3JnL2pvYnMvMTQ2OTE3MTEvcmVjcnVpdG1lbnQtY29uc3VsdGFudC1yZXNlYXJjaGVyLWNhbmRpZGF0ZS1tYW5hZ2VtZW50LWJhbmtpbmctYW5kLWluc3VyYW5jZT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Recruitment Consultant - High commission! All are welcome!", "company_name": "STAR recruitment", "location": "Singapore (+1 other)", "via": "via LinkedIn", "description": "If you are Sales-driven and wants to work in a positive environment where you can hard and play hard together, we want you to join us!\n\nResponsibilities\n• Build strong and positive relationships with clients, candidates and colleagues.\n• Manage expectations of hiring managers and candidates to aid on smooth recruitment flow.\n• Drafting of job descriptions for advertising purposes and maintain well-organized job postings and candidates databases with utmost integrity.\n• Screening and interviewing candidates within recruitment targets and timeframe.\n• Perform any other recruitment activities as and where necessary.\n\nRequirements\n• All background and trades are welcome\n• Desirable personality traits include but not limited to:Positivity\nMulti-tasking\nEfficiency\nSelf-motivated\nMoney-driven\n\nStarting pay up to $3000 Basic salary + unlimited 5-figures commission + incentives + bonuses!\n\nGood career prospects!\n\nSelected candidates will need to take up the certification\n• Expected salary\n•... Last drawn salaries\n• Reasons for leaving\n• Notice period\n• Recent photograph\n• References\n\nRegistration No: R1105425\nEA License No: 08C5257", "extensions": ["13 hours ago", "Full–time"], "detected_extensions": {"posted_at": "13 hours ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJSZWNydWl0bWVudCBDb25zdWx0YW50IC0gSGlnaCBjb21taXNzaW9uISBBbGwgYXJlIHdlbGNvbWUhIiwiY29tcGFueV9uYW1lIjoiU1RBUiByZWNydWl0bWVudCIsImNvbXBhbnlfbWlkIjoiL2cvMTFmc2pfMDFxNiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IlhZakNfUEJWV09sS3ZiQUNBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2WUJDcmNCUVU1VlgwNXhVMUkzY0RkelMzTTVhMVU1TW00dGNEbDBkRFJFZWs5d1ZXOXBWSGxtWjBaaGRtaExVVTVNUlY5RWRXSnpTbXhoY0VWQ1VuVXdZMjEyVjJ4aWVHSndkSHBIWm5SM09YZFphWGxSV0ZCNmVXVjFRVXBFUlVaUlRFNVdWVGxyZEZOMWRXaGxZbFJFTjNOeFdHOU1ZWEZuUjJKWVNuTmFWekJSVUd3MFdsQjRSRzFwV1hSU05rZDBNR1F5ZGtSVU56SXhjVzVoVjJSSVNWOXFTWE5YUWt0cVlVWkxabm95TjFKWGVUVjBjMWR2VURCekVoWlJTSEZEV1UxNWIwbHZjVWR6UVZjemNqUXRXVU5SR2lKQlQwMVpVbmREZVZKcFNtRjBlVTlsUkZaeU9XVjNMWGhoWjFNd1MyTnVVV1JuIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMjEiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGlua2VkSW4iLCJsaW5rIjoiaHR0cHM6Ly9zZy5saW5rZWRpbi5jb20vam9icy92aWV3L3JlY3J1aXRtZW50LWNvbnN1bHRhbnQtaGlnaC1jb21taXNzaW9uJTIxLWFsbC1hcmUtd2VsY29tZSUyMS1hdC1zdGFyLXJlY3J1aXRtZW50LTI1MTU3ODY0OTc/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Senior Consultant - Operational Transformation", "company_name": "SearchElect", "location": "Singapore (+1 other)", "via": "via SearchElect", "description": "Key Words: Cybersecurity maturity, Enterprise Security Architecture, Security Strategy, Information Security, Security Consulting, Cybersecurity Operations, Cybersecurity Governance, CISSP, CISM, SABSA, TOGAF\nRole: Senior Consultant, Cyber Operational Transformation\nIndustry: Security, Information Technology\nFunction: Consulting, Client Engagement, Security Strategy,\nLocation: Singapore\n\nAbout Our Client\n\nOur client is a leader in providing Cybersecurity solutions and services. They offer expertise in Managed Security Services, Security Consulting and Cyber Analytics\n\nAbout the Senior Consultant, Cyber Operational Transformation\n• You will be part of a team that delivers cyber security outcomes with a strategy-to-execution approach. This team provides advisory for the clients to support their strategic interests and thrusts for growth in Cybersecurity.\n• You will work across the different clients’ technology and business stakeholders to maintain the alignment of business direction... which may include the support of cross-functional projects that require resources from multiple business units of the company.\n\nKey Responsibilities\n• You will support and help in the development, transformation, and execution of cybersecurity strategy for the clients and will report to the Cyber Operations Transformation Head.\n• You will work with team members, other Consulting teams and the clients to understand strategic, operational and project objectives of the clients into tangible cybersecurity outcomes along with its business context.\n• You will work with teams and the clients to interpret strategic, operational and project objectives of clients into quantifiable outcomes for cyber security architecture.\n• You will engage with business and technology stakeholders of the clients to identify the current state of their cybersecurity maturity across operations, governance, and risk management for future maturity state.\n• You will review documentation related to the above domains.\n• You will derive insights from interviews and documentation reviews based on people, process, technology, and governance perspectives.\n• You will analyse cyber risks and relevant non-cyber risks to identify areas of concern.\n• You will perform research and analysis including industry research, best practices, international standards and emerging cyber trends as needed.\n• You will build strategic recommendations and initiatives based on people, process, technology and governance perspectives as well as indicators.\n• You are to structure the initiatives into roadmaps to ensure alignment of cybersecurity to business directions in a sustainable manner.\n• You will develop documentation such as frameworks, policies, procedures, standards, baselines, guidelines and other materials in support of initiatives as needed.\n• You will participate in planning, designing and conducting of cyber simulation exercises such as table-top exercises and cyber training in support of initiatives or as needed.\n• You will serve as the SME for the team in cybersecurity operations, governance and risk management domains.\n• You will support the development of documentation and artefacts to maintain knowledge management and intellectual capital of the team.\n• You will lead small teams of consultants in planning and delivering engagements in the above domains.\n• You will engage with clients to showcase the team’s capabilities and value proposition as well as to identify and nurture small to medium business opportunities from discovery through contracting and delivery.\n\nAbout You\n\nPlease note: Interested Applicants must be able to work in Singapore.\n• You will have relevant cybersecurity certification including CISSP, CISM or SABSA as well as adjacent accreditation such as TOGAF.\n• Possesses a bachelor’s degree in Information Security, Computer Engineering, Computer Science, Information Systems, or other equivalents.\n• Extensive experience with a focus on cybersecurity operations, governance and enterprise security architecture and design.\n• Experience in performing consulting engagements across people, process and technology aspects of cybersecurity operations processes such as security monitoring, incident management; governance processes such as security strategy and architecture and cyber risk management.\n• Experience planning and delivering cybersecurity maturity / benchmarking assessments including the development of roadmaps for improvement.\n• Experience with development of cybersecurity operational and governance documentation.\n• Experience in cybersecurity consulting, with both internal and client facing engagements.\n• Experience in local regulatory standards such as Cybersecurity Act, IM8 and international cybersecurity standards, also including NIST Cybersecurity Framework, NIST SP 800-53, ISO 27001/2, STRIDE and MITRE.\n• Excellent social and communication skills with a history of direct client interaction and engagement.\n• Ability to understand and correlate business & technology trends and their implications to business.\n• Experience in leading small engagement teams of at least three or more consultants.\n• Proficiency in Microsoft Office suite, with a focus on Powerpoint and Excel and track record developing high quality deliverables for client presentations.\n• Ability to demonstrate flexibility, initiative and innovation in dealing with ambiguous, fast-paced situations.\n• Open to travel at least 20% of the time.\n• Applicants selected may be subjected to security screening and may need to meet eligibility requirements for access to classified information.\n\nIf you are interested to learn more about the above job role or any other job opportunities, please apply to this job advertisement or alternatively contact the following consultant:\nDanica Pagsisihan\n+65 65898787\ndanica@searchelect.com\nSearchElect Pte. Ltd. adheres to the Singapore Ministry of Manpower Tripartite guidelines on Non-Discriminatory Job Advertisements which you can find more information about HERE. If you feel any part of this job advertisement is discriminatory please immediately raise to our attention via webadmin@searchelect.com. We take these matters seriously and thank you for your cooperation", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQ29uc3VsdGFudCAtIE9wZXJhdGlvbmFsIFRyYW5zZm9ybWF0aW9uIiwiY29tcGFueV9uYW1lIjoiU2VhcmNoRWxlY3QiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImJBbjJHeVVGQ0g4b3BKRmtBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gU2VhcmNoRWxlY3QiLCJsaW5rIjoiaHR0cHM6Ly93d3cuc2VhcmNoZWxlY3QuY29tL2pvYnMvc2VuaW9yLWNvbnN1bHRhbnQtb3BlcmF0aW9uYWwtdHJhbnNmb3JtYXRpb24/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "MCF - Senior SAP Basis Consultant", "company_name": "None", "location": "Singapore", "via": "via Jobs | Fidanto", "description": "Job Title: Senior SAP Basis Consultant Job Description: The role is a client-facing consulting role and requires functional knowledge of the business processes in SAP Basis. This is both an SAP project delivery-focused role, managing complex SAP ERP implementation & configuration, as well as taking care of the tickets issue from several clients to support their queries. The consultant must be able to travel frequently locally for ABSG projects. Pre-requisites: Client-facing consulting role Expertise in SAP Basis technical Good integration knowledge between SAP and non-SAP, on-premise and cloud, within SAP applications, e.g. ERP and Concur Must be open to support SAP support maintenance, enhancement, change request and etc Description: As ABSG SAP Senior Consultant - Basis, you will be working with our client with cross-functional teams. IT development team and business users as consulting level. You will be involved in the troubleshooting and root cause analysis Implementation... upgrade and support of the latest SAP systems versions, which are: ECC, PI/PO, BI, GRC, CPS, DMS, EP, SolMan all running on Windows OS and MS SQL DB. You will also be involved in carrying out SAP Basis in SAP S4 HANA, HANA DB administration, SAP POHCI SAP Cloud Integration, SAP BW4HANA, or SAP FIORI Gateway administration. Ideally, you have HANA experience and exposure to Netweaver concepts and products (Fiori, SolMan, Enterprise Portal and etc) SAP HANA & Cloud migration and support SAP Max DB database administration and support Requirements: Must have overall 6-8 years' hands-on experience in SAP Basis with non-SAP, on-premise and cloud, within SAP applications, e.g. ERP and Concur Involved in at least 3-4 end to end life cycle implementation SAP Basis Hana. Preferably S/4 HANA BASIS certified. AWS and/or Azure certified will be an added advantage. Strong BASIS knowledge and skills with S/4 HANA implementation (full installation) experience, strong on various Cloud technologies with the ability to commission and configure SAP environment both on AWS and Azure platform. Deep knowledge of SAP Basis / SAP Cloud Platform environment. Strong organizational/planning skills with the ability to prioritize and work effectively in a fast-paced environment, proficiency in multi-tasking Able to start immediately Consulting experience is most preferred Please note that salary is determined on related experience and skill Personal Attributes: You must have an excellent analytical, presentation and soft skills including communication on how to handle existing clients and be client-oriented with excellent problem-solving skills You must possess a personal attribute such as creativity, positive thinking, quick learning, imagination, leadership, judgment and maturity, curiosity, strong interpersonal skills, professional integrity and initiative Confident in communicating and presenting at the business level to MNC clients. Take this opportunity to join an international team of professionals, implement and develop software and consulting solutions in international projects and gain cultural experience, to set a serious foundation for future career steps. For this position, interested applicants can apply directly by clicking \"Apply Now\" ABeam Consulting (S) Pte Ltd 18 Cross Street 10-05/09 China Square Central Singapore 048423 Tel: 65 6922 5270 Website: www.abeam.com Please note that this is for Principals only, NOT open to recruiters. We regret to inform you that only shortlisted candidates will be notified. Additional note to applicants Only candidates with profiles and CV's matching job requirements will be considered and contacted for interviews. In case you do not receive any response from us within four weeks of your application it means that your application was not considered. Due to the high number of applicants we receive, we cannot entertain each individual follow-up. Processing of applications will start approximately two weeks after the job posting date. The selection process is expected to take another two to four weeks. Job Title: Senior SAP Basis Consultant Job Description: The role is a client-facing consulting role and requires functional knowledge of the business processes in SAP Basis. This is both an SAP proj Skills: Amazon Cloud, Business Process, Cloud Applications, Cloud Security, Consulting, Integration, Project Delivery, Sap, Sap Basis, Sap Erp, Sap Implementation, SAP R/3, Windows Azure, Erp System, client facing , Sap Le Experience: 5.00-7.00 Years", "extensions": ["4 days ago", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJNQ0YgLSBTZW5pb3IgU0FQIEJhc2lzIENvbnN1bHRhbnQiLCJjb21wYW55X25hbWUiOiJOb25lIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJ4VmtranNkamdFdzB1VUlRQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnMgfCBGaWRhbnRvIiwibGluayI6Imh0dHBzOi8vc2cuZmlkYW50by5jb20vam9icy9qb2Itb3BlbmluZy9pbmZvcm1hdGlvbi10ZWNobm9sb2d5LXByb2plY3QtbWFuYWdlcnMvbWNmLXNlbmlvci1zYXAtYmFzaXMtY29uc3VsdGFudC0yNzY5NjQ2NTc/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Inbound Marketing Consultant", "company_name": "clickTRUE Pte Ltd", "location": "Singapore (+1 other)", "via": "via Glints", "description": "Seeking Fulltime and/or Freelance positions\n\nAbout clickTRUE\n\nRead about what we do, what we stand for and read our review from our clients before you wanna be part of us.\n\nAbout the Job: Inbound Marketing Consultant\n\nAs a Consultant within the Digital Marketing team, you will seek to deliver exceptional returns on our client’s marketing campaigns whether it is in the area of increasing online purchases for an ecommerce store, getting subscribers for a online service or driving awareness for a brand or product. We want candidates who have the steely determination to work in the online marketing space and will be willing to or can already:\n• Maximise results and hit targets on your campaigns on Search Engine Marketing platforms (Google, Yahoo, Bing);\n• Manage media plans on the various Ad Networks (Facebook, Yahoo, Bing, YouTube, etc);\n• Craft copies on ads and web pages that can effectively get conversions;\n• Implement tracking of advertising campaigns and websites via Google... Analytics for performance reporting;\n• Analyse data and work out actionable insights for client to better their business; and\n\nHandle queries and discussions on all things online related (it is that dynamic!) with clients and team-mates.\n\nYou will love this job if...\n• You spend most of your free hours online and are itching to continue doing that while working;\n• You have just obtained a tertiary education and want to apply your knowledge in the area of digital marketing (nevermind that you have specialised in something totally unrelated...marine biology perhaps?);\n• You get irritated with the state of some websites and the copies on some advertisements and you would want to make the world a better place by helping clients use the digital medium better;\n• You write and speak well and you do generally get along ok with people (a balance between a total recluse and an incorrigible social butterfly);\n• You are meticulous and have an eye for detall and you are able to spot the error in this sentence;\n• You get imbued with energy working independently while taking comfort that your team-mates are there for you;\n• You are an inner geek at heart and would jump at the chance to dissect data and explain statistics to a client;\n• You are obsessed about making things better no matter how minute and like coming up with the next how-to guide;\n• You can multi-task without breaking much of a sweat (assessed when you can keep focus and a smile while having clients, team-mates and managers asking for stuff to be done at the same time);\n• You have good time-management ability;\n• You want to be always learning and evolving in your chosen profession; and\n• You want and can make a significant contribution to the organisation you join.\n\nExtra points when we assess your application\n• You are a marketer, with 1 to 3 years of experience, who embraces technology.\n• You write, track and monetise your own blog or online property.\n• You can demonstrate that you are a right fit for this job in your CV.\n\nWhat we offer\n• A conducive environment to learn, work and grow.\n• Team-mates for you to get support and for your lunch outings.\n• An organisation that is immersed in all things online.\n• Constant challenges and opportunities to prove yourself.\n• No politics. Open communication.\n• Competitive salary and benefits", "extensions": ["Over 1 month ago", "$2.5K–$4.5K a month", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time", "salary": "$2.5K–$4.5K a month"}, "job_id": "eyJqb2JfdGl0bGUiOiJJbmJvdW5kIE1hcmtldGluZyBDb25zdWx0YW50IiwiY29tcGFueV9uYW1lIjoiY2xpY2tUUlVFIFB0ZSBMdGQiLCJjb21wYW55X21pZCI6Ii9nLzExYzczZ3FfcDEiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiIzNDBBUjZUQVBndS16YW5HQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdllCQ3JjQlFVNVZYMDV4VkhoUFFrTm5lR2xLV25KUk4yTmxVekJQVUVZelNsSkxNRmg0TFZsMlRsRjFlbHBmVjBsVFUyTlpTV1Y0Y0VGd2QzZ3dlVzEwUVZGWmRUZHdla1ZrVlhWMlJHcFNUelpOVFdRMlZERnVSakpSVjJ4eGFtSnpjbVZoWWt4TFIyaHBRaTFaYjA5RGFVNXhNMk5GZUVaMFZYRktTV1JpTWxnM2FYUnlZbGhNWldodGVrNHdiR05PY0V4aFNuWkpOa2x6T0hJNFEzTjFXVFpuVEVoQlp6VlFhVkJxUVUxQ2NVOWxaMDVUUTNreFQxSnJFaFpSU0hGRFdVMTViMGx2Y1VkelFWY3pjalF0V1VOUkdpSkJUMDFaVW5kQmREQkNOVEptUm5BeVIwdzFWR1J5TjFCdFkxcFhVM2QzVVhsQiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzM2IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEdsaW50cyIsImxpbmsiOiJodHRwczovL2dsaW50cy5jb20vb3Bwb3J0dW5pdGllcy9qb2JzL2luYm91bmQtbWFya2V0aW5nLWNvbnN1bHRhbnQvNmM5MDg2ZGQtZjFhMC00NTY0LWFmMmYtODlhMGE5ZTQwZDQ1P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Senior Solution Engineer / Pre-Sales Consultant - Singapore", "company_name": "Qualtrics", "location": "Singapore", "via": "via Qualtrics", "description": "The Qualtrics XM Platform™ is a system of action that helps businesses to attract customers who stay longer and buy more, to engage and empower employees to do the best work of their lives, to develop breakthrough products people love, and to build a brand people can’t imagine living without.\n\nJoining Qualtrics means becoming part of a team bold enough to chase breakthrough experiences - like building a technology that will be a force for good. A team committed to diversity, equity, and inclusion because of a conviction that every voice holds value, with a vision for representation that matches the world around us and inclusion that far exceeds it. You could belong to a team whose values center on transparency, being all in, having customer obsession, acting as one team, and operating with scrappiness. All so you can do the best work of your career.\n\nWe believe every interaction is an opportunity. Are we yours?\n\nQualtrics, the leader in customer experience and creator of the... Experience Management (XM) category, is changing the way organizations manage and improve the four core experiences of business––customer, employee, product, and brand. Over 12,000 organizations around the world are using Qualtrics to listen, understand, and take action on experience data (X-data™)––the beliefs, emotions, and intentions that tell you why things are happening, and what to do about it.\n\nThe Qualtrics XM Platform™ is a system of action that helps businesses attract customers who stay longer and buy more, engage employees who build a positive culture, develop breakthrough products people love, and build a brand people are passionate about. Join us as we help change the way people experience the world! Advance your career at a company that is dedicated to your ideas and growth, fills you with purpose, and provides a fun, inclusive work environment.\n\nQualtrics, the leader in customer experience and creator of the Experience Management (XM) category, is changing the way organizations manage and improve the four core experiences of business––customer, employee, product, and brand. Over 12,000 organizations around the world are using Qualtrics to listen, understand, and take action on experience data (X-data™)––the beliefs, emotions, and intentions that tell you why things are happening, and what to do about it.\n\nThe Qualtrics XM Platform™ is a system of action that helps businesses attract customers who stay longer and buy more, engage employees who build a positive culture, develop breakthrough products people love, and build a brand people are passionate about. Join us as we help change the way people experience the world! Advance your career at a company that is dedicated to your ideas and growth, fills you with purpose, and provides a fun, inclusive work environment.\n\nQualtrics is the technology leader in the Experience Management space.\n\nQualtrics has transformed the way businesses collect, analyze and act on experiences that drive better decision-making. We offer a single experience management platform that captures employee, customer, brand, product and market insights in one place. Whether companies are building customer experience, employee engagement, or market research programs, they can do it all using Qualtrics. We are doing just that for many of the world’s most forward-thinking brands, including BMW, Lloyds Bank, Barclays, Under Armour etc.\n\nQualtrics started in 2002 as an academic research technology & has since grown to have more than 11,000 enterprise clients worldwide, over 2,000 employees, more than 1,800 college and university clients, and enjoys strong quarter-over-quarter revenue growth and notable profitability since its founding.\n\nThe Challenge\n\nGrowth opportunity for a self starting Senior Solution Engineer / Pre-Sales Consultant to join a dynamic fast paced environment.\n\nExpectations for Success\n• Pre-sales experience in a SaaS/Cloud environment, selling enterprise software to business users & executives.\n• High energy, self-starter comfortable with ambiguity in visionary environments.\n• Good customer facing and relationship building skills.\n• Outstanding techno-functional capabilities, comfortable supporting sales teams proactively on targeted accounts\n• Business value focused mindset to uncover clients’ business challenges and develop custom solutions to solve them. Communicate value at the executive level\n• Ability to explain and resolve common technical aspects of SaaS software, including communicating with technical audiences on security, privacy, protocols for APIs, SLAs etc.\n• Team player with cross functional collaboration experience.\n\nQualifications & Requirements\n• Bachelor Degree required (Engineering, Computer Science, Mathematics, Commerce, Business, Marketing, Statistics or other quantitative field.\n• Pre-sales experience in a SaaS/Cloud environment, selling enterprise software to business users or C Level.\n• Good experience of building proof of concepts or custom demonstrations on software applications, showcasing use case specific solutions & the business value that technology can render for identified pain points.\n• Strong verbal and written communication skills.\n• Previous experience in Customer Experience, Market Research, Business Intelligence, CRM, HCM, Marketing Automation, Digital technologies is highly valued.\n• Optional: Experience in HTML, CSS, JavaScript, SQL is good to have but not a mandatory requirement\n\nA Day in the Life\n• Become an expert in the Qualtrics platform & become an expert in customer experience, employee experience &/or brand research\n• Provide exemplary pre-sales technical & functional expertise through product presentations, demonstrations, proof of concepts and ongoing technical consultation\n• Drive the adoption of Qualtrics solutions within strategic accounts, growing usage across departments within the enterprise. Translate technical features into value drivers.\n• Develop and maintain training materials, and deliver training to improve technical abilities of sales professional\n• Build working knowledge of competing products and how to technically sell against them\n• Work collaboratively with Product Management, Marketing and Engineering during the development, launch and continuing refinement of existing and new Qualtrics products.\n• Respond to initial product requests and frame product issues for discussion and resolution with Product and Engineering teams\n• Develop/maintain technical and business knowledge of industry directions and trends.\n\nWhat differentiates us from other companies:\n• Qualtrics Experience Program - A bonus each year for an experience of your choosing.\n• Our offices are in central locations throughout SEA, and we take pride in creating an open and collaborative work space.\n• Attractive benefits package including equity, a wellness bonus, medical, pension etc.,\n\nJoin us on this adventure that can open many doors! Join a company that is dedicated to your ideas and growth, recognizes your unique contribution, fills you with purpose, and provides a fun, flexible and inclusive work environment.\n\nWe live by our core values TACOS\n\nTRANSPARENT\n\nOur default is to share, leading to open debate, trust, and decisions based on data, not politics.\n\nALL IN\n\nWe bet on Qualtrics and Qualtrics bets on us. This is our company. We deliver, whatever it takes.\n\nCUSTOMER OBSESSED\n\nIf a customer is upset, we failed. Period. We learn, and we fix it.\n\nONE TEAM\n\nThere is only one team at Qualtrics. We win and lose together and never say, \"That’s not my job.\"\n\nSCRAPPY\n\nWe’re smart, resourceful, and find a way. We write our own story instead of following others", "extensions": ["2 days ago", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29sdXRpb24gRW5naW5lZXIgLyBQcmUtU2FsZXMgQ29uc3VsdGFudCAtIFNpbmdhcG9yZSIsImNvbXBhbnlfbmFtZSI6IlF1YWx0cmljcyIsImNvbXBhbnlfbWlkIjoiL20vMDgwbm5mdCIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6InF5QzBiYzk3Rk15b0JQRktBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhVMEY0YUV0aFFVaDViSFV6Unpaek5sbHZTV05RTTBONk5WZFFlRTFsTW5WbmRuSnlSRmRIVmxocmF6SnVTa3czWmtob1lsa3djalZwUkRGU1ZUSlRjRnBxV0dnNVUyb3dUM2xzZGkxTU1taENMV05aYUhWSGMxODVTRmt3ZEc1VGEzWTJValJGU1ZSZldGSlpkRlpoZW05bVJXOXZNRTlJZVZWWFRHZGFkMDlIUmpWd05XdGpTREI1ZW0xQ1NtWjVSV2RZVldwbmVXTkxXbXRSRWhaUlNIRkRXVTE1YjBsdmNVZHpRVmN6Y2pRdFdVTlJHaUpCVDAxWlVuZEVSWE5qWVRadFlsZEtaVFZETlZobGFGbG5Za3BFU2tSTFlsbDMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY180NCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBRdWFsdHJpY3MiLCJsaW5rIjoiaHR0cHM6Ly93d3cucXVhbHRyaWNzLmNvbS9jYXJlZXJzL3VzL2VuL2pvYi8yNjgwODgxL1Nlbmlvci1Tb2x1dGlvbi1FbmdpbmVlci1QcmUtU2FsZXMtQ29uc3VsdGFudC1TaW5nYXBvcmU/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Senior Consultant: Security (NTT)", "company_name": "NTT", "location": "Singapore", "via": "via Careers At NTT", "description": "Position Overview\n\nKey Accountabilities\n\nAs the Senior Security Consultant (Governance, Risk and Compliance) you will be a member of the GRC team to drive the success of the practice in GRC domains. You will be driving multiple client engagements focused in delivering information security projects related to our Governance, Risk and Compliance (GRC) practice. Specific responsibilities will include:\n• Lead the delivery of GRC security advisory engagements or consulting projects related to industry standards and frameworks, such as NIST, ISO27001, Cybersecurity Agency’s CII Code of Practices etc;\n• Lead and perform various types of security assessments (maturity, compliance and risks) specifically for Singapore and Southeast Asia Countries;\n• Able to engage and interact with the client’s senior management and stakeholders, including CISO, CIO, CTO and etc and provide strategic level advices on the cybersecurity domains;\n• Provide consultancy to client in closing security control gaps in... a practical way;\n• Establish security plans, frameworks, roadmaps, awareness program and policies, procedures, standards, guidelines for clients;\n• Support of pre-sales activities;\n• Have an understanding of the IT security market place as a whole and the industry that supports it\n• Support GRC practice developments, collaborations, collaterals establishment and any enablement activities;\n• Work with other regional team to develop/improve the GRC service delivery frameworks.\n\nExperience Skills and Qualifications\n\nAs the Senior Security Consultant (Governance, Risk and Compliance) your skills and qualifications will include:\n• Possess at least 5 years of working experience related to information security practices with minimum of 3 years in GRC domains.\n• Requires degree level of education, or significant experience and track record with tertiary qualifications.\n• Holder of security assessor certificates (with good standing) is required, such as PCI QSA certification or ISO27001 Lead Auditor\n• Possess of information security certifications, such as CISA/CISM/CRISC/CISSP\n• Experienced in a pre-sales for security consulting or equivalent capacity\n• Project management experiences is preferred\n• Experiences in security or enterprise architecture is preferred\n• Has experience in technology controls review, risk assessment, policy review and control review type of engagement with financial services industry, or other specific industry such as FSI, Telecommunications, pharmaceutical, gaming and entertainment and etc.\n• Experiences in handling regulatory requirements on financial services industry, such as MAS TRM, PCI-DSS, Privacy (GDPR/PDPA etc).\n• Demonstrate excellent skills in structured problem solving techniques, creativity and intelligence in the development of solutions to customer problems\n• Be self-motivated and self-disciplined with a demonstrable and successful track record in delivering consultancy projects to all sizes of organizations\n• Have good presentation skills with the ability to present to audiences of both business and IT stakeholders\n• Have good written communication and report writing skills\n• Must be a good team player\n• Demonstrate commitment to delivering projects within time and in budget and to a high level of client satisfaction\n• Be willing to travel across regions\n• Candidates who possess less experience will be considered as Security Consultant (Governance, Risk and Compliance)\n• Candidates who possess some experience on Vulnerability Assessment and Penetration Testing is a bonus", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQ29uc3VsdGFudDogU2VjdXJpdHkgKE5UVCkiLCJjb21wYW55X25hbWUiOiJOVFQiLCJjb21wYW55X21pZCI6Ii9tLzA1bXlicDgiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJvM1ZxMWl5Yi1PWm9ZNWdqQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFc3NCQ293QlFVNVZYMDV4VkVVeWRFbFBSRGw1TW1aWE5tWXdNMDR4TTFRemQwTmlhamw1VkZjNE9VdGFTVzlOVDNsSFdGZG1OemxGZFRNdFF6QnpTbDlqZG1Velp6VlJjbkpqYnpKdWVYbDZWR2RzT0UxRGVtZFFNbE55WXpCVWNEYzFORTlRTFRGeE1HTXpiVE5TVEMxTlpUWmhlV3QwT1dkS09XeEtRbFIwWTNKSGNVUXdZekZuUmpoeE5tZDViRVVTRmxGSWNVTlpUWGx2U1c5eFIzTkJWek55TkMxWlExRWFJa0ZQVFZsU2QwSjNSV1pFY2poRmNWbEdTa0ZxZDA0dFozSldNSEJ0TUMxbGFGRSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzUxIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIENhcmVlcnMgQXQgTlRUIiwibGluayI6Imh0dHBzOi8vY2FyZWVycy5oZWxsby5nbG9iYWwubnR0L2dsb2JhbC9lbi9qb2IvTlRUMUdMT0JBTDM3NTBFWFRFUk5BTEVOR0xPQkFML1Nlbmlvci1Db25zdWx0YW50LVNlY3VyaXR5LU5UVD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Lead Consultant", "company_name": "Infosys", "location": "Singapore", "via": "via HelpOneBillion", "description": "Job Description\n\nAbout Infosys -\n\nInfosys is a global leader in next-generation digital services and consulting. We enable clients in 46 countries to navigate their digital transformation. With over three decades of experience in managing the systems and workings of global enterprises, we expertly steer our clients through their digital journey. We do it by enabling the enterprise with an AI-powered core that helps prioritize the execution of change. We also empower the business with agile digital at scale to deliver unprecedented levels of performance and customer delight. Our always-on learning agenda drives their continuous improvement through building and transferring digital skills, expertise, and ideas from our innovation ecosystem.\n\nVisit www.infosys.com to see how Infosys (NYSE: INFY) can help your enterprise navigate your next.\n\nJD IDJD_CISMFG_SAP_PSR_JL6-SingaporeRole (L1/L2/L3/Service Lead/Tech Lead/Architect)PSRPositionSAP Provider System ResponsibleDepartment ... PUCISMFGAcademic BackgroundBachelor of Engineering / Technology / ScienceOverall Experience (in yrs.)10-15 Yrs.LocationSingapore 40JD_CISMFG_SAP_PSR_JL6-SingaporeTechnical skills (Required - Mandatory)Hands on experience in…\n\nApplication: SAP Basis, NetWeaver, ABAP/Java-Stack, SAP PI/PO, Avantra, ServiceNow, SAP LaMa\n\nDatabase: SAP HANA, Oracle, MaxDB\n\nOperating Systems: Linux, Unix, Windows\n\nTechnical: Troubleshooting SAP Basis issue, SAP Client Copies, SAP System Copies, Installing SAP System, Updating Databases, Language Pack Installation, Tablespace Management, Backup & Restore/Recovery of Databases, Spool Administration, Live Cache Administration, SSO/SSL Configuration, Kernel Upgrades, SAP Hardening Support Package Upgrade, Shell / Python scripting, experience in driving automation using, Capable of designing and implementing different strategies and procedures (Like System Landscape, System Architecture, Backup Strategy, System Refresh, Patching, Stress/Performance testing etc…). Capacity & Performance Management / Tuning, Proven experience in delivering Automations, Service Improvements Area\n\nCertification: Certified in SAP Basis or SAP HANATechnical skills (Required - Nice to have)Application: SAP Solution Manager\n\nDatabase: Sybase, MSSQL\n\nTechnical: Underlying Infrastructure stack: Hypervisor, Storage, Network, Job Management Tool (SAP BPA/Redwood RunMyJobs, Broadcom/Automic UC4, SAP BPO/Solution Manager, IBM Workload Automation), CISM, Automation implementation experience in SAP BasisLanguage skills neededRole (L1/L2/L3/Service Lead/Tech Lead/Architect)People skillsSupporting and mentoring the L1, L2 and L3 Team in day-to-day work.\n\nLeading a team of 5-10 or 10+ persons.Soft skills\n• Experience in running operations with ITIL processes / ITIL certified.\n• Excellent Analytical and troubleshooting skill.\n• Excellent in Verbal, written communication.\n• Creative thinking in implementing Service improvements (automation, incident reduction, etc.).\n• Willingness and flexibility to learn new technologies, scale up quickly and adapt to different roles as the situation demands.\n• Experienced in running operations following ITIL processes.\n• Strong multi-tasking skills and abilities to handle changing priorities in a fast paced environment\n• Strong customer focus and management of client expectations\n• Should work with minimum supervision\n• High customer orientation\n• High quality awareness\n\n50Role (L1/L2/L3/Service Lead/Tech Lead/Architect)Skill Level\n• As a PSR, you are an expert at contributing to different phases of the consulting lifecycle.\n• Plan and coordinate all activities within the responsible SAP Environment of the System Responsible\n• You will plan and coordinate Changes with IT Partners, Application Teams and other Services within the Datacenter.\n• Manage and support multiple landscapes. Should be able to manage and work in the area of SAP operation support, Implementation support, rollouts and Project support.\n• Be the single point of contact for the different landscape for internal Teams as well for the Customer.\n• Proven SAP systems delivery and/or system administration knowledge across the suite of major SAP applications & versions.\n• You will escalate Issues and Risks to the appropriate Team / Management.\n• You will support the L1 / L2 / L3 Team in troubleshooting Incidents.\n• You will optimize the SAP Systems in your responsibility.\n• You will review the monthly EWA Reports, create proposals and discuss them with the IT Partners and Application Teams.\n• You will be intensely involved in; defining the problem, propose, coordinate and refining the solution.\n• You will also play an important role in the development, configuration and deployment of the overall solution.\n• You will guide teams on project processes, deliverables and contribute to the proposal development, client training and internal capability-building and help detail the project scope.\n• You will have the opportunity to shape value-adding consulting solutions that enable our clients to meet the changing needs of the global landscape.\n\nExpertWriting solutions / estimates for RFPs.\n\nDriving automation using state-of-art automation platforms like SaltStackPSR\n\nAll aspects of employment at Infosys are based on merit, competence and performance. We are committed to embracing diversity and creating an inclusive environment for all employees. Infosys is proud to be an equal opportunity employer.\n\nAt Infosys, we recognize that everyone has individual requirements. If you are a person with disability, illness or injury and require adjustments to the recruitment and selection process, please contact our Recruitment team for adjustment only on Infosys_ta@infosys.com or include your preferred method of communication in email and someone will be in touch.\n\nPlease note in order to protect the interest of all parties involved in the recruitment process, Infosys does not accept any unsolicited resumes from third party vendors. In the absence of a signed agreement any submission will be deemed as non-binding and Infosys explicitly reserves the right to pursue and hire the submitted profile. All recruitment activity must be coordinated through the Talent Acquisition department", "extensions": ["25 days ago", "Full–time"], "detected_extensions": {"posted_at": "25 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJMZWFkIENvbnN1bHRhbnQiLCJjb21wYW55X25hbWUiOiJJbmZvc3lzIiwiY29tcGFueV9taWQiOiIvbS8wMWs4eDYiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJkc0xGOWk3VXFEMVByR3ZvQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFc3NCQ293QlFVNVZYMDV4VkVWV1ZrcHFibVZLVVhsM2NGbDJjWGs0VlZCbGNEY3laMlJ0VFRkblUxOWpkek5LTWtwc2MxUjNWVFJmYUdkbU5tVXdlSFpvVDJkQlQxQktZbFJ6VW5wVk4weHhjVEZxT0dsVFp6Wm1ibEowYkhCTmNtSlNVa1V3TVdRM2JIZFlRMTlaVmtzNFZEQjZSRWMzTFRoT1ZtdHNaR2wxWlhKdFNraHJOMEpWY2tWRVpWUmZWM1FTRmxGSWNVTlpUWGx2U1c5eFIzTkJWek55TkMxWlExRWFJa0ZQVFZsU2QwRTBNRGwyVVVOYVQwUjJWMkpWY1RGemNuZEdSemR6U0dWYVUzYyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzU5IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEhlbHBPbmVCaWxsaW9uIiwibGluayI6Imh0dHBzOi8vaGVscG9uZWJpbGxpb24uY29tL2pvYi8xY2E1ZDdmZjdlNTlkMDg1NWU4ZTJkMzc4ZDhiMjhiNS9MZWFkLUNvbnN1bHRhbnQ/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Senior Consultant", "company_name": "Lloyds Register", "location": "Singapore", "via": "via MNC Jobs Singapore | MNC Jobs In Singapore", "description": "Job ID:30692\nJob Title : Consultant / Senior Consultant\nLocation: Singapore\n\nDepartment: Inspection Services\n\nPosition Type: Employee Regular\n\nEducation Required: Bachelor degree and above with sufficient experience in relavant discipline in manufacturing, additive manufacturing, industry automation, engineering\n\nExperience Required: Polymer and/or Composite Materials background\n\nRelocation Provided: No, Local singapore salary only\nBackground:\nLR Inspection provides industrial manufacturing inspection and certification services to all sections of the supply chain around the world. From certified inspection services for vendors and operators, to independent inspection services based on customer requirements, we provide assurance that assets and products meet specified requirements. We can support clients in mitigating the risks clients face at every point in the manufacturing process, whether during design, manufacture and assembly of product components, the production of prototypes... or when seeking type approval or project certification. Our services are designed to help clients at all aspects of the industry.\nRole purpose:\nThe Additive Manufacturing Consultant’s key role is to sell, negotiate, close and deliver all Performance related activities mainly Advisory Consulting, Innovation product such as remote Inspection, Additive Manufacturing, Industry 4.0, database compliance etc.\n\nKey Responsibilities:\n• Identify opportunities for Additive manufacturing services and other technical consulting and innovation service\n• Follow-up with clients to close the sale\n• Deliver and full project management. Delivery of the project includes submission of deliverables such as technical reports\n\nTechnical Requirements:\n• Must have a bachelor’s degree or above with sufficient experience in a relevant discipline (manufacturing, additive manufacturing, industry automation, engineering, technical consulting, etc.) to be able to apply to client requirements for Performance Product Portfolio\n• Polymer and/or Composite Material background\n• Must have technical ability to understand main products of Performance portfolio doubled with a strong commercial acumen\n• Real capability and willingness to promote and develop Performance products\n• Interpersonal skills for client interaction with good presentation skills\n• Able to work independently\n• Ability to problem solve complex technical issues\n• Excellent organisational skills and be able to deliver results before deadline", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQ29uc3VsdGFudCIsImNvbXBhbnlfbmFtZSI6Ikxsb3lkcyBSZWdpc3RlciIsImNvbXBhbnlfbWlkIjoiL20vMDNxNDE0IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiRl8yN2JjRHVLR1RobTVfdkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFZHNDNOMWRFU0dSUVYwZ3pXWEJsYlRFMk5tMUlSbFF3YVZGRVluRXRibFpSWDFOMldGUnVUVVl6YlZabVdtWldUa2t3UjBkR2VrNUlhSEV6TXpRNFMzSlFPVEpKU21kc2JFNU9laTFCTlc1QlpFOXFTblpyY2xSRFVtdDJVbTg0TjIxd2NXdGpjMVU1TFdaSmJsUmxNbE52WW5CSE1qVmFSWGxsU3kxelpXb3pkRE5VTFdkcFNHOHhPVGRtYlVSV1RWWTJTRjh4TUZoVE5UUjNFaFpSU0hGRFdVMTViMGx2Y1VkelFWY3pjalF0V1VOUkdpSkJUMDFaVW5kRVNYaEdiMWM0T1hNM05HODFaMUZCWmt0NU9HMW9TV0poYkhoQiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzY3IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1OQyBKb2JzIFNpbmdhcG9yZSB8IE1OQyBKb2JzIEluIFNpbmdhcG9yZSIsImxpbmsiOiJodHRwczovL3NnLm1uY2pvYnouY29tL2pvYnMvc2VuaW9yLWNvbnN1bHRhbnQtc2luZ2Fwb3JlLTIwMDI2NT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Business Operations", "value": "GC06"}, {"text": "Human Resources", "value": "GC15"}, {"text": "Accounting and Finance", "value": "GC01"}, {"text": "Sales and Retail", "value": "GC26"}, {"text": "Protective Services", "value": "GC23"}, {"text": "Science and Engineering", "value": "GC27"}, {"text": "Management", "value": "GC18"}, {"text": "Advertising and Marketing", "value": "GC03"}, {"text": "Legal", "value": "GC17"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Customer Service", "value": "GC10"}, {"text": "Social Services and Non-Profit", "value": "GC28"}, {"text": "Art, Fashion and Design", "value": "GC05"}, {"text": "Healthcare", "value": "GC14"}, {"text": "Energy and Mining", "value": "GC21"}, {"text": "Sports Fitness and Recreation", "value": "GC29"}, {"text": "Education", "value": "GC11"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "Consultant", "value": "consultant"}, {"text": "Senior consultant", "value": "senior consultant"}, {"text": "Security consultant", "value": "security consultant"}, {"text": "Recruitment consultant", "value": "recruitment consultant"}, {"text": "Lead consultant", "value": "lead consultant"}, {"text": "Associate consultant", "value": "associate consultant"}, {"text": "Principal consultant", "value": "principal consultant"}, {"text": "Associate", "value": "associate"}, {"text": "Financial consultant", "value": "financial consultant"}, {"text": "Functional consultant", "value": "functional consultant"}, {"text": "Presales consultant", "value": "presales consultant"}, {"text": "Technical consultant", "value": "technical consultant"}, {"text": "Application consultant", "value": "application consultant"}, {"text": "Devops consultant", "value": "devops consultant"}, {"text": "Pre-sales consultant", "value": "pre-sales consultant"}, {"text": "Consultants", "value": "consultants"}, {"text": "Development consultant", "value": "development consultant"}, {"text": "Engineer", "value": "engineer"}, {"text": "Hr consultant", "value": "hr consultant"}, {"text": "It consultant", "value": "it consultant"}, {"text": "Senior", "value": "senior"}, {"text": "Services consultant", "value": "services consultant"}, {"text": "Solution consultant", "value": "solution consultant"}, {"text": "Solutions consultant", "value": "solutions consultant"}, {"text": "Business", "value": "business"}, {"text": "Business consulting", "value": "business consulting"}, {"text": "Consulting", "value": "consulting"}, {"text": "Director", "value": "director"}, {"text": "Education consultant", "value": "education consultant"}, {"text": "Hcm consultant", "value": "hcm consultant"}, {"text": "Infrastructure", "value": "infrastructure"}, {"text": "Investment consultant", "value": "investment consultant"}, {"text": "Manager", "value": "manager"}, {"text": "Project manager", "value": "project manager"}, {"text": "Recruitment consultants", "value": "recruitment consultants"}, {"text": "Sap consultant", "value": "sap consultant"}, {"text": "Software engineer", "value": "software engineer"}, {"text": "Specialist", "value": "specialist"}, {"text": "Support consultant", "value": "support consultant"}, {"text": "Systems consultant", "value": "systems consultant"}, {"text": "Systems engineer", "value": "systems engineer"}, {"text": "Technology consulting", "value": "technology consulting"}, {"text": "Academy", "value": "academy"}, {"text": "Accountant", "value": "accountant"}, {"text": "Architect", "value": "architect"}, {"text": "Cloud consultant", "value": "cloud consultant"}, {"text": "Consultancy", "value": "consultancy"}, {"text": "Data engineer", "value": "data engineer"}, {"text": "Deputy director", "value": "deputy director"}, {"text": "Electrical engineer", "value": "electrical engineer"}, {"text": "Employee", "value": "employee"}, {"text": "Finance consultant", "value": "finance consultant"}, {"text": "Financial services", "value": "financial services"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Internship", "value": "INTERN"}, {"text": "Part-time", "value": "PARTTIME"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Accounting", "value": "/business/naics2007/5412"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Engineering Services", "value": "/business/naics2007/5413"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Real Estate", "value": "/business/naics2007/53"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Wholesale", "value": "/business/naics2007/42"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "SingTel", "value": "/m/020zfl"}, {"text": "EY", "value": "/m/0g9jc"}, {"text": "Infosys", "value": "/m/01k8x6"}, {"text": "SearchAsia Consulting Pte Ltd", "value": "/g/11fy260nhz"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "Deloitte SEA", "value": "/g/11f_g4x9d_"}, {"text": "Geco Asia", "value": "/g/11gk72_bt_"}, {"text": "OAKTREE CONSULTING", "value": "/g/11g70jfhtq"}, {"text": "Central Provident Fund Board", "value": "/m/0615qb"}, {"text": "NCS", "value": "/m/0282746"}, {"text": "Trustwave", "value": "/m/0n3xjf5"}, {"text": "Ensign InfoSecurity", "value": "/g/11g4jhymjr"}, {"text": "HCL SINGAPORE PTE. LTD.", "value": "/g/11fy25ngsv"}, {"text": "Horangi", "value": "/g/11fm41wdh3"}, {"text": "LINKBYNET", "value": "/g/11f00s44gb"}, {"text": "NTT", "value": "/m/05mybp8"}, {"text": "RECRUIT EXPRESS PTE LTD", "value": "/g/11g706hzhq"}, {"text": "Randstad", "value": "/m/08pt1z"}, {"text": "Randstad Singapore", "value": "/g/11g70b50mr"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "UBS", "value": "/m/031rxp"}, {"text": "Xcellink Pte Ltd", "value": "/g/11c73prcqy"}, {"text": "Alight", "value": "/g/11fj9r012s"}, {"text": "Avanade", "value": "/m/094456"}, {"text": "Avensys Consulting", "value": "/g/11g7022gjf"}, {"text": "CBRE", "value": "/m/090r7m"}, {"text": "Golder", "value": "/m/02qx9bq"}, {"text": "Hitachi Solutions", "value": "/g/121lyvj9"}, {"text": "IBM", "value": "/m/03sc8"}, {"text": "Marsh & McLennan", "value": "/m/053rw"}, {"text": "Mott MacDonald", "value": "/m/043l4j"}, {"text": "NTT Ltd.", "value": "/m/01c3fq"}, {"text": "Qualtrics", "value": "/m/080nnft"}, {"text": "SAP", "value": "/m/01pf4l"}, {"text": "Techcom Solutions Pte Ltd", "value": "/g/11c73vztx3"}, {"text": "Turner & Townsend", "value": "/m/0cfy6xp"}, {"text": "Thatz", "value": "/g/11dxpx4g1l"}]}]}