{"search_metadata": {"id": "6082794d5fc49360637cae7d", "status": "Success", "json_endpoint": "https://serpapi.com/searches/e4f1d01ee38ef6af/6082794d5fc49360637cae7d.json", "created_at": "2021-04-23 07:37:49 UTC", "processed_at": "2021-04-23 07:37:49 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28product+manager%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=40", "raw_html_file": "https://serpapi.com/searches/e4f1d01ee38ef6af/6082794d5fc49360637cae7d.html", "total_time_taken": 1.02}, "search_parameters": {"q": "(product manager) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "40"}, "jobs_results": [{"title": "Product Manager", "company_name": "INFOSYS COMPAZ PTE. LTD.", "location": "Singapore (+1 other)", "via": "via MNC Jobs Singapore | MNC Jobs In Singapore", "description": "Roles & Responsibilities\n• Act as product manager and provide & track the product roadmap and backlogs\n• Provide solutions or workarounds with regards to existing functionalities\n• Provide basic configuration changes that does not impact existing functionalities\n• Answer functional queries: - E.g. how to use functionalities\n• Be the scrum master and track the agile activities of the scrum team\n• Monitor applications, servers together with other internal teams ( IOC, Prod Control, Security)\n• Testing and release management\n• Participate in users training\n• Provision user/license provisioning, manage licenses\n• Vendor management\n• Support budget process\n• Provide Audit support\n• 15+ years’ experience in IT product management and digital transformations\n• Experience in employee experience platforms implementation\n• Experience in working as product manager and the product roadmap activities and backlog prioritization/tracking\n• Experience in Scrum Master, leading multi-functional scrum... team of iOS app (preferred), React Native, UX and mobile backend integration (Java Spring Boot)\n• CSM scrum certified professional (preferred)\n• iOS/mobile build and distribute experience\n• Digital platform build and employee experience product build expertise\n• Continuous Integration\n• Exposure in Agile methodologies & Agile toolsets\n• SCM tools (git, bitbucket)\n• Able to learn and support mobile design and development using iOS, React Native, Java Spring boot\n• Knowledge in AWS/Azure/GCP setup\n• Good communication and stakeholder management skills\n\nGood to have:\n• Packet management (rpm, npm and etc.)\n• Containerization (docker etc.)\n• Cloud computing (AWS, GCP, Azure)\n• Infrastructure as code\n• CSM scrum certified professional (preferred)\n• Expertise in leading 20-30+ team and leading product management\n• Implementing and maintaining CI/CD pipelines\n• Agile/Scrum principle\n• Presentation skills", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9kdWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJJTkZPU1lTIENPTVBBWiBQVEUuIExURC4iLCJjb21wYW55X21pZCI6Ii9nLzExZjAxY2J5cHAiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiI0Z3UxUnl6UklJV3hhUEtKQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFb3NDQ3N3QlFVNVZYMDV4VVdoellXNHpkbUphZEhrdFJYTmFSbmhvU1U0MWRrcEhjVXBwYzJGNlZXNUhkR2MzVUdwUlJrOVdSa3BDU0Vaa0xVZzFRak5VZGtoNGRHSTNTM2x1VUdWRWNrd3hSREo0WkhGYVYwcFJURFJqYVZsSGJIbEZUSFZRTTFwdGMxbHZWR1o2UVhVMFZFMVFObE13VWtOQk9UaElkVU5CWjJKWFpIQmxUMDlqTkhKd05HaFpTV04wWjJGNGEwUlVTVVZGT1dGMlIzWTFjRGhUUkdST1dtOXNaa3hCUTJOaVduRkhRME5sT0RWVVJraHNNemgzUm1Ga1RXSmpWRkl6UmpKMFpWRnJOMGxyRWhaVVdHMURXVkJITVUwNFZHUjBRV0p1ZEhKMVNVSlJHaUpCVDAxWlVuZERNRGh1ZWtjdGJuSnFiRkkwYTJOcVkwTjVNRGhDYzJaWGRVSlIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY182IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1OQyBKb2JzIFNpbmdhcG9yZSB8IE1OQyBKb2JzIEluIFNpbmdhcG9yZSIsImxpbmsiOiJodHRwczovL3NnLm1uY2pvYnouY29tL2pvYnMvcHJvZHVjdC1tYW5hZ2VyLXF1ZWVuc3Rvd24tNTYyMDM/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Product Manager, Scrum Master", "company_name": "Arcadium", "location": "Singapore", "via": "via Neuvoo", "description": "Product Manager\n\nCompetitive Salary and Benefits\n\n(level according to experience: Senior, Associate Director, ...)\nThe Role\n\nAs a Product Manager, Scrum Master you will ...\n• Work cross functionally with Data Scientists, MLEngineers and Software Engineers as a Scrum Master\n• Perform Requirements Engineering for solutions and products\n• Build end to end Machine Learning and Deep Learning model-based software solutions\n• Perform market analysis, competitor analysis for a solution or product\n• Work directly with stakeholders and collaborate with Data Scientists, ML and Software Engineers\nYour Skills and Experience\n• Advanced degree in Computer Science\n• Deep understanding of Software Architectures and Software as a Service\n• 5+ years of fulltime experience as Scrum Master; experience in Project Manager roles a plus\n• Experience in product management\n• Experience working in a Continuous Integration project context\n• Experience with Hyperscaling platforms (AWS, Azure, Google, ...)\n•... Experience with Docker and build automation\n• Experience with agile development, unit testing/test-first paradigm, Extreme Programming or Scrum\n• Experience with NoSQL and SQL databases and data storage platforms\n• Experienced in applying and knowledgeable about common design patterns\n• Contributed to open source projects and community solutions on GitHub, StackOverflow or alike\n• Tools: Python, JavaScript, C# or Java, other object-oriented languages, SQL, REST, JSON; experience with Keras, Tensorflow, SciKit learn, additional ML and DL frameworks is a plus\n• Environments: experience with git and alike, “fluent” in using VS Code, Jupyter Notebook is a plus\n• Operating Systems: Linux, macOS, Windows\nThe Company\n\nCompany\n\nARCADIUM is a global technology company striving to provide AI solutions across multiple industries, by leveraging a common machine learning platform to deliver AI as a Service.\n\nTeam\n\nJoin a growing team of data scientists, machine learning and software engineers in an agile development environment. Work together with some of the best in the field to tackle challenging projects and operationalise the solutions you develop across a variety of industries and use cases.\n\nCulture\n\nWe work in a casual and collaborative startup environment. Every member of the team plays a key role in shaping the solutions we develop and creating positive business value for the companies we work with.\nJob Function: Engineering, Information Technology, Science\nIndustry: Technology, Service Provider for multiple verticals\n\nPowered by JazzHR", "extensions": ["29 days ago", "Full–time"], "detected_extensions": {"posted_at": "29 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9kdWN0IE1hbmFnZXIsIFNjcnVtIE1hc3RlciIsImNvbXBhbnlfbmFtZSI6IkFyY2FkaXVtIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJWaWFkaXVOeExIUFZWNDNRQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE5ldXZvbyIsImxpbmsiOiJodHRwczovL3NnLm5ldXZvby5jb20vdmlldy8/aWQ9YzcwZDU0MTEzNzg1XHUwMDI2dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Technical Product Manager", "company_name": "Resource Vantage", "location": "Singapore", "via": "via LinkedIn", "description": "Summary\nOur client is searching for an innovative and motivated Technical Product Manager to lead a technical team locally in Singapore and remotely to bring new products to market with speed. You will work closely with a Head of CRM to guide our product strategy, responsible for solution architecture, DevOps, application development, and communicate broadly with multiple functional groups and stakeholders.\nYou will anticipate bottlenecks, provide escalation and proposal to management, build consensus across different stakeholders. Lead technology decision, remove blockers, guidance, best practices to the developers in technical stacks, performance, security, and architecture design to help identify, prioritize and create opportunities from ideation to launch.\n\nJob Responsibilities\n• Able to display strong leadership to the technical team, responsible for the team’s efficient and high-quality completion of tasks\n• Being able to mentor the team in AWS microservices architecture... software development, coding best practices, delivering complex projects using AWS native services\n• Work closely with Head of CRM to understand user needs. Articulate clearly in a PRD that can help the developers to stay on track\n• Define product vision and create an execution plan to bring it to life. Fully own the strategic roadmap, from creation to implementation, to measuring success.\n• Responsible for solution architecture, tech discovery, DevOps, implementation, and maintenance of the product.\n• Work closely with different stakeholders to ensure product yields maximum returns and acquisition\n• Deeply understand our customer base to build the best tool to serve creators. Stay up to date on market trends, creator needs and opportunities.\n• Research new services and features launched by AWS, as well as staying on top of best practices to improve existing AWS solutions already in place\n• Define and implement processes that allow engineers to bring the most value to our customers, leading to a delightful overall customer experience.\n• Establish metrics to measure the team’s effectiveness and drive improvements.\n• Implement best practices and able to hands-on for development, product testing.\n• Manage the product backlog through continuous prioritization.\n\nJob Requirements\n• Min. 4 years of experience working as a Technical Lead at a software company\n• Experienced in large scale development and project management\n• Possess people leadership and technical coaching skills\n• Experienced in hiring and managing remote team, freelancer and external vendor\n• Played a lead role in at least 3 SaaS project and can detail how their product significantly impacted customer and company growth\n• Ability to articulate a structured product management and launch framework\n• Has managed a product that has launched multiple iterations quickly and with meaningful results\n• Loves to showcase advanced technology to different stakeholders\n• Wants to work on a team with other high-performing peers\n• Be an expert in using metrics to make decisions and drive direction\n• Be autonomous, self-driven\n• Experience with roadmap prioritization in an Agile environment (Scrum, sprints)\n• Problem-solving and analytical experience\n• Ability to juggle multiple projects and tasks. Demonstrated knowledge of project management concepts and techniques required\n• Must have the ability to make decisions and recommendations on technology strategies\n• Ability to communicate effectively with stakeholders in sales, marketing and other business areas as well as with technical teams\n• Creative and comfortable with ambiguity, exploration, and iteration under pressure\n• Empathy for our users and ability to balance the roadmap across internal and customer personas\n• Competent in Agile development methodology and Practices\n• Use of CI/CD in life-cycle\n• Ability to analyze data and articulate user hypotheses in terms of objective measures, and project KPI impact of new features\n• Deep technical knowledge in API development using REST JSON/ XML security standard (e.g. OAUTH2), AWS serverless and microservices architecture\n• Preferably AWS Certified Solutions Architect – Professional\n• Fluent in both English and Chinese\n\nApplicants who require work passes need not apply.\nInterested candidates please send a copy of your resume to rvantage@sspmail.com", "extensions": ["4 days ago", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJUZWNobmljYWwgUHJvZHVjdCBNYW5hZ2VyIiwiY29tcGFueV9uYW1lIjoiUmVzb3VyY2UgVmFudGFnZSIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiNDVHQWJkd2V3QkVyYjQ3eUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL3NnLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvdGVjaG5pY2FsLXByb2R1Y3QtbWFuYWdlci1hdC1yZXNvdXJjZS12YW50YWdlLTI0OTE2MDQyOTg/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "HR Admin Manager (West/ Transport provided/ Up to $6200) / Dairy product", "company_name": "TRUST RECRUIT PTE. LTD.", "location": "Singapore", "via": "via Joblum Singapore", "description": "HR & Admin Manager\nLocation : Pioneer / Transport provided\nMon - Friday\nOffice hours\nJob Description :\n• To develop and implement overall Human Resource (HR) processes, procedures, and policies to ensure legal compliance with statutory employment and related laws and regulations.\n• Conduct annual employee appraisal and make relevant suggestions to the management.\n• Responsible for the full spectrum of daily HR operations including recruitment, such as conducting interviews and coordinating interviews for hiring managers.\n• Responsible for Tax Filing (IR8A, Appendix 8A, IR8S, IR21)\n• Assist with filing of employee (NS claims, maternity / paternity / childcare leave claims, Flexible Benefits Plan Claims, etc)\n• Assist to generate employee related letters e.g. certification letter, confirmation letters etc. Monitor and process of new hires confirmation, employment letter. Assist with the submission of government support training grants for clients as and when required.\n• Assist on... various work pass applications, renewal, and cancellations.\n• Assist with handling employee relations, grievance and other HR related duties and development initiatives.\n• Observe, review and suggest best practices for administrative workflows and office management for greater efficiency at workplace.\n• Responsible for the maintenance of workplace functionality, safety, and cleanliness\n• Act as a point of contact with regards to labour legislation issues and Ministry of Manpower Employment Practices, including participation in market surveys conducted by MOM, IRAS, CPF, WDA etc\n• Coordinate and organize team building and engagement activities.\n• Provide general office administrative support, including but not limited to involvement setting up of meeting rooms, replenishing stock for stationery and pantry refreshment, as well as booking of air ticket and hotel as and when necessary.\n• Any adhoc duties as assigned by the management.\nRequirements :\n• Candidate must possess at least Bachelor's Degree/Post Graduate Diploma/Professional Degree in Human Resource Management or equivalent.\n• Required language(s): English, Mandarin (In order to liaise with the Mandarin speaking associates)\n• At least 5 Year(s) of working experience in the related field is required for this position.\n• Preferably Manager specialized in Human Resources or equivalent.\n• Proficient in HR Information System Justlogin knowledge is an added advantage\nHOW TO APPLY:\nInterested applicants, kindly send your resume in MS WORD format to ref9@trustrecruit.com.sg or please click on “Apply Now” and provide the below details in your resume.\n1. Reasons for leaving ALL your employment\n2. Current and/or last drawn monthly salary (please provide breakdown)\n3. Expected monthly salary\n4. Availability\nWe regret only shortlisted candidates will be notified.\nImportant Note: Trust Recruit Pte Ltd is committed to safeguarding your personal data in accordance with the Personal Data Protection Act (PDPA). Please read our privacy statement on our corporate website www.trustrecruit.com.sg.\nTrust Recruit Pte Ltd\nEA License No: 19C9950\nEA Personnel: Joanne Wooi\nEA Personnel Reg No: R1878846", "extensions": ["6 days ago", "$5K–$6.2K a month", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time", "salary": "$5K–$6.2K a month"}, "job_id": "eyJqb2JfdGl0bGUiOiJIUiBBZG1pbiBNYW5hZ2VyIChXZXN0LyBUcmFuc3BvcnQgcHJvdmlkZWQvIFVwIHRvICQ2MjAwKSAvIERhaXJ5IHByb2R1Y3QiLCJjb21wYW55X25hbWUiOiJUUlVTVCBSRUNSVUlUIFBURS4gTFRELiIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiYjlGM3BBd1loVThUUUJyRkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JsdW0gU2luZ2Fwb3JlIiwibGluayI6Imh0dHBzOi8vc2cuam9ibHVtLmNvbS9qb2IvaHItYWRtaW4tbWFuYWdlci13ZXN0LXRyYW5zcG9ydC1wcm92aWRlZC11cC10by82MjMxMDQ/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Product Manager", "company_name": "Biqmind Pte. Ltd.", "location": "Singapore", "via": "via Monster Singapore", "description": "Currently, we are on the lookout for a Product Owner who is passionate\nabout designing and building cloud-native development tools. If you are\nexcited about working with cutting edge technologies, building unique\nproducts and a passion for all things tech and a desire to question all\nassumptions to make our products better across the board, we want to\nspeak with you.\n\nDoes this sound like you?\n• A maverick who has a keen eye for detail and thoughtful, data driven\napproach to hypothesis prior to drawing conclusions\n• Can transition from strategy formulation to execution and delivery\nwhile driving exceptional customer experience\n• Can collaborate extensively with engineering, technical marketing\nengineers, userexperience designers, and peer product managers to\nbuild a cohesive strategy and see through the execution\n\nWe are looking for a product owner who wants a new opportunity with an\ninnovative, product & services driven business. The ideal candidate can\ntake a project from start to... finish based on high level objectives.\nApplicants will be assessed on what they can do, not solely their\ncredentials. A portfolio of recent experience and a minimum of 5 years of\nwork experience would be preferred.\n\nHowever, if you are a talented inpidual seeking an exciting\nopportunity, we strongly encourage you to apply.\n\nABOUT BIQMIND\n\nWith the benefits of increased development speed and scalability,\ncloud-native is becoming the de-facto technology for software\ndevelopment.\n\nBiqmind provides specialist services and software tools to make\ncloud-native possible through technologies such as Biqmind CAPE,\nKubernetes and Red Hat OpenShift.\n\nOur mission is to make life easier for companies, teams and developers\nseeking to become cloud native. We enable the execution of new approaches\nand augment skills, closing the gaps in strategies designed to advance\ntransformation and application modernization efforts.\n\nBased in Singapore, we are an international team of passionate change\nmakers with perse experience across development, commercial and\noperations. As a new technology company, it is a fast-paced environment\nwith a healthy balance between independent contribution and\ncollaboration.\n\nLearn more about how Biqmind helps companies accelerate scalable solution\ndelivery and do more with less at www.biqmind.com.\n\nResponsibilities\n• Develop product strategy vision and roadmaps, with short, medium and\nlong-term features to achieve the vision\n• Bring new products to market by analyzing proposed product\nrequirements and product development programs; establishing time\nschedules with engineering and manufacturing\n• Champion and gain buy-in for the strategy and roadmap from partner\nteams through collaboration, documentation, and negotiation that\neffectively influences peers and senior management\n• Work with engineering, design, operations, finance and leadership\nteam to bring products to market and develop and grow business\nopportunities\n• Develop user experience goals, stories and requirements that will be\nused to drive product specifications\n• Drive overall Product roadmap\n• Work with Biqmind clients on best practice Product Ownership\nmethodologies for cloudnative development\n\nRequirements\n• Bachelors Degree required\n• 5+ years of Product Owner experience, including the ability to build,\nlead and work with cross-functional teams to deliver strategic\nobjectives\n• Experience with development tool product ownership with a strong user\nexperience emphasis\n• Strong technical background including cloud, docker, Kubernetes\ntechnologies\n• Negotiation and conflict management skills with the ability to\ninfluence and persuade partners to reach optimal decisions for the\nbusiness\n• Ability to think strategically and execute methodically\n• Possess a unique blend of business and technical savvy; a big-picture\nvision, and the drive to make that vision a reality\n• Strong written and verbal communication and presentations skills,\nwith demonstrated experience engaging and influencing senior\nleadership\n• Passion for problem solving in a fast-paced environment\n• Analytical and quantitative skills; experience using hard data and\nmetrics to back up assumptions and develop business cases\n• Passion for connecting and influencing people to drive towards a\nshared business goal\n• A strong project management background is key to manage varying\nlevels of complexity and timelines running concurrently over extended\nperiods of time\n• Strong product development through agile methodologies including\nscrum and Kanban\n• Ability to interact positively, clearly and professionally with peers\n• Flexible, open-minded, self-motivated, quick learner, initiative,\nreliable and a team player\n• Ability to multi-task, prioritize activities, work independently and\ncalmly under pressure\n\nPersonal Attributes\n• Highly analytical and passionate about technology\n• Excellent communicator with excellent written and verbal English\nlanguage skills\n• Flexible, open-minded, self-motivated, quick learner, initiative,\nreliable and a team player\n• Ability to multi-task, prioritize activities, work independently and\ncalmly under pressure\n• Highly responsible and independent, hands-on problem solver", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9kdWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJCaXFtaW5kIFB0ZS4gTHRkLiIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoidTRsZE1SUWY4cXNtc0VjZEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNb25zdGVyIFNpbmdhcG9yZSIsImxpbmsiOiJodHRwczovL3d3dy5tb25zdGVyLmNvbS5zZy9hbXAvam9iLXZhY2FuY3ktcHJvZHVjdC1tYW5hZ2VyLWJpcW1pbmQtcHRlLWx0ZC1zaW5nYXBvcmUtMjczMjE2NTEuaHRtbD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior Commodity Manager (Tooling)", "company_name": "Dyson", "location": "Singapore", "via": "via Jobs", "description": "About the role Manage the sourcing process of (Selected Commodity) Tooling Procurement to support New and Repeat Tool Purchase (Plastics and Metals) to support New Product Development (NPD). Ensuring completion to meet project/business needs and start of production. Execute Commodity Strategy and Standardization in collaboration with Tooling Engineering Organization. Ensure Strategy and Standardization for responsible commodity is executed to plan and manage deviations though clear communication and management review. Execute price benchmarking and develop Dyson Preferred Pricing and Cost Roadmap for high runners in commodity Ensure roll out of Dyson Preferred Pricing to Dyson Tooling Partners. Drive Lead Time and Service/Support Improvements from Tooling Suppliers to assist business needs. Manage the supplier selection and negotiation process, coordinating the relevant cross-functional team(s) and ensuring best value from the supply base. Ensure, following contract award, that... appropriate supplier relationship and performance management processes are deployed to effectively manage contract adherence & performance. Support a continuous improvement program to advance procurement processes, governance and capabilities across the group. Must be able to travel to Tooling Partners and Contract Manufacturers as part of work engagement, establishing excellent working relationships with both parties. Must gain first-hand experience on tool progress, partner capability and performance. Manage Supplier Performance, Quality and Delivery. Ensure Supplier Conform to Dyson Tooling Standards and Requirements to deliver excellent tooling on time, every time. About you Degree in Engineering AND/OR Tooling or Relevant Career Experience in related function. Experience with Tool Cost Simulation Software. (ie Siemens, Apriori…) MBA would be beneficial Supply Chain Management Certification (ie CSCP, CPIM, SCOR-P ….) Program Management Experience or PMP Certification 8-12 years’ experience in Tooling Sourcing and exposure to New Product Development and project milestone processes Work Experience in a relevant product category industry. Excellent problem solving and analytical skills: to be able to assess problems thoroughly and drive logical conclusions (i.e. common sense and not embarrassed to ask supposedly “silly” questions). Strong Integrity and Character to manage high level interaction with Internal and External Stakeholders Able to demonstrate ability to evaluated and determine correct costings. A proactive approach and are forward thinking. You think ahead and foresee issues and solutions. You plan your time and your projects taking relevant factors into account. Integrity and confidence under pressure – always presenting the facts no matter what the circumstances Benefits Dyson Singapore monitors the market to ensure competitive salaries and bonuses. Beyond that, you’ll enjoy a transport allowance and comprehensive medical care and insurance. But financial benefits are just the start of a Dyson career. Professional growth, leadership development and new opportunities abound, driven by regular reviews and dynamic workshops. And with a vibrant culture, the latest devices and a relaxed dress code reflecting our engineering spirit, it’s an exciting team environment geared to fuelling and realising ambition.#LI-DYSON", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQ29tbW9kaXR5IE1hbmFnZXIgKFRvb2xpbmcpIiwiY29tcGFueV9uYW1lIjoiRHlzb24iLCJjb21wYW55X21pZCI6Ii9tLzA1Y3NrZyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Ik9oNy1Eb195aGt1UGdJSlJBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVzc0JDb3dCUVU1VlgwNXhVMHQxUkhOSlZsWkZWR3hqU214dllVVjFiRlZpTFVaelozVnZTbWcxVnpKRlYxTTRlR0pLVTJaaU5VeFVVa2h6U2pSVWJYZHFjRVZDZFU1MWVHSXdWVGxMVGxGRmJsQXpTR1JpWmxSRVoxaFFSVU4zU1UxSVMwMWtYMEUwUWtKQmRWRTBWa3RRY1hjNVNGTmZkbDl1YXpFMlJ6WXhhVGMxYkVwMVdERk9ibTVRWTBkWVMyd1NGbFJZYlVOWlVFY3hUVGhVWkhSQlltNTBjblZKUWxFYUlrRlBUVmxTZDBKM1UxRm9NV3htYVZWMU1VMXlla1oxVjFCcVpEZDBTbDlZV2tFIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMzMiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9icyIsImxpbmsiOiJodHRwczovL3NnLmZpZGFudG8uY29tL2pvYnMvam9iLW9wZW5pbmcvbWFuYWdlcnMtYWxsLW90aGVyL3Nlbmlvci1jb21tb2RpdHktbWFuYWdlci10b29saW5nLTI3Nzg1MTM1OD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Deposits Product Manager - Group Wealth Management", "company_name": "OCBC Bank", "location": "Singapore", "via": "via Laimoon.com", "description": "As a Product Manager, your roles & responsibilities will include:\n• Providing thought and strategic leadership to achieve key deposit business performance targets, in areas such as of portfolio management, optimization of balance ratios, margins and revenues\n• Integrate data insights and analytics, customer feedback, product metrics, user experience research to drive product initiatives\n• Develop and launch digital initiatives and digital business opportunities and solutions that supports business objectives\n• Conceptualize, own and execute strategic product campaigns, launches\n• Liaise with key stakeholders to optimize current operational frameworks and to drive process improvement projects\n• Manage full spectrum of Singapore Dollar and Foreign Currency deposit products\n• Support product and service enquiries from frontline and support units\n• Ensure compliance to regulatory/audit/compliance issues through maintenance, update & revision of policies and... procedures\n\nQualifications\nRequirements:\n• University Degree\n• At least 6 years working experience, with 4 years relevant experience in product or digital or process management preferred\n• Self-starter who is able to work under timeline pressures and can multi task effectively\n• Proven track record of delivering projects (especially digital projects) quickly and valuably\n• Strong operational knowledge, with understanding of end to end product life cycle\n• Familiar with deposit related processes, systems, regulatory and risk frameworks\n• Ability to work effectively with other business units, across various functions\n• Ability to think strategically and implement effectively\n• Strong communication and interpersonal skills\nCorporate Banking", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEZXBvc2l0cyBQcm9kdWN0IE1hbmFnZXIgLSBHcm91cCBXZWFsdGggTWFuYWdlbWVudCIsImNvbXBhbnlfbmFtZSI6Ik9DQkMgQmFuayIsImNvbXBhbnlfbWlkIjoiL20vMDU1cjI3IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiVUo0aEgwWEhrVXl2NTY3REFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFZHcFBTWHB0V0VGRGFqYzFWR2hrVG1GS1ZYTkdhV1l0YkRBd2F6RTBWRlZmVDBseWNsUjFiM295ZUVwVFgwTkdaMUJoWjJab1lWbHJWWFptWVZCTWFuRnNUVEZzYkhCWU5UTTVWRmhXWmxONGMzSnRaMVJMZW5kemQyaFFXVWxxWDBFMlFrcDBaVnB4T0RkUFoyZHpWRkp1VTFwUlQyUlRRWGxvUkMxM1gxZGFiV3hNVVhCTU5GVnNOR0owZFVOeGFqVjFhbEUxVDNCWFgycG5FaFpVV0cxRFdWQkhNVTA0VkdSMFFXSnVkSEoxU1VKUkdpSkJUMDFaVW5kRVJtcE9PVmhTY0dWaWRIUnJkbFJVYWxKVVlreENUekp5T0RGMyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzQxIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExhaW1vb24uY29tIiwibGluayI6Imh0dHBzOi8vam9icy5sYWltb29uLmNvbS9qb2JzL2V4dGVybmFsdmlldy8yNTk4NTc5Mz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior Product Manager", "company_name": "EPAM Systems", "location": "Singapore (+1 other)", "via": "via Bayt.com", "description": "EPAM is committed to providing our global team of more than 41,150 EPAMers with inspiring careers from day one. EPAMers think creatively and lead with passion and honesty. Our people are the source of our success. We value collaboration, work in partnership with our customers, and strive for the highest standards of excellence. In today’s market conditions, we’re supporting operations for hundreds of clients around the world remotely. No matter where you are located, you’ll join a dedicated, diverse community that will help you discover your fullest potential.\nStriving for excellence is in our DNA. Since 1993, we have been helping the world’s leading companies imagine, design, engineer, and deliver software and digital experiences that change the world. We are more than just specialists, we are experts.\n\nDESCRIPTION\nWe are seeking a highly motivated Senior Product Manager with experience in deep tech and digital consulting. You will be working very close to the business partners, user... experience team and actively participating in to drive product development on behalf of our clients. As a Product Manager, you will guide products from the idea stage to full production and help to develop new ideas based on your industry experience and your contact with customers. Your primary focus will be delivering products that are valued by our clients.\n\nWe are looking for a goal-oriented, proactive individual who is comfortable with working in a fast-paced environment with an ability to drive a product from an early design concept to delivery. You must have expertise in business with a big-picture vision and the drive to make that vision a reality. You must enjoy spending time with customers to understand their problems and enjoy working with technical teams to develop innovative solutions. You'll need to be able to speak truth to power, supporting your decisions with data.\n\nAs technology-focused Senior Product Manager, you will work closely with clients and Business Unit Managers to understand product vision and goals and jointly work with developers and designers to prioritize, plan, and deliver software.\n\nWe Value\nValue the individuals – We encourage and motivate people to grow. We perceive our people as a source of our success;\nStrive for excellence – We strive for the highest standards of excellence and continuously learn. We take pride in our engineering and accomplishments;\nAct as a team – We treat one another with respect and encourage the best ideas to come from anywhere within the organization. We value our diversity;\nFocus on Customers – We build long term customer relationships, as we strive to always understand our customers' business and needs;\nAct with integrity – We operate legally, honestly and ethically. We take responsibility for our actions.\nResponsibilities\n• Act as a liaison between customer product management organization and EPAM\n• Work with leadership to align product vision with company strategy and business objectives\n• Work with business stakeholders to define the key personas and product capabilities\n• Identify and track strategic product objectives and key results (OKRs)\n• Develop and maintain long-term product roadmap of product releases, initiatives and capabilities\n• Work closely with business and technology teams to define a value-driven product release plan\n• Recommend and specify requirements for product capabilities supported by market research and on-going interaction with both customers and non-customers\n• Research and document the buyer's journey\n• Develop market-specific launch criteria for new product capabilities\n• Manage product milestones and communicate them to the stakeholders\nRequirements\n• Minimum qualification of Polytechnic Diploma in Computer Science, Software Engineering or related majors\n• 8+ years of experience as a software Product Owner or Product Manager\n• Deep tech, UX and experience consulting experience\n• Proven record of launching product (or key product functionalities) to the market\n• Previous experience and success working with Agile product development teams\n• Excellent interpersonal, communication and presentation skills\n• Ability to advocate: for the right thing in the face of the objection, for the user\n• Ability to influence decision making across a wide variety of roles and levels in the organization\n• Ability to work independently as well as part of a team\n• Ability to manage client expectations effectively\n• Ability to deal with ambiguity and thrive in a rapidly changing business environment\n• Ability to perform impact analysis, identify changes to business processes, perform testing, and effectively communicate with business\n• Product Management related certification is a plus\n• Active contributor in the product management community is a plus\n• Prior participation in complex product and service development that crosses upon multiple channels, digital and physical spaces in any role is a big plus\nWe offer\n• Friendly team and enjoyable working environment\n• Work-life balance and flexible schedule\n• Online training library, mentoring, career development and potential partial grant of certification\n• Unlimited access to LinkedIn learning solutions\n• Referral bonuses\n• Compensation for sick leave and paid time off\n• Opportunities for self-realization", "extensions": ["1 month ago", "Full–time"], "detected_extensions": {"posted_at": "1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgUHJvZHVjdCBNYW5hZ2VyIiwiY29tcGFueV9uYW1lIjoiRVBBTSBTeXN0ZW1zIiwiY29tcGFueV9taWQiOiIvbS8wZGxucmMiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiI2T0NMaVVFYV9hTXZYZDRXQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VW5WRGNVUm9kM2RLUkhGMFIxOUljalUwYkhwU1ltOVdaRkIxUWprNFYwZGtkRGxRTjFsclVsUlJkRU5TVVVGSmVWZG5RbDlWTTJvelJrdElRVjlpY1ZCcGEzRkhNMWxEUzB4dlIyRTJlbGxUVUd0U1lVZGtXWEZ3WTJ4ck9UQmtUVkJPYTNsaGIzWjNiV1YwT0ZKSk4yeGtNV1ZJWmpRd1dVSndkRkppV21Fd1lVcGhlREJ1ZG1VNVRXNDBiUzFzWDNkTFEySlpNM1pxUzBOUkVoWlVXRzFEV1ZCSE1VMDRWR1IwUVdKdWRISjFTVUpSR2lKQlQwMVpVbmREZG5VM2QxTkpVR2hQWDNOM0xYRjJkVWhUWlZkU1RTMUtVVEZCIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNDgiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQmF5dC5jb20iLCJsaW5rIjoiaHR0cHM6Ly93d3cuYmF5dC5jb20vZW4vc2luZ2Fwb3JlL2pvYnMvc2VuaW9yLXByb2R1Y3QtbWFuYWdlci01OTIyNTEyNC8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Product Manager", "company_name": "REVEZ", "location": "Singapore", "via": "via Jobsingapore24h.com", "description": "Job Summary\nAn independent contributor role responsible for developing end customers, channels and alliances and many others to meet the channel alliance relationships together with sales personnel and BU In-charge. This role will be responsible to understand, present and demo products, supporting to drive & establish new end customers and build long term strategic relationships with possible channel and alliance partners through GTM strategy for the Cyber Security distribution business.\nDuties & Responsibilities\nBusiness unit “Cyber Security”\n• Understand, present and demo products held under this business unit.\n• Together with sales personnel and BU In-charge, this role will also be responsible on quarterly and annual sales revenue achievement based on the Alliance resale of product and platform offerings.\n• Supporting to drive & establish new and existing end customers sales through GTM strategy\n• Identify new channel partners and develop/manage existing partners.\n• Establish and... build channel partners build (pre)Sales / Sales and Post Sales capacity and capability on product and platform offerings.\n• Provide and manage channel partner onboarding and training program. Drive training and certification in partner ecosystem.\n• Participate in tender/RFQ/RFP/RFI\nJob Holder’s Specifications\n• 5+ years of sales experiences in the IT industry; experiences in sales or presales of Cybersecurity products and platforms would be highly advantages.\n• Knowledge in Application layer and cybersecurity\n• Track records of end customers networks.\n• Experience in business development planning and execution to drive sales pipeline, demand-gen, and enablement with channel partners.\n• Market knowledge and understanding (IT industry, Cybersecurity Domain, Trends, Vertical market industries, etc.).\n• Effective communication and presentation skills at executive level with fluent English and Mandarin.\n• Strong communication and negotiation skills with good business acumen.\n• Able to perform well in a fast pace and high ambiguity environment.\n• University and above in IT, Business IT, Business Administration, or a related field, or equivalent work experience", "extensions": ["Over 1 month ago", "Contractor"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Contractor"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9kdWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJSRVZFWiIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiMVFrdG91SjlsMk5tTk1rekFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzaW5nYXBvcmUyNGguY29tIiwibGluayI6Imh0dHBzOi8vam9ic2luZ2Fwb3JlMjRoLmNvbS9zYWxlcy1jaGFubmVsLWFsbGlhbmNlcy1tYW5hZ2VyLWpvYjUxODM0P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "PLANT MANAGER - FOOD MANUFACTURING ($10K to $13K/ MNC)", "company_name": "People Profilers Pte Ltd", "location": "Singapore (+1 other)", "via": "via JobsCentral", "description": "- Salary: $10,000 to $13,000\n\n- AWS + Variable Bonus\n\n- Reputable MNC\n\nHeadquartered in Europe, my client is one of the largest-growing beverage production company in the market. They are gaining significant tract in Asia Pac region and they are in the midst of commissioning their manufacturing plant site in Singapore. With this, they are seeking for an experienced Plant Manager with an entrepreneurial spirit\n\nResponsibilities:\n• Reporting to the APAC Director, you are to spearhead and coach the Singapore plant site team\n• Championing of EHS and developing the culture of proactive identification and reporting of behaviours and near misses\n• Ensuring production are in accordance to Halal Certification, HACCP policies and procedures\n• Ensures employees follows SOP in place for operations and to update and review SOP as necessary\n• To respond to all plant emergencies\n• To support New Product Development of products.\n• To work with Engineering division on problem solving plant issues and... on development of Capital Plan and people Development.\n• Ensuring operating procedures are updated for process changes, new product introductions, and new equipment installations.\n• Work with Quality Manager on investigation of customer complaints cases\n• To identify opportunities within Operating Equipment Effectiveness, Improve Cycle Time, Capacity, and Yield performance\n• Ensuring good workflow between Production and Supply Chain\n• Ensuring good communication between other stakeholders and the plant\n\nRequirement:\n• At least a Degree in Food Science, Chemistry, Engineering or related\n• At least 5 years’ experience in food or beverage manufacturing environment or nutrients manufacturing environment or related environment\n• At least 2 years’ experience in manufacturing managerial role.\n• Knowledge in Lean Six Sigma and HACCP\n• Strong entrepreneur spirit with good leadership and interpersonal skills\n\nAll Successful candidates can expect a very competitive remuneration package and a comprehensive range of benefits.\n\nKindly email your resume in a detailed Word format to\n\n[Click Here to Email Your Resume]\n\nJob ID: 47VY6V\n\nWe regret that only shortlisted candidates will be notified\n\nPeople Profilers Pte Ltd\n\n11 Collyer Quay, The Arcade, #13-01, Singapore 049317\n\nEA License Number: 02C4944\n\nRegistration Number: R1217882\n\nPosting Personnel: Yeo Yi Rong", "extensions": ["4 days ago", "$10K–$13K a month", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time", "salary": "$10K–$13K a month"}, "job_id": "eyJqb2JfdGl0bGUiOiJQTEFOVCBNQU5BR0VSIC0gRk9PRCBNQU5VRkFDVFVSSU5HICgkMTBLIHRvICQxM0svIE1OQykiLCJjb21wYW55X25hbWUiOiJQZW9wbGUgUHJvZmlsZXJzIFB0ZSBMdGQiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IlVTN1NwNGNYRkdnQWU3NzZBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9ic0NlbnRyYWwiLCJsaW5rIjoiaHR0cHM6Ly9qb2JzY2VudHJhbC5jb20uc2cvam9iL3BsYW50LW1hbmFnZXItZm9vZC1tYW51ZmFjdHVyaW5nLTEway10by0xM2stbW5jLWozczB3ejc3eDRnd2I5aG10OHA/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Management", "value": "GC18"}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Business Operations", "value": "GC06"}, {"text": "Advertising and Marketing", "value": "GC03"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Accounting and Finance", "value": "GC01"}, {"text": "Legal", "value": "GC17"}, {"text": "Farming and Outdoors", "value": "GC13"}, {"text": "Human Resources", "value": "GC15"}, {"text": "Sales and Retail", "value": "GC26"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "Product manager", "value": "product manager"}, {"text": "Manager", "value": "manager"}, {"text": "Project manager", "value": "project manager"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Development manager", "value": "development manager"}, {"text": "Director", "value": "director"}, {"text": "Manufacturing manager", "value": "manufacturing manager"}, {"text": "Marketing manager", "value": "marketing manager"}, {"text": "Plant manager", "value": "plant manager"}, {"text": "Production manager", "value": "production manager"}, {"text": "Program manager", "value": "program manager"}, {"text": "Regional", "value": "regional"}, {"text": "Senior", "value": "senior"}, {"text": "Sr. manager", "value": "sr. manager"}, {"text": "Account manager", "value": "account manager"}, {"text": "Admin manager", "value": "admin manager"}, {"text": "Affairs manager", "value": "affairs manager"}, {"text": "Assistant", "value": "assistant"}, {"text": "Brand manager", "value": "brand manager"}, {"text": "Commodity manager", "value": "commodity manager"}, {"text": "Communication", "value": "communication"}, {"text": "Customer", "value": "customer"}, {"text": "Dealer", "value": "dealer"}, {"text": "Devops engineer", "value": "devops engineer"}, {"text": "Engineering", "value": "engineering"}, {"text": "Executive", "value": "executive"}, {"text": "Product specialist", "value": "product specialist"}, {"text": "Production supervisor", "value": "production supervisor"}, {"text": "Risk manager", "value": "risk manager"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Transactional", "value": "transactional"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Internship", "value": "INTERN"}, {"text": "Part-time", "value": "PARTTIME"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Toiletries", "value": "/business/naics2007/3256"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Foods & Beverages", "value": "/business/naics2007/311"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Management", "value": "/business/naics2007/55"}, {"text": "Research", "value": "/business/naics2007/5417"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "Citi", "value": "/m/01dfb6"}, {"text": "Binance", "value": "/g/11hcz1r4wl"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "Amazon", "value": "/m/0mgkg"}, {"text": "Standard Chartered", "value": "/m/02hszk"}, {"text": "United Overseas Bank", "value": "/m/04gjd1"}, {"text": "Apple", "value": "/m/0k8z"}, {"text": "Tata Communications", "value": "/m/04338k"}, {"text": "Workato", "value": "/g/11dxpy_3xd"}, {"text": "BNY  Mellon", "value": "/m/02vps5x"}, {"text": "DBS Bank", "value": "/m/01q7n5"}, {"text": "EPAM Systems", "value": "/m/0dlnrc"}, {"text": "GVT Government Technology Agency (GovTech)", "value": "/g/11gh0528nq"}, {"text": "Grab", "value": "/m/0134c_p9"}, {"text": "Paypal", "value": "/g/122s91_5"}, {"text": "PeopleSearch Pte Ltd", "value": "/g/11c73ngn0w"}, {"text": "Randstad", "value": "/m/08pt1z"}, {"text": "Singapore Airlines", "value": "/m/015f2x"}, {"text": "TEKsystems (Allegis Group Singapore Pte Ltd)", "value": "/g/11b6g4bkv0"}, {"text": "ABBOTT LABORATORIES (SINGAPORE ) PRIVATE LIMITED", "value": "/m/09m57z3"}, {"text": "ADVANCE INTELLIGENCE PTE. LTD.", "value": "/g/11dymfkxss"}, {"text": "AXA", "value": "/m/04mn99"}, {"text": "Adecco Personnel Pte Ltd", "value": "/m/08gz46"}, {"text": "Adidas Group", "value": "/m/01jtml"}, {"text": "Aetna, a CVS Health Company", "value": "/m/0kg8x"}, {"text": "Agency for Science, Technology and Research", "value": "/m/0gmjcg"}, {"text": "Alibaba", "value": "/m/07s6ctl"}, {"text": "Argyll Scott", "value": "/g/11dxpk2374"}, {"text": "Autodesk", "value": "/m/018nm3"}, {"text": "Barry Callebaut", "value": "/m/03clky2"}, {"text": "BioMind", "value": "/g/11dymfr2l6"}, {"text": "CHUBB ASIA PACIFIC PTE. LTD.", "value": "/m/09m8xyh"}, {"text": "Cargobase", "value": "/g/11dxppfsjn"}, {"text": "Cargobase Pte Ltd", "value": "/g/11fy240nxm"}, {"text": "DKSH", "value": "/m/0dj2nh"}, {"text": "Dathena", "value": "/g/11dxprdn6y"}, {"text": "Dyson", "value": "/m/05cskg"}, {"text": "Enggsol Pte Ltd", "value": "/g/11g9mnfmm1"}, {"text": "Ethos BeathChapman", "value": "/g/11c73z0xm0"}, {"text": "Eu Yan Sang", "value": "/m/03cl9hn"}, {"text": "Flintex Consulting Pte. Ltd.", "value": "/g/11h1z41pzb"}, {"text": "GIVAUDAN SINGAPORE PTE LTD", "value": "/g/11f00wn519"}, {"text": "Goldman Sachs", "value": "/m/01xdn1"}, {"text": "GovTech Singapore", "value": "/g/11dxpkfs_6"}]}]}