{"search_metadata": {"id": "60827ace66d81f7ce447c2bc", "status": "Success", "json_endpoint": "https://serpapi.com/searches/b440e4a2de1abaee/60827ace66d81f7ce447c2bc.json", "created_at": "2021-04-23 07:44:14 UTC", "processed_at": "2021-04-23 07:44:14 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28solution+architect%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=150", "raw_html_file": "https://serpapi.com/searches/b440e4a2de1abaee/60827ace66d81f7ce447c2bc.html", "total_time_taken": 2.59}, "search_parameters": {"q": "(solution architect) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "150"}, "jobs_results": [{"title": "Technical Architect - SAS", "company_name": "Azendian Solutions Pte Ltd", "location": "Singapore (+1 other)", "via": "via Monster", "description": "• Install, configure, test, deploy and administer SAS platform for our client.\n• Delivers technical architecture related information, leads technical discovery sessions, responds to architecture and infrastructure questions when necessary.\n• Produce detailed solution architectures to be implemented in our client’s hosting locations.\n• Communicate recommendations regarding hardware specifications, networking requirements, and storage sizing to business stakeholders.\n• Interact with principal software Technical Support to verify and discuss issues around specific architectures at client sites.\n• Ability to create and assess project artifacts including Visio diagrams, non-functional requirements, and detailed solution architecture.\n• Provide architectural and big-picture oversight for development of client implementations.\n• Provide assessments and recommendations on the design of data and analytics systems, while integrating components built by developers and ensuring architectural... integrity of the system\n• Prepare the Test Plans and conduct Software Test.\n• Stay up to date with industry standards and technological advancements that will improve the quality of the data products.\n• Be part of highly skilled team, working on high-impact government projects", "extensions": ["Over 1 month ago", "Contractor"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Contractor"}, "job_id": "eyJqb2JfdGl0bGUiOiJUZWNobmljYWwgQXJjaGl0ZWN0IC0gU0FTIiwiY29tcGFueV9uYW1lIjoiQXplbmRpYW4gU29sdXRpb25zIFB0ZSBMdGQiLCJjb21wYW55X21pZCI6Ii9nLzExZHhwdmNqajIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJnZGtURGJ5a0lFVkltdE1NQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFb3dDQ3N3QlFVNVZYMDV4VTNSWWJsTlVUVmwxZUZWVGFtazNWbEo2TTNSbk1DMUZWekJ5YzJwWlp6UlpaWEZMYUZoT1IzZFFNRzk1Vm0xV1lsOVJZekpXU0dSaFQxSkhVM2d6VDNrNGFGUXpVM1ZtUkVGSFIzcDZOVXBvVms4NVFXTndSekJyY0hBM09IcGliblZtUld0U1JsTTFTRzFoT0hOWGRXbEViVWhpWVU4eWJIQk1NVkJYYkZSaGNGRTFaR1pXVW1JeVVIRTJZMlUxU1c1amRtaG9SVWRUVTJsTVRVOUxkalJqVm5KaE1XWlVlbHAwT1dvdFNXcHJiRTlxUm5wMVgxTlFiWFp6T1ZGT1gzTXRaa3RKRWhkNk0zRkRXVTB6U2tkWlMyazFUbTlRYVhaeGJYbEJTUm9pUVU5TldWSjNRazk2YlhkNVozVmxNbnBSWmxrdFpGcHFTV3BpYm5aVGFVeE1kdyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzciLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTW9uc3RlciIsImxpbmsiOiJodHRwczovL3d3dy5tb25zdGVyLmNvbS5zZy9qb2IvdGVjaG5pY2FsLWFyY2hpdGVjdC1zYXMtYXplbmRpYW4tc29sdXRpb25zLXB0ZS1sdGQtc2luZ2Fwb3JlLTE2NDE5NzY/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Senior Consultant, Partner-led Solutions (Pega)", "company_name": "Singtel Group", "location": "Singapore", "via": "via Singtel Careers", "description": "Pega Developer is responsible in defining system-level architecture that includes Pega application architecture, Best practice in Pega, Integration guideline and standards with external systems, Logical Data Modeling, Release and Deployment strategy\n• Maintain control over the architect throughout the project to ensure the desired results are achieved\n• Provide thought-leadership to client across business and technical project dimensions solving complex business requirements and technical solutions. Leads the technical review and discussion with Customer\n• Be an integration Solution Architect of the project and work with other architects/engineering team on overall System Architecture of the system, incl. Infra/Security/Client ITD/FM support teams, etc.\n• Provides architecture and design guidance to project teams on the methodology of Pega Implementation. Ensure best practices, frameworks and re-useable components are employed in the project\n• Develops and demonstrates an advanced... knowledge of the Pega Architecture and all Pega design and implementation features\n• Works in conjunction with Project Manager to size, manage scope and risk\n• Accountable for ensuring the business and technical architecture of the delivered solution matches customer technical and functional requirements, and commits to Customer Success (realization of business benefit)\n• Hands-on in development and documentation\n• Build COE of Pega Practice\n\nThe ideal candidate should possess:\n• Degree in Computer Science / Computer Engineering / Information Technology related field, or IT equivalent.\n• Typically 5-8 years’ experience in technical role with responsibilities that apply in-depth knowledge of architectural principles and design.\n• Experience in developing and deploying complex scalable production applications on Cloud/PaaS platforms and Containers.\n• Working knowledge of Pega software development tools and methodologies.\n• Broad and deep knowledge in current IT technologies.\n• Proficiency in Pega-related technology specification and standards.\n• Certification in appropriate technologies is an advantage.\n• Self-motivated with a positive “can-do” attitude, creative with excellent presentation, communication, negotiation and interpersonal skills including strong persuasive techniques.\n• Ability to lead, develop and maintain respectful and trusting relationship", "extensions": ["8 days ago", "Full–time"], "detected_extensions": {"posted_at": "8 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQ29uc3VsdGFudCwgUGFydG5lci1sZWQgU29sdXRpb25zIChQZWdhKSIsImNvbXBhbnlfbmFtZSI6IlNpbmd0ZWwgR3JvdXAiLCJjb21wYW55X21pZCI6Ii9tLzAyMHpmbCIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IkR2V2NYb1JnclBmNnJvdDdBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1SUJDcUlCUVU1VlgwNXhVVVJwYlU5WVFqQlZUMk5TUmtwVlFWVldibEJWVkhwNFdVVnhTblkzYWkxNE9HZDVhWE4yTUVJMGJGbElVaTFXU25WeWFFbzNWSFJXYmtsU00xVm9iMDV3WjIxc2FHZHhjMVJHZDJaa1pFNU5ibWt3Y1dGMFIzRTBURUZ6YWpkWFIwTnZNRkppV2xkME5VeHVjVFZ6VjFsUVkwb3RabTlFU1dSMlUyNVBObmt4YldaRlVFMHdiMjR3UVZaMFoyVkJkRlJSZDFSb1IzWlpiemhuRWhkNk0zRkRXVTB6U2tkWlMyazFUbTlRYVhaeGJYbEJTUm9pUVU5TldWSjNSRW95U1VoVUxXdHVTSGRPU1dsQ1dFSnNRV3R2ZG5SemRuaE9RUSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzE1IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFNpbmd0ZWwgQ2FyZWVycyIsImxpbmsiOiJodHRwczovL2dyb3VwY2FyZWVycy5zaW5ndGVsLmNvbS9qb2IvU2VuaW9yLUNvbnN1bHRhbnQsLVBhcnRuZXItbGVkLVNvbHV0aW9ucy0oUGVnYSktU2luZy81ODA0NTgxMTAvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Solution Architect", "company_name": "NEWBRIDGE ALLIANCE PTE. LTD.", "location": "Singapore", "via": "via LinkedIn", "description": "An exciting opportunity is waiting for you in the newly set up Digital team, who will spearhead the digital transformation efforts of the retail group.\n\nYou will be working on Commercial and Operational digital applications and projects that will transform our business and bring customer experience to greater heights.\n\nYou will be working in squads with fellow enthusiasts, re-imagining how we serve our connected customers.\n\nAs a digital disrupter, you’ll recreate and redefine our business to generate a lasting competitive advantage, focusing on building the applications for existing / new digital products.\n\nYou Will Be Responsible For The Below Areas\n• Work with Product Owner(s) to translate business requirements to technical requirements, including establishing delivery timelines and deliverables.\n• Draw up the technical architecture based on the user stories established from the business requirements.\n• Propose technical solutions from high level to details for system integration in... the complicated application system.\n• Manage day-to-day activities of the team/squad, including creating, prioritizing, and managing the backlogs of activities.\n• End-to-end project delivery experience in an agile manner.\n• Assess, define, implement and support world-class Agile transformation programs.\n• Manage and coach a team of tech developers.\n\nRequirements\n• A bachelor’s degree in relevant computer science, engineering, information technology, or related field.\n• 10 years of the delivery lead experience with hands-on experience in solution architecture, delivering agile projects (planning, execution, and team management) as well as managing a team of tech developers.\n• Possess one or more of the following certifications: (1) Certified Scrum Professional, or (2) SAFe Program Consultant, Lean Methodologies\n• Able to solve complex development problems and produce the highest quality code while striving to push the technical boundaries of online applications.\n• Experience with web scripting languages such as PHP, Javascript, or Python", "extensions": ["7 days ago", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2x1dGlvbiBBcmNoaXRlY3QiLCJjb21wYW55X25hbWUiOiJORVdCUklER0UgQUxMSUFOQ0UgUFRFLiBMVEQuIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJhWEVGSk9oWDZFd1JKaEtOQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExpbmtlZEluIiwibGluayI6Imh0dHBzOi8vc2cubGlua2VkaW4uY29tL2pvYnMvdmlldy9zb2x1dGlvbi1hcmNoaXRlY3QtYXQtbmV3YnJpZGdlLWFsbGlhbmNlLXB0ZS1sdGQtMjUwNjkzMjg0MD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Salesforce Business Solutions Architect (BB-07FBC)", "company_name": "WILHELMSEN SHIPS SERVICE (S) PTE. LTD.", "location": "Singapore", "via": "via BeBee", "description": "Roles & ResponsibilitiesJoin our global team for a career filled with opportunities to solve challenges both small and large, local and global, simple and complex.Who you are : As our Salesforce Business Architect, you must be self-driven and willing to roll up your sleeves as well as be able to provide high level concepts. You must be a practitioner on the Salesforce platform to ensure that future solutions are in line with business expectations, enterprise architecture standards and customer experiences. In addition to this, we are looking for below requirements as well : 3 years experience as a Solution Engineer on Salesforce platform. Desirable, certified Platform Developer I or sound understanding and demonstrable experience developing custom solutions with the Salesforce Platform (Apex, Lightning and Visual Force Pages). Outspoken and able to engage in dialogue with stakeholders at all levels, from employees to senior executive management Experience with designing point-to-point... integration solutions Experience with customer facing problem solving and interactions What you will be doing :In the role of Salesforce Business Architect, you will be responsible to take our solution to the next level. As an internal IT consultant, you will closely cooperate with and be the linking pin between business stakeholders and our global IT division. What your day might look like : Manages our Salesforce application ensuring that it meets the current and future needs of the business and generates value while maintaining operational excellence. Works across functions to deliver best practice solutions aligned with the Salesforce application and the increased adoption of automated solutions. Provides direction on the applicable components to be used - out-of-the box, configured, customised – aligning to the business and organisational objectives Provide insight into the Salesforce feature roadmap and recommends components aligning with the operational requirements. Hands-on responsibilities for maintaining and implementing customer integrations. The work location for this position is Singapore, but you must be willing and able to travel as well. Does the above sound interesting to you and you see yourself thrive in this role? Let us know why you are our new Salesforce Business Architect but submitting your CV and motivation letter.Tell employers what skills you haveEnterprise Certified Developerdesignedchallengingplatformcustomer mindedintegration solutionOracle Apex", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTYWxlc2ZvcmNlIEJ1c2luZXNzIFNvbHV0aW9ucyBBcmNoaXRlY3QgKEJCLTA3RkJDKSIsImNvbXBhbnlfbmFtZSI6IldJTEhFTE1TRU4gU0hJUFMgU0VSVklDRSAoUykgUFRFLiBMVEQuIiwiY29tcGFueV9taWQiOiIvZy8xMWc5bjVraF9uIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiTFpRU3Z4REdyam5NSG5oRUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXJjQ0N2Y0JRVTVWWDA1eFVVb3dTSHB6ZDBwdk5YSXpOVFZDTWpCMlowZ3hia1p2Y201clUwMTJObk5MUkRKVmRqZEhjbFk1Y1ZvMlJuWm9WMnQwYzFSWmJWSnZYMWMxZW5WWE1IaERUWE5yZWtoaGMxSmZkbWh3WVV4ak9YcGhia2R1TjBVMFlUaG9SRmcwVVhaVlNtdE1WR1JoWVVadlJFVjJXV0Z2Tm5KTFowOUhNemxuVGtGTWNHTmFTVU4yWmpoNlExQnZWazFvT1dJNFpFeFhVVTgyWTFCd1VtNU1UVTUxUjBKcVRGOTZlRGwwYjFJeFJXMTNXSGR1V0UxdVNFUmZVamhrWm1wNVltSXdNM2hpZUhrdGJWUTRVVUYzWWpjMVRFeEthWEJZZVRjeFNEQmliMnBWUlhOSmNuRnJRbGcxWWt0SFpESklVMUExWXhJWGVqTnhRMWxOTTBwSFdVdHBOVTV2VUdsMmNXMTVRVWthSWtGUFRWbFNkMFJuUm1GZmFIWldXVkpoVlU1bFdIWXRVVzVuZEVGelZXbDNSa0UiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18yNiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCZUJlZSIsImxpbmsiOiJodHRwczovL3NnLmJlYmVlLmNvbS9qb2IvMjAyMTA0MTctZDY3YThkZDE3MTdlYzYyYzkyMjk3YjYwMjE0MDdmYmM/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Cloud Architect", "company_name": "Tata Consultancy Services", "location": "Singapore", "via": "via Neuvoo", "description": "Job Description\n• Expert level hands-on working knowledge on at-least one of the cloud platforms - AWS, Azure, GCP, Alibaba, VMware with fundamental knowledge of the rest\n• Skill spectrum covering cloud IaaS, PaaS and SaaS with experience in designing for container-based deployment (Docker, K8 or similar)\n• Architectural breadth across other infrastructure domains - Cloud networking, storage, backup, databases and cybersecurity\n• Thorough understanding of assessment methodologies to develop fit for purpose enterprise cloud strategy\n• Good experience with CI/ CD automation tools, preferably cloud agnostic\n• Led and successfully delivered at-least one end to end large scale enterprise cloud architecture, design, build or migration project with multi tier applications\n• Relevant expert level cloud or architecture certifications\n• Relevant experience (at least 2yrs+) in creating architectural & design artefacts and securing endorsements from design boards/authorities", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDbG91ZCBBcmNoaXRlY3QiLCJjb21wYW55X25hbWUiOiJUYXRhIENvbnN1bHRhbmN5IFNlcnZpY2VzIiwiY29tcGFueV9taWQiOiIvbS8wMXBzeDgiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJhekV3c1hIQ245SFpLNG9XQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFb3dDQ3N3QlFVNVZYMDV4VTFobk5tczJlbmhCWlVGQ2VGUTVlbmxtTkhkNmNHa3djVkpXVW0xQlkzQktjWFp4UlROblVYVjJhV2hmVm05Q2QwOU5ha2wwVFY5d1YwVkpiV1pITTBSVGRFeHNXbTlJUVZsb1VXUkViM0UzVTJWWVZFNUxaak5XVFdKT1JFUkJVVnBwTkZsQ1psWm1NV2xuVUdoUFpVcHVRWFZoTUZWelluZGZUbVU0T0dWelVXSnZkRzVGWkZKa1dsOVRXRW8wY20xS2NtUTNNa050YVhWaWMyOU5kWEI0Y25wM1ZqZFdXbkZSTjB0dE5tbFhVV1l0TjJsZlpHRlBOWHBoV21zeFZHcEZUbDlpRWhkNk0zRkRXVTB6U2tkWlMyazFUbTlRYVhaeGJYbEJTUm9pUVU5TldWSjNRWG81YTNad1dEUTNlazR5TUdGNWExcGtOazlYU0UxQ2RuVTRadyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzMzIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE5ldXZvbyIsImxpbmsiOiJodHRwczovL3NnLm5ldXZvby5jb20vdmlldy8/aWQ9NjAwM2Q4NGVjYzMxXHUwMDI2dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Cloud Architect", "company_name": "NTT Singapore Digital Talent Services Pte. Ltd", "location": "Singapore", "via": "via Jobs | Fidanto", "description": "Key Responsibilities:\n• Designs, develops, implement and maintains IT solutions for clients within an agile development lifecycle.\n• Contribute to planning, design, implementation, testing, operations and process improvement.\n• Develops high-quality, efficient, IaaS and PaaS components to meet business requirements and in accordance with industry best practices.\n• Drive cloud security and compliance requirements into the cloud architecture framework, including for the data integration points with on-premise and other cloud systems.\n• Define and document the cloud reference architecture and drive its implementation across all the cloud components.\n• Participates in development of technical solution addressing business issues.\n• Participates in requirements discussions and meetings as necessary.\n• Generates statistics and prepares reports for management and/or team members on the status of the project.\n• Strong customer focus, ownership, ability to dive deep into customer requirements... navigate through ambiguity and undefined problems.\n\nRequirements:\n• Strong experience (5+ years) with Amazon Web Services, Azure or Google Cloud Platform and all supporting technologies\n• 5+ years of experience in DevOps, SecOps, or SysOps in a large enterprise environment. Should have executed critical projects at Enterprise level in terms of DevOps, automation and migration design approach model.\n• Experience working with Automation tools, Cloud management tools\n• Knowledge of federated authentication and authorization models\n• Expertise in troubleshooting very complex distributed environments, including following stack traces back to code and come up with a good root cause\n• Familiarity with IP networking concepts such as VPN, DNS, load balancers, firewalling.\n• Experience with on-premises infrastructure as well as public and hybrid cloud methodologies.\n• Troubleshoot and debug infrastructure, network, and operating system issues.\n• Extensive experience in multiple operating systems - UNIX, Windows, LINUX\n• At least one Certification required - AWS (Solution Architect), AZURE (MSCE Cloud Expert), Google (Certified Data Engineer, Certified Cloud Admin).\n• Strong work ethic and a desire to help drive a successful architectural vision across the projects\n• Ability to rapidly assimilate new information and new techniques.\n\nNotice:\nWe regret that only short-listed candidates will be notified. All applications will be treated with the strictest confidence.\nIn compliance with the Personal Data Protection Act (PDPA), and in line with our commitment to protect candidates' personal data, we have ceased to collect, process or use NRIC numbers during our screening and job application process. Kindly ensure that the resume you are providing to us does not contain your NRIC details. Thank you", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDbG91ZCBBcmNoaXRlY3QiLCJjb21wYW55X25hbWUiOiJOVFQgU2luZ2Fwb3JlIERpZ2l0YWwgVGFsZW50IFNlcnZpY2VzIFB0ZS4gTHRkIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJua3UwajBDajl5WThBbnpPQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnMgfCBGaWRhbnRvIiwibGluayI6Imh0dHBzOi8vc2cuZmlkYW50by5jb20vam9icy9qb2Itb3BlbmluZy9jb21wdXRlci1zeXN0ZW1zLWVuZ2luZWVyc2FyY2hpdGVjdHMvY2xvdWQtYXJjaGl0ZWN0LTI3NTMzNTU3OT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Solution Architect High Performance Computing - HPC", "company_name": "Amazon Web Services Singapore Private Limited", "location": "Singapore (+1 other)", "via": "via Monster", "description": "Are you passionate about High Performance Computing (HPC)? Are you ready to advance the state-of-the-art by developing methods for running HPC workloads on the cloud? Amazon Web Services (AWS) is seeking an HPC-focused Solutions Architect to work with our customers to craft cloud-based HPC solutions. Cloud computing has the potential to take on the biggest HPC challenges. Do you want to learn the very latest in cloud technologies and apply them to some of the most interesting computing workloads in the world? The AWS Global Specialized Sales Organization’s Specialized Solutions Architecture team works with customers of all types around the globe on these types of hard problems.\n\nAt AWS, we're hiring highly passionate and deeply technical HPC professionals to work with our Solutions Architecture team on key customer and partner engagements. Our HPC specialists deliver architecture guidance, lead proof-of-concept projects and conduct customer workshops. AWS specialists collaborate with... customers and partners to tackle challenges, implementation and the migration of customer applications and workloads onto AWS. As an HPC specialist, you will drive cloud adoption.\n\nYour broad responsibilities include: owning the technical engagement and ultimate success around specific implementation projects. You should be as comfortable discussing complex technical details with a room full of engineers as you are briefing an executive audience. In addition, you will engage with other AWS service teams, solutions architects, partner and professional services organizations to drive large and highly complex sales opportunities to closure.\n\nDo you have that special combination of deep technical knowledge, drive to create new technology, and strong interpersonal skills? As a trusted customer advocate, you will help organizations understand best practices around advanced cloud-based solutions. You will have the opportunity to help shape and execute a strategy. The ideal candidate must be self-motivated with a proven track record of customer obsession and delivering results. The ability to connect technology with measurable business value is critical to a solutions architect. You should also have a demonstrated ability to think strategically about business, products, and technical challenges in HPC.\n\nAmazon aims to be the most customer centric company on earth. Amazon Web Services (AWS) provides a highly reliable, scalable, low-cost infrastructure platform in the cloud that powers critical applications for hundreds of thousands of businesses in 190 countries around the world.\n\nResponsibilities\n• Design Customer Solutions\nCollaborate with the wider AWS teams to help customers and partners architect HPC Solutions that leverage AWS services and technologies\n• Engage with Solution Architects, Account Managers, Professional Services, and Partners to define HPC Engagement strategies for the Asian Pacific & Japan customer base\n• Provide leadership on solutions that benefit customers through the use of AWS services. This takes the form of contribution to external publications such as the AWS Compute Blog, whitepapers and reference architectures, as well as internal training of Solutions Architects, Professional Services Consultants, Technical Account Managers, and AWS Training and Development.\n• Assist solution providers with the definition and implementation of technical and business strategies.\n• Capture and share best-practice knowledge among the worldwide AWS solution architect community\n\nBasic qualifications\n• 10 or more years’ experience with large-scale workloads in Life Sciences, Media and Entertainment, Electronic Design Automation and/or Financial Services\n• Experience developing and deploying HPC applications on a large scale.\n• Deep understanding of management and performance optimization techniques associated with large-scale computing systems\n• Strong verbal and written communications skills are a must, as well as the ability to work effectively across internal and external organizations and virtual teams.\n\nPreferred qualifications\n• Working knowledge of HPC schedulers and distributed/parallel file systems, underlying IT systems, and the HPC development process\n• A demonstrated ability to script or code in python, ruby, bash, perl, c, FORTRAN, or java\n• Demonstrated effectiveness working across multiple business units to achieve results\n• An advanced degree in engineering, the sciences, computer science, or related discipline\n• Experience in a customer-facing, sales-aligned role such as consultant, solutions engineer or solutions architect\n• A proven track record in field of interest with publications and conference attendance\n• Hands-on experience with a broad range of HPC ISV applications\n• Experience and comfort with public speaking, potentially to very large audiences\n• Experience deploying production workloads on the AWS platform\n• Understanding of application, server, and network security", "extensions": ["22 days ago", "Full–time"], "detected_extensions": {"posted_at": "22 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2x1dGlvbiBBcmNoaXRlY3QgSGlnaCBQZXJmb3JtYW5jZSBDb21wdXRpbmcgLSBIUEMiLCJjb21wYW55X25hbWUiOiJBbWF6b24gV2ViIFNlcnZpY2VzIFNpbmdhcG9yZSBQcml2YXRlIExpbWl0ZWQiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6InUzeDBBZFJzTG1uX3oyempBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTW9uc3RlciIsImxpbmsiOiJodHRwczovL3d3dy5tb25zdGVyLmNvbS5zZy9hbXAvam9iLXZhY2FuY3ktc29sdXRpb24tYXJjaGl0ZWN0LWhpZ2gtcGVyZm9ybWFuY2UtY29tcHV0aW5nLWhwYy1hbWF6b24td2ViLXNlcnZpY2VzLXNpbmdhcG9yZS1wcml2YXRlLWxpbWl0ZWQtc2luZ2Fwb3JlLTI3NTUxODg5Lmh0bWw/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Cloud Solution Architect", "company_name": "Microsoft", "location": "Singapore", "via": "via MNC Jobs Singapore | MNC Jobs In Singapore", "description": "You may have heard we’re going through a transformation here at Microsoft. It's an unprecedented shift in our culture, the way we do business and our approach to the world. At the heart of that is hiring people who have a desire to succeed, a passion to innovate and an insatiable appetite to learn. If that sounds like you, read on, this may be just the place for you.\n\nYou would be joining a team at the heart of Microsoft’s hugely successful Azure cloud business. This role will put you at the front and centre of working with our top Asia Pacific clients to help them get real business value from Azure.\n\nWe are currently seeking Cloud Solution Architects to drive all-in migrations for high priority customer initiatives on Azure, in collaboration with customers and colleagues. This is a technical, customer facing role that is accountable for the end-to-end customer cloud deployment experience and Cloud journey.\nResponsibilities\n\nThis Cloud Solution Architect role is a deeply technical... role, working with our customers to build technical capability, create innovative solutions to their business challenges and uncover new workloads that could be migrated to Azure.\n\nWe are looking for a highly motivated and passionate Cloud Solution Architect to drive high priority customer initiatives on the Microsoft Azure Platform in collaboration with customers and the Microsoft field in strategic accounts segment of our business. This is a customer facing role, owning overall technical relationship between customer and Microsoft Azure Platform.\n\nThis role will own the Azure technical customer engagement including: architectural design sessions, specific implementation projects and Proofs of Concepts as well as collaborating with other parts of Microsoft and our partners, always with the Customers’ needs at the heart of everything you do.\nQualifications\n\nWhilst we don’t expect everyone to be an Azure expert just yet, (we will help with that if you love learning fast) we are looking for cloud computing technology (including open source) experts with deep knowledge in one or more of the following areas:\n\nProfessional\n• Experience. 5+ years of success in consultative/complex technical sales and deployment projects, architecture, design, implementation, and/or support of highly distributed applications required\n• Relationship Building. Proven track record of building deep technical relationships with senior IT executives in large or highly strategic accounts. Experience in managing various stakeholder relationships to get consensus on solution/projects. required\n• Problem Solving. Ability to solve customer problems through cloud technologies required\n• Collaboration and Communication. Acknowledged for driving decisions collaboratively, resolving conflicts and ensuring follow through with exceptional verbal and written communication skills. Ability to orchestrate, lead, and influence virtual teams, ensuring successful implementation of customer projects. Presentation skills with a high degree of comfort with both large and small audiences (Senior Executives, IT management, Database administrators and Data Scientist) required\n\nTechnical\n• Enterprise-scale technical experience with cloud and hybrid infrastructures, architecture designs, migrations, and technology management required\n• Experience and understanding of large-scale application portfolios in enterprise-wide environments (including migration of on-premise workloads to the cloud) required\n• Subject matter expertise in one or more of the following:\n• Deep domain expertise of cloud infrastructure solutions (i.e. Windows and Linux IaaS, SAP, BCDR, Security, Management, Storage, Networking, OSS, containers and Infra as a code technologies) required\n• Deep domain expertise in …\n• cloud application development solutions (e.g. PaaS, Serverless, API Management);\n• container orchestration (e.g. Kubernetes, Cloud Foundry);\n• continuous integration technologies (e.g. Jenkins, Spinnaker, Azure for DevOps, Chef, Puppet);\n• web application server technologies, cloud application design, software architecture and practices; (design/development/deployment, Agile, SCRUM, ALM)\n• one or more of the following programming languages: C++, C#, Java, Node.js, JSON, PHP, Perl, Python, Ruby on Rails, Pig/Hive\n• Experience using integrated development environments (e.g. Visual Studio, Visual Studio Code, Eclipse, XCode, WebSphere) targeting Android, iOS, Linux, Windows, public clouds (i.e. Azure, AWS) required\n• Experience with scalable architectures using Azure App Service, API management, serverless technologies, container orchestration (e.g. Kubernetes, Cloud Foundry etc.), API management, microservice frameworks etc.\n• Software development practices like DevOps and CI/CD tool chains (i.e. Jenkins, Spinnaker, Azure DevOps, GitHub). preferred\n• Competitive Landscape. Knowledge of cloud development platforms preferred\n• Partners. Understanding of partner ecosystems and the ability to leverage partner solutions to solve customer needs preferredEducation\n• Certification / depth in one of the following technologies preferred: Cloud, mobile, web application development, cloud-native application architecture (i.e. containers, microservices, API management), modern software development techniques like DevOps and CI/CD tool chains (i.e. Jenkins, Spinnaker, Azure developer services, GitHub) and container orchestration systems (i.e. Docker, Kubernetes, Cloud Foundry, Azure Kubernetes Service, GitHub).\n\nExperiences\n• Prior work experience in a Consulting/Architecture position within a software and/or services company such as Amazon, VMware, Google, IBM, Oracle desired\n\nMicrosoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances.\n\nBenefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDbG91ZCBTb2x1dGlvbiBBcmNoaXRlY3QiLCJjb21wYW55X25hbWUiOiJNaWNyb3NvZnQiLCJjb21wYW55X21pZCI6Ii9tLzA0c3Y0IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoidlI3ck9pVFFpeG9iOU5NeEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVJQkNxSUJRVTVWWDA1eFZHRXdkSG8wVTNkT1JXOTVjMWxuYW1GUVNUazJNa3BtZDNGdU9VaFlOVWxTZEcxV1RWcEpSR2hUYkc1V2NFY3llRXRHVXpVNWNVMUpObk40UnpOcldHeE1OV1V5V2tOblNqZEhNMjkyUjI1TVNXSlpNalYzVGxVMk5IaHBXRVpHVUVGSVgyeGhOa0pZUTJaSU5YRnpZblp4V0MxSFQwMXVZVFpJUzBSSWRVbEhVamd6U1hwblVISmxXalpWWWtsbFZtRjVRMUI2VmxadE4xVlJFaGQ2TTNGRFdVMHpTa2RaUzJrMVRtOVFhWFp4YlhsQlNSb2lRVTlOV1ZKM1EyaHpia3RIWWxCNVVEVnhSaTFzZFdWb2JWZERWRkpsZWtnNGR3IiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNDkiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTU5DIEpvYnMgU2luZ2Fwb3JlIHwgTU5DIEpvYnMgSW4gU2luZ2Fwb3JlIiwibGluayI6Imh0dHBzOi8vc2cubW5jam9iei5jb20vam9icy9jbG91ZC1zb2x1dGlvbi1hcmNoaXRlY3Qtc2luZ2Fwb3JlLTE2ODM3Nz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Solution Architect", "company_name": "Ecquaria Technologies Pte Ltd", "location": "Singapore (+1 other)", "via": "via Glassdoor", "description": "Responsibilities\n• Play core technical role in system development.\n• Understand customer’s technical infrastructure and requirements.\n• Design software architecture.\n• Convert system requirements into software architecture and design documentation.\n• Interface and coordinate tasks with Module Leaders to ensure the smooth and timely integration of all system modules.\n\nPre-requisites\n• Degree in Computer Science.\n• Certified Enterprise Architect for J2EE.\n• 5 years experience in Internet technology n Win NT, UNIX or LINUX platform.\n• Experience in designing and delivering complex web-based applications using J2EE servers such as Sun One WebLogic, WebSphere or JBoss.\n• Experience in one or more of the following database servers: Oracle, DB2, MySQL.\n• Knowledge of open frameworks such as Spring, Struts, JSF, Hibernate.\n• MVC design, Data modeling, Deployment & Build management, Data migration.", "extensions": ["16 days ago", "Full–time"], "detected_extensions": {"posted_at": "16 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2x1dGlvbiBBcmNoaXRlY3QiLCJjb21wYW55X25hbWUiOiJFY3F1YXJpYSBUZWNobm9sb2dpZXMgUHRlIEx0ZCIsImNvbXBhbnlfbWlkIjoiL2cvMTFkeHEyNnB4eiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IkJmUGV0YmNhTmJGYzZhM0pBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVvd0NDc3dCUVU1VlgwNXhVVkp4WmpWdk5rSjRXR2t0YzJOU2RFOUhZa2hIWlVGeE1HRjBjalJqTVdwVldqbDNkRWxLV25KTk1rdFJVbWhTT0V0TVlrRk1WR0k1YlcxYVNXRTNka0Z5VW5SNmVscFJUR1E1VkVOdWNYRnBXVVZMV1UxaFMxTkhaV1ZQVUhkMFYxUnlYelp1VldOM2RYRndiM05ZVERJMU1qWlhOSE5aUjNjd1VHMUJXa3A0VlhWRVgyRmxXVTV2V0dwcWVETnJSWGhaTjJ4V1dHSnZORk5CTmxGVFdGTlBXbFJzTkRjdE5tZGpRa2w0WVdSSWJVeHVjbGM1UkVoeGNGTkhSUzF2ZFZsaVNHRk5FaGQ2TTNGRFdVMHpTa2RaUzJrMVRtOVFhWFp4YlhsQlNSb2lRVTlOV1ZKM1EwcDNTMGxHZUdRMlRVSXdabGRvVGtnelVIcEJiVkZGTlhaNGR3IiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNTciLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gR2xhc3Nkb29yIiwibGluayI6Imh0dHBzOi8vd3d3LmdsYXNzZG9vci5zZy9qb2ItbGlzdGluZy9zb2x1dGlvbi1hcmNoaXRlY3QtZWNxdWFyaWEtdGVjaG5vbG9naWVzLXB0ZS1KVl9JQzMyMzU5MjFfS08wLDE4X0tFMTksNDQuaHRtP2psPTM2NTcyMzAyNzNcdTAwMjZ1dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Full Stack Solution Architect – Trading", "company_name": "Cargill", "location": "Singapore", "via": "via LinkedIn", "description": "Position Purpose & Summary\n\nThe Solution Architect will be responsible for consulting and providing direction on all management and development of technology solutions related to Cargill’s business and its complex set of integrations and interfaces to other parts of the organization. This is a role with balanced responsibilities for understanding both business and technical needs by translating business needs into a coherent strategy, putting data, process and technology in place\n\nPrincipal Accountabilities\n• Develop a good understanding of business strategy and most specifically its direction in terms of process, data and technology.\n• Analyse user system and application needs, determine and evaluate potential solutions, develop system target architecture to meet the requirements.\n• Work with business(es) to help shape the direction of the products based on a combined knowledge of what is technically feasible and what is desired by the end user.\n• Design and estimate integrated... solutions which may include applications, databases, networks, and related systems.\n• Provide consult and strategic architectural oversight during the design, build and test phases and tests automation of all projects.\n• Evaluate industry trends and vendor products in close consultation with solution owners and architects.\n• Proactively participate in the assessment of potential projects and the development of a meaningful roadmap for delivery.\n• Serve as an expert in your field and work with limited direction, using additional research and interpretation to identify issues/problems.\n• Provide direction to lower level team members and be a key contributor.\n• Other duties as assigned\n\nRequired Education & Experience\n• Bachelor’s degree in a related field or equivalent experience\n• Business fluency in English.\n• Minimum of six years of related work experience\n\nPreferred Skills & Experience\n• Bachelor’s degree in business, information technology or computer science; or equivalent experience 10 years of information technology and business / industry work experience.\n• Experience with software development methodologies.\n• Proven expertise in designing end to end solution.\n• Experience interacting effectively, confidentially and appropriately with various levels management and custom.\n• TOGAF Certification", "extensions": ["15 days ago", "Full–time"], "detected_extensions": {"posted_at": "15 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJGdWxsIFN0YWNrIFNvbHV0aW9uIEFyY2hpdGVjdCDigJMgVHJhZGluZyIsImNvbXBhbnlfbmFtZSI6IkNhcmdpbGwiLCJjb21wYW55X21pZCI6Ii9tLzAzc3c5dyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImNNOE5UTnh1U1RGUmJDa2JBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVzd0JDb3dCUVU1VlgwNXhVVUZaVkZjd1lsWm9Sa1pVVUZsRE4yZFRSRU40T0ZBNGVVOWlNVXhzY1hkbWJWZERVazFQWWpGamNtYzRjRGhoZG1ZNVdrcENNMjk2VEZCUk5VOXRRekJaVXpZd09HOVlaa3BuVDFKUFVEa3dNbGM1VVRKb1ZGRnFZamhwWWtWRVpWazNaR001UlVFeFpYRkVSWGxtU201NWFtcGxZMXB0WTJSbFNHSjFlRGsxUkZoSlUzY1NGM296Y1VOWlRUTktSMWxMYVRWT2IxQnBkbkZ0ZVVGSkdpSkJUMDFaVW5kQ1YzTjFiREJPTVhOYWVXZ3lTblZxZW5WdFdFVkJTVVJ0WW5KQiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzY1IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExpbmtlZEluIiwibGluayI6Imh0dHBzOi8vc2cubGlua2VkaW4uY29tL2pvYnMvdmlldy9mdWxsLXN0YWNrLXNvbHV0aW9uLWFyY2hpdGVjdC0lRTIlODAlOTMtdHJhZGluZy1hdC1jYXJnaWxsLTIzNTQ2NDkyNTU/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}], "chips": [{"type": "Title", "param": "job_family_1", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Solution architect", "value": "solution architect"}, {"text": "Solutions architect", "value": "solutions architect"}, {"text": "Architect", "value": "architect"}, {"text": "Cloud architect", "value": "cloud architect"}, {"text": "Technical architect", "value": "technical architect"}, {"text": "Enterprise architect", "value": "enterprise architect"}, {"text": "Senior", "value": "senior"}, {"text": "Consultant", "value": "consultant"}, {"text": "Financial services", "value": "financial services"}, {"text": "Infrastructure architect", "value": "infrastructure architect"}, {"text": "Manager", "value": "manager"}, {"text": "Application architect", "value": "application architect"}, {"text": "Cloud engineer", "value": "cloud engineer"}, {"text": "It architect", "value": "it architect"}, {"text": "Lead architect", "value": "lead architect"}, {"text": "Network architect", "value": "network architect"}, {"text": "Security architect", "value": "security architect"}, {"text": "Senior architect", "value": "senior architect"}, {"text": "Systems engineer", "value": "systems engineer"}, {"text": "Associate director", "value": "associate director"}, {"text": "Deputy", "value": "deputy"}, {"text": "Engineers", "value": "engineers"}, {"text": "Head", "value": "head"}, {"text": "Infrastructure", "value": "infrastructure"}, {"text": "Lab", "value": "lab"}, {"text": "Network engineer", "value": "network engineer"}, {"text": "Presales consultant", "value": "presales consultant"}, {"text": "Public sector", "value": "public sector"}, {"text": "Senior analyst", "value": "senior analyst"}, {"text": "Senior consultant", "value": "senior consultant"}, {"text": "Senior director", "value": "senior director"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Software architect", "value": "software architect"}, {"text": "Solution consultant", "value": "solution consultant"}, {"text": "System architect", "value": "system architect"}, {"text": "System engineer", "value": "system engineer"}, {"text": "Systems analyst", "value": "systems analyst"}, {"text": "Systems architect", "value": "systems architect"}, {"text": "Technical trainer", "value": "technical trainer"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Accounting", "value": "/business/naics2007/5412"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Management", "value": "/business/naics2007/55"}, {"text": "Real Estate", "value": "/business/naics2007/53"}, {"text": "Wholesale", "value": "/business/naics2007/42"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Amazon", "value": "/m/0mgkg"}, {"text": "Microsoft", "value": "/m/04sv4"}, {"text": "EPAM Systems", "value": "/m/0dlnrc"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "IBM", "value": "/m/03sc8"}, {"text": "Salesforce", "value": "/m/07btr5"}, {"text": "EY", "value": "/m/0g9jc"}, {"text": "Publicis Sapient", "value": "/m/02myjp"}, {"text": "Randstad", "value": "/m/08pt1z"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Alibaba Group Holding Limited", "value": "/m/07s6ctl"}, {"text": "Avanade", "value": "/m/094456"}, {"text": "Capgemini", "value": "/m/03vlk0"}, {"text": "Comtel Solutions Pte Ltd", "value": "/g/11dxpztgnb"}, {"text": "DELL", "value": "/g/11c54ch2jm"}, {"text": "Ericsson", "value": "/m/02kyh"}, {"text": "HTZ Resources", "value": "/g/11h21p9b4d"}, {"text": "Infinite Computer Solutions Pte Ltd", "value": "/g/11g9mj72yz"}, {"text": "Michael Page", "value": "/m/04cxldw"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "Orange Business Services", "value": "/m/08zvyz"}, {"text": "Recruitment Hub Asia Pte Ltd", "value": "/g/11dxpww_0f"}, {"text": "TEKsystems (Allegis Group Singapore Pte Ltd)", "value": "/g/11b6g4bkv0"}, {"text": "Talent Trader Group Pte Ltd", "value": "/g/11dxpmlc5b"}, {"text": "Tata Consultancy Services", "value": "/m/01psx8"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "VMware", "value": "/m/01t9k5"}, {"text": "Verizon", "value": "/m/07_dn"}, {"text": "A-Speed Infotech Pte Ltd", "value": "/g/11g9mxswl4"}, {"text": "ABeam Consulting", "value": "/g/11bc6whr_f"}, {"text": "Amazon Web Services (AWS)", "value": "/g/11dxprr2xv"}, {"text": "Amazon Web Services Singapore", "value": "/m/0rznzt1"}, {"text": "Aon", "value": "/m/0z7n"}, {"text": "Avaya", "value": "/m/01sqlk"}, {"text": "Azendian Solutions Pte Ltd", "value": "/g/11dxpvcjj2"}, {"text": "Big Cloud", "value": "/g/11c743lwsr"}]}]}