{"search_metadata": {"id": "60827e2a2e7d6b2daaf75242", "status": "Success", "json_endpoint": "https://serpapi.com/searches/5b2158626f61aef2/60827e2a2e7d6b2daaf75242.json", "created_at": "2021-04-23 07:58:34 UTC", "processed_at": "2021-04-23 07:58:34 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28consultant%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=0", "raw_html_file": "https://serpapi.com/searches/5b2158626f61aef2/60827e2a2e7d6b2daaf75242.html", "total_time_taken": 1.83}, "search_parameters": {"q": "(consultant) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "0"}, "jobs_results": [{"title": "Insurance Consultant", "company_name": "DBS Bank Limited", "location": "Singapore", "via": "via EFinancialCareers", "description": "Insurance Consultant\n\nBusiness Function\nDBS has embarked on an exciting joint financial planning program with Manulife. Become an Insurance Consultant and serve the bank's customers by providing trustworthy, reliable, and innovative financial solutions to them. Help the customers make informed decisions about their finances to achieve their financial milestones in life. Do all this while being rewarded with an attractive compensation program that is competitive within the financial advisory industry!\nFulfilling and varied, a typical workday might look like this\n\n• Insurance Consultants will be provided with prospective customers to engage through tele-calls, tele-appointments, and/or outreach programs\n• Set up appointments to meet prospective customers, understand their needs and recommend suitable insurance solutions\n• Conduct subsequent reviews with client to ensure their evolving needs are met\n• Ensure the advisory process is fully compliant with the bank's standards and... guidelines\n• Conduct yourself professionally with utmost integrity and deliver service standards in line with the Bank's values\n• Achieve Key Performance Indicators (KPIs) and Balanced Scorecard set by the bank.\n• Any other ad-hoc duties We want driven, service-oriented individuals like you with:\n\n• A diploma / degree in any discipline\n• A willingness to work on a flexible schedule that includes weekends\n• A passion for banking and insurance\n• CMFAS certification and at least 1-2 years of financial sales work experience is a must for the insurance consultant role\n• Excellent communication and listening skills\n• Confidence and Presentation skills\n• Ability to explain complex information clearly and simply Apply Now", "extensions": ["4 hours ago", "Full–time"], "detected_extensions": {"posted_at": "4 hours ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJJbnN1cmFuY2UgQ29uc3VsdGFudCIsImNvbXBhbnlfbmFtZSI6IkRCUyBCYW5rIExpbWl0ZWQiLCJjb21wYW55X21pZCI6Ii9tLzAxcTduNSIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IlJISVpocU9iTjVMWTBmZGNBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2WUJDcmNCUVU1VlgwNXhVbmxNUjJoQ2QzUkNUalZyYkY5bmJVeGxSamg2YlZKUE5FbzJWazF3YzFGa2MycHZVRTk2VTB4VlZGOXBkMDVhWW14aE5tbDFkMjlJVEZCd2NWQmxaWGRQU25GcmMwaE1SRU5xVTFkT2VtUlNiMUl6TjJGVVUwNWFTV0ZXYTBWamNUWmlkVXRWZEhaQ1ZFRk9iMnd5TVhoVWNuTkRVakJ3TURaSE5FSktWM0YyVjJWS1pUZzJTVVZ6Y0hocVdteEJNMHBJWlZoQ2QxaGtjVU5TVEV0MGRURkJSSFJLWVd4dGRYZERXRVI0T1RockVoWkxialpEV1V0cVNFNDVTRlZ6UVZjeGJYQnFVVU5SR2lKQlQwMVpVbmRDTWpGdGFWbzJObWR3VGpGd1NHdFhaRjlDZVhSR1ZUaEZXazEzIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBFRmluYW5jaWFsQ2FyZWVycyIsImxpbmsiOiJodHRwczovL3d3dy5lZmluYW5jaWFsY2FyZWVycy5jb20vam9icy1TaW5nYXBvcmUtU2luZ2Fwb3JlLUluc3VyYW5jZV9Db25zdWx0YW50LmlkMTA4MzQzMjE/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Financial Consultant (Apprenticeship)", "company_name": "Crown Organisation", "location": "Singapore", "via": "via Glints", "description": "APPRENTICESHIP FOR FINANCIAL PLANNERS\n\nIf you are fresh-Graduates or Undergraduates in your 3rd or last year of studies. We have a Internship program customised according to your schedules so you do not need to worry about affecting your studies or other commitments!\n\nJoin us in the 8 weeks journey to be certified as a full fledged Financial Planner with Monthly Training Allowance (up to $2400)\n\nAt the end of the program, you will be licensed under Crown Organisation to advise on matters pertaining to Life & Health Insurance as well as Investment Linked related products\n\nWhat to expect during the 8 weeks program?\n\n- Structured Training programs (lesson)\n\n- 1-1 Mentorships (knowlegde and skills)\n\n- Financial Certification (CFMAS)\n\nInterest applicants can send in resume, and we will contact you soon.", "extensions": ["1 day ago", "$500–$6K a month", "Part-time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Part-time", "salary": "$500–$6K a month"}, "job_id": "eyJqb2JfdGl0bGUiOiJGaW5hbmNpYWwgQ29uc3VsdGFudCAoQXBwcmVudGljZXNoaXApIiwiY29tcGFueV9uYW1lIjoiQ3Jvd24gT3JnYW5pc2F0aW9uIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJoVzEzR0E3WlFMWVdqeWxiQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEdsaW50cyIsImxpbmsiOiJodHRwczovL2dsaW50cy5jb20vb3Bwb3J0dW5pdGllcy9qb2JzL2ZpbmFuY2lhbC1jb25zdWx0YW50LWFwcHJlbnRpY2VzaGlwLzU1ZGRlOTc2LTY4N2EtNDk2MS05ZjIxLWJiY2VhMjBmOTM1Mj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior Consultant, Talent", "company_name": "the LEGO Group", "location": "Singapore", "via": "via LinkedIn", "description": "Are you passionate about attracting, sourcing, hiring, and onboarding outstanding talent for years to come?\nWe are on an exciting journey and the Talent Acquisition team is looking for a superstar colleague to join our APAC Talent Operations team, with true depth and breadth of recruitment expertise to bolster and accelerate our growth in APAC markets.\nCore responsibilities\nTalent Acquisition\n• Own the end-to-end recruitment process, including contact with hiring leaders, screening & selection, interviews (in-person, phone, and video), offer proposal and candidate follow–up & feedback.\n• Partner with stakeholders to define the most appropriate recruiting strategy based on the specific role and business needs, clearly communicate the process, and set and lead hiring leader and candidate’s expectations.\n• Ensure successful onboarding experience for the new hires in close collaboration with internal stakeholders (e.g. Facilities, IT, HR Services, etc.)\n• Ad-hoc projects relate to the... Talent agenda and priorities, e.g. HR system, employer branding, learning culture, etc.\n\nLearning & Development\n• Work with other team members on the roll-out of global and regional L&D programs.\n\nPlay your part in our team succeeding!\nAt the LEGO Group, the HR organization is called People Operations & Development (PO&D). It includes 4 functions Talent, Rewards, Insights, and Partnering & Operations.\n\nThe Talent Operations teams, as we are, belong to the Talent function and are located in five regions – NEU, EMEA, APAC, China, and AMS.\n\nWe are sitting in the region in order to be close to the business and support them as much as we can in terms of recruitment and learning activities.\nBased in Singapore, the APAC Talent Operations team is supporting the talent activities of multiple markets in the region, including Korea, Japan, Hong Kong, Taiwan, India, Malaysia, Singapore, Australia & New Zealand, etc.\n\nDo You Have What It Takes\n• Bachelor’s degree or equivalent working experience\n• Proven track record on leading 360 recruitment process and collaborating with leaders from multiple functions and countries\n• Ability to build and execute recruitment plans to source and approach the right candidates through existing and new recruitment channels.\n• Global attitude and strong resourcefulness to optimally work with people with diverse cultural background\n• Effective written and verbal communication skills\n• Structured mind and ability to balance multiple tasks at a time.\n• Motivated, comfortable with remote work, and able to quickly build trust and credibility with others.\n• Experience as HR Business Partner, L&D professional, and other relevant roles are a huge plus.\n\nJoin the global LEGO® family\nChildren are our role models. Their curiosity, creativity, and imagination encourage everything we do. We strive to build a diverse, dynamic, and inclusive culture of play at the LEGO Group, where everyone feels safe, valued, and they belong.\n\nThe LEGO Group is proud to be an equal opportunity and an affirmative action employer. We are committed to equal employment opportunities regardless of race, colour, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity, or Veteran status.\n\nWe support our employees in being there for the moments that matter in life and celebrate families of all kinds, the loved ones that make us who we are. Being part of the LEGO Group also means taking part in our annual Play Day, playing a part in building a sustainable future, and continuing our mission to “inspire and develop the builders of tomorrow.”", "extensions": ["14 hours ago", "Full–time"], "detected_extensions": {"posted_at": "14 hours ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQ29uc3VsdGFudCwgVGFsZW50IiwiY29tcGFueV9uYW1lIjoidGhlIExFR08gR3JvdXAiLCJjb21wYW55X21pZCI6Ii9tLzA2cjZkciIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImsxRXoyZHVJeGtSNnNoaVNBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhVa3RyWm0xRlVXbHpOUzAwZDJVNVlqbHJXWFZqY0ZaWFZHaEZRelpyUkZsa1ZrcGtXbU5EWlhGU2FVc3lNRmhaY25kVU5YaEVWbFZZYlRZMVMydE1OVEkxYjBsNWVFWnpkRTlLYUd0Q1pEQXpORlpTTW5sVFdrSlVhbHBaVDA1T1RHUXlSVlI0U3paRVNYTTFZa1ZpVUVGeUxVeFRjR1pYVEZWd2IzUk9UakUxVlRCM2MxRnlSMHBLV0hCWWRqbFljMll0TVVscFdXRmhWR1ZuRWhaTGJqWkRXVXRxU0U0NVNGVnpRVmN4YlhCcVVVTlJHaUpCVDAxWlVuZEVRaTFUT1dwbE4wVnFVVE5KTVdZMVNqRldjM010Vlcxd1VEbDMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18yMSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL3NnLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvc2VuaW9yLWNvbnN1bHRhbnQtdGFsZW50LWF0LXRoZS1sZWdvLWdyb3VwLTI0OTI2NDU4ODA/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Presales Consultant (Network)", "company_name": "Singtel Group", "location": "Singapore", "via": "via Singtel Careers", "description": "Responsibilities\n• Provide expert technical pre-sales support for opportunities involving Cisco, Alcatel, F5 network product and solutions.\n• Early engagement with customer in selling network solutions – RFQ & tender\n• Understand and gather customer requirements and offer complete & cost effective solution.\n• Prepare solution writeup, bill of material and engage Service Delivery team for professional effort\n• Ensure the completeness of technical terms and conditions\n• Conduct/Lead in technical presentation and clarification\n• Identify project risk (technical & execution) and provide mitigation measures\n• Integrate network solutions with support from other competency presales solutions consultant.\n• Upon contract award; conduct transition/ handover and briefing to project implementation team on the overall solution and design.\n• Keep abreast of product technology and certifications.\n• Keep updated of the latest technology and develop technical capability slides.\n• Attain selected... product/technology certifications to maintain our premium partnership status with product principals\n• Conduct in-house technology sharing to fellow peers.\n\nThe ideal candidate should possess:\n• Diploma/Degree in IT related fields\n• At least 5-yrs in infrastructure/network presales experiences\n• Network Certified – CCNP/CCIE will be ideal\n• Good knowledge in virtualization and cloud (IaaS) technology\n• Customer service oriented, good team player, technically inclined\n• Must be effective in working both independently and in a team setting", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcmVzYWxlcyBDb25zdWx0YW50IChOZXR3b3JrKSIsImNvbXBhbnlfbmFtZSI6IlNpbmd0ZWwgR3JvdXAiLCJjb21wYW55X21pZCI6Ii9tLzAyMHpmbCIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IklfZnptMGtmUXlvTHB3LThBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhVWHBRU0RCVVduRnBPQzFIWXpCaWFsSlljSFJoWlZoNFNpMVBTelJJWlUweFkyRlhiazh6VURoWlMzVnpkVGhyWjFoV05YUTBibFZWYTJ0amVXTjROV05XVTA5UFkybFdaM0ZuVXpreWNXOVRMVmx4VDJkSVFUQTBjR3haVTFWTlZXaHZjVWMyUVdJM2VXRkRVelpRTjFCM1UwVmlXa3BpYm5scldWVmlVVnBGV0dwMFlrWXlkemREV2pWMWVYWlNYMUp6Y0dVNUxWcDRSRVZSRWhaTGJqWkRXVXRxU0U0NVNGVnpRVmN4YlhCcVVVTlJHaUpCVDAxWlVuZERVVEkzVEhGRWIwSnROVzV2WDBWWFJGQnZaMUJwYTNOaFFtOTMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18yOSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBTaW5ndGVsIENhcmVlcnMiLCJsaW5rIjoiaHR0cHM6Ly9ncm91cGNhcmVlcnMuc2luZ3RlbC5jb20vam9iL1ByZXNhbGVzLUNvbnN1bHRhbnQtJTI4TmV0d29yayUyOS1TaW5nLzU4MTMwNjAxMC8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Technical Consultant", "company_name": "INOK SYSTEMS PTE LTD", "location": "Singapore (+1 other)", "via": "via Learn4Good", "description": "Roles &\n\nResponsibilities\n\nInok Systems Pte Ltd ()Inoks provides a working environment that is friendly and supportive with flexible working hours , flat reporting structure and zero tolerance for office politics.\n\nInok Systems Pte Ltd is a Value Added Reseller (VAR) of business software solutions in the areas of IT Service Management (ITSM), IT Asset Management (ITAM) and IT Operations Management (ITOM). We are authorised partners for BMC Software and Service\n\nNow. Our main activities are the sales, marketing, deployment, training and technical support of abovementioned software products. Our customers are typically MNCs as well as government. We also work with most of the major System Integration companies as services partner.\n\nResponsibilities:· Consulting with clients on ITSM projects· Building and Implementing ITSM Projects· Gather requirements and propose solutions· Provide technical support to customers· Training of customers\n\nRequirements:· Singaporeans/PR only· At least 3... years permanent full time working experience in similar capacity· System Admin or Development experience with Service\n\nNow/Remedy as a customer user or as vendor consultant· Certified System Admin or Certified Implementation Specialist certifications from Service\n\nNow/Remedy preferred· Good communication and customer handling skills·\n\nAbility to handle projects and situations independently with minimum supervision· ITIL v3 certification preferred not mandatory· Programming experience (please list in resume ,if any) will be an advantage· We will select applicants and hire based on real working experience and practical skills over paper certifications and educational levels.\n\nTell employers what skills you have\n\nAdaptability\n\nBusiness Analysis\n\nDatabases\n\nIntegration\n\nIT Asset Management\n\nIT Operations\n\nJavaManagement\n\nProject Management\n\nRequirements Analysis\n\nSoftware Development\n\nSQLsystemfriendly\n\nICT Service Management\n\nValue Added Reseller", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJUZWNobmljYWwgQ29uc3VsdGFudCIsImNvbXBhbnlfbmFtZSI6IklOT0sgU1lTVEVNUyBQVEUgTFREIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJ1VkNOWmNZcTZ3YWszUE5oQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExlYXJuNEdvb2QiLCJsaW5rIjoiaHR0cHM6Ly93d3cubGVhcm40Z29vZC5jb20vam9icy9zaW5nYXBvcmUvaW5mb190ZWNobm9sb2d5LzI3MTMwNjM5NS9lLz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Consultant", "company_name": "FireEye", "location": "Singapore", "via": "via Jobs", "description": "Consultant - Incident Response/Digital Forensics Singapore Full-time Company Description FireEye is the leader in intelligence-led security-as-a-service. Working as a seamless, scalable extension of customer security operations, FireEye offers a single platform that blends innovative security technologies, nation-state grade threat intelligence, and world-renowned Mandiant® consulting. With this approach, FireEye eliminates the complexity and burden of cyber security for organizations struggling to prepare for, prevent, and respond to cyber attacks. FireEye has over 7,500 customers across 67 countries, including more than 50 percent of the Forbes Global 2000. Job Description As a FireEye IR / Forensics Managing Consultant you will join part of an industry leading team where you will be focused on providing incident response, threat analysis, and program management to our client base. You will be responsible for incident response and threat analysis process development for customers... as well as using your incident response skills to help identify and contain security breaches. You will also brief senior executives on threats in their environment and their industry, based on FireEye’s wealth of threat intelligence. We encourage give back to the community and strongly support sharing of expertise through authoring whitepapers, developing free tools, and speaking at conferences. Responsibilities: Develop custom reports based on data from multiple sources, including FireEye appliances, FireEye threat intelligence, network sensors, and outside intelligence feeds Present technical material in a clear, organized briefing to a mix of technical and non-technical personnel Identify opportunities to integrate FireEye appliances with other security products in customer’s network Develop custom reports and other custom configurations / use cases for FireEye products within customer’s environment Help determine the extent of the compromise, attributes of any malware and possible data ex-filtrated Develop, document and manage containment strategy Maintain current knowledge of tools and best-practices in advanced persistent threats; tools, techniques, and procedures of attackers; and forensics and incident response Qualifications Relevant years experience in an analytical role of either network forensics analyst, threat analyst, incident response or security engineer/ consultant One or more of the following technical certifications: GIAC Certified Incident Handler (GCIH), GIAC Certified Forensic Analyst (GCFA), GIAC Reverse Engineering Malware (GREM), EnCE or equivalent certifications in these areas Experience developing and managing incident response programs Expertise in analysis of TCP/IP network communication protocols Experience conducting analysis of electronic media, packet capture, log data, and network devices in support of intrusion analysis or enterprise level information security operations Experience with advanced computer exploitation methodologies Demonstrated ability to make decisions on remediation and countermeasures for challenging information security threats Ability to synthesize data from multiple sources and present concise, relevant information to a non-technical audience Experience with FireEye products, highly desired Experience with a scripting language such as Perl, Python, or other scripting language in an incident handling environment, highly desired Additional Qualifications: Excellent communication and presentation skills with the ability to present to a variety of external audiences, including being able to interact with senior executives Exceptional written communication Strong leadership skills with the ability to prioritize and execute in a methodical and disciplined manner Ability to set and manage expectations with senior stake-holders and team members Excellent knowledge of current information security solutions and technologies, including network and host based products Experience implementing NIST information security guidelines in a diverse network environment Experience and knowledge of packet flow/TCP/UDP traffic, firewall technologies, proxy technologies, anti-virus, spam and spyware solutions (Gateway and SaaS) Malware/security experience Programming / scripting skills, highly desired Additional Information At FireEye we are committed to our #OneTeam approach combining diversity, collaboration, and excellence. All qualified applicants will receive consideration for employment without regard to race, sex, color, religion, sexual orientation, gender identity, national origin, protected veteran status, or on the basis of disability. Requests for accommodation due to disability can be sent directly to ", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDb25zdWx0YW50IiwiY29tcGFueV9uYW1lIjoiRmlyZUV5ZSIsImNvbXBhbnlfbWlkIjoiL20vMDViXzhoNyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjRXZ2NMYWFNc012WGh2X2VBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhVMmhrZDFJMVNWbERUM0ZDYmpad2FETjVZMUJRUm5sT1ZVcEpPR0psT1dSMUxYUnJkamx2ZEROTGIyNDVNbE5vWkdsUFNXTnFWRU5wY0hjM2FWaFJNVWxoUkRoeGNucFJYMHh2U2xkNlFWcG1NVXAwVGpoSFRWUjRiVGhGTkZkaFdISk1NV1J6U2xCaFJVMVlURFF5TTFoalJXSnhabFZwVFdNeU5YSTBSMDl6YjJWbWRsVlpTM1V4U3psRWJqQkdWR2N0U0hCR1QwWndOR0ozRWhaTGJqWkRXVXRxU0U0NVNGVnpRVmN4YlhCcVVVTlJHaUpCVDAxWlVuZEVOakkyT0VscFpVUkpaWEZaVkhoUlJsSm9ialpvVVdwaFZVOW4iLCJmY3YiOiIzIiwiZmNfaWQiOiJmY180MSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIiwibGluayI6Imh0dHBzOi8vc2cuZmlkYW50by5jb20vam9icy9qb2Itb3BlbmluZy9jb3Vuc2Vsb3JzLWFsbC1vdGhlci9jb25zdWx0YW50LTI3Nzg1MTA4NT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Principal consultant", "company_name": "INFOSYS LIMITED SINGAPORE BRANCH", "location": "Singapore", "via": "via LinkedIn", "description": "About Infosys –\n\nInfosys is a global leader in next-generation digital services and consulting. We enable clients in 46 countries to navigate their digital transformation. With over three decades of experience in managing the systems and workings of global enterprises, we expertly steer our clients through their digital journey. We do it by enabling the enterprise with an AI-powered core that helps prioritize the execution of change. We also empower the business with agile digital at scale to deliver unprecedented levels of performance and customer delight. Our always-on learning agenda drives their continuous improvement through building and transferring digital skills, expertise, and ideas from our innovation ecosystem.\n\nVisit to see how Infosys (NYSE: INFY) can help your enterprise navigate your next.\n\nShort Description\n\nIf your passion is to build solutions that really make a difference to enterprises, the community and your world, Infosys is the right place for you.\n\nSAP PSR... role\n• Roles and Responsibilities:\n• As a PSR, you are an expert at contributing to different phases of the consulting lifecycle.\n• Plan and coordinate all activities within the responsible SAP Environment of the System Responsible\n• You will plan and coordinate Changes with IT Partners, Application Teams and other Services within the Datacenter.\n• Manage and support multiple landscapes. Should be able to manage and work in the area of SAP operation support, Implementation support, rollouts and Project support.\n• Be the single point of contact for the different landscape for internal Teams as well for the Customer.\n• Proven SAP systems delivery and/or system administration knowledge across the suite of major SAP applications & versions.\n• You will escalate Issues and Risks to the appropriate Team / Management.\n• You will support the L1 / L2 / L3 Team in troubleshooting Incidents.\n• You will optimize the SAP Systems in your responsibility.\n• You will review the monthly EWA Reports, create proposals and discuss them with the IT Partners and Application Teams.\n• You will be intensely involved in; defining the problem, propose, coordinate and refining the solution.\n• You will also play an important role in the development, configuration and deployment of the overall solution.\n• You will guide teams on project processes, deliverables and contribute to the proposal development, client training and internal capability-building and help detail the project scope.\n• You will have the opportunity to shape value-adding consulting solutions that enable our clients to meet the changing needs of the global landscape.\n• Skills /Competencies:\n• Essential:\n• Application: SAP Basis, NetWeaver, ABAP/Java-Stack, SAP PI/PO,\nAvantra, ServiceNow, SAP LaMa\n\nDatabase: SAP HANA, Oracle, MaxDB\n\nOperating Systems: Linux, Unix, Windows\n\nTechnical: Troubleshooting SAP Basis issue, SAP Client Copies, SAP System Copies, Installing SAP System, Updating Databases, Language Pack Installation, Tablespace Management, Backup & Restore/Recovery of Databases, Spool Administration, Live Cache Administration, SSO/SSL Configuration, Kernel Upgrades, SAP Hardening Support Package Upgrade, Shell / Python scripting, experience in driving automation using, Capable of designing and implementing different strategies and procedures (Like System Landscape, System Architecture, Backup Strategy, System Refresh, Patching, Stress/Performance testing etc…). Capacity & Performance Management / Tuning, Proven experience in delivering Automations, Service Improvements Area\n\nCertification: Certified in SAP Basis or SAP HANA\n• Application: SAP Solution Manager\n\nDatabase: Sybase, MSSQL\n\nTechnical: Underlying Infrastructure stack: Hypervisor, Storage, Network, Job Management Tool (SAP BPA/Redwood RunMyJobs, Broadcom/Automic UC4, SAP BPO/Solution Manager, IBM Workload Automation), CISM, Automation implementation experience in SAP Basis\n• Preferred:\nSupporting and mentoring the L1, L2 and L3 Team in day-to-day work.\n\nLeading a team of 5-10 or 10+ persons\n• Additional Skills:\n• Experience in running operations with ITIL processes / ITIL certified.\n• Excellent Analytical and troubleshooting skill.\n• Excellent in Verbal, written communication.\n• Creative thinking in implementing Service improvements (automation, incident reduction, etc.).\n• Willingness and flexibility to learn new technologies, scale up quickly and adapt to different roles as the situation demands.\n• Experienced in running operations following ITIL processes.\n• Strong multi-tasking skills and abilities to handle changing priorities in a fast paced environment\n• Strong customer focus and management of client expectations\n• Should work with minimum supervision\n• High customer orientation\n• High quality awareness\n• Infosys is an equal opportunity employer and positively encourages applications from suitably qualified and eligible candidates regardless of gender or other attribute covered by equal opportunity legislation.\nPlease note in order to protect the interest of all parties involved in the recruitment process, Infosys does not accept any unsolicited resumes from third party vendors. In the absence of a signed agreement any submission will be deemed as non-binding and Infosys explicitly reserves the right to pursue and hire the submitted profile. All recruitment activity must be coordinated through the Talent Acquisition department.\n• All aspects of employment at Infosys are based on merit, competence and performance. We are committed to embracing diversity and creating an inclusive environment for all employees. Infosys is proud to be an equal opportunity employer", "extensions": ["14 hours ago", "Full–time"], "detected_extensions": {"posted_at": "14 hours ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcmluY2lwYWwgY29uc3VsdGFudCIsImNvbXBhbnlfbmFtZSI6IklORk9TWVMgTElNSVRFRCBTSU5HQVBPUkUgQlJBTkNIIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJ5Y21wSUJ0bDhYY1oyNU1HQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExpbmtlZEluIiwibGluayI6Imh0dHBzOi8vc2cubGlua2VkaW4uY29tL2pvYnMvdmlldy9wcmluY2lwYWwtY29uc3VsdGFudC1hdC1pbmZvc3lzLWxpbWl0ZWQtc2luZ2Fwb3JlLWJyYW5jaC0yNTE1NzEwOTY0P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Financial Consultant", "company_name": "Snaphunt Pte Ltd", "location": " (+1 other)", "via": "via JobsCentral", "description": "• Build a profitable and meaningful career in the financial service industry\n• Be a part of a guaranteed success system\n\nOur client is an independent financial solutions provider with over a decade of history. They have served thousands of clients with sincerity and transparency, and are highly committed to their guiding principles.\n\nThe Job\n\nThis role will involve :\n• Developing the soft skill of people engagement.\n• Educating and demystifying the misconception of financial planning\n• Developing in-depth understanding and technical know-how of financial planning\n• Delivering integrity as a financial planner and construct a real financial plan.\n• Researching into the various financial products in order to elevate client’s financial situation to a greater height\n\nThe Profile\n• You have at least a Diploma/A level's certification.\n• You ideally have experience in a similar role. Candidates with no experience are welcome to apply.\n• You are hardworking and ready to turn hard work into fun... in life.\n• You are humble who embraces learning and growing in life.\n• You are honest sincere to go after your own’s desire in order to help others fulfil theirs.\n\nRef: 06280028", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJGaW5hbmNpYWwgQ29uc3VsdGFudCIsImNvbXBhbnlfbmFtZSI6IlNuYXBodW50IFB0ZSBMdGQiLCJjb21wYW55X21pZCI6Ii9nLzExYzc0dDYxdzgiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJfXzl1T3F1ZkFobnlXelBZQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdllCQ3JjQlFVNVZYMDV4VkVkSU5sTlJPVzkxY1dsT1dtOW1UVTl3TWxoM1NHWklOVVI1T0U1TVVHSm5VVkp2TlRVelRWbFlNREZITnpaWU5rbHVOMjFLVWtob1RsbDRka1ZIWmtkWmRIVkRPVzVzYnpJMlRubFpSSGxTYnpFdFkxcG1lakpoT0hWRVZFcDRMV1U0VUdwZlVERktZVkY2VVdZeWJEaEdNRUZ0UzFBNU5IaHpjWGd5YlU5ZlJHUjRjQzFVVjE5d1VrNW9Xa3N6UkRadE9HRkpOMHhaVVhSQ1kybExiMk5QWkVWMlNrNXdWRTFQUVVOQ1pEWkpFaFpMYmpaRFdVdHFTRTQ1U0ZWelFWY3hiWEJxVVVOUkdpSkJUMDFaVW5kRFZWOTFSVzlZWlVOc01HSm5XVVphVGtsQmNsTmlORzAzVnpKMyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzUzIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnNDZW50cmFsIiwibGluayI6Imh0dHBzOi8vam9ic2NlbnRyYWwuY29tLnNnL2pvYi9maW5hbmNpYWwtY29uc3VsdGFudC1qM241cW03MXIybjJwMmR3amg3P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Organizational Development Consultant", "company_name": "Randstad Singapore", "location": "Singapore (+1 other)", "via": "via Shortlisted Jobs | Singapore", "description": "about the company My client is in the consultancy space providing professional certification and solutions for human capital. Currently, they are in search of a consultant proficient in Organizational Development/ Occupational Psychology space to oversee projects targeted at developing human capitals in organizations. about the job Joining as a Manager of the team, you will... read more on Shortlisted Jobs | Singapore", "extensions": ["1 day ago", "$5K–$6K a month", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time", "salary": "$5K–$6K a month"}, "job_id": "eyJqb2JfdGl0bGUiOiJPcmdhbml6YXRpb25hbCBEZXZlbG9wbWVudCBDb25zdWx0YW50IiwiY29tcGFueV9uYW1lIjoiUmFuZHN0YWQgU2luZ2Fwb3JlIiwiY29tcGFueV9taWQiOiIvZy8xMWc3MGI1MG1yIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiazRNazI5V1dBZE45d0lDZUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZZQkNyY0JRVTVWWDA1eFZHWnpjbkYxTjFsUmEyRldWakpoYjJkV1kxZDVkMjlIUWpVdGNsUXpObmhGTVdSd1JqWlpaVmRxUlZwSk9XWXljMjF3UXpGNmJ6ZDZlbXN3YVU4MVRFcG1kMEk0YUhOMllXeHNWbFl4U2paQ1JtNHpTVEZrU0ROSFFWQmZlVzE0V1hSVldra3pOVlF6YldkNFVFaGFWSFZSYTJkdVdVVkNMVGx3TjJGNGJEWndabTlRTVhwUFVtczJORFZrY1d3NFIzZFdaRVJ4WjJaVU5UaEdhakJxY1RKTVoyNWxPVzR6Y1hCdWEyUjFWR3R6RWhaTGJqWkRXVXRxU0U0NVNGVnpRVmN4YlhCcVVVTlJHaUpCVDAxWlVuZENkazFwZFdKb1kyMVlWMnBuUkRGalFqWm5jalIzVVUxSmRVUjMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY182MSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBTaG9ydGxpc3RlZCBKb2JzIHwgU2luZ2Fwb3JlIiwibGluayI6Imh0dHBzOi8vc2cuc2hvcnRsaXN0ZWRqb2JzLmNvbS9qb2JzL3JhbmRzdGFkLXNpbmdhcG9yZS1vcmdhbml6YXRpb25hbC1kZXZlbG9wbWVudC1jb25zdWx0YW50LTc1OTY3Lz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Functional Consultant – Microsoft Dynamics ERP – Finance", "company_name": "Hitachi Solutions", "location": "Singapore", "via": "via SmartRecruiters Jobs", "description": "Company Description\n\nHitachi, Ltd. is ranked as the 102nd largest company in the world according to Fortune 500 and operating in 100 countries. Hitachi, Ltd. was founded on a principle of delivering innovations that answer society’s challenges. With our talented team and proven experience in global markets, together we can Inspire the World! Hitachi prides itself on hiring a diverse workforce. We are more innovative when we bring people from all walks of life together. Our success is based on our employees who share a common commitment to innovation and creativity.\n\nHitachi Solutions, Ltd is a subsidiary company which is 100% owned by Hitachi, Ltd. and provides ICT solutions and services. Hitachi Solutions, Ltd. has 3,000 Microsoft Professionals and is one of the largest Microsoft Dynamics System Integrator across the world.\n\nJob Description\n\nJOB OBJECTIVES\n\nTo be able to provide full cycle implementation, consulting, configuration, training, installation and support for clients using... Microsoft Dynamics ERP. It is expected that the Functional Consultant has deep knowledge of GL, AP, AR, FA and Bank Management experience and exposure to other modules such as Inventory, Supply Chain, Project Accounting.\n\nJOB RESPONSIBILITIES\n• Work through client teams across different business units to gather requirements and communicate effectively.\n• Configure Microsoft Dynamics ERP Financial Modules based on the requirements\n• Advise customer organization on solution usage and help minimize gaps between standard product customer's business processes with creative configuration.\n• Prepare Business Process Discovery Requirements and functional specification for customizations required\n• Experienced in working with Management Reporter 2012 and configuring reports\n• Ability to demonstrate Microsoft Dynamics ERP in Conference Room Pilots\n• Understand multiple enterprise systems, their high level functions and put together process flows, gap analysis, and create business mapping.\n• Test the functions and the features being developed and confirm that they fulfil the business requirements.\n• Plan and perform data migration using DIXF into Microsoft Dynamics ERP\n• Prepare User Manuals and deliver training to end users\n• Provide pre-go live and post go live end user support.\n• Other duties as deemed necessary for the job.\n\nQualifications\n\nJOB QUALIFICATIONS\n• Bachelor’s Degree\n• CPA or Cost Accounting certification is highly desired\n• Microsoft Dynamics AX certification and/or experience in Microsoft Dynamics 365 for Finance and Operations, AX 2012 R2, R3 or AX 7/D365FO are a plus\n• At least two years’ experience in ERP implementation, configuration, system design or related business experience\n• Experience in configuring General Ledger, Bank Management, Accounts Receivable, Accounts Payable, Fixed Assets, Management Reporter is required\n• Experience in Expense Management, Multi-company, Project Accounting, Trade and Logistics is a plus.\n• Knowledge on Localization Requirements / Financial Policies and Procedures is a Plus\n• Proficient with Excel, PowerPoint, Outlook and Word.\n• Excellent English writing skills and verbal skills\n• Locally-based candidates are preferred\n\nAdditional Information\n\nOUR COMPETITIVE EDGE\n\nWe work together in a dynamic and rewarding work environment. We have an experienced leadership team, excellent technology and product expertise, and strong relationships with a broad base of customers\nand partners.\n\nWe offer competitive compensation and benefits package,regular performance review, performance bonuses, and regular trainings.\n\nWhat is it like working here?\n• We pride ourselves on being industry leaders and providing an enjoyable work environment where our people can grow personally and professionally. Hitachi is the place people can develop skills they’re excited about.\n• We recognize our profitability and project success comes from our team—great people doing great things. As such, we pursue profitable growth and expanded opportunities for our team.\n• We offer challenging and diverse work across multiple industries and reward creativity and entrepreneurial innovation.\n• We respect, encourage, and support each individuals needs to continually learn and grow personally and professionally. We are committed to fostering our people.\n• We believe that investing in our community is just as important as investing in our organization. To that extent, we fundraise, volunteer, and allocate funds to support local charities.\n• We listen. Every employee has something important to say that can contribute to enriching our environment.\n• We compensate fairly. And while employees might come for the paycheck, they stay for the people. Our people are the reason we are exceptional. This is something we never forget", "extensions": ["22 hours ago", "Full–time"], "detected_extensions": {"posted_at": "22 hours ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJGdW5jdGlvbmFsIENvbnN1bHRhbnQg4oCTIE1pY3Jvc29mdCBEeW5hbWljcyBFUlAg4oCTIEZpbmFuY2UiLCJjb21wYW55X25hbWUiOiJIaXRhY2hpIFNvbHV0aW9ucyIsImNvbXBhbnlfbWlkIjoiL2cvMTIxbHl2ajkiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJIU3huc3lvdTNZN1Jwd2FqQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdllCQ3JjQlFVNVZYMDV4VVVWaE5ERldhR1ZzZFU5a2QxVnpiRFZWY25VdE9WbHZOM015YVdOdFpGRmZURmhMYW0xaU1IVkZUMWRSWTFaS1lVUktPR0ZZUTJoVlZGSkdTSGRTTFZwaFowZE9TVTlYTlVsc1JUZzJOVWxqUnpKM1MxUmZSRkpEWHpKUVdXUXhUbDlFWDJ0SFRHNWFkVFJHYXpoMVEyNXlkV3hFTVZGc1lWWjNNakZZYzJ4bVptcGFRMlJUWVRCbVJuSk1ZM0I2TjFBNFdVdE9ibk5VWkRZeWFXVlNZbWQ2WXpOTVJHNDNiWGt3ZUZKRU0yaFpFaFpMYmpaRFdVdHFTRTQ1U0ZWelFWY3hiWEJxVVVOUkdpSkJUMDFaVW5kQ1NUVk9kREZSYzI1V1JETnhjak5YUzNkYUxXMUJaV1ZFT1RSMyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzY5IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFNtYXJ0UmVjcnVpdGVycyBKb2JzIiwibGluayI6Imh0dHBzOi8vam9icy5zbWFydHJlY3J1aXRlcnMuY29tL0hpdGFjaGlTb2x1dGlvbnMvNzQzOTk5NzQzNjQ0NzA0LWZ1bmN0aW9uYWwtY29uc3VsdGFudC1taWNyb3NvZnQtZHluYW1pY3MtZXJwLWZpbmFuY2U/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Business Operations", "value": "GC06"}, {"text": "Human Resources", "value": "GC15"}, {"text": "Sales and Retail", "value": "GC26"}, {"text": "Accounting and Finance", "value": "GC01"}, {"text": "Protective Services", "value": "GC23"}, {"text": "Science and Engineering", "value": "GC27"}, {"text": "Management", "value": "GC18"}, {"text": "Advertising and Marketing", "value": "GC03"}, {"text": "Legal", "value": "GC17"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Customer Service", "value": "GC10"}, {"text": "Social Services and Non-Profit", "value": "GC28"}, {"text": "Art, Fashion and Design", "value": "GC05"}, {"text": "Healthcare", "value": "GC14"}, {"text": "Energy and Mining", "value": "GC21"}, {"text": "Sports Fitness and Recreation", "value": "GC29"}, {"text": "Education", "value": "GC11"}, {"text": "Personal Care and Services", "value": "GC22"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "Consultant", "value": "consultant"}, {"text": "Senior consultant", "value": "senior consultant"}, {"text": "Security consultant", "value": "security consultant"}, {"text": "Recruitment consultant", "value": "recruitment consultant"}, {"text": "Lead consultant", "value": "lead consultant"}, {"text": "Associate consultant", "value": "associate consultant"}, {"text": "Principal consultant", "value": "principal consultant"}, {"text": "Associate", "value": "associate"}, {"text": "Financial consultant", "value": "financial consultant"}, {"text": "Functional consultant", "value": "functional consultant"}, {"text": "Presales consultant", "value": "presales consultant"}, {"text": "Technical consultant", "value": "technical consultant"}, {"text": "Application consultant", "value": "application consultant"}, {"text": "Devops consultant", "value": "devops consultant"}, {"text": "Pre-sales consultant", "value": "pre-sales consultant"}, {"text": "Solution consultant", "value": "solution consultant"}, {"text": "Consultants", "value": "consultants"}, {"text": "Development consultant", "value": "development consultant"}, {"text": "Engineer", "value": "engineer"}, {"text": "Hr consultant", "value": "hr consultant"}, {"text": "It consultant", "value": "it consultant"}, {"text": "Senior", "value": "senior"}, {"text": "Services consultant", "value": "services consultant"}, {"text": "Solutions consultant", "value": "solutions consultant"}, {"text": "Business", "value": "business"}, {"text": "Business consulting", "value": "business consulting"}, {"text": "Consulting", "value": "consulting"}, {"text": "Director", "value": "director"}, {"text": "Education consultant", "value": "education consultant"}, {"text": "Hcm consultant", "value": "hcm consultant"}, {"text": "Infrastructure", "value": "infrastructure"}, {"text": "Investment consultant", "value": "investment consultant"}, {"text": "Manager", "value": "manager"}, {"text": "Project manager", "value": "project manager"}, {"text": "Recruitment consultants", "value": "recruitment consultants"}, {"text": "Sap consultant", "value": "sap consultant"}, {"text": "Software engineer", "value": "software engineer"}, {"text": "Specialist", "value": "specialist"}, {"text": "Support consultant", "value": "support consultant"}, {"text": "Systems consultant", "value": "systems consultant"}, {"text": "Technology consulting", "value": "technology consulting"}, {"text": "Academy", "value": "academy"}, {"text": "Accountant", "value": "accountant"}, {"text": "Architect", "value": "architect"}, {"text": "Beauty consultant", "value": "beauty consultant"}, {"text": "Cloud consultant", "value": "cloud consultant"}, {"text": "Consultancy", "value": "consultancy"}, {"text": "Data engineer", "value": "data engineer"}, {"text": "Electrical engineer", "value": "electrical engineer"}, {"text": "Employee", "value": "employee"}, {"text": "Finance consultant", "value": "finance consultant"}, {"text": "Financial services", "value": "financial services"}, {"text": "Gastroenterologist", "value": "gastroenterologist"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Internship", "value": "INTERN"}, {"text": "Part-time", "value": "PARTTIME"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Accounting", "value": "/business/naics2007/5412"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Engineering Services", "value": "/business/naics2007/5413"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Real Estate", "value": "/business/naics2007/53"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Wholesale", "value": "/business/naics2007/42"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "SingTel", "value": "/m/020zfl"}, {"text": "EY", "value": "/m/0g9jc"}, {"text": "Infosys", "value": "/m/01k8x6"}, {"text": "SearchAsia Consulting Pte Ltd", "value": "/g/11fy260nhz"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "Deloitte SEA", "value": "/g/11f_g4x9d_"}, {"text": "Geco Asia", "value": "/g/11gk72_bt_"}, {"text": "OAKTREE CONSULTING", "value": "/g/11g70jfhtq"}, {"text": "Central Provident Fund Board", "value": "/m/0615qb"}, {"text": "NCS", "value": "/m/0282746"}, {"text": "Trustwave", "value": "/m/0n3xjf5"}, {"text": "Ensign InfoSecurity", "value": "/g/11g4jhymjr"}, {"text": "HCL SINGAPORE PTE. LTD.", "value": "/g/11fy25ngsv"}, {"text": "Horangi", "value": "/g/11fm41wdh3"}, {"text": "LINKBYNET", "value": "/g/11f00s44gb"}, {"text": "NTT", "value": "/m/05mybp8"}, {"text": "RECRUIT EXPRESS PTE LTD", "value": "/g/11g706hzhq"}, {"text": "Randstad", "value": "/m/08pt1z"}, {"text": "Randstad Singapore", "value": "/g/11g70b50mr"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "UBS", "value": "/m/031rxp"}, {"text": "Xcellink Pte Ltd", "value": "/g/11c73prcqy"}, {"text": "Alight", "value": "/g/11fj9r012s"}, {"text": "Avanade", "value": "/m/094456"}, {"text": "Avensys Consulting", "value": "/g/11g7022gjf"}, {"text": "CBRE", "value": "/m/090r7m"}, {"text": "Golder", "value": "/m/02qx9bq"}, {"text": "Hitachi Solutions", "value": "/g/121lyvj9"}, {"text": "IBM", "value": "/m/03sc8"}, {"text": "Marsh & McLennan", "value": "/m/053rw"}, {"text": "Mott MacDonald", "value": "/m/043l4j"}, {"text": "NTT Ltd.", "value": "/m/01c3fq"}, {"text": "Qualtrics", "value": "/m/080nnft"}, {"text": "SAP", "value": "/m/01pf4l"}, {"text": "Techcom Solutions Pte Ltd", "value": "/g/11c73vztx3"}, {"text": "TraceLink", "value": "/g/11c73g93qt"}, {"text": "Turner & Townsend", "value": "/m/0cfy6xp"}, {"text": "Thatz", "value": "/g/11dxpx4g1l"}]}]}