{"search_metadata": {"id": "6082796b9790544d6c9f3481", "status": "Success", "json_endpoint": "https://serpapi.com/searches/32f6734d4478ee03/6082796b9790544d6c9f3481.json", "created_at": "2021-04-23 07:38:19 UTC", "processed_at": "2021-04-23 07:38:19 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28project+manager%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=50", "raw_html_file": "https://serpapi.com/searches/32f6734d4478ee03/6082796b9790544d6c9f3481.html", "total_time_taken": 1.19}, "search_parameters": {"q": "(project manager) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "50"}, "jobs_results": [{"title": "Senior Group Manager, Program & Project Management (KYC)", "company_name": "BNY Mellon", "location": "Singapore", "via": "via BNY Mellon Careers", "description": "• Manages multiple KYC projects, and acting as primary contact for internal clients and groups within the organization for projects that are large in scale. May manage some project managers or lead transformation programs as required. The person will be responsible for Global KYC Transformation project management activities with focus on client management, relationship management as well as project reporting, project planning, issue/risk identification and tracking, scope management, estimation.\n• Serves as a senior liaison between internal clients and other stakeholders to ensure delivery of KYC assigned projects on time, within budget, and to specification. Has regular contact with peers throughout the firm and externally, including regulators and professional organizations. Ensures project delivery is in conformance with company methodologies and standards, as required. Leads status meetings for major projects and facilitates risk mitigation and resolution of more complex issues.\n•... Proactively manages multiple teams of project resources, both internal and external, as required depending on project needs. Acts as a KYC subject matter expert and provides guidance on complex business or technical issues, in the space of KYC.\n• Directs recruitment efforts at various stages during programs. Manages and develops direct and leads matrix teams to maximize their collective contributions.\n• Assists in identifying KYC business unit requirements as part of transformation initiatives. Creates project and process specifications and coordinates with project teams to ensure delivery on schedule and to budget.\n• Depending on project, may manages multiple project management team members or lead matrix teams consisting of project or operational team members.\n• Responsible for the achievement of multiple team goals and objectives. Acts as senior point of escalation as required for Singapore KYC team for KYC transformation related initiatives.\n\nQualifications\n• Bachelor's degree or the equivalent combination of education and experience in business management or related field is required.\n• 10-15 years of total work experience with at least 3-5 years in management preferred. Project Management experience preferred. Project Management Professional (PMP) certification and/or Prince2 certification is preferred.\n• Strong experience in all aspects of KYC CDD (Customer Due Diligence), including local requirements, knowledge of the end to end AML cycle and control frameworks.\n\nBNY Mellon is an Equal Employment Opportunity Employer.\nOur ambition is to build the best global team – one that is representative and inclusive of the diverse talent, clients and communities we work with and serve – and to empower our team to do their best work. We support wellbeing and a balanced life, and offer a range of family-friendly, inclusive employment policies and employee forums.\n\nPrimary Location: Singapore-Singapore-Singapore\nJob: Operations\nInternal Jobcode: 70178\nOrganization: KYC Contracts AML Scanning-HR16425\nRequisition Number: 2103272", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgR3JvdXAgTWFuYWdlciwgUHJvZ3JhbSBcdTAwMjYgUHJvamVjdCBNYW5hZ2VtZW50IChLWUMpIiwiY29tcGFueV9uYW1lIjoiQk5ZIE1lbGxvbiIsImNvbXBhbnlfbWlkIjoiL20vMDJ2cHM1eCIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IkItMmhmR21mQUNlcE5rc3dBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhVMjUxVDNSdk1IRldiRE5YTmxnMmNEazJSMFJNUVdJd00yZHpSRVIxY0V4MGQzVXdNakJMYlV4M1JqWjRMV3BhVjNabVkzRTNjVlJRTlVGek1IVk9VRkZLV0RsWU5sYzNaRWh4UjBsM0xYWmpWRk5JTW5obmJsVk1ZVkpsTjBSaVlUZENlRzFhVVdaSVQwRmtiRXRHVkRabVJuVmxaamhVZURWdlQxRmtZM0JqWVhWdWJXNXRiMk5JVmtKUU5IWXdWVmx4ZVdGdlNqUnhTVkZSRWhaaE0yMURXVXhwVDA5elYzTjBVV0V3TkVwRWIwSm5HaUpCVDAxWlVuZEJRelV4Tm5sR1NDMWlURXMzWDNwNldUaFJNM3B1ZUVscFlqVkIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY183IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJOWSBNZWxsb24gQ2FyZWVycyIsImxpbmsiOiJodHRwczovL2pvYnMuYm55bWVsbG9uLmNvbS9qb2JzLzIxMDMyNzI/bGFuZz1lbi11c1x1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Senior/ Manager (Project), Office of Academic Informatics (Contract)", "company_name": "Singapore Health Services Pte Ltd (SingHealth HQ)", "location": "", "via": "via Joblum Singapore", "description": "You will plan and oversee all aspects of the assigned inter-dependent projects throughout their project lifecycles and complete them within the defined scope, time and cost constraints. You will ensure accurate allocation of suitable resources throughout the project and lead multi-disciplinary teams comprising varying levels of personnel, vendors, and users to create and deploy successful projects.\n\nYou will develop the project plan through planning detailed activities, resource planning, conducting cost estimations per project, evaluating potential solutions, effecting change management and making recommendations to stakeholders to resolve business problems. You will work with stakeholders to establish and gain consensus on project goals, objectives and deliverables. You will guide and manage the project team to deliver the deliverables aligned to overall project objectives and set expectations for periodic and milestone reviews including status reports, project risk identification... and other dashboards.\n\nYou will also be involved in project implementation and work with multiple parties to manage the entire procurement process. You will drive the project to meet scheduling, budget, manpower and technical quality targets, as well as document project requirement specifications, scope changes, and manage the issues and risks register that affect implementation. You will determine and resolve issues associated with project implementation and conduct regular project progress and status reviews to manage, track and report the progress and performance of the project, as well as recommend schedule changes and cost or resource adjustments if required. You will drive good project management practices and governance within the IT team.\n\nJob Requirements:\n• Degree in Computing, Business Administration or related field with at least 8 years of experience in project management or equivalent and hands-on experience in at least 1 full project development life-cycle\n• Experience in stakeholder management and people management. Prior experience in healthcare is an advantage\n• Project Management Professional (PMP), Certified Information Technology Project Manager (CITPM) certification is an advantage\n• Strong leadership, communication and analytical skills\n• Excellent people skills to deal with all levels of staff including medical, nursing, administrative and IT staff\n• Positive and able to work independently\n• Motivated and constantly looking to upskill while keeping abreast of the latest technological advancements\n\nThis is a 1-year contract position with potential for renewal", "extensions": ["2 days ago", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IvIE1hbmFnZXIgKFByb2plY3QpLCBPZmZpY2Ugb2YgQWNhZGVtaWMgSW5mb3JtYXRpY3MgKENvbnRyYWN0KSIsImNvbXBhbnlfbmFtZSI6IlNpbmdhcG9yZSBIZWFsdGggU2VydmljZXMgUHRlIEx0ZCAoU2luZ0hlYWx0aCBIUSkiLCJjb21wYW55X21pZCI6Ii9tLzA4bTc1ZiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6InZrLVFQaUtBdmhLQi1DRHlBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVzc0NDb3dDUVU1VlgwNXhVV3RIYWtacU9WcG5WM2xCZEVWU2NUUjJURk5DZUdWYU4yVjFVMUZmUzBOZlZGUnhlRTR3WDNsR1dqZHFUM2hsUVV4QkxTMUdWVzU1Y2xab1pqWktiVXhtTmpKS1EzbzFjbU54UkhSeVlTMUlaRVZaYW1FMlkyNXRha3RxY1hWeFoyeEpWV3BOVVV0SlZVaERORXB0WDJoYWF6SmFhbkZFUWxoMlJubFViVk5TV21kTlkyOWpZVWxqWVVWVWFFdHRSVVJGVkZWeGFHYzJhemt6WjI4d05VeHFNR2gwTmt0TWFIazJWMXBNU2tocFVFNWZlVFJhTW5NMlRHNXZTMFpVYjNKcFREZHdSRGRyYkdSdWFrWTRZek14VVMxNWFWQlFUMUpDU1RoU1JIVkdiMWxXYVVadU5GWkNZMEUzT1RkTk1XaEhXRWxVYVdNNE0yNWtaMUp4ZEZadFNVOVdNeElXWVROdFExbE1hVTlQYzFkemRGRmhNRFJLUkc5Q1p4b2lRVTlOV1ZKM1FsSXhabHAxYlhvemJsbDFNMjE0UlVaU1pVUnlVR3RGYlcxWFp3IiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMTQiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9ibHVtIFNpbmdhcG9yZSIsImxpbmsiOiJodHRwczovL3NnLmpvYmx1bS5jb20vam9iL3Nlbmlvci1tYW5hZ2VyLXByb2plY3Qtb2ZmaWNlLW9mLWFjYWRlbWljLzYyODI5Nj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Project Manager (Mobile Network/ Contract/ $5000)", "company_name": "People Profilers Pte Ltd", "location": "Singapore", "via": "via JobsCentral", "description": "- 3months contract (Renewable)\n\nJob Description\n• Orchestrating the flow of services and materials for the optimal progress of the customer’s project to fulfill contractual customer commitment.\n• Preparing, planning, executing, monitoring, controlling and closing the project according to\n• contractual scope and commitment against project budget using global tools and processes.\n• Define project scope, goals and deliverables that support business goals in collaboration with senior management and stakeholders\n• Effectively communicate project expectations to team members and stakeholders in a timely and clear fashion.\n• Ensure meeting the sales KPIs as per agreed with regional team.\n• Evaluation and analysis of the overall risk level of the project, implementation of risk management in Project.\n• Ensure complete Delivery Package implementation and final site acceptance.\n• Look for project inefficiencies (like integration bottleneck) and remove them with the core project management... team.\n• Estimate the resources and participants needed to achieve project goals Determine and assess need for additional staff and/or consultants and make the appropriate recruitments if necessary during project cycle.\n• Set and continually manage project expectations with team members and other stakeholders. Delegate tasks and responsibilities to appropriate personnel Identify and resolve issues and conflicts within the project team Identify and manage project dependencies and critical path.\n• Plan and schedule project timelines and milestones using appropriate tools.\n• Track project milestones and deliverables.\n• Develop and deliver progress reports, proposals, requirements documentation, and presentations.\n• Determine the frequency and content of status reports from the project team, analyze results, and troubleshoot problem areas\n• Proactively manage changes in project scope, identify potential crises, and devise contingency plans\n• Ensure implementation of change and claim management.\n• Hand over the network to care phase after acceptance.\n• Take lead in all proof of concept deployment activities & submit daily/weekly update to all the stakeholders.\n\nRequirements\n• Great educational background, preferably in the fields of management or telecommunication\n• Proven working experience as a project manager in the telecommunication sector\n• Having experience in managing project related to MOBILE NETWORKS/OPTICS/GPON\n• Excellent client-facing and internal communication skills\n• Excellent written and verbal communication skills\n• Solid organizational skills including attention to detail and multi-tasking skills\n• Strong working knowledge of Microsoft Office\n• PMP / PRINCE II certification is essential.\n\nAll Successful candidates can expect a very competitive remuneration package and a comprehensive range of benefits.\n\nKindly email your resume in a detailed Word format to [Click Here to Email Your Resume]\n\nWe regret that only shortlisted candidates will be notified.\n\nPeople Profilers Pte Ltd\n\nTel: 6950 9754\n\nEA Registration Number: R1655911\n\nEA Personnel: Choi Syeulgi", "extensions": ["2 days ago", "$4.5K–$5K a month", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time", "salary": "$4.5K–$5K a month"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIgKE1vYmlsZSBOZXR3b3JrLyBDb250cmFjdC8gJDUwMDApIiwiY29tcGFueV9uYW1lIjoiUGVvcGxlIFByb2ZpbGVycyBQdGUgTHRkIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJyTnhkLUk4azJLTFl1R3VvQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnNDZW50cmFsIiwibGluayI6Imh0dHBzOi8vam9ic2NlbnRyYWwuY29tLnNnL2pvYi9wcm9qZWN0LW1hbmFnZXItbW9iaWxlLW5ldHdvcmstY29udHJhY3QtNTAwMC1qM3Axd3M3NmMyMTF5MDE3OXFzP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Program Manager", "company_name": "Sciente Consulting Pte. Ltd.", "location": "Singapore (+1 other)", "via": "via Shortlisted Jobs | Singapore", "description": "We have an excellent opportunity for a program manager with forward-looking vision and knowledge, experience and qualities to lead the transformation of our technical infrastructure with cloud capabilities to better support the in-house application.Mandatory Skill-set Degree in Information Technology, Computer Engineering, Computer Science or Information System; Has at least 5 years of working experience as... read more on Shortlisted Jobs | Singapore", "extensions": ["2 days ago", "Contractor"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Contractor"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9ncmFtIE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJTY2llbnRlIENvbnN1bHRpbmcgUHRlLiBMdGQuIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJScEZfa0NVNElyd2xOWnRRQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFNob3J0bGlzdGVkIEpvYnMgfCBTaW5nYXBvcmUiLCJsaW5rIjoiaHR0cHM6Ly9zZy5zaG9ydGxpc3RlZGpvYnMuY29tL2pvYnMvc2NpZW50ZS1jb25zdWx0aW5nLXB0ZS1sdGQtcHJvZ3JhbS1tYW5hZ2VyLTc1MDc2Lz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Client Project Manager", "company_name": "NTT", "location": "Singapore", "via": "via Careers At NTT", "description": "In a constantly changing world, we work together with our people, clients and communities to enable them to fulfill their potential to do great things. We believe that by bringing everyone together, we can solve problems using innovative technology that can create a world that is sustainable and secure. At NTT, we encourage you to remain continuously curious, as that is what keeps you fast, flexible and relevant. No two days will be the same but that is what will help you grow and realize your full potential.\n\nThe power is in your hands to do great things. It’s time to lead the change, be the authentic you, to solve difficult challenges, to set the pace of change and to unleash your potential.\n\nWant to be a part of our team?\nThe Associate Client Project Manager is the entry level job within the Project and Programme Management – Client Implementation Projects job family.\n\nThe Associate Client Project Manager leads and directs concurrent client projects classified as standard or... complex. The individual may also be involved in larger scale projects supervised by a Senior Project and/or Programme Manager.\n\nThe primary responsibility of the Associate Client Project Manager will be to interface with all project stakeholders to take projects from original concept through to final implementation, including handing over to Operations (whether internal to NTT or into the client's support operations).\n\nRadford information:\n\nCoordinates all aspects of a product or service offering project for a client, from inception to installation. Installations may involve acceptance of capitalized equipment or enterprise software systems, or system integration or consulting projects/engagements. May work at client site from time to time. Typically involves extensive interaction with sales, systems engineering, product development, and other members of cross-functional teams. Project is typically focused on the delivery of new or enhanced products to improvement of customer satisfaction through the use of technology. Project management skills, rather than technical skills, are key, but a strong technical background is often required to manage competing interests. Typically oversees schedules and budgets to ensure goal attainment. Survey Tip: This role is most common in a software or professional services organization in which the individual does not have responsibility over product development, but does have overall project management responsibility. This job manages specific projects that have a distinct beginning and end.\n\nWorking at NTT\n\nKey Roles and Responsibilities:\n• Interface with all project stakeholders to take projects from original concept through to final implementation\n• Contribute to the pre-sales process by providing proposals\n• Ensure that the project delivers the as-sold solution, remains within baseline budget and is delivered on time, while achieving quality criteria and maintaining client satisfaction\n• Manage client satisfaction, commitment and expectations to high service levels and manage escalations adequately\n\nKnowledge, Skills and Attributes:\n• Ability to establish strong relationships with internal stakeholders and external clients\n• Excellent client centricity skills and ability to work at client sites\n• Ability to manage customer satisfaction, commitment and expectations to high service levels and manage escalations adequately\n• Excellent written and verbal communication skills\n• Excellent team building skills and ability to work in high-pressure environments\n• Ability to manage urgent and complex tasks simultaneously\n• Good business acumen and commercial skills\n• Passionate, strong initiative, self-driven with commitment to succeed\n• Good influencing ability whilst taking a collaborative approach\n• Decisive with good attention to detail ability\n• Ability to promote project services to both internal stakeholders and external clients\n• Competent in project change management\n\nAcademic Qualifications and Certifications:\n• Project Management degree or equivalent with related experience\n• Relevant project management certifications preferably PMP\n• ITIL certification is preferable\n\nRequired Experience:\n• Demonstrated entry level project management experience preferably in a multi-national professional services environment\n• Proven client engagement experience\n• Demonstrated understanding of the project life cycle\n• Demonstrated competency in project change management\n• Proven experience managing expectations when balancing alternatives against business and financial constraints\n\nWhat will make you a good fit for the role?\n\nStandard career level descriptor for job level:\n• Learns professional concepts\n• Applies company policy and procedures to resolve routine tasks\n• Gets detailed work instructions\n• Deals with issues of limited scope\n• Solutions to problems are easy to solve\n• Builds internal relationships\n• May not require any prior professional work experience\n\nJoin our growing global team and accelerate your career with us. Apply today.\n\nEqual opportunity employer\n\nNTT is proud to be an equal opportunity employer with a global culture that embraces diversity. We are committed to providing an environment free of unfair discrimination and harassment. We do not discriminate based on age, race, color, sex, religion, national origin, disability, pregnancy, marital status, sexual orientation, gender reassignment, veteran status, or other protected category", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDbGllbnQgUHJvamVjdCBNYW5hZ2VyIiwiY29tcGFueV9uYW1lIjoiTlRUIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJLZ0w1b08wRm1ZQkdSVFN0QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIENhcmVlcnMgQXQgTlRUIiwibGluayI6Imh0dHBzOi8vY2FyZWVycy5oZWxsby5nbG9iYWwubnR0L2dsb2JhbC9lbi9qb2IvUi01MzM0Mi9DbGllbnQtUHJvamVjdC1NYW5hZ2VyP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Project Manager", "company_name": "AdNovum Singapore Pte. Ltd.", "location": "Singapore (+1 other)", "via": "via AdNovum - Singapore", "description": "Your role\n\nAs a project manager in a leading software engineering company, your role will be vital in sustaining and building credibility with customers. You will get to liaise with end customers and external partners and suppliers, while managing a team of technical resources to meet and support SLAs. With a high degree of autonomy and your proactivity you will be responsible for maintenance projects as well as projects newly awarded to AdNovum.\n• Coordinate internal resources and third parties/vendors to the successful execution of projects\n• Ensure that all projects are delivered on-time, within scope and within budget\n• Assist in the definition of project scope and objectives, involving all relevant stakeholders and ensuring technical feasibility\n• Ensure resource availability and allocation\n• Develop a detailed project plan to be shared with the client and used to monitor and track progress\n• Create and maintain comprehensive project documentation wherever applicable\n• Delegate... project tasks based on staff members’ individual strengths, skill sets and experience levels\n• Track project performance, specifically to analyze the successful completion of short and long-term goals\n• Manage changes to the project scope, project schedule and project costs using appropriate verification techniques\n• Perform risk management to minimize project risks\n• Establish and maintain relationships with client, stakeholders, third parties & vendors\n• Report and escalate to management when needed\n• Perform Pre-Sales activities (Respond to Tenders, RFP, Quotations, Sizing, customer demo etc.)\n• Liaise with Headquarters on all project management matters, regular reporting as well as resource sharing\n• Use and continually develop leadership skills\n• Maintain all tickets within SLA and escalate appropriately to minimize risks of LD\nYour experience and skills\n\nCandidates applying for this essential position should have:\n• Bachelor’s degree in information systems, computer science/ engineering or equivalent\n• At least 10 years working experience in IT, with 5 to 6 years in the field of IT service or project management\n• Proven ITSM / ITIL knowledge with experience in project management and strong hands-on experience in support operations management; corresponding certifications would be an asset\n• Experience in either government or finance projects\n• Experience with cost allocation, cost management and business analysis\n• Analytical, solution- and customer-oriented thinking and planning\n• High level of independence, flexibility and initiative\n• Strong negotiation skills with the ability to handle high stress situations\n• Communicative talent, entrepreneurial thinking and quick perception\n• Stakeholder management and influencing skills\n• Excellent English communication skills, both oral and written, in concise manner.\n• Strong understanding of MS Project, Jira and Excel is a must\n\nStrong plus to have:\n• Project Management Professional (PMP) / PRINCE II certification\n\nAbout us\n\nHeadquartered in Zurich, Switzerland, AdNovum has been delivering robust and secure software solutions for 30 years. Our belief in constantly challenging ourselves and delivering value has built us a reputation for outstanding software engineering expertise.\n\nAdNovum Singapore was established as the regional hub for APAC in 2010 and today, we have over 45 employees working on a multitude of projects across the finance, logistics and the public sectors.\n\nWhat project managers can expect at AdNovum:\n• Grow and thrive in security centric projects\n• Involvement with large-scale projects used on enterprise and national levels\n• Exposure to projects from various industries, including public sector\n• Opportunities to develop expertise in a preferred area\n• Mentoring by highly skilled and experienced colleagues\n• Well-equipped IT environment with state-of-the-art technology\n• Involvement with multiple stages of a project, from concept to go-live\n• Mutually respectful work environment with no micromanagement\n• Flat hierarchy to facilitate communication between roles\n• Healthy work-life balance\n• Clearly defined career path\n• Opportunities to travel and work with colleagues from various countries", "extensions": ["15 days ago", "Full–time"], "detected_extensions": {"posted_at": "15 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJBZE5vdnVtIFNpbmdhcG9yZSBQdGUuIEx0ZC4iLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjcxaDV4dzRRd0dLUzZDVWpBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQWROb3Z1bSAtIFNpbmdhcG9yZSIsImxpbmsiOiJodHRwczovL3d3dy5hZG5vdnVtLnNnL2VuL0FkTm92dW1TRy9jYXJlZXJzX2VudHJ5cG9pbnQvSm9iLmh0bWw/am9iSUQ9Mjk0NDcyOFx1MDAyNmdoX2ppZD0yOTQ0NzI4XHUwMDI2Ym9hcmRUb2tlbj1hZG5vdnVtXHUwMDI2bGFuZz1lblx1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Project Manager, Credit & Risk", "company_name": "Antaes Consulting SA", "location": "Singapore", "via": "via EFinancialCareers", "description": "Antaes is looking for a Project Manager, Credit & Risk to join our IT Business Unit in Singapore.\n\nAntaes Consulting is a strategy and technology consulting firm that supports its clients in the fields of Information Systems Management, Industrial Engineering & Expertise, and Optimized Organizational Performance.\n\nOur mission is to support our customers’ performance by providing them with optimized organizational solutions and appropriate technologies.\n\nAs a key player in the Swiss and international markets, Antaes has developed partnerships with the economic leaders of Switzerland, France, and Asia (Singapore). Today, we have more than 200 consultants who convey our values and passion for technology and consulting to our customers.\n\nAntaes places people at the heart of the strategy, with a view to building loyalty and trust with our teams of consultants and our partners. Looking for a long-term collaboration, we place ethics, transparency, and excellence as core values of our... politics.\n\nWe are looking for passionate and qualified senior consultants to join our team and contribute to the development of our company.\n\nBeing a consultant at Antaes Consulting:\n• A dynamic team with a start-up spirit\n• Constant support and career guidance\n• Monthly activities to get new contacts\n• Regular challenges to contribute to the development of the company\n• Special dedicated events (Winter & Summer Events…)\n\nRole\n• Contribute to IT projects in the banking industry for Antaes clients\n• Lead the project throughout all project phases, from initial preparation to migration completion and post-go-LIVE stabilisation\n• Manage project scope, budget and planning, reporting on progress, in full compliance with the organization’s project management lifecycle and governance\n• Lead all Functional and Development teams contributing to the project, including transversal enabling teams\n• Coordinate and keep informed sponsors and users representatives, while managing their expectations\n• Organize and chair meetings and committees with various stakeholders and contributors, IT, users, management, as needed during the execution of the project\n• Identify and manage project risks, dependencies with other projects, escalations to management and sponsors whenever necessary, and without any delay\n• Ensure project deliverables are properly documented, both from project perspective and IT asset perspective\n• Ensure that all project deliverables implemented respect project standards and are fully aligned and mutualized between sites and regions. Specific solution should only be considered to address regulatory, tax or accounting specific requirements\n• Project budget and planning definition breaking down the project into smaller and manageable transitions stages\n• Ensure the good relationship with business sponsors and stakeholders across the organization\n• Business requirements consolidation and formal validation\n• Prepare migration and testing strategy consolidation and formal validation\n• Centralize project information and status from all contributing teams and transversal teams\n• Organize and run dedicated meetings or committees, as required\n• Identify and report on project risks, attention points and issues to follow-up\n• Coordinate with all teams, from same division or other divisions, working on the same project\n• Contribute to the promotion of Antaes services on top of assistance provided to clients\n\nProfile\n• At least 15 experience in the Banking Industry, as a Functional or Technical Project Manager\n• New Lombard Credit knowledge\n• Strong project management skills required (e.g. PMP certification), with relevant experience in driving successfully big projects with budgets of multiple millions of dollars\n• Excellent verbal and written communication skills and the ability to interact professionally with a diverse group, managers, subject matter experts and technical teams.\n• Strong leadership skills, able to motivate big teams and overcome collective challenges during the project\n• “Can-do” attitude, able to work under stress and tight deadlines\n• Excellent communication skills in English, both oral and written.\n• Strong proficiency with project management tools as well as issue and release management, production and support (JIRA, Service Now, PPM tools, etc)\n• Strong proficiency with Powerpoint, Excel, Word, Visio\n• Singaporeans and PRs will only be considered", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIsIENyZWRpdCBcdTAwMjYgUmlzayIsImNvbXBhbnlfbmFtZSI6IkFudGFlcyBDb25zdWx0aW5nIFNBIiwiY29tcGFueV9taWQiOiIvZy8xMWM3M3oxbjI1IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiSEg0RUlPRnlrVFUzNlVkUUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZZQkNyY0JRVTVWWDA1eFUwUmpaVzVsWHpadmJGcG1ZMTlYU3pkTFVGQjRPRVJ2VEc1UVJWZERjemR2ZWtWbFV6UmFWM1l6ZDFoelp6VjNhVkpZVVd0VVYwSldVR3Q0VEZaSFdVUmFOblZHU25BeVpEbHVNMU53UVUxa2Fsb3RNa3h1YjAxUmNUQnFWVFF5ZDNoNGFtTlRPRE53V1MxbGNEQTJPRTVLV1RoVVdFZEtObDlFUWt4bE1rWm9XbW80V0hock1tRmxZMVJITVUxcVpEZHhORFJCTkVkT2REQklUMU5qVjB4MGNYaHhUVXhTTFdOVkxXSlJOME56RWhaaE0yMURXVXhwVDA5elYzTjBVV0V3TkVwRWIwSm5HaUpCVDAxWlVuZEJkMjVrVVcxSWNsbDZjbVJWTUUxTU9HbFJObmg1ZFU1RmFsOW4iLCJmY3YiOiIzIiwiZmNfaWQiOiJmY180NiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBFRmluYW5jaWFsQ2FyZWVycyIsImxpbmsiOiJodHRwczovL3d3dy5lZmluYW5jaWFsY2FyZWVycy5zZy9qb2JzLVNpbmdhcG9yZS1TaW5nYXBvcmUtUHJvamVjdF9NYW5hZ2VyX0NyZWRpdF9fUmlzay5pZDEwNDA0MjY1P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Project Manager, AppleCare Business Process Reengineering (BPR)", "company_name": "Apple", "location": "Singapore", "via": "via Jobs At Apple", "description": "Summary\nPosted: Feb 19, 2021\n\nRole Number:200211839\n\nImagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish!\n\nAn opening exists in the Asia-Pacific Business Process Reengineering Team of Apple Support for a Project Manager & Business Analyst including testing management. This role spans across the Asia-Pacific region on projects pertaining to Enterprise systems and processes. The role supports the following business areas - Field services repair management, warehousing, freight, service parts planning and procurement, online services, service contracts, business development/sales, contact centre operations and others.\n\nKey Qualifications\n\nKey Qualifications\n• You have 8 or more years of demonstrated experience on the below :\n• Knowledge and demonstrated experience in project management, including... management of scope, time and schedule, with balance of quality and risk management.\n• Effective communicator with proven success at all levels of business communication.\n• Facilitation, negotiation and conflict resolution skills, and demonstrated success at building teams and relationships with key people in local and remote sites.\n• Demonstrated sound interpersonal and communications skills.\n• Understanding of the business processes and ability to detail them as needed by the project.\n• Skilled in analysing and reengineering business processes, and recommending solutions.\n• Experience in facilitating workshops and brainstorming sessions to gather business requirements.\n• Experience and exposure to resolving complex project situations including issues and working to represent the project to senior leadership layers such as Directors, Senior Directors.\n• Proficient with MS Word, MS Excel, and basic project planning tools.\n\nDescription\n\nDescription\nThe Project Manager and Business Analyst role resides in the Apple Support business and is the primary interface between the Apple Support business teams and the Information Systems & Technology team and works across Enterprises processes and systems. The role will also provide cross functional leadership across functional business organisations. The activities range from preparing the required documentation based on the project size, get resources allocated to project team roles, effectively and clearly communicate project status across organisational hierarchy, manage project risk, monitor the change readiness of the business as well as conduct post implementation reviews for Apple Support. Effective project outcomes to required scope, time and quality are the needed accountability on this role.\n\nEducation & Experience\n\nEducation & Experience\nBachelors degree, MBA (desired)\n\nAdditional Requirements\n\nAdditional Requirements\n• - Consumer electronics industry experience (desired), service and support business experience (desired).\n• - Experience working in broader APAC region (necessary) and leading global project roles (preferred).\n• - Consulting background experience (desired).\n• - Lean Six Sigma exposure (desired).\n• - Project Management certification (desired).\n• - Knowledge of CRM (e.g. Peoplesoft) and ERP (e.g. SAP) systems deployed in the consumer electronics industry (preferred).\n• - Experience and familiarity with Apple's products is preferred\n• Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIsIEFwcGxlQ2FyZSBCdXNpbmVzcyBQcm9jZXNzIFJlZW5naW5lZXJpbmcgKEJQUikiLCJjb21wYW55X25hbWUiOiJBcHBsZSIsImNvbXBhbnlfbWlkIjoiL20vMGs4eiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Il95UmsxcjhqZmdocUNPdEdBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVzc0JDb3dCUVU1VlgwNXhVazVRWlhFdGJIUnFaVXhTVHpSTWNEUllObW80WDB0MlRWcEVOSGRpVWtoWWIxUnVhbVZvY21vMU1scEJhMnRCVkhndGRERnhTV0p2TldScGJXVnRNRGx0WW1sMlozWlRUMkl5TFRoS1pHWjBSRE5rUTFOTlJqZEVUbGh5U0hKdmJGSmxNVmhYTmpadFpHSTVjeTB5ZGpWdGVETnhhVzVUU0dWVllqaEVYM1oxVW5GdWNHTVNGbUV6YlVOWlRHbFBUM05YYzNSUllUQTBTa1J2UW1jYUlrRlBUVmxTZDBGaVFuSm9hWGx4UWpkeFh6aEVlRTA0ZW0weVNqWlNRbWRQYzFFIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNTQiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9icyBBdCBBcHBsZSIsImxpbmsiOiJodHRwczovL2pvYnMuYXBwbGUuY29tL2VuLXNnL2RldGFpbHMvMjAwMjExODM5L3Byb2plY3QtbWFuYWdlci1hcHBsZWNhcmUtYnVzaW5lc3MtcHJvY2Vzcy1yZWVuZ2luZWVyaW5nLWJwcj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "IT Project Manager - Intranet", "company_name": "Michael Page", "location": "Singapore (+1 other)", "via": "via Michael Page Singapore", "description": "About Our Client\n\nOur client is a leading technology solutions provider with strong presence within the region. They are looking to hire an IT Project manager - Intranet\n\nJob Description\n\nAs an IT Project Manager - Intranet, you will be responsible for the following:\n• Understanding and studying the current business projects to translate user requirements into functional documents for intranet content\n• Managing all intranet projects using SharePoint and other tools to provide insightful analytics to key stakeholders demonstrating the effectiveness of the intranet\n• Gathering end user requirements, designing and implementing solutions for the business.\n• Taking ownership for editorial control across the intranet to ensure it is in line with the content strategy, communication standards and guidelines\n• Managing stakeholders and sharing updates from time to time during the project life-cycle.\n• Overseeing the primary landing pages to maintain a proper balance of content and tools.\n\nThe... Successful Applicant\n\nAs a successful candidate you will have a bachelor's degree in computer science or equivalent with at least Minimum of 5 years of experience managing and implementing IT Projects for intranet, newsletter automation and landing pages in an MNC or professional services environment. You will have Strong understanding of the capabilities of SharePoint for intranet applications, and proven technical knowledge of Microsoft SharePoint, You will be Proficient in web programming languages such as HTML, CSS, JavaScript PMP certification would be advantageous\n\nWhat's on Offer\n• Permanent role\n• Newly created role", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJJVCBQcm9qZWN0IE1hbmFnZXIgLSBJbnRyYW5ldCIsImNvbXBhbnlfbmFtZSI6Ik1pY2hhZWwgUGFnZSIsImNvbXBhbnlfbWlkIjoiL20vMDRjeGxkdyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IndOOGRJUmMwYmxndXRZcjRBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhVazlKYzNGa2NtTjNjV2xsZG1Od2MxRTVjbE5FYUZGTVRWbzRkRXRwZVhWV1ZtcDJMVUpuY210WFVVTkVTM1ZKU0ZOV1VWbzFVSFpGYW5aNFowNXRXbUYyTkZOVWRYazRUSGxmTmtKTlN6Sk9RVGh0T1RkWVRuaFFkMUowVW5VM09VWlNkalZ1V2tFNGR6bHVNVUowV21KaWRGRjVhbkJMY0ZwWVJEZDBlRVF3Y25BeFprSnRSMHRRV1hobVdXZG1SWFJOU2pSNlVFWnRURkJSRWhaaE0yMURXVXhwVDA5elYzTjBVV0V3TkVwRWIwSm5HaUpCVDAxWlVuZENaM1J6VDBjNE1VazFVSFV3T0hGR09IUmZja2RWZFdvM2NIVjMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY182MiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNaWNoYWVsIFBhZ2UgU2luZ2Fwb3JlIiwibGluayI6Imh0dHBzOi8vd3d3Lm1pY2hhZWxwYWdlLmNvbS5zZy9qb2ItZGV0YWlsL2l0LXByb2plY3QtbWFuYWdlci1pbnRyYW5ldC9yZWYvNDE3NTQ5MD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Project Manager (G50)", "company_name": "IoTalents", "location": "Singapore (+1 other)", "via": "via Jobs007", "description": "Job Responsibilities:\n• Participate in RFI/RFP\n• Work on the project scoping during presales to size up the project management effort, and the write-out on project management section for proposal\n• Manage multiple projects ensuring project Scopes, schedule, resources and outcome are within project milestone timeline and budget\n• Manage project resources, vendors, contractors and deliver according to scope and schedule\n• Manage procurement and delivery\n• Ensure project signoff timely\n• Manage project financial with prudence\n• Prepare Project Management Life Cycle documentation\n• Conduct Project meetings and ensure project minutes timely\n• Conduct Project completion debrief to identify lessons learn to contribute to knowledge base\n• Update Project Repository folders regularly\n• Closely monitor, anticipate and escalate project issue early to address situation\n• Complying to PMO Governance Guidelines\n\nJob Requirements:\n• 5-10 years project management experience in mid-to-large scale... projects from SI environment\n• Delivered at least one complex Project of minimum SGD 1.5 million and team size of 10.\n• Experience in working on projects in large Enterprise Networks + Unified Communication, Security Base projects, with exposure to other IT Infra projects (systems and storage) e.g. projects on systems and storage virtualization, backup solutions, etc.\n• DC relocation/migration experience\n• Need security clearance for Government Projects\n\nAcademic/Professional Certifications:\n• Diploma or Degree in Information Technology\n• PMP or CITPM certified\n• Agile Scrum Methodology\n• ITIL Foundation V3\n• Certified Information Systems Security Professional (CISSP) - advantage\n• Preferably with CCNA/CCNP and/or MCSE/VCP certification", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIgKEc1MCkiLCJjb21wYW55X25hbWUiOiJJb1RhbGVudHMiLCJjb21wYW55X21pZCI6Ii9nLzExZHhxMTg3d20iLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJveDNwNFZVRl9KNEluRXNkQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VVhVNVZuVkRaV3RCVWtrMVEwcEJUazl2TTNwU2NWQmxiMGRmTTFWd1R6SlhXRTFXU0hVMk1ERXdiV3hsWTBveE5WQnZSWHBhVUc5dU5IUnNNMFZ3TFZCNWRWaEhSWHBMVFVGclNqTnpialp0ZFZBdGIwWmxaamxXWVc1elNuTTRaMFZhZWtNM1FtUjRUMjQxYTA5V1FUSnNTamhGY0U1b0xXUmZNVTFKZGpOSE5YZHJXWFoyYm5ScU5FOWZaMGhvU0hWeFdscFJZME0zWTNkM0VoWmhNMjFEV1V4cFQwOXpWM04wVVdFd05FcEViMEpuR2lKQlQwMVpVbmRFVjNOQ1YxQk1jWGhTZW1kelRuZFRkRTloZUZveFNFMXBZbVZuIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNjkiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9iczAwNyIsImxpbmsiOiJodHRwczovL2pvYnMwMDcuaW8vam9icy9mdWppdHN1LXNpbmdhcG9yZS9wcm9qZWN0LW1hbmFnZXItZzUwXzExMj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Management", "value": "GC18"}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Advertising and Marketing", "value": "GC03"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Media, Communications and Writing", "value": "GC20"}, {"text": "Transportation and Logistics", "value": "GC30"}, {"text": "Art, Fashion and Design", "value": "GC05"}, {"text": "Construction", "value": "GC09"}, {"text": "Education", "value": "GC11"}, {"text": "Human Resources", "value": "GC15"}, {"text": "Protective Services", "value": "GC23"}, {"text": "Property", "value": "GC24"}, {"text": "Science and Engineering", "value": "GC27"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "Project manager", "value": "project manager"}, {"text": "Program manager", "value": "program manager"}, {"text": "Manager", "value": "manager"}, {"text": "Delivery manager", "value": "delivery manager"}, {"text": "Project director", "value": "project director"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Senior", "value": "senior"}, {"text": "Consultant", "value": "consultant"}, {"text": "Coordinator", "value": "coordinator"}, {"text": "Deputy director", "value": "deputy director"}, {"text": "Director", "value": "director"}, {"text": "Group manager", "value": "group manager"}, {"text": "Operations", "value": "operations"}, {"text": "Scrum master", "value": "scrum master"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Services", "value": "services"}, {"text": "Vice president", "value": "vice president"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Engineering Services", "value": "/business/naics2007/5413"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Entertainment", "value": "/business/naics2007/71"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Management", "value": "/business/naics2007/55"}, {"text": "Real Estate", "value": "/business/naics2007/53"}, {"text": "Research", "value": "/business/naics2007/5417"}, {"text": "Retail", "value": "/business/naics2007/44"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": ".AB4Jjf.qPB6Vc{padding-right:11px}.qfpP8d{padding:7px 0 7px 11px}.S003Ke{flex:none}.ZoN4Lb{color:rgba(0,0,0,.54)}.nAXVG{color:#70757a}.IxQsL{color:rgba(0,0,0,.26)}.xFO1De{color:#fff}.ooFpK{color:rgba(255,255,255,.30)}.mtnwac{color:#4285f4}.WxeeKb{color:#34a853}.hIVRU{color:#f29900}.EXaTMc{color:#fbbc04}.sxn46d{color:#000}.gqMTF{color:#1a73e8}.zpn8Mb{color:#d93025}.dEUPmd{color:#1e8e3e}.PJNo1{color:#fbbc04}Actively Hiring", "value": "e"}, {"text": "Michael Page", "value": "/m/04cxldw"}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Nanyang Technological University", "value": "/m/0l49k"}, {"text": "Jobline Resources Pte Ltd", "value": "/g/11gp2647pn"}, {"text": "Randstad Singapore", "value": "/g/11g70b50mr"}, {"text": "GECO Asia", "value": "/g/11gk72_bt_"}, {"text": "Facebook", "value": "/m/0hmyfsv"}, {"text": "HP", "value": "/m/03mnk"}, {"text": "IoTalents", "value": "/g/11dxq187wm"}, {"text": "NCS Group", "value": "/m/0282746"}, {"text": "National University of Singapore", "value": "/m/01q460"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "OPTIMUM SOLUTIONS (SINGAPORE) PTE LTD", "value": "/g/11g70hkrbx"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "ACI HR Solutions Ltd", "value": "/g/11c73ryh3p"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Apple", "value": "/m/0k8z"}, {"text": "Avensys Consulting", "value": "/g/11g7022gjf"}, {"text": "BNP Paribas", "value": "/m/02qhk4"}, {"text": "Ceridian", "value": "/m/07f8h6"}, {"text": "Ensign InfoSecurity", "value": "/g/11g4jhymjr"}, {"text": "Humanica Asia Pte. Ltd", "value": "/g/11h1y98c9z"}, {"text": "Kerry Consulting", "value": "/g/11c73vtzc8"}, {"text": "Marsh and McLennan", "value": "/m/053rw"}, {"text": "NSEARCH GLOBAL", "value": "/g/11dxpksll4"}, {"text": "NTT", "value": "/m/05mybp8"}, {"text": "OakTree Consulting", "value": "/g/11g70jfhtq"}, {"text": "Salesforce", "value": "/m/07btr5"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "TEKsystems", "value": "/g/11b6g4bkv0"}, {"text": "Teradyne", "value": "/m/04bzqp"}, {"text": "Toshiba Tec Singapore Pte. Ltd", "value": "/g/11g9n9q547"}, {"text": "Trustwave", "value": "/m/0n3xjf5"}, {"text": "Wood Plc", "value": "/m/07vv9s"}, {"text": "Workiva", "value": "/m/0113m1rd"}, {"text": "A-it Software Services Pte Ltd", "value": "/g/11dxpy_gl_"}, {"text": "ABS Group", "value": "/g/11dxplj1z6"}, {"text": "AIA", "value": "/m/02r5cgx"}, {"text": "ASEAN CABLESHIP PTE. LTD.", "value": "/g/11b7dsfph2"}]}]}