{"search_metadata": {"id": "6082799dd737d7e16f331884", "status": "Success", "json_endpoint": "https://serpapi.com/searches/dde9bd592832d045/6082799dd737d7e16f331884.json", "created_at": "2021-04-23 07:39:09 UTC", "processed_at": "2021-04-23 07:39:09 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28data+scientist%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=60", "raw_html_file": "https://serpapi.com/searches/dde9bd592832d045/6082799dd737d7e16f331884.html", "total_time_taken": 1.98}, "search_parameters": {"q": "(data scientist) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "60"}, "jobs_results": [{"title": "Senior Professional Officer, Machine Learning & AI - JT - 2143", "company_name": "CTES Consulting Pte Ltd", "location": "Singapore", "via": "via Joblum Singapore", "description": "Our client, a tertiary education institute, is currently looking for a Senior Professional Officer, ICT in Machine Learning, AI and Data Analytics domain to join their esteemed organisation!\nThe Professional Officer acts as a first line mentor to students on hands-on and practical activities such as labs, student projects and IWSP to enhance the students’ technical problem solving skills and increase their preparedness for industry.\nYou will build area to support labs and projects initially for ICT programmes and eventually lead Machine Learning & AI Lab.The roles and responsibilities of this role include:\n• Work with faculty in the development, design, planning and set-up of laboratories for teaching and research activities. This may involve activities to plan, procure and manage equipment in the lab, provide training to staff and students on usage of specific laboratory or equipment as well as development of lab manuals.\n• Mentor students during hands-on projects and laboratory... activities for ICT year-1 and year-2 student to enhance their practical problem solving skills. This may involve conduct of relevant practical activities as well as supervision of students in their projects and laboratory assignments as a part of applied learning.\n• Guide students to navigate the industry environment during their Integrated Work Study Programme (IWSP).\n• Support the faculty in the supervision and assessment of students for IWSP, ITP (integrative team project) and for Final Year Projects/Capstones\n• When innovation project opportunities arise, participate in the project/s together with faculty and students.\n• Working in a team to manage and ensure the readiness, operations and proper maintenance of the laboratories resources.\n• Carry out Risk Assessment, and ensure compliance with Work, Safety and Health Regulations in the laboratories.\nIf you possess the following qualities, look no further, apply now!\n• A good Degree or Masters in Electrical/Electronic Engineering or Computing from a recognized University..\n• Proven working experience in Machine Learning / AI and Data Analytics field\n• Have a firm grasp of several programming languages, as well as experience dealing with a range of software and hardware.\n• Keen interest to support research and academic project work, with demonstrated ability in developing software solutions to technical problems.\n• Possess strong supervisory skills and enjoy working closely with students in an educational environment.\n• Self-starter with hand-on knowledge to setup network and server systems, manage software development environment and configuration activities to support testing and maintenance of information system, software applications, hosted services and websites\n• Demonstrate proficiency to stay up-to-date on emerging technologies and pursue professional certification programs. Industrial certifications in relevant areas will be an added advantage.\n• Professional Officers appointed at senior levels may have managerial responsibilities.\nAn exciting career awaits the right candidate! Click \"Quick Apply\" to register your interest now.\nAll applicants' CV will be treated with the strictest confidentiality. We regret to inform that only shortlisted candidates will be contacted", "extensions": ["13 days ago", "$7K–$9K a month", "Full–time"], "detected_extensions": {"posted_at": "13 days ago", "schedule_type": "Full–time", "salary": "$7K–$9K a month"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgUHJvZmVzc2lvbmFsIE9mZmljZXIsIE1hY2hpbmUgTGVhcm5pbmcgXHUwMDI2IEFJIC0gSlQgLSAyMTQzIiwiY29tcGFueV9uYW1lIjoiQ1RFUyBDb25zdWx0aW5nIFB0ZSBMdGQiLCJjb21wYW55X21pZCI6Ii9nLzExanJuNG0xeGMiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJiRVFzNEpSLUpVOUkyTEttQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFb2tDQ3N3QlFVNVZYMDV4VVdaakxVVlFabGt6U0dSUUxYUk1WMnMzVVZWQ2JtZHlPR1kxYW5KdlpuZGZkemhYY1hFNFFqZDBRalJGZUROdFoxb3pkVE01Um5reFFqRnpURXRxWm5neFZuQldUV1pSVDBSbFRtSkpZazV4YWtWSllrOWllbFk1WVZjMFJEWlNOaTAyYVRFM2MybE9URXQ1ZW5adVpGbGxPV1ZLVGtJMVJVeG5iMnM1Y0RCTlEyNUpjVUUyTkhaNVlXcHJObkpCU0ZneVNqWklVRjlXUlROT1YycFpUME5QVlRGdWVqZDRZVGxuVEdaSU1FWlNiV2RXU1VSeVJqTkpUMVkyYWtOdGIyUTVZa1ZXRWhSdWJtMURXVXA2WlVsTVNHNWZVV0YxZVdKM2J4b2lRVTlOV1ZKM1EwTTNXVTFMVWxaS1NXdzBNbmR3VEdadWFGRlVMVWxMY0hScWR3IiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JsdW0gU2luZ2Fwb3JlIiwibGluayI6Imh0dHBzOi8vc2cuam9ibHVtLmNvbS9qb2Ivc2VuaW9yLXByb2Zlc3Npb25hbC1vZmZpY2VyLW1hY2hpbmUtbGVhcm5pbmcvNjA5MTUwP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Technical Architect - Data Science-AI", "company_name": "Manpower Staffing Services (S) Pte Ltd", "location": "Singapore (+1 other)", "via": "via Monster", "description": "Job Description :\nJobs copes\n• Architecting and developing AI and machine learning applications\n• Responsible for solution architecture using Image processing and Computer Vision to enact solutions\n• Good Python programming, software development best practices, debugging/profiling\n\nJob Requirements\n• Bachelor's Degree in Computer Science, Statistics, or any related discipline\n• Around 5-6 years of relevant professional experience in data science / machine learning / AI\n• Familiar with deep neuron network model such as CNN, R-CNN, VGGNet, ResNet\n• Experience using OpenCV, OpenGL, DNN model tuning\n• Extensive experience with at least one mainstream deep learning framework such as PyTorch or TensorFlow\n• Familiarity with data science toolkit such as jupyter lab/notebooks, pandas, bash scripting, Linux environment\n• Azure Machine Learning\n• Solid understanding of algorithms, linear algebra, machine learning, computer systems/architecture, neural network under the hood details\n\nCristina... Malabuyoc Malijan EA License No. 02C3423 Personnel Registration No. R1111547\nPlease note that your response to this advertisement and communications with us pursuant to this advertisement will constitute informed consent to the collection, use and/or disclosure of personal data by ManpowerGroup Singapore for the purpose of carrying out its business, in compliance with the relevant provisions of the Personal Data Protection Act 2012. To learn more about ManpowerGroup's Global Privacy Policy, please visit https://www.manpower.com.sg/privacy-policy", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJUZWNobmljYWwgQXJjaGl0ZWN0IC0gRGF0YSBTY2llbmNlLUFJIiwiY29tcGFueV9uYW1lIjoiTWFucG93ZXIgU3RhZmZpbmcgU2VydmljZXMgKFMpIFB0ZSBMdGQiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImE2TU45ejY1Wng4UGNSeU9BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTW9uc3RlciIsImxpbmsiOiJodHRwczovL3d3dy5tb25zdGVyLmNvbS5zZy9qb2IvdGVjaG5pY2FsLWFyY2hpdGVjdC1kYXRhLXNjaWVuY2UtYWktbWFucG93ZXItc3RhZmZpbmctc2VydmljZXMtcy1wdGUtbHRkLXNpbmdhcG9yZS0yNTEyNDg3P3NlYXJjaElkPWIyMjYwNDMxLWEyZTMtNDNmZC1iOGJlLTMxMjdjZDAxOWE3NFx1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Machine Learning Engineer Intern (Enterprise Partnership & Solutions)-2021", "company_name": "TikTok", "location": "Singapore", "via": "via Bayt.com", "description": "About Enterprise Partnership & Solutions Team\nWe are a technology company operating a range of content platforms that inform, educate, entertain and inspire people across languages, cultures and geographies. Dedicated to building global platforms of creation and interaction, the company now has a portfolio of applications available in over 150 markets and 75 languages. It includes Toutiao, Helo, TikTok, Douyin, News Republic, Vigo, TopBuzz and FaceU, etc. The success of our products is attributed to the usage of cutting-edge machine learning technologies such as NLP, ML, CV, Data Mining, Speech&Audio, etc. Enterprise Partnership & Solutions team enables our enterprise customers a successful digital transformation with our advanced machine learning technologies. We are looking for talented individuals to join us - people who want to inspire creativity and co-create the future with us. Successful candidates must be able to commit to the following internship cycle below: -\n1. Off-cycle... Internship - 02 Aug to 17 Dec (20 weeks)\nPlease state your availability clearly in the comments section (Start date, End date). Responsibilities\n1. Provide artificial intelligence solutions for customers;\n2. Understand business needs and goals, and turn business problems into machine learning problems;\n3. Conduct cutting-edge research in machine learning algorithms, and apply the technology to different business scenarios.\n1. Undergraduate or Postgraduate with a background in Computer Science, Computer Engineering, Information Systems or a related technical discipline;\n2. Proficient coding skills and strong algorithm & data structure basis;\n3. Familiar with machine learning and/or NLP and/or data mining skills, preferably experienced in developing recommendation system, advertisement calculation, search engine;\n4. Great problem analysis and solving skills, passionate about solving challenges;\n5. Passionate about technology, good at communication and teamwork. Application deadline: 15 April 2021\n1. Applications will be reviewed on a rolling basis and we encourage you to apply early;\n2. Interview starts from February 2021", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJNYWNoaW5lIExlYXJuaW5nIEVuZ2luZWVyIEludGVybiAoRW50ZXJwcmlzZSBQYXJ0bmVyc2hpcCBcdTAwMjYgU29sdXRpb25zKS0yMDIxIiwiY29tcGFueV9uYW1lIjoiVGlrVG9rIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJMbGN3UEFmN3gwTFJtTEFtQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJheXQuY29tIiwibGluayI6Imh0dHBzOi8vd3d3LmJheXQuY29tL2VuL3NpbmdhcG9yZS9qb2JzL21hY2hpbmUtbGVhcm5pbmctZW5naW5lZXItaW50ZXJuLWVudGVycHJpc2UtcGFydG5lcnNoaXAtc29sdXRpb25zLTIwMjEtNTgxMDMwNDgvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Group Audit (PMO) , AVP - Audit Data Scientist", "company_name": "OCBC Bank", "location": "Singapore", "via": "via Laimoon.com", "description": "The position within Program Management Office in Group Audit focusses on driving the data science capabilities in the division. The core remit includes:\n• Collaborating with audit teams across countries to identify the key risk concerns (problem statements) where data science solutions could be applied.\n• Increasing the effectiveness of audit processes by developing data science solutions to deepen the risk discovery and insights into new and emerging risks. This includes applying predictive analytics and machine learning techniques into continuous risk assessments and continuous auditing\n• Creating an efficient data pipeline to ingest data from Group Audit Data Mart (GADM) and new data sources, and deploying the data science solutions in an automated environment\n• Introducing new ideas and technology to advance the effectiveness and sophistication of the data science solutions\n• Being a subject-matter-expert in the governance around the use of data science... solutions.\n\nQualifications\nThe ideal candidate would have the following:\n• * Postgraduate degree in Data Science, Statistics, Mathematics or a related field.\n• * Minimum 7 years of working experience in developing and deploying data science solutions to address specific problem statements. Competent in a variety of analytical tools such as Python, R, Hue Query, HiveQL, Apache Spark, SQL, SAS ML, QlikView, Tableau & Power BI and experience with data infrastructure such as Hadoop and sandboxes\n• * Highly curious with a passion for applying advance analytics techniques to solving problem statements relating to risks and controls assessments by the internal audit function. Experience in applying machine learning techniques and designing algorithms that are scalable and production-grade would be an advantage\n• * Strong communications skills to articulate complex technical solutions to non-technical auditors. A curious personality with the ability to \"think-out-of-the-box\" would do well in this role\n• * Strong believer in continuous and self-directed learning, and willingness to coach and train fellow colleagues in performing data analytics/developing data science solutions\n• * Seasoned in stakeholder management and self-motivated in driving outcomes and results.\n• LI-MLIU\n\nAccounting & Finance", "extensions": ["5 days ago", "Full–time"], "detected_extensions": {"posted_at": "5 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJHcm91cCBBdWRpdCAoUE1PKSAsIEFWUCAtIEF1ZGl0IERhdGEgU2NpZW50aXN0IiwiY29tcGFueV9uYW1lIjoiT0NCQyBCYW5rIiwiY29tcGFueV9taWQiOiIvbS8wNTVyMjciLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJWdTcxcUE1VUt2cXl1T3JhQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdDhCQ3FJQlFVNVZYMDV4VWxSVGJEbE5OVXR6TkZoc1dFcEJSME5NTjBkbU9VRk9ia3RGUVZKQ1NuZEJibU5tZDNoblRqRXhWVjh5ZDJ0aWREWTRNMlF5UW1OcFYweEpaWFpLU1cxV09VazVka2hVUWtabWVHOTZjbUpxY1V4d1JsTnNWVzlPVkRoNlptRnpRMmMwT0VSalRYaDZNMHROTVhKUmJVUlhiemh2TVV0SWRGVnpaM2RTVG1WdFNqZHlRVXhOV1VoMlpWQmxWMjlKWTJsS01Xa3lXR05mVVhwM0VoUnVibTFEV1VwNlpVbE1TRzVmVVdGMWVXSjNieG9pUVU5TldWSjNRVkk0Y1RKeFZIY3laM1p5T1ROZk5rRmFielE1VWpCMWEyNURadyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzIxIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExhaW1vb24uY29tIiwibGluayI6Imh0dHBzOi8vam9icy5sYWltb29uLmNvbS9qb2JzL2V4dGVybmFsdmlldy8yNjAxMzY4Mj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior AI / Machine Learning Engineer (Upto $7000)", "company_name": "People Profilers Pte Ltd", "location": "Singapore (+1 other)", "via": "via Neuvoo", "description": "Job Description\n\nResponsibilities\n• Work on problems that run the gamut from building Machine Learning / Deep Learning models to developing full-scale production systems.\n• Train and Predict on Gigworks’s unique data sets.\n• Build, deploy, maintain and optimize machine learning-based solutions.\n• Conduct experiments to test out different solutions to measure and understand their impact.\n• Analyze data and define metrics for feature evaluation and model performance.\n• Design and implement robust data pipelines.\n• Identify and build new approaches and methods for machine learning as we grow.\n\nRequirements\n• achelor/Master/PhD Degree in Computer Science, Math, EE or similar field.\n• +2 years of experience in distributed systems in production or in developing production-grade machine learning.\n• Strong analytical skills using SQL, Python, Spark, Sklearn etc.\n• Solid software engineering and coding skills. In addition to Python, experience in at least one backend language like Go, Scala... Java, C++ or other is required\n• Solid understanding of Machine Learning / Deep Learning and the existing frameworks such as Tensorflow and PyTorch\n• Experience with cloud-based big data and machine learning services is a plus\n• Self-motivated, curious, team-player, problem solver\n• Detail-oriented and focused in a dynamic and fast-paced working environment.\n\nAll Successful candidates can expect a very competitive remuneration package and a comprehensive range of benefits.\nKindly email", "extensions": ["7 days ago", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQUkgLyBNYWNoaW5lIExlYXJuaW5nIEVuZ2luZWVyIChVcHRvICQ3MDAwKSIsImNvbXBhbnlfbmFtZSI6IlBlb3BsZSBQcm9maWxlcnMgUHRlIEx0ZCIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoibTJzdG9kUjVsd3B5Ny1DZkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBOZXV2b28iLCJsaW5rIjoiaHR0cHM6Ly9zZy5uZXV2b28uY29tL3ZpZXcvP2lkPTNiZjM3NDIwMTMzZFx1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Senior Manager, Data Governance (BB-AA47A)", "company_name": "SINGAPORE TELECOMMUNICATIONS LIMITED", "location": "Singapore (+1 other)", "via": "via BeBee", "description": "Roles & ResponsibilitiesThis role is accountable to establish, develop, expand and optimize Data Governance Framework, Policy, Process & associated business solutions implementations under Singtel Group Data Office.Integrate and inter-operate data governance, data management frameworks and solutions together with IT and Business as per best industry practice.Support business units in data monetization journey with data governance: Evaluate and implement data governance business solutions to ensure their relevance and effectiveness in supporting business requirement Support business units in data monetization journey with data governance Drive development, adoption and optimization to improve overall data governance policy, processes and standards Provide expert consultation to business units and implement data governance policy, processes and standards Review, analyze, benchmark and approve business solution design from product companies, internal teams and vendors and lead... implementation of data governance standards Ensure that proposed solutions are aligned and conformed to the data landscape, roadmap and ToM (Target Operating Model) Responsibilities Enable Data Governance framework including managing the objectives, approach, processes, policies and procedures around data governance Build robust and scalable data governance ecosystem to support needs from internal and external users, regulators and compliance requirement Define data governance operational processes (e.g., data quality measurement, metadata management) in accordance with policies and standards, clearly articulating roles and responsibilities Provide expert consultation to business units and legal/privacy/Information security teams to establish and maintain data policies and standards that enable use-cases and ensure regulatory compliance Provide expert consultation to assist business units in identify and setup of critical data elements including the setup of business glossary, lineage, data catalogue and data quality Work collaboratively & consultatively with group data governance, business units, Group IT to deliver enterprise objectives around data governance Identify, design, and implement internal process & framework improvements: automating manual operational processes and control for data governance implementation Responsible for reviewing and recommending any Data Sharing requests from the business units to the Group Data Governance Committee Support and contribute to development of guidelines and standards for data classification, data security, privacy with Risk, Compliance and Regulatory functions Think strategically by proposing business metrics / alternative approaches to measure data governance value Accountable for preparing and publishing Data Governance & quality metrics and KPI dashboards Engage in Change Management processes for enterprise wide change initiatives and projects to ensure that Data Governance Framework and Standards are implemented in Change Initiatives Collaborate with the relevant parties to ensure the correct processes, people, and technology are in place in order to support the data governance framework Work with Group IT, data scientist and business analytics team to assist in data governance related issues and proved effective solutions Requirements Bachelor’s degree in IT, Computer Science, Software Engineering, Data, Business Analytics or equivalent Certification in industry standard data architecture discipline or similar (e.g. DCAM, DAMA) Minimum 10 years of experience in data or corporate governance setup and operationalization Experience in operating under Group Data Office organization Expert in consulting and helping business to develop data quality business rules, data catalogue, business glossary Ability to develop, implement & optimize complex data governance solution and issues Experience in Telco Data ecosystem, data model, Data Lake Experience in Data, Privacy, Protection implementations & operationalization Experience in Big Data and associated platform / technology knowledge Data encryption, security governance techniques and methodology will be advantageous Data migration methodology and controls (on premise and could environment)Tell employers what skills you haveDataData GovernanceData ManagementGovernanceInformation TechnologyIT GovernancePolicydevelopment environmenteffectivenessdelivery of business solutions", "extensions": ["20 hours ago", "Full–time"], "detected_extensions": {"posted_at": "20 hours ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgTWFuYWdlciwgRGF0YSBHb3Zlcm5hbmNlIChCQi1BQTQ3QSkiLCJjb21wYW55X25hbWUiOiJTSU5HQVBPUkUgVEVMRUNPTU1VTklDQVRJT05TIExJTUlURUQiLCJjb21wYW55X21pZCI6Ii9tLzAyMHpmbCIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Ijc0NUhHcS1hSl9yMzladldBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVwOENDdUlCUVU1VlgwNXhVbnA1ZEZSdFVVdEtUbTQ1YW5KQ1dFZGtjMnBoU0hGeE9YcE9iekZmVG5ZeGRrOHRXVkZXVUVGaVVrSk1jamx0TjBoVVIxZEpTV0p3VVVneWJGVkhWbWhRTjNvMFl6aHlUek5yVjBscFoza3pNMHhxTVZKMVEyTkJSRTB0VkdVeFVqTm5TRk5pU2tSRU5teENXRzVJY1d0eE1tWnBTMXBLTWw5d00xRkhWakpEU0VSbVIwbHdNRU5pYVRVeWF6bFdVelowTFhORGFqQmpNazFDVEU4eGRGVmFjRVp4TkcxeVRtdFhSRkY1ZEdaSFkxcFFaMUpEUmpCb01taE1WRkpMUmtsT1dVUXpjVEpGUW5aV1NHTlRkMmx0UldKRGMxWkVVRzl6ZHhJVWJtNXRRMWxLZW1WSlRFaHVYMUZoZFhsaWQyOGFJa0ZQVFZsU2QwUlFSblE0V1U5TVNFMWhaMjVxU2xaVmN6RmhUblpUTjAxRFNIYyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzM0IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJlQmVlIiwibGluayI6Imh0dHBzOi8vc2cuYmViZWUuY29tL2pvYi8yMDIxMDQyMi1lNTBkZDA3YzIzOTY1NzI1YzcxMTQyNTRiYzNhYTQ3YT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Machine Learning Engineer, TikTok Ads", "company_name": "TikTok", "location": "Singapore", "via": "via Bayt.com", "description": "TikTok is the leading destination for short-form mobile video. Our mission is to inspire creativity and bring joy. TikTok has global offices including Los Angeles, New York, London, Paris, Berlin, Dubai, Mumbai, Singapore, Jakarta, Seoul and Tokyo. TikTok is one of the fastest growing apps in the world, and we’re looking for Algorithm Engineers to join our App Monetization team to support that growth and help us empower creators, connect people, and explore possibilities by building the next-generation monetization platform together. What You'll Do 1. Participate in the development of a large-scale Ads system for TikTok.\n2. Participate in the development and iteration of Ads algorithms by using Machine Learning.\n3. Partner with product managers and product strategy & operation team to define product strategy and features.\n1. Solid programming skills, proficient in C/C++.\n2. Familiar with at least one mainstream deep learning programming framework (TensorFlow/Caffe/MXNet), and its... architecture and implementation mechanism.\n3. Familiar with deep learning algorithms (CNN/RNN/LSTM, etc.).\n4. Ability to solve problems independently, good sense of teamwork and communication skills.\n5. Has experience with open sourced deep learning framework. Preferred Qualifications: 1. Familiar with main components for Ads system, including bidding, ranking and auction.\n2. Experience in resource management and task scheduling with large scale distributed software (such as Spark and TensorFlow", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJNYWNoaW5lIExlYXJuaW5nIEVuZ2luZWVyLCBUaWtUb2sgQWRzIiwiY29tcGFueV9uYW1lIjoiVGlrVG9rIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJ0TEh4d2xNSm52dnJ1ekh1QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJheXQuY29tIiwibGluayI6Imh0dHBzOi8vd3d3LmJheXQuY29tL2VuL3NpbmdhcG9yZS9qb2JzL21hY2hpbmUtbGVhcm5pbmctZW5naW5lZXItdGlrdG9rLWFkcy01ODg4NDYwMC8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Data Scientist - Listing", "company_name": "Shopee", "location": "Singapore (+1 other)", "via": "via Karkidi", "description": "Job Description:\n• Analyze massive product listing data to uncover insightful knowledge about product on e-commerce platform and translate research to business impact.\n• You are expected to be proficient in one of the machine learning domains, such Natural Language Processing (NLP), and Computer Vision (CV), etc. You will learn the business pain points, perform in-depth data wrangling and analysis, deploy advanced machine learning algorithms to tackle complex business problems.\n• At Shopee, you will work in a fast-paced, dynamic environment, where we quickly learn and adapt, and always passionate on problem solving with collaborative team spirit.\n\nRequirements:\n• Experience with programming languages such as Python\n• Experience on SQL, Spark.\n• Knowledge on Natural Language Process (NLP) and Computer Vision (CV) algorithms.\n• Familiar with various supervised and unsupervised models to uncover insights from large scale of text and image data.\n• Experience in Tensorflow or Pytorch... machine learning framework.\n\nPreferred Qualifications:\n\nHaving one or more of the following skills will be a big plus.\n• Working experience of deploying state-of-the-art deep learning models\n• Experience on e-commerce domain", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEYXRhIFNjaWVudGlzdCAtIExpc3RpbmciLCJjb21wYW55X25hbWUiOiJTaG9wZWUiLCJjb21wYW55X21pZCI6Ii9nLzExZ2gzZmszNHIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJVTEhCcTFabXJqSklfSGJuQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdDhCQ3FJQlFVNVZYMDV4VVVKV2JrMXpOMUZqVUd4aVJHRTRVbUZ2V0hCNlNWOWpkVzUzTlRRMWFFd3hOSGQxUkZGR2RtUmhNV2N0V0VoaGJrTXdVbFZtTlhSMlJEaGpXRmgwVFY5cGFqWkVhVVU1ZUZZMldqaFhRbDlxU21ndGVuUmZObTFJU1RSWE1tRnJha0ZuZUhKRVJtSjRSMGRvTXpkdmNVaFRibnAxUzBOV1NuTjZURlp5UVV0NlJDMXJjMnhuY0VkTFlucHNURWx3WlRabmQxRmxlV1p6WXpobkVoUnVibTFEV1VwNlpVbE1TRzVmVVdGMWVXSjNieG9pUVU5TldWSjNRbXhxZUZwb2JWbDRWbEZDVkhGVk5pMDRka2RQVjJWbWQxQnBVUSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzQ2IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEthcmtpZGkiLCJsaW5rIjoiaHR0cHM6Ly93d3cua2Fya2lkaS5jb20vam9iLWRldGFpbHMvMTEzMz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Data Science Engineer- Smart Mfg & AI", "company_name": "Micron", "location": "Singapore", "via": "via LinkedIn", "description": "Job Description\n\nMicron's vision is to transform how the world uses information to enrich life for all. Join an inclusive team focused on one thing: using our expertise in the relentless pursuit of innovation for customers and partners. The solutions we create help make everything from virtual reality experiences to breakthroughs in neural networks possible. We do it all while committing to integrity, sustainability, and giving back to our communities. Because doing so can spark the very innovation we are pursuing.\nMicron Technology's vision is to transform how the world uses information to enrich life and our commitment to people, innovation, tenacity, collaboration, and customer focus allows us to fulfill our mission to be a global leader in memory and storage solutions. This means conducting business with integrity, accountability, and professionalism while supporting our global community.\nDo you believe that data provides groundbreaking insight? Do you see data as an asset that... builds a competitive advantage? Great…so do we!\nMicron Technology operates in a highly competitive industry where innovation depends on hardworking minds extracting fresh insights from an ever-expanding data universe. We are seeking an experienced Data Engineer capable of designing and implementing large data solutions from data streams and intelligent systems, including transforming, supporting, configuring and enhancing existing data solutions. Are you experienced in applying Data Science & Data Engineering, advanced analytics and Machine learning to traditional data warehousing and Big Data, never-before-solved problems for industrial manufacturing at scale? Does this sound like the right team for you? Apply today!\nAs a Data Science Engineer at Micron Technology Inc., you will be a key member of a cross-functional team responsible for developing and growing Micron's methods and systems for extracting new insight for our expanding data streams. You will be collaborating with other data scientists, solution analysts, engineers, technicians and data mining teams to design and implement systems to extract data from Micron's business systems, transforming it into an actionable format, and as needed, creating dynamic presentation layers for use by high-level engineers and managers throughout the company. You will be creating new solutions, as well as, supporting, configuring, and enhancing existing solutions.\nResponsibilities and Tasks\nUnderstand the Business Problem and the Relevant Data Maintain an intimate understanding of company and department strategy Translate analysis requirements into data requirements Identify and understand the data sources that are relevant to the business problem Develop conceptual models that capture the relationships within the data Define the data-quality objectives for the solution Be a subject matter expert in data sources and reporting options\nDevelop, Support, Automate, and Orchestrate an Ecosystem of ETL Processes for Varying Volumes of Data Identify and select the optimum methods of access for each data source (real-time/streaming, delayed, static) Determine transformation requirements and develop processes to bring structured and unstructured data from the source to a new physical data model Develop processes to efficiently load the transform data into the data management system Troubleshoot operational escalations and resolve business partner issues in a timely manner with strong collaboration and care for business priorities.\nGenerate Insights Discovering new solutions and opportunities by analyzing data, identify patterns and trends Collecting & modelling large sets of structured and unstructured data from disparate sources Devising and applying models and algorithms for mining data. Working with unstructured data like video, images, etc.\nQualifications and Experience: Core statistical knowledge is required to be successful in this role. A degree or certification in Data science will be a plus. 2+ Years of knowledge in predictive & prescriptive modelling, machine learning. 3+ years developing, delivering, and/or supporting data engineering, advanced analytics or business intelligence solutions 3+ years of experience working with SAP HANA, SQL Server, SSIS and Power BI or Tableau platforms Experience with one of the cloud platforms is a must. (Azure, Google cloud or Snowflake) Experience with one of the following is a must. (R, Python, MATLAB, SAS) Experience in IIOT & Blockchain will be an added advantage. Experience working with any of the following technology or solutions is a plus (SAP, JDA, Salesforce, Big Data platforms, Cloud) Strong communication skills (written, verbal and presentation) Experience working in a global, cross-functional environment Ability to travel as needed\n\nEducation\n\nM.S. degree in Computer Science, Software Engineering, Electrical Engineering, Applied Mathematics or related field of study.\n\nAbout Micron Technology, Inc.\n\nWe are an industry leader in innovative memory and storage solutions. Through our global brands – Micron® and Crucial® – our broad portfolio of high-performance memory and storage technologies, including DRAM, NAND, 3D XPoint™ memory and NOR, is transforming how the world uses information to enrich life. Backed by more than 40 years of technology leadership, our memory and storage solutions enable disruptive trends, including artificial intelligence, 5G, machine learning and autonomous vehicles, in key market segments like mobile, data center, client, consumer, industrial, graphics, automotive, and networking. Our common stock is traded on the Nasdaq under the MU symbol. To learn more visit\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran or disability status.\nMicron prohibits the use of child labor and complies with all applicable laws, rules, regulations and other international and industry labor standards.\nMicron does not charge candidates any recruitment fees or unlawfully collect any other payment from candidates as consideration for their employment with Micron.\nFor US Sites Only: To request assistance with the application process and/or for reasonable accommodations, please contact Micron's Human Resources Department at 1-800-336-8918 or 208-368-4748 and/or by completing our\nKeywords: Singapore || North East (SG-02) || Singapore (SG) || Frontend Manufacturing || Experienced || Regular || Information Systems and Technology || ||Tier 4", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEYXRhIFNjaWVuY2UgRW5naW5lZXItIFNtYXJ0IE1mZyBcdTAwMjYgQUkiLCJjb21wYW55X25hbWUiOiJNaWNyb24iLCJjb21wYW55X21pZCI6Ii9tLzAyZ2RxeSIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImJxOFQwTklORkpISnMtYzlBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVza0JDb3dCUVU1VlgwNXhVbE10YUVvMlYwRXpVRFZTTFVWcVdUZDZOM1pxVm5VeFNtSlZRVFowYTJORlZEQmxMVFZyVUZBMU9VbGpibWhZUVRSaExVTnllRFpDTjB0dmJUQkxZM0pqUzBGVVQxOVRVRFpVTkdkUFRtMUxObmR5WW5vMmJXRlJSak4yWkRKb2RHdEJWMDFNVDNoalVqUlBhRkV5WW1wWU9EVlRka0p2ZVZsR1RVVXlSVWhKUkdSVFJWOFNGRzV1YlVOWlNucGxTVXhJYmw5UllYVjVZbmR2R2lKQlQwMVpVbmRDZWtWRU1UZFdRa2xyVGxCeFVVZHRhbkowTVVGcU5VTlVUMWQzIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNTMiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGlua2VkSW4iLCJsaW5rIjoiaHR0cHM6Ly9zZy5saW5rZWRpbi5jb20vam9icy92aWV3L2RhdGEtc2NpZW5jZS1lbmdpbmVlci1zbWFydC1tZmctYWktYXQtbWljcm9uLTI1MDcyODU5MzM/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Data Scientist, Financial Services", "company_name": "Kerry Consulting Pte Ltd, EA Licence No: 16S8060", "location": "Singapore", "via": "via Laimoon.com", "description": "Responsibilities\n\nWith this comes an exciting opportunity for inspiring individuals to join the high performing data scientist team. The team works alongside with specific data partner to derive useful insights for the Business. This individual will have the exposure to harness alternative data (geo-spatial, social media, transaction data etc) by building and deploying Machine Learning or other algorithms for data exploration.\n\nRoles\n\nThis candidate should have a degree in Statistics, Mathematics or Computer Science with hands-on commercial experience. He or she should have at least 3+ years' experience with analytical programming, including libraries for cleaning, reshaping, exploring and visualizing data (e.g. Python, R, Spark, D3). Experience in the finance/investment related area is preferred.\n\nTo apply\n\nInterested candidates, please send your CV to sherry@kerryconsulting.com quoting 13575.Due to the high volume of applications, only shortlisted candidates are... notified.\n\nRegistration No: R1104305\n\nLicence No: 16S8060\nTechnology", "extensions": ["16 days ago", "Full–time"], "detected_extensions": {"posted_at": "16 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEYXRhIFNjaWVudGlzdCwgRmluYW5jaWFsIFNlcnZpY2VzIiwiY29tcGFueV9uYW1lIjoiS2VycnkgQ29uc3VsdGluZyBQdGUgTHRkLCBFQSBMaWNlbmNlIE5vOiAxNlM4MDYwIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJDTExvMWRvTGtET2lQSERnQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExhaW1vb24uY29tIiwibGluayI6Imh0dHBzOi8vam9icy5sYWltb29uLmNvbS9qb2JzL2V4dGVybmFsdmlldy8yNDc1MTEwNT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}], "chips": [{"type": "Title", "param": "job_family_1", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Data scientist", "value": "data scientist"}, {"text": "Learning engineer", "value": "learning engineer"}, {"text": "Research associate", "value": "research associate"}, {"text": "Data science", "value": "data science"}, {"text": "Data engineer", "value": "data engineer"}, {"text": "Scientist", "value": "scientist"}, {"text": "Trainer", "value": "trainer"}, {"text": "Associate", "value": "associate"}, {"text": "Data analyst", "value": "data analyst"}, {"text": "Engineer", "value": "engineer"}, {"text": "Officer", "value": "officer"}, {"text": "Project manager", "value": "project manager"}, {"text": "Project officer", "value": "project officer"}, {"text": "Senior", "value": "senior"}, {"text": "Audit", "value": "audit"}, {"text": "Consultant", "value": "consultant"}, {"text": "Consulting", "value": "consulting"}, {"text": "Customer", "value": "customer"}, {"text": "Deputy director", "value": "deputy director"}, {"text": "Lecturer", "value": "lecturer"}, {"text": "Operations engineer", "value": "operations engineer"}, {"text": "Owner", "value": "owner"}, {"text": "Research engineer", "value": "research engineer"}, {"text": "Research scientist", "value": "research scientist"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Specialist", "value": "specialist"}, {"text": "Technical architect", "value": "technical architect"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Internship", "value": "INTERN"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Mining", "value": "/business/naics2007/21"}, {"text": "Research", "value": "/business/naics2007/5417"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Staffing", "value": "/business/naics2007/5613"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "NANYANG TECHNOLOGICAL UNIVERSITY", "value": "/m/0l49k"}, {"text": "Shopee", "value": "/g/11gh3fk34r"}, {"text": "DBS Bank Ltd", "value": "/m/01q7n5"}, {"text": "Michael Page", "value": "/m/04cxldw"}, {"text": "Micron", "value": "/m/02gdqy"}, {"text": "Air Liquide", "value": "/g/11dx9gkdhq"}, {"text": "Apple", "value": "/m/0k8z"}, {"text": "ByteDance", "value": "/g/11ghnfr0sv"}, {"text": "CTES Consulting Pte Ltd", "value": "/g/11jrn4m1xc"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "SEPPIC", "value": "/m/0g558ww"}, {"text": "Standard Chartered", "value": "/m/02hszk"}, {"text": "United Overseas Bank", "value": "/m/04gjd1"}, {"text": "AIR LIQUIDE INDUSTRIAL SERVICES PTE LTD", "value": "/g/11hg55y1rb"}, {"text": "Acronis", "value": "/m/04pjlt"}, {"text": "BIGTAPP PTE. LTD.", "value": "/g/11dxpsg5nn"}, {"text": "Burpple", "value": "/g/11dxps5yv5"}, {"text": "Covance by Labcorp", "value": "/m/03ll59"}, {"text": "DHL", "value": "/m/021086"}, {"text": "DUN & BRADSTREET (SINGAPORE) PTE. LTD.", "value": "/g/11g9mpp2ph"}, {"text": "Dathena Science", "value": "/g/11dxprdn6y"}, {"text": "EasyMile", "value": "/g/11bwh58jhs"}, {"text": "Engine Biosciences Pte. Ltd.", "value": "/g/11gxm8pr96"}, {"text": "Experis Singapore", "value": "/g/11dxpnwm3s"}, {"text": "FieldBox.ai", "value": "/g/1ptyw89vr"}, {"text": "GIC Private Limited", "value": "/g/11mpj15pxw"}, {"text": "Government Technology Agency", "value": "/g/11gh0528nq"}, {"text": "Health Sciences Authority", "value": "/m/0h7fhh"}, {"text": "Hewlett Packard Enterprise (HPE)", "value": "/g/11b804x9ty"}, {"text": "Infineon Technologies", "value": "/m/02jzkj"}, {"text": "Infinite Computer Solutions Pte Ltd", "value": "/g/11g9mj72yz"}, {"text": "Institute Of Technical Education (ITE)", "value": "/m/05_02p"}, {"text": "KPMG Singapore", "value": "/g/11dxpsb9nr"}, {"text": "Lazada", "value": "/g/1q5bfkdqp"}, {"text": "Ministry of Defence Singapore", "value": "/m/0566dt"}, {"text": "Ngee Ann Polytechnic", "value": "/m/05451y"}, {"text": "Republic Polytechnic", "value": "/m/06jgzw"}]}]}