{"search_metadata": {"id": "60827ae3af63046a88fa7cd8", "status": "Success", "json_endpoint": "https://serpapi.com/searches/47faa13d2db550ee/60827ae3af63046a88fa7cd8.json", "created_at": "2021-04-23 07:44:35 UTC", "processed_at": "2021-04-23 07:44:35 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28software+developer%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=160", "raw_html_file": "https://serpapi.com/searches/47faa13d2db550ee/60827ae3af63046a88fa7cd8.html", "total_time_taken": 1.31}, "search_parameters": {"q": "(software developer) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "160"}, "jobs_results": [{"title": "Lead, App Development", "company_name": "Mediacorp", "location": "Singapore", "via": "via Learn4Good", "description": "Description As the Lead, App Development, you will have responsibility to provide leadership in the development and management of all the front end app and web development activities for the company’s digital products, including video, audio and news & entertainment products. As part of this responsibility you will Lead a group of web, mobile and TV app developers to develop and maintain several video, audio, news and entertainment apps for online, mobile, Smart TV and media player environments Collaborate with product managers, UX managers and designers to specify, compile product requirements and build best in class products Where development is outsourced, you will manage and work with vendors to define development specifications, manage the development timelines and project plans, and ensure the apps are designed for quality, best performance and user experience Develop performance specifications for the front end apps and web environments that are best in class, market... competitive and ensure that the development of the apps deliver on these performance specifications Employ agile development methodology in product and app development Define and enforce processes for software review, unit testing, QA and documentation Conduct regular performance benchmarking with competing products and develop enhancement plans to ensure that the company’s digital products are performing competitively with market benchmarks in their respective categories Provide leadership in managing product stakeholders, interdepartmental technology collaborations, providing regular feedback, recommendations and managing expectations to deliver positive outcomes, technology innovation and best practices Manage the drafting, issuing and running of tenders to select vendors for the above development activities Work closely with vendors in the implementation of the above workstreams to ensure timely delivery of these projects\n\nRequirements Degree in Computer Science/Information Technology/Software Engineering Certified Scrum Master would be an added advantage At least 15 years of working experience in software and systems development Proven track record in building iOS/Android/Web/Smart TV applications for media or related products, with at least 5 years of hands-on development Experience in managing apps for multiple products and large teams of at least 20-25 developers Hands-on experience in reviewing, testing and adopting new technology Test automation using tools such as Selenium, Appium etc Expertise in software architecture development Knowledge in cloud and CDN infrastructure\n\nAbility to understand, analyse and articulate business vs operational vs technology impact of activities, development initiatives and work plans Experience in managing outsourced vendors and offshore developers will be a distinct advantage Agile project management practitioner Understand data analytics and deployment Understanding UX and development process Desired application/programming competencies – Java, Objective C, C++, C#, php, node.js, javascripts, JSON, AJAX, HTML5, Swift, XML, REST, SOAP, XCODE, MVC, CSS, .NET,\n\nMySQL, MS SQL", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJMZWFkLCBBcHAgRGV2ZWxvcG1lbnQiLCJjb21wYW55X25hbWUiOiJNZWRpYWNvcnAiLCJjb21wYW55X21pZCI6Ii9tLzAzcXR6MSIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Ii1sZC13Wl9OT2pPc3VQbzJBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV0OEJDcUlCUVU1VlgwNXhVa2xPTjBsUWNXeGhOMmxNV2poTU9EbFpYMkZsY2sxS2MwZHliVkptVmtjeE1IRk1NRzlEVm1sNGRITnRTRlpNZDI5eFl6bGZWamROZG1STVgyeFphVUZvWXpCaWFraFVNWHA2UVdZeVZXZHRaRGwxYm5GWFozcDVObVZsV1RkVE5WOWhURmRyZVRkNmRERlhkazV4WTJSU2VrWnViVWw2TTBVMmVXeDVRMGh5VWtKcFoydHhSamhSWlVZeWFqTkZkMXBuTkRkdE5UWjJTVXhCRWhRME0zRkRXVTFVYlV0SlVESjBRVmM1T1c5c2R4b2lRVTlOV1ZKM1FrcFhRa3hJWjBZMWNsTlFXV3hyWm05cE4yNW1WR0pWY21kRlVRIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMZWFybjRHb29kIiwibGluayI6Imh0dHBzOi8vd3d3LmxlYXJuNGdvb2QuY29tL2pvYnMvc2luZ2Fwb3JlL3NvZnR3YXJlX2RldmVsb3BtZW50LzI3MTI4NTM0Mi9lLz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Software Engineer IV ( Full Stack Java)", "company_name": "VISA", "location": "Singapore", "via": "via Bayt.com", "description": "Job Description and Responsibilities\n\nQualifications", "extensions": ["7 days ago", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciBJViAoIEZ1bGwgU3RhY2sgSmF2YSkiLCJjb21wYW55X25hbWUiOiJWSVNBIiwiY29tcGFueV9taWQiOiIvbS8wMWtxam4iLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJhaXJYdWNJVkdHYjNONFNPQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFc2tCQ293QlFVNVZYMDV4VW1sWlRWcHZWVEF4Y1ZsU1VtZzVYME5NVW5JM2EyOUdWMHhCZG5aNFMxcGhjQzF1WDBvMFFXWmZUMUZtVVhkcmMyWlFOR2Q2V1U0MVFtaE1ZVzlvVEVoMFpuZGZXbXhyZW00elVubFJjR1o0UVhobFJXTjJaVGRmTjNab1ZuZFRNSHBWYVdsU05YRllObTVOTUdsQlVIRmhSbFk0WDJkTWVqaFBORWhOVVVoTU5HMXFjbXNTRkRRemNVTlpUVlJ0UzBsUU1uUkJWems1YjJ4M0dpSkJUMDFaVW5kQ2FtaGxVRkozVUV0T2FsVnlhVWxyU1d4YWJ6bDJiSFo2Yms1biIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzE1IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJheXQuY29tIiwibGluayI6Imh0dHBzOi8vd3d3LmJheXQuY29tL2VuL3NpbmdhcG9yZS9qb2JzL3NvZnR3YXJlLWVuZ2luZWVyLWl2LWZ1bGwtc3RhY2stamF2YS01OTQ5MjY1OS8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Software Developer", "company_name": "Toss-Ex Pte Ltd", "location": "Singapore (+1 other)", "via": "via Jobs | Fidanto", "description": "Job Responsibilities\nDesign, build and maintain our web platform, enterprise software and mobile applications.\nWork in cross-functional teams with project managers, designers and business stakeholders to ship software on-quality and on-time.\nAnalyse requirements and write code that solves day to day challenges of business users\nDevelopment of new features\nEnhance and maintain existing technology stack-------------ServiceNow Developer\n\nPrimary Purpose:\n\nESMP Technical Consultant CIS, Technical Consultant CSA\nLevel: Level 3\nWork Location: Singapore\nBudget: Based on experience.\n\nResponsibilities:\n(i) Minimum three (3) years of experience deploying ITSM enterprise solutions and configuring ServiceNow ITSM system; and\n(ii) Must possess certifications in system administrator or equivalent in ServiceNow platform\n(iii) Preferably possess certification as a developer or equivalent in ServiceNow platform\n(iv) Proficient in design and developing custom application in ServiceNow platform\n(v... Preferably experience in implementing Discovery and Event management\n(vi) Preferably possess skillsets using JavaScript, SOAP, REST, HTML and XML.\n", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBEZXZlbG9wZXIiLCJjb21wYW55X25hbWUiOiJUb3NzLUV4IFB0ZSBMdGQiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IlF2SV81ejFoQ2puMEczd3ZBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9icyB8IEZpZGFudG8iLCJsaW5rIjoiaHR0cHM6Ly9zZy5maWRhbnRvLmNvbS9qb2JzL2pvYi1vcGVuaW5nL3NvZnR3YXJlLWRldmVsb3BlcnMtYXBwbGljYXRpb25zL3NvZnR3YXJlLWRldmVsb3Blci0yNzUyMTg4NzM/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Software Engineer - WiFi/Embedded system development", "company_name": "Realtek", "location": "Singapore", "via": "via NodeFlair", "description": "Job Description\n• Embedded system development\n• Wireless AP router software and firmware development\n• Network communication protocol development\n• Perform different types of testing on networking devices\n• Execution of pre-test for IoT/ Wi-Fi router related certification\n• Customer support and troubleshoot\n\nJob Requirement\n• Bachelor’s Degree or above in Computer science, Computer Engineering, Networking, telecommunication or electronics Engineering\n• Familiar with C/C++ and Linux system\n• Familiar with networking and embedded system development\n• Good communication and team working skills\n• Good problem solver, ability to troubleshoot and think out of box\n• WiFi development experience is an advantage\n• Passion in programming is a plus\n• Entry level /senior level are all welcomed\n• Bachelor's / Honours, Masters / PhD", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciAtIFdpRmkvRW1iZWRkZWQgc3lzdGVtIGRldmVsb3BtZW50IiwiY29tcGFueV9uYW1lIjoiUmVhbHRlayIsImNvbXBhbnlfbWlkIjoiL20vMDV3cm03IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiSExSUlBhRXdkVVdPQzVvQUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXNrQkNvd0JRVTVWWDA1eFV6UlVYMlk1TW14elh6QjBiMlZCY0RoaGFFMTRZa3czVFhvMUxWVXRZMjgyUjNoNldHcEdSVkpqTFZOVWNsSm9ValpxVm5KalZUTXlhRkp6V0Y5aVVGOW1URkJmVFVacWFubEVXazFOYjBGcVVVeEdWR1ZGUldWdVNDMW9lRXBoTkRCQ1IyazViMjFEY2pSM1FYaHhVelpIWjJ0TlJqaHZkUzFzV0VobFNscEpOM0pJT0V3U0ZEUXpjVU5aVFZSdFMwbFFNblJCVnprNWIyeDNHaUpCVDAxWlVuZERhMWxNTW14bVJXcHFTR1Z3Y3pOVldVWnBRV2RtYVhjMmQyWlIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18yNiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBOb2RlRmxhaXIiLCJsaW5rIjoiaHR0cHM6Ly93d3cubm9kZWZsYWlyLmNvbS9qb2JzL2xpc3RpbmdzLzc4Mjg/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Filenet Senior Developer / Developer", "company_name": "Jobline Resources Pte Ltd", "location": "Singapore (+1 other)", "via": "via Glassdoor", "description": "Responsibilities\n• Report to Development Lead\n• Develops software solutions by studying information needs; conferring with users; studying systems flow, data usage, and work processes; investigating problem areas; following the software development lifecycle.\n• Determines operational feasibility by evaluating analysis, problem definition, requirements, solution development, and proposed solutions.\n• Documents and demonstrates solutions by developing documentation, flowcharts, layouts, diagrams, charts, code comments and clear code.\n• Prepares and installs solutions by determining and designing system specifications, standards, and programming.\n• Improves operations by conducting systems analysis, recommending changes in policies and procedures.\n• Updates job knowledge by studying state-of-the-art development tools, programming techniques, and computing equipment; participating in educational opportunities; reading professional publications; maintaining personal networks; participating... in professional organizations.\n• Protects operations by keeping information confidential.\n• Provides information by collecting, analyzing, and summarizing development and service issues.\n• Accomplishes engineering and organization mission by completing related results as needed.\n• Supports and develops software engineers by providing advice, coaching and educational opportunities.\n• Provide level 2 and 3 support to business users.\nRequirements\n• Minimum 3 years work experience with the following languages and tools:\n• Experience in IBM FileNet P8, strong in IBM Case Manager. Experience in customization using widgets of IBM Case Manager and IBM content Navigator, designing the FileNet workflows.\n• Familiar to IBM FileNet Api/Web Service Development.\n• Experience in programming in Javascript jquery, json, C#\n• Experience in SQL server\n• Expertise in the design, implementation, and deployment of user-centric software, with focus on usability\n• Understanding and practicing of Agile methodologies\n• Certification in mobile development or equivalent\n• Good knowledge of DevOps, automated testing would be beneficial.\n\nShortlisted candidates will be offered a 1 Year Direct Contract employment", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJGaWxlbmV0IFNlbmlvciBEZXZlbG9wZXIgLyBEZXZlbG9wZXIiLCJjb21wYW55X25hbWUiOiJKb2JsaW5lIFJlc291cmNlcyBQdGUgTHRkIiwiY29tcGFueV9taWQiOiIvZy8xMWdwMjY0N3BuIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiYmplaC1BVWpFX2RyQ3ZTd0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRW9rQ0Nzd0JRVTVWWDA1eFVrMXlkbVJrYW5CYU1EQm1UbVZhTm14eFdHcG1iMTlDVFZWMGEwSkxkVWhaVVVoV1FuWTVTbU5WWWxaVmFEbGlZMFpqYUU1TlZ6SndWVmgwT1ZVNWMxUkdXSE5uVjJaSlpWRTNORTVRYkV4d1VXWXlNMGxNY1U1T1YwWXhUVEY2T1hGWlVrMWtNRGxxWkV0WlpYb3hjWGhVWjA5VVZuVlZSR2hFYTNsd05EWlhZamhvTUMxaWRXdzRTVUZVT1hsTmVHSkVTelZCVlZoNmN5MVhWa2xUVVVOQllqSlNMVmQzTmpGc1MwWTNPV2QzTVROS1RqazVTV2RVY2tOb2VHaGxVMGs1VFhaa0VoUTBNM0ZEV1UxVWJVdEpVREowUVZjNU9XOXNkeG9pUVU5TldWSjNRemQwWmpRelRFcHFNa2swYmpWdFFWOXZNME00V0hBMFlrVmxadyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzM0IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEdsYXNzZG9vciIsImxpbmsiOiJodHRwczovL3d3dy5nbGFzc2Rvb3Iuc2cvam9iLWxpc3RpbmcvZmlsZW5ldC1zZW5pb3ItZGV2ZWxvcGVyLWRldmVsb3Blci1qb2JsaW5lLXJlc291cmNlcy1wdGUtSlZfSUMzMjM1ODk2X0tPMCwzNF9LRTM1LDU2Lmh0bT9qbD00MDY0MDU2MzA1XHUwMDI2dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Adjunct Lecturer: Full-stack Software Developer", "company_name": "Generation", "location": "Singapore", "via": "via LinkedIn", "description": "We are seeking a talented full-time adjunct lecturer to deliver our 12-week junior full-stack software developer program that equips young people with the behavioral skills, mindsets, and technical skills needed to become a successful junior developer. The lecturer will work in collaboration with staff at TP and Generation Singapore program staff.\n\nTemasek Polytechnic (TP) is a leading institution of higher learning in Singapore founded in 1990. Together, TP and Generation Singapore are launching a new programme to train Cloud Support and DevOps practitioners in Singapore. This program prepares participants for the Cloud Support and DevOps practitioner roles with a specific focus on Microsoft Azure technologies.\n\nApplicants will be interviewed by both TP and Generation Singapore. If you are selected, you will sign a contract with TP, the details of which can be discussed during your interview. Interested applicants may apply by emailing your CV to Ms Paroma Ray ... paroma.ray@generation.org ).\nTo be successful you'll need: About you\nYou are an education expert (e.g. teacher, instructor, trainer) with software development experience, or a software development expert with experience instructing/teaching. You have an exceptional ability to tailor content to different learners and experience teaching online. You enjoy delivering sessions with energy and enthusiasm to generate excitement about learning new technical and behavioral skills. You build strong relationships with younger and older adults and have a proven record to ensure participants successfully complete the program.\n\nEssential\n\nRequirements\n• A bachelor’s degree or other relevant experience in Information Technology, Computer Science or a related field\n• At least 2 years experience teaching or coaching in an educational or corporate setting; experience with online or blended learning preferred\n• Experience working with adults and/or has extensive knowledge of current trends and issues in adult knowledge\n• Experience with the following languages: Java, JavaScript, React, SQL\n• Familiar with the following: coding foundations, web development, HTML, CSS, Bootstrap, Git & GitHub, Agile Software Development / SCRUM, Object-oriented programming and design, data structures and algorithms, Spring Boot\n• Relevant industry certifications, e.g. Oracle Certified Java Programmer or equivalent will be an advantage\n• Up-to-date knowledge and insights on software developer industry trends\n\nDesirable\n• 3+ years of experience in the above-mentioned areas\n• Experience teaching technical content to a non-technical audience\n• At least 1-year experience in teaching technical content covering the areas mentioned above.\n• Experience supervising other instructors or trainers\n• Competency in Microsoft Office skills (Excel, Word & PowerPoint) and Google Drive\n• At least one experience delivering training, coaching, or mentoring to a youth audience.\n\nMinimum Requirements\n\nMindsets and Capabilities\n• Motivational Fit . Passion for helping change the life trajectories of a diverse group of students (potentially including recent graduates, mid-career switchers, and disconnected populations).\n• Professionalism . This includes but not limited to adherence to a professional dress code, communications and engagement with supervisors, colleagues and students and pays close attention to detail.\n• Effective Communication . Excellent oral and written presentation skills in English – the language of instruction for all Generation trainings\n• Data Management . The ability to collect and analyse training data as required by Generation Programs.\n• Growth Mindset . Be self-reflective, openly receive feedback on his / her performance and should be able to apply feedback and pursue additional learning to improve his / her performance.\n• Solutions and Results Oriented . A positive, solutions-oriented attitude, drive for excellence.\n• Interpersonal Skills .\n• Strong cross-cultural skills that demonstrate the ability to engage well with participants.\n• The ability to be a team player.\n\nWhat you'll do:\nDelivery of Skills-based Training (70%) under the guidance of the Generation Curriculum and Instruction Lead\n• Follow the overarching structure and flow of the curriculum, including behavioral skills, mindsets, technical, and employment essentials sessions.\n• Leverage subject matter expertise during synchronous delivery of online sessions\n• Guide students through asynchronous (independent) learning modules and help solidify understandings debriefs and synchronous moments\n• Prepare and personalise sessions by reviewing curriculum materials and integrating stories or examples to increase participant learning.\n• Engage participants in active thinking and participatory learning using effective communication and facilitation techniques.\n• Differentiate instruction to meet individual learning needs and accommodate different learning styles.\n• Provide in-the-moment feedback to participants to clarify misunderstandings and/or encourage critical thinking.\n• Provide relevant and timely feedback to students on formative and summative assessments, including student projects.\n• Engage in Generation-sponsored instructional support, professional development and training.\n\nProgram Management (10%). Under the guidance of the Generation Programme Lead:\n• Input data using Generation’s technology platform (e.g., participant attendance, performance in class and assessments, etc.).\n• Any other administrative duties required to ensure successful operations of the program\n• Support with screening of candidates and, if necessary, prepare them to attend the training.\n\nStakeholder Engagement & Management (10%)\n• Collaborate with Programme Mentors, Generation and TP staff to identify and mitigate potential risks to participant success and achievement of their goals.\n• Collaborate with the Programme Lead and commit to acting on any feedback that intends to increase data completion to Generation’s global standards\n• Collaborate with the Curriculum and Instruction Lead to support program quality.\n\nParticipant Mentoring and Support (10%)\n• Build relationships with participants, develop an understanding of their personal strengths and challenges, and foster a supportive classroom environment.\n• Motivate and support participants to persevere through challenges and continue on their journey of professional and personal growth.\nAbout Generation\nWorldwide, more than 75 million young people are unemployed. But many employers can’t find people with the skills they need for entry-level jobs. Generation was created in 2014 to help bridge this gap—at speed and scale.\n\nWe’re building a skills-training methodology that can serve hundreds of thousands, and eventually millions, of young people a year. And we’re building proof that this training creates real business outcomes for employers, and lasting career impact for trainees—so everyone has the incentive to invest in skills. Our goal is to help our students achieve personal and professional success—and fundamentally change their life trajectories. Generation programs prepare unemployed or underemployed young people, aged 18 to 29, for jobs in four sectors: healthcare, technology, retail/sales, and skilled trades.\n\nToday, Generation is active in fourteen countries with diverse social, economic and labor-market contexts", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBZGp1bmN0IExlY3R1cmVyOiBGdWxsLXN0YWNrIFNvZnR3YXJlIERldmVsb3BlciIsImNvbXBhbnlfbmFtZSI6IkdlbmVyYXRpb24iLCJjb21wYW55X21pZCI6Ii9nLzExZ214aHc4dHMiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJfdDZ5ZjBJWVZIRzZQUmFrQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdDhCQ3FJQlFVNVZYMDV4VWs5TkxUZEtVMkZYVUd0NGJqVkdVQzB4YkhWd1VHNXpUWFZZZDFkU04yNUNUVWx0T1VoQ1ZVdHpjMFJrTkZCNlNFZFJYMVJsT0dwclZtWnBWWEpXUWtzd1VYVnZlR2h6VUVGaWEycGhXV281VEZGNlVXSm5kM1pDVm5wRFpIaGhZbk5FTW5KQ2VVbFhVVFIyWTFaaVJXWXhkalUxWkdKWk9FRk5VMWQ0Um5CdFQyNTBURmhOZUhONFpUWnJkVkV3VGxKb2FYaDZSekl6UWpkQkVoUTBNM0ZEV1UxVWJVdEpVREowUVZjNU9XOXNkeG9pUVU5TldWSjNRV3RRVldKeWEyRnNaWGxKVW1oRFl6VktZalZ5V1d0aFVHOVhRUSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzQyIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExpbmtlZEluIiwibGluayI6Imh0dHBzOi8vc2cubGlua2VkaW4uY29tL2pvYnMvdmlldy9hZGp1bmN0LWxlY3R1cmVyLWZ1bGwtc3RhY2stc29mdHdhcmUtZGV2ZWxvcGVyLWF0LWdlbmVyYXRpb24tMjI5NDc2MzAxOD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Low-Code Platform Developers (Outsystems), Business Consulting (BB-C4B66)", "company_name": "ERNST & YOUNG ADVISORY PTE. LTD.", "location": "Singapore", "via": "via BeBee", "description": "Roles & ResponsibilitiesAbout the opportunityTo be a part of the Project Team to deliver a custom-built software application on a low-code platform by following Agile Frameworks and DevOps practices Your key Responsibilities Working as an Agile Team Member, managing and executing a variety of tasks Interacting with Business Users as necessary to clarify requirements Taking responsibility for the quality of the software developed and delivered User Story Effort Estimation Software Development including meeting the Definition of Done Software Testing including fulfilling the Acceptance Criteria Creating Software Documents as require Skills & Attributes for success Contributing to setting-up, and execution of DevOps practices Software Deployment Software Maintenance and Support To qualify for the role, you must have: At least a degree or diploma in a relevant technical field For the Junior Developer position: At least 2 years of hands-on experience in custom-built software development... using a low-code platform For the Senior Developer position: At least 5 years of hands-on experience in custom-built software development using a low-code platform, and 2 years of experience in leading a Software Team of Developers and Testers Experienced in Agile Software Development Experienced in Web Applications, HTML, CSS and JavaScript Experienced in Software Integration using APIs and Web Services Experienced in Database Systems Ideally, you’ll also have OutSystems experience is a distinct advantage Scrum Ceremonies and Artefacts experience is a distinct advantage .NET Framework experience is an advantage Additional Business Education is a distinct advantage Low-code platform certification is a distinct advantage Scrum Certification is an advantage What we look forHighly motivated individuals with excellent problem-solving skills and the ability to prioritize shifting workloads in a rapidly changing industry. An effective communicator, you’ll be a confident team player that collaborates with people from various teams while looking to develop your career in a dynamic organization. What working at EY offersEY offers a competitive remuneration package where you’ll be rewarded for your individual and team performance. We are committed to being an inclusive employer and are happy to consider flexible working arrangements. Plus, we offer: Support, coaching and feedback from some of the most engaging colleagues around Opportunities to develop new skills and progress your career The freedom and flexibility to handle your role in a way that’s right for you About EY As a global leader in assurance, tax, strategy and transactions, and consulting services, we hire and develop the most passionate people in their field to help build a better working world. This starts with a culture that believes in giving you the training, opportunities and creative freedom to make things better. So that whenever you join, however long you stay, the exceptional EY experience lasts a lifetime. And with a commitment to hiring and developing the most passionate people, we’ll make our ambition to be the best employer by 2020 a reality. If you can confidently demonstrate that you meet the criteria above, please contact us as soon as possible.Join us in building a better working world.Apply today.Want to get to know us better?Visit a fan on Facebook: with us on Linked In: us on Twitter: us on YouTube: employers what skills you have.NET.NET Compact FrameworkAgileAgile & Waterfall MethodologiesAgile Application DevelopmentAgile MethodolgyAgile MethodologiesAgile TestingAgile Web DevelopmentCode ReviewSoftware DevelopmentWeb Development", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJMb3ctQ29kZSBQbGF0Zm9ybSBEZXZlbG9wZXJzIChPdXRzeXN0ZW1zKSwgQnVzaW5lc3MgQ29uc3VsdGluZyAoQkItQzRCNjYpIiwiY29tcGFueV9uYW1lIjoiRVJOU1QgXHUwMDI2IFlPVU5HIEFEVklTT1JZIFBURS4gTFRELiIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiNHhXSXVhbjQxNDFxTkFhN0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCZUJlZSIsImxpbmsiOiJodHRwczovL3NnLmJlYmVlLmNvbS9qb2IvMjAyMTA0MTctMTNmMTE5YmFmNDFhYzFkZmNkZjVkMDA0YjBiYzRiNjY/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Senior Software Analyst", "company_name": "Kelly Services (singapore) Pte. Ltd.", "location": "Singapore", "via": "via Monster", "description": "This is for our large global client and below are the details of the role.\n\n- 8 years in end to end SDLC - analysis ,application design & development, implementation, deployment and maintenance especially with J2EE stack technologies preferably in banking domain.\n\n- Exposer to both waterfall and Agile methodologies (Preferably SAFe)\n\n-Review code changes requests to identify potential improvements and to prevent errors, before approving and releasing the code.\n\n- Using coding standards and best practices to ensure quality.\n\n- Good hands-on experience with JAVA 8, Spring, Spring-boot, JPA/Hibernate, Tomcat, Oracle, Unit testing\n\n- Developing high-quality and detailed designs documentation.\n\n- Identifying risk and conducting mitigation action planning.\n\n- Provide support to business users of the IT application systems\n\n-Lead the project or assist the Project Manager to conceptualize, develop and implement IT Projects\n\n- knowledge on containerization, CI/CD pipelines will be... advantage.\n\n· Please note: Only shortlisted candidates will be contacted\n\n· EA Registration No. R1878282 (Narasimhan Sriram)\n\nEA License No. 01C4394", "extensions": ["22 days ago", "Full–time"], "detected_extensions": {"posted_at": "22 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgQW5hbHlzdCIsImNvbXBhbnlfbmFtZSI6IktlbGx5IFNlcnZpY2VzIChzaW5nYXBvcmUpIFB0ZS4gTHRkLiIsImNvbXBhbnlfbWlkIjoiL20vMDltXzVjcSIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IkpjNjJzbHA5N3JfWnlfX2VBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVwOENDdUlCUVU1VlgwNXhVMFJmV0VKNVQwZDJYeTE2TjJoTlpIRjRlRUZYT1RoaVgwcHBORkZRTWtoMlgydzNVM0p6VkRCWWRIZDBja2RvYVZJeE9FOU9XbEJoU2tsRmRWZFFRbWRKV1VKUlVWUlhiVVZWVURGaVVrMDRiSFppUkRFMlgxTnJRMDFzTlc5a1UzSktZbFpWUzNRMVUyUTFUMjlNTlRaUWIxcHBiVU5SZWtadUxUTkpPRGRCWXkwd1MzVXdZbGhtWVZsNk9GcEJUVmd4WjFwME5VdGtRa1pHUkU1UVEyaHpOa3ROTVdSMU0zbzFlVWRTTVZSc1VuRnFaSFkzY0dsNGEzVkVhRmh5WkVkVk9YUlpOSEo1VkVKclVFaDZTMGhRUzIxb1NtSlNhWFUyZHhJVU5ETnhRMWxOVkcxTFNWQXlkRUZYT1RsdmJIY2FJa0ZQVFZsU2QwSnZWSFpVZDNBNVNteGhUMkl6UTI4eVpFZ3phRlZ0TXpWb04yYyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzUzIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1vbnN0ZXIiLCJsaW5rIjoiaHR0cHM6Ly93d3cubW9uc3Rlci5jb20uc2cvYW1wL2pvYi12YWNhbmN5LXNlbmlvci1zb2Z0d2FyZS1hbmFseXN0LWtlbGx5LXNlcnZpY2VzLXNpbmdhcG9yZS1wdGUtbHRkLXNpbmdhcG9yZS0yNzU1NTIxMS5odG1sP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Software Engineer/ Associate Consultant/ Lead Engineer/ Senior Software Engineer/ Consultant - UI", "company_name": "HCL Technologies", "location": "Singapore", "via": "via NodeFlair", "description": "• The successful candidate has a well-developed experience writing rich web client software using Angular, JavaScript, and HTML\n• The candidate displays a strong sense of design and understanding of user input requirements\n• Should have experience on consuming the web service(SOAP/REST) from UI layer\n• Having very good experience on JavaScript, JQuery and any of the Client Side JavaScript framework like Angular JS, React JS and Can JS\n• Should have worked in the projects in the last 3 years and should have hands-on development in Java Script and HTML\n• Ideal candidate should have 4-6 yrs exp in IT and should have working in projects the banking / finaincial services / insurance domain\n• Experience in XML/JSON, SOAP, REST, Web service\n• Candidate should not have any break in work experience.\n• Should have good communication skills\n\nGOOD to HAVE\n• Experince in PEGA\n• M.S. or M.C.A or B.Tech\n• Experience delivering projects using Agile Methodology\n\nTechnical / Professional Skills\n• IT... Project Delivery using Agile or Waterfall Methodology\n• Complete Softare Development Lifecycle experience\n• Good communication and interpersonal skills\n• Experience working with external Vendors & outsourced projects\n\nGOOD to HAVE\n• Technical certification on Java Script and HTML other relevant technologies.\n\nNon-Technical / Soft Skills\n• Excellent Communication skills & a team player\n• A high level of intelligence; ability to operate not only on the basis of important past experiences, but in the light of the approaches and developments that occur in the market.\n• Natural problem solving inclination\n• High level presentation and interpersonal skills\n• Experience decomposing complex problems into component parts for effective problem solving", "extensions": ["Over 1 month ago", "$4.5K–$7K a month", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time", "salary": "$4.5K–$7K a month"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlci8gQXNzb2NpYXRlIENvbnN1bHRhbnQvIExlYWQgRW5naW5lZXIvIFNlbmlvciBTb2Z0d2FyZSBFbmdpbmVlci8gQ29uc3VsdGFudCAtIFVJIiwiY29tcGFueV9uYW1lIjoiSENMIFRlY2hub2xvZ2llcyIsImNvbXBhbnlfbWlkIjoiL20vMDY5OGd2IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiend4TjUzY3c2UkVXMDA4SkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZRQkNyY0JRVTVWWDA1eFVYVnJZVWxwVldoaFNqbFZlVlpzUjFwc2QyTldNM05tY1VGS1UzaGlUblUzWWtaRFIzSjBORXRpV21OYVRtYzBVR3BXYmpsTmVFRmhTVlJ2WjAxd05rOWFkWFZWV2t4WFozTlllRGRJWVdsQ2JVY3RVamxDVnpZMmVUSndkV2hYVDJwblZtZFBTVXAyYmtWWmExUkZSbkIwU0U1bFZ5MDRPRzkzZFZWVWQyaE1hRGRYU1RBMWFucFlhSEZyVWxoaGIyWjFTV2xHWmpWRk4zSlFka2RNU25RNWEybFBUazEzUWtsSlQwVXpZM0IzRWhRME0zRkRXVTFVYlV0SlVESjBRVmM1T1c5c2R4b2lRVTlOV1ZKM1FWOTJZbE52YUd0QmQzZ3hVRGx0UlVSdU56Wk1RMUpWUTJObVFRIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNjAiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTm9kZUZsYWlyIiwibGluayI6Imh0dHBzOi8vd3d3Lm5vZGVmbGFpci5jb20vam9icy9saXN0aW5ncy84ODkxP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Senior Software Design Engineer (USB)", "company_name": "Future Technology Devices International Ltd", "location": "Singapore", "via": "via Jobs", "description": "Future Technology Devices International Ltd Posted on 31-Mar-21 Future Technology Devices International Ltd Job DescriptionCandidate Profile: Creative and responsive developer, with excellent skills, knowledge, and deep experience in USB domain, including host and device drivers implementation and Microsoft WDM and KMDF frameworks. Key responsibilities: Software Development Perform USB2.0 and USB3.0, USB PD device driver development, test, optimisation, and maintenance Undertake WHQL testing and certification of drivers and device frameworks Participate in all phases of SDLC and prepare corresponding documentation Undertake porting and maintenance of existing drivers to new frameworks and OSes Resolve defects reported by internal and external customers Work closely with USB host & device firmware development teams Knowledge and skill requirements: Degree/Master in Computer Science/Engineering 5 - 10 years or above experience in the area of USB device drivers development Working... experience from specification to delivery of certified products In-depth understanding of WDM and KMDF frameworks, multi-threading and DLLs Thorough knowledge of USB2.0 and USB3.0 protocols and USBCV is a must Thorough understanding of USB Device Classes (HID, MSC, CDC, UVC, UAC, DFU, Custom) is required. D2XX and D3XX knowledge is a definite plus. Knowledgeable in WinUSB and libusb (Windows or Linux) Embedded development experience in WinCE, MacOS, Android and Linux is a definite plus Experience working with hardware boards, scope and USB analysers Experience in USB device pre-testing and USB certification Professional attitude to work and meticulous in coding and testing Must have participated and experienced in SQA processes Only Singaporean Additional Information Senior Executive Qualification Bachelor's Degree, Post Graduate Diploma, Professional Degree FTDI Chip develops innovative silicon solutions that enhance interaction with the latest in global technology. The major objective from the company is to ‘bridge technologies’ in order to support engineers with highly sophisticated, feature-rich, robust and simple-to-use product platforms. These platforms enable creation of electronic designs with high performance, low peripheral component requirements, low power budgets and minimal board real estate. FTDI Chip is a fab-less Semiconductor Company, partnered with the world’s leading foundries. The headquarter is located in Glasgow, UK and is supported with research and development facilities in Glasgow, Singapore and Taipei (Taiwan) plus regional sales and technical support sites in Glasgow, Taipei, Tigard (Oregon, USA) and Shanghai (China). Additional Company Information Registration No. T08FC7229K Company Size 51 - 200 Employees Average Processing Time 11 days Computer/Information Technology (Hardware) Benefits & Others Regular hours, Mondays - Fridays, Business (e.g. Shirts), Medical & Dental (after 3 months", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgRGVzaWduIEVuZ2luZWVyIChVU0IpIiwiY29tcGFueV9uYW1lIjoiRnV0dXJlIFRlY2hub2xvZ3kgRGV2aWNlcyBJbnRlcm5hdGlvbmFsIEx0ZCIsImNvbXBhbnlfbWlkIjoiL20vMDRnd2ZteSIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjBHYnRZd0ZSV3BTeU51NFpBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVyUUNDdmNCUVU1VlgwNXhVMjFHWW5sdFVVSlplVWRZWW5CeFIzWTFjVzl5V1ROU2REWmFVazh0VVhGRFZqZFhOQzFVU0U0d2JrZE5XWFZQTTBwdlVVbHRXbDh5VkdadFVFZDBOa0ZWYVZkRmVGcEJOMU4wUm5OS05UazVkR05rWkhBNGVrMXNTRVZuV0RKc2FFSTNlbU5xVFVwNVEyTndiREJLV1RWWk9UQjZVRFpUWTJWQlN5MVVORzlxTUcxV1ZXeEhRbEZyYldKcmFFcFJUekI1Y25Nd04yZHZYMHMyTjJscFMxbFBibkJrWlZBMWRtRnBjMVJyTWtsalFtNXRZWGN5UWtwTmRHSkRNVzlsWnpCWmJGaFRZa2N3T1Mxc1dWUlphVzFmU0hCS1owNVVhVlZNVjJKZmNtUmtSVzVXVVhZMVMwYzBWbEJqZFRaQlp4SVVORE54UTFsTlZHMUxTVkF5ZEVGWE9UbHZiSGNhSWtGUFRWbFNkMEZLV1dWNWFEUmFkVFI2WW0xeGFEQTBZVVJaUlhsMlMyeHpiVUUiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY182NyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIiwibGluayI6Imh0dHBzOi8vc2cuZmlkYW50by5jb20vam9icy9qb2Itb3BlbmluZy9zb2Z0d2FyZS1kZXZlbG9wZXJzLXN5c3RlbXMtc29mdHdhcmUvc2VuaW9yLXNvZnR3YXJlLWRlc2lnbi1lbmdpbmVlci11c2ItMjc1NDkxOTQwP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}], "chips": [{"type": "Title", "param": "job_family_1", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Software engineer", "value": "software engineer"}, {"text": "Senior", "value": "senior"}, {"text": "Test engineer", "value": "test engineer"}, {"text": "Cloud engineer", "value": "cloud engineer"}, {"text": "Engineer", "value": "engineer"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Assurance engineer", "value": "assurance engineer"}, {"text": "Programmer", "value": "programmer"}, {"text": "Coach", "value": "coach"}, {"text": "Qa engineer", "value": "qa engineer"}, {"text": "Devops engineer", "value": "devops engineer"}, {"text": "Frontend engineer", "value": "frontend engineer"}, {"text": "Java engineer", "value": "java engineer"}, {"text": "Solutions engineer", "value": "solutions engineer"}, {"text": "Testing engineer", "value": "testing engineer"}, {"text": "Analyst", "value": "analyst"}, {"text": "Data engineer", "value": "data engineer"}, {"text": "Design engineer", "value": "design engineer"}, {"text": "Development manager", "value": "development manager"}, {"text": "Devops consultant", "value": "devops consultant"}, {"text": "Firmware engineer", "value": "firmware engineer"}, {"text": "Lead engineer", "value": "lead engineer"}, {"text": "Lecturer", "value": "lecturer"}, {"text": "Manager", "value": "manager"}, {"text": "Network systems", "value": "network systems"}, {"text": "Principal", "value": "principal"}, {"text": "Principal engineer", "value": "principal engineer"}, {"text": "Quality engineer", "value": "quality engineer"}, {"text": "Science", "value": "science"}, {"text": "Scrum master", "value": "scrum master"}, {"text": "Security architect", "value": "security architect"}, {"text": "Security engineer", "value": "security engineer"}, {"text": "Senior engineer", "value": "senior engineer"}, {"text": "Senior lecturer", "value": "senior lecturer"}, {"text": "Senior system", "value": "senior system"}, {"text": "Senior technical", "value": "senior technical"}, {"text": "Software architect", "value": "software architect"}, {"text": "Specialist", "value": "specialist"}, {"text": "Stack engineer", "value": "stack engineer"}, {"text": "System engineer", "value": "system engineer"}, {"text": "Technical", "value": "technical"}, {"text": "Trainee", "value": "trainee"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Wholesale", "value": "/business/naics2007/42"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Mining", "value": "/business/naics2007/21"}, {"text": "Rental", "value": "/business/naics2007/532"}, {"text": "Retail", "value": "/business/naics2007/44"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": ".AB4Jjf.qPB6Vc{padding-right:11px}.qfpP8d{padding:7px 0 7px 11px}.S003Ke{flex:none}.ZoN4Lb{color:rgba(0,0,0,.54)}.nAXVG{color:#70757a}.IxQsL{color:rgba(0,0,0,.26)}.xFO1De{color:#fff}.ooFpK{color:rgba(255,255,255,.30)}.mtnwac{color:#4285f4}.WxeeKb{color:#34a853}.hIVRU{color:#f29900}.EXaTMc{color:#fbbc04}.sxn46d{color:#000}.gqMTF{color:#1a73e8}.zpn8Mb{color:#d93025}.dEUPmd{color:#1e8e3e}.PJNo1{color:#fbbc04}Actively Hiring", "value": "e"}, {"text": "EPAM", "value": "/m/0dlnrc"}, {"text": "VISA", "value": "/m/01kqjn"}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Zühlke", "value": "/g/1hh_rg216"}, {"text": "Cardinal Health", "value": "/m/040vzx"}, {"text": "Credit Agricole Group", "value": "/m/028vbm"}, {"text": "GlobalTix Pte Ltd", "value": "/g/11dxpqdhrf"}, {"text": "HCL SINGAPORE PTE. LTD.", "value": "/g/11fy25ngsv"}, {"text": "Jobline Resources Pte Ltd", "value": "/g/11gp2647pn"}, {"text": "Mediacorp", "value": "/m/03qtz1"}, {"text": "Realtek", "value": "/m/05wrm7"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "TECHNOPALS PTE. LTD.", "value": "/g/11dxpvkynp"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "Thales", "value": "/m/01phj4"}, {"text": "UST", "value": "/m/08kb8g"}, {"text": "UrbanFox", "value": "/g/11ghs7y0w6"}, {"text": "Activate Interactive", "value": "/g/11dxq192l5"}, {"text": "Cognizant", "value": "/m/03bf9h"}, {"text": "DELL", "value": "/m/0py9b"}, {"text": "HCL Technologies", "value": "/m/0698gv"}, {"text": "ORACLE", "value": "/m/05njw"}, {"text": "PUBLICIS SAPIENT", "value": "/m/09n8_2k"}, {"text": "Singapore Press Holdings Limited", "value": "/m/0d7mwh"}, {"text": "Temasek Polytechnic", "value": "/m/098s73"}, {"text": "TikTok", "value": "/g/11fy265933"}, {"text": "Zendesk", "value": "/m/0wkm4pl"}, {"text": "A-it Software Services Pte Ltd", "value": "/g/11dxpy_gl_"}, {"text": "ACCENTURE PTE LTD", "value": "/m/09n8w94"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "Adecco GS", "value": "/m/08gz46"}, {"text": "Atidan Technologies", "value": "/g/11c74f0b8_"}, {"text": "Autodesk", "value": "/m/018nm3"}, {"text": "Avnet", "value": "/m/0c8xmc"}]}]}