{"search_metadata": {"id": "60827aa39f55b351b830ea24", "status": "Success", "json_endpoint": "https://serpapi.com/searches/dea970247535e1f1/60827aa39f55b351b830ea24.json", "created_at": "2021-04-23 07:43:31 UTC", "processed_at": "2021-04-23 07:43:31 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28project+manager%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=130", "raw_html_file": "https://serpapi.com/searches/dea970247535e1f1/60827aa39f55b351b830ea24.html", "total_time_taken": 1.26}, "search_parameters": {"q": "(project manager) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "130"}, "jobs_results": [{"title": "Regional Project Manager", "company_name": "Workiva", "location": "Singapore", "via": "via LinkedIn", "description": "The Project Manager is the point person for customer-related projects. This person plans, budgets, monitors, and documents all progress of a particular project, including delays, setbacks, and unexpected circumstances. The Project Manager leads the resources assigned to the project and is ultimately responsible for the project's success. This role oversees the budget, timeline, and scope of high-profile projects with large budgets.\n\nWhat You'll Do\n• Acts as the point of contact person for issues regarding the project.\n• Responsible for the project from inception to completion.\n• Leads the project team and is responsible for holding the team accountable to timelines, budget, deliverables, and scope.\n• Manages project documentation and reporting.\n• Communicates potential delays and estimated delivery dates to all stakeholders.\n• May work onsite with customers to ensure the project meets the customers' expectations.\n• Oversees schedules, budgets, timelines, and project scope to ensure... goal attainment.\n• Researches the proper budget for a given project, ensures the team stays within budget, and speaks to each budgeted expense.\n• Has the authority to readjust the budget as needed, within scope.\n• Stays in constant contact with the customer to ensure project is on track and communicates progress on a consistent basis.\n• Consults with stakeholders when project execution does not fall within the budget, timeline, or scope to ensure the project stays within budget, on time, and within scope.\n• Works closely with Stakeholder teams and Workiva management to act as an ambassador and advocate on behalf of the customer.\n• Consults with cross functional teams to ensure all are aligned.\n\nWhat You'll Need\n• Associate or bachelor’s degree in a related field preferred, or equivalent combination of education and experience\n• 5+ years of experience required\n• Customer-facing experience required\n• Familiarity working within the Software or Technology field strongly preferred\n• Excellent verbal, written, and interpersonal communication skills\n• Ability to set priorities, meet deadlines, and manage multiple projects in a fast-paced, changing environment\n• Strong project management and time management skills are a must\n• Experience working in in the Big Four strongly preferred\n• PMP certification preferred\n• Up to 50% travel\n• Reliable internet access for any period of time working remotely, not in a Workiva office.\n\nWhere You’ll Work\n\nOur values drive how we work and who we hire. You will see these values ingrained in how we support our customers, work with team members, build our products and in the work environment we’ve created.\n• Customer Success: Always delight our customers.\n• Trust: Rely on each other.\n• Integrity: Do the right thing, every time.\n• Collaboration: Share resources and work together.\n• Innovation: Keep creating solutions and finding better ways.\n• Inclusion: Support a diverse community where we all belong.\n• Accountability: Be responsible for your success and failure.\n\nWe believe our people are our greatest asset, and our unique culture gives employees the opportunity to make an impact everyday. We give our employees the freedom and resources they need—backed by our culture of collaboration and diverse thought—to continue innovating and breaking new ground. We hire talented people with a wide range of skills and experiences who are eager to tackle some of today’s most challenging problems.\n\nAt Workiva, You’ll Enjoy\n• Casual Dress: Workiva has a casual work environment, most people wear jeans to the office.\n• Involvement: Ability to participate in Employee Resource Groups, (Women in Tech, Women in Sales, Ethnic Diversity, Veterans, Rainbow (LGBTQ), Remote Employees, Caregiving) Volunteering, Company wide celebrations, and more\n• Work-life Balance: We have competitive PTO, VTO and Parental Leave. We encourage employees to spend time enjoying life outside of work.\n\nLearn more: http://https://www.linkedin.com/showcase/workiva-life-and-careers/\n\nWorkiva is an Equal Employment Opportunity Employer. We believe that great minds think differently. We value diversity of backgrounds, beliefs, and interests, and we recognize diversity as an important source of intellectual thought, varied perspective, and innovation. Employment decisions are made without regard to age, race, creed, color, religion, sex, national origin, ancestry, disability status, veteran status, sexual orientation, gender identity or expression genetic information, marital status, citizenship status or any other protected characteristic.\n\nWorkiva is committed to working with and providing reasonable accommodations to applicants with disabilities. To request assistance with the application process, please email talentacquisition@workiva.com ", "extensions": ["2 days ago", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJSZWdpb25hbCBQcm9qZWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJXb3JraXZhIiwiY29tcGFueV9taWQiOiIvbS8wMTEzbTFyZCIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Imp0VHVkcXJobmlmQk9RXzJBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhVVmQ2T1dwaFZUbEhTVUl4TVRKaGEwTklkbFZ6V1haU2RURklTRmxSUzFNeFJ5MWZReTFzYUMxQlkzQmFlV2xwU0VORVFVZEpjMm8xUlc5TE5FbHJhV3BLUnpaM1JsaFNhVUpHZEVoclFXRnpTM0EyWDJaM1YzTk1hVmQxZUY5TmVrMVpVMDVYYkRjemR6UTNVRFYzWW1nM2JUZ3lhMlIwVm1sUVNrdG5ia2htZWtKQ1RWUnBRbFJLWW14TFVteHdTMUpSVGs1a1JIQmZkRkpCRWhadk0zRkRXVWxETlUxelpURjBRV0ZNZVRaWE5FTlJHaUpCVDAxWlVuZENPRGs0Tms5T1VsWlBRM0ZZTjJ4bFFUaHVlRFJ0UXpkR1FUUlIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY183IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExpbmtlZEluIiwibGluayI6Imh0dHBzOi8vc2cubGlua2VkaW4uY29tL2pvYnMvdmlldy9yZWdpb25hbC1wcm9qZWN0LW1hbmFnZXItYXQtd29ya2l2YS0yNDE5NjYxNzU3P3JlZklkPTFmMjlhNzY1LTc5YjEtNGNlYy1hMDI3LWM5MDg4M2RhMjUxM1x1MDAyNnRyYWNraW5nSWQ9NkNVUnhVYmVneTNuSkZSSWtOUTJRUSUzRCUzRFx1MDAyNnBvc2l0aW9uPTVcdTAwMjZwYWdlTnVtPTBcdTAwMjZ0cms9cHVibGljX2pvYnNfam9iLXJlc3VsdC1jYXJkX3Jlc3VsdC1jYXJkX2Z1bGwtY2xpY2tcdTAwMjZ1dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Business Analyst Support & Projects Manager", "company_name": "RHB Singapore", "location": "Singapore (+1 other)", "via": "via SmartRecruiters Jobs", "description": "Company Description\n• RHB Singapore is a progressive and growing financial organization. We are committed to creating a fulfilling, dynamic and engaging work environment for our team of more than 15,000 employees across nine locations in ASEAN, China and Hong Kong.\n\nJob Description\n\nPrimary Objective\n\nThis role provides critical Treasury product support as well as control, including new product rollouts and reconciliation of Treasury Systems' Profit & Loss General Ledger, to help Singapore Treasury Department achieve its revenue and annual departmennt goals.\n\nKey Responsibilities\n\nThis role provides critical Treasury product support as well as control, to help Singapore Treasury Department achieve its revenue and annual department goals by the following tasks:-\n\nNew Products\n• Support New Product Roll out\n• Ensure the system and process in Treasury Operations are in place to support new Products\n• Liase with Treasury, Finance, Legal, Technology, Internal Audit, Compliance, Risk to get... DOI for new product sign off. Follow up on any conditional approvals.\n• Work with external venndors to get system interface\n• Provide training to relevant department for New Product roll out\n• Liase with KL Team (ITD KL, TOPS KL, Financial Business Analyst & Support Team KL) to get Financial and Non-Financial static data setup before rolling out of New Products into UAT\n• Handle any queries from stakeholders on booking and life cycle model\n• Review test cases & coordinate UAT and getting UAT signed off from Stakeholders\n• If perfect booking is not possible, assess impact of proxy booking & define solution with least operational impact and risk\n\nBusiness Support\n• Business Continuity Plan / Management\n• Coordinate on projects involving TPC / BNC (e.g. Docshare, Murex)\n• Populate Key Risk Indicator (KRI) data for internal Stakeholders (e.g. Cancel rate, Dealer's Error Rate)\n• Create any new report that is required by the business\n• Look into areas for Process Improvement\n• Develop Macros for Process automation\n• Write Business Requirement Document and Business Requirement for Charge Request\n• Monthly Trend Analysis\n• SLA Performance Management\n• Monitor CAPEX, OPEX, MOP vs Personnel Cost, Unit Cost, Cost Savings, Capacity, Utilization Rate (CUR), Volume, Productivity\n• Monitor cost and productivity analytics\n• Financial reconciliation between front office systems & Finance's GL\n• Assist in the General Ledger mapping of all new products for Treasury business in Singapore\n• Involved in the UAT testing of the ledger entries & financials to ensure conformance to accounting standards/policies\n• Assist in the production of MIS report for Treasury's financial performance\n\nQualifications\n\nFormal Education:\n• Bachelor/Masters Degree\n\nProfessional Accreditation:\n• Project Management Professional (PMP) desired but not mandatory.\n• 6 Sigma Certification or Lean Management desired but not mandatory.\n\nPreferred level of Experience (by years/function/industry):\n• Minimum 10 years in Financial Accounting in Treasury\n• Candidate who is certified accountant, with experience in Oracle eGL system & Murex accounting schema set up is preferred.\n• Familiar with Treasury products\n• Knowledge of leadership and management principles\n• Knonwledge of all relevant regulatory requirement and local laws and jurisdiction,\n• Knowledge of human resources management\n\nAdditional Information\n\nRHB is a dynamic organization that promotes a work culture of high performance, where its biggest asset, the RHB-ians, are continuously developed & nurtured to their fullest potential through its robust talent management practices.\n\nAt RHB, we take PRIDE in our people and our teams. Great relationships built on trust, a ‘leading it right’environment, challenging assignments and a culture of excellence are the pillars to the dynamic and diversified workplace we call home", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJCdXNpbmVzcyBBbmFseXN0IFN1cHBvcnQgXHUwMDI2IFByb2plY3RzIE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJSSEIgU2luZ2Fwb3JlIiwiY29tcGFueV9taWQiOiIvZy8xMWM3M3NyZzdmIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiXy1aV2JrUEpmUFVHaDFQbUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFZFZE9XWFp0WDJaNVp6VndjbVp4U1dzNVJrdHZWSGhNT0VWUGJqRk5ORlZCYVU1NU9YRnJZbWRSYVdKd2RUbFBNMU5OUmpGbVkyZExRbTFzTUdZMVlWUkRiR28wYlZOa2JVdFBkRWh4VEd3MVJuRXhNazQxV0dJNGJuRjRkMHBpYVZGV2NtNXVhbkZXYlMxa1pGZG1UR3RtV1VsdmFta3piSFo1VTJNeGJuRm5Na2RJTkRGb2VXeE5PRkJ4VlV3MU1WUlhURUk1ZEVkbWRYVkJFaFp2TTNGRFdVbEROVTF6WlRGMFFXRk1lVFpYTkVOUkdpSkJUMDFaVW5kQ1NDMVNVMUJ6U1ZOdmJFVlpNR2hKUTE5clV6RmZXRGg0VlhKUiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzE1IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFNtYXJ0UmVjcnVpdGVycyBKb2JzIiwibGluayI6Imh0dHBzOi8vam9icy5zbWFydHJlY3J1aXRlcnMuY29tL1JIQlNpbmdhcG9yZS83NDM5OTk3MjQ1MzkzMjItYnVzaW5lc3MtYW5hbHlzdC1zdXBwb3J0LXByb2plY3RzLW1hbmFnZXI/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "It Project Manager", "company_name": "Techbridge Market Holdings", "location": "Singapore (+1 other)", "via": "via MNC Jobs Singapore | MNC Jobs In Singapore", "description": "Required technical skills:\n• Project Management Professional (PMP)® (PMP) certification (Preferred)\n• Scrum Master (Good to have)\n• Experience in web-based application development\n• Logical and analytical systemic understanding\n\nResponsibilities:\n• Understand system requirements, workflow, and functions\n• Draft solution proposal and process flows\n• Ability of communication – both verbally and in written form\n• Perform software unit and integration testing\n• Deploy software system\n• Maintain resolve issues and track change requests\n• Adhere to proper technical documentations\n• Ensure high-quality system as a whole\n\nRequirements:\n• Tertiary qualification in Computer Science, Information Systems, Computer Engineering, or related fields\n• Familiar with database technologies (SQL Server)\n• Experience in cloud service\n• Experience in Inventory Management System, WMS, and SAP is at an advantage\n• Good knowledge of agile processes, continuous integration/continuous development and cloud... technologies will be an advantage\n• Technology focused, self-motivated, and proactive in problem-solving\n• Organized, Self-motivated, enthusiastic, and proven rapid learning capability", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJJdCBQcm9qZWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJUZWNoYnJpZGdlIE1hcmtldCBIb2xkaW5ncyIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoicVlYNTVXVE5ZNUF2bFhVNUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNTkMgSm9icyBTaW5nYXBvcmUgfCBNTkMgSm9icyBJbiBTaW5nYXBvcmUiLCJsaW5rIjoiaHR0cHM6Ly9zZy5tbmNqb2J6LmNvbS9qb2JzL2l0LXByb2plY3QtbWFuYWdlci1jbGVtZW50aS0zNDMwNTE/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Technical Delivery Manager - Wealth Management/Private Banking", "company_name": "Charterhouse Partnership Singapore", "location": "Singapore (+1 other)", "via": "via EFinancialCareers", "description": "Global Financial Institution with strong footprints in Asia is looking for an experienced Technical Delivery Manager to join their robust team under the Group Technology department. The successful candidate should come with relevant private banking domain, with at least 15 years of relevant experience in leading and delivering large scale transformation and strategic projects.\n\nResponsibilities:\n• Plan technical deliverables and ensure program’s requirements are met within schedule and allocated budget\n• Work with the respective technology teams and business users if required to understand and collate functional and technical requirements\n• Provide status update related to technical delivery to the respective stakeholders such as Project Manager, Program Manager and Team lead\n\nTo qualify, individuals must possess:\n• Bachelor’s Degree in Computer Science, Engineering or in a similar capacity, PMP certification will be a plus\n• Familiar with Agile methodology\n• At least 15 years of... relevant working experience\n• 2 to 3 years of Leadership experience will be advantageous\n\nMUST have:\n• Knowledge in Private Banking/Wealth Management domain\n• Strong analytical skills, problem solver\n• Proficiency in Java/J2EE, Microservices and Devops\n• Track record in driving large-scale IT initiatives\n• Excellent communication and stakeholder management skills\n\nInterested candidates please send your updated CV to LiliT@charterhouse.com.sg or call 6950 0385 for a confidential discussion.\n\nEA License No: 16S8066 | Registration No. R1110631", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJUZWNobmljYWwgRGVsaXZlcnkgTWFuYWdlciAtIFdlYWx0aCBNYW5hZ2VtZW50L1ByaXZhdGUgQmFua2luZyIsImNvbXBhbnlfbmFtZSI6IkNoYXJ0ZXJob3VzZSBQYXJ0bmVyc2hpcCBTaW5nYXBvcmUiLCJjb21wYW55X21pZCI6Ii9nLzExZnkxdF9xeXAiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJ6MGwyVkhfQl9CMTRJYU1MQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFcUVDQ3VJQlFVNVZYMDV4VWtZdGMxRjVlVVV3WVVkSVkwdFdVRjgyY1dkSmMybEpOakJPUmxwdU4yNXpUek5VYlVnMlNYRmhTMGR4WTBkeGRVaHZaMnBTV0dFM2EzSnlhVVpPVVY5emJucDNObFF0U1ZWM1oydG1jVWxoYkMxb1IwMWtiRTFzWVVSM2VXSkJPRkF3WVZCVldFeG9aVlppUlZCd1VFZElNRlpVU3pZNE1HWTNUVWxrYzA1VUxVZFVkbkYwTjBVd04xZzVOakY2TjNGMk5WVkJOUzFFTmpsUWJrbzNSMGhVYVdRNVRGWktZbXBSUVZCMVFUaFBZMWc0T1ROVlIxUnRRM2N4YUVocGNrUnBiR05MUkdRelVqaERValZWVVdwYU1FZEtWRE5TZDNoUFp4SVdiek54UTFsSlF6Vk5jMlV4ZEVGaFRIazJWelJEVVJvaVFVOU5XVkozUkdFeVExbFZVVk0yZG5KSVptVlhObkl5WTJ3eWVWZ3RWbVl3VVEiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18yNyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBFRmluYW5jaWFsQ2FyZWVycyIsImxpbmsiOiJodHRwczovL3d3dy5lZmluYW5jaWFsY2FyZWVycy5zZy9qb2JzLVNpbmdhcG9yZS1TaW5nYXBvcmUtVGVjaG5pY2FsX0RlbGl2ZXJ5X01hbmFnZXJfLV9XZWFsdGhfTWFuYWdlbWVudFByaXZhdGVfQmFua2luZy5pZDEwNzE2OTE0P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Service Chain Operations Project Manager", "company_name": "None", "location": "Singapore", "via": "via Jobs", "description": "Job Responsibilities. Coordinates, optimizes and harmonizes the efforts of the MNC across geography, stakeholders, external and partner efforts in the delivery units, Strongly cooperating with internal and external delivery parties in all phases of the delivery agreement to ensure a maximum of efficiency Harmonizes the cooperation and communication between delivery units of different cultures, time zones and languages. In case of a Customer escalation leads a service improvement program (taskforce), defines and implements measures in order to resolve Customer complaint. Concludes an Operational Level Agreement between SDM/Customer and between the Service Delivery Unit. Reviews these agreements on a regular basis and initiates amendments if required. Defines / improves the sourcing mix, where and how the service has to be provided. Designs and implements custom-made service processes based on Standards Push Standards to improve cost effectiveness in operation From professional point of... view drives, trains, monitors and supports the community of Local Operations Managers Rolls-out and operates global standards how to setup an international Service Delivery in terms of steering quality and costs in accordance to Corporate's governance Pinpoints best demonstrated practices within delivery units, standardize it and after that rolls-out for the whole client base in order to increase the quality of the services Designs and implements improvement measures based on his/her experience in order to increase customer satisfaction on the whole service chain. Participates actively in customer related projects and transitions. In collaboration with other supporting departments and cross-functions clarifies problems arising in the service processes. Suggests and implements resolution measures for the process issues. Follows-up the publications of call-center and service desk organizations (associations, communities, institutes etc.), attends professional events, and builds relationship with experts. Based on his/her network is able to benchmark the service delivery units against competitors and improve competitiveness of the own organisation. Internal analysis, calculation and planning of measures with the aim to increase the competitiveness of the delivery unit. Requirements. Relevant information technology degree and or relevant tertiary degree/diploma is beneficial At least 12 years in an IT Service Delivery Management / Operations Management role with significant client contact across all levels at senior management level within a technical environment (preferably within an outsourcing environment. Proven track record in client relations management is compulsory Formal training in management disciplines will be an advantage Sound ICT market know-how Competent working knowledge of a very broad range of ICT systems Extensive Technical Knowledge of end to end ICT supply Profound know-how of Corporate's SOP Good experience in presenting complex issues on Top Management Level Cost control and budget planning skills Solid and hands-on experience in performance analysis and project controlling. Person of high integrity, unbiased, decisive, results oriented and a keen sense of business ownership. Strong change management and project management skills Experience in quality frameworks, ITIL, PMP Certified Excellent communication – written, verbal and presentation skills (on executive level) Strong negotiation skills, decision making ability as well as presentation skills – even in critical situations Politically astuteness and conflict management skills Profound commercial knowledge Excellent networking skills - being able to build up excellent working relationships with the customer decision makers and influencers Analytical and problem solving attributes Exhibiting tact and diplomacy in dealing with sensitive customer issues Self-motivated and able to work independently and autonomously. Ability to quickly identify goals to be pursued, and to influence others towards these same goals Job Responsibilities. Coordinates, optimizes and harmonizes the efforts of the MNC across geography, stakeholders, external and partner efforts in the delivery units, Strongly cooperating with in Skills: Budget Preparation, Client Relationship Management, Communication, Conflict Management, Cost Control, Ict, Itil Certified, Management, Networking, Operations Management, Pmp, Presentation Skills, Problem Solving, Project Control, Project Management, Results Oriented, Service Delivery Experience: 10.00-15.00 Years", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZXJ2aWNlIENoYWluIE9wZXJhdGlvbnMgUHJvamVjdCBNYW5hZ2VyIiwiY29tcGFueV9uYW1lIjoiTm9uZSIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiNGNlNWdvdzI0cWlDUURQQkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIiwibGluayI6Imh0dHBzOi8vc2cuZmlkYW50by5jb20vam9icy9qb2Itb3BlbmluZy9pbmZvcm1hdGlvbi10ZWNobm9sb2d5LXByb2plY3QtbWFuYWdlcnMvc2VydmljZS1jaGFpbi1vcGVyYXRpb25zLXByb2plY3QtbWFuYWdlci0yNzg0OTY1ODQ/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Project Manager (IT Infrastructure)", "company_name": "Sciente Inc", "location": "Singapore", "via": "via SCIENTE", "description": "Our client is an established organization within the Banking & Financial Services domain. They are seeking a Project Manager to manage Infrastructure projects in a DevOps environment.\n\nMandatory Skill(s)\n• Degree in Computer Science, Information Systems or equivalent;\n• Over 5 years of proven project management experience managing technically medium to complex, cross-organizational projects;\n• Hands on working experience in infrastructure, technology platform, workplace services projects;\n• Good understanding in Technology Risk and Outsourcing Guidelines;\n• Experience in project plans, milestones, measures, budgets, resource and time management;\n• Technical background in key technology infrastructure areas:\n• Data Centre;\n• Mainframe, Mid-range & Storage;\n• Databases, Middleware;\n• Security Infrastructure\n• Voice & Data Networks;\n• Strong interpersonal skills with the ability to work in a global team and matrix organization;\n• Ability to interact with various users, senior management... IT teams and external vendors effectively;\n• Excellent communication, planning and organization skills.\n\nDesirable Skill(s)\n• PRINCE 2 or PMP Certified.\n\nResponsibilities\nKey responsibilities include, but not limited to:\n• Responsible for managing the technology infrastructure aspect of business requested projects;\n• Act as an interface between technology managers, users and other external parties involved in the projects;\n• Identify problems, issues, change and risk and coordinate with the technical team on solutions and communicate proposed solution to the stakeholders promptly;\n• Closely monitor project progress and ensure timely completion;\n• Manage and track the financial aspects of the project implementation;\n• Adhere to the bank's project management processes and procedures;\n• Responsible to ensure the timely delivery of projects by vendors & internal stakeholders;\n• Ensure Service Transition procedures, including change control and release management, are adhered to", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIgKElUIEluZnJhc3RydWN0dXJlKSIsImNvbXBhbnlfbmFtZSI6IlNjaWVudGUgSW5jIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJXZkk2MjdNMHNORTg4TExUQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFNDSUVOVEUiLCJsaW5rIjoiaHR0cHM6Ly93d3cuc2NpZW50ZS5jb20vc2NpZW50ZS1pbmMvdGVjaG5vbG9neS1qb2JzLzU4MzQvcHJvamVjdC1tYW5hZ2VyLShpdC1pbmZyYXN0cnVjdHVyZSkvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Scrum Master - Project Manager", "company_name": "Oaktree Consulting", "location": "Singapore (+1 other)", "via": "via Monster", "description": "Job Description:\n\n· Jumpstart new Agile projects by helping clients to understand Agile and onboard key roles.\n\n· Work closely with project leadership to assess organisational impediments, measure flow and develop strategies for continuously improving.\n\n· Implement processes, practices, and tools to allow for multiple paths of delivery. For e.g, create simplified, consistent, reusable, efficient and flexible methodologies.\n\n· Play an active role in mentoring agile teams and guide them in project implementation.\n\n· Serve as a Coach and Mentor within the organization to facilitate adoption and maturity.r\n\nPre-requisites:\n\n· At least 3 years experience as a Scrum Master.\n\n· At Least 5 years Experience working as a Project Manager .\n\n· Attained the Certified Scrum Master or an equivalent qualification.\n\n· Good knowledge of the commonly used agile tools and practices.\n\n· Team player, Supervisory, Coaching, planning, and management skills.\n\n· Possesses strong customer empathy.\n\n· Possesses... good oral and written communication skills in English.\n\nPlease send in your resume in MS Word format to [Confidential Information]\n\nManimalah Suppiah, EA License No : 06C4642, EA Reg No : R1105598\n\nThe Telegram Jobs link is ", "extensions": ["8 days ago", "Full–time"], "detected_extensions": {"posted_at": "8 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTY3J1bSBNYXN0ZXIgLSBQcm9qZWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJPYWt0cmVlIENvbnN1bHRpbmciLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjJ6M1ZRSmxLb2U5VlZwZGdBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTW9uc3RlciIsImxpbmsiOiJodHRwczovL3d3dy5tb25zdGVyLmNvbS5zZy9hbXAvam9iLXZhY2FuY3ktc2NydW0tbWFzdGVyLXByb2plY3QtbWFuYWdlci1vYWt0cmVlLWNvbnN1bHRpbmctc2luZ2Fwb3JlLTI3NzIyMzI5Lmh0bWw/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "AV Project Manager", "company_name": "Rahi Systems", "location": "Singapore", "via": "via LinkedIn", "description": "Rahi Systems is looking to expand our team of motivated, committed, and diligent Audio Video Project Managers. As the mastermind of the project, you will be intimately familiar with the scope, design, labor needs, and project schedule. As the enthusiastic and knowledgeable face of the company you will drive project meetings and work with client contacts and trades to ensure dependencies are resolved or on schedule. Internally, you will disseminate information, and coordinate teams to provide the logistics, design, labor, and engineering to make sure your projects run as smoothly and efficiently as possible.\n\nEven the best plans require contingencies and adaptation and you will thrive in this position if you can think on your feet, and quickly come up with solutions to mitigate challenges and roadblocks. As a proven project leader, you will earn the respect of the team and work closely with your peers and tech leads to drive their teams and projects to success.\n\nResponsibilities:\n•... Read, understand, and markup Audio Video system drawings and Architectural plan sets\n• Quickly become acquainted with the project scope of work, budgets, construction schedules, system designs and how they drive your project’s needs\n• Coordinate the relevant resources for your project by utilizing internal teams (Operations, Logistics, Engineering)\n• Generate and manage the internal project schedule, communicate changes with appropriate teams and adjust resources accordingly\n• Obtain site progress reports from field teams, identify issues, and update internal and client teams on status and action items\n• Facilitate client sign off with foremen, tech leads, and engineering as necessary\n• Maintain and distribute project documentation through internal tools\n• Travel to various job sites to meet with clients, attend meetings, and expedite the resolution of escalated issues\n• Resolve all project team questions in a timely manner, delegating, or escalating as necessary\n• Conduct project post-mortems\n• Ensure post-installation documentation is delivered to the customer, for example, user-acceptance tests, sign-offs, inventories, and ‘as-built-drawings and schematics\n• Play a proactive role in the shaping, review and improvement of workflows, internal processes and procedures to support project and service delivery\n• Strong applicants should be proven leaders, personable, dependable, self-motivated, and strong critical thinkers\n\nQualifications:\n• >2 years demonstrated project related experience\n• Proven management of AV-related projects\n• PMP Practitioner or expertise in other similar types of methodologies\n• Understand AV system functionality and installation processes and techniques\n• Comprehension of technical schematics and construction documents (plan sets, symbols, Line Diagrams, Gantt charts)\n• Demonstrate time management skills with attention to detail\n• Effective verbal and written communication with clients, colleagues, and employees; including meeting notes, and action items\n• Ability to prioritize and manage multiple projects and teams\n• Superb coordination and delegation ability – ensure teams are successful without attempting to do everything themselves\n• VISA and/or Work permit authorizing you to work in the APAC region\n• Ability to adapt to a changing environment and handle multiple priorities\n• Proficient in: Google Suite, Word, Excel, Outlook, MS Project, Acrobat, and other web-based tools\n• Fluency in English is essential\n• Travel throughout the APAC region is required.\n• Ability to travel between job sites is integral to job performance.\n\nDesirable:\n• PMP Certification\n• CTS certified (CTS-I and CTS-D preferred)\n• Knowledge and understanding of Current Audio Video Standards\n• Other IT/Networking/Data Center Experience\n• Any current Audio or Video manufacturer certifications\n• Safety Certifications\n• ITIL Foundation or similar qualification\n• 3+ years’ experience as a Project Manager in the construction or technology industries is strongly preferred\n• AV field experience – especially related installation or troubleshooting audio and control systems\n• Service delivery management experience\n• A 2nd language is desirable", "extensions": ["2 days ago", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBViBQcm9qZWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJSYWhpIFN5c3RlbXMiLCJjb21wYW55X21pZCI6Ii9nLzExZHhxMGxqczIiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJlY3htUGctd2x2Q3VIdVk2QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VWxkU2R5MWxTMkV0VlVsaVVuSk5hVll6UjAxV2VFNVlNREpFYmtNd2F5MXRXVkZ0WkZWcFdqZG1kV1JzWjI1aVltRkRkVFpRZEdka1IwODNOV3BEU2xCR1EwZElTa3BvUlhkR1N6aHVhREZQYnpGeGNYUlVUVkY0VEVwVllXcDNTek5KU25adWREWlpSaTFrZGtreFJXeDNkRlZEVWxscmVEUlZjVWxpWVdkNFpFdHZSeTB0ZVZCR2IycG5jM2RIUWpKTGJEbFpZa2d0ZEd0bkVoWnZNM0ZEV1VsRE5VMXpaVEYwUVdGTWVUWlhORU5SR2lKQlQwMVpVbmRDUlZJMVVYUmxhMjVqYzBWb01qQTJSVlZTVlVSUVZFZFhlalpSIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNDciLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGlua2VkSW4iLCJsaW5rIjoiaHR0cHM6Ly9zZy5saW5rZWRpbi5jb20vam9icy92aWV3L2F2LXByb2plY3QtbWFuYWdlci1hdC1yYWhpLXN5c3RlbXMtMjQ5NTAxMjY3OD9yZWZJZD04ODZiM2QzYy05OTI2LTQ0NTUtYjI0OS0xODQyZjFhYzI0MGNcdTAwMjZ0cmFja2luZ0lkPTg1UDcxb241Yy9JNExHUkNtSDJ6Q0ElM0QlM0RcdTAwMjZwb3NpdGlvbj0xOVx1MDAyNnBhZ2VOdW09MFx1MDAyNnRyaz1wdWJsaWNfam9ic19qb2ItcmVzdWx0LWNhcmRfcmVzdWx0LWNhcmRfZnVsbC1jbGlja1x1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Process & Quality Assurance Consultant", "company_name": "Singtel Group", "location": "Singapore", "via": "via Singtel Careers", "description": "We have a great opportunity for a talented and self-motivated Process & Quality Assurance Consultant to join our team in NCS. At NCS, we seek to nurture talents in creating and developing innovative solutions. If you are passionate about new technologies and new ideas, NCS could be a place for you!\n\nSummary:\n• Participate and be key contributor in driving quality assurance and process improvement programs.\n• Provide quality assurance services to improve overall delivery quality of NCS projects so as to achieve high level client satisfaction and project profitability.\n• Conduct internal project audit and contractual audits committed in customer contracts\n• Perform QA manager/support role to support contractual requirements with the customers\n• Support and facilitate external audits such as ISO20000, ISO9001\n• Support QA initiatives in alignment to the goals set by the department (Integrated Delivery Method, QA Matters EDM, Learnings repository)\n\nResponsibilities:\n\nIndependent... Audit/Review\n• Conduct independent audits on projects to verify compliance to defined processes and contractual commitment and make recommendation to close gaps\n• Provide objective report to NCS management and client management (if required).\n• Verify the actions taken by the projects to close the audit findings\n• Track closure of the follow up actions and escalate on aging actions.\n\nPerform QA manager/support role to support contractual requirements with the customers\n• Advise delivery staff on processes, methodologies, templates, tools, etc\n• Review project plans prepared by Project Managers.\n• Conduct Process / Methodology / Tools briefings.\n• Guide team in proper setup in the project management system to enable effective project tracking\n\nSupport and facilitate external audits such as ISO20000, ISO9001\n• Be audit guide for external certification audits\n• Support auditors and auditees during the audit sessions\n• Clarify and confirm audit findings\n• Guide auditees on the follow-up actions to close audit findings\n• Track to ensure follow-up actions are completed\n\nSupport QA initiatives in alignment to the goals set by the department (Integrated Delivery Method, QA Matters EDM, Learnings repository)\n• Work with Process Owners to update the process / methodology to incorporate changes, feedback/suggestions, corrective action recommendations from audit findings.\n• Deploy the process / methodology (includes deployment briefings, co-ordinating deployment and reviewing usage)\n• Plan topics and design contents of QA Matters newsletter; organize brownbag sharing sessions etc.\n• Maintain project repository of templates and samples (collect, cleanse, review, publish)\n\nThe ideal candidate should possess:\n• Tertiary education in Information Technology or related field\n• At least 5 -7 years of QA and Process Audit experiences; project PM or team lead experience for application projects\n• Process and QA support\n• Software engineering, Software Development Life Cycle, Agile development\n• Service Management\n• Analytical, Inquisitive, logical thinking\n• Able to interface effectively with stakeholders in project organisation\n\nBonus Points:\n• ITIL Foundation Certification\n• PMP certification\n• Auditing certification", "extensions": ["8 days ago", "Full–time"], "detected_extensions": {"posted_at": "8 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9jZXNzIFx1MDAyNiBRdWFsaXR5IEFzc3VyYW5jZSBDb25zdWx0YW50IiwiY29tcGFueV9uYW1lIjoiU2luZ3RlbCBHcm91cCIsImNvbXBhbnlfbWlkIjoiL20vMDIwemZsIiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiVzdkaE9KNjVuSlVPSFF6eEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFVqQmxZMVp5VDBWdFoyMUlRM0ZZU25Ock1tVlRWelZPVFRSdGIxUlFTSFl5TUdJd1YwTnlNVU42YTBsYWIyWm1TR2xrVEdOdGFUQXpXVGxpYlZKSVIxQnpkRGs1YjA5V1ZrWTNRWFJJV2xaTllsVkdXbE4zYWtWbldtOHpVRXR3V1ZOU1dXNUhaazFQUmtoRGVteExkR0o1TkRBdGJXTnRTV2g1Vm5CWlNqSkxUM2xzY1d4dmRUUXpPREJJVm5CTlptZ3daamR6UzFOdmRUVjNFaFp2TTNGRFdVbEROVTF6WlRGMFFXRk1lVFpYTkVOUkdpSkJUMDFaVW5kQ1IzSklOMVIzZVhWVGJraG9TRzA1TTNkRmVrbERVM05LVWtabiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzU1IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFNpbmd0ZWwgQ2FyZWVycyIsImxpbmsiOiJodHRwczovL2dyb3VwY2FyZWVycy5zaW5ndGVsLmNvbS9qb2IvUHJvY2Vzcy1hbmQtUXVhbGl0eS1NYW5hZ2VtZW50LUNvbnN1bHRhbnQtU2luZy81NzYxNDMyMTAvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Project Manager", "company_name": "Civica Pte Ltd", "location": "Singapore (+1 other)", "via": "via JobsCentral", "description": "About Us\n\nCivica builds software and provides IT and digital transformation services to support some of the most important organisations in our communities; like schools, libraries, local councils, and state agencies. We work with some of the largest health fund providers bringing their services into the digital age. Our products are market leaders, some of them are globally renowned.\n\nOur team is proud to work within the sectors we do, where we make a real difference, contributing to the growth of the societies that we live in and accelerating the digital transformation of the public sector and associated markets. Want to join us and help continue our mission?\n\nAbout the Role\n\nThis is an opportunity for a proven and experienced Project Manager to join our growing team. You will be managing large and complex projects using sound project management process and standards. Reporting to our Operations Manager, you will be working closely with our Service Delivery team to achieve high... quality project completion within specified time and budget.\n\nResponsibilities\n• Direct and manage project development from beginning to end\n• Coordinate the effective design, implementation, and operation of information systems and applications\n• Proactively manage changes in project scope, identify potential crises, and devise contingency plans\n• Build relationships and communicate project expectations to team members and stakeholders\n• Maintain budget information and recommend subsequent budget changes where necessary\n• Identify manpower needs and resolve disputes within the project team\n\nAbout You\n\nYou possess at least a degree in computer science, IT, or other relevant fields and with relevant working experience in a similar role. As this is a fast-paced role, you will be a self-starter and highly motivated individual with strong organisational skills.\n\nYou will also have:\n• At least 6-8 years of IT industry experience with minimum 5 years of project management experience\n• Experience in leading a team size of 10-20 members\n• Ability to effectively handle multiple large and complex projects simultaneously\n• Ability to assess business needs and to analyse, prioritise, and solve issues in a service-driven mindset\n• Proficiency in project management tools such as MS Project, Jira, and Confluence\n• Knowledge of web applications development and technologies such as ASP.NET, AJAX, JQuery, Javascript, CSS, XSLT, XHTML and HTML5\n• Knowledge of SQL Server and SQL Reporting Services (preferred)\n• Knowledge of applicable business operations (preferred)\n• Professional certification such as PMP, Prince2, and ITIL (preferred)\n\nYour Benefits\n\nAt Civica we believe our people are our biggest asset and we pride ourselves in cultivating a supportive and modern working environment; whilst providing you with the training and tools you need to get the job done. We will offer what you would expect in today’s modern work environments:\n• Join a growing and successful business\n• Genuine career development\n\nCivica is a Diversity Leader\n\nAt Civica we are committed to building and maintaining an inclusive and supportive culture where diversity thrives, and all of our people excel. We believe that diversity stimulates innovation, enables us to deliver better outcomes for people and communities, supports the growth of our people, and delivers great results for our customers. At Civica we recruit, promote, and reward our people based on their contribution, regardless of gender, race, disability, religion/belief, nationality, ethnicity, sexual orientation, age, or marital status.\n\nWhat Next?\n\nDo we sound like a good match? If so, then we would love to hear from you! Please include a cover letter outlining how your experience, aspirations and values are a match, along with your resume and we will take it from there.\n\nCivica is an equal opportunity employer and welcomes applications from all sections of the community.\n\nNo agencies please", "extensions": ["12 days ago", "Full–time"], "detected_extensions": {"posted_at": "12 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJDaXZpY2EgUHRlIEx0ZCIsImNvbXBhbnlfbWlkIjoiL2cvMTFnOW4wZzA0bCIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Ikw5d2pUaXZBWjBpYVlpUFhBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2WUJDcmNCUVU1VlgwNXhVa3gzUkV0UlVWYzJWa0Y1VTJkcmNsOWZNRkUxZUc5ZmJFMHROM1JKWmtsSmIxcGFPVXhXV2tWSGJrWjBZVzloUWpsb2JWSktaV2d0ZFRGMVJXd3dTbWRrVkdkQ1MwSjBXamhLTm0xVlQwaDZaR2RvYlRSM2MxUnViV3hzWkhsaUxYTktWelZzZERrMWJqRjVObEphWVZCUFNWWlRla3BhU0hjeVRWZEdaakU0WlVWaFUyMVFlR1EwVDBOMGVVZEhPWE5VZURKUmRUZGFZVVZGU2pJNVRUTnhjSFJzYXpWSVJYWm5VVVZmU0dkM0VoWnZNM0ZEV1VsRE5VMXpaVEYwUVdGTWVUWlhORU5SR2lKQlQwMVpVbmRETFRCelEycEthRE0xZW5OMWVtaFFkV3g0WVdaeU4wRXlaVk5CIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNjMiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9ic0NlbnRyYWwiLCJsaW5rIjoiaHR0cHM6Ly9qb2JzY2VudHJhbC5jb20uc2cvam9iL3Byb2plY3QtbWFuYWdlci1qM243emg2cjZsYno1am1saHNiP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Management", "value": "GC18"}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Advertising and Marketing", "value": "GC03"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Media, Communications and Writing", "value": "GC20"}, {"text": "Transportation and Logistics", "value": "GC30"}, {"text": "Art, Fashion and Design", "value": "GC05"}, {"text": "Construction", "value": "GC09"}, {"text": "Education", "value": "GC11"}, {"text": "Human Resources", "value": "GC15"}, {"text": "Protective Services", "value": "GC23"}, {"text": "Property", "value": "GC24"}, {"text": "Science and Engineering", "value": "GC27"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "Project manager", "value": "project manager"}, {"text": "Program manager", "value": "program manager"}, {"text": "Manager", "value": "manager"}, {"text": "Delivery manager", "value": "delivery manager"}, {"text": "Project director", "value": "project director"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Senior", "value": "senior"}, {"text": "Consultant", "value": "consultant"}, {"text": "Coordinator", "value": "coordinator"}, {"text": "Deputy director", "value": "deputy director"}, {"text": "Director", "value": "director"}, {"text": "Group manager", "value": "group manager"}, {"text": "Operations", "value": "operations"}, {"text": "Scrum master", "value": "scrum master"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Services", "value": "services"}, {"text": "Vice president", "value": "vice president"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Engineering Services", "value": "/business/naics2007/5413"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Entertainment", "value": "/business/naics2007/71"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Management", "value": "/business/naics2007/55"}, {"text": "Real Estate", "value": "/business/naics2007/53"}, {"text": "Research", "value": "/business/naics2007/5417"}, {"text": "Retail", "value": "/business/naics2007/44"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": ".AB4Jjf.qPB6Vc{padding-right:11px}.qfpP8d{padding:7px 0 7px 11px}.S003Ke{flex:none}.ZoN4Lb{color:rgba(0,0,0,.54)}.nAXVG{color:#70757a}.IxQsL{color:rgba(0,0,0,.26)}.xFO1De{color:#fff}.ooFpK{color:rgba(255,255,255,.30)}.mtnwac{color:#4285f4}.WxeeKb{color:#34a853}.hIVRU{color:#f29900}.EXaTMc{color:#fbbc04}.sxn46d{color:#000}.gqMTF{color:#1a73e8}.zpn8Mb{color:#d93025}.dEUPmd{color:#1e8e3e}.PJNo1{color:#fbbc04}Actively Hiring", "value": "e"}, {"text": "Michael Page", "value": "/m/04cxldw"}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Nanyang Technological University", "value": "/m/0l49k"}, {"text": "Jobline Resources Pte Ltd", "value": "/g/11gp2647pn"}, {"text": "Randstad Singapore", "value": "/g/11g70b50mr"}, {"text": "GECO Asia", "value": "/g/11gk72_bt_"}, {"text": "Facebook", "value": "/m/0hmyfsv"}, {"text": "HP", "value": "/m/03mnk"}, {"text": "IoTalents", "value": "/g/11dxq187wm"}, {"text": "NCS Group", "value": "/m/0282746"}, {"text": "National University of Singapore", "value": "/m/01q460"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "OPTIMUM SOLUTIONS (SINGAPORE) PTE LTD", "value": "/g/11g70hkrbx"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Apple", "value": "/m/0k8z"}, {"text": "Avensys Consulting", "value": "/g/11g7022gjf"}, {"text": "BNP Paribas", "value": "/m/02qhk4"}, {"text": "Ceridian", "value": "/m/07f8h6"}, {"text": "Ensign InfoSecurity", "value": "/g/11g4jhymjr"}, {"text": "Humanica Asia Pte. Ltd", "value": "/g/11h1y98c9z"}, {"text": "Kerry Consulting", "value": "/g/11c73vtzc8"}, {"text": "Marsh and McLennan", "value": "/m/053rw"}, {"text": "NSEARCH GLOBAL", "value": "/g/11dxpksll4"}, {"text": "NTT", "value": "/m/05mybp8"}, {"text": "OakTree Consulting", "value": "/g/11g70jfhtq"}, {"text": "Salesforce", "value": "/m/07btr5"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "TEKsystems", "value": "/g/11b6g4bkv0"}, {"text": "Teradyne", "value": "/m/04bzqp"}, {"text": "Toshiba Tec Singapore Pte. Ltd", "value": "/g/11g9n9q547"}, {"text": "Trustwave", "value": "/m/0n3xjf5"}, {"text": "Wood Plc", "value": "/m/07vv9s"}, {"text": "Workiva", "value": "/m/0113m1rd"}, {"text": "A-it Software Services Pte Ltd", "value": "/g/11dxpy_gl_"}, {"text": "ABS Group", "value": "/g/11dxplj1z6"}, {"text": "ACI HR Solutions Ltd", "value": "/g/11c73ryh3p"}, {"text": "AIA", "value": "/m/02r5cgx"}]}]}