{"search_metadata": {"id": "60827edfaf5af128109b4daa", "status": "Success", "json_endpoint": "https://serpapi.com/searches/10f6883ac98d0556/60827edfaf5af128109b4daa.json", "created_at": "2021-04-23 08:01:35 UTC", "processed_at": "2021-04-23 08:01:35 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28software+developer%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=240", "raw_html_file": "https://serpapi.com/searches/10f6883ac98d0556/60827edfaf5af128109b4daa.html", "total_time_taken": 1.82}, "search_parameters": {"q": "(software developer) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "240"}, "jobs_results": [{"title": "Senior Mobile Developer", "company_name": "Randstad Pte. Limited", "location": "Singapore", "via": "via Jobs | Fidanto", "description": "*Exposure to latest technologies*Stable role with excellent salary packageabout the company A leading organisation is hiring a permanent position of a Senior Mobile Developer as an integral part of their expansion plans.about the job Your role and responsibilities include: Designing, developing, and implementing high-quality business solution for the organisation and its clients. Combination of on-site/offsite low-level requirements gathering, understanding client’s needs Working with the architects to come up with a viable solution. skills and experience required As a successful candidate, you will need: Bachelor's Degree in Computer Science/Information Technology or equivalent At least 5 years of experience on mobile development by using IOS(Swift), Android (Kotlin) or Xamarin. Familiar with Apple and Google store App deployment Good understanding of development methodologies, testing practices, and tools and knowing when to apply each method to achieve the desired outcomes... Familiarity with architecture styles/APIs (REST, API, MVC) Knowledge of security standards and techniques for web applications Expertise in the design, implementation, and deployment of user-centric software, with focus on usability Added Advantages:o Understanding and practicing of Agile methodologieso Certification in mobile development or equivalento Familiar with Cloud application deployment such as (azure, aws or google cloud)o Experience in Java based mobile applicationo Experience in Java/J2EE, .Net and/or mobile Technologieso Good knowledge of DevOps (Jenkins), automated testing would be beneficial.This is an excellent opportunity to gain exposure to latest technologies as a Mobile Developer with one of the leading Consultancy firms.To apply online please use the 'apply' function, alternatively you may contact Josh LIM at 6510 3660 or https://www.linkedin.com/in/joshlimzishuo(EA: 94C3609/ R1766249)skillsiOS, swift, android, kotlin, mobile, applications, native Tuesday, 19 January 2021 Singapore Permanent s$ 6,000 - s$ 11,000 per month about the company Reputable tech company. about the role Responsible for mobile applications product architecture design, optimization, development, etc Participate in requirements analysis and detailed design of functional modules Responsible for existing module reconstruction Develop and maintain ... Thursday, 25 February 2021 Singapore Permanent s$ 5,000 - s$ 15,000 per year about company Our client is a digital wallet product company that aims to provide a seamless, transparent and world class user experience. With a million of users currently signed up for its services, you will be solving the money problems for millions of people by empowering them and providing a ... Monday, 1 March 2021 Singapore Permanent s$ 60,000 - s$ 108,000 per year about the company Our client is a profitable B2C product company with strong plans to expand its product line of offerings. They are currently hiring for a Senior Product Designer to join their team. Being in a high growth environment, this role has great opportunity for career advancements. The ", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgTW9iaWxlIERldmVsb3BlciIsImNvbXBhbnlfbmFtZSI6IlJhbmRzdGFkIFB0ZS4gTGltaXRlZCIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiUWQxYV9rVi1nOFA3Nm9Ob0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIHwgRmlkYW50byIsImxpbmsiOiJodHRwczovL3NnLmZpZGFudG8uY29tL2pvYnMvam9iLW9wZW5pbmcvc29mdHdhcmUtZGV2ZWxvcGVycy1hcHBsaWNhdGlvbnMvc2VuaW9yLW1vYmlsZS1kZXZlbG9wZXItMjc1Mzg5NjYyP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Solutions Engineer - Mulesoft", "company_name": "Salesforce", "location": "Singapore", "via": "via Glassdoor", "description": "To get the best candidate experience, please consider applying for a maximum of 3 roles within 12 months to ensure you are not duplicating efforts.\n\nMuleSoft is looking for a motivated Solutions Engineer to join our extremely talented and collaborative Pre-Sales team, who are instrumental to MuleSoft’s growth in the region. As a Solution Engineer, you will act as a trusted advisor to MuleSoft’s prospective customers by proving how MuleSoft’s Anypoint Platform can bring their digital investments together into an application network, allowing for faster change and innovation. You will partner closely with Account Executives throughout the end-to-end sales cycle to qualify sales opportunities with regards to customer technical requirements, decision-making process and funding. Through strong, developed relationships with the client’s IT staff and C-Level executives, you will leverage their deep technical expertise to align the client’s technical requirements to business outcomes.\n\nWhat... you’ll achieve:\n\n3 months:\n• *\n\nBecome certified in MuleSoft’s Developer trainings\n• Complete MuleSoft’s Kickstart sales training\n• Begin to build your architecture reframe and white-boarding skills through shadowing and customer-scenario role playing\n• Create a Self Service Asset on a MuleSoft technical topic of interest\n\n12 months:\n• *\n\nBecome certified in all Product, Architecture, and Sales Messaging trainings\n• Successfully deliver your Self Service asset by end of second quarter\n• Deliver product presentations and demonstrations that are tailored to the client’s technical requirements and audience\n• Develop Proofs of Concept (PoCs) as part of an account team to demonstrate the art of the possible\n• Put all the pieces together to “perfect your craft” by closing deals\n• Partner with Accounts Executives on account planning and strategy and support marketing with evangelism activities (writing blogs, participating in demo-based webinars, speaking at industry events, etc.)\n\nWhat you’ll need to be successful:\n• *\n\nPre-Sales enterprise software experience, skillset to establish trust with clients, and ability to influence key decision makers in the sales cycle\n• Hands on experience with middleware, integration architecture patterns, web services technologies, enterprise messaging patterns, APIs, SOA, ESB, BPM etc.\n• Hands on Java development experience and ability to code and debug against Java APIs is preferred\n• Experience with cloud technologies - iPaaS, SaaS applications, cloud infrastructure, etc. - is preferred\n• Experience building and delivering Proofs of Concept (PoCs) and responding to functional & technical elements of RFIs/RFPs\n• Ability to lead architectural discussions\n• A passion for technology and translating that passion into business impact for customers\n• Excellent verbal communication, written communication, and presentation skills\n• Ability to travel as needed and to work flexible hours throughout the sales territory\n\nAbout MuleSoft, a Salesforce company\n\nOur mission is to help organizations change and innovate faster by making it easy to connect the world’s applications, data, and devices. Companies like Spotify, McDonald’s, and Unilever rely on MuleSoft to stay agile, deliver faster, and make the most of their IT investment with API-led connectivity. Hiring exceptional people who want to build a great company together is our number one priority, and we’re committed to providing an equal opportunity workplace where everyone is supported and inspired to do their best work. We work tirelessly to build this culture, and we’re proud to have been named the #1 Top Workplace in the Bay Area and a best place to work 6 years in a row.\n• LI-Y\n\nAccommodations - If you require assistance due to a disability applying for open positions please submit a request via this Accommodations Request Form.\n\nPosting Statement\n\nAt Salesforce we believe that the business of business is to improve the state of our world. Each of us has a responsibility to drive Equality in our communities and workplaces. We are committed to creating a workforce that reflects society through inclusive programs and initiatives such as equal pay, employee resource groups, inclusive benefits, and more. Learn more about Equality at Salesforce and explore our benefits.\n\nSalesforce.com and Salesforce.org are Equal Employment Opportunity and Affirmative Action Employers. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status. Salesforce.com and Salesforce.org do not accept unsolicited headhunter and agency resumes. Salesforce.com and Salesforce.org will not pay any third-party agency or company that does not have a signed agreement with Salesfore.com or Salesforce.org.\n\nSalesforce welcomes all", "extensions": ["7 days ago", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2x1dGlvbnMgRW5naW5lZXIgLSBNdWxlc29mdCIsImNvbXBhbnlfbmFtZSI6IlNhbGVzZm9yY2UiLCJjb21wYW55X21pZCI6Ii9tLzA3YnRyNSIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjZuRTFuTmp2UEZDZlFKdU9BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhWRW94VVhwVVRETnFiME5FYUdNdFdYSmZhbkpXYVRWVWRHaHhlbVpFVWpOTFZIcFRaalJVU1hvM1dWTllaalJvTjNoRmQwRnhhMlExWkRCRWNUQm5aQzE0T0ZoV1h5MXlibm95YTJOU2NIVnBORlkwWWsxcGJrMTBjME51Y3pGUFVrTnVSbEZKYzJzeGQwSkNiMmxDYzBWdGMxTTNRV042UXpseExXTm9kM2htYjFGMmRHaHhXVFpsV1hNNVgwYzRjeTFSVm5aaWVXMHRkMGQzRWhZMFNEWkRXVkJNUlU5YVUwZDBVV0o0Y1c5bFVVUm5HaUpCVDAxWlVuZEVVbkJuVGtaNVdUWnhZVmxFVHpWQlpHVkZkMEYzUjNjemVDMW4iLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18xMSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBHbGFzc2Rvb3IiLCJsaW5rIjoiaHR0cHM6Ly93d3cuZ2xhc3Nkb29yLnNnL2pvYi1saXN0aW5nL3NvbHV0aW9ucy1lbmdpbmVlci1tdWxlc29mdC1zYWxlc2ZvcmNlLUpWX0lDMzIzNTkyMV9LTzAsMjdfS0UyOCwzOC5odG0/amw9NDA0MjI0OTkyNFx1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Staff Software Engineer (Golang / Java / Fullstack)", "company_name": "VISA", "location": "Singapore", "via": "via Bayt.com", "description": "Job Description and Responsibilities\n\nQualifications", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTdGFmZiBTb2Z0d2FyZSBFbmdpbmVlciAoR29sYW5nIC8gSmF2YSAvIEZ1bGxzdGFjaykiLCJjb21wYW55X25hbWUiOiJWSVNBIiwiY29tcGFueV9taWQiOiIvbS8wMWtxam4iLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJjT3JPb3I3RzVNdEcxdXpyQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFc3NCQ293QlFVNVZYMDV4VkVSbldtZFBlVWxGTWtSU1lYcEhhVTlZVGtKelVHOVVTSFkzVEhSU1UwZHpiRVJEY1ZsRmFqSndXbXRLZDNaSGVpMU9VWFl4TUZKUWJVeFBjMGsxY21GTFJWQXpiV0V3WldOaVdqWXpWSE55ZUdSTFJHZFFlRXcyWm1wbFltZ3lkbnBhV0ZNM2JqQktjR3A0VkU1VllrNVVYM0pEWWxaUVRHTldRWEI2YW5GcVQwMVFTemdTRmpSSU5rTlpVRXhGVDFwVFIzUlJZbmh4YjJWUlJHY2FJa0ZQVFZsU2QwUmhkR1pUYTJ0dlFXeGlhVUZvUWs5YVpqaEhlbFpVU25wemVGRSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzE5IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJheXQuY29tIiwibGluayI6Imh0dHBzOi8vd3d3LmJheXQuY29tL2VuL3NpbmdhcG9yZS9qb2JzL3N0YWZmLXNvZnR3YXJlLWVuZ2luZWVyLWdvbGFuZy1qYXZhLWZ1bGxzdGFjay01ODc2MzAyNy8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Senior Game Programmer", "company_name": "Gamelogic Pte. Ltd.", "location": "Singapore", "via": "via Www.monster.com.sg", "description": "Gamelogic started out with a small group of gaming enthusiasts and has\nsince expanded into a full-fledged game development studio. As gaming\nenthusiasts, we are adamant about one thing: which is to have fun. We are\nexperts in having a good time and we hope to offer fellow gamers a chance\nto unleash their inner child through our awesome games.\n\nOur goal is to create innovative casual games that will penetrate the\nglobal market. Our team is made up of experienced game designers,\nprogrammers and artists and we are constantly looking to nurture the next\ngeneration of game developers.\n\nWhen it comes to gaming for us at Gamelogic; the skys the limit.\n\n------------------------\n\nTitle: Senior Game Programmer\n\nResponsibilities:\n\nBrainstorming game concepts, design elements, and specifications with\nthe game design team.\n\nLeading a team of programmers and set work schedules and deadlines.\n\nAssist project leaders with statistical testing, and suggest new\nmethods based on output.\n\nSelecting... suitable game frameworks and translating concepts into clean\nand efficient code.\n\nDesigning and testing gameplay features and prototypes.\n\nGenerating game scripts and storyboards, as well as animating game\ncharacters and objects.\n\nContributing to user interface development, as well as the integration\nof graphic design and audio features.\n\nPerforming tests and implementing validation procedures.\n\nDocumenting the full lifecycle of game development.\n\nMaintaining code, resolving issues, and performing bug fixes.\n\nIntegrating the latest game industry trends into game designs.\n\nWorking closely with a lead game developer to create task/project\ndeliverables.\n\nInterface with Quality Assurance, Game Producers, Game Designers and\nArtists.\n\nRequirements:\n\nBachelor's degree in computer science, computer engineering, or\nsimilar.\n\nAt least 5 years' experience as a game programmer.\n\nProficiency in Unity3D.\n\nAble to work in Windows, Linux and Mac environment.\n\nIn-depth knowledge of full lifecycle game programming and related\ntechnologies.\n\nHighly proficient in programming languages, such as C++, C# and Java.\n\nSuperb analytical and problem-solving skills.\n\nExcellent communication and collaboration abilities.\n\nGreat organizational and time management skills.\n\nAble to troubleshoot and solve complex technical issues.\n\nHighly analytical with excellent written and verbal communication\nskills.\n\nExcellent time management skills with the ability to work under\npressure to meet tight deadlines.\n\nContribute to innovation in game design.\n\nBonus:\n\nCoursework or certification in game design and development preferred.\n\nExperience in mobile games development", "extensions": ["7 days ago", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgR2FtZSBQcm9ncmFtbWVyIiwiY29tcGFueV9uYW1lIjoiR2FtZWxvZ2ljIFB0ZS4gTHRkLiIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiWm53OGk4XzRSbUVkR1N5MEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBXd3cubW9uc3Rlci5jb20uc2ciLCJsaW5rIjoiaHR0cHM6Ly93d3cubW9uc3Rlci5jb20uc2cvYW1wL2pvYi12YWNhbmN5LXNlbmlvci1nYW1lLXByb2dyYW1tZXItZ2FtZWxvZ2ljLXB0ZS1sdGQtc2luZ2Fwb3JlLTI3NzUwMzQxLmh0bWw/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Software Engineer (Embedded Operating System)", "company_name": "Wsh experts Pte Ltd", "location": "Singapore", "via": "via WhatJobs", "description": "Job Description :\nJob Description & Requirements\n\nJob Scopes:- Requirements gathering; Design, development and maintenance of the software; Preparation and submission of deliverables throughout the software development lifecycles such as Business Rules, Software Requirement Specifications, Software Architecture Document, Design Specification, Interface Specifications, Source Codes, Testing Specification, Operation and Maintenance Manual, Training Manual and others documents as required in the standard adopted by the Authority; Assist the Authority with day-to-day application support issues; and Liaise with users on the requirement, design and testing issues. Job Requirements:- Degree in Electrical / Electronics / Computer Engineering or a relevant discipline; At least 5 years' experience in C++, Java programming language in Windows, RTOS systems and multi-tasking OS environment; At least 2 years' experience working in embedded systems, NFC, RFID or smart card technology; Experience in... NFC standards, NFC application development and a broad view of software testing methods; Experience and skilled in embedded firmware development and debugging; Familiar with I2S, SPI, serial communication, interrupt handling and hardware trouble shooting; Knowledge on software security and cryptography; Knowledge on Visa, MasterCard and EMV certification; Knowledge of SDLC with RUP or Agile methodology; Experience in developing test solutions, profiling and visualization of automated test results", "extensions": ["4 days ago", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciAoRW1iZWRkZWQgT3BlcmF0aW5nIFN5c3RlbSkiLCJjb21wYW55X25hbWUiOiJXc2ggZXhwZXJ0cyBQdGUgTHRkIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJIbGpxT1FuS0NzNlRPeWhhQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFdoYXRKb2JzIiwibGluayI6Imh0dHBzOi8vZW4tc2cud2hhdGpvYnMuY29tL2pvYi1mb3ItU29mdHdhcmUtRW5naW5lZXItRW1iZWRkZWQtT3BlcmF0aW5nLVN5c3RlbS1pbi1TaW5nYXBvcmUtY29vcDE3NTEyNTY3P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Senior / Software Engineer (Oracle)", "company_name": "EPAM Systems", "location": "Singapore", "via": "via LinkedIn", "description": "EPAM is committed to providing our global team of more than 41,150 EPAMers with inspiring careers from day one. EPAMers think creatively and lead with passion and honesty. Our people are the source of our success. We value collaboration, work in partnership with our customers, and strive for the highest standards of excellence. In today’s market conditions, we’re supporting operations for hundreds of clients around the world remotely. No matter where you are located, you’ll join a dedicated, diverse community that will help you discover your fullest potential.\n\nDescription\n\nWe are looking for an experienced Senior / Software Engineer(Oracle) in Singapore to make the team stronger.\n\nResponsibilities\n• Ensure all the technical requirements are captured in the requirement specification document\n• Review the onboarding requirement specification and run-through overview sessions for our stakeholders\n• Analysis the technical documentations to identify gaps and discrepancies related to feed... configurations\n• Resolution of user queries and business engagement activities up to design sign off in a timely manner\n• Follow the standard processes to track the onboarding projects activity status throughout the project lifecycle\n• Prepare the test plan and scenarios for assigned onboarding tasks and complete the walkthrough session for our stakeholders\n• Perform integration testing, conduct root cause analysis of test defects, implement fixes and prepare UAT deployments (e.g. configuration tags)\n• Carry out detailed analysis of feed processing failures during testing and ensure that all the breaks or issues are identified and resolved in due time\n• Make sure the risks and issues in processes are identified, reported and escalated in-time\n• Support your project manager with latest status information pertaining to your feed onboarding tasks\n• Collaborate and co-ordinate with our internal development teams to identify and resolve the feed archiving related issues\n• Preparation of handover document for production support team and participate in post-production verification tasks\n\nRequirements\n• Bachelor’s degree in computer science / Engineering / Mathematics majors preferred\n• At least 6 years of analyst and development experience in wealth management or financial service industry\n• Strong knowledge and working experience in UNIX, Oracle and SQL/PL SQL technologies\n• Good knowledge on MS Office tools (Excel, Word and PowerPoint)\n• Good communication skills in English to be able to interact with our colleagues and stakeholders around the world\n• Experience in software development life cycle change implementation process with banking industry\n• Highly driven and self-motivated individual with a can-do attitude\n• Team player, interacts well and creates synergy in team environment and with our stakeholders\n• A proactive and change focused mind-set with problem solving ability to deal with challenging situations\n\nNice to have\n• Knowledge or Experience in Records management policies and procedures will be an added advantage\n• Experience in tools like Scheduling (AutoSys), Ticketing tool (GSNOW), JIRA (Tracking tool), GitLab, Confluence and SharePoint are a plus\n• Knowledge in IBM CMOD 9.5 and Open text other records management software solutions are an asset\n\nWe offer\n• Friendly team and enjoyable working environment\n• Work-life balance and flexible schedule\n• Online training library, mentoring, career development and potential partial grant of certification\n• Unlimited access to LinkedIn learning solutions\n• Referral bonuses\n• Compensation for sick leave and paid time off\n• Opportunities for self-realization", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgLyBTb2Z0d2FyZSBFbmdpbmVlciAoT3JhY2xlKSIsImNvbXBhbnlfbmFtZSI6IkVQQU0gU3lzdGVtcyIsImNvbXBhbnlfbWlkIjoiL20vMGRsbnJjIiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiQzZqX1JrM2tXYWZ4ZDc0ZkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFVYVm9YMVJCT0hOWFFqTXdOazFvY1Y4NU1ubEtiV3RhWTNaclpIRnZSeTFpWVVaTmJGYzBNVmRHUVVGNVpHRnpNRnByUmtONmFIVkxSbHBaV1hKV1V6SnBUVTFSV0cwMFZHNTZkbDlXUVc5aE9XeGhka2sxVW1OWk9XbEpNWEZRY1hCQlRWUjRXVTlzWDJOR1UweHRaRFJCUVVsWk1sbHlMV3cxYjJoWWNHRkhXbmR5T0dkdk1HTnNka2R3UkVsdFgwNU9ZVGQxZWpsQmRuQjNFaFkwU0RaRFdWQk1SVTlhVTBkMFVXSjRjVzlsVVVSbkdpSkJUMDFaVW5kQllpMUJWVE0zUzBOdE9GTkZjMFJSU1ZsTk1uaG9XVzQxVjE5QiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzM0IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExpbmtlZEluIiwibGluayI6Imh0dHBzOi8vc2cubGlua2VkaW4uY29tL2pvYnMvdmlldy9zZW5pb3Itc29mdHdhcmUtZW5naW5lZXItb3JhY2xlLWF0LWVwYW0tc3lzdGVtcy0yNTEyMTM1NTUzP3JlZklkPWNkYjE0MTFhLTI5ZDktNDYzNy04OWI2LWViMTY0ODg2NGM4M1x1MDAyNnRyYWNraW5nSWQ9Wkl6MndiUmc3TzgzZlgvZzN1dU40USUzRCUzRFx1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "senior mobile developer", "company_name": "Randstad", "location": "Singapore", "via": "via Jobs", "description": "job description*Exposure to latest technologies*Stable role with excellent salary packageabout the company A leading organisation is hiring a permanent position of a Senior Mobile Developer as an integral part of their expansion plans.about the job Your role and responsibilities include: Designing, developing, and implementing high-quality business solution for the organisation and its clients. Combination of on-site/offsite low-level requirements gathering, understanding client's needs Working with the architects to come up with a viable solution. skills and experience required As a successful candidate, you will need: Bachelor's Degree in Computer Science/Information Technology or equivalent At least 5 years of experience on mobile development by using IOS(Swift), Android (Kotlin) or Xamarin. Familiar with Apple and Google store App deployment Good understanding of development methodologies, testing practices, and tools and knowing when to apply each method to achieve the desired... outcomes. Familiarity with architecture styles/APIs (REST, API, MVC) Client/Server scripting framework (JavaScript, Angular.js, React JS, Node.js) Knowledge of security standards and techniques for web applications Understand browser-specific compatibility issues Expertise in the design, implementation, and deployment of user-centric software, with focus on usability Added Advantages:o Understanding and practicing of Agile methodologieso Certification in mobile development or equivalento Familiar with Cloud application deployment such as (azure, aws or google cloud)o Experience in Java based mobile applicationo Experience in Java/J2EE, .Net and/or mobile Technologieso Good knowledge of DevOps (Jenkins), automated testing would be beneficial.This is an excellent opportunity to gain exposure to latest technologies as a Mobile Developer with one of the leading Consultancy firms.To apply online please use the 'apply' function, alternatively you may contact Josh LIM at 6510 3660 or https://www.linkedin.com/in/joshlimzishuo(EA: 94C3609/ R1766249)skillsiOS, swift, android, kotlin, mobile, applications, native qualificationno additional qualifications required educational requirements Associate Degree/Diploma share", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJzZW5pb3IgbW9iaWxlIGRldmVsb3BlciIsImNvbXBhbnlfbmFtZSI6IlJhbmRzdGFkIiwiY29tcGFueV9taWQiOiIvbS8wOHB0MXoiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJQQTdmTXhJbG1kNmlRWWFiQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VW5SdWMxOTVYM2RsV1RaamFscDRUMkZVUkdWMWJVRmxWWGRCTjJZeU1IWlRkMUZLU1cweGRtUlBibTVHVFRkSU5EYzJjRTU1U1MwNGVqWk1PRXRqVFhWUVNVUjNNV2gxVG5kNU16QXRXRVZRU1U5dWNqYzJNMlZxZFUxTFkxWmZNMDlCZG05VWRtMURNemQ2TVdKaFlYbGplVXRtWDFOaU5IaHFNbWN3UVhreWFqTTRaV2RrTlRCUVkzaHNRV1J0T0ZoUFIxWkZXSHB6Y1ZKM0VoWTBTRFpEV1ZCTVJVOWFVMGQwVVdKNGNXOWxVVVJuR2lKQlQwMVpVbmRCV2tST05sQllRVlJrVW0xcVEwaHVWbVZXUVRRMk1HZ3hZbFpSIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNDIiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9icyIsImxpbmsiOiJodHRwczovL3NnLmZpZGFudG8uY29tL2pvYnMvam9iLW9wZW5pbmcvc29mdHdhcmUtZGV2ZWxvcGVycy1hcHBsaWNhdGlvbnMvc2VuaW9yLW1vYmlsZS1kZXZlbG9wZXItMjc1MzU3ODk4P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Software Developer (Digital Solutions Department) [NIE]", "company_name": "Nanyang Technological University", "location": "Singapore (+1 other)", "via": "via Workday", "description": "The National Institute of Education (NIE) invites applications for a Software Developer position in the Digital Solutions Department (DSD). We are looking for a technically talented individual to add to our mobile, application, and integration team. The candidate should be a dynamic IT professional that has good expertise in web technology and API integration.\n\nResponsibilities:\n• Design, develop, deploy, and support web applications in ASP.NET C#.\n• Analyse and test programs before launch.\n• Ensure software security by developing programs efficiently.\n• Troubleshoot coding problems quickly and efficiently to ensure a productive workplace.\n• Manage queries and provide advice to users.\n• Communicate with different team members to accomplish the task.\n• The desire to work in a fast-paced environment.\n• Report to team lead and align to team objectives and technology guidelines.\n\nRequirements:\n• A Diploma in Computer Science, Information Technology, Information Systems... Info-communications, or equivalent.\n• Keen interest in innovating IT solutions with leading-edge technologies and development methodologies.\n• Good team player, able to work with tight deadlines and fluid requirements.\n• Quick learner who is passionate about the latest trends and technologies.\n• Working experience in C#, ASP.NET, JAVA, JQuery, and API technology will be a bonus.\n\nFresh Diploma graduates are welcome to apply.\n\nClosing Date\nThe closing date of the advertisement is 28 April 2021. We regret that only shortlisted candidates will be notified.\n\nOther Information\nNIE staff can take chartered buses at their own expense from or near their homes to NIE campus. This is subject to the availability of seats.\n\nHiring Institution: NIE", "extensions": ["10 days ago", "Full–time"], "detected_extensions": {"posted_at": "10 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBEZXZlbG9wZXIgKERpZ2l0YWwgU29sdXRpb25zIERlcGFydG1lbnQpIFtOSUVdIiwiY29tcGFueV9uYW1lIjoiTmFueWFuZyBUZWNobm9sb2dpY2FsIFVuaXZlcnNpdHkiLCJjb21wYW55X21pZCI6Ii9tLzBsNDlrIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiZlgtYVUzdVZzSDM0OUJ5Y0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXFFQ0N1SUJRVTVWWDA1eFUwUnhXVk5QUVhGbmMzZFdVRWcyVGpGWWQyTjJWalpaUzB0UVdISmtRVkEyVUdWQ1ZFZDRabWhwZEV4d1ExbDFOM3BoVG1kRmRuUlJNbWh4TWpoUmIwUmpkVkpuV2xSd2RYQkZhelpXUld4NlRVRTFhbkIwV0hNMldFUm5Za3B3TkZOdWJVSTBjM2hxY2pKZlVrazBZMjVVWms1SlJUVnRkVmR6VEhWWmEyb3pMWGRCYTBoaE9HUTBOekpEVkU5Mk1EWnlhREJRVFcxdVJFWXhZMDVxYVVkdlNuVTNWVUl5WVRKbFptdGphMnhUT1V4Q1gzQTBSMFJMY0RORE1XcG1WREpoTkZWUmNFRlhVR0pzUmpGcFExQjZZVEJQTmxCb05HNVRRUklXTkVnMlExbFFURVZQV2xOSGRGRmllSEZ2WlZGRVp4b2lRVTlOV1ZKM1EyRjBVWEZIZDNaaWVHcEhWRkExUm1Fd1lucEhhRkZZV0c1eVp3IiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNTAiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gV29ya2RheSIsImxpbmsiOiJodHRwczovL250dS53ZDMubXl3b3JrZGF5am9icy5jb20vQ2FyZWVycy9qb2IvTlRVLU1haW4tQ2FtcHVzLVNpbmdhcG9yZS9Tb2Z0d2FyZS1EZXZlbG9wZXItLURpZ2l0YWwtU29sdXRpb25zLURlcGFydG1lbnQtLS1OSUUtX1IwMDAwMDEwNT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Software Test Lead", "company_name": "Flintex Consulting Pte Ltd", "location": "Singapore (+1 other)", "via": "via Glassdoor", "description": "• a) Create test plans, procedures and other required documentations related to testing.\n• b) Work closely with Test Manager to meet all test milestones and deliverables and\n\nensure relevant stakeholders are well informed when there are delays due to\n\nexternal factors.\n• c) Preparation of test environment and execution (including re-tests).\n• d) Conduct peer review to finalize documents for client submission.\n• e) Carry-out various test executions of test suites/test cases with minimal supervision.\n• f) Perform testing and provide support to different test phases such as System,\n\nIntegration and User Acceptance Test with internal and external stakeholders.\n• g) Provide support to stakeholders for the test requirements, test results\n\nanalysis/clarifications, etc.\n• h) Preparation of detailed and timely test reports to stakeholders with the effective use\n\nof available tools such as JIRA, HP QC, iALM etc.\n• i) Troubleshoot and provide in-depth analysis on the root cause for issues found... to\n\nreporting officer and stakeholders.\n• j) Learn the technical technology of the devices, cards and backend applications for\n\nanalysis.\n• k) Produce add-on solution to improve testing processes and procedure to conduct\n\ntests efficiently and productively.\n\nRequirements\n• a) Degree in Information Technology/Computer Science/Computer Engineering or equivalent.\n• b) Minimum 7-year experience in software testing with hands-on manual and automation testing experience; minimum 3-year experience in leading a team.\n• c) Good written and verbal communication skills in English;\n• d) Able to work well both independently as well as in a team;\n• e) Experience in full system development lifecycle from requirement, development, to\n\ntesting and deployment;\n• f) Experience in performing root cause analysis and addressing test gaps;\n• g) Experience in micro-payment or Automatic Fare Collection systems using Smart\n\nCards;\n• h) Good capability in designing/developing effective test cases based on requirements,\n\nand creating traceability between requirements and test procedures;\n• i) Experience in diverse test execution phases (Agile testing, System Testing, System\n\nIntegration Testing, User Acceptance Testing) which include preparation of the test environment, test execution, recording of test results, conducting of test reviews with both internal and external stakeholders, logging defects and following up on defects to closure will be advantageous;\n• j) Relevant experience and competence with the tools used for test management, configuration management, test automation and defect tracking;\n• k) Familiarity with database scripting and performance tuning will be advantageous; and\n• l) Certification in software testing will be advantageous.\n\nBenefits\n13th month salary\n\nvariable bonus", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBUZXN0IExlYWQiLCJjb21wYW55X25hbWUiOiJGbGludGV4IENvbnN1bHRpbmcgUHRlIEx0ZCIsImNvbXBhbnlfbWlkIjoiL2cvMTFoMXo0MXB6YiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IlphQ2xFUEUyaEMycVI0U1BBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVvc0NDc3dCUVU1VlgwNXhVV0ZIY2xWcWNrRXphRTR0Tms0M2J6TjZaR3BKU2pGTE4zcDROMDUxTkhVMFRHUk1kRmhIYVMxWlEwVXhabEpaVERCS2R6UnBabWRhVkMxQlJXbDVaRVJCZVRZd2NFRlRUR0kzUkVOWlNuUklXbTltT0RBelJVTkliMlptZEhsZldrUlBhbEpxWmsxT1RVRlFaMjlJUmpsRVZEVnhjbkpqZFVrMGExQTJiMGt4VFVWNWVHaGxPVkpHT0dZdGFWTlZha05CZURSWFNWTjNUR1pqVEZwSlVrSjFTSEJxUTJsWFZscEtkelZ4VVY5WU5qSnJaVnBrVFVremNFbFhOWEJuWkZVNWRWbEVFaFkwU0RaRFdWQk1SVTlhVTBkMFVXSjRjVzlsVVVSbkdpSkJUMDFaVW5kQk0yWjBNSFJSUWtWRWJERktZVmd3YVhwS2NYUmlVR3RSWlROQiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzU4IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEdsYXNzZG9vciIsImxpbmsiOiJodHRwczovL3d3dy5nbGFzc2Rvb3Iuc2cvam9iLWxpc3Rpbmcvc29mdHdhcmUtdGVzdC1sZWFkLWZsaW50ZXgtY29uc3VsdGluZy1wdGUtSlZfSUMzMjM1OTIxX0tPMCwxOF9LRTE5LDQxLmh0bT9qbD00MDQyNjI5NTA5XHUwMDI2dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Salesforce Developer", "company_name": "Technopals Pte. Ltd.", "location": "Singapore (+1 other)", "via": "via Monster", "description": "1. RESPONSIBILITIES\n\n· Determine business, functional and technical requirements; and participate in application design, configuration, testing and deployment.\n\n· Perform configuration and customization of the Salesforce.com platform.\n\n· Participate in efforts to develop and execute testing, training and documentation.\n\n· Produce tangible deliverables such as requirement specifications, design deliverables, status reports, project plans for project and change initiatives.\n\n· Utilize best practices to perform operational support, enhancements, and bug fixes as needed to the Salesforce.com platform.\n\n· Follow all standard operating procedures and maintain updated ticketing for events, incidents, requests, changes, problem, etc.\n\n· Proactively engage on continuous improvement efforts for application design, support and practice development efforts.\n\n· Provide technical assistance and end-user troubleshooting for bug fixes, enhancements, and how-to assistance.\n\n· Act as a point of... escalation for Service Desk and NOC ticketing for advanced issue resolution.\n\nJOB REQUIREMENTS\n\nAcademic Education & Experience\n\n· Degree in Computer Science, Software Engineering or equivalent.\n\n· At least 3 years of working experience as a Salesforce Developer.\n\n· Experience in vendor, service, stakeholders and people management.\n\n· Experience in agile software development and support mid to large scale Salesforce projects.\n\n· Direct working experience on Salesforce platforms on CRM and Digital Marketing projects.\n\n· Knowledge and experience with complex business systems integration as well as object-oriented design patterns and development.\n\n· Experience with Agile development methodologies such as XP/SCRUM.\n\nSkills and knowledge\n\n· Expertise in core web technolocies including HTML5, Javascript and jQuery.\n\n· Software engineering skills with Force.com platform (Apex, VisualForce, SOQL, Unit Testing)\n\n· Software engineering skills with Java SE & EE (Java, JSF, SQL) preferred.\n\n· Knowledge of relational databases, data modelling, and ETL tools.\n\n· Have a good problem-solving skill that is able analyze issues from multiple perspectives and derive pragmatic and comprehensive solutions to problems in sometimes an ambiguous environment.\n\n· Team player who can communicate effectively, to bring forth the ideas, plans and strategies to other stakeholders in order forge common goals and concretize deliverables.\n\n· Able to work highly independently and good project management skills.\n\n· Desire to work within a fast-paced, collaborative, and team-based support environment.\n\n​", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTYWxlc2ZvcmNlIERldmVsb3BlciIsImNvbXBhbnlfbmFtZSI6IlRlY2hub3BhbHMgUHRlLiBMdGQuIiwiY29tcGFueV9taWQiOiIvZy8xMWR4cHZreW5wIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoidkd2SG1OT3dHcm9GRC1QMkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZZQkNyY0JRVTVWWDA1eFUzTkxPVVJPUVhOa09WVjVkRTl5VTAxcFZWRkJNMnBUWlVJeFNIUktjRk5tU0djeFYwUkxhRVpSVVdFMVEzWXlTVkpOV1VsVGMwMW1WME0yT1dSdVUybDZiR0l0U21WWmVUSXpVSEo2YVVsUVYyOHpja2RNUTB4b1NVeG9ORVpRV2pkR1ExVlNVM2RWTmt4cFZrZHBObk5qV2tOSGQzaFlZbDlJWmxwTFJrb3lZMHRpWjJadGNtTnNNbUYyUkZWaVdtbE5YM05PVVRSVGNsSlFObk5VUmtGQlZ6VXpiVkUzVW5kUFZEbHJRa2hqRWhZMFNEWkRXVkJNUlU5YVUwZDBVV0o0Y1c5bFVVUm5HaUpCVDAxWlVuZEVPRE14Y2pGQlNrdFRUMFpHVmpSZmMwaG9lakJzVlUxNFdHWm4iLCJmY3YiOiIzIiwiZmNfaWQiOiJmY182NiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNb25zdGVyIiwibGluayI6Imh0dHBzOi8vd3d3Lm1vbnN0ZXIuY29tLnNnL2FtcC9qb2ItdmFjYW5jeS1zYWxlc2ZvcmNlLWRldmVsb3Blci10ZWNobm9wYWxzLXB0ZS1sdGQtc2luZ2Fwb3JlLTI3NDI2ODU1Lmh0bWw/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}], "chips": [{"type": "Title", "param": "job_family_1", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Software engineer", "value": "software engineer"}, {"text": "Senior", "value": "senior"}, {"text": "Test engineer", "value": "test engineer"}, {"text": "Cloud engineer", "value": "cloud engineer"}, {"text": "Engineer", "value": "engineer"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Assurance engineer", "value": "assurance engineer"}, {"text": "Programmer", "value": "programmer"}, {"text": "Coach", "value": "coach"}, {"text": "Qa engineer", "value": "qa engineer"}, {"text": "Devops engineer", "value": "devops engineer"}, {"text": "Frontend engineer", "value": "frontend engineer"}, {"text": "Java engineer", "value": "java engineer"}, {"text": "Solutions engineer", "value": "solutions engineer"}, {"text": "Testing engineer", "value": "testing engineer"}, {"text": "Analyst", "value": "analyst"}, {"text": "Data engineer", "value": "data engineer"}, {"text": "Design engineer", "value": "design engineer"}, {"text": "Development manager", "value": "development manager"}, {"text": "Devops consultant", "value": "devops consultant"}, {"text": "Firmware engineer", "value": "firmware engineer"}, {"text": "Lecturer", "value": "lecturer"}, {"text": "Manager", "value": "manager"}, {"text": "Network systems", "value": "network systems"}, {"text": "Principal", "value": "principal"}, {"text": "Principal engineer", "value": "principal engineer"}, {"text": "Quality engineer", "value": "quality engineer"}, {"text": "Science", "value": "science"}, {"text": "Scrum master", "value": "scrum master"}, {"text": "Security architect", "value": "security architect"}, {"text": "Security engineer", "value": "security engineer"}, {"text": "Senior engineer", "value": "senior engineer"}, {"text": "Senior lecturer", "value": "senior lecturer"}, {"text": "Senior system", "value": "senior system"}, {"text": "Senior technical", "value": "senior technical"}, {"text": "Software architect", "value": "software architect"}, {"text": "Specialist", "value": "specialist"}, {"text": "Stack engineer", "value": "stack engineer"}, {"text": "System engineer", "value": "system engineer"}, {"text": "Technical", "value": "technical"}, {"text": "Trainee", "value": "trainee"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Wholesale", "value": "/business/naics2007/42"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Mining", "value": "/business/naics2007/21"}, {"text": "Rental", "value": "/business/naics2007/532"}, {"text": "Retail", "value": "/business/naics2007/44"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": ".AB4Jjf.qPB6Vc{padding-right:11px}.qfpP8d{padding:7px 0 7px 11px}.S003Ke{flex:none}.ZoN4Lb{color:rgba(0,0,0,.54)}.nAXVG{color:#70757a}.IxQsL{color:rgba(0,0,0,.26)}.xFO1De{color:#fff}.ooFpK{color:rgba(255,255,255,.30)}.mtnwac{color:#4285f4}.WxeeKb{color:#34a853}.hIVRU{color:#f29900}.EXaTMc{color:#fbbc04}.sxn46d{color:#000}.gqMTF{color:#1a73e8}.zpn8Mb{color:#d93025}.dEUPmd{color:#1e8e3e}.PJNo1{color:#fbbc04}Actively Hiring", "value": "e"}, {"text": "EPAM", "value": "/m/0dlnrc"}, {"text": "VISA", "value": "/m/01kqjn"}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Zühlke", "value": "/g/1hh_rg216"}, {"text": "Cardinal Health", "value": "/m/040vzx"}, {"text": "Credit Agricole Group", "value": "/m/028vbm"}, {"text": "GlobalTix Pte Ltd", "value": "/g/11dxpqdhrf"}, {"text": "HCL SINGAPORE PTE. LTD.", "value": "/g/11fy25ngsv"}, {"text": "Jobline Resources Pte Ltd", "value": "/g/11gp2647pn"}, {"text": "Mediacorp", "value": "/m/03qtz1"}, {"text": "Realtek", "value": "/m/05wrm7"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "TECHNOPALS PTE. LTD.", "value": "/g/11dxpvkynp"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "Thales", "value": "/m/01phj4"}, {"text": "UST", "value": "/m/08kb8g"}, {"text": "UrbanFox", "value": "/g/11ghs7y0w6"}, {"text": "Activate Interactive", "value": "/g/11dxq192l5"}, {"text": "Cognizant", "value": "/m/03bf9h"}, {"text": "DELL", "value": "/m/0py9b"}, {"text": "HCL Technologies", "value": "/m/0698gv"}, {"text": "ORACLE", "value": "/m/05njw"}, {"text": "PUBLICIS SAPIENT", "value": "/m/09n8_2k"}, {"text": "Singapore Press Holdings Limited", "value": "/m/0d7mwh"}, {"text": "Temasek Polytechnic", "value": "/m/098s73"}, {"text": "TikTok", "value": "/g/11fy265933"}, {"text": "Zendesk", "value": "/m/0wkm4pl"}, {"text": "A-it Software Services Pte Ltd", "value": "/g/11dxpy_gl_"}, {"text": "ACCENTURE PTE LTD", "value": "/m/09n8w94"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "Adecco GS", "value": "/m/08gz46"}, {"text": "Atidan Technologies", "value": "/g/11c74f0b8_"}, {"text": "Autodesk", "value": "/m/018nm3"}, {"text": "Avnet", "value": "/m/0c8xmc"}]}]}