{"search_metadata": {"id": "60827b3cf8f5f77b311c80f0", "status": "Success", "json_endpoint": "https://serpapi.com/searches/acec72ae7fd5b281/60827b3cf8f5f77b311c80f0.json", "created_at": "2021-04-23 07:46:04 UTC", "processed_at": "2021-04-23 07:46:04 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28consultant%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=180", "raw_html_file": "https://serpapi.com/searches/acec72ae7fd5b281/60827b3cf8f5f77b311c80f0.html", "total_time_taken": 1.04}, "search_parameters": {"q": "(consultant) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "180"}, "jobs_results": [{"title": "Investment Consultant", "company_name": "UBS", "location": "Singapore", "via": "via Glassdoor", "description": "Singapore\n\nSales\n\nGlobal Wealth Management\n\nJob Reference #\n228122BR\n\nCity\nSingapore\n\nJob Type\nFull Time\n\nYour role\nDo you have the ability to provide holistic investment advice in Capital Markets? Do you have expertise across a range of asset classes and markets? Do you want to maximize the benefits of a global franchise for the good of clients? Do you have proven track record advising clients in advisory portfolios across bespoke instruments?\n\nWe are looking for Investment Consultants to:\n• partner the Client Advisers to provide holistic and bespoke investment solutions on Capital Market products to priority clients\n• collaborate with our Chief Investment Office (CIO) and other investment advisory teams to pitch UBS' entire investment and trading capabilities\n• participate in client meetings in Singapore and on business trips regarding acquisition, review and retention of clients\n\nYour Career Comeback\nWe are open to applications from career returners. Find out more about our program... on ubs.com/careercomeback.\n\nYour team\nYou will be working as part of Wealth Management APAC in Advisory & Sales as an Investment Consultant based in Singapore. The Investment Consultant team is responsible to activate our larger clients by bringing them timely asset class targeted solutions. This equates to a co-coverage model between a Client Adviser and an Investment Consultant. The Investment Consultant will support the Client Adviser to ensure that UBS’ entire investment and trading capabilities are systematically provided to these priority clients. We are a dynamic, open minded and active team that enjoys working to provide best in class solutions for our clients.\n\nYour expertise\n• at least 7 years of experience in sales, marketing or trading of Capital Markets services\n• specialization in at least one asset class or product type, such as Equity, Fixed Income, Foreign Exchange, Structured Products, or Derivatives\n• possess a strong drive, initiative, adaptable and be able to work independently in a stressful and demanding environment\n• proven presentation skills in front of clients and Client Advisers, and strong understanding of the needs and sensitivities of clients (private individuals and families)\n• sales and service oriented with excellent communication skills\n• an advanced degree in the area of finance. CFA certification is a plus\n• fluent in English and business Mandarin, while other languages are a plus to service the Greater China market.\nThis is a demanding role due to the complexity and high volume of the business. Perseverance, initiative and a strong drive are key attributes to be successful in the role\n\nAbout us\nExpert advice. Wealth management. Investment banking. Asset management. Retail banking in Switzerland. And all the support functions. That's what we do. And we do it for private and institutional clients as well as corporations around the world.\n\nWe are about 60,000 employees in all major financial centers, in more than 50 countries. Do you want to be one of us?\n\nJoin us\nWe're a truly global, collaborative and friendly group of people. Having a diverse, inclusive and respectful workplace is important to us. And we support your career development, internal mobility and work-life balance. If this sounds interesting, apply now.\n\nDisclaimer / Policy Statements\nUBS is an Equal Opportunity Employer. We respect and seek to empower each individual and support the diverse cultures, perspectives, skills and experiences within our workforce", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJJbnZlc3RtZW50IENvbnN1bHRhbnQiLCJjb21wYW55X25hbWUiOiJVQlMiLCJjb21wYW55X21pZCI6Ii9tLzAzMXJ4cCIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImZheW9sSkF3NU1zLUdxQ2VBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVzc0JDb3dCUVU1VlgwNXhVbEJvV0VOT2RIb3RUa0pIT0RSNFUycHdSRTlYUTNJNVVYWkpTSGx2VjJwblduWkZaMEkyZHkxbWNVbzBWM1kxVURkT1kyaE5OSE16TTFkeFpVOXlaekZQZFc1U1VGZHhabVpuVVdaWWFreGpaMWRQVWxwRVMyVmlVbEp6VkdWRVVtcGpMWE5TUkRCTFkzQkhkVk0zZFd0cGVqRldVVEJYYUVWWlVtaHVZbXd3TTJObFRIa1NGbEJJZFVOWlN5MU9TamxUYzNSUllUQnhTbFJSUkdjYUlrRlBUVmxTZDBKd1YyeFhUV1ZsYXpCaVFVaEZVMGhxUzFWdVNuTlVRV2hyTTJjIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBHbGFzc2Rvb3IiLCJsaW5rIjoiaHR0cHM6Ly93d3cuZ2xhc3Nkb29yLnNnL2pvYi1saXN0aW5nL2ludmVzdG1lbnQtY29uc3VsdGFudC11YnMtSlZfSUMzMjM1OTIxX0tPMCwyMV9LRTIyLDI1Lmh0bT9qbD00MDY1NzIzMzkxXHUwMDI2dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "#BAS2020 Consultant, Application Architecture", "company_name": "Singtel Group", "location": "Singapore", "via": "via Singtel Careers", "description": "Overview\n\nResponsible for planning, developing, implementing and maintaining the overall company's software security strategy using various software security testing methods and techniques\n\nKey Roles & Responsibilities\n• Design, implement, operationalize and maintain security management systems\n• Provide in-depth security-related technical advice, recommendations and consultancy on networks, infrastructure, applications, products and services supplied\n• Deliver information security management reviews, information security management system audit and risk assessments\n• Review code in order to improve software security\n• Debug issues that when necessary\n• Suggest timely solutions to issues\n• Ensure alignment of business processes and technical implementation\n• Provide or assist with implementation documentation\n• Ongoing project management\n\nThe Ideal Candidate Should Have/ Be\n• Experience in information security management and related functions such as IT Risk Management\n• 3 years and... above of experience in software development environments\n• Any of the followings: Java, Java Enterprise, JavaScript, .NET, .NET Core, …\n• Ability to align business requirements to information security policies\n• Aptitude for translating information security requirements into IT security solution\n• Certification in appropriate technologies is an advantage\n• Attention to detail\n• Self-motivated with a positive “can-do” attitude, creative with excellent presentation, communication, negotiation and interpersonal skills including strong persuasive techniques.\n• Proficient in written and spoken English\n• Degree in Computer Science / Computer Engineering / Information Technology related field, or IT equivalent\n• Ability to travel as required", "extensions": ["20 days ago", "Full–time"], "detected_extensions": {"posted_at": "20 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiIjQkFTMjAyMCBDb25zdWx0YW50LCBBcHBsaWNhdGlvbiBBcmNoaXRlY3R1cmUiLCJjb21wYW55X25hbWUiOiJTaW5ndGVsIEdyb3VwIiwiY29tcGFueV9taWQiOiIvbS8wMjB6ZmwiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJNTmtVVTdwYzRVZnk1b0tMQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VW14b2JUY3hOSHBFTVdSNWJuUnBkbU01TjNSRVkyTXhZbnAxVXpWRmRHbFNWME5UVUVKQlEzZEhlbWxTZUdwNFpYRmlUMEp6Y2xNeGExQmlkRFpaWm1WRlVWbzJaMmhRYTFNMFVURjBXa0pCYmxRNGFVWTFhVGhNWWtWeVRtMHhjVEV4YTFVek9YbGFTR1pDV2tSR2NIZHZPRE4yVWxnelN6SktNamxCVHpJNE1FNWZiR3MwUW10TFdHTklValpqWmtvNVluQkhTMDFqVDFKUkVoWlFTSFZEV1VzdFRrbzVVM04wVVdFd2NVcFVVVVJuR2lKQlQwMVpVbmRETm5CVk0yOU1WMnRKWWtGQlVuZHROVWRMZVdwNmJHWnNSa3gzIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMTUiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gU2luZ3RlbCBDYXJlZXJzIiwibGluayI6Imh0dHBzOi8vZ3JvdXBjYXJlZXJzLnNpbmd0ZWwuY29tL2pvYi9JVC1BcmNoaXRlY3QtU2luZy81NzIzMzYxMTAvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "QC Specialist ll (US MNC/ $4000+/ East/ MDSAP/ ISO13485/ 2 years exp/ Contract)", "company_name": "Achieve Career Consultant Pte Ltd", "location": "Singapore (+1 other)", "via": "via Joblum Singapore", "description": " Leading US MNC\n Basic S$4,000 (Salary will commensurate according to experience & qualifications)\n Thorough understanding and knowledge of MDSAP & ISO 13485 !\n One year contract (Convertible to perm)\n Certified Quality Engineer and/or Certified Reliability Engineer will be a plusOur client is a leading US MNC US MNC, dealing with life science products related to Covid19. They are looking for suitable candidates to join their growing business as QC Specialist ll.\nRESPONSIBILITIES:\n• Lead and drive internal and/or supplier non-conformances to ensure timely disposition for closure of QNs.\n• Identify and drive continuous Product Quality improvement of internal manufacturing processes for existing products.\n• Perform monitoring and analysis on creeping issues on reported Customer Returned Instrument history and identify continuous Product Quality improvement opportunities.\n• Identify and establish in-process/ outgoing Product QC inspection criteria and provide training to QC... Technicians.\n• Maintain KPIs for monitoring of process and/or product quality, perform analysis, and interpret trends, identifying and activating on appropriate actions as necessary.\n• Maintain and ensure Products CDF are timely updated for Product Safety periodic assessment by certification house.\n• Participate and review Site Process Validation activities to ensure Quality control adequacy.\n• Generate and analyze weekly, monthly Product Quality performance reports for Management review.\nREQUIREMENTS:\n• Bachelor’s Degree in Mechanical or relevant engineering.\n• Minimum 2 years of manufacturing quality control in regulated environment is preferred.\n• Experience in Process validation activities as Quality function.\n• Experience with ERP systems a plus, SAP preferred.\n• Knowledge of MDSAP and/or ISO13485 requirements. Preferable lead auditor certified.\n• Hand-on experience of statistical tools application. Lean/ Six Sigma Green Belt preferred.\n• Possesses excellent problem-solving, interpersonal, communication and leadership skills.\n• Must be self-motivated, result oriented with minimal supervision.\n• Certified Quality Engineer and/or Certified Reliability Engineer will be preferred.\nOTHER INFORMATION:\nLocation : East\nSalary : S$4,000 (Salary will commensurate according to experience & qualifications).The Company strives to achieve employee satisfaction and provides conducive working environment, attractive incentives and remuneration to all staff.\nHOW TO APPLY:\nSimply submit your application by emailing a detailed copy of your updated Resume in MS Word Format to Tan Dyin Yin (DY) (Reg. No.: R1986524)\ndyinyin.tan@achievegroup.asia\nor call your friendly Consultant, at 6590 9862 for a discussion. I will be glad to assist you!\nPlease indicate the below information in your resume:\nCurrent & Expected salary\nReason(s) for leaving\nAvailability to commence work\nBy submitting any application or résumé to us, you will be deemed to have agreed and consented to us collecting, using,\nretaining and disclosing your personal information to prospective employers for their consideration.\nAll applications will be treated with the strictest confidence.\nYOUR SUCCESS IS OUR ACHIEVEMENT", "extensions": ["25 days ago", "$3.5K–$4.2K a month", "Full–time"], "detected_extensions": {"posted_at": "25 days ago", "schedule_type": "Full–time", "salary": "$3.5K–$4.2K a month"}, "job_id": "eyJqb2JfdGl0bGUiOiJRQyBTcGVjaWFsaXN0IGxsIChVUyBNTkMvICQ0MDAwKy8gRWFzdC8gTURTQVAvIElTTzEzNDg1LyAyIHllYXJzIGV4cC8gQ29udHJhY3QpIiwiY29tcGFueV9uYW1lIjoiQWNoaWV2ZSBDYXJlZXIgQ29uc3VsdGFudCBQdGUgTHRkIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJINFZEaGlHODBQUFM2YTAzQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYmx1bSBTaW5nYXBvcmUiLCJsaW5rIjoiaHR0cHM6Ly9zZy5qb2JsdW0uY29tL2pvYi9xYy1zcGVjaWFsaXN0LWxsLXVzLW1uYy00MDAwLWVhc3QtbWRzYXAvNTg2ODMyP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": ".net It Consultant", "company_name": "CTES Consulting Pte Ltd", "location": "Singapore (+1 other)", "via": "via MNC Jobs Singapore | MNC Jobs In Singapore", "description": "Job No: 2184 | Advertised on: 2020-08-27 | CIC: Jaclyn Tan | Reg. No: R1104237\nJob Location(s): West (eg: Queenstown, Jurong, Clementi, Tuas)\n\nJOB DESCRIPTION\nOur client is actively searching for a .Net IT Consultant to join their team!\n\nIf you are a dynamic individual seeking a new career opportunity, read further!\n\nReporting to the Deputy Director of Communications & Information Technology Division, the successful applicant will be responsible for the following:\n\nThe responsibilities of this role are:\n• Work closely with other divisions in new academic initiatives, projects and system evaluations\n• Manage developers and vendors to ensure that all projects are delivered on-time, within scope and within budget\n• Ensure developers and vendors perform works compliant to IT policy and Standard Operation Procedures (SOPs)\n• Prepare technical specifications for tenders and projects\n• Develop project scopes and objectives, involving all relevant stakeholders and ensuring technical... feasibility\n• Perform risk assessments to minimize risks for change requests\n• Plan and manage budgets and resources for projects\n• Create and maintain comprehensive project documentation\n• Establish and maintain good relationships with stakeholders and vendor\n• Manage project applications\n\nThe ideal candidate will need to have the following qualities and experience:\n• Degree in computer science or engineering or equivalent from a recognised university\n• Minimum 8 years of relevant working experience in similar area and with at least 3 years of project management experience\n• Good project management skills (PMP / PRINCE II or equivalent certification is a plus)\n• Proven technical background with understanding or hands-on experience in application development using Microsoft technologies (.NET, ASP.NET MVC, C#, SQL)\n• Prior experience in Peoplesoft would be an advantage\n• Outstanding analytical, problem solving, and critical thinking skills\n• Excellent oral, written, presentation, communication and interpersonal skills\n• Solid organisational skills including attention to detail and multi-tasking skills\n• Proactive and independent in managing potential issues\n• Able to interact with various stakeholders in all levels and with different backgrounds\n\nAll applicants' CV will be treated with the strictest confidentiality. We regret to inform that only shortlisted candidates will be contacted.\n\nSALARY\nS$6,500.00 - S$7,200.00 per Month", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiIubmV0IEl0IENvbnN1bHRhbnQiLCJjb21wYW55X25hbWUiOiJDVEVTIENvbnN1bHRpbmcgUHRlIEx0ZCIsImNvbXBhbnlfbWlkIjoiL2cvMTFqcm40bTF4YyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Il9INEUtUkpUNVRWSW5YNm5BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVvc0NDc3dCUVU1VlgwNXhVa1p5VEVvd1FWZE1ha0pHZFRWUFpXNVlObVZVYXpBM1VsTnlUblpYWkVSMU4yVXRYek55UlRkM2VFUmxkbEZFWlVaQlJWbDJiVEZKVUVVeWNXSm5VRXBGYW5kc1ZqTk9SRzVhWDJwck9FUTNjazVxWmxSNU9HUjVSMEZVU2xGMGMwTmFVblJPT0UwemNIRldYemgyVjA1bFdFaEJTMUphUjNOQlRrNVBjRlI2U21SRldGOTZiVTV6YmxKb2JqSmxhVTV3TUV0R05EUklWVlprY0ZSUmVsRkdTV0pEV0U1elVrbE1hMk5QYTIwMmJEZHViMkZ1Y1VGSU5XSlRVRWhKYlVKUVFraDVFaFpRU0hWRFdVc3RUa281VTNOMFVXRXdjVXBVVVVSbkdpSkJUMDFaVW5kQ2FsSXRTVGx1Y0hod1ZVTlhieTFUZWxwbFpVZHdOVk00VTFwbiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzI2IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1OQyBKb2JzIFNpbmdhcG9yZSB8IE1OQyBKb2JzIEluIFNpbmdhcG9yZSIsImxpbmsiOiJodHRwczovL3NnLm1uY2pvYnouY29tL2pvYnMvbmV0LWl0LWNvbnN1bHRhbnQtcXVlZW5zdG93bi0yMjY3NTc/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Principal Consultant", "company_name": "None", "location": "Singapore", "via": "via Jobs", "description": "Seeking a certified OD Practitioner who is the domain expertise who act as OD advisor and lead in OD projects.The main responsibilities of the position include:- Align the development, growth and foci of the OD practice field and identify areas and opportunities where OD can make a significant impact - Act as an OD advisor to the projects and workstreams when required;- Research and keep abreast on up-to-date and emerging OD and capability-building topics and developments.- Develop and provide thought leadership in the field of Organisation Development and its sub-domains to both external and internal stakeholders in order to advance OD practice and capability development efforts- Establish and cultivate a strong network of potential collaborators in OD including local and overseas experts, institutional partners; and facilitate cross-boundary collaborations and exchange to support the achievement agenda;- Provide domain expertise and design inputs to the development of products and... services of the interface teams. Be a Subject Matter Expert to specific client projects or in the delivery of key programmes. Play an integrative role between the various teams research, data & digital, practice and interface and ensure alignment, coherence and optimization of resources within and across the Institute.- dentify and engage in opportunities as a Centre of Excellence for OD through existing channels - Support the development of new digital content, thought leadership/opinion pieces, and learning experiences including sourcing for innovative ways to deliver scalable and effective e-learning and virtual classrooms;- Contribute to development of the practice. This might include grooming internal OD talents, developing a structured roadmap to practice development and leading groups of staff and partners to convene on the practice. Conduct mentoring of individuals or groups, developing other practitioners as a standalone or as part of our suite of offerings.Qualifications · Professionally certified in Organisation Development with a general degree, with preferably more than 10 years of related Organisation Development experience.· Strong grounded presence with key stakeholders and public service agencies' leaders· Strong people and communication skills· Wide range of work experiences including the public service preferred· Wide established network and personal influence in the OD practice will be an adv", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcmluY2lwYWwgQ29uc3VsdGFudCIsImNvbXBhbnlfbmFtZSI6Ik5vbmUiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjlwSnpEeHI5TnVycnFsQ3hBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9icyIsImxpbmsiOiJodHRwczovL3NnLmZpZGFudG8uY29tL2pvYnMvam9iLW9wZW5pbmcvY291bnNlbG9ycy1hbGwtb3RoZXIvcHJpbmNpcGFsLWNvbnN1bHRhbnQtMjc1NDgzNDM4P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Mobile and Messaging Senior Consultant", "company_name": "INFOSYS COMPAZ PTE. LTD.", "location": "Singapore (+1 other)", "via": "via LinkedIn", "description": "Job Requirement\n\nDesign, plan and implement Messaging/Enterprise Mobile Device Management/Email security technologies.\n\nProvide advice to support engineers in troubleshooting complex messaging related issues for customers.\n\n5-10 years of experience on Exchange 2013/2016 on-prem system, MDM (Mobileiron/Intune), AAD, O365 and email infrastructure related areas.\n\nExchange 2013/2016 On-premise / Hybrid\n\nMDM (Mobileiron / Intune)\n\nAzure AD, Microsoft 365, Exchange Online\n\nEmail security related products (Proofpoint, TrendMicro, AIP, Rights Management)\n\nEmail infrastructure related areas.\n\nVmware\n\nAdvantage to have MSCE / O365 related / ITIL certification.", "extensions": ["2 days ago", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgYW5kIE1lc3NhZ2luZyBTZW5pb3IgQ29uc3VsdGFudCIsImNvbXBhbnlfbmFtZSI6IklORk9TWVMgQ09NUEFaIFBURS4gTFRELiIsImNvbXBhbnlfbWlkIjoiL2cvMTFmMDFjYnlwcCIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Im5WN2N2eGhRVXJBS01BN1RBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVvc0NDc3dCUVU1VlgwNXhVemMzU2w5bWNtWlVkWEZNVkROT1ZrRmljMVV5U1ZsSlYwbENNelZzVlVSQlJXWnBaRlpWTjJ0NGVVRkViSFJXU1d0UFNIQkxUV2hpUlU1TGNITTJPV2RmUmtkSUxVNUplVVJ6YVcwdGRVbHJiVFZLV2xWRFMwTkVPVk5PU2t4V1V6SXdhWGxOYTIxemIxRkJjMGh2T0ZKZlNWcFJTMDFKVWpGRE5qTmpVVVU0WWxaMFdGZDBhRXhEUzFobVdtSXRTRlk0TFRsQ1VXdExOa0V4U0Y5UVdFUk1jVjlPUmxBdFpHb3djVmRRUkRneVNWbEJOMmczWWpST1dHZ3lWVlp3ZERKb1dFaHNFaFpRU0hWRFdVc3RUa281VTNOMFVXRXdjVXBVVVVSbkdpSkJUMDFaVW5kQ01UaE9lRlZNV2tGNk5XTmFiMWRMUm5GclduYzBhRTVLVEZobiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzM2IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExpbmtlZEluIiwibGluayI6Imh0dHBzOi8vc2cubGlua2VkaW4uY29tL2pvYnMvdmlldy9tb2JpbGUtYW5kLW1lc3NhZ2luZy1zZW5pb3ItY29uc3VsdGFudC1hdC1pbmZvc3lzLWNvbXBhei1wdGUtbHRkLTI1MTQxMTU3NTY/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "PILATES INSTRUCTOR / FITNESS CONSULTANT (BB-609DE)", "company_name": "ABSOLUTE YOU SG PTE. LTD.", "location": "Singapore", "via": "via BeBee", "description": "Roles & ResponsibilitiesWe're seeking a Pilates Reformer instructor to join our team. As our new Pilates Reformer instructor you must be: Enthusiastic about group exercise classes and enjoy creating and delivering new, fresh and innovative routines Confident in your professionalism by reporting on-time with a positive attitude and a passion to motivate others A professional who is collaborative and a flexible leader in and out of the studio Qualified candidates must possess all of the following: More than 3 years of experience (preferred) actively leading successful Pilates private sessions and group classes on apparatus equipment. Current nationally accredited Pilates certification (Prefer Certification by Stott, Balanced Body or Polestar) POSITION REQUIREMENTSCertification/Licensure: Certified Pilates Instructor Must possess Internationally recognized group fitness certification in order to teach specialty classes. (Les Mills, AFAA or ACE Certified is a plus) Experience Experience... with all ages and special populations is preferred. Experience teaching classes is preferredTell employers what skills you haveAdaptabilityCollaborationCommunication SkillsExcellent Communication SkillsInspiring LeadershipLeadership MentoringTeam LeadershipOn timeAbility to work creativelypositive attitudeDeterminedProfessionalismenthusiastic", "extensions": ["5 days ago", "Full–time"], "detected_extensions": {"posted_at": "5 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQSUxBVEVTIElOU1RSVUNUT1IgLyBGSVRORVNTIENPTlNVTFRBTlQgKEJCLTYwOURFKSIsImNvbXBhbnlfbmFtZSI6IkFCU09MVVRFIFlPVSBTRyBQVEUuIExURC4iLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Im5FX3c4elFkTUl4WUJXV3hBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQmVCZWUiLCJsaW5rIjoiaHR0cHM6Ly9zZy5iZWJlZS5jb20vam9iLzIwMjEwNDE4LWI3MjJlNjY1NmZhYWVmNzU1ODVlNDZlY2Y0ZjYwOWRlP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "SAP BASIS Automation Consultant", "company_name": "Geco Asia", "location": "Singapore (+1 other)", "via": "via GECO Asia Pte Ltd", "description": "We are looking for a SAP BASIS Automation Consultant, who is/are able to fulfill the following requirements:\n\nDuration: 6 Months\n\nRequirements:\n- With 7-10 Years experience\n- Hands on experience in:\n-> Automation Technologies: Python, Perl, Saltstack, Go4SAP, LaMa, Frontend Automation, (RPA),\n-> Application: SAP Basis, NetWeaver, ABAP/Java-Stack, SAP PI/PO, Avantra, ServiceNow, SAP LaMa\n-> Database: SAP HANA, Oracle, MaxDB\n-> Operating Systems: Linux, Unix, Windows\n- Technical: Standardization of SAP Architecture, Designing of High Availability and Disaster Recovery Solutions, Installing SAP System, Backup & Restore/Recovery of Databases, Shadow Databases (Oracle Dataguard, HANA System Replication, MaxDB HotStandby,…), Virtualization, Scalability, SSO/SSL Configuration, SAP Hardening, Support Package Upgrade, Shell / Python scripting, experience in driving automation using, Capable of designing and implementing different strategies and procedures (Like System Landscape, System... Architecture, Backup Strategy, System Refresh, Patching, Stress/Performance testing etc…), Service Improvements Area , Underlying Infrastructure stack: Hypervisor, Storage, Network.\n- Experience in running operations with ITIL processes / ITIL certified.\n- Excellent Analytical and troubleshooting skill.\n- Creative thinking in implementing Service improvements (automation, incident reduction, etc.).\n- Willingness and flexibility to learn new technologies, scale up quickly and adapt to different roles as the situation demands.\n- Experienced in running operations following ITIL processes.\n- Strong multi-tasking skills and abilities to handle changing priorities in a fast-paced environment\n- Strong customer focus and management of client expectations\n- Should work with minimum supervision\n- High customer orientation\n- High quality awareness\n- Test planning and supervision\n\nRoles and Responsibilities:\n- As an SAP Basis Automation Consultant, you are responsible for designing and standardizing the SAP Automation solution on both on-premise as well as in the cloud.\n- You will test new technologies and create Proof of Concepts around them.\n- You will work with the client to understand their need from new or existing technologies.\n- You will create Work instructions for new technologies / functions before they are implemented in existing or new environments.\n- You will transfer new technologies into the existing operations.\n- You will optimize the existing SAP System architecture in the Datacenter.\n- Driving automation using state-of-art automation platforms like SaltStack\n- Proven SAP systems delivery and/or system administration knowledge across the suite of major SAP applications & versions.\n- You will also play an important role in the development, configuration and deployment of the overall solution.\n- You will guide teams on project processes, deliverables and contribute to the proposal development, client training and internal capability-building and help detail the project scope.\n- You will have the opportunity to shape value-adding consulting solutions that enable our clients to meet the changing needs of the global landscape.\n- Writing solutions / estimates for RFPs.\n- Automation of Technical delivery of SAP Basis, HANA and Oracle administration activities for production support environments\n- Analyze reoccurring Incidents, Problem tickets and provide automation recommendation / solution for a permanent fix.\n- Train the users (end and key users) and prepare training material if required in order to ensure a smooth transition to the new system/process for the users\n- Create and maintain knowledge repository for issues resolved, encourage team members to add knowledge based on their experience and assist in building useful documents in order to leverage the knowledge gained over the years in relevant areas.\n- Resolve simple common issues with speed and accuracy, understand issue and analyse root cause through direct customer interaction. Bring expertise in package/system/solution to resolve complex issues and cross functional issues and communicate with clients effectively in order to resolve customer issues with greater efficiency and accuracy\n- Analyse the requirements by demonstrating strong process/solution/ product knowledge, understanding of the business/IT scenario, understanding of constraints in implementation and technology. Participate in JAD sessions, review the solution from end to end process perspective with implications in related functional/product areas and arrive at solution alternatives to bridge the gap in order to deliver detailed TO BE design flows, Configuration Sheets, detailed Functional/process/system specification documents, Fit Gap analysis and other supporting documents to describe the solution design.\n- Follow the steps for deployment as envisaged in the project plan, foresee possible cutover issues and plan for them proactively. Resolve data migration issues, resolve cut over user issues with speediness and coordinate among other team members for deployment activities in order to ensure a smooth go live to new processes or product or system for the customer.\n- To shape value-adding consulting solutions that enable our clients to meet the changing needs of the global landscape.\n- Guide team(s) on project processes, deliverables and contribute to the proposal development and internal capability-building and help detail the project scope\n- Implement automations for significant reduction in manual efforts, it is essential to have hands-on experience.\n- Create and publish knowledge base articles and contribute to knowledge management activities in the service.\n- Analyze reoccurring Incidents, Problem tickets and provide recommendation / solution for a permanent fix.\n- Identify automation opportunities amongst daily tasks and provide inputs for script development.\n- Train and mentor L1/L2 on complex activities to cater to the next in-line support chain\n\nPlease send your application to applicants@geco.asia with (JOB_002392) in Subject line and highlighting:\n- Your relevant experience\n- Current/expected salary\n- Availability information\n- A latest MS-WORD Resume", "extensions": ["3 days ago", "Contractor"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Contractor"}, "job_id": "eyJqb2JfdGl0bGUiOiJTQVAgQkFTSVMgQXV0b21hdGlvbiBDb25zdWx0YW50IiwiY29tcGFueV9uYW1lIjoiR2VjbyBBc2lhIiwiY29tcGFueV9taWQiOiIvZy8xMWdrNzJfYnRfIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiSXVCUUpNQ1ZadUtxNmlpQ0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFVtNXdiMUl3VnpkVFZrdHhOelpGYmtsbmFrRXlPVFpuVVdoMFNtNTFXRTV0VG5OTVRGOWpTV05FVkZoNVRWZ3hhVXQyUmpKWGNYZ3RhSGxLUWt0MWFteGZVRmRTTTFGQ2NHY3dTMUJUTjJKSVpuUTVkRkJsUjJsV1VFbDFiRzlHTWtwNWNYcDZlazVCT0VvMFZUVXRkM3BYUmpsNlEzTm9WRFZsTjJZNVRtNUNXRTluYmxsMGFXWnFjR3B3TVVkd01qVnVPVVF6VmpkNlJqZEJFaFpRU0hWRFdVc3RUa281VTNOMFVXRXdjVXBVVVVSbkdpSkJUMDFaVW5kQll6ZG9hM0oyVTBscU1GZGpPWFoyVWtVNVVHWnZja3RsU0VSUiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzQ3IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEdFQ08gQXNpYSBQdGUgTHRkIiwibGluayI6Imh0dHBzOi8vd3d3LmdlY28uYXNpYS9qb2Ivc2FwLWJhc2lzLWF1dG9tYXRpb24tY29uc3VsdGFudC8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Solution Architect Consultant", "company_name": "D&S SOLUTIONS PTE. LTD.", "location": "Singapore (+1 other)", "via": "via MNC Jobs Singapore | MNC Jobs In Singapore", "description": "(Job Scope)\n• Be a solution architect supporting one of our key customers in Asia.\n• Capture and interpret customer requirements, and design complex and custom solutions to meet customer requirements. (Road Mapping Planning)\n• Build accurate scalable cost models and provide input into pricing strategy. (Costing modeling concept)\n• Identify and document any risks to the solution (Risk Advisor)\n• Document solution in RFP responses, proposals and Statement of Works/High Level Designs\n• Identify and document any risks to the solution\n\n(Requirements)\n• Engineering background with over 10+ years of experience.\n• CCNP qualified – Advantage with CCIE certification.\n• Knowledge of working in a financial institution (Multi-Nation Banking organization) in its technical and IT environment is a big advantage\n• Knowledge of working in a hybrid cloud environment is a plus\n• Ability to present to internal stakeholders and up to C-level at customer location\n• Interpersonal skills and teamwork with... multinational teams.\n• Leading and working with virtual solution and the project management team throughout the project\n• Analytical and critical thinking\n• Detail orientation, operates with precision\n• Ability to both influence, and show resolve under pressure from both customers and internal stakeholders to ensure solution designs are deliverable\n\nminimumYearsExperience : 10\n\n[CANDIDATES WHO REQUIRE WORK PASSES NEED NOT APPLY", "extensions": ["7 days ago", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2x1dGlvbiBBcmNoaXRlY3QgQ29uc3VsdGFudCIsImNvbXBhbnlfbmFtZSI6IkRcdTAwMjZTIFNPTFVUSU9OUyBQVEUuIExURC4iLCJjb21wYW55X21pZCI6Ii9nLzExZHltOTg2ZjgiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJNTWhaa0FCOGdteHRyOG1lQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFb3NDQ3N3QlFVNVZYMDV4VTI0MlMySXdkV2h5VVUxdk5VNXJhbXBXVUhvMVprZEJkVlptTTFFelRITmpXSFJNYnpCc2RGSkhVVWxRWVVwNVF6TkZSMVprWW1sSFRUaG1PSHBmWkZRd01ESkVPSEJvYkZCc1lrZ3pTbXBtT1RoQ1MyaERPVFZHZDJveVJIQm1OVWRvVkZOZlpXTklWbDgzTTBGVVVXVTNhMWR0ZGxaYVUzZzROMU5vVVhoSFVXa3hiM2gzWWw5YVZFWjFkbTFZTTNZd1pEWmxRMFZUVGpCM2VuSjRRa2RXTjNZd1FYQkxUbmt4TlZwTFVVeFZZWGRHV25GSVIxTlRPVzFxVVc5TFpGSlZOV0pNRWhaUVNIVkRXVXN0VGtvNVUzTjBVV0V3Y1VwVVVVUm5HaUpCVDAxWlVuZENjMk5aTkdKV1ltMDJNelJqYjI0eVVWRmtRVGN6Y3psRFprNVIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY181NCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNTkMgSm9icyBTaW5nYXBvcmUgfCBNTkMgSm9icyBJbiBTaW5nYXBvcmUiLCJsaW5rIjoiaHR0cHM6Ly9zZy5tbmNqb2J6LmNvbS9qb2JzL3NvbHV0aW9uLWFyY2hpdGVjdC1jb25zdWx0YW50LXNpbmdhcG9yZS0xODEwMTc/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Cybersecurity Consulting", "company_name": "The Edge Asia", "location": "Singapore", "via": "via Glassdoor", "description": "Our client is a well-established consulting firm with a growing Technology Consulting practice in South East Asia (SEA). As demand within the Cybersecurity space grows, they are looking to bring in a Partner and Director to support this growth.\n\nFor more details and a confidential discussion on both the Director and Partner level please contact Pamela Yu on +65 9825 6933 or email your cv directly in word format with job reference no. Jo0000004844 to banking-sg@theedgeinasia.com\n\nPlease note that due to the high number of applications only shortlisted candidates will be contacted. If you do not hear from us in the next 5 business days we regret to inform you that your application for this position was unsuccessful.\n\nEA Licence : 16S8131\n\nRecruiter Licence : R1328559\n\nKey responsibilities\n• Framework design and strategy based on client’s organizational business and strategic objectives.\n• Lead engagements and delivery through collaboration with senior stakeholders internally and... externally.\n• Security architecture and governance plans development.\n• Design and operate governance and security processes at all levels.\n• Define security policy and standards framework definition.\n• Participate in designing of security organization structure and strategy including developing policies, standards, and procedures.\n• Assessment of current cybersecurity practices against the defined controls and provide recommendations for to-be state.\n• Run Diagnostic Assessments and develop programs for cybersecurity skill development and enhancement.\n• Design cybersecurity awareness and stakeholder sensitization program including materials, posters, newsletters, training workshops, etc.\n• Identify and lead projects to implement new feature in core systems and redesign existing processes.\n• Demonstrated ability to mentor manage and guide a team with diverse skill sets\n\nRole requirements\n• Minimum of 10 years of relevant experience within consulting or professional services.\n• Recognized degree in in Computer Science, Information Systems, Information Technology, Engineering, or equivalent.\n• Proven track record in dealing with Cyber Risk Strategy, Identity & Access Management or Cyber defence.\n• Demonstrated technical leadership skills to manage and direct junior level staff with similar capabilities.\n• Relevant professional certifications professional certifications would be advantageous – Cybersecurity certification, CISSP/CISA/CISM/ISO 27001 Lead Auditor, ISO 27001 Lead Implementer, ISO 22301 Lead Implementer, ISO 29001 Privacy.\n• Excellent professional communication and interpersonal skills on both business and technical sides", "extensions": ["14 days ago", "Full–time"], "detected_extensions": {"posted_at": "14 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDeWJlcnNlY3VyaXR5IENvbnN1bHRpbmciLCJjb21wYW55X25hbWUiOiJUaGUgRWRnZSBBc2lhIiwiY29tcGFueV9taWQiOiIvZy8xMWR4cHk4N2trIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoicWpQN0JiTWlKWjhGYTlwSUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFZHcHZOREZQWnpGcE16VXhRMFpFZW10d1VIQm1UVVpYY1dKSlpVOUZkRU14WjNWb2IxSndia1J3TTNwNVlVMXlUVTFGVUhvMFN6QklWM2RUVVc1aldubHlibWc0VFhSQlZrTmZkbFpoTVVseVh6ZDNjVkpOWVVOSVZUSnRablV5TUdvMVFVTmZVWE40VEZSNFRHdExTVU5xTmtWUldtdHJOSEU0U1VKSWRGTlJWa0o0Y214ZlRFeFBUMmd6Wm1nd09GTTNlbGd4VlZGNVp5MUJFaFpRU0hWRFdVc3RUa281VTNOMFVXRXdjVXBVVVVSbkdpSkJUMDFaVW5kRU5sOXhTVXRVV0RKNVJsa3hkRnBaT0doemVWSm5aekZDYzI1biIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzYxIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEdsYXNzZG9vciIsImxpbmsiOiJodHRwczovL3d3dy5nbGFzc2Rvb3Iuc2cvam9iLWxpc3RpbmcvY3liZXJzZWN1cml0eS1jb25zdWx0aW5nLXRoZS1lZGdlLWFzaWEtSlZfSUMzMjM1OTIxX0tPMCwyNF9LRTI1LDM4Lmh0bT9qbD00MDAxMDcwNjA1XHUwMDI2dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Business Operations", "value": "GC06"}, {"text": "Human Resources", "value": "GC15"}, {"text": "Accounting and Finance", "value": "GC01"}, {"text": "Sales and Retail", "value": "GC26"}, {"text": "Protective Services", "value": "GC23"}, {"text": "Science and Engineering", "value": "GC27"}, {"text": "Management", "value": "GC18"}, {"text": "Advertising and Marketing", "value": "GC03"}, {"text": "Legal", "value": "GC17"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Customer Service", "value": "GC10"}, {"text": "Social Services and Non-Profit", "value": "GC28"}, {"text": "Art, Fashion and Design", "value": "GC05"}, {"text": "Healthcare", "value": "GC14"}, {"text": "Energy and Mining", "value": "GC21"}, {"text": "Sports Fitness and Recreation", "value": "GC29"}, {"text": "Education", "value": "GC11"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "Consultant", "value": "consultant"}, {"text": "Senior consultant", "value": "senior consultant"}, {"text": "Security consultant", "value": "security consultant"}, {"text": "Recruitment consultant", "value": "recruitment consultant"}, {"text": "Lead consultant", "value": "lead consultant"}, {"text": "Associate consultant", "value": "associate consultant"}, {"text": "Principal consultant", "value": "principal consultant"}, {"text": "Associate", "value": "associate"}, {"text": "Financial consultant", "value": "financial consultant"}, {"text": "Functional consultant", "value": "functional consultant"}, {"text": "Presales consultant", "value": "presales consultant"}, {"text": "Technical consultant", "value": "technical consultant"}, {"text": "Application consultant", "value": "application consultant"}, {"text": "Devops consultant", "value": "devops consultant"}, {"text": "Pre-sales consultant", "value": "pre-sales consultant"}, {"text": "Consultants", "value": "consultants"}, {"text": "Development consultant", "value": "development consultant"}, {"text": "Engineer", "value": "engineer"}, {"text": "Hr consultant", "value": "hr consultant"}, {"text": "It consultant", "value": "it consultant"}, {"text": "Senior", "value": "senior"}, {"text": "Services consultant", "value": "services consultant"}, {"text": "Solution consultant", "value": "solution consultant"}, {"text": "Solutions consultant", "value": "solutions consultant"}, {"text": "Business", "value": "business"}, {"text": "Business consulting", "value": "business consulting"}, {"text": "Consulting", "value": "consulting"}, {"text": "Director", "value": "director"}, {"text": "Education consultant", "value": "education consultant"}, {"text": "Hcm consultant", "value": "hcm consultant"}, {"text": "Infrastructure", "value": "infrastructure"}, {"text": "Investment consultant", "value": "investment consultant"}, {"text": "Manager", "value": "manager"}, {"text": "Project manager", "value": "project manager"}, {"text": "Recruitment consultants", "value": "recruitment consultants"}, {"text": "Sap consultant", "value": "sap consultant"}, {"text": "Software engineer", "value": "software engineer"}, {"text": "Specialist", "value": "specialist"}, {"text": "Support consultant", "value": "support consultant"}, {"text": "Systems consultant", "value": "systems consultant"}, {"text": "Technology consulting", "value": "technology consulting"}, {"text": "Academy", "value": "academy"}, {"text": "Accountant", "value": "accountant"}, {"text": "Architect", "value": "architect"}, {"text": "Cloud consultant", "value": "cloud consultant"}, {"text": "Consultancy", "value": "consultancy"}, {"text": "Data engineer", "value": "data engineer"}, {"text": "Deputy director", "value": "deputy director"}, {"text": "Electrical engineer", "value": "electrical engineer"}, {"text": "Employee", "value": "employee"}, {"text": "Finance consultant", "value": "finance consultant"}, {"text": "Financial services", "value": "financial services"}, {"text": "Gastroenterologist", "value": "gastroenterologist"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Internship", "value": "INTERN"}, {"text": "Part-time", "value": "PARTTIME"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Accounting", "value": "/business/naics2007/5412"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Engineering Services", "value": "/business/naics2007/5413"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Real Estate", "value": "/business/naics2007/53"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Wholesale", "value": "/business/naics2007/42"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "SingTel", "value": "/m/020zfl"}, {"text": "EY", "value": "/m/0g9jc"}, {"text": "Infosys", "value": "/m/01k8x6"}, {"text": "SearchAsia Consulting Pte Ltd", "value": "/g/11fy260nhz"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "Deloitte SEA", "value": "/g/11f_g4x9d_"}, {"text": "Geco Asia", "value": "/g/11gk72_bt_"}, {"text": "OAKTREE CONSULTING", "value": "/g/11g70jfhtq"}, {"text": "Central Provident Fund Board", "value": "/m/0615qb"}, {"text": "NCS", "value": "/m/0282746"}, {"text": "Trustwave", "value": "/m/0n3xjf5"}, {"text": "Ensign InfoSecurity", "value": "/g/11g4jhymjr"}, {"text": "HCL SINGAPORE PTE. LTD.", "value": "/g/11fy25ngsv"}, {"text": "Horangi", "value": "/g/11fm41wdh3"}, {"text": "LINKBYNET", "value": "/g/11f00s44gb"}, {"text": "NTT", "value": "/m/05mybp8"}, {"text": "RECRUIT EXPRESS PTE LTD", "value": "/g/11g706hzhq"}, {"text": "Randstad", "value": "/m/08pt1z"}, {"text": "Randstad Singapore", "value": "/g/11g70b50mr"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "UBS", "value": "/m/031rxp"}, {"text": "Xcellink Pte Ltd", "value": "/g/11c73prcqy"}, {"text": "Alight", "value": "/g/11fj9r012s"}, {"text": "Avanade", "value": "/m/094456"}, {"text": "Avensys Consulting", "value": "/g/11g7022gjf"}, {"text": "CBRE", "value": "/m/090r7m"}, {"text": "Golder", "value": "/m/02qx9bq"}, {"text": "Hitachi Solutions", "value": "/g/121lyvj9"}, {"text": "IBM", "value": "/m/03sc8"}, {"text": "Marsh & McLennan", "value": "/m/053rw"}, {"text": "Mott MacDonald", "value": "/m/043l4j"}, {"text": "NTT Ltd.", "value": "/m/01c3fq"}, {"text": "Qualtrics", "value": "/m/080nnft"}, {"text": "SAP", "value": "/m/01pf4l"}, {"text": "Techcom Solutions Pte Ltd", "value": "/g/11c73vztx3"}, {"text": "Turner & Townsend", "value": "/m/0cfy6xp"}, {"text": "Thatz", "value": "/g/11dxpx4g1l"}]}]}