{"search_metadata": {"id": "608279bf2c08442d87870763", "status": "Success", "json_endpoint": "https://serpapi.com/searches/6e57ffc3fff3d82a/608279bf2c08442d87870763.json", "created_at": "2021-04-23 07:39:43 UTC", "processed_at": "2021-04-23 07:39:43 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28data+analyst%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=70", "raw_html_file": "https://serpapi.com/searches/6e57ffc3fff3d82a/608279bf2c08442d87870763.html", "total_time_taken": 5.08}, "search_parameters": {"q": "(data analyst) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "70"}, "jobs_results": [{"title": "Technology Consulting Intern | Data & Analytics, Singapore (Ad hoc FY21)", "company_name": "Ernst & Young", "location": "Singapore", "via": "via WIZBII", "description": "Job description\n\nWhat if your career could have a lasting impact on you, and on the world?\n\nHere at EY, you’ll have the chance to build a truly exceptional experience. We’ll empower you with the latest technology, surround you with high-performing teams, and provide the global scale and diverse and inclusive culture you need to discover your full potential. Through our coaching and training programs, you’ll develop the skillsets you need to stay relevant today and in the future – all while building a network of colleagues, mentors, and leaders who will be on the journey with you at EY and beyond.\n\nThe exceptional EY experience. It's yours to build.\n\nThe opportunity: your next adventure awaits\n\nThe Data and Analytics team works collaboratively with our clients to manage engagements and lead teams of data analysis resources in all aspects of design and delivery of information solutions - including Data Quality and Governance, Data Analytics, Business Intelligence, and Data... Management.\n\nData Analytics is integrated into all Consulting service offerings and assists clients to leverage data as an asset throughout its business processes. You'll enjoy working in multi-disciplinary teams and gaining valuable experience in various sectors and play a key role in ensuring high quality outputs and service to our clients.\n\nYour key responsibilities\n\n· Contribute technically to analytics projects and deliver high-quality work products\n· Work effectively as a team member, sharing responsibility, providing support, maintaining communication, and updating senior team members on progress\n· Demonstrate in-depth technical capabilities and professional knowledge. Demonstrate ability to assimilate new knowledge. Possess good business acumen, remain current on new developments in advisory services capabilities.\n· Help prepare reports or proposals that will be delivered to clients and other parties\n\nWhat we look for\n\n· You have an agile, growth-oriented mindset. What you know matters. But the right mindset is just as important in determining success. We’re looking for people who are innovative, can work in an agile way and keep pace with a rapidly changing world.\n· You are curious and purpose driven. We’re looking for people who see opportunities instead of challenges, who ask better questions to seek better answers that build a better working world.\n· You are inclusive. We’re looking for people who seek out and embrace diverse perspectives, who value differences, and team inclusively to build safety and trust.\n· Qualifications:\n· Pursuing a degree in quantitative fields such as Computing, Engineering, Analytics, Statistics, Applied Mathematics, Machine Learning, Operation Research, Information Management or related fields\n· Familiar with machine learning techniques\n· Good understanding of various data structures, common methods and tools used for data transformation\n· Proficiency with analytical programming languages such as Python and/or R, as well as familiarity with SQL\n· Strong attention to details and ability to multi-task\n· Excellent command of written and spoken English\n· Familiarity with cloud technologies, DevOps tools, ETL tools, machine learning frameworks, visualization software, * Unix shell scripting are considered a plus.\n\nWhat’s in it for you\n\n· Accelerate your technical capabilities and transformative leadership skills with future-focused courses and development programs.\n· Broaden your horizons by working on highly integrated teams across the globe and collaborate with people of diverse backgrounds — both professionally and culturally.\n· Bring out the best in yourself with continuous investment in your personal well-being and career development.\n· Develop your own personal purpose and help us create a positive ripple effect on our teams, our business, clients and society – building a better working world, together.\n\nWhat you can expect\n\n· Only shortlisted candidates will be contacted via email for an interview.\n· Shortlisted candidates will have to complete a test within 24 hours from date of receiving email confirmation of the interview appointment.\n\nIf you can demonstrate that you meet the criteria above, apply now.\n\nPlease note that for your application to be considered, you are required to upload the following documents together with your online application:\n\n· Detailed resume\n· Highest academic certification and transcripts\n\nTo learn more about our service offerings, visitWhat you can do here or subscribe toEY Global YouTube Channel\nTo learn more about careers in EYSG, please visitCareers at EY or like us on FacebookEY Careers Singapore", "extensions": ["Over 1 month ago", "Internship"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Internship"}, "job_id": "eyJqb2JfdGl0bGUiOiJUZWNobm9sb2d5IENvbnN1bHRpbmcgSW50ZXJuIHwgRGF0YSBcdTAwMjYgQW5hbHl0aWNzLCBTaW5nYXBvcmUgKEFkIGhvYyBGWTIxKSIsImNvbXBhbnlfbmFtZSI6IkVybnN0IFx1MDAyNiBZb3VuZyIsImNvbXBhbnlfbWlkIjoiL20vMGc5amMiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJ5XzBLbmd5MjNqOWFVWTE3QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUlCQ3FJQlFVNVZYMDV4VTBOUVlWUnRjakYxUzNsRGRUWk1WR2xRWjIweFZHWlFaSEZCTm5KWVZVMVRaRXBzYlVOd01EbDZlakpMWTA5Q1RFbDJkMGxmVjB4bFlVOVBlV1V5VDNsR1owRnJkV1p1Y1hKa2JGcHNXVWcwUzNSM1NFaHJOMGx5V1RSVWVuRmlSM1prTTNoemVVNXVSRFV5Yms5Zk5IVnFZbTR0VGtOT2JteDRWV3h3YVZSaGFGVTRWMlpqVkVSdmFXdGZhamxWZVdsNldGZDFaMDQyTWxabkVoZDRTRzFEV1ZCUVJrVlBObEE1VUhkUWRXOHROM05CTUJvaVFVOU5XVkozUWpCamRVMXBZbmc1UVdNM01GWldOV2R3WVdWMk9VazJaRk53ZHciLCJmY3YiOiIzIiwiZmNfaWQiOiJmY183IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFdJWkJJSSIsImxpbmsiOiJodHRwczovL2VuLndpemJpaS5jb20vY29tcGFueS9lcm5zdC1hbXAteW91bmcvam9iL3RlY2hub2xvZ3ktY29uc3VsdGluZy1pbnRlcm4tZGF0YS1hbmFseXRpY3Mtc2luZ2Fwb3JlLWFkLWhvYy1meTIxP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Head of Data Science and Analytics - Leading Financial Services Company", "company_name": "NLS", "location": "Singapore", "via": "via Laimoon.com", "description": "About the Company Culture:\n• Multicultural, digitally savvy with a focus on Agile\n\nResponsibilities:\n• Responsible for setting enterprise-wide AI strategy, roadmap, process and tools to achieve AI Everywhere along customer journey and insurance value chain\n• Drive the implementation of smart insurance strategic across 10 markets to achieve incremental APE, increase STU and STP, and improve customer experience and distribution productivity.\n• Build Group Office high performance Data Science & Analytics team.\n• Provide thought leadership, subject matter expert's coach to country head of data or analytics.\n• Enable country data science team by strategy design, best practice sharing, necessary training and coach.\n• Requirements:\n• Master or PhD in Statistics, Maths, MBA, or equivalent trade-off in related professional work experience.\n• ~8+ years strong experiences with Customer Analytics, Machine Learning, Data Mining, and Business Intelligence program development and implementation.\n•... ~5 years team management experience.\n• Familiar SAS, SPSS, R, Python, Spark, pylearn2, SQL and MLOps in Azure\n• Excellent communication skills and ability to work closely with business leaders to align with strategic goals.\nTechnology", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJIZWFkIG9mIERhdGEgU2NpZW5jZSBhbmQgQW5hbHl0aWNzIC0gTGVhZGluZyBGaW5hbmNpYWwgU2VydmljZXMgQ29tcGFueSIsImNvbXBhbnlfbmFtZSI6Ik5MUyIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiYlBmX2xMbG9Xcm91S0plaUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMYWltb29uLmNvbSIsImxpbmsiOiJodHRwczovL2pvYnMubGFpbW9vbi5jb20vam9icy9leHRlcm5hbHZpZXcvMjU5ODU4ODM/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "E-commerce Data Analyst", "company_name": "TikTok", "location": "Singapore", "via": "via Bayt.com", "description": "The e-commerce industry has seen tremendous growth in recent years and has become a hotly contested space amongst leading Internet companies, and its future growth cannot be underestimated. With millions of loyal users globally, we believe TikTok is an ideal platform to deliver a brand new and better e-commerce experience to our users. We are looking for passionate and talented people to join our product and operations team, together we can build an e-commerce ecosystem that is innovative, secure and intuitive for our users. 1. Overall responsible for data support of e-commerce overseas operation module;\n2. Daily output and follow up the data output of the whole operation and each module;\n3. Operation core index design, data dashboard design landing, core index data abnormal monitoring;\n4. Data analysis and follow-up of operation activities in overseas countries;\n5. In depth analysis of business, user, commodity and other data, and provide to the operation team to support the... operation strategy;\n6. Follow up the local operation work overseas, support the operation effect and give the follow-up optimization suggestions;\n7. Cooperate with product / operation / R & D, promote the implementation of optimization scheme, and bring about the actual improvement and growth of business;\n8. Responsible for all kinds of a / b experiment design and analysis;\n9. Analysis of the overall overseas market and business operation of a certain country.\n1. Bachelor degree or above, major in mathematics, statistics, computer is preferred; or major in science or engineering or engaged in data statistics, analysis, modeling related working areas after graduation；\n2. Proficient in SQL, can use Python or R for data analysis；\n3. At least 3 years of working Experience in e-commerce business and analysis is preferred；\n4. Overseas business experience or analytical experience is preferred；\n5. Able to write requirement documents in English and communicate with global staff;\n6. Have a strong learning ability and curiosity; quickly familiar with and start new business;\n7. Have a strong ability to work under pressure, have the courage to overcome difficulties and accept challenges", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJFLWNvbW1lcmNlIERhdGEgQW5hbHlzdCIsImNvbXBhbnlfbmFtZSI6IlRpa1RvayIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiaU0tb1pBQTUxcDNuV1hfT0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCYXl0LmNvbSIsImxpbmsiOiJodHRwczovL3d3dy5iYXl0LmNvbS9lbi9zaW5nYXBvcmUvam9icy9lLWNvbW1lcmNlLWRhdGEtYW5hbHlzdC01ODQ4NTU4NS8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Business Intelligence Analyst", "company_name": "None", "location": "Singapore", "via": "via Jobs", "description": "• Strong experience in business analysis and requirements gathering and documentation.• Experience working on digital transformation projects, and with the digital marketing ecosystem.• Good analytical skills • Knowledge of data warehouse modeling and business intelligence concepts & in handling data process via various methods: ETL, Query, SQL. Fluent in coding language is a plus• Certification on any BI tools is preferred (DOMO, Power BI, Tableau & etc)• Interact with diverse group of stakeholders• Fluent in both written and spoken English.• Work directly with business users and stakeholders to understand the business needs and translate business requirements into detailed requirements documentation and able to communicate seamlessly between the business and the back end IT team,• Interacts regularly with senior management level stakeholders to provide periodical project status updates, raise risks and issues encountered in the project.• Coordinate with IT team.• Employ best... practices during requirements gathering and documentation stages", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJCdXNpbmVzcyBJbnRlbGxpZ2VuY2UgQW5hbHlzdCIsImNvbXBhbnlfbmFtZSI6Ik5vbmUiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjJjUjRVYW1udTVTaWxaMkJBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9icyIsImxpbmsiOiJodHRwczovL3NnLmZpZGFudG8uY29tL2pvYnMvam9iLW9wZW5pbmcvYnVzaW5lc3MtaW50ZWxsaWdlbmNlLWFuYWx5c3RzL2J1c2luZXNzLWludGVsbGlnZW5jZS1hbmFseXN0LTI3NTQzNDYxOD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Business Analyst (Risk Management/Treasury)", "company_name": "IoTalents", "location": "Singapore (+1 other)", "via": "via Jobs007", "description": "Description\n• Evaluate business processes, anticipate requirements, and provide compelling and innovative solutions\n• Ensure solutions meet business needs and requirements\n• Stay up-to-date on the latest process and technology to automate and modernize systems\n• Work closely with business, technology and other stakeholders from project initiation, testing to deployment\n• Understand business requirements and translate them into functional specifications\n• Act as a liaison between business and technology users\n\nQualifications\n• Strong Business Domain knowledge and work experience in Market or Liquidity Risk Management\n• Certified Scrum Master or Certified Scrum Product Owner\n• Good experience in Agile development methodologies\n• Experience in agile-related or data analytics or digital initiatives involving technologies such as cloud, API, microservices, blockchain\n• Strong analytical skills with the ability to assimilate information quickly and gain consensus from multiple stakeholders... when required\n• Good oral and written communication skills, including documentation and presentation skills\n• Comfortable communicating across business divisions and levels of seniority", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJCdXNpbmVzcyBBbmFseXN0IChSaXNrIE1hbmFnZW1lbnQvVHJlYXN1cnkpIiwiY29tcGFueV9uYW1lIjoiSW9UYWxlbnRzIiwiY29tcGFueV9taWQiOiIvZy8xMWR4cTE4N3dtIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiUm9lVXU0Yk5ZN0Y4dGZxaUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVJQkNxSUJRVTVWWDA1eFUycFpka001ZW1reWRFaFVSRXhWVlVSZmNHSTNZVmsxTmxrdFVFTm1aV2g2YlVsU09WOTJXVXBRT0V4bVVXZGZRbE5YVEdaaVNWUkhWalJmU0cxUlUzbEpTRUY2VVhSZk1HUnBabWRmT1Vvd1pHWmFaRzVNUldOalZHNUNlVEpUVkZaSGRVVk5iMHhaT1ZwaFVYZFBTMkZRVURaVGVtc3pOV1JKVVZkVWVWTnFOMGhFU0VkRlUwSmlWRWRmUm5STlFrOTZZbk5CU21sTllYWm5FaGQ0U0cxRFdWQlFSa1ZQTmxBNVVIZFFkVzh0TjNOQk1Cb2lRVTlOV1ZKM1FVZFhTRkpETVZkT01YUmZObFYwUTJKcVRIcE1jRFJZYTBKT2R3IiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMjciLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9iczAwNyIsImxpbmsiOiJodHRwczovL2pvYnMwMDcuaW8vam9icy9pb3RhbGVudHMtcHRlLWx0ZC9idXNpbmVzcy1hbmFseXN0LXJpc2stbWFuYWdlbWVudC10cmVhc3VyeV82MTA/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Data Analyst - TeSA", "company_name": "SingTel", "location": "Singapore", "via": "via Monster Singapore", "description": "Job Description :\nSingtel, Asia’s leading communications technology group, provides an extensive range of telecommunications and digital services to millions of consumers and businesses across Asia, Australia, Africa and the USA. With over 140 years of innovation behind us, we continue to push boundaries in our networks and services, to enrich lives and transform businesses.\nOur core values – Customer Focus, Challenger Spirit, Teamwork, Integrity, and Personal Excellence – shape the way we work. We are passionate about making a difference and have an open and inclusive culture where everyone is empowered to do their best. Our diverse business means you will enjoy unique opportunities and rewarding experiences to learn and grow your career in a dynamic industry.\nJoin us and experience what it’s like to be with an Employer of Choice*. Together, let’s create a brighter digital future for all. *Awarded at the HR Fest Awards 2020\nThe role will have to work on the large volume of datasets... with the technical skill on Big Data Platform in data engineering, analytics and using programming or/and tools. The role will have to process the data and work on models to resolve complex business problems. Support business request in data preparation, ad-hoc data query, insight, building data engineering pipeline through system integration, as well as routine Business-As-Usual (BAU) support. He/she possesses a combination of data engineering, data analytical skills as well as experience with algorithms and coding. He/she gets to work with rich and diverse datasets,cutting edge technology, and you get to see the impact of your results in realbusiness and government decisions, which in turn provide positive socialbenefit for consumers at a large scale\nResponsibilities:\n• Develop data flow, data transformation from data resource system into Big Data platform (Hadoop)\n• Support continuous discovery, data transformation and refactoring towards algorithm build, focused demos and refinement\n• Implement data processing application for data cleansing, mapping, transformation, logging\n• Develop Data Integration workflows and load processes.\n• Design, implement proof-of-concept solutions, create and deploy business intelligence using BI tool.\n• Perform data analysis with the large volume of data for reporting and insights\n• Work on Apache Airflow data pipeline and Apache NiFi Data flow management tool.\n• Collaborate with different stakeholders from business, technical, project management and operation to design and implement the solution.\n• Being a team play to work with different team members and co-operate with other cross functional teams.\n• Ability to lead troubleshooting efforts for complex design and eliminate application issue.\n• Contribute to and help define team best practices around report development, testing, access management, and dashboard refresh scheduling.\n• Ensure best practices, frameworks and re-useable components are employed in the development project\n• Understand Information Security standards, methodologies and practices.\n• Trouble-shoot technical problems faced by the project and operation team.\n\nThe Ideal Candidate should have/be:\n• Bachelor degree in Computer Science, Math, Data Analytics or related field with at least 2 years of hands-on development experience\n• Certification in Data Engineering or Business Analytics\n• Hands-on experience in Programming language including Java, Python, SQL, prefer to have experience in Big Data application and Linux shell scripting\n• Experience in ETL, Big Data Management, Metadata Management and Data Cataloguing.\n• Experience in data visualisation including effective communication, appropriate chart types, and best practices.\n• Knowledge of Tableau suite or other visualisation/self-service BI tool to create thoughtful visualisation & visual analytics.\n• Knowledge in Big Data Platform such as Hadoop, Cloudera, Hortonworks, etc\n• Experience in Open Source like Apache Airflow, Apache NiFi, Zeppelin Notebook for Data Exploratory Analysis, etc\n• Basic knowledge in Microsoft software e.g. Excel, Word and Power Points.\n• Comfortable to work with technical and non-technical staff to explain concept and algorithms\n• Good knowledge of the ICT trends, data communication and info-communication technology development\n• Be independent and creative in problem solving\n• Willing to work non-office hours and on 24 x 7 hours standby alert for ad-hoc faults on an occasional basis.\n• Good communication skills\n• Must be self-driven, energetic, highly conceptual and analytical coupled with proven business acumen to engage the businesses (internal) and customers (external) to deliver best results solutions for the businesses.\n• Good writing skills in documentation\n\nWe believe in the strength of a vibrant, diverse and inclusive workforce where backgrounds, perspectives and life experiences of our people help us innovate and create strong connections with our customers. We strive to ensure all our people practices are non-discriminatory and provide a fair, performance-based work culture that is diverse, inclusive and collaborative", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEYXRhIEFuYWx5c3QgLSBUZVNBIiwiY29tcGFueV9uYW1lIjoiU2luZ1RlbCIsImNvbXBhbnlfbWlkIjoiL20vMDIwemZsIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiMGRsSE9iRU1KSU1wZUNXSUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXN3QkNvd0JRVTVWWDA1eFVtWnJTMlkzWVc1MVFqaGhVMWx1VGxsMVNrazJPVVU1WVZOcU1YRkljSFpGTW1aRE1ISllZVlE0ZVVneFYyaEpObk5MU21weWRVczRYMk54T0ZGR00ySmxjRXRSZG0xNlV5MDNjMFU0WkRsdFZGRTVkVzVpVFVkVFIxVnNRV3h2WTBWamJYQkJPVWxJWWpWeE5WUnpObGxzY1VSWE4xVTJVamQxVDNGQk5XWmFNVVpNWVZnU0YzaEliVU5aVUZCR1JVODJVRGxRZDFCMWJ5MDNjMEV3R2lKQlQwMVpVbmRFV0RsaFdWVktiREJRTVROR1NqQkpWMUJoTm5CeFNVTnRkMXBCIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMzUiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTW9uc3RlciBTaW5nYXBvcmUiLCJsaW5rIjoiaHR0cHM6Ly93d3cubW9uc3Rlci5jb20uc2cvYW1wL2pvYi12YWNhbmN5LWRhdGEtYW5hbHlzdC10ZXNhLXNpbmd0ZWwtc2luZ2Fwb3JlLTI3MDkxMzg3Lmh0bWw/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Manager Data Analytics & Model Builder", "company_name": "Direct Search Asia", "location": "Singapore (+1 other)", "via": "via MNC Jobs Malaysia | MNC Jobs In Malaysia", "description": "Direct Search Global is working on one of the most interesting role in the data analytics space. Working with one of the largest oil and gas firm in Malaysia, your will be responsible for developing effective data analytic models to play major role in serving the preparation of company's management report requirement and other related business decision activities. Send your latest CV to us now for shortlist.\nJob Purpose\n• Develop effective model with data analytics capability to play major role in serving the preparation of Company's Management Report requirement and other related business decision activities\n\nPrincipal accountabilities\nModel Builder and Data Analysis\n• Work closely with Management Report Manager in developing & maintaining Group Management Report\n• Develop and maintain Robust financial model that could perform data analysis for group management reporting\n• Develop mechanism to input data from business segments into the new model and ensuring seamless UI.\n• Creates... seamless UX data visualisations to communicate analytic results, including data maps to business and functional leaders.\n• Performs data mining on various data attributes and translate them into actionable decisions and recommendation\n• Evaluates statistical data to identify correlations and discover patterns with full understanding and accurate execution of all statistical models.\n• Engaging with Business Unit and Service Unit in extracting reliable data on periodical basis\n• Identify and understand business drivers & perform data analysis on operational metrics and financial data to understand the movement and variation of financial results by identifying the outliers\n• Building and maintain data analytics that able to automatically detect outliers or abnormal activities outside normal distribution.\n• Develop Dynamic Visualisation of output for Management Report taken from rigorous data analysis model\n• Develop model capability that able to analyse pattern & trend\n• Develop predictive and preventive capability model\n• Develop data analysis on case-to-case basis as according management requirement\n\nLeadership Development\n• Inspire/Coach team members/ peers to develop beyond their current capacity to best support the Group’s business growth and operational needs.\n\nExperience\n• Minimum 6-10 years of relevant working experience.\n• Exposure in managerial capacity/position with working experience in Data Analysis or Management Reporting. Advanced Excel Financial Modelling skill, high interest in IT office & data analytics solution.\n• Experience in system integration between operating systems and SAP is an added advantage.\n\nQualification\n• Bachelor’s Degree in Data Science / Data Analytics or equivalent with academic exposure on accounting / finance / investment / business is an advantage; or\n• Bachelor’s Degree in Actuarial Science / Statistics / Mathematics or equivalent with academic exposure on accounting / finance / investment / business and data analytics / data science are preferred; or\n• Bachelor’s Degree in Finance & Accounting or equivalent with academic exposure on statistics / mathematics and minimal certification data analytics / data science are preferred; or\n• Professional accounting qualification or a postgraduate degree [e.g. CIMA or Chartered Financial Analyst (“CFA”) or MBA] is an added advantage\n• Knowledge / certification on Statistics/ Data Analysis and ERP Financial Solution / SAP especially FICO is highly preferred\n\nIf you feel you fit the criteria and would like to take your career to the next step then please apply via the website or forward your CV to info@directsearch.global", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJNYW5hZ2VyIERhdGEgQW5hbHl0aWNzIFx1MDAyNiBNb2RlbCBCdWlsZGVyIiwiY29tcGFueV9uYW1lIjoiRGlyZWN0IFNlYXJjaCBBc2lhIiwiY29tcGFueV9taWQiOiIvZy8xMWZ5MjYwbmh6IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiNjQ1WFpoVjVDR0RUZ3RDR0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZjQkNyY0JRVTVWWDA1eFVraFhPRlZHYzA4eWFrMXFlRW8wUmpCblltTk1OMVo0YldkUFYxRndaVUV6ZUU0M04xcFdOMlJQTURGelpqbDJTbWhMYmpBd2FVeG9aa2xoVnpSYWFFdGZZeTF2TUVnNWMwTkljVWd3Y1c5SE9UQm5VMWh1TVZoUkxXNVZSMFI2TFhCU1NucERNVWsxYzFaUlIxWkdTa1pUUlZkMk1uSXRPVzE1ZURsaGMyNVZaVUk1VjJnd1MybDNhRFZJUjNCWVNHdFVURzlEWXprMk0zVkhaVkkxTkZaRVRHUlRXVmRmVmtadVgxVmhSVXhaRWhkNFNHMURXVkJRUmtWUE5sQTVVSGRRZFc4dE4zTkJNQm9pUVU5TldWSjNRMHh1ZFdwWlFYZzNPRzFmTW1oelluTjVUR2N6ZEROTlQwcExRUSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzQzIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1OQyBKb2JzIE1hbGF5c2lhIHwgTU5DIEpvYnMgSW4gTWFsYXlzaWEiLCJsaW5rIjoiaHR0cHM6Ly9teS5tbmNqb2J6LmNvbS9qb2JzL21hbmFnZXItZGF0YS1hbmFseXRpY3MtYW1wLW1vZGVsLWJ1aWxkZXItbWFsYXlzaWEtMTI3ODMxP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Analyst - Analytics & Cognitive - SG", "company_name": "Deloitte", "location": "Singapore", "via": "via LinkedIn", "description": "At Deloitte, we offer a unique and exceptional career experience to inspire and empower talents like you to make an impact that matters for our clients Analyst - Analytics & Cognitive - SG\n\nDate: 10-Apr-2021\n\nService Line / Portfolios: Strategy, Growth & Innovation\n\nLocation:\nSingapore, SG\n\nAt Deloitte, we offer a unique and exceptional career experience to inspire and empower talent like you to make an impact that matters for our clients, people and community. Deloitte offers you a highly inclusive, collaborative workplace and unrivalled opportunities to realize your full potential. We are always looking for people with the relentless energy to push themselves further, and to find new avenues and unique ways to reach our shared goals.\n\nWork you will do\n\nThe Analytics & Cognitive team leverages the power of data, analytics, robotics, science and cognitive technologies to uncover hidden relationships from vast troves of data, generate insights, and inform decision-making. Together with... the Strategy practice, our Strategy, Growth & Innovation portfolio helps clients transform their business by architecting organizational intelligence programs and differentiated strategies to win in their chosen markets. This role sits within the Analytics & Cognitive team of Deloitte Southeast Asia, which encompasses data, analytics and cognitive automation.\n\nEnough About Us, Let's Talk About You\n\nIf you are someone with:\n• Strong academic performance in your undergraduate degree from any academic majors preferably Data Analytics, Engineering, Information Technology, Computer Science or Mathematics\n• Team player with effective interpersonal and communication skills, demonstrated leadership and teamwork within or outside a work setting\n• Exceptional problem-solving ability., logical reasoning, creative thinking, comfort with numbers, and the ability to untangle complex issues\n• Understanding of Artificial Intelligence and Machine Learning\n• Understanding of SDLC Waterfall and Agile Development Methodologies\n• Strong analytical skills, excellent oral and written communication skills in English\n• Drive, tenacity, entrepreneurship, client focused and results oriented\n• Proven demonstration of sound business acumen & teamwork, confidence in public speaking and presentation preparation is appreciated\n• Strong passion for consulting, ability to adapt and cope in a fast pace and a sense of humor!\n\nFor our Intelligent Automation practice:\n• Certification with Automation Anywhere, BluePrism, UiPath or WorkFusion will be advantageous.\n• Mastery of one programming language: C, Java, .Net, Python\n\nFor our Data Modernisation & Advanced Analytics practice:\n• A certification with Amazon Web Services (AWS), Google Cloud Platform (GCP) or Microsoft Azure is highly recommended\n• Experience with one or more non-relational data stores such as Pivotal, Cloudera, Hortonworks, MapR, Oracle BDA would be an advantage\n• Experience with one or more relational data stores using SQL, Oracle DB, Microsoft SQL Server, IBM Netezza, Teradata, MySQL or LibreSQL would be an advantage\n• An interest in data ingestion and transformation pipelines using Big Data technologies, including one or more of the following: Spark, Hive, Pig, Kafka, MapReduce, HBase, Sqoop, Flume or Storm\n• General knowledge of Linux/Unix based operating systems and Shell scripting would be an advantage\n• A demonstrated interest for all the latest technologies, libraries & languages. To name a few: ML, NLP, AI, Python, IoT, Blockchain, etc.\n\nNext Steps\n\nSo what are you waiting for? Join the winning team now. You can submit your application here:\n\nDue to volume of applications, we regret only shortlisted candidates will be notified.\n\nRequisition ID: 39482\n\nIn Singapore, the services are provided by Deloitte and other related entities in Singapore(\"Deloitte in Singapore\"), which are affiliates of Deloitte Southeast Asia Ltd. Deloitte Southeast Asia Ltd is a member firm of Deloitte Touche Tohmatsu Limited. Deloitte in Singapore, which is within the Deloitte Network, is the entity that is providing this Website", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBbmFseXN0IC0gQW5hbHl0aWNzIFx1MDAyNiBDb2duaXRpdmUgLSBTRyIsImNvbXBhbnlfbmFtZSI6IkRlbG9pdHRlIiwiY29tcGFueV9taWQiOiIvbS8wMnNwZmQiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJlT0NGamVqRlFidVBZM1pPQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUlCQ3FJQlFVNVZYMDV4VWtSUFdITmhaMWxMVVdkdWRXbDRTbEZMVVhKTVQxZ3lORE5SZEc1aVpIaHZWREpVVTBSeGVTMUpOemR1VnpST1NVUlhiM0V6Y2xWUk9HcHRTM3BTYkhOVE56aDRVR3hIV2pORmRHVkliamt0Y1hWR1RVZElibVJJU1hCc1VXdFNYelpUU1RCT2ExQjZjaTFIWjJST1MyOHRTa3h2VHkxT2NsZDJhV1pJVGpGdE4xQnhjazlWVDI5UmFERkthamhZY21aNFduTXhjbHByUVRGUkVoZDRTRzFEV1ZCUVJrVlBObEE1VUhkUWRXOHROM05CTUJvaVFVOU5XVkozUWxRdFYwdFRRM04zVUdKbk9VVXdNVlJQVG1oSFJteFlTR0ZRUVEiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY181MSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL3NnLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvYW5hbHlzdC1hbmFseXRpY3MtY29nbml0aXZlLXNnLWF0LWRlbG9pdHRlLTI0MDQ4ODIzMjI/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Data Analyst - salary up to - 5000 - Contract", "company_name": "Kelly Services (singapore) Pte. Ltd.", "location": "Singapore", "via": "via Monster Singapore", "description": "Position: Data Analyst\n\n1 year contract\n\nJob Responsibilities:\n\n· Perform analysis of data and trends to proactively deliver insights\n\n· Perform root cause analysis to improve data quality and operational effectiveness\n\n· Clean and prune data for operation purposes or data analysis needs\n\n· Effectively plan and work with relevant stakeholders on data driven research and projects\n\n· Work with operation and data-focused teams to co-develop solutions\n\n· Apply machine learning models for predictive analytics, forecasting and data anomalies detection\n\n· Produce professional reports/ presentations based on insights and analysis\n\nSkills\n\n· Proficient in Python and its relevant packages (Scikit-learn, TensorFlow, Keras, etc.)\n\n· Sound knowledge in Statistics and Machine Learning\n\n· Able to communicate well and understand various stakeholder’s needs\n\n· Good presentation skills\n\n· Knowledge in GUI development in Python is a plus\n\n· Looking at 3-5 years of relevant working experience\n\nHow to... Apply:\nIf you are organized, meticulous, adapt well to changes and more importantly, believe that YOU CAN MAKE A DIFFERENCE, we would like to hear from you.\nSimply submit your application by Clicking the Apply Now button at the bottom of the page.\nFOR IMMEDIATE CONSIDERATION, please indicate the below information in your resume\n\nforward to\n\nPersolkelly Singapore Pte Ltd | EA License No. 01C4394 | RCB No. 200007268E\nEA Registration No. R2093825( Chia Ching Chuing)\nBy submitting your curriculum vitae or personal data to us in connection with your job application, you are deemed to have read and agreed to the terms of our Privacy Policy, and consented to the collection, use and disclosure of your personal data by us and our affiliates (including P-Serv Pte Ltd, PERSOLKELLY Pte Ltd, BTI Executive Search Pte Ltd, PERSOLKELLY Consulting Pte Ltd), in accordance with our Privacy Policy. Please visit www.persolkelly.com.sg for a copy of our Privacy Policy. If you wish to withdraw your consent, please drop us an email to let us know", "extensions": ["14 days ago", "Full–time"], "detected_extensions": {"posted_at": "14 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEYXRhIEFuYWx5c3QgLSBzYWxhcnkgdXAgdG8gLSA1MDAwIC0gQ29udHJhY3QiLCJjb21wYW55X25hbWUiOiJLZWxseSBTZXJ2aWNlcyAoc2luZ2Fwb3JlKSBQdGUuIEx0ZC4iLCJjb21wYW55X21pZCI6Ii9tLzA5bV81Y3EiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJJZkRhVkF6cUJrYUhISnd6QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFcUlDQ3VJQlFVNVZYMDV4VkRBMVQweE9Oa3QwZEhjM2FraFVZMnN4V25kVmJGYzFVelZYTFcxSlZWazRRMDVYWDA5T1pISnBWRWxSVldWR09IUlVOMHBCYldVek5uVklhSEZZVXkxRE4zWlNkbVZ6ZVMxM2RIZG1kMDR4U2pab1dXODBTa1J4UzBjeFNEaDNaMUpOY2pONFRGVlRXalp2YldwRlpIbDJVVGRqTjBoT2VtVkZlbEkxUkU5WE5sWmxPWGRUV21OT1JGaElNMUphTlRNM1prOUJOVjlRY25SdVpWWXhhR0ZKYlZCSlFWcGZka0Z5VjNCcmFVbHBSMmxxWTBGV09UWkxWVTl3U1RoVU0zRkxTbGhFTTBjeU1HbDRZMlJaUVdnNWJVRmhSVWcwT0VFelVSSVhlRWh0UTFsUVVFWkZUelpRT1ZCM1VIVnZMVGR6UVRBYUlrRlBUVmxTZDBGR1ZIcEpOMnBqYUdSMU5qbHFWVTl3TnpkQlVsZEVkWEZqWlVFIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNTgiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTW9uc3RlciBTaW5nYXBvcmUiLCJsaW5rIjoiaHR0cHM6Ly93d3cubW9uc3Rlci5jb20uc2cvYW1wL2pvYi12YWNhbmN5LWRhdGEtYW5hbHlzdC1zYWxhcnktdXAtdG8tNTAwMC1jb250cmFjdC1rZWxseS1zZXJ2aWNlcy1zaW5nYXBvcmUtcHRlLWx0ZC1zaW5nYXBvcmUtMjc2NDU0OTEuaHRtbD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Data Analyst Lead/Manager", "company_name": "Binance", "location": "Singapore", "via": "via Bayt.com", "description": "Binance is the global blockchain company behind the world’s largest digital asset exchange by trading volume and users, serving a greater mission to accelerate cryptocurrency adoption and increase the freedom of money.\n\nAre you looking to be a part of the most influential company in the blockchain industry and contribute to the crypto-currency revolution that is changing the world?\n\nData is at the core of Binance’s mission to serve tens of millions of crypto-currency users. Data Analysts across the company perform impactful analysis to identify trends, and make strategic and important decisions that impact an active and rapidly growing user base.\n\nAbout the Role\n• Leading through example: Overseeing high performing, multidisciplinary members of the Data & Analytics team, you will design and build complex visualisations and analytical models to understand the impact of various market or operational changes to our business\n• You will work closely with the operational and functional... areas to identify, prioritise and deliver on their most pressing and impactful analytical use case; turning complex findings into simple visualisations and recommendations for execution\n• Analyze and interpret large (PB-scale) volumes of transactional, operational and customer data using proprietary and open source data tools, platforms and analytical tool kits\n• Be part of a fast-paced industry and organisation where time to market is critical\n\nAbout you\n• A degree in a quantitative discipline, as Mathematics, Statistics, Actuarial Sciences, Computer Science, Engineering or Life Sciences\n• Minimum 5 - 8 years of industry experience applying advanced analytics\n• Demonstrated experience in the application of analytical techniques to guide operational improvements, scheduling, asset utilisation or investment decisions; and of supervising the work of others, preferably analytics or engineering roles\n• Advanced competency in two or more of the following:Analytical software (e.g. R, SAS);\nData visualisation tools (e.g. Qlikview, Tableau, PowerBI,);\nA relational or graph database management tool (e.g. SQL, NoSQL, Neo4J);\nProgramming. (e.g. VBA, C++, Java, Python);\n• A desire and ability to think abstractly, solve problems and deal with ambiguity\n• Enthusiasm and drive to be a leader in our team, helping shape and develop its future\n• Strong communication, presentation, project management and time management skills", "extensions": ["1 month ago", "Full–time"], "detected_extensions": {"posted_at": "1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEYXRhIEFuYWx5c3QgTGVhZC9NYW5hZ2VyIiwiY29tcGFueV9uYW1lIjoiQmluYW5jZSIsImNvbXBhbnlfbWlkIjoiL2cvMTFoY3oxcjR3bCIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImpRNnpZZGd3ZGVOQlhETGRBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1SUJDcUlCUVU1VlgwNXhWRVJoVldWek5ESXlZV1ZzZW5KSFJFWTJZWGhuZG5ScGJFY3lhMVpaUTBVemEzZ3RXRVUwUzFKRE1pMURSRUZNZG5KQ2R6QmZjRVZTTWpoUFRtRjJZMFpETm01M1EySmpXakpHTjFWaU5FaDRYMVJLUW5GTU9HMVBaRk5YYWpGSVdGWkpYemh3YVV3M1VtMW1hMDlXWWtkU2RqaGZiVXAxUldaNVV6UmFMVXhxUmsxSVdraGxNamx5VW5SQk5FTnRhQzFqVVRWMFVFOUlURE5CRWhkNFNHMURXVkJRUmtWUE5sQTVVSGRRZFc4dE4zTkJNQm9pUVU5TldWSjNRMEZ2VDAxSVltcHBaRGh3T0hsM1p6bEliSGRtV1dJM2VtcFFVUSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzY1IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJheXQuY29tIiwibGluayI6Imh0dHBzOi8vd3d3LmJheXQuY29tL2VuL3NpbmdhcG9yZS9qb2JzL2RhdGEtYW5hbHlzdC1sZWFkLW1hbmFnZXItNTkyMjI4MzEvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Business Operations", "value": "GC06"}, {"text": "Science and Engineering", "value": "GC27"}, {"text": "Management", "value": "GC18"}, {"text": "Accounting and Finance", "value": "GC01"}, {"text": "Advertising and Marketing", "value": "GC03"}, {"text": "Admin and Office", "value": "GC02"}, {"text": "Human Resources", "value": "GC15"}, {"text": "Legal", "value": "GC17"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Sales and Retail", "value": "GC26"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "Data analyst", "value": "data analyst"}, {"text": "Business analyst", "value": "business analyst"}, {"text": "Analyst", "value": "analyst"}, {"text": "Associate", "value": "associate"}, {"text": "Senior", "value": "senior"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Data scientist", "value": "data scientist"}, {"text": "Insights analyst", "value": "insights analyst"}, {"text": "Operations analyst", "value": "operations analyst"}, {"text": "Project manager", "value": "project manager"}, {"text": "Project officer", "value": "project officer"}, {"text": "Administrators", "value": "administrators"}, {"text": "Builder", "value": "builder"}, {"text": "Business", "value": "business"}, {"text": "Cloud consultant", "value": "cloud consultant"}, {"text": "Control analyst", "value": "control analyst"}, {"text": "Data engineer", "value": "data engineer"}, {"text": "Executive", "value": "executive"}, {"text": "Intelligence analyst", "value": "intelligence analyst"}, {"text": "It analyst", "value": "it analyst"}, {"text": "Performance manager", "value": "performance manager"}, {"text": "Product analyst", "value": "product analyst"}, {"text": "Research analyst", "value": "research analyst"}, {"text": "Research assistant", "value": "research assistant"}, {"text": "Senior analyst", "value": "senior analyst"}, {"text": "Senior associate", "value": "senior associate"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Solution architect", "value": "solution architect"}, {"text": "Support analyst", "value": "support analyst"}, {"text": "Systems analyst", "value": "systems analyst"}, {"text": "Technology consulting", "value": "technology consulting"}, {"text": "Unit", "value": "unit"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Internship", "value": "INTERN"}, {"text": "Part-time", "value": "PARTTIME"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Accounting", "value": "/business/naics2007/5412"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Mining", "value": "/business/naics2007/21"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Travel", "value": "/business/naics2007/5615"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "DBS Bank", "value": "/m/01q7n5"}, {"text": "SingTel", "value": "/m/020zfl"}, {"text": "United Overseas Bank", "value": "/m/04gjd1"}, {"text": "Nanyang Technological University", "value": "/m/0l49k"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "Bank of Singapore", "value": "/m/0r3vczm"}, {"text": "Binance", "value": "/g/11hcz1r4wl"}, {"text": "Citi", "value": "/m/01dfb6"}, {"text": "Cognizant Singapore, Cognizant Technology Solutions", "value": "/m/03bf9h"}, {"text": "Dyson", "value": "/m/05cskg"}, {"text": "EPAM Systems", "value": "/m/0dlnrc"}, {"text": "Ernst & Young", "value": "/m/0g9jc"}, {"text": "Goldman Sachs Services Private Limited", "value": "/g/11g9mm5tzn"}, {"text": "GovTech Singapore", "value": "/g/11dxpkfs_6"}, {"text": "PEOPLE PROFILERS", "value": "/g/11dxq43n_6"}, {"text": "PwC Singapore", "value": "/g/11dxpz2lh8"}, {"text": "Sciente International", "value": "/g/11c73gj19n"}, {"text": "AIR LIQUIDE INDUSTRIAL SERVICES PTE LTD", "value": "/g/11hg55y1rb"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Accounting and Corporate Regulatory Authority", "value": "/m/09g7_b3"}, {"text": "Agency for Integrated Care", "value": "/g/11c73jd3yt"}, {"text": "Amazon", "value": "/m/0mgkg"}, {"text": "Amazon Web Services Singapore", "value": "/m/0rznzt1"}, {"text": "BeathChapman Pte Ltd", "value": "/g/11f01b3y2c"}, {"text": "Big Cloud", "value": "/g/11c743lwsr"}, {"text": "Bloomberg", "value": "/m/027sm6"}, {"text": "Burpple", "value": "/g/11dxps5yv5"}, {"text": "CPF Board", "value": "/m/0615qb"}, {"text": "ClearanceJobs", "value": "/g/11fy1pft9v"}, {"text": "Comfort Transportation Pte Ltd", "value": "/g/11f01gw2xt"}, {"text": "Credit Agricole Group", "value": "/m/028vbm"}, {"text": "DYSON OPERATIONS PTE. LTD.", "value": "/g/11fy29mc6g"}, {"text": "Deloitte", "value": "/m/02spfd"}, {"text": "Direct Search Asia", "value": "/g/11fy260nhz"}, {"text": "EngageRocket", "value": "/g/11c73p5x97"}, {"text": "Epson Singapore", "value": "/g/11dxpfq_tf"}, {"text": "Expedia Group", "value": "/m/03gq420"}, {"text": "GLOBALFOUNDRIES Singapore", "value": "/m/05pcrz0"}, {"text": "Goldman Sachs", "value": "/m/01xdn1"}, {"text": "Google", "value": "/m/045c7b"}, {"text": "Government Technology Agency (GovTech)", "value": "/g/11gh0528nq"}, {"text": "Ideallss", "value": "/g/11g70fpjm5"}, {"text": "IoTalents", "value": "/g/11dxq187wm"}, {"text": "JAC Recruitment", "value": "/g/121g71_s"}]}]}