{"search_metadata": {"id": "60827e2e224db156e95da53f", "status": "Success", "json_endpoint": "https://serpapi.com/searches/e6d10e92b51786f7/60827e2e224db156e95da53f.json", "created_at": "2021-04-23 07:58:38 UTC", "processed_at": "2021-04-23 07:58:38 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28data+scientist%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=0", "raw_html_file": "https://serpapi.com/searches/e6d10e92b51786f7/60827e2e224db156e95da53f.html", "total_time_taken": 1.97}, "search_parameters": {"q": "(data scientist) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "0"}, "jobs_results": [{"title": "Senior Data Scientist", "company_name": "SEPPIC", "location": "Singapore", "via": "via Jobs", "description": "Company presentation ALBS is an Air Liquide entity in Kuala Lumpur, regrouping for the APAC scope its Business Service Centers (Kuala Lumpur and Shanghai) as well as the two Global Functions (IT, Digital and Procurement).Designed to derive optimal value by better leveraging technology, people and competencies, the ultimate goal is to boost efficiency and deliver outstanding and sustainable performance while keeping a strong focus on customer centricity.This Organization is striving for excellence, adopting the Best in Class models to deliver value through simplification and standardization of processes, while adhering to Internal controls and compliance requirements. Entity and activity description Senior Data Scientist oversees the activities of the junior data scientists and provides advanced expertise on statistical and mathematical concepts for the broader Data and Analytics department. The Senior Data Scientist applies and inspires the adoption of advanced data science and... analytics across the business.To lead data science projects for the APAC digital team, integrate into the Air Liquide Data Science community and enrich this area of the Digital business. Missions and Responsibilities We are looking for a Senior Data Scientist who will support our business with insights gained from analyzing company data. The ideal candidate is adept at using large data sets to find opportunities for business optimization and using models to test the effectiveness of different courses of action. They must have strong experience using a variety of data mining/data analysis methods, using a variety of data tools, building and implementing models, using/creating algorithms and creating/running simulations. They must have a proven ability to drive business results with their data-based insights. They must be comfortable working with a wide range of stakeholders and functional teams. The right candidate will have a passion for discovering solutions hidden in large data sets and working with stakeholders to improve business outcomes. Competencies and Profile MSc or BSc graduate in Statistics, Mathematics or Computer Science 5 - 7 years of relevant work experience in data science field Strong problem solving skills with an emphasis on product development. Experience using statistical computer languages (R, Python, SLQ, etc.) to manipulate data and draw insights from large data sets. Experience working with and creating data architectures. Knowledge of a variety of machine learning techniques (clustering, decision tree learning, artificial neural networks, etc.) and their real-world advantages/drawbacks. Knowledge of advanced statistical techniques and concepts (regression, properties of distributions, statistical tests and proper usage, etc.) and experience with applications. Excellent written and verbal communication skills for coordinating across teams. A drive to learn and master new technologies and techniques. Experience visualizing/presenting data for stakeholders. Ability to work as part of a distributed team. Ability to utilize and lead interns on projects. Specific Training or Certification; Data Science, R or Python", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgRGF0YSBTY2llbnRpc3QiLCJjb21wYW55X25hbWUiOiJTRVBQSUMiLCJjb21wYW55X21pZCI6Ii9tLzBnNTU4d3ciLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJnamVpbm50ZWwzczdJV2dTQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFc3NCQ293QlFVNVZYMDV4VWtSVFlVVnNUamQwUzBoTFQwMWhTV053T0ZwMldHdEZRbFJWT1RKWFRUbFJjazFGT1dwell6VTBjVVpoTUVaUGFUVTBkWGh6TkVrelJFSk5ibmRhVkdGYVlWWmhTMjl4YWpKRmJVUkdTVVJPYW5WeVFrZGZjM0I0WjNOdVExaExUMkpHUVZaMFEwcFBhR1F4ZEc1ZlNFTlZOR1puYkhWaWNIVk1PVkJ2ZWpGd1UyMDBjeklTRmt4dU5rTlpUa2RhVFhSSVVTMW5WSFZyTmxBMFFrRWFJa0ZQVFZsU2QwRllhM0UxUzE5elpEbExWbTF5WDNsTlgweFFTa0pVWjFOa2FrRSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzciLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9icyIsImxpbmsiOiJodHRwczovL3NnLmZpZGFudG8uY29tL2pvYnMvam9iLW9wZW5pbmcvZGF0YS13YXJlaG91c2luZy1zcGVjaWFsaXN0cy9zZW5pb3ItZGF0YS1zY2llbnRpc3QtMjc3ODUxNDk3P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Data Scientist - Singapore", "company_name": "FieldBox.ai", "location": "Singapore (+1 other)", "via": "via Welcome To The Jungle", "description": "JOB DESCRIPTIONAs part of the Data Science team, you work closely collaboration with the project and engineering teams to move the data projects of our customers forward and contribute to the evolution of the product.As such, you have a particular interest in one of the following areas:Data engineering,\nMachine learning engineering,\nPredictive modeling,\nData visualisation.\nOn a daily basis, your missions can be:Transform customer issues into relevant data science issues, formulate the question that needs an answer,\nIdentify and extract the data needed to solve the problem,\nPerform in-depth analysis of datasets of all sizes,\nBuild training datasets and validation,\nCreate predictive models, put them in production and manage their life cycle,\nSet up visualizations of the results obtained,\nContribute to the reflection on the evolution of the product,\nSet up exploratory prototypes,\nContribute to the implementation of a robust, efficient and easy to use tool set,\nContribute to the... scientific influence of society through participation in conferences, colloquia, or publications", "extensions": ["25 days ago", "Full–time"], "detected_extensions": {"posted_at": "25 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEYXRhIFNjaWVudGlzdCAtIFNpbmdhcG9yZSIsImNvbXBhbnlfbmFtZSI6IkZpZWxkQm94LmFpIiwiY29tcGFueV9taWQiOiIvZy8xcHR5dzg5dnIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJZU2JpQ0Itc3h3a0Exdnd2QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VWxKSWQwMUdTamxvVUVaRWNUWkhWbkUwUTFFME1tTnRRak5VYjNCbGJuTnhjVnBrUzNaSmRtMWhZVzk2T1RCRldWYzNSRUZ6ZFhkdVowazJjRWhxWTFBNGJWOUlla0ZzUWxkWlFubENaM2t0Ym1kMWFsOHpMVGhGZUc1elNuQlBkVGx3Y21KeGNUZEZTMEZXT1VoaVYwaHRja2h0ZEdKUWNIaHpXRU5JYm1SV01Ga3dUMjA0U0dKRGJtUm9hRXhITFdscFRVRm5iRFJtZVhsUkVoWk1ialpEV1U1SFdrMTBTRkV0WjFSMWF6WlFORUpCR2lKQlQwMVpVbmRDWm1OSGRtdEdOMFJKYmpad1F6WnpjbFZ5VmxwUk5uVXdkMWhuIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMTUiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gV2VsY29tZSBUbyBUaGUgSnVuZ2xlIiwibGluayI6Imh0dHBzOi8vd3d3LndlbGNvbWV0b3RoZWp1bmdsZS5jb20vZW4vY29tcGFuaWVzL2ZpZWxkYm94LWFpL2pvYnMvZGF0YS1zY2llbnRpc3Qtc2luZ2Fwb3Jfc2luZ2Fwb3JlP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Data Analyst / Data Scientist", "company_name": "Product Dynamix", "location": "Singapore", "via": "via LinkedIn", "description": "Product Dynamix is a strategic product management consultancy providing a holistic approach across the product management lifecycle with a focus on start-ups and growth-stage companies. We act as a catalyst to place the Product strategy mindset at the heart of the customer’s digital business. We offer in-house delivery, consultancy and training for the startup ecosystem and corporations. Our team creates digital companies, products and features to meet business ambitions.\n\nThis position is for one of our customer based in Singapore\n\nJob Description\n\nDefining new opportunities for product impact Influencing product and sales to solve the most impactful market problems.\n\nApply your expertise in quantitative analysis and the presentation of data to see beyond the numbers and understand how our users interact with our products.\n\nWork as a key member of the product team to solve problems and identify trends and opportunities.\n\nInform, influence, support and execute our product decisions... and product launches.\n\nSet KPIs and goals, design and evaluate experiments, monitor key product metrics, understand root causes of changes in metrics.\n\nExploratory analysis to discover new opportunities: understanding ecosystems, user behaviours, and long-term trends Identifying levers to help move key metrics.\n\nResponsibilities\n\nProduct Strategy: Evaluate and define product and business KPIs and metrics along with Product Managers and Product Designers.\n\nData Visualization: Democratize data by building customized dashboards & reports for relevant stakeholders.\n\nAnalysis: Offer deep-dive analysis to key stakeholders across all teams and products, to determine product features and UX optimization strategies.\n\nRespond to data and product-related inquiries in real-time to support business and technical teams.\n\nProvide data solutions, tools, and capabilities to enable self-service frameworks for data consumers.\n\nResponsible for developing and executing tools to monitor and report on data quality.\n\nResponsible for establishing appreciation and adherence to the principles of data quality management, including metadata, lineage, and business definitions. Build Machine Learning models to predict the behaviour of users\n\nRequired Qualifications\n\nOverall, 5 years of experience with at least 1 year of experience specifically in Product Analytics, preferably in e-commerce\n\nYou've master’s degree in Business Analytics, statistics, mathematics, economics, computer science or equivalent education or possess relevant practical experience\n• Strong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracy\n• Strong knowledge of and experience with reporting packages (Business Objects etc), databases (SQL etc), programming (Python,R & ETL frameworks)\n\nA/B Testing: Experience designing experiments and analyzing results with a solid background in statistics\n\nTracking Technologies: Google Analytics (Preferably IQ certified) or similar alternatives e.g. Adobe Analytics, Mixpanel, Amplitude\n\nShould understand Machine Learning Algorithms\n\nExcellent attention to detail can-do attitude with a relentless focus to get things done. Data needs to be precise. Conclusions drawn from data analysis will drive critical client decisions.\n\nDemonstrated analytical skills. Ability to work with large amounts of data: facts, figures, and number crunching. Ability to see through the data and analyze it to find conclusions.\n\nNote : ONLY for CITIZENS and PR", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEYXRhIEFuYWx5c3QgLyBEYXRhIFNjaWVudGlzdCIsImNvbXBhbnlfbmFtZSI6IlByb2R1Y3QgRHluYW1peCIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiclgwSjlHWlZGVjY0OVN4aUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL3NnLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvZGF0YS1hbmFseXN0LWRhdGEtc2NpZW50aXN0LWF0LXByb2R1Y3QtZHluYW1peC0yNTExOTY3OTYyP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "VP/AVP, Specialist, Data Scientist", "company_name": "DBS Bank Limited", "location": "Singapore", "via": "via Laimoon.com", "description": "Business Function\nHere at the DBS Transformation Group, we focus on nurturing the culture of the \"World's Best Digital Bank\" (Euromoney, 2016 & 2018) and Best Bank in the World (Euromoney 2019). Our approach is a combination of both science and art; we immerse our stakeholders in the world of design thinking and experimentation, drive rigorous creativity along our pipeline, and build connections between corporate entrepreneurs and start-ups. We are a cross-disciplinary team focused on the invention of solutions that will radically improve the way people live, work and play. We are passionate and committed to making banking joyful (while having lots of fun)!\n\nResponsibilities\nThe Analytic Center of Excellence is established as the central team to develop the machine learning practice for DBS group. The data scientist/machine learning engineer in Analytic Center of Excellence will have opportunities to work on huge varieties of problems across sales and marketing, customer management... revenue optimization, risk prevention, operation efficiency, network monitoring, AML and many more other areas.\nWe work with business to implement high performance advanced analytics solutions using python/Spark/R. The successful candidate will lead the efforts to propose advanced analytics to drive business value, including:\n• Understand the business domain and relevant dataset\n• Provide end-to-end advanced solutions to design, develop and deploy to production system\n• Build the CICD practice to manage models regarding quick experiments and feedback loop\n• Communicate/Interpret analytics result and machine learning model details with business and stakeholders\n• Lead junior staff, help them learn and grow\n\nRequirements:\n• VP: 10+ years industry/finance working experience (5+ years' experience for PhD); AVP: 7+ years industry/finance working experience (3+ years' experience for PhD),\n• Direct banking experience with front business will be a plus;\n• The candidate must have excellent problem solving and advanced analytic skills.\n• Excellent programming skills in Python, Spark and R and familiar with software development methodology.\n• Familiar with machine learning framework and different tasks performed during the modelling process. In-depth understanding of data processing, wrangling and feature engineering techniques.\n• Proficiency with code management tools such Git/Bitbucket and willing to take up other software development tools such as Jira and confluence.\n• Have developed and implemented industry machine learning solution for classification, prediction, forecasting and anomality detection problems.\n• Eager to learn and get hands dirty with new technology.\n\nPreferred requirements:\n• Experience building large scale distributed machine learning solutions\n• Experience building robust & high-throughout API for analytics-as-a-service solutions\n• Familiar with NLP/Graph Mining/Deep Learning\n• CFA/CPA/FRM certificate will be a plus\n\nApply Now​\nWe offer a competitive salary and benefits package and the professional advantages of a dynamic environment that supports your development and recognises your achievements.​ Technology", "extensions": ["8 hours ago", "Full–time"], "detected_extensions": {"posted_at": "8 hours ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJWUC9BVlAsIFNwZWNpYWxpc3QsIERhdGEgU2NpZW50aXN0IiwiY29tcGFueV9uYW1lIjoiREJTIEJhbmsgTGltaXRlZCIsImNvbXBhbnlfbWlkIjoiL20vMDFxN241IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiRllhRVV5ZDV5WUEyalpRVkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZZQkNyY0JRVTVWWDA1eFUzVmFTM04xTUdVNE9FSldWRE5CTURGNVVVWmpUa2hxTmpWalZXcGpWRlZJVW5wZk5sbDBkWGhpUVVwa2JYaFVlbUV6ZW1VM1JFc3lOekUwVmtkMWEwNTRlVGs0VEdGa2FrUnpZWEJKU0hWek5HeEtlbXN4WDBwNVMwcFZObkJQWW1wNVJGUkpVVE13VkdSSFlXUnNjMHBIWDJJeWNWWTJNMjFKU0VOVGNUWm5NVzVHV2pSaVQwODBRbGN0VjFrdE5WOVhkbEY2YkhnNU5FcFRjMDVZV1ZOdE1YcGpZVlZSVmpCM1lVaFFURzFWRWhaTWJqWkRXVTVIV2sxMFNGRXRaMVIxYXpaUU5FSkJHaUpCVDAxWlVuZENaSFJEY0dVdFdYSldSbEZPYm1NdFRHSjFWSFpFVkhOTE0zSlIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18yNyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMYWltb29uLmNvbSIsImxpbmsiOiJodHRwczovL2pvYnMubGFpbW9vbi5jb20vam9icy9leHRlcm5hbHZpZXcvMjYxMzk5NDk/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Data Science Customer Success , APAC", "company_name": "SPARKBEYOND PTE. LTD.", "location": "Singapore", "via": "via Learn4Good", "description": "Position: Data Science Customer Success Owner, APAC\nRoles &\n\nResponsibilities\n\nOur Team’s mission statement:\n\nWe are on a mission to harness the collective intelligence of humanity to solve the world's most impactful problems. We created an AI-powered problem-solving engine capable of coming up with creative ideas, hypotheses and solutions for a broad range of problem domains and industries, thus enabling social and business impact – worldwide.\n\nOur product is used by Data Scientists and Management Consultants in many of the largest and most prestigious companies in the world. Ensuring that they are empowered to use it to solve their problems efficiently and that they are not held back by knowledge gaps is crucial for our business\n\nWhat will you do? Own the customer success space in APAC Shape the tools and materials needed to onboard new customers and ensure their success Work with our global teams on adapting existing training and certification materials for our market Partner with... our Data Scientist on how to shape analytics problems to be best suited for our platform Understand & collect the users’ needs of the product & develop the voice of the user within the company What will you need?\n\nThe following is what is a data scientist is expected to bring to the table - if you lack some of the background but still believe that you’re the right fit for the role, let us know why Relevant work experience in data science - no specific length, but you must have experienced the difference between a real world analytics problem and an academic / kaggle exercise A knack for teaching, mentoring and speaking.\n\nUpskilling our users through demonstrations, documentation or dialogue must be something you thrive in University degree in a quantitative field - higher degrees are welcome\n\nExperience with Machine Learning techniques (classification, regressions, feature engineering etc.) Programming experience in a data-related language - ideally Python, but R & SQL are welcome, too Exposure to other advanced analytics software (e.g., Alteryx, Rapid\n\nMiner, Dataiku) is welcome but not essential What will you learn? How Data Science gets applied in the real world to drive business & social impact Expand your knowledge in the cutting-edge of applied AI technology Much more! What do we offer? Autonomous, open environment with smart and inspiring colleagues who support your ideas and growth Opportunity to enhance your skill sets & creativity on cutting edge AI products that will have a genuine impact on our clients Opportunity to work across various Industries and Domains and across different regions An environment where your needs are taken seriously - whether it is with regards to working from home, child care leave, budget for training, and more.\n\nTell employers what skills you have\n\nAnalytics\n\nClient\n\nEducation\n\nClient Engagement\n\nConsulting\n\nData Science\n\nMachine Learning\n\nOnboarding\n\nPython\n\nRSQLTraining\n\nAIAnalytical thinking", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEYXRhIFNjaWVuY2UgQ3VzdG9tZXIgU3VjY2VzcyAsIEFQQUMiLCJjb21wYW55X25hbWUiOiJTUEFSS0JFWU9ORCBQVEUuIExURC4iLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IlB6VFJoSWtsNmpHd09DaVJBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGVhcm40R29vZCIsImxpbmsiOiJodHRwczovL3d3dy5sZWFybjRnb29kLmNvbS9qb2JzL3NpbmdhcG9yZS9pbmZvX3RlY2hub2xvZ3kvMjcxMjkxMzgxL2UvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Senior Data Analyst", "company_name": "Burpple", "location": "Singapore", "via": "via NodeFlair", "description": "Burpple is seeking a Data Scientist. We are looking for a passionate certified Data Analyst. The successful candidate will turn data into information, information into insight and insight into business decisions. The job is to be the\"data eyes and ears\" guiding the product team.\n\nThe Role Objective\n• Defining new opportunities for product impact Influencing product and sales to solve the most impactful market problems.\n• Apply your expertise in quantitative analysis and the presentation of data to see beyond the numbers and understand how our users interact with our products.\n• Work as a key member of the product team to solve problems and identify trends and opportunities.\n• Inform, influence, support, and execute our product decisions and product launches.\n• Set KPIs and goals, design and evaluate experiments, monitor key product metrics, understand root causes of changes in metrics.\n• Exploratory analysis to discover new opportunities: understanding ecosystems, user behaviours, and... long-term trends Identifying levers to help move key metrics.\n\nResponsibilities\n• Product Strategy : Evaluate and define product and business KPIs and metrics along with Product Managers and Product Designers.\n• Data Visualization: Democratize data by building customized dashboards & reports for relevant stakeholders.\n• Analysis: Offer deep dive analysis to key stakeholders across all teams and products, in order to determine product features and UX optimization strategies.\n• Respond to data and product related inquiries in real-time to support business and technical teams\n• Provide data solutions, tools, and capabilities to enable self-service frameworks for data consumers\n• Responsible for developing and executing tools to monitor and report on data quality\n• Responsible for establishing appreciation and adherence to the principles of data quality management, including metadata, lineage, and business definitions\n• Build Machine Learning models to predict behaviour of users\n\nRequired Qualifications\n• Overall, 5 years of experience with at least 1 year of experience specifically in Product Analytics, preferably in e-commerce\n• You've master’s degree in Business Analytics, statistics, mathematics, economics, computer science or an equivalent education or possess relevant practical experience\n• Strong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracy\n• Strong knowledge of and experience with reporting packages (Business Objects etc), databases (SQL etc), programming (Python,R & ETL frameworks)\n• A/B Testing: Experience designing experiments and analyzing results with a solid background in statistics\n• Tracking Technologies: Google Analytics (Preferably IQ certified) or similar alternatives e.g. Adobe Analytics, Mixpanel, Amplitude\n• Should understand Machine Learning Algorithms\n• Excellent attention to detail can-do attitude with a relentless focus to get things done. Data needs to be precise. Conclusions drawn from data analysis will drive critical client decisions.\n• Demonstrated analytical skills. Ability to work with large amounts of data: facts, figures, and number crunching. Ability to see through the data and analyze it to find conclusions", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgRGF0YSBBbmFseXN0IiwiY29tcGFueV9uYW1lIjoiQnVycHBsZSIsImNvbXBhbnlfbWlkIjoiL2cvMTFkeHBzNXl2NSIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Im1DcDYweW0tZWhiUmtDLUFBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhVMGg1VlZSMlFrNU1ja0Z2V2tkSVlYTk1ZbEZpTVY5emQyaEJhRGN6WW5CWVRFMUZiRXBqZHpGd2RqQlhUak5rVEZoTFJ6Rk5kVjl2WXpWWlZFSmlORFJFYWpWRWRXRlhTalpFYlZVMFRrbExka05WUW5GV1NEVjNaWGhZYzJwQk1GcE5TbVY0VDBadmFqVk9jMHgzVVZKTWNUa3dkREV0WVU5NE9XTm5SRGRtTVd0eFpEWmthbkUyWkhabmFFUkRObmN4YlVwb2VuWTBPRzlSRWhaTWJqWkRXVTVIV2sxMFNGRXRaMVIxYXpaUU5FSkJHaUpCVDAxWlVuZEVabGh3WVZRMFdGODJYM3BrWkV0MVEyZEdiRVJGVGsxdFdYZFIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18zNyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBOb2RlRmxhaXIiLCJsaW5rIjoiaHR0cHM6Ly9ub2RlZmxhaXIuY29tL2pvYnMvbGlzdGluZ3MvMTI3OTE/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Data Scientist", "company_name": "Neuroglee Therapeutics", "location": "Singapore", "via": "via Workable For Job Seekers", "description": "Neuroglee is a venture-backed digital health startup that is on a mission of reimagining care for patients living with neurodegenerative diseases. By combining best-in-class cognitive rehabilitation strategies and digital biomarkers, we build evidence-based precision digital therapeutics for neurodegenerative diseases. Our lead investigational product, NG-001 is intended for the symptomatic treatment of Alzheimer's disease/MCI. For more information, please visit www.neuroglee.com.\n\nWe are looking for an excellent Data Scientist for our team. He would be responsible for handling the development of an AI analytics engine for our product (Mobile/Tablet – platform) and needs to work closely with Data Engineers, Neuro-scientists, and cross-technology teams. He would be contributing to the development of our digital therapeutics product NG-001.\n• Design, implement, and maintain the State-of-Art algorithms and create an AI analytics engine.\n• Help in writing patents/research papers on the... developed algorithms.\n• Work closely with Data Engineers and evaluate the whole architecture to ensure the functionality & quality of the AI analytics engine\n• Document the application code scripts, including, drafts, revisions, and final directions.\n\nOur Ideal Candidate\n• Bachelors, Masters, or Ph.D. in Computer Science, or related fields.\n• 4+ years of prior experience as a Data Scientist or in similar roles.\n• Solid experience with one or more languages - C/C++, Python, and frameworks like Django or Flask.\n• In-depth knowledge of statistics, machine learning, and deep learning with one or more of its frameworks like Tensorflow, Pytorch, Caffe or Mxnet, and libraries.\n• Proven experience in Computer Vision or Natural Language Processing projects.\n• Exposure to CUDA programming and GPU technology\n• Expert knowledge of data structures, data modelling, and software architecture.\n• Experience with cloud infrastructure like AWS, GCP, Azure.\n• Solid understanding of relational databases (e.g., MSSQL, MySQL) and experience in NoSQL (e.g., GraphDB, MongoDB).\n• Familiar with Big Data Technologies.\n• Published research articles or written technical blogs on Deep learning\n• Quickly picks up new technologies and passionate about solving problems.\n• Experience supporting and working with cross-functional teams in a dynamic environment.\n• Ability to work independently.\n• Proven experience and knowledge of working in an Agile approach and SDLC.\n• Experience with CI/CD and tools like Git, Mercurial, Jenkins.\n\nWays to Outstand from Crowd\n• Rank holder in Kaggle competitions or having an active GitHub account with shareable contributions.\n• Prior experience in the biotechnology, bioinformatics, or healthcare industry, especially the Neuroscience field.\n• Experience with containers like Dockers and Kubernetes.\n• Experience with real-time/static streaming data pipelines such as Kafka.\n• AWS Certified Solution Architect or AWS Certified Machine Learning.\n• Excellent verbal and written communication in the English language.\n• Experience with Jira/Confluence.\n\nWe strive to make your life outside work as smooth as possible while you are at work, and we offer a long list of benefits to make that happen.\n• Competitive salary and AWS\n• Generous annual leave policy\n• Coverage for medical, dental, and vision\n• Stocked kitchen\n• A supportive, collaborative group of people who understand that success depends on the team\n\nNeuroglee Therapeutics is an equal opportunity employer and will not discriminate against any employee or applicant on the basis of age, color, disability, gender, national origin, race, religion, sexual orientation, veteran status, or any other classification protected by federal, state, or local law", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEYXRhIFNjaWVudGlzdCIsImNvbXBhbnlfbmFtZSI6Ik5ldXJvZ2xlZSBUaGVyYXBldXRpY3MiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Ik8zSDZGRVRUUDRZby1kbGtBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gV29ya2FibGUgRm9yIEpvYiBTZWVrZXJzIiwibGluayI6Imh0dHBzOi8vYXBwbHkud29ya2FibGUuY29tL25ldXJvZ2xlZS10aGVyYXBldXRpY3Mvai9EOEZBOTg0MTE0Lz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "#sgunitedjobs Data Scientist", "company_name": "BIGTAPP PTE. LTD.", "location": "Singapore", "via": "via MNC Jobs Singapore | MNC Jobs In Singapore", "description": "Roles & Responsibilities\n• Full stack Data Scientist to handle end to end requirements of Business Analysis, Data Engineering and Data Science.\n• Successfully achieve business goals of BigTapp and its customers using optimal mix of data engineering and data science skills.\n• Responsible for managing the development, validation and delivery of algorithms, statistical models and business analysis\n• Performs analyses of structured and unstructured data to solve multiple and/or complex business problems utilizing advanced statistical techniques and mathematical analyses and broad knowledge of the organization and/or industry.\n• Build insights using Visualization tools like Tableau to support achieving desired business results.\n• Provide thought-leadership and dependable execution on diverse projects.\n• Identify emergent trends and opportunities for future client growth and development\n• Conduct research and develop Proof of Concept (PoC) prototypes\n\nEducation and Experience... Requirement\n\nMust have:\n• 4 to 5 years’ experience in data sciences and data engineering (data analyst). Proven experience in:\n• Developing actionable insights and recommendations for business leaders.\n• Presenting results and recommendations to non-technical business audience to drive the decision-making process.\n• Masters or Phd in Data Science or related disciplines.\n• Skills in Machine Learning, Deep Learning.\n• Experience in techniques like Markov Models.\n• Proficiency with open source analytical tools and one or more of Data Science Platforms (AWS Sagemaker/ Azure ML/ H2O.AI etc).\n• Proficiency (certification preferred) in Tableau or Qlik or PowerBI.\n• Subject Matter Expertise in effective machine learning tools and technologies including Tensorflow, Spark / Spark MLib, Flink, Mahout or any packaged cognitive solutions\n• Database programming in SQL and ETL tools like Informatica.\n• Proficiency with software development technologies (e.g. Python, Java)\n• Excellent critical thinking skills, combined with the ability to present your beliefs clearly and compellingly verbally and in written form.\n• Experience and familiarity with common business use cases of analytics.\n\nGood To Have:\n• Experience with big data tools (e.g., Hadoop, HDFS, Cassandra, Storm)\n• Programming in NOSQL environments.\n• Expertise in unstructured analytics: NLP, Computer Vision and Audio Analytics.\n• Expertise in web scraping", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiIjc2d1bml0ZWRqb2JzIERhdGEgU2NpZW50aXN0IiwiY29tcGFueV9uYW1lIjoiQklHVEFQUCBQVEUuIExURC4iLCJjb21wYW55X21pZCI6Ii9nLzExZHhwc2c1bm4iLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiI4Vm05b19wTVRYbWVtZU1hQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdllCQ3JjQlFVNVZYMDV4VVRkUGFHSnBTamsyY1d4clZGbFZOa3BJWjI5NFdubFBjVmhyUjJZdGFIUlZOekJxZWtSd1lXcG9TMkpGVFZVNWJqTnJRVEZETUVFelNrWlVSRmxVU2xGVk5GRm1kVkJwUlVWTmJXa3hSa3R4TUdwdFpFcG5Wa1ZyU0VoblQyRmpUMWxITFdwU2RIWmFja28wYjNSNWRDMVZiRmxMVEZkelJ6ZEZZVjlNYkZWVVluUjJRbWRrY0d4cGNrVkRlSE54TVZRellUVjJkVzltWVZrNFRUZHlkbXhGVUhWaFRHNVpSekl6WkdjeWJteHZFaFpNYmpaRFdVNUhXazEwU0ZFdFoxUjFhelpRTkVKQkdpSkJUMDFaVW5kRVgxSndVM1pqZVVsYVQwOUxYM1ZOWTNCMlV6bDBlWGt3VkVsMyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzUwIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1OQyBKb2JzIFNpbmdhcG9yZSB8IE1OQyBKb2JzIEluIFNpbmdhcG9yZSIsImxpbmsiOiJodHRwczovL3NnLm1uY2pvYnouY29tL2pvYnMvc2d1bml0ZWRqb2JzLWRhdGEtc2NpZW50aXN0LXNpbmdhcG9yZS0yMzQ4NjE/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Senior Data Scientist", "company_name": "None", "location": "Singapore", "via": "via Singapore", "description": "MissionsWe are looking for a Senior Data Scientist who will support our business with insights gained from analyzing company data. The ideal candidate is adept at using large data sets to find opportunities for business optimization and using models to test the effectiveness of different courses of action. They must have strong experience using a variety of data mining/data analysis methods, using a variety of data tools, building and implementing models, using/creating algorithms and creating/running simulations. They must have a proven ability to drive business results with their data-based insights. They must be comfortable working with a wide range of stakeholders and functional teams. The right candidate will have a passion for discovering solutions hidden in large data sets and working with stakeholders to improve business outcomes.Competencies and Profile Master or Bachelor Degree graduate in Statistics, Mathematics or Computer Science 5 - 7 years of relevant work experience in... data science field Strong problem solving skills with an emphasis on product development. Experience using statistical computer languages (R, Python, SLQ, etc.) to manipulate data and draw insights from large data sets. Experience working with and creating data architectures. Knowledge of a variety of machine learning techniques (clustering, decision tree learning, artificial neural networks, etc.) and their real-world advantages/drawbacks. Knowledge of advanced statistical techniques and concepts (regression, properties of distributions, statistical tests and proper usage, etc.) and experience with applications. Excellent written and verbal communication skills for coordinating across teams. A drive to learn and master new technologies and techniques. Experience visualizing/presenting data for stakeholders. Ability to work as part of a distributed team. Ability to utilize and lead interns on projects. Specific Training or Certification; Data Science, R or Python. **We thank you for your interest in Air Liquide. Interested applicants are encouraged to send in a detailed resume, including reason for leaving for past employment. Please be informed that only shortlisted candidates would be notified", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgRGF0YSBTY2llbnRpc3QiLCJjb21wYW55X25hbWUiOiJOb25lIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJqZFc2bG9JWURpRWt2ckVtQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFNpbmdhcG9yZSIsImxpbmsiOiJodHRwczovL3NnLmZpZGFudG8uY29tL2pvYnMvam9iLW9wZW5pbmcvZGF0YS13YXJlaG91c2luZy1zcGVjaWFsaXN0cy9zZW5pb3ItZGF0YS1zY2llbnRpc3QtMjc1NDIxMTU5P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Data Scientist - Singapore", "company_name": "Hewlett Packard Enterprise (HPE)", "location": "Singapore (+1 other)", "via": "via JobWiz", "description": "Data Scientist\n\nDescription -\n\nHP is the world’s leading personal systems and printing company, we create technology that makes life better for everyone, everywhere. Our innovation springs from a team of individuals, each collaborating and contributing their own perspectives, knowledge, and experience to advance the way the world works and lives.\n\nWe are looking for visionaries, like you, who are ready to make a purposeful impact on the way the world works.\n\nAt HP, the future is yours to create!\n\nIf you are our Data Scientist in Singapore, you will have a chance to:\n• Lead and drive small work team in data science projects.\n• Mine data using modern tools and programming languages.\n• Define and implement models to uncover patterns and predictions creating business value and innovation.\n• Automate engineering data capturing, analysis and visualization for hardware design and development.\n• Combine data sources and apply analytics for descriptive, diagnostic, predictive and prescriptive... purposes.\n• Manage relationships with business partners to evaluate and foster data driven innovation, provide domain-specific expertise in cross-organization projects/initiatives.\n• Tie insights into effective visualizations communicating business value and innovation potential.\n• Maintain proficiency within the data science domain by keeping up with technology and trend shifts. Contributes to industry data science domain initiatives.\n• Lead project team(s) of data science professionals, assuring insights are communicated regularly and effectively, reviewing designs, models and accuracy and data compliance.\n• Collaborate and communicate with project team regarding project progress and issue resolution.\n• Communicate and drive data insights/innovation into the business.\n• Represent the data science team for all phases of larger and more-complex development projects.\n\nAre you a high performer? We are looking for an individual with:\n• Bachelor's, Master's or PHD degree in Engineering, Mathematics, Economics, Physics, Computer Science, or equivalent.\n• Professional qualification, certification or training in Data Science.\n• Typically, 6-10 years’ experience including graduate or postgraduate research.\n• Extensive experience using statistics, mathematics, algorithms and programming languages to solve big data challenges.\n• Fluency in structured and unstructured data, its management, and modern data transformation methodologies.\n• Ability to define and create complex models to pull valuable insights, predictions and innovation from data.\n• Effectively and creatively tell stories and create visualizations to describe and communicate data insights.\n• Strong analytical and problem-solving skills.\n• Ability to effectively communicate data insights and negotiate options at senior management levels\n\nHP is a Human Capital Partner – we commit to human capital development and adopting progressive workplace practices in Singapore.\n\n#Li-Post\n\nJob - Engineering\n\nSchedule - Full time\n\nShift - No shift premium (Singapore)\n\nTravel -\n\nRelocation -\n\nEEO Tagline -\n\nHP Inc. is EEO F/M/Protected Veteran/ Individual with Disabilities.\n\nHP", "extensions": ["29 days ago", "Full–time"], "detected_extensions": {"posted_at": "29 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEYXRhIFNjaWVudGlzdCAtIFNpbmdhcG9yZSIsImNvbXBhbnlfbmFtZSI6Ikhld2xldHQgUGFja2FyZCBFbnRlcnByaXNlIChIUEUpIiwiY29tcGFueV9taWQiOiIvZy8xMWI4MDR4OXR5IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoibUh2Y3R1WTRjbnpQZGhuX0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXFFQ0N1SUJRVTVWWDA1eFUzTk1hM0I0YmtkcVZFUkJiWFl4UlRKaFptczROVTV2YkdKUlpHZE9kRk5hZURCc1RqQXRaVTR5WTFkRmVFb3haVVoxY1Y5WmREUmZiRWg1UTNoR1JURjJlbXcxZVRVNWFESmFVbE5UT1MxWU5uRlpia05KU2xsNlIxbGFkM05GUTJ4TVMxYzViek53VFVoR0xYZG5ORFZFU25sT1IxbEdTelpFUWxaUFQycElRM1ZOVFd4SFF6Sm5UalEyTkRSTk9XVlpaVTg0T1ZRM2FtRnNMV2hzU1dkcWJrUklRbU5OWmtaRGVUVllSR1E1VGtSRWFYTjBNbEF4TldOU01IWmxRMWhEY1VFelZuVkhSVmxuUkVNeFJVaFVWRU41ZGpaa2QyeDRaeElXVEc0MlExbE9SMXBOZEVoUkxXZFVkV3MyVURSQ1FSb2lRVTlOV1ZKM1FuTmlSbkJpUzNGNmFFSTNiVFpZUVhsVlRrdFpNbTFEYkV4SVVRIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNjIiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9iV2l6IiwibGluayI6Imh0dHBzOi8vam9id2l6LnNnL2pvYi9DUi05NzQwMjI5MzE/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}], "chips": [{"type": "Title", "param": "job_family_1", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Data scientist", "value": "data scientist"}, {"text": "Learning engineer", "value": "learning engineer"}, {"text": "Data science", "value": "data science"}, {"text": "Research associate", "value": "research associate"}, {"text": "Data engineer", "value": "data engineer"}, {"text": "Scientist", "value": "scientist"}, {"text": "Trainer", "value": "trainer"}, {"text": "Associate", "value": "associate"}, {"text": "Data analyst", "value": "data analyst"}, {"text": "Engineer", "value": "engineer"}, {"text": "Lecturer", "value": "lecturer"}, {"text": "Project manager", "value": "project manager"}, {"text": "Project officer", "value": "project officer"}, {"text": "Senior", "value": "senior"}, {"text": "Audit", "value": "audit"}, {"text": "Consultant", "value": "consultant"}, {"text": "Consulting", "value": "consulting"}, {"text": "Customer", "value": "customer"}, {"text": "Deputy director", "value": "deputy director"}, {"text": "Designer", "value": "designer"}, {"text": "Officer", "value": "officer"}, {"text": "Operations engineer", "value": "operations engineer"}, {"text": "Owner", "value": "owner"}, {"text": "Research engineer", "value": "research engineer"}, {"text": "Research scientist", "value": "research scientist"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Specialist", "value": "specialist"}, {"text": "Technical architect", "value": "technical architect"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Internship", "value": "INTERN"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Mining", "value": "/business/naics2007/21"}, {"text": "Research", "value": "/business/naics2007/5417"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Staffing", "value": "/business/naics2007/5613"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "Shopee", "value": "/g/11gh3fk34r"}, {"text": "Nanyang Technological University", "value": "/m/0l49k"}, {"text": "DBS Bank Ltd", "value": "/m/01q7n5"}, {"text": "Michael Page", "value": "/m/04cxldw"}, {"text": "Micron", "value": "/m/02gdqy"}, {"text": "Air Liquide", "value": "/m/079tgb"}, {"text": "Apple", "value": "/m/0k8z"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "SEPPIC", "value": "/m/0g558ww"}, {"text": "United Overseas Bank", "value": "/m/04gjd1"}, {"text": "AIR LIQUIDE INDUSTRIAL SERVICES PTE LTD", "value": "/g/11hg55y1rb"}, {"text": "Acronis", "value": "/m/04pjlt"}, {"text": "BIGTAPP PTE. LTD.", "value": "/g/11dxpsg5nn"}, {"text": "Burpple", "value": "/g/11dxps5yv5"}, {"text": "ByteDance", "value": "/g/11ghnfr0sv"}, {"text": "CTES Consulting Pte Ltd", "value": "/g/11jrn4m1xc"}, {"text": "Covance by Labcorp", "value": "/m/03ll59"}, {"text": "DHL", "value": "/m/021086"}, {"text": "DUN & BRADSTREET (SINGAPORE) PTE. LTD.", "value": "/g/11g9mpp2ph"}, {"text": "Dathena Science", "value": "/g/11dxprdn6y"}, {"text": "EasyMile", "value": "/g/11bwh58jhs"}, {"text": "Engine Biosciences Pte. Ltd.", "value": "/g/11gxm8pr96"}, {"text": "Experis Singapore", "value": "/g/11dxpnwm3s"}, {"text": "FieldBox.ai", "value": "/g/1ptyw89vr"}, {"text": "GIC Private Limited", "value": "/g/11mpj15pxw"}, {"text": "Government Technology Agency", "value": "/g/11gh0528nq"}, {"text": "Health Sciences Authority", "value": "/m/0h7fhh"}, {"text": "Hewlett Packard Enterprise (HPE)", "value": "/g/11b804x9ty"}, {"text": "Infineon Technologies", "value": "/m/02jzkj"}, {"text": "Infinite Computer Solutions Pte Ltd", "value": "/g/11g9mj72yz"}, {"text": "Institute Of Technical Education (ITE)", "value": "/m/05_02p"}, {"text": "KPMG Singapore", "value": "/g/11dxpsb9nr"}, {"text": "Lazada", "value": "/g/1q5bfkdqp"}, {"text": "Ministry of Defence Singapore", "value": "/m/0566dt"}, {"text": "Ngee Ann Polytechnic", "value": "/m/05451y"}, {"text": "Republic Polytechnic", "value": "/m/06jgzw"}, {"text": "ResMed", "value": "/m/07q0sq"}]}]}