{"search_metadata": {"id": "608278f9224db156e95da505", "status": "Success", "json_endpoint": "https://serpapi.com/searches/57c79862f702db9f/608278f9224db156e95da505.json", "created_at": "2021-04-23 07:36:25 UTC", "processed_at": "2021-04-23 07:36:25 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28software+developer%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=20", "raw_html_file": "https://serpapi.com/searches/57c79862f702db9f/608278f9224db156e95da505.html", "total_time_taken": 5.19}, "search_parameters": {"q": "(software developer) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "20"}, "jobs_results": [{"title": "Technical Lead, Software Engineering (Edge Team)", "company_name": "DELL", "location": "Singapore", "via": "via Dell Careers", "description": "Technical Lead, Software Engineering (Edge Team) - Singapore\n\nDell Technologies is seeking an entrepreneurial and innovative Technical Lead (Software Engineering) to drive the vision and execution of a new Enterprise Edge Initiative. If you are passionate about how the edge is revolutionizing the future infrastructure and enable the next wave of ultra-low latency Internet applications, this is the role for you.\n\nAs a Technical Lead (Software Engineering) in our new Edge innovation group, you\n• Have the passion in developing and supporting the growth of the next generation software architectures and inspire innovation within the team\n• Develop scalable real-time low-latency processing solutions in an agile delivery method\n• Lead and guide the team in design, code and implement new algorithms to solve complex problems\n• Work collaboratively with cross-functional distributed teams in engineering, QA and product management in all phases – ensuring delivery of quality... solutions\n\nRequirements:\n• Bachelor’s degree in Computer Science or related field (master’s degree preferred) or relevant experience and at least 10+ years of relevant application design & development experience\n• Solid knowledge of at least one or more programming language: Golang, Java, Rust, C# or NodeJS and at least one or more SQL/NoSQL database engines: MySQL, DynamoDB, Cassandra, MongoDb, Redis\n• Good working knowledge of Cloud platforms (Azure, AWS, GCP etc.) SDLC, Agile methodologies, and Agile development experience\n• Knowledge of compute, server, storage, networking, virtualization, HCI concepts and containerization using Docker and/or Kubernetes\n• Understanding and demonstrable experience of modern architecture/designs - micro-services/API-firstdevelopment/high-throughput/event-driven system\n\nGood to have:\n• AWS or Azure or GCP certified solution architect and machine learning algorithms knowledge such as clustering, classification and data processing tools such as TensorFlow, Scikit\n• Experience of Dell and VMware products is a plus but not expected. However, you should be eager to learn Dell/VMware products and other related technologies\n\nDell Technologies is a unique family of businesses that helps organizations and individuals build their digital future and transform how they work, live and play—providing customers with the industry’s broadest and most innovative technology and services portfolio. We value our customers, winning together, innovation, results and integrity. Grow your career with a highly competitive salary, bonus programs, world-class benefits and unparalleled learning and development opportunities— all at a company that is proud to be diverse and inclusive. Learn more on how we are closing the diversity gap here.\n\nDell is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at Dell are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. Dell will not tolerate discrimination or harassment based on any of these characteristics. Dell encourages applicants of all ages. Read the full Employment Opportunity Policy here", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJUZWNobmljYWwgTGVhZCwgU29mdHdhcmUgRW5naW5lZXJpbmcgKEVkZ2UgVGVhbSkiLCJjb21wYW55X25hbWUiOiJERUxMIiwiY29tcGFueV9taWQiOiIvbS8wcHk5YiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Ikp1aERCYy1jcllWNDFkS2NBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVzc0JDb3dCUVU1VlgwNXhVbXBxYUcxcFZWZFllV1E1TkhKVVJrOVRkMUl5TUdZM1FtVnZVV3hpU21wNmRFWkpXSHBmZVZack5YTnBiazR6V210WWExaFllRFY1V1daRVNVRTNUMVkxUzJOek1XaFdha2wyZG5WblZITnRRbFpmYVZGV1VtdHBiMHRmV0hoRGF6bFhPVzFSWDBGSU9HbDBXRE5CU2pkNFR6STRRVFJDZG5aa1lVNHpWRzV1YjJaWWEwc1NGbDlZYVVOWlNsYzNSa2wyWTNSUlluQTVOVzVCUkdjYUlrRlBUVmxTZDBSNk5FVnZVSFI1YlVaVVpqRlVURmhEVXpCRWNGcDBZbVZXUzFFIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBEZWxsIENhcmVlcnMiLCJsaW5rIjoiaHR0cHM6Ly9qb2JzLmRlbGwuY29tL2pvYi9zaW5nYXBvcmUvdGVjaG5pY2FsLWxlYWQtc29mdHdhcmUtZW5naW5lZXJpbmctZWRnZS10ZWFtLzM3NS8xNzkyNDUyMj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Software C Developer", "company_name": "Aryan Solutions Pte Ltd", "location": "Singapore", "via": "via JobsCentral", "description": "We are looking for a Senior C Developer for an ongoing long-term project in Singapore. The role will be permanent with a client based in Singapore.\n\nRESPONSIBILITIES\n• You will work within a growing research and development team to improve existing and build brand new Client products\n• You will work closely with Product Managers, Architects, Security, Operations, and QA through all phases of the software development lifecycle\n• You will be developing distributed, highly scalable efficient microservices for data protection and cybersecurity features in Client products\n• You continuously improve your own and your teammate's technical skills via mentoring, PR reviews, and feedback\n• You should be open to jumping into unfamiliar codebases, languages and start contributing\n\nREQUIREMENTS\n• Preferably a degree in computer science or equivalent engineering education or relevant work experience in the IT industry\n• 3+ years of backend development experience on large scale systems\n• Experience... with Golang development is highly preferred\n• Experience with developing microservices for cloud products and REST APIs\n• You can find your way around working with various data stores like PostgreSQL/ MySQL, Elasticsearch\n• Experience in Python, knowledge of Pytest or other test automation frameworks and tools would be a plus\n• Hands-on Docker and Kubernetes experience will be added advantage\n• Experience with Agile and CI/CD tools such as Jenkins is preferred\n\nInterested, Candidates please share their resumes at [Click Here to Email Your Resume] or call at 6708 7429 for a confidential discussion", "extensions": ["3 days ago", "$5K–$10K a month", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time", "salary": "$5K–$10K a month"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBDIERldmVsb3BlciIsImNvbXBhbnlfbmFtZSI6IkFyeWFuIFNvbHV0aW9ucyBQdGUgTHRkIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJpSDYycGZUeTllY25nUzVTQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnNDZW50cmFsIiwibGluayI6Imh0dHBzOi8vam9ic2NlbnRyYWwuY29tLnNnL2pvYi9zb2Z0d2FyZS1jLWRldmVsb3Blci1qM242Yzg3OGhwMDc1cGdmc2IzP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Senior Software Quality Assurance Engineer", "company_name": "Motional", "location": "Singapore", "via": "via NodeFlair", "description": "We are currently looking for a Senior Software Quality Assurance engineer to work on our quality management systems. You will be working on establishing and executing software quality assurance processes and procedures. From the control plans, to audits and facilitating corrective actions teams; the whole Software Quality Assurance is your arena.\n\nThings You'll Get To Work On\n• Establishing and executing software quality assurance processes\n• Oversees Internal Software Quality Assurance, providing direction, advice, and guidance\n• Develops control plan with new and existing product/service lines\n• Conducts system, process and software quality audits\n• Facilitates corrective action teams\n• Performs root cause analysis and verification of corrective actions of conditions adverse to quality\n\nEducation And Experience We Want From You\n• MS or BS in computer science, computer engineering or related field\n• 5+ years professional work experience as a software quality assurance... engineer\n\nSkills And Traits You Will Likely Already Have\n• Excellent knowledge of international quality standards such as IATF 16949 and ISO 9001 (ISO preferred, but IATF would be nice to have)\n• Strong experience with Software Development Life Cycle, comfortable with both waterfall and Agile methodologies in a V-Model systems development environment\n• Strong experience with software improvement model/s e.g. ASPICE, CMMI\n• Familiar with Software Quality Control tools (e.g., Klokwork, HelixQAC, cppcheck, shellcheck, OR Tools C++)\n• Familiar with software testing tools for unit test, verification testing (e.g., AI, dSPACE, Simphera)\n• Familiar with relational database management system (PLM, DCRM)\n• Experienced in Quality Management system auditing\n• Technical editorial skills\n• Good interpersonal skills\n\nBonus Points (but Not Required)\n• C++ Experience or any coding experience\n• Experience with creating and executing software test plan\n• Certified Auditor\n• Experience with ISO 2626\n\nMotional is making driverless vehicles a safe, reliable, and accessible reality.\nOur team is commercializing a world-class driverless system. The Motional team is behind some of the industry’s largest leaps forward in the last decade, including the first fully-autonomous cross-country drive in the U.S, the launch of the world’s first robotaxi pilot, and operation of the world’s most-established public robotaxi fleet. Strategically formed by Hyundai Motor Group and Aptiv, Motional is fundamentally changing how people move through their lives.\n\nHeadquartered in Boston, Motional has operations in the US and Asia. For more information, visit www.Motional.com and follow us on Twitter, LinkedIn, Facebook, Instagram and YouTube.\n\nMotional AD Inc. is an EOE. We celebrate diversity and are committed to creating an inclusive environment for all employees. To comply with Federal Law, we participate in E-Verify. All newly-hired employees are queried through this electronic system established by the DHS and the SSA to verify their identity and employment eligibility", "extensions": ["2 days ago", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgUXVhbGl0eSBBc3N1cmFuY2UgRW5naW5lZXIiLCJjb21wYW55X25hbWUiOiJNb3Rpb25hbCIsImNvbXBhbnlfbWlkIjoiL2cvMTFtcGQwal9uYiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjE3b2h2dTNBajZIS3NnZlBBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhWRk51YTJFMGRUQnZNMHQxWVUxSE5HWlVOVlUyWTBOR05EWnFRa1pPT0Zkb1JqbFROWGxpVkdzeGJHNTBhV1p3TVdOVGN6VnNYMkk1ZDA1bk4xWlhSM05SYWtKQ1gxbG1MWGxKYmxSTVVHaFRhbG90ZFdNeFZVNUhhbFpoV0dkalgwdFhSaTFNUlRSR1Iyc3hSRWxVU1hKUVdXNDRWVkExT1ROelRUTTVlVTloTFhaNE5raFVPV3BRU20xaGMxOXBjMUIxZFVkWmRHWlVZVlozRWhaZldHbERXVXBYTjBaSmRtTjBVV0p3T1RWdVFVUm5HaUpCVDAxWlVuZEJlREZFTFdoRk0yUkpRWFl0V2poemVtNVRhM1ZJWHpKdVRsbDMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18xOSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBOb2RlRmxhaXIiLCJsaW5rIjoiaHR0cHM6Ly93d3cubm9kZWZsYWlyLmNvbS9qb2JzL2xpc3RpbmdzLzEyOTkwP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Senior Software Engineer, Chat Platform", "company_name": "Zendesk", "location": "Singapore (+1 other)", "via": "via Bayt.com", "description": "Job Description\n\nZendesk is looking for a Senior Software Engineer to join the Chat Platform team. The team focuses on delivering the best experience for our largest customers and experimenting with opportunities for accelerated growth. Zendesk’s customer base is growing fast and you will be able to make meaningful contributions to a product that is used by millions of people every day.\n\nThe Chat Platform team works with a high degree of autonomy and achieves high velocity by combining designers, test engineers, product managers, and software engineers collaborating together.\n\nSenior Software Engineers at Zendesk are expected to be hands-on technologists who can contribute to application development directly, contribute to the design and implementation of projects, and be involved in technical discussions beyond their teams. You should love finding elegant solutions to complex problems, and care about not only the technical and algorithmic aspects of large systems but the way they... enable other developers to do their jobs. Previous experience with web infrastructure, distributed systems, or component-oriented software engineering is a strong plus.\n\nWhat you’ll be doing\n• Work on a Chat platform backend serving millions of users daily.\n• Guide the team on technical design discussions and propose innovative solutions on backend components.\n• Ensure scalability, performance, maintainability, and security of the technical platform in collaboration with SRE teams.\n• Build POCs to test candidate technologies and make informed decisions.\n• Collaborate closely with the Product Manager, the Team Lead, and the Tech Lead to provide technical insights and early estimates on upcoming projects.\n• Educate other developers through pairing sessions, and code reviews.\n• Become a key contributor to better working practices across Zendesk.\n\nWhat you bring to the role\n• Required:\n• You have delivered enterprise-grade software as part of a cloud-based company or business unit.\n• You are independent, self-motivated, and a good team player at the same time.\n• You have reasonable communication skills: able to explain a technical concept in an accurate and understandable way.\n• You put the customer first and respect your commitment to deliver.\n• Preferred:\n• You have hands-on experience with or knowledge of developing event-driven microservices using technologies similar to Apache Kafka.\n• You have hands-on experience with or knowledge of AWS distributed services.\n• You have personal projects, collaboration with open-source communities, or active learning initiatives to showcase your passion for technology.\n\nTech Stack\n• Java, Javascript, Python\n• Redis, Mysql, AWS Aurora\n• Apache Kafka\n• Docker, Kubernetes\n\nZendesk builds software for better customer relationships. It empowers organizations to improve customer engagement and better understand their customers. Zendesk products are easy to use and implement. They give organizations the flexibility to move quickly, focus on innovation, and scale with their growth.\n\nMore than 150,000 paid customer accounts in over 150 countries and territories use Zendesk products. Based in San Francisco, Zendesk has operations in the United States, Europe, Asia, Australia, and South America.\n\nInterested in knowing what we do in the community? Check out the Zendesk Neighbor Foundation to learn more about how we engage with, and provide support to, our local communities.\n\nZendesk is an equal opportunity employer, and we’re proud of our ongoing efforts to foster global diversity, equity, & inclusion in the workplace. Individuals seeking employment at Zendesk are considered without regard to race, color, religion, national origin, age, sex, gender, gender identity, gender expression, sexual orientation, marital status, medical condition, ancestry, physical or mental disability, military or veteran status, or any other characteristic protected by applicable law.\n\nBy submitting your application, you agree that Zendesk may collect your personal data for recruiting, global organization planning, and related purposes. Zendesk's Candidate Privacy Notice explains what personal information Zendesk may process, where Zendesk may process your personal information, its purposes for processing your personal information, and the rights you can exercise over Zendesk’s use of your personal information", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgRW5naW5lZXIsIENoYXQgUGxhdGZvcm0iLCJjb21wYW55X25hbWUiOiJaZW5kZXNrIiwiY29tcGFueV9taWQiOiIvbS8wd2ttNHBsIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiMTZ0OTFHazloOHduV2pHVUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFVteDZibHBUY0VGak9HOXZiek5rV2xsWFpGOTZXRnBZYlRscVowZzJOV1YyUlhwRmNXaE9hRWt5TVRFMVpYQnZYekp3ZEdKQ2RIcDZRVVUyUTBKRU5ubHZhamhKVERWb1MxaE1MWFIyU0c5Rk1HVndZak5JTVVWelYxcE9UR1kyTTB4bk9VOUdhVmczYjJWUWF6aERURTkwUm5GMFVrZGlkak5hYTJsb2QzZzRVelpzYm1KUVFXaHlZMEo2TVRaVFF6QklMV0V4UWtGUVIwbEJFaFpmV0dsRFdVcFhOMFpKZG1OMFVXSndPVFZ1UVVSbkdpSkJUMDFaVW5kRWJEQlhNVEpMVnpGRFIxZzVVa2hyWW0xRGIyMUZlVkpRZGpSUiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzI3IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJheXQuY29tIiwibGluayI6Imh0dHBzOi8vd3d3LmJheXQuY29tL2VuL3NpbmdhcG9yZS9qb2JzL3Nlbmlvci1zb2Z0d2FyZS1lbmdpbmVlci1jaGF0LXBsYXRmb3JtLTU5NTU2OTQ1Lz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Network Systems Developer", "company_name": "Microsec", "location": "Singapore", "via": "via AngelList", "description": "Candidates will be well versed in developing software for systems with low memory, CPU and bandwidth, with or without a Real-Time Operating System, to provide support libraries and application examples for IoT solutions. Successful candidates will be responsible for implementations of MicroSec’s security algorithms in a different operating environment, as well as providing integrations of the solution on a variety of different architectures and brands of IoT systems. They will also provide engineering support of key testing activities, including support of laboratory and field testing activities.\n\nThe candidate will be working in a field that’s essential to rapidly growing smart cities and the digital transformation of our world. They will be part of an agile team spanning embedded, frontend and backend systems and get opportunities to learn beyond their knowledge base.\n\nPREREQUISITE\n• At least 3 years of academic experience and 2 years of production-level experience in working with... C/C++ and Python language\n• Working experience with socket programming, OpenSSL, TCP/UDP, Network interfaces, low-level Kernel interfaces and System I/O calls\n• Comfortable in a Linux environment\n• Have experience with DevOps and how to build a production environment system\n• Working understanding of public key infrastructure\n• Experience with hardware security modules a plus\n\nOPTIONAL\n\nFramework\n• Django\n\nProtocols\n• TCP/IP stack\n• MQTT or other message brokers\n• IoT communication protocols such as BLE, LoRa and ZigBee\n\nSkills\n• Unit testing and integration testing\n\nWe offer an industry competitive salary commensurate with experience and Employee Stock Options.\n\nInterested candidates may send their resume to dipali@usec.io or vishram@usec.io.\n\nMicrosec focuses on Cyber Security and Smart Cities. Their company has offices in Singapore. They have a small team that's between 11-50 employees.\n\nYou can view their website at http://www.usec.io or find them on Facebook and LinkedIn", "extensions": ["4 days ago", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJOZXR3b3JrIFN5c3RlbXMgRGV2ZWxvcGVyIiwiY29tcGFueV9uYW1lIjoiTWljcm9zZWMiLCJjb21wYW55X21pZCI6Ii9nLzExZjAwdzIxdHMiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiIySXhuSWk5NXFfdUtfYUxjQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VkZwcWNGOXhTRTgzVlhwTFVHSXpWbGcyTWxoUlExSlRibTF0YTAxUGRISmhkemszWDBSS2R6QTVUekY1YjI4NFNua3hjMFl5VkRoTlR6RmpNMnBrTVZablpEWlFWMWhzU1hWaU4ycHBPRXR5ZWxkUVVVSlVWVkZYTW1kV01HSjRjRmRhWTJkMU5tcDRUbDkyTUdScVR6bFhVMVEwTTBzMGJ6RmpNMG93WkZjNWVUUjRSSE00U2xNMFNpMDNjRlp2ZFVWNWNHOUJkVlowUm5kM0VoWmZXR2xEV1VwWE4wWkpkbU4wVVdKd09UVnVRVVJuR2lKQlQwMVpVbmREYmkxM2JsbENRMUZEVURVMWJsRlBjMjV4UW1sdVlqSTNjM05uIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMzQiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQW5nZWxMaXN0IiwibGluayI6Imh0dHBzOi8vYW5nZWwuY28vY29tcGFueS9taWNyb3NlYy00L2pvYnMvMTMxOTUxNC1uZXR3b3JrLXN5c3RlbXMtZGV2ZWxvcGVyP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Sr. Software Test Engineer ( Automation )", "company_name": "VISA", "location": "Singapore", "via": "via Jobs", "description": "Company Description As the world's leader in digital payments technology, Visa's mission is to connect the world through the most creative, reliable and secure payment network - enabling individuals, businesses, and economies to thrive. Our advanced global processing network, VisaNet, provides secure and reliable payments around the world, and is capable of handling more than 65,000 transaction messages a second. The company's dedication to innovation drives the rapid growth of connected commerce on any device, and fuels the dream of a cashless future for everyone, everywhere. As the world moves from analog to digital, Visa is applying our brand, products, people, network and scale to reshape the future of commerce.At Visa, your individuality fits right in. Working here gives you an opportunity to impact the world, invest in your career growth, and be part of an inclusive and diverse workplace. We are a global team of disruptors, trailblazers, innovators and risk-takers who are... helping drive economic growth in even the most remote parts of the world, creatively moving the industry forward, and doing meaningful work that brings financial literacy and digital commerce to millions of unbanked and underserved consumers. You're an Individual. We're the team for you. Together , let's transform the way the world pays. Job Description and Responsibilities Digital & Developer Platform at Visa is looking for a passionate Sr. Software Test Automation Engineer, to work on the certification of digital and mobile products of Visa. Drive the test effort from planning and organization to execution and delivery. Develop effective test strategies. Write and contribute to test plans and/or test cases in medium to large sized projects Advocate and educate product/project teams on test design, automation framework use and implementation. Work with those teams to evaluate test-ability of new features/implementations. Use your knowledge of testing in defining acceptance criteria and test\\ability to influence better software design, promote best engineering practices, bug prevention strategies, testability, and other quality attributes across products. Continually work to incorporate automated tests into our CI and CD deployment pipeline Perform creative exploratory testing of new features and products Collaborate with Cross team developers and product to increase MERCHANT/ISSUER End to End test coverage, improve efficiency & effectiveness and promote best practices. Provide critical feedback to Software Engineers and product managers to improve existing and new features and capabilities Work with project teams highlighting and detailing any risks and assumptions identified Actively engage in the continuous improvement of testing practice with a focus on speed, quality and innovation Qualifications Basic Qualifications Bachelor’s Degree or equivalent in the Computer Science, Computer Engineering or Information Technology disciplines with strong fundamentals in software engineering. Minimum 3 years of years of Software Development or equivalent Test Automation Experience This role requires the candidate to have fluent Chinese and English communication skills as the role will involve working closely with teams and customers based in China and US. Preferred Qualifications . BS/BE in Software Engineering, Computer Science, IS, or other related field 4+ years of Software Development or equivalent Test Automation experience 4+ years of experience working in Java environment and coding skills Strong API & UI Automation, Integration testing The individual must be good at Integration testing, API & mobile UI Automation, Client Centric focused test plan, review and certification of products Strong understanding of object-oriented programming languages - Groovy, Java, JavaScript, J2EE, XML, unit-testing and RDBMS Accomplished with Open Source Automation Framework tools (Java, Javascript Eclipse, IntelliJ, SOAPUI, TestNG, Selenium, Jmeter and similar tools) Ability to write clear and concise automation scripts in - Groovy, Java, JavaScript, Python Highly Skilled in JSON Methods and Encryption Methodology(s) Heavily Practiced in rational databases Experienced Debugger by reviewing log file validation on a LINUX/UNIX server, Splunk Experience in configuration management tools like Jenkins Ability to Use and Obtain SME knowledge base to define and communicate writing test cases, test plans, and/or test strategies Strong interpersonal and facilitation skills along with effective communication (both written and verbal) skills. Agile methodology experience is required Additional Information Work Hours: Incumbent must make themselves available during core business hours Physical Requirements: ​​​​​​ This position will be performed in an office setting. The position will require the incumbent to sit and stand at a desk, communicate in person and by telephone, frequently operate standard office equipment, such as telephones and computers, and reach with hands and arms. Visa is an EEO Employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status. Visa will also consider for employment qualified applicants with criminal histories in a manner consistent with EEOC guidelines and applicable local law", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTci4gU29mdHdhcmUgVGVzdCBFbmdpbmVlciAoIEF1dG9tYXRpb24gKSIsImNvbXBhbnlfbmFtZSI6IlZJU0EiLCJjb21wYW55X21pZCI6Ii9tLzAxa3FqbiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IkNGeXJXM1kxdDlUSW15SldBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVzc0JDb3dCUVU1VlgwNXhVVlZTZUdsd1lrcG1YemxWTjBsaVZEWkthelpyVm1kdGIwMTFMV2N6UTFoblRGQlBXV0Z6Vm5CaGExSTJlRk5XYUUxdWFVMHlZM1o0ZFhoWVpsaEhVMU5PUVRsWFRrOVJWVXRYYmxneGNIRmpUalJ1WDFCYU1XWklVbDlCYjBSU2JXcEhVRUZ0TFV4WGF6TnhaVzR6ZVRsMlN6QlBjbGRKTTFJeWRuZzVUV1ZuYlZSMlMwRVNGbDlZYVVOWlNsYzNSa2wyWTNSUlluQTVOVzVCUkdjYUlrRlBUVmxTZDBSUmJGUmhPRVZHWjI1b1RXNVdZMjB5Wmxwc2JteDBNblExVm5jIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNDEiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9icyIsImxpbmsiOiJodHRwczovL3NnLmZpZGFudG8uY29tL2pvYnMvam9iLW9wZW5pbmcvc29mdHdhcmUtZGV2ZWxvcGVycy1zeXN0ZW1zLXNvZnR3YXJlL3NyLXNvZnR3YXJlLXRlc3QtZW5naW5lZXItYXV0b21hdGlvbi0yNzc4ODI4NzE/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Specialist - Software Engineering", "company_name": "Techgig", "location": "Singapore", "via": "via Mendeley", "description": "About Job\n\nCTC Undisclosed Job Location Singapore Experience 8 - 11 yrs\n\nDescription\n\nMandatory Certificate : Oracle Database SQL Certified Associate Strong experience in Oracle PL-SQL with minimum 8 years of relevant experience. Experience in Create, test and implement PLSQL triggers, stored procedures, functions, and packages Hands-on experience with Oracle PL SQL and exposure to performance tuning practices Strong working experience with Advanced SQL and PLSQL knowledge Experience working in a Unix/Linux environment and developing shell scripts Complete understanding of full software development lifecycle SDLC. Should be able to work independently and deliver according to the expectation. Should have excellent logical and analytical problem solving skills.\nJob Segment: Software Engineer, Database, Testing, Developer, Oracle, Engineering, Technology", "extensions": ["7 days ago", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTcGVjaWFsaXN0IC0gU29mdHdhcmUgRW5naW5lZXJpbmciLCJjb21wYW55X25hbWUiOiJUZWNoZ2lnIiwiY29tcGFueV9taWQiOiIvZy8xMWM3M2Z4Z3d0IiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoidVp4YXllWHA0S1RGVDItRUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFVuRjRTSEZQY0U5dk5HbEdhMU5JTVY5cmNWRjRSM2R0YzJOak1rUmZlWHB4VFV0WFgzcEJkVzUyWkRWV2QxVjNhVUZDWkRNeVZIVllaRzAxTFd4UE9VRnFiME55VG1abFIwOU9hVTFyY1VGT1VYZHhWRkZzU0doYWJWUnVSMnRoTUVsaU1HSlpURmw0VkhsNmFVNUtja28wTVhGTFUxOUtTRms1YkUxVWFUVmlXbVZHYmt4T1FsbHJSVVU0UlVSVVVIWjFaRjh6VFZSQk1XZEJFaFpmV0dsRFdVcFhOMFpKZG1OMFVXSndPVFZ1UVVSbkdpSkJUMDFaVW5kQ1ZqSjVhelp5V0RaUFlXaE9MV1paTm0xRk1GbEViRWxXYTNCMyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzQ4IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1lbmRlbGV5IiwibGluayI6Imh0dHBzOi8vd3d3Lm1lbmRlbGV5LmNvbS9jYXJlZXJzL2pvYi9zcGVjaWFsaXN0LXNvZnR3YXJlLWVuZ2luZWVyaW5nLTMzOTA0MDM/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "SoC Software Engineer (Malaysia)", "company_name": "Realtek Malaysia", "location": "Singapore", "via": "via Neuvoo", "description": "Job Description\n\nSoC Software Engineer - KL , Malaysia\n\nJob Descriptions\n\n1、Develop APK to meet customer's requirement\n\n2、Handle Live TV and country logo related issues for different countries\n\n3、Handle HDMI CEC, ARC, and compliance test related issues\n\n4、Handle media player related issues\n\n5、Debug Google certification related issues(CTS, GTS, VTS…)\n\n6、Debug OTT certification related issues(Netflix, Youtube, Amazon)\n\n7、Develop TV middleware\n\n8、Support customer factory request and manufacture related issues\n\nJob Requirements\n\n1、Familiar with C/C++, Java programming language\n\n2、Experience on TV, Set-top box, Smart phone, multimedia player products.\n\n3、Better having experience with: Linux kernel driver porting or development、Android APK development、TV related experience(ATSC 1.0/ATSC 3.0/DVB/ISDB)、Android framework (TIF/HAL/HIDL)、Media playback、HDMI CEC/ARC、Android certification debug experience(CTS/GTS/VTS)、OTT certification experience(Netflix/Youtube/Amazon)、Wifi(WOWL)、Middleware... (Ginga/FreeviewHD/HbbTV/CI+/SI)、ATV(NTSC, PAL, SECAM)、Subtitle(CC, TT)、System debug skill(Memory leak, Memory trash, Performance analysis).\n\n4、Work Location: KL Area, Malaysia.\n\nRealtek Malaysia officially opened in June 2020, located in the KL City area, and is a wholly owned subsidiary of Realtek Semiconductor Corp. from Hsinchu, Taiwan. Realtek founded in 1987, and has a track record of delivering uninterrupted profitable growth every year since its inception. We aims to attract top R&D talents in Malaysia and the greater Southeast Asia. We efforts to provide the ultimate in pioneering Multimedia IC technology", "extensions": ["4 days ago", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb0MgU29mdHdhcmUgRW5naW5lZXIgKE1hbGF5c2lhKSIsImNvbXBhbnlfbmFtZSI6IlJlYWx0ZWsgTWFsYXlzaWEiLCJjb21wYW55X21pZCI6Ii9tLzA1d3JtNyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjZXOFNKRERJam5WLVR2NlhBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2WUJDcmNCUVU1VlgwNXhVVlJOUkRWSFpEbFZXR3N6YzJoaU4ycFdkVlIyT0ZWcGR5MXVUMVpaTkVsbVlsWkRXWGRWVEdkUlp6aEpUelZzYkd0NlprWnlZM0pFYlhwRWNITnhNME4wYlY4ME1qQldaamQ1YnpNMWVGcFpSVW8xWVZONWQxWmlXVGM1WjJoMmFsVnBNakJSUm01dVIyUm1SVXd6Y1doMVptMHhaVWRXUmxwTlMzTlFZV1p5YkVGdldHRk9SMGxPV0Zkck9XMUhTRlJaVm5WdlVrTTRibVpTTVdwNmMzQk9iV1F3V0RCdWRsSkliMmREY2xCakVoWmZXR2xEV1VwWE4wWkpkbU4wVVdKd09UVnVRVVJuR2lKQlQwMVpVbmREU2xGMVVsUmtka3hKU0hCWVFtdFVXVGxJVkVOVFQybENjVzkzIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNTYiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTmV1dm9vIiwibGluayI6Imh0dHBzOi8vc2cubmV1dm9vLmNvbS92aWV3Lz9pZD0yMGIzYzk2ZTdhOWNcdTAwMjZ1dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Software Engineer - Sys design/Kubernets/AKS/MS Azure/AWS/Scrum - Jurong", "company_name": "OakTree Consulting", "location": " (+1 other)", "via": "via LinkedIn", "description": "Responsibilities\n• Design, develop, test, deploy, maintain and improve backend/platform applications\n• System-to-system Integration development using API, messaging and related technologies.\n• Unit test development and peer review in a Scrum team\n• Full stack developer will be an added advantage.\n• Assist architect/team lead on application design, database schema design and integration design\n• Assist development team on integration and security test design. And develop test drivers/simulators or stub required\n• Assist PO/BA on user stories refinement.\n• Assist QA/Tester on test automation and bug fixes.\n• Assist DevOps on build and release automation.\n• Prepare interface specifications and other design documentations.\n\nRequirements\n• Experience with backend system design and development.\n• Experience development using Kubernetes, AKS, Istio/Envoy, Spring, Java/JEE, RESTful API, messaging (AMQP, MQTT & related technologies), or postgresql/mysql/MSSQL/RDS/AzureDB.\n• Experience with... development on Microsoft Azure, and/or AWS will be an advantage\n• Minimum 3 years experience\n• Able to express design using UML notation and derive tasks backlog in SCRUM.\n• A fast learner, have a proactive attitude and an eye for quality works\n• A team player - inclusive mindset to collaborate effectively in a diverse team\n• Familiarity with developing efficient queries and designing schemas for relational databases\n• A team player - inclusive mindset to collaborate effectively in a diverse team\n• Plus points as added advantage for senior post or team lead:Experience with development on a public cloud, e.g. Microsoft Azure, AWS Experience in developing platform level features, such as configuration management, service discovery and routing, feature switch, A/B testing, etc. Experience with clustering, stateless/stateful, transactions and system integration designs principles Experience with ESB and API Management Experience with security hardening and understanding of security CIA and AAA Experience with LDAP/Active Directory and SSO integration Familiarity with Spring Framework Experience with Maven, Nexus or Artifactory Experience with Git or Subversion Experience with Docker Experience with CI/CD systems, such as Bamboo, Jenkins Scrum certified, and with experience in a Scrum project\n\nOffice Location : Jurong East, May require to station at Punggol site, if necessary\n\nKindly submit resumes in MS Word format to ******** with the following details:-\n• Position applying for\n• Current remuneration\n• Expected remuneration\n• Notice period\n• Reason for Leaving\n\nPerson-in-charge : Quek Hong Guek, Margaret\n\nOaktree Consulting\n\nEA License No : 06C4642\n\nEA Reg No : R1981137\n\nWe regret that only shortlisted candidates will be notified", "extensions": ["14 hours ago", "Full–time"], "detected_extensions": {"posted_at": "14 hours ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciAtIFN5cyBkZXNpZ24vS3ViZXJuZXRzL0FLUy9NUyBBenVyZS9BV1MvU2NydW0gLSBKdXJvbmciLCJjb21wYW55X25hbWUiOiJPYWtUcmVlIENvbnN1bHRpbmciLCJjb21wYW55X21pZCI6Ii9nLzExZzcwamZodHEiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJ6N2ZnN2hnNFowbVRsT1FnQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdllCQ3JjQlFVNVZYMDV4Vkhod01FbERkRll4UzFKQlZWa3pSa1JSZW5KWVdtaE1NMHR6VTNSRGRWQmxaSFZTWDJoNmRHVjJabTFIV25ZdFlWTlJhVVJGVmpBNGNUQkNYMUF5UzFSMlNWQmZMWFkzVTBSaWRtSmpabHBJTTFsMU4xVndRMnRrUzBSSk1sTlRNMEZDWVVkYWJHc3ljMlJyVjNOYWEwOUxRakUyZURNd1RHTmhWV2h0Vkhkc1FsQnpRbGR2TjJoemVXVklPR0Z2Y0dJMlEydzFVR2xZZEZaeVgzVTFSSEV6YUhwbVRrTm1ZazluWkU5RUxXNVJFaFpmV0dsRFdVcFhOMFpKZG1OMFVXSndPVFZ1UVVSbkdpSkJUMDFaVW5kRFVWSjZVMlkyV25weWVFZEZWMjVHTm5WblRESnVhRkZwV1haUiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzY0IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExpbmtlZEluIiwibGluayI6Imh0dHBzOi8vc2cubGlua2VkaW4uY29tL2pvYnMvdmlldy9zb2Z0d2FyZS1lbmdpbmVlci1zeXMtZGVzaWduLWt1YmVybmV0cy1ha3MtbXMtYXp1cmUtYXdzLXNjcnVtLWp1cm9uZy1hdC1vYWt0cmVlLWNvbnN1bHRpbmctMjUxNTcwNTY2NT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Trainee software Developer-Pega", "company_name": "Collabera Technologies Pte. Ltd.", "location": "Singapore", "via": "via Monster", "description": "Role : Traineesoftware Developer(Pega)\n\nLocation : Singapore\n\n5 weeks of Training on Pega Development will be provided by Collabera, after the training we will give you fulltime Role for software engineer\n\nWe are looking for fresh graduates who want to develop their career as Pega Developer.\n\n· Fresh graduate (Degree/Diploma) IT related OR 1 to 4 years of experience candidates\n\n· It is going to be 12 month contract with possible extension/conversion.\n\n· 5 weeks of Training on Pega Development will be provided by Collabera\n\n· We are going to invest in training so you have to sign a bond with us for 12 months.\n\n· Can start immediately after training\n\nResponsibilities:\n\n· Analyze, design and support implementation of business-specific solutions and/or frameworks.\n\n· Responsible for implementing technical solutions using Pega 7.\n\n· The Pega Developer will analyze the application architecture of a new Pega implementation and technical integration with internal/external systems, support the... development of SDLC deliverables including architecture document, interface control documents, and detailed design documents. The Pega Developer will work with the team and client to document functional designs and work alongside the build team to capture design detail in the SDLC deliverables.\n\n· Ability to create reusable components that can be leveraged across the enterprise for providing top-notch customer experience.\n\n· Ability to translate complex business requirement into functional technical requirements into well designed, well performing solutions using Pega 7.\n\n· Assist with planning and execution of unit, integration and user acceptance testing.\n\n· Provide regular updates team lead and project manager on project progress and outstanding issues", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJUcmFpbmVlIHNvZnR3YXJlIERldmVsb3Blci1QZWdhIiwiY29tcGFueV9uYW1lIjoiQ29sbGFiZXJhIFRlY2hub2xvZ2llcyBQdGUuIEx0ZC4iLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IkRFMlpVMkVfeEIyajRTNnBBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTW9uc3RlciIsImxpbmsiOiJodHRwczovL3d3dy5tb25zdGVyLmNvbS5zZy9qb2IvdHJhaW5lZS1zb2Z0d2FyZS1kZXZlbG9wZXItcGVnYS1jb2xsYWJlcmEtdGVjaG5vbG9naWVzLXB0ZS1sdGQtc2luZ2Fwb3JlLTI1ODI1Nzc/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}], "chips": [{"type": "Title", "param": "job_family_1", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Software engineer", "value": "software engineer"}, {"text": "Senior", "value": "senior"}, {"text": "Test engineer", "value": "test engineer"}, {"text": "Cloud engineer", "value": "cloud engineer"}, {"text": "Engineer", "value": "engineer"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Assurance engineer", "value": "assurance engineer"}, {"text": "Programmer", "value": "programmer"}, {"text": "Coach", "value": "coach"}, {"text": "Qa engineer", "value": "qa engineer"}, {"text": "Devops engineer", "value": "devops engineer"}, {"text": "Frontend engineer", "value": "frontend engineer"}, {"text": "Java engineer", "value": "java engineer"}, {"text": "Solutions engineer", "value": "solutions engineer"}, {"text": "Testing engineer", "value": "testing engineer"}, {"text": "Analyst", "value": "analyst"}, {"text": "Data engineer", "value": "data engineer"}, {"text": "Design engineer", "value": "design engineer"}, {"text": "Development manager", "value": "development manager"}, {"text": "Devops consultant", "value": "devops consultant"}, {"text": "Firmware engineer", "value": "firmware engineer"}, {"text": "Lead engineer", "value": "lead engineer"}, {"text": "Lecturer", "value": "lecturer"}, {"text": "Manager", "value": "manager"}, {"text": "Network systems", "value": "network systems"}, {"text": "Principal", "value": "principal"}, {"text": "Principal engineer", "value": "principal engineer"}, {"text": "Quality engineer", "value": "quality engineer"}, {"text": "Science", "value": "science"}, {"text": "Scrum master", "value": "scrum master"}, {"text": "Security architect", "value": "security architect"}, {"text": "Security engineer", "value": "security engineer"}, {"text": "Senior engineer", "value": "senior engineer"}, {"text": "Senior lecturer", "value": "senior lecturer"}, {"text": "Senior system", "value": "senior system"}, {"text": "Senior technical", "value": "senior technical"}, {"text": "Software architect", "value": "software architect"}, {"text": "Specialist", "value": "specialist"}, {"text": "Stack engineer", "value": "stack engineer"}, {"text": "System engineer", "value": "system engineer"}, {"text": "Technical", "value": "technical"}, {"text": "Trainee", "value": "trainee"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Wholesale", "value": "/business/naics2007/42"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Mining", "value": "/business/naics2007/21"}, {"text": "Rental", "value": "/business/naics2007/532"}, {"text": "Retail", "value": "/business/naics2007/44"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": ".AB4Jjf.qPB6Vc{padding-right:11px}.qfpP8d{padding:7px 0 7px 11px}.S003Ke{flex:none}.ZoN4Lb{color:rgba(0,0,0,.54)}.nAXVG{color:#70757a}.IxQsL{color:rgba(0,0,0,.26)}.xFO1De{color:#fff}.ooFpK{color:rgba(255,255,255,.30)}.mtnwac{color:#4285f4}.WxeeKb{color:#34a853}.hIVRU{color:#f29900}.EXaTMc{color:#fbbc04}.sxn46d{color:#000}.gqMTF{color:#1a73e8}.zpn8Mb{color:#d93025}.dEUPmd{color:#1e8e3e}.PJNo1{color:#fbbc04}Actively Hiring", "value": "e"}, {"text": "EPAM", "value": "/m/0dlnrc"}, {"text": "VISA", "value": "/m/01kqjn"}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Zühlke", "value": "/g/1hh_rg216"}, {"text": "Cardinal Health", "value": "/m/040vzx"}, {"text": "Credit Agricole Group", "value": "/m/028vbm"}, {"text": "GlobalTix Pte Ltd", "value": "/g/11dxpqdhrf"}, {"text": "HCL SINGAPORE PTE. LTD.", "value": "/g/11fy25ngsv"}, {"text": "Jobline Resources Pte Ltd", "value": "/g/11gp2647pn"}, {"text": "Mediacorp", "value": "/m/03qtz1"}, {"text": "Realtek", "value": "/m/05wrm7"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "TECHNOPALS PTE. LTD.", "value": "/g/11dxpvkynp"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "Thales", "value": "/m/01phj4"}, {"text": "UST", "value": "/m/08kb8g"}, {"text": "UrbanFox", "value": "/g/11ghs7y0w6"}, {"text": "Activate Interactive", "value": "/g/11dxq192l5"}, {"text": "Cognizant", "value": "/m/03bf9h"}, {"text": "DELL", "value": "/m/0py9b"}, {"text": "HCL Technologies", "value": "/m/0698gv"}, {"text": "ORACLE", "value": "/m/05njw"}, {"text": "Singapore Press Holdings Limited", "value": "/m/0d7mwh"}, {"text": "Temasek Polytechnic", "value": "/m/098s73"}, {"text": "TikTok", "value": "/g/11fy265933"}, {"text": "Zendesk", "value": "/m/0wkm4pl"}, {"text": "A-it Software Services Pte Ltd", "value": "/g/11dxpy_gl_"}, {"text": "ACCENTURE PTE LTD", "value": "/m/09n8w94"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "Adecco GS", "value": "/m/08gz46"}, {"text": "Atidan Technologies", "value": "/g/11c74f0b8_"}, {"text": "Autodesk", "value": "/m/018nm3"}, {"text": "Avnet", "value": "/m/0c8xmc"}]}]}