{"search_metadata": {"id": "60827eafdefa132910a67284", "status": "Success", "json_endpoint": "https://serpapi.com/searches/fabce1e28804e1af/60827eafdefa132910a67284.json", "created_at": "2021-04-23 08:00:47 UTC", "processed_at": "2021-04-23 08:00:47 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28software+developer%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=220", "raw_html_file": "https://serpapi.com/searches/fabce1e28804e1af/60827eafdefa132910a67284.html", "total_time_taken": 1.21}, "search_parameters": {"q": "(software developer) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "220"}, "jobs_results": [{"title": "Senior Software Engineer (Mobile + React Native)", "company_name": "EPAM Systems", "location": "Singapore (+1 other)", "via": "via Bayt.com", "description": "EPAM is committed to providing our global team of more than 41,150 EPAMers with inspiring careers from day one. EPAMers think creatively and lead with passion and honesty. Our people are the source of our success. We value collaboration, work in partnership with our customers, and strive for the highest standards of excellence. In today’s market conditions, we’re supporting operations for hundreds of clients around the world remotely. No matter where you are located, you’ll join a dedicated, diverse community that will help you discover your fullest potential.\n\nDESCRIPTION\nWe are looking for an experienced Senior / Software Engineer (Mobile + React Native) in Singapore to make the team stronger.\n\nExperience in design and implementation of mobile applications for iOS s written on React Native using Javascript, Swift, or Objective-C. If you’re right for this role, you should have a background in native iOS development and be comfortable developing with React Native.\n\nWe Value\nValue the... individuals – We encourage and motivate people to grow. We perceive our people as a source of our success;\nStrive for excellence – We strive for the highest standards of excellence and continuously learn. We take pride in our engineering and accomplishments;\nAct as a team – We treat one another with respect and encourage the best ideas to come from anywhere within the organization. We value our diversity;\nFocus on Customers – We build long term customer relationships, as we strive to always understand our customers' business and needs;\nAct with integrity – We operate legally, honestly and ethically. We take responsibility for our actions.\nResponsibilities\n• Design and develop the public APIs and internal library services\n• Implement new feature, bug fixing, and performance tuning\n• Work closely with the Frontend and Engine teams to integrate new features and unique consumer-facing products\n• Explore and evaluate new stack components and architecture ideas as necessary\n• Review code regularly\n• Collaborate with product managers & designers, prototyping and bringing breakthrough experiences to our users\n• Add strength to our engineering culture by meeting & setting new standards of engineering, via participating in code review, team discussion & leading by example with solid coding practices\n• Guarantee a smooth user experience by writing well tested & highly performant code\n• Develop the BitMEX React Native mobile application\n• Develop native iOS components for the React Native application\n• Maintain, scale, and perform tuning for iOS\n• Mentor other engineers on coding practices, design philosophies, and engineering craft\n• Explore and evaluate new stack components and architecture ideas as necessary\n• Android experience is a plus\nRequirements\n• Bachelor degree in Computer Science, Engineering or a related subject\n• Senior Software Engineer - At least 6-8 years of iOS development experience with Javascript and/or React Native\n• Software Engineer - At least 4-6 years of iOS development experience with Javascript and/or React Native\n• Significant experience scaling iOS applications to a large diversity of devices\n• Experience with mobile end-to-end testing\n• Experience making complex, data-driven products accessible to consumers\n• Ability to simultaneously develop several products and concepts in development\n• Familiarity with current UX trends and curiosity for new UX concepts (conversational UI, etc)\n• Demonstrable ability to work in small teams and is willing to take ownership over product features\n• Detail oriented, able to focus, and is comfortable submerging into the depths of code in order to emerge with new insights & a way forward\n• Have passion for technological innovation, with a keen interest in what’s happening in the crypto space\n• Fluent in written and verbal English\n• Ability to communicate at all levels, with both business and technology staff\n• Ability to work independently\n• Open minded, eager to learn and self-motivated\n• Good understanding of Agile methodologies, especially Scrum\nNice to have\n• Familiar with API performance improvements\n• Experience building scalable systems that deliver real-time data over the web\n• Working with databases, AWS/Azure/Cloud\nWe offer\n• Friendly team and enjoyable working environment\n• Work-life balance and flexible schedule\n• Online training library, mentoring, career development and potential partial grant of certification\n• Unlimited access to LinkedIn learning solutions\n• Referral bonuses\n• Compensation for sick leave and paid time off\n• Opportunities for self-realization", "extensions": ["13 days ago", "Full–time"], "detected_extensions": {"posted_at": "13 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgRW5naW5lZXIgKE1vYmlsZSArIFJlYWN0IE5hdGl2ZSkiLCJjb21wYW55X25hbWUiOiJFUEFNIFN5c3RlbXMiLCJjb21wYW55X21pZCI6Ii9tLzBkbG5yYyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IkN0ZlEzaVZuNGFUbFlpZnBBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1SUJDcUlCUVU1VlgwNXhVbU5qWjNWRU1rbG9lRXQzZDFOSVR5MXRMVUl0WDBoNFZDMUVOa010WlZGVlpVWkxSVlJFVFhvdFNrZ3dMV055WlhBMlYyRlVZelp4VjJkTFNGSkxia1ZIWnpOa2RtcEtha3hHT1dkV1VUZE9WbTF4YVdadU9WVTFWVjlJVXpablFYTnpYMlphUjNGaFJEQmlTRFZNYzFwQ1ZTMWxkbWc1UVVJMVNHUndTM2hJY21GT00wSnRaWFp6U0ZkMVdWSllaamhLUW5aRFRtNXJZbTluRWhkeU16WkRXVWt6T1UxTlEydzFUbTlRY2sxUE56SkJTUm9pUVU5TldWSjNRVmcwWkROUFpGcFNNRzl3U1RSUVFub3RWa1pEZEhGRFF6RkVRUSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzciLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQmF5dC5jb20iLCJsaW5rIjoiaHR0cHM6Ly93d3cuYmF5dC5jb20vZW4vc2luZ2Fwb3JlL2pvYnMvc2VuaW9yLXNvZnR3YXJlLWVuZ2luZWVyLW1vYmlsZS1yZWFjdC1uYXRpdmUtNTk0MTE5OTAvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Software Development Manager", "company_name": "Autodesk", "location": "Singapore", "via": "via Monster", "description": "Job Requisition ID #21WD45853\nPosition Overview\nThe position is part of Autodesk strategic investment on Data and Process Management. Our mission is to deliver on the convergence of data and processes across the product development and manufacturing business. We want to bring together a unified data and process strategy and execution. This position will manage a development team in Singapore working with teams in other geos such as US and China.\nResponsibilities\n• Lead the team of software engineers working within Scrum framework on high quality solutions in response to emerging requirements\n• Manage the performance of your team by communicating clear organizational goals and removing impediments\n• Inspire and motivate team members to improve productivity and foster creativity while maintaining healthy work-life balance\n• Promote a culture of continuous improvement through ongoing feedback, coaching and tracking the performance. Support individual training and career development\n•... Oversee both the software development process and technology to help make the right decisions while driving the improvements and adjustments\n• Work with product managers, product owners, software architects and key stakeholders to draft release plans for product delivery\n• Foster cross-team collaboration to accomplish organizational goals\n• Be a spokesperson for the team and champion their accomplishments with upper management and adjacent teams\n• Partner with HR and other business partners to build and maintain a high performing team\n• Coordinate with others within own team and within Autodesk, on engineering best practices and dependencies\n• Assist in promoting Agile best practices within the team\n• Communicate the status of projects to stakeholders\n\nMinimum Qualifications\n• 5+ years of experience in managing development teams, or other similar leadership role\n• Deep understanding of all phases of SDLC\n• Excellent communication skills, ability to state complex subjects simply for a variety of audiences\n• Self-starter who can come up to speed quickly and identify the problems that need to be solved\n• Experience and well-verse in leading in an Agile development environment. Certification in Agile Methodologies or related training an advantage\n• Familiarity with web technology stack, cloud computing and cloud database technologies an advantage\n• Understanding of Data Management and PLM\n\n#LI-POST\nAt Autodesk, we're building a diverse workplace and an inclusive culture to give more people the chance to imagine, design, and make a better world. Autodesk is proud to be an equal opportunity employer and considers all qualified applicants for employment without regard to race, color, religion, age, sex, sexual orientation, gender, gender identity, national origin, disability, veteran status or any other legally protected characteristic. We also consider for employment all qualified applicants regardless of criminal histories, consistent with applicable law.Are you an existing contractor or consultant with Autodesk? Please search for open jobs and apply internally (not on this external site). If you have any questions or require support, contact ", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBEZXZlbG9wbWVudCBNYW5hZ2VyIiwiY29tcGFueV9uYW1lIjoiQXV0b2Rlc2siLCJjb21wYW55X21pZCI6Ii9tLzAxOG5tMyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjNkSzllYnBwdVNmM3cxVkhBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1SUJDcUlCUVU1VlgwNXhVMHQyVHpWMVRqaGhXR0ppZFhkSlIxWnNNVlZ1UkhGUVVGQmtialY1VmxRMVRFdGlOMkp5YkhWM2EwUk9SR2Q1YUdKeWMwa3RMV3hDY0hCNFgzZFFSM0IxT1RSeGVtWmpjVTFXUzFsSVpGbG1PR1pVTTIxVlF6UlJhMEpuYUc1RmExVklObTFKWDNsVk1VRkdSWFpFVEdobVVESkxibk4wZW10dFRrbHplSFJSYTA1TlZtZHNXVkpTY1RsZmJsOVlhVWxMZEhodE9WOWtNbWRuRWhkeU16WkRXVWt6T1UxTlEydzFUbTlRY2sxUE56SkJTUm9pUVU5TldWSjNRMDkxVmxReFVHRmlVVE5XYzJoTGRXZFFZbXhJTUhrMlJuTlRVUSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzE1IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1vbnN0ZXIiLCJsaW5rIjoiaHR0cHM6Ly93d3cubW9uc3Rlci5jb20uc2cvam9iL3NvZnR3YXJlLWRldmVsb3BtZW50LW1hbmFnZXItYXV0b2Rlc2stc2luZ2Fwb3JlLTI1NTAyMDA/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Senior Frontend Engineer (based in Vietnam)", "company_name": "Zühlke Engineering AG", "location": "Singapore", "via": "via WhatJobs", "description": "The Zuhlke Opportunity.\nThrive in an environment where you can express your passion and enthusiasm for software development and be inspired by your colleagues’ enthusiasm. As a Senior Frontend Engineer, you will cooperate with interdisciplinary teams in projects and experience how technology and team spirit unite to create innovative solutions.\n\nAs part of the pioneer team, you will have the unique opportunity to be onboarded by our high performing Singapore-based colleagues for three months. On top of experiencing the sights and sounds of another vibrant city, you will also receive mentorship within teams who have diverse technical knowledge. And of course, this is only to kickstart your long-term success upon your return home.\n\nOur reputation is fundamental to our business, so our culture emphasizes quality, reliability, and respect. We value learning new technologies and skills thus, we invest in a generous local training budget to attend conferences, participate in certified... courses, and our annual technical camp is a lot of fun.\n\nYour Talent. You have a degree in computer science or an equivalent related field (bachelor's/master's). You have professional experience in ReactJS for at least 3-5 years. You have proven expertise in the JavaScript ecosystem (Es, Typescript) and frameworks like ReactJS and its ecosystem (Redux, ES6, CodePush) where you apply your in-depth knowledge to build highly responsive user interfaces or progressive web applications which integrate with REST APIs AJAX and JSON. You have strong knowledge in development (IDEA, Storybook), state management (Redux), and application architectures (Flux). You have multiple years of experience with state-of-the-art web architectures and enjoy developing modern web applications where you design, develop, and maintain code that meets requirements, is high quality, and performs efficiently and effectively to provide a great customer experience. You value high quality code standards, and your implementation includes best practices with considerations of performance, security, scalability, and maintainability and you want to satisfy your thirst for knowledge of the latest technologies every day. You have good experience with Development and Operations (DevOps), using continuous integration (CI) and continuous delivery (CD) to ship incremental improvements and have used CI/CD tools such as git, GitHub, Jira, Jenkins, or equivalents. You have a thorough knowledge of building and deploying Full Stack applications, including experience in automated testing frameworks like Mocha, Jest and Enzyme or similar. You have professional experience working in an agile development environment where you lead the collaboration within internal application stakeholders, Infrastructure team and vendors/third-party services to deliver the full lifecycle, including requirements, architecture, design, development, testing, deployment and support. Ideally, you are a certified Scrum developer or master. You have strong communication skills, like making decisions, believe in continual improvement and investment in your knowledge and work independently. As a plus, you have experience in AWS cloud engineering & implementation As a plus, you have good understanding of digital banking products, processes, and retail banking systems.\nLife at Zuhlke.\nAt Zuhlke Asia you get the best of both worlds. You can leverage on the benefits of working in a stable, large, highly reputable company with a long history of success while enjoying the freedom and autonomy of working in a fast-growing start-up environment. Zuhlke offers you networked innovation power and the security of a long-running, international success story. We support your personal development with specialised workshops and active knowledge sharing among experts", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgRnJvbnRlbmQgRW5naW5lZXIgKGJhc2VkIGluIFZpZXRuYW0pIiwiY29tcGFueV9uYW1lIjoiWsO8aGxrZSBFbmdpbmVlcmluZyBBRyIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiRE5mUU1RRUdFTVhnYXNCLUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBXaGF0Sm9icyIsImxpbmsiOiJodHRwczovL2VuLXNnLndoYXRqb2JzLmNvbS9qb2ItZm9yLVNlbmlvci1Gcm9udGVuZC1FbmdpbmVlci1iYXNlZC1WaWV0bmFtLWluLVNHLWNvb3AxNzU1ODg1MT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior Software Engineer", "company_name": "Cardinal Health", "location": "Singapore", "via": "via LinkedIn", "description": "Job Summary\n\nWork on software design, implementation, verification and coordinate with US software team and software vendors on software related projects. Ensure that all product development conforms to design specifications and coding standards for medical devices.\n\nResponsibilities\n• Support project team activities related to product development lifecycle, certification, and problem solving\n• Member of small project development team\n• Design and develop web-based solutions\n• Work on technical problems related web development\n• Comfortable with doing both frontend and backend work\n• Participate in design & code reviews\n• Support validation activities per organization policies and procedures\n• Create technical deliverables and provide technical Subject Matter Expertise\n• Participate in Agile development lifecycle methodology, code configuration management process and code deployment process\n• Provide input into technical design & implementation and system configuration management\n•... Generate and maintain technical documentation required to support design control requirement and regulatory submissions\n• Work closely with cross functional teams and external vendors to ensure timely project delivery\n\nRequirements\n• Bachelor’s degree in computer science, web development or equivalent is required\n• Minimum 3 years web application development experience in Java/Kotlin, JavaScript\n• Experience working in medical device industry is advantageous\n• Experience in Spring Boot, Git and API integration\n• Knowledge of software integration testing\n• Basic cybersecurity knowledge\n• Familiarity with cloud computing\n• Vue.js framework and Database experience is preferred\n• Agile environment is preferred\n• Swift/IOS and/or Android development for mobile development is preferred\n• Team player qualities and good interpersonal skills\n\nCardinal Health is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, ancestry, age, physical or mental disability, sex, sexual orientation, gender identity/expression, pregnancy, veteran status, marital status, creed, status with regard to public assistance, genetic status or any other status protected by federal, state or local law", "extensions": ["20 days ago", "Full–time"], "detected_extensions": {"posted_at": "20 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgRW5naW5lZXIiLCJjb21wYW55X25hbWUiOiJDYXJkaW5hbCBIZWFsdGgiLCJjb21wYW55X21pZCI6Ii9tLzA0MHZ6eCIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IlBsbVRjMWQzbVpkc2pFcXZBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1SUJDcUlCUVU1VlgwNXhWRE13UWtkVE5IaGxaRFZqYkZGZk0yaEJSazFVTTNweFYySnJhRzA1YWkxWkxXRnlNRzVSVXpKNFRVeFBSRlp5VkhCbVkwMW9VV2cwYWpkWU1sUjROVWhsU1ZjMFJHWkZOVWRKYWtwRWIzcHBhRVZoZW5sQmIyZERNSGRsWW1WSk5HOXRUREpqUTI1R1RXaERhRFI0YjNOT1YxTTJkalZpY0VrNE1UQndZbWg2T1RKRFdHMVFhR3BTVVRaemJHaGxXbWhyWjB0WlZHcDFNMHRCRWhkeU16WkRXVWt6T1UxTlEydzFUbTlRY2sxUE56SkJTUm9pUVU5TldWSjNRbTFxZW1OM2FqaHFWM2QzYTJNd1pqbDZVM2MzVjNoU1JIbGZadyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzI3IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExpbmtlZEluIiwibGluayI6Imh0dHBzOi8vc2cubGlua2VkaW4uY29tL2pvYnMvdmlldy9zZW5pb3Itc29mdHdhcmUtZW5naW5lZXItYXQtY2FyZGluYWwtaGVhbHRoLTI0MzIxMjYwMzY/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Software Tester (1 year contract)", "company_name": "KPMG Singapore", "location": "Singapore (+1 other)", "via": "via KPMG Singapore | KPMG | SG", "description": "A Software Tester is responsible to,\n• Collaborate closely with stakeholders and project team to identify, analyze and review design needs and requirements for estimation of testing scope and time frame\n• Develop and establish quality assurance deliverables and testing framework, including create and maintain test plans and test cases in accordance with changing requirements, throughout development\n• Conduct extensive manual functional /exploratory testing, including browser testing\n• Conduct performance and load tests, validate the output and expected outcomes and feedback on improvement required\n• Conduct application performance and security testing to ensure we have a robust and secured system in place\n• Conduct impact analysis of defect fixes discovered during manual or automated tests and work with development team to improve the expected behaviour and test cases\n• Demonstrate the tested stories during Sprint Review and prepare production show case to show the completed stories... tested\n\nRequirements:\n• Tertiary Qualification in Information Security, Information Technology, Computer Science, Engineering (Computing/Telecommunication) or equivalent\n• Minimally 3-5 years of relevant working experience\n• Possess relevant software development certifications, e.g. Microsoft Certified Solution Developer for Dynamics or equivalent\n• Certified Software Testing Professional and/or Certified Software Quality Analyst or an equivalent certification will be an added advantage\n• Good understanding of waterfall or Agile methodology is preferred\n• Demonstrate programming language and knowledge of automated software testing methodologies such as unit testing, integration testing, functional testing, test driven development (TDD) and behaviour driven development (BDD)\n• Strong client and project management abilities coupled with excellent communication, written, analytical, organisational and problem-solving skills\n\nOnly shortlisted candidates will be contacted by KPMG Talent Acquisition team, personal data collected will be used for recruitment purposes only.\n\nAt KPMG in Singapore we are committed to creating a diverse and inclusive workplace. We believe that diversity of thought, background and experience strengthens relationships and delivers meaningful benefits to our people, our clients and communities. As an equal opportunity employer, all qualified applicants will receive consideration for employment regardless of age, race, gender identity or expression, colour, marital status, religion, sexual orientation, disability, or other non-merit factors. We celebrate the different talents that our people bring and support every staff member in their journey to achieve personal and professional growth. One of the ways we do this is through Take Charge: Flexi-work, our flexible working framework which enables agile and innovative teams to help deliver our business goals", "extensions": ["Over 1 month ago", "Contractor"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Contractor"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBUZXN0ZXIgKDEgeWVhciBjb250cmFjdCkiLCJjb21wYW55X25hbWUiOiJLUE1HIFNpbmdhcG9yZSIsImNvbXBhbnlfbWlkIjoiL2cvMTFkeHBzYjluciIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjJMUTlSanRlV2ZLek9DUUlBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2Y0JDcmNCUVU1VlgwNXhVMVpsZURGTFluQkpUVmhCYmxkYWJXNW1SVk5sVEU0eGMwNUJUbXhNZVhFMVVuWkpSVEZ5YUMxM1l6QnVkekJDYWxjME9YZFViMUZYTmkxSlpGcDZOREl5VEhRemJUVjNlRGxPYVV3emRrWktRVTgxZFRWSk5IVmtiMFZ1Tms1WmFXUnBWazF4ZEdack9VTTRUMXBMWVRCTmNXWTBSek5yUjNacloyOXVhRlpaTkhCTmNsZGpiV3BOZFdvMFFUUlFiV2swT0dZellYWTRaVFpZVDJoTFMxVXpMVjl2YlZCdlFXeDNVMncwV0Y4NEVoZHlNelpEV1Vrek9VMU5RMncxVG05UWNrMVBOekpCU1JvaVFVOU5XVkozUkdKV1RUSnhWWGhMYlhaVVluQkZYMEpZV1RseE0weHdlazQzZHciLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18zNCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBLUE1HIFNpbmdhcG9yZSB8IEtQTUcgfCBTRyIsImxpbmsiOiJodHRwczovL2NhcmVlcnMua3BtZy5jb20uc2cvZW4vam9iLzUwNDUyOC9zb2Z0d2FyZS10ZXN0ZXItMS15ZWFyLWNvbnRyYWN0P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Assistant Manager / Manager, Full Stack Developer", "company_name": "Changi Airport Group", "location": "Singapore (+1 other)", "via": "via Glassdoor", "description": "An exciting opportunity is waiting for you in the newly set up Digital Factory, who will spearhead the digital transformation efforts of Changi Airport Group. You will be working on Commercial and Operational digital applications and projects that will transform our business and bring customer experience to greater heights. You will be working in squads with fellow enthusiasts, re-imagining how we serve our connected customers. As a digital disrupter, you’ll recreate and redefine our business to generate lasting competitive advantage, focusing on building the applications for Changi’s existing / new digital products.\n\nYou will be responsible for the below areas:\n• Produce HTML/CSS/JavaScript code from design documentation for integration into desktop and mobile websites and web applications.\n• Understand cross-browser and cross-platform concepts and concerns.\n• Ensure code and design quality through the execution of test plans.\n• Strong attention to detail and understanding of UX and... visual design concepts to provide leadership perspective on front and backend technologies and their overall impact on the creative process.\n• Work closely with internal and external design, business, and technical counterparts.\n• Adopt the agile approach: Develop, test, analyse and iterate the applications with the end objectives and key results in mind.\n\nRequirements:\n• A bachelor’s degree in a relevant computer science discipline.\n• 4-6 years in-depth knowledge and experience of front-end and backend development for consumer facing applications, including websites and mobile devices etc.\n• Ability to solve complex development problems and produce the highest quality code while striving to push the technical boundaries of online applications.\n• Familiar with AWS components and services, e.g. S3, API Gateway, Lambda Functions, etc. AWS Certified Solution Architect (Associate) preferred.\n• Familiar with AWS serverless components, e.g. implementing microservices using DynamoDB, SQS, Cognito, S3, Lambda, and Python coding.\n• Development and consumption of RESTful web APIs or web services\n• Strong understanding of W3C and accessibility guidelines\n• HTML, XHTML, HTML5, CSS, Web graphic production\n• AJAX / JavaScript / jQuery\n• Responsive Design and grid frameworks (Bootstrap, Foundation, etc", "extensions": ["5 days ago", "Full–time"], "detected_extensions": {"posted_at": "5 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBc3Npc3RhbnQgTWFuYWdlciAvIE1hbmFnZXIsIEZ1bGwgU3RhY2sgRGV2ZWxvcGVyIiwiY29tcGFueV9uYW1lIjoiQ2hhbmdpIEFpcnBvcnQgR3JvdXAiLCJjb21wYW55X21pZCI6Ii9tLzA2dzMxOWgiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJMSHJiY3dmaVNxbFFpQXMwQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdmNCQ3JjQlFVNVZYMDV4VW1wSllqZEpOVWRITkhsRmFqaGZUbkZNYkRVMFRraE1jMUZyYzFGMFJVdEtNRXRsVW1VNWRGOXFNMjVoZDJSeFNHaDJja3BJZWtvMVlVNTJhRmN6U1UxWWQwWkNXRWRqWXpGNWMwSTJhRnBzVGxoalgwMTBPRnBQVTBOQ2NVSTRORVpPTFd4WWNuYzJRMkV5VFRoM2JuTnRiM0JLTjJwYVFWOHdlbTVLVTFkTFpqSnVMVWxvVnpGcE4wNXFUSFo2VlVwd1MxWTVTRjlWTjI1UVYydERPVGRDVWw4MVQyeEdlV1ZGWjFGUVQwbzBFaGR5TXpaRFdVa3pPVTFOUTJ3MVRtOVFjazFQTnpKQlNSb2lRVTlOV1ZKM1JDMU1SMkpZU2xaWFZVcHdRM2RGTjNFdFdEUjBWSGgwWTJWVFFRIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNDEiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gR2xhc3Nkb29yIiwibGluayI6Imh0dHBzOi8vd3d3LmdsYXNzZG9vci5zZy9qb2ItbGlzdGluZy9hc3Npc3RhbnQtbWFuYWdlci1tYW5hZ2VyLWZ1bGwtc3RhY2stZGV2ZWxvcGVyLWNoYW5naS1haXJwb3J0LWdyb3VwLUpWX0lDMzIzNTkyMV9LTzAsNDZfS0U0Nyw2Ny5odG0/amw9MzgwNTQ3MDUwNlx1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Software Engineer/ Associate Consultant/ Lead Engineer/ Senior Software Engineer/ Consultant - Teradata (BB-E6B65)", "company_name": "HCL SINGAPORE PTE. LTD.", "location": "Singapore (+1 other)", "via": "via BeBee", "description": "Roles & ResponsibilitiesShould be able to study Mapping documents and create Transformation rules in SQL.Sound knowledge of financial service logical data model (Teradata FSLDM)Work closely with Business Users to convert the business requirement into Technical Requirement.Should be able to create Mapping documents for FSLDM and doswnstreamDesign Data Modeling based on business requirementDesign and document development standardsGuide/motivate Team members as requiredLead onshore and offshore teamProvide Project Status update to management and clientsSupport SIT/UAT and Regression TestingCode and ETL mapping ReviewPropose design to create and schedule ETL jobs using Control MUser and Client meetingsEnd to End responsible for Technical DeliverablesExperience in SDLC processGood Communication, Flexibility and commitmentMust be able to work on multiple projects simultaneously, meet project deadlines, and work under tight timelinesTeradata SQL Query WritingUnixData StageTeradata... Utilities(BTEQ,Fast Load,Multi Load)FSLDMControl M GOOD to HAVEBachelors Degree in Engineering/Masters in EngineeringM.SC(in CS),M.C.A Technical / Professional SkillsComplete Software Development Lifecycle experienceGood communication and interpersonal skills GOOD to HAVETeradata Certification Non-Technical / Soft SkillsExcellent Communication skills & a team playerProven ability to work with people from different culturesAbility to handle customer and deliver the assigned task independentlyHigh level presentation and interpersonal skillsAbility to work on assigned tasks independently and execute with minimal directionTell employers what skills you haveBasics of UnixData ModelingETLETL ToolsFinancial ServicesSDLCSQLTeradataTeradata Data WarehouseUnixdesignedbusiness requirementdevelopment standardsData modeldesign document", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlci8gQXNzb2NpYXRlIENvbnN1bHRhbnQvIExlYWQgRW5naW5lZXIvIFNlbmlvciBTb2Z0d2FyZSBFbmdpbmVlci8gQ29uc3VsdGFudCAtIFRlcmFkYXRhIChCQi1FNkI2NSkiLCJjb21wYW55X25hbWUiOiJIQ0wgU0lOR0FQT1JFIFBURS4gTFRELiIsImNvbXBhbnlfbWlkIjoiL2cvMTFmeTI1bmdzdiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Il90aXRFZl95Qkg3WHVuNHVBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVvd0NDc3dCUVU1VlgwNXhVVk5YUm5wVFNXVmtPSEJvWlc5NWVFc3laV05DV1ZOalozUTNiMkZYTWpCUExUTTNSV1ZHVWt4WFdXaExNSGR3V0RCWGREa3pObGhGTTNOSFVIUjRNbVJDWmpCM1VVcEdTMkZ2WjNSVGRFZHNTSE51YTB0cU5YSjBSVk52UjBkSGFqRnFRVEppVmpSRFRXRndOVmgwVjNWbGIzQlVOM0kxWDE5b1oycFdTVzF0VkUwNFpsWXlTeTFLZDBsRWMzZHRNRWhJUVhVMk1HcGhZbEk0WTBOdWRXcFhVRTFYYjFKMWMydEVTVXR1VFhScmIxcERkamxwWDJ0RmVrZDJNWGMzYms1d1FYSk9FaGR5TXpaRFdVa3pPVTFOUTJ3MVRtOVFjazFQTnpKQlNSb2lRVTlOV1ZKM1FuUjZTRVJGYTFOcE9FSjFhMVpXWlhKTlRXNVJURVZPY0hGMFp3IiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNDgiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQmVCZWUiLCJsaW5rIjoiaHR0cHM6Ly9zZy5iZWJlZS5jb20vam9iLzIwMjEwNDE3LWI2MmM3NTk2NmMxMjhlZmQ3OWY1MDhmM2E4NmU2YjY1P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "RPA Developer", "company_name": "None", "location": "Singapore", "via": "via Jobs | Fidanto", "description": "RPA DEVELOPER Avensys is a reputed global IT professional services company headquartered in Singapore. Our service spectrum includes enterprise solution consulting, business intelligence, business process automation and managed services. Given our decade of success we have evolved to become one of the top trusted providers in Singapore and service a client base across banking and financial services, insurance, information technology, healthcare, retail and supply chain.We are currently looking to hire a RPA Developer to be a part of Avensys Enterprise Solutions Team. This is an exciting opportunity for all who aspire to pursue their career in Robotic Process Automatics. More details as below.ROLES AND RESPONSIBILITIES Proven expertise in process automation and deliver resolution on complex issues and challenges experienced by RPA automation Sprints in quick turnaround time. Efficient and quick problem-solving skills required in supporting RPA automation sprints in operation on a... day-to-day basis covering Blue Prism , Automation Anywhere platforms, SAP Scripts, Excel macros, .NET, C#, SQL Stored Procedure, ABBYY, Python, Power BI and providing timely responses and solutions as required. Supporting existing processes and development / deployment of change requirements as part of a structured change control process Develops and support automation processes as per the technical design document (TDD) to meet the defined requirements. Complies with and helps to enforce design and coding standards, policies, and procedures. Analyzing, understanding, and documenting the business processes in detail where required Develops new processes/tasks/objects using core workflow principles that are efficient, well structured, maintainable, and easy to understand. Update PDD/SDD/TDD, Operating manual, UAT TC and support documents as required. Own end to end delivery of new RPA sprints or change request as per design document. Ensures documentation is created well and maintained. Identifies the defects in production that are traced back to process design, dev phases and ensures quality of coded components by performing thorough unit testing. Works collaboratively with teams during the product test and UAT phases and ensure the quality code and solution delivered as per SDD and TDD. Working within project planning constraints, communicating any identified project risks and issues to the delivery/project manager accordingly and providing inputs to the change control process. Creating and documenting test procedures and scenarios for the pre-UAT phases REQUIREMENTS The candidate should possess the following qualifications, skills and experience: 3+ years of overall IT experience Overall 10 including mandatory 3+ Years hands-on in RPA Blue Prism, UiPath and Automation Anywhere development Certification in Blue Prism (Mandatory), UiPath and Automation anywhere preferred 3+ years hands on development / support experience in Blue Prism UiPath and Automation Anywhere 3+ years of experience and strong software development background SQL SP, .Net, VBA, C#, Java scripts,Node.js, ABBYY, SAP Scripts, Excel macros, OCR Tools Very strong problem-solving skills a critical input for the position Exceptional business collaboration skills and flair on management of customer aspirations on automation delivery is essential. Experience in Python, Chatbot, Watson and other AI and other ML technologies will be added advantage. Ability to work in high pressure environments. Excellent technical abilities, communication skills, and adaptability to new technology Understands software development methodology including Agile, configuration management and lifecycle. WHAT'S ON OFFER You will be remunerated with an excellent base salary and entitled to attractive benefits. Additionally, you will get the opportunity to enjoy a fun and collaborative work environment.To submit your application, please apply online or email your UPDATED CV in Microsoft Word format to joy@aven-sys.com. Your interest will be treated with strict confidentiality.CONSULTANT DETAILS Consultant Name : Joy LimTitle: Operations & HR AssociateAvensys Consulting Pte Ltd EA License: 12C5759Privacy Statement: Data collected will be used for recruitment purposes only. Personal data provided will be used strictly in accordance with the relevant data protection law and Avensys' privacy policy. Privacy Statement", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJSUEEgRGV2ZWxvcGVyIiwiY29tcGFueV9uYW1lIjoiTm9uZSIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiMXVTSjdVQ3owM0pzOGYtbkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIHwgRmlkYW50byIsImxpbmsiOiJodHRwczovL3NnLmZpZGFudG8uY29tL2pvYnMvam9iLW9wZW5pbmcvc29mdHdhcmUtZGV2ZWxvcGVycy1hcHBsaWNhdGlvbnMvcnBhLWRldmVsb3Blci0yNzU0NzgwNDA/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Assistant Manager - Senior Software Engineer", "company_name": "The Japan Research Institute, Limited", "location": "Singapore", "via": "via Monster", "description": "The Japan Research Institute (JRI) Limited is a subsidiary of Sumitomo Mitsui Financial Group (SMFG). SMFG is a Tokyo-based bank holding company that is ranked among the largest 25 banks globally by assets under management. JRI provides comprehensive, highly value-added information services through the coordinated application of its 3 functions i.e. information systems, consulting and think-tank. As a systems integrator, JRI offers services in IT strategy planning, implementation and outsourcing to a broad range of industries and activities. JRI Singapore currently supports the overall IT functions of Sumitomo Mitsui Banking Corporation (SMBC) in the Asia Pacific region.\n\nThe Role\n\nThis position reports to the Manager of the System Integration and Network Department. The incumbent will be part of the IT Quick Solution team (IT Innovation Team) to assist Banking IT operation in SMBC. The IT Quick Solution team is responsible for innovation / disruptive technology and improving IT... capabilities in the bank.\n\nResponsibilities\n• Responsible for development cycle and oversee implementation to ensure all delivery meet SMBC’s IT quality standards.\n• Enhance IT capabilities through automation and adoption of new emerging / disruptive technologies such as Containerization, Cloud, AI etc\n• Establish and develop DevSecOps tools and process for SMBC\n• Establish sound development practices\n• Part of a SWAT team to design and develop application for SMBC\n\nRequirements\n• Bachelor’s degree in Computer Science, related technical discipline or equivalent practical experience.\n• Min. 5 years of working experience in application development\n• Hands-on experience in Java, docker, Kubernetes / OpenShift and public cloud\n• Extensive experience in designing and implementing web-based application\n• Experience and has strong knowledge of RDBMS such as Oracle database, MS SQL, DB2, MySQL etc\n• Experience and well-verse in DevOps and workflow / process automation system would be an added advantage\n• Experience and knowledge in other emerging technologies such as RPA, AI, Data Analytics etc, would be an added advantage\n• A good team player with excellent communication, presentation and communication skills", "extensions": ["16 days ago", "Full–time"], "detected_extensions": {"posted_at": "16 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBc3Npc3RhbnQgTWFuYWdlciAtIFNlbmlvciBTb2Z0d2FyZSBFbmdpbmVlciIsImNvbXBhbnlfbmFtZSI6IlRoZSBKYXBhbiBSZXNlYXJjaCBJbnN0aXR1dGUsIExpbWl0ZWQiLCJjb21wYW55X21pZCI6Ii9nLzEyMTRtZ2xtIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoieVNpdlM3LXc5N2pqdXJQb0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXFJQ0N1SUJRVTVWWDA1eFUxTlVSVEF3U2pKV1VGOWpjMlIwZHkxUWQwZEVMVVY2VlZwdmJrZGpkMlZyZFV0V2JIZGZVVmd4YW5Wa05WSllMV1ZVWnpWUk0wMUlYMlZaTW1kSVRYTkhja3hzVGpWS1EycDRTRWxZVkRoSVNVNVFhVVZGVVVOeGFHbGliMGRtTVdwZmNFdEVZbTkwWkVoa2RrdFpMVXB6VURWQlNFVkdaVTFZUTFkc1oyMTFkbkpRWVdSTVdUTmxhM1ZoVlhabExYYzBZM0Z5ZFhSWFdIVnpOSGd4Wm5sTVVWVmhlbVJsZDI1cGIydGtiMFUxWTFabFQzTjNkR1F3TkZWRE4ydHJWM0ZKZWxSWmQxaDBSVU5TUkVGMVNsb3RhVEJCZVY5MFgwMXVaeElYY2pNMlExbEpNemxOVFVOc05VNXZVSEpOVHpjeVFVa2FJa0ZQVFZsU2QwSkNNMmxtYUhGWlRIQkxhRkZVZUVvM1pHeG1VVGwyYXpWeVVuYyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzU5IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1vbnN0ZXIiLCJsaW5rIjoiaHR0cHM6Ly93d3cubW9uc3Rlci5jb20uc2cvYW1wL2pvYi12YWNhbmN5LWFzc2lzdGFudC1tYW5hZ2VyLXNlbmlvci1zb2Z0d2FyZS1lbmdpbmVlci10aGUtamFwYW4tcmVzZWFyY2gtaW5zdGl0dXRlLWxpbWl0ZWQtc2luZ2Fwb3JlLTI3MjE0MjM5Lmh0bWw/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Cloud Native Security Architect (DevSecOps)", "company_name": "Pivotal Software", "location": "Singapore", "via": "via Glassdoor", "description": "About Us\n\nDell Technologies unites seven technology leaders – Dell, Dell EMC, Pivotal, RSA, Secureworks, Virtustream and VMware – in one company with the power to drive digital transformation and generate real results every day for the customers and people who partner with us.\n\nPivotal Software, Inc. combines platform, tools, and methodology to help the world's largest companies transform the way they build software and run their most strategic applications. Our technology is used by Global 2000 companies and developers to give software development and IT operations a strategic advantage. Founded in 2013, Pivotal unleashes software-developer productivity and creates an environment for innovation to scale, while fulfilling our mission to transform how the world builds software.\n\nYou\n• Responsible to challenge the status quo in applying security in the cloud ecosystem using unique features provided by the platform.\n• Have expertise in changing the software development lifecycle and want... to be part of the next wave of cloud-native applications.\n• Have extensive knowledge of the software development landscape to help the sales and field engineering teams to propose the most optimal solutions for our customers.\n• Have the desire and ability to travel within your assigned territory.\n• Above all, have a customer-focused mindset and are a hands-on technical expert to support the sales activities in your region.\n• Has a bias for action and can break down complex problems into steps that drive customer interest in Pivotal technologies\n\nUs\n\nThere is a paradigm shift towards cloud-native technologies and methodologies calling for new capabilities. As part of Dell Technologies, this initiative focuses on uplifting the Cloud Native Ecosystem in Singapore and enabling our enterprise customers in Singapore and the regional economies.\n\nYour Day\n• This will be an Area level role. Your job will be to provide thought leadership in the area of cybersecurity to the Pivotal Field Team(s) & customers.\n• Present Pivotal vision, strategy & product roadmaps to executives & technical management, especially as it related to Cybersecurity\n• Provide expert technical support for opportunities involving Pivotal Cloud Foundry\n• Maintain deep technical & business knowledge of technology security trends\n• Maintain working knowledge of competitor products & how to technically sell against them\n• Work collaboratively with Product Management, Technical Marketing & Engineering during the development, launch & continuing refinement of Pivotal products.\n• Keep up to date with the latest security and technology developments\n\nRequired Skills / Experiences\n• Deep knowledge of the IT security solutions landscape, information security principles and practices, and industry trends in security.\n• Experience in Security Design and Architecture\n• Familiarity with vulnerability and penetration testing and analysis\n• Familiarity with industry regulations and security compliance standards such as PCI, HIPPA, etc.\n• Liaise with stakeholders in relation to cybersecurity issues and provide future recommendations\n• Excellent communication skills, both written and oral are required\n• Willing to travel and work on-site with customers\n\nDesired Skills / Experiences\n• 5+ years of full-time experience in dedicated, technical information security roles.\n• Understanding of PaaS offerings such as Cloud Foundry, Azure Service Fabric\n• A Bachelor's Degree in Computer Science, Engineering, Mathematics, related field or equivalent experience\n• Having a technical certification in Security is a plus. This would include but not be limited to:\n• CISSP: Certified Information Systems Security Professional\n• CISM: Certified Information Security Manager\n• CompTIA Security+\n• CEH: Certified Ethical Hacker\n• GSEC: SANS GIAC Security Essentials\n\nPivotal is an Equal Employment Opportunity employer that will consider all qualified applicants, regardless of race, color, religion, gender, sexual orientation, marital status, gender identity or expression, national origin, genetics, age, disability status, protected veteran status, or any other characteristic protected by applicable law", "extensions": ["5 days ago", "Full–time"], "detected_extensions": {"posted_at": "5 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDbG91ZCBOYXRpdmUgU2VjdXJpdHkgQXJjaGl0ZWN0IChEZXZTZWNPcHMpIiwiY29tcGFueV9uYW1lIjoiUGl2b3RhbCBTb2Z0d2FyZSIsImNvbXBhbnlfbWlkIjoiL20vMHcxZnlmdyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IlY3MkVwZUlxbTJUbTlMUTVBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2Y0JDcmNCUVU1VlgwNXhVblJPVkdjdGNsOVFkemgxZVhSVWRVaDRibEZ5VG1KNE5WRTBTbkJVUmpoeldXNW9MVVY1Vm10a1NFRlNOVGsyUzNaV1JucDFjVTVQUVVSV2NFNURiMGR5UmpaUVJUTnZSa0pPZW1SRVVDMXNOMWhrVFZWTWJtaFRha1pCVmtodlYzaG1jR3BPYUdWVlRHUktka05CTTBsUFRtMUZVMjV1TTB0MWRqTTFSMWhLZWpoc2Rtd3lOREJKU2tob2VuQlFUazlTUTBOc1ZqVm5hRWh5T0hCclIxWnhUbXRZTjJVdFEyUkxjWHBYUzNGQkVoZHlNelpEV1Vrek9VMU5RMncxVG05UWNrMVBOekpCU1JvaVFVOU5XVkozUVUxSGNFc3RhVzFUYldWVFlreDNaV0ZMZWsxRFRtVTFYemRQWnciLCJmY3YiOiIzIiwiZmNfaWQiOiJmY182NyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBHbGFzc2Rvb3IiLCJsaW5rIjoiaHR0cHM6Ly93d3cuZ2xhc3Nkb29yLnNnL2pvYi1saXN0aW5nL2Nsb3VkLW5hdGl2ZS1zZWN1cml0eS1hcmNoaXRlY3QtZGV2c2Vjb3BzLXBpdm90YWwtc29mdHdhcmUtSlZfSUMzMjM1OTIxX0tPMCw0MV9LRTQyLDU4Lmh0bT9qbD0zMzg4MTIzNTM0XHUwMDI2dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}], "chips": [{"type": "Title", "param": "job_family_1", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Software engineer", "value": "software engineer"}, {"text": "Senior", "value": "senior"}, {"text": "Test engineer", "value": "test engineer"}, {"text": "Cloud engineer", "value": "cloud engineer"}, {"text": "Engineer", "value": "engineer"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Assurance engineer", "value": "assurance engineer"}, {"text": "Programmer", "value": "programmer"}, {"text": "Coach", "value": "coach"}, {"text": "Qa engineer", "value": "qa engineer"}, {"text": "Devops engineer", "value": "devops engineer"}, {"text": "Frontend engineer", "value": "frontend engineer"}, {"text": "Java engineer", "value": "java engineer"}, {"text": "Solutions engineer", "value": "solutions engineer"}, {"text": "Testing engineer", "value": "testing engineer"}, {"text": "Analyst", "value": "analyst"}, {"text": "Data engineer", "value": "data engineer"}, {"text": "Design engineer", "value": "design engineer"}, {"text": "Development manager", "value": "development manager"}, {"text": "Devops consultant", "value": "devops consultant"}, {"text": "Firmware engineer", "value": "firmware engineer"}, {"text": "Lecturer", "value": "lecturer"}, {"text": "Manager", "value": "manager"}, {"text": "Network systems", "value": "network systems"}, {"text": "Principal", "value": "principal"}, {"text": "Principal engineer", "value": "principal engineer"}, {"text": "Quality engineer", "value": "quality engineer"}, {"text": "Science", "value": "science"}, {"text": "Scrum master", "value": "scrum master"}, {"text": "Security architect", "value": "security architect"}, {"text": "Security engineer", "value": "security engineer"}, {"text": "Senior engineer", "value": "senior engineer"}, {"text": "Senior lecturer", "value": "senior lecturer"}, {"text": "Senior system", "value": "senior system"}, {"text": "Senior technical", "value": "senior technical"}, {"text": "Software architect", "value": "software architect"}, {"text": "Specialist", "value": "specialist"}, {"text": "Stack engineer", "value": "stack engineer"}, {"text": "System engineer", "value": "system engineer"}, {"text": "Technical", "value": "technical"}, {"text": "Trainee", "value": "trainee"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Wholesale", "value": "/business/naics2007/42"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Mining", "value": "/business/naics2007/21"}, {"text": "Rental", "value": "/business/naics2007/532"}, {"text": "Retail", "value": "/business/naics2007/44"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": ".AB4Jjf.qPB6Vc{padding-right:11px}.qfpP8d{padding:7px 0 7px 11px}.S003Ke{flex:none}.ZoN4Lb{color:rgba(0,0,0,.54)}.nAXVG{color:#70757a}.IxQsL{color:rgba(0,0,0,.26)}.xFO1De{color:#fff}.ooFpK{color:rgba(255,255,255,.30)}.mtnwac{color:#4285f4}.WxeeKb{color:#34a853}.hIVRU{color:#f29900}.EXaTMc{color:#fbbc04}.sxn46d{color:#000}.gqMTF{color:#1a73e8}.zpn8Mb{color:#d93025}.dEUPmd{color:#1e8e3e}.PJNo1{color:#fbbc04}Actively Hiring", "value": "e"}, {"text": "EPAM", "value": "/m/0dlnrc"}, {"text": "VISA", "value": "/m/01kqjn"}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Zühlke", "value": "/g/1hh_rg216"}, {"text": "Cardinal Health", "value": "/m/040vzx"}, {"text": "Credit Agricole Group", "value": "/m/028vbm"}, {"text": "GlobalTix Pte Ltd", "value": "/g/11dxpqdhrf"}, {"text": "HCL SINGAPORE PTE. LTD.", "value": "/g/11fy25ngsv"}, {"text": "Jobline Resources Pte Ltd", "value": "/g/11gp2647pn"}, {"text": "Mediacorp", "value": "/m/03qtz1"}, {"text": "Realtek", "value": "/m/05wrm7"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "TECHNOPALS PTE. LTD.", "value": "/g/11dxpvkynp"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "Thales", "value": "/m/01phj4"}, {"text": "UST", "value": "/m/08kb8g"}, {"text": "UrbanFox", "value": "/g/11ghs7y0w6"}, {"text": "Activate Interactive", "value": "/g/11dxq192l5"}, {"text": "Cognizant", "value": "/m/03bf9h"}, {"text": "DELL", "value": "/m/0py9b"}, {"text": "HCL Technologies", "value": "/m/0698gv"}, {"text": "ORACLE", "value": "/m/05njw"}, {"text": "PUBLICIS SAPIENT", "value": "/m/09n8_2k"}, {"text": "Singapore Press Holdings Limited", "value": "/m/0d7mwh"}, {"text": "Temasek Polytechnic", "value": "/m/098s73"}, {"text": "TikTok", "value": "/g/11fy265933"}, {"text": "Zendesk", "value": "/m/0wkm4pl"}, {"text": "A-it Software Services Pte Ltd", "value": "/g/11dxpy_gl_"}, {"text": "ACCENTURE PTE LTD", "value": "/m/09n8w94"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "Adecco GS", "value": "/m/08gz46"}, {"text": "Atidan Technologies", "value": "/g/11c74f0b8_"}, {"text": "Autodesk", "value": "/m/018nm3"}, {"text": "Avnet", "value": "/m/0c8xmc"}]}]}