{"search_metadata": {"id": "60827a980a90c71ddfe63d2e", "status": "Success", "json_endpoint": "https://serpapi.com/searches/9ef6e674ea0f4272/60827a980a90c71ddfe63d2e.json", "created_at": "2021-04-23 07:43:20 UTC", "processed_at": "2021-04-23 07:43:20 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28data+analyst%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=120", "raw_html_file": "https://serpapi.com/searches/9ef6e674ea0f4272/60827a980a90c71ddfe63d2e.html", "total_time_taken": 0.95}, "search_parameters": {"q": "(data analyst) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "120"}, "jobs_results": [{"title": "NEXTDIGITAL2020 - Senior - Technical Project Manager - Data Analytics", "company_name": "SingTel", "location": "Singapore", "via": "via Monster", "description": "Job Description :\nAbout NCS\nNCS is a leading information and communications technology (ICT) and communications engineering services provider across the Asia-Pacific region. We are headquartered in Singapore and a wholly owned subsidiary of the Singtel Group. We have in-depth domain knowledge and unique capabilities that create business value for customers. We offer a broad range of services, including consulting, systems development and integration, business process outsourcing, infrastructure management and solutions, and technology solutions.\nWhat is the opportunity?\nNCS is seeking a Project Manager with Data Analytics focus! You will identify and translate market and business opportunities for our clients into actionable recommendations for the organisation. You will lead the design, development and delivery of complex digital analytics projects from initiation to closure. To achieve this, you will need to be a leader who can articulate a compelling vision to your client and team... and sure that this vision is delivered through all stages of the project.\nYou should also have a healthy appetite for exploring new technology and developing business cases to support enterprise wide data analytics solutions.\nWhat will you do?\n• Oversee the implementation of data analytics strategy for a client organisation, and develop new service offerings\n• Client-facing interaction including providing analyses, recommendations, presentations and advice to clients\n• Lead the day-to-day activities of the delivery teams through the developing, establishing and maintaining project management standards and procedures. Adapts existing methods and procedures to create possible alternative solutions to moderately complex problems\n• Lead interdisciplinary teams that combine technical, business and data science competencies that deliver work in waterfall or agile software development lifecycle methodologies\n• Understands the strategic direction set by senior management as it relates to team goals\n• Uses considerable judgment to determine solution and seeks guidance on complex problems\n• Manage the timely reporting of data analysis outcomes and effectively communicates findings, insights and recommendations to business leaders using data metrics on top of standard project management measures such as data quality and model accuracy\n• Oversee team management including budgets, forecasting, work allocations and staffing\n• Drive effective performance management practices within the department in accordance with organisation policies and procedures\n\nWhat do you need to succeed?\n• Possess good communications skills to understand our customers core business objectives and build end-to-end data centric solutions to address them\n• A data analytics professional should have a deep passion for analysing and resolving complex problems through a systematic approach to deliver business outcomes. He displays an intellectual curiosity as well as the capability to engage with stakeholders to understand business issues.\n• Good critical thinking and problem-solving abilities, with curiosity to ask why and tenacity to find the root causes\n• Stay up to date with evolving analytics concepts and techniques including team management and project management processes\n• Ability to work independently and manage multiple tasks and projects\n\nMust-have:\n• Minimum of Bachelor's Degree required in related field; strong preference for fields of study in the engineering, computer science, statistics or analytics\n• The successful candidate needs to have either\n• more than 2 years of experience leading an Analytics consulting team OR\n• experience with leading one or more MNCs through the journey to becoming a data-driven organization. OR\n• More than 5 years of experience implementing a broad range of Analytics/Business Intelligence projects such as:\n• Data Governance and Management\n• visualizing KPIs on business dashboards\n• applying advanced analytics/data science techniques to realize business values\n• The right candidate will need to have hands-on experience with one or more of the following Analytics technology stacks as well as familiarity with a broad range of solutions for visualization, advanced analytics, data ingestion/transformation, storage and hosting and willingness to learn new ones on the job.\n• Data Management & Storage: Informatica, Oracle Data Warehousing, IBM InfoSphere, Microsoft SQL Server, Hortonworks Data Platform, Cloudera, SAS\n• Data Visualisation: Tableau, Qlik, Microsoft PowerBI, Oracle Business Intelligence Enterprise, IBM Cognos, MicroStrategy, SAS etc\n• Statistical/Data Science Tools: SPSS, R, Python, Anaconda distributions, Jupyter\n• Experience working with Singaporean clients, the Singapore government, familiarity with GDPR in Europe, PDPA in Singapore will be an advantage\n• Project management certifications such as PMP, Agile, ITIL, Scrum Master\n\nNice to have:\n• Knowledge in database modelling and data warehousing concepts\n• Appreciation of software engineering tools such as Java, .NET, or higher-level programming languages\n• Exposure in artificial intelligence – machine learning, deep learning, reinforcement learning\n• Experience in implementing Graph database analytics\n• Certification and applied experience in cloud-based analytics platforms such as:\n• Microsoft Azure Analytics\n• Amazon Web Services Analytics\n• Google Cloud Platform Analytics", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJORVhURElHSVRBTDIwMjAgLSBTZW5pb3IgLSBUZWNobmljYWwgUHJvamVjdCBNYW5hZ2VyIC0gRGF0YSBBbmFseXRpY3MiLCJjb21wYW55X25hbWUiOiJTaW5nVGVsIiwiY29tcGFueV9taWQiOiIvbS8wMjB6ZmwiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJuVGZneUpoWE1GZzZUM1ZWQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFc3dCQ293QlFVNVZYMDV4VVVKcE0xbGZMV1ZKYzJwUlNXaDFVRkJXV1ZaMFRTMHdSa0pSU3pKc0xXbGxkMHhDV2tGeVJFNWZiWHBtT1dOVGVsQmFORlpmTlc1cVZtMXZTRVZ5UjNwa01FMHlOVzFSVW1Gd2NIRlpOVEowV2tGSFpFZDRUVkJWVHpBeVFVeGpPVXh0Y0U1NE1YSTRiWEZuVVhkR2RIbG5lbWRXYVdsaWN6aFpWV1U1TVZsS00xWjFibWNTRjIxSWNVTlpTak4wUkU5RFVEbFFkMUJ2Y25seE9FRnJHaUpCVDAxWlVuZEVkM1ZDUjFCWFkzZHZVM3BTWjFwVWEzQjFWVWc0ZUVGaVYwTkIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY183IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1vbnN0ZXIiLCJsaW5rIjoiaHR0cHM6Ly93d3cubW9uc3Rlci5jb20uc2cvYW1wL2pvYi12YWNhbmN5LS1uZXh0ZGlnaXRhbDIwMjAtc2VuaW9yLXRlY2huaWNhbC1wcm9qZWN0LW1hbmFnZXItZGF0YS1hbmFseXRpY3Mtc2luZ3RlbC1zaW5nYXBvcmUtMjY1Mzg1NDcuaHRtbD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Lead Business Analyst – Capital Markets (VP)", "company_name": "TENTEN PARTNERS PTE. LTD", "location": "Singapore", "via": "via WhatJobs", "description": "Because we value your privacy, we ask for your permission to use this info in capacities such as: Function, Store and/or access information on a device, Precise geolocation data, and identification through device scanning, Personalised content, content measurement, audience insights, and product development, Personalised ads, and ad measurement.\n\nLead Business Analyst – Capital Markets (VP)\n\nPosted by: Don Shun Recruiter View profile & contact Lead BA for Capital Markets - Team Management role\n\nA well-established regional Bank in Singapore is looking for a seasoned Tech Business Analyst. This is a senior position within the team and the incumbent will be leading a competent team of BAs. This role is positioned under Investment banking arm and partnering very closely with various business stakeholders. Leading the requirements gatherings, you will be well-verse with technical solutions and products to exert influence over the desired outcome for various projects.\n\nRequirements\n\nAt... least 10 years of BA experience in the Technology space Strong knowledge in Technical solutions for capital market business and products. Possess strong leadership qualities and proven stakeholder management skills Certified Scrum Master or Certified Scrum Product Owner Experience in agile-related or data analytics or digital initiatives involving technologies such as cloud, API, microservices, blockchain\n\n× Save jobs and track them like a pro with My Jobs", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJMZWFkIEJ1c2luZXNzIEFuYWx5c3Qg4oCTIENhcGl0YWwgTWFya2V0cyAoVlApIiwiY29tcGFueV9uYW1lIjoiVEVOVEVOIFBBUlRORVJTIFBURS4gTFREIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJlYzUxa1Q1eEJnZDRPR085QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFdoYXRKb2JzIiwibGluayI6Imh0dHBzOi8vZW4tc2cud2hhdGpvYnMuY29tL2pvYi1mb3ItTGVhZC1CdXNpbmVzcy1BbmFseXN0LUNhcGl0YWwtTWFya2V0cy1pbi1TaW5nYXBvcmUtY29vcDE3NTUyNDYxP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Technology Consulting Associate | Data & Analytics, Singapore (2021 Graduates)", "company_name": "Ernst & Young", "location": "Singapore", "via": "via Glassdoor", "description": "Our clients are faced with external pressures on an unprecedented scale. The ability to translate strategy into reality is key to their enhanced business performance. As an advisory professional, you will be focused on helping them achieve this goal.\n\nYou’ll work in high-performing teams that deliver exceptional client service, enabling organisations to grow, innovate, protect and optimise their business performance – playing your part in building a better working world.\n\nWe believe that you should own and shape your career. But we’ll provide the support and opportunities to develop the skills, knowledge and experience to succeed. The strength of our global network, combined with local empowerment and a relentless focus on winning in specific markets, means you’ll interact and team with individuals from various geographies and sectors. So whenever you join, however long you stay, the exceptional EY experience lasts a lifetime.\n\nThe opportunity\nThe Data and Analytics team works... collaboratively with our clients to manage engagements and lead teams of data analysis resources in all aspects of design and delivery of information solutions - including Data Quality and Governance, Data Analytics, Business Intelligence, and Data Management.\n\nData Analytics is integrated into all Consulting service offerings and assists clients to leverage data as an asset throughout its business processes. You'll enjoy working in multi-disciplinary teams and gaining valuable experience in various sectors and play a key role in ensuring high quality outputs and service to our clients.\nYour key responsibilities\n• Contribute technically and deliver Analytics-related solutions to clients\n• Communicate effectively with the project manager & team members regarding the progress of the project\n• Prepare reports and schedules that will be delivered to clients and other parties\n• Develop and maintain productive working relationships with client personnel\n• Build strong internal relationships within Ernst & Young Consulting Services and with other services across the organization\n\nSkills and attributes for success\n• Strong analytical and problem-solving skills\n• Intellectual curiosity and a love of learning\n• Project management skills\n• Strong written, verbal communication and presentation skills\n• Leadership, teamwork and client service skills\n• Demonstrated integrity within a professional environment\n\nTo qualify for the role, you must have\n• Degree in quantitative fields such as Computing, Engineering, Analytics, Statistics, Applied Mathematics, Machine Learning, Operation Research, Information Management or related fields\n• Good understanding of time series, statistical and decision modeling; and machine learning techniques\n• Good understanding of various data structures, common methods and tools used for data transformation\n• Proficiency with analytical programming languages such as Python and/or R, as well as familiarity with SQL\n• Familiarity with cloud technologies, DevOps tools, ETL tools, machine learning frameworks, visualization software, * Unix shell scripting are considered a plus.\n\nIdeally, you’ll also have\n• Analytical and problem-solving skills combined with experience in leveraging data analytics to drive insights and business decisions\n• Strong attention to details and ability to multi-task\n• Comfortable with ambiguity and applying creativity to solve complex problems\n• Excellent command of written and spoken English\n• A strong work ethic\n\nPlease note that for your application to be considered, you are required to upload the following documents together with your online application:\n• Detailed resume\n• Highest academic certification and transcripts\n\nOnly applications with complete set of data and documents will be considered.\n\nWhat we look for\nHighly motivated individuals with excellent problem-solving skills and the ability to prioritize shifting workloads in a rapidly changing industry. An effective communicator, you’ll be a confident leader equipped with strong people management skills and a genuine passion to make things happen in a dynamic organization.\n\nWhat working at EY offers\nEY offers a competitive remuneration package where you’ll be rewarded for your individual and team performance. We are committed to being an inclusive employer and are happy to consider flexible working arrangements. Plus, we offer:\n• Support, coaching and feedback from some of the most engaging colleagues around\n• Opportunities to develop new skills and progress your career\n• The freedom and flexibility to handle your role in a way that’s right for you\n\nAbout us\nEY is a global leader in assurance, tax, strategy, transaction and consulting services. The EY member firms in Singapore, with a strength of close to 3,400 people and 180 Partners, is part of the Asia-Pacific Area, which comprises 23 countries across 6 Regions and brings together over 55,000 people to provide services seamlessly across borders.\n\nIf you can confidently demonstrate that you meet the criteria above, please contact us as soon as possible.\n\nJoin us in building a better working world. Apply now.\n\nWant to get to know us better?\nVisit www.ey.com/SG/Careers\nBecome a fan on Facebook: https://www.facebook.com/eycareerssingapore\nConnect with us on Linked In: https://tinyurl.com/ud5nl3n\nWatch us on YouTube: http://www.youtube.com/ernstandyoungglobal", "extensions": ["4 days ago", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJUZWNobm9sb2d5IENvbnN1bHRpbmcgQXNzb2NpYXRlIHwgRGF0YSBcdTAwMjYgQW5hbHl0aWNzLCBTaW5nYXBvcmUgKDIwMjEgR3JhZHVhdGVzKSIsImNvbXBhbnlfbmFtZSI6IkVybnN0IFx1MDAyNiBZb3VuZyIsImNvbXBhbnlfbWlkIjoiL20vMGc5amMiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJ1bk92SlhqTHY5WFBteDdLQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUlCQ3FJQlFVNVZYMDV4VTBoVWNVcGpVRE5qVmkxNk5uQndOVEJ0VjNSMFRteEZUVVpMUjNSWGFURkdXRWxZT1RBMFZGcERNSGxxWldveFJIaGhkRkZGUVd4WlkyZHdORzVXTjFSeldVOWxTbTR5WjJOSlJtUlJSRmRFZW10dU5XaElPR0o2ZEhoMGNUWlVkakZvYkRSSE4zWTRZVU50TUcweVlXUnliR1J1WHkxcE1sVmtZbnBKUWxWQ1FVc3hXV3hNY1hGcVYzcHVkemxzY1RsNk1YWjBXSEowVlRsbkVoZHRTSEZEV1VvemRFUlBRMUE1VUhkUWIzSjVjVGhCYXhvaVFVOU5XVkozUkhkUlpqZERhbWRoUkhVeGRuQXRabTkwVTFsNmFYaFdWMUJyUVEiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18xOSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBHbGFzc2Rvb3IiLCJsaW5rIjoiaHR0cHM6Ly93d3cuZ2xhc3Nkb29yLnNnL2pvYi1saXN0aW5nL3RlY2hub2xvZ3ktY29uc3VsdGluZy1hc3NvY2lhdGUtZGF0YS1hbmFseXRpY3Mtc2luZ2Fwb3JlLTIwMjEtZ3JhZHVhdGVzLWVybnN0LXlvdW5nLUpWX0lDMzIzNTkyMV9LTzAsNzFfS0U3Miw4My5odG0/amw9NDAxMDIxNjQ0OVx1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "First VP - Innovation and Capabilities - Data Analytics - Modeling - T-O Governance and Assurance", "company_name": "United Overseas Bank Limited", "location": "Singapore", "via": "via Monster Singapore", "description": "Job Responsibilities\n• To be an innovative leader responsible for the creation of new data analytics and science capabilities in a first-line-of-defence risk and control function within Group Technology & Operations of a large and complex financial institution.\n• Envision and execute strategies that will improve visibility of risk insights and effectiveness of T&O risk assurance programs through process automation, influencing the early identification and management of emerging risks.\n• Proactively work with the T&O Risk Governance & Assurance function head, department heads and domain specialists within the function in order to provide advanced analytic data modeling systems for use cases.\n• Provide shared services to the larger T&O Risk Governance & Assurance function in the main overseas banking subsidiaries for use case data analytics and modelling deployment.\n• Design and launch innovative and complex analytic models, utilizing a blend of contemporary and traditional data mining... techniques, applied to both structured and unstructured data sets.\n• Responsible for overseeing activities of the data analyst ensuring proper execution of duties and alignment with the function’s overall vision.\n• Nurture data analytics skills within the risk and assurance teams.\n\nJob Requirements\n• A master’s degree in Statistics, Machine Learning, Mathematics, Computer Science, Economics, or any other related quantitative field. A working experience of the same is also acceptable for the position.\n• Be technologically adept and especially demonstrate an understanding of database and computer software, and to be highly proficient and experienced in scripting languages and have rapid prototyping skills, that is, fluency in SQL, Python, R, Java, VB, among others.\n• At least 7 years of working experience in a data science position, preferably working as a Senior Data Scientist.\n• Outstanding skills in the use of MS Word, MS Excel, PowerPoint, and Outlook, which will all be necessary for the creation of both visually and verbally engaging reports and presentations, for senior management, executives, and stakeholders.\n• Exceptionally good skills in SQL server reporting services, analysis services, Qliksense, Tableau, integration services, or any other data visualization tools.\n• Highly skilled in statistical and modeling packages such as SAS, Statistica, Matlab, R, visualization and other advanced analysis tools. He will also be an expert in data management programming such as SQL, PL-SQL, and Python as well as being familiar with the workings of time-series analyses.\n• Proven and successful track record of leading high-performing data analyst team through the successful performance of advanced quantitative analyses and statistical modeling that positively impact business performance.\n\nBe a part of UOB Family\nApply now and make a difference", "extensions": ["5 days ago", "Full–time"], "detected_extensions": {"posted_at": "5 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJGaXJzdCBWUCAtIElubm92YXRpb24gYW5kIENhcGFiaWxpdGllcyAtIERhdGEgQW5hbHl0aWNzIC0gTW9kZWxpbmcgLSBULU8gR292ZXJuYW5jZSBhbmQgQXNzdXJhbmNlIiwiY29tcGFueV9uYW1lIjoiVW5pdGVkIE92ZXJzZWFzIEJhbmsgTGltaXRlZCIsImNvbXBhbnlfbWlkIjoiL20vMDRnamQxIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoicDVvMFRlQVdvUUpTM3NBTkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRW93Q0Nzd0JRVTVWWDA1eFZITlNhRVZyTWt3eVRpMUdjVVl6TFZSdU1VWjVZa1o2ZFROQmNXaFZkVE5WVG5adllYVm5kVkpzYkhOb01XbEJhbFozWkZGQk1GVlhWV2RLZUhOMVJWVk1VbkZmV0c1WVFWUkNSbUpqTjBFMFpEWmpWbWhyV1ZKMGVuZE9UakYwVGt0cWVHbGlWMkpxT1VGeWMyWk9ha1ZCUVZGdGNHMVpXRm81YVZkUlRuUllOeTFMT0ZVNE9YSk9ZVmgxZW1GcVFrRllPVzlEWmpkTGFGUkdlakl4YkhKaGNITXhYM0JCY25SSVVsa3diSGc0VmtOa05qUlZjMHR2TjFvd05tWmlXakkxTFRSNkVoZHRTSEZEV1VvemRFUlBRMUE1VUhkUWIzSjVjVGhCYXhvaVFVOU5XVkozUWxkeE9UbFNXRzFrZEVWU1dVSnVRVTlNTjFoQlJHSktUVXREUVEiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18yNyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNb25zdGVyIFNpbmdhcG9yZSIsImxpbmsiOiJodHRwczovL3d3dy5tb25zdGVyLmNvbS5zZy9hbXAvam9iLXZhY2FuY3ktZmlyc3QtdnAtaW5ub3ZhdGlvbi1hbmQtY2FwYWJpbGl0aWVzLWRhdGEtYW5hbHl0aWNzLW1vZGVsaW5nLXQtby1nb3Zlcm5hbmNlLWFuZC1hc3N1cmFuY2UtdW5pdGVkLW92ZXJzZWFzLWJhbmstbGltaXRlZC1zaW5nYXBvcmUtMjY5NTc3ODUuaHRtbD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "L&D Data Analyst (Manager)", "company_name": "PricewaterhouseCoopers GHRS Pte Ltd", "location": "Singapore", "via": "via Workday", "description": "Line of Service\nInternal Firm Services\n\nIndustry/Sector\nNot Applicable\n\nSpecialism\nIFS - Human Capital (HC)\n\nManagement Level\nManager\n\nJob Description & Summary\nA career at PwC is more than “just” a job. It’s about being part of a purpose-led firm that builds trust in society and solve important problems. We help our clients to make informed decisions and operate effectively within them. At PwC, we are committed to making a difference for each other, our clients, and our community — by empowering you to be the best version of yourself and investing in your growth. You’ll be able to develop as a leader, be well-connected, work in a great environment, explore our benefits and make a positive contribution.\n\nWith PwC, you’ll ignite a meaningful career while being supported by a strong coaching and people-oriented culture, our Flex policies (Flex Space, Flex Dress and Flex Time), innovative learning and development programs (training programs, digital upscaling) as well as mobility... opportunities. If you would like to be connected to like-minded individuals outside of work, we highly encourage you to be part of our people clubs and committees such as the Sports and Recreational Club, Toastmasters Club and more\n\nHow will you value add?\n\nA highly matured and independent individual responsible for performing analytics with learning data to generate insights on effectiveness of learning strategies, measure learning ROI, and propose learning solutions and design.\n\nThis individual will work cohesively with various client stakeholder groups across PwC, and display strong interpersonal and organizational skills, as well as business acumen.\n\nAdditionally, this individual will:\n• Collaborate with learning stakeholders on issue statements, and thereafter determine, design, propose and present data-validated solutions\n• Design data workflow for seamless data collection and reporting process\n• Prepare reports and create data visualisation dashboards for executive leadership that effectively communicate learning & development trends, patterns, and predictions using relevant data\n• Collaborate with programmers and organizational leaders to identify opportunities for process improvements, recommend system modifications, and develop policies for data governance.\n• Liaise with Global/Regional L&D and HR teams to introduce data solution and digital initiatives locally\n• Support any ad-hoc projects as may be required or assigned\n\nAbout you\n\nWhat we need to see in you:\n• Degree in Computer Science / Information Technology or its equivalent\n• Minimum 5 years of relevant work experience in the L&D environment and possess good data analytics skills\n• Certification in Alteryx, PowerBI, Tableau, Qlikview or UIPath preferred\n• A critical thinker with strong analytical and problem solving skills\n• Strong interpersonal and communication skills with ability to understand and communicate business needs\n• A team player with a high level of agility\n• Only shortlisted candidates will be notified due to the high number of applicants for this role.\n\nEducation (if blank, degree and/or field of study not specified)\nDegrees/Field of Study required:\n\nDegrees/Field of Study preferred:\n\nCertifications (if blank, certifications not specified)\n\nDesired Languages (If blank, desired languages not specified)\n\nTravel Requirements\nNot Specified\n\nAvailable for Work Visa Sponsorship?\nYes\n\nGovernment Clearance Required?\nNo\n\nJob Posting End Date", "extensions": ["22 days ago", "Full–time"], "detected_extensions": {"posted_at": "22 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJMXHUwMDI2RCBEYXRhIEFuYWx5c3QgKE1hbmFnZXIpIiwiY29tcGFueV9uYW1lIjoiUHJpY2V3YXRlcmhvdXNlQ29vcGVycyBHSFJTIFB0ZSBMdGQiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImRtUEFnMUxsWjBCRDltU2lBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gV29ya2RheSIsImxpbmsiOiJodHRwczovL3B3Yy53ZDMubXl3b3JrZGF5am9icy5jb20vR2xvYmFsX0V4cGVyaWVuY2VkX0NhcmVlcnMvam9iL1NpbmdhcG9yZS9MLUQtU3lzdGVtcy1hbmQtRGF0YS1BbmFseXN0XzE3OTMyNFdEP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "VP, IT Risk %26 Control Lead, Group Consumer Banking and Big Data Analytics Technology, Technology and Operations", "company_name": "DBS Bank Ltd", "location": "Singapore", "via": "via Monster Singapore", "description": "Business Function\nGroup Technology and Operations (T&O) enables and empowers the bank with an efficient, nimble and resilient infrastructure through a strategic focus on productivity, quality & control, technology, people capability and innovation. In Group T&O, we manage the majority of the Bank's operational processes and inspire to delight our business partners through our multiple banking delivery channels.\n\nResponsibilities\n• Collaborate with various stakeholders to maintain the internal controls effectiveness\n• Manage the department%26rsquo;s risk and security related process improvements and quality programs by participating in research / advisory services, including capturing of organizational metrics and analysis\n• Perform data analysis or procedure reviews to ensure compliance to bank security standards; Provide technical expertise/consultation for process improvement and quality assurance to project managers and other IT teams\n• Identify risk/issues proactively and work... with the various stakeholders to investigate and determine remediation plans. Partner with application teams and relevant stakeholders to ensure risk identified are properly and effectively mitigated\n• Partner and work with internal stakeholders to review, identify, streamline and implement process improvements\n• Manage all audits, regulatory examinations/inspections. Review the audit findings with keystakeholders to determine action plans and verify remedial solutions for closure\n• Provide timely and periodic update to management on risk and security matters\n• Communicate and provide guidance of new policies and standards to relevant application teams\n\nRequirements\n• Degree in Computer Science, Engineering, Information Technology or related discipline from a recognized University with minimum 10 years of working experience in the Financial / Banking IT industry\n• Experience in IT audit or CISA/CISM certified preferred or operational risk management and controlself-assessment\n• Familiar with Applications Delivery Life Cycle, Project Management best practices and IT Controls across different operating system and platforms with hands on experience on Public Cloud controls is an added advantage.\n• Good knowledge of application user access and access matrices will be preferred\n• Good understanding of security issues, operational risks and process improvement in the areas of technology and business\n• Knowledge of the Banking Act %26ndash; Banking Secrecy, Bank's policy and guidelines, InformationSecurity Policy, Anti-Money Laundering, Cyber Security Act, MAS Technology Risk Management Guidelines, MAS Outsourcing Guidelines etc.\n• Have a strong control and process management mindset, constantly paying attention to details and have ability to perform deep-pe investigation and crunching for control and process issues\n• Proactive team player with ability to work independently with minimal supervision and equips with excellent communication (both spoken and written), presentation and business writing skills\n• Able to collaborate within a team, at various levels of stakeholders from the operating level to the senior management across locations\n• Flexibility and ability to multi-task and take on different types of roles and activities at the same time in a fast-paced environment. Able to effectively manage time and prioritize tasks and responsibilities\n• Positive attitude and willing to take new challenges with an open-mind\n• Creative, quick & systemic thinking with strong analytical and planning skills\n\nApply Now\nWe offer a competitive salary and benefits package and the professional advantages of a dynamic environment that supports your development and recognises your achievements.Singapore-DBS Asia Hub", "extensions": ["28 days ago", "Full–time"], "detected_extensions": {"posted_at": "28 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJWUCwgSVQgUmlzayAlMjYgQ29udHJvbCBMZWFkLCBHcm91cCBDb25zdW1lciBCYW5raW5nIGFuZCBCaWcgRGF0YSBBbmFseXRpY3MgVGVjaG5vbG9neSwgVGVjaG5vbG9neSBhbmQgT3BlcmF0aW9ucyIsImNvbXBhbnlfbmFtZSI6IkRCUyBCYW5rIEx0ZCIsImNvbXBhbnlfbWlkIjoiL20vMDFxN241IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoidWxYYXdBZVlTTEp6YlNPMUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVJQkNxSUJRVTVWWDA1eFUxaE9OVzEzYmkxdFoxcHpkMFkyWVZCRWFWUnhWbUZEUm1Kell6bEJaVXBsTms5b1JWQnhlVXh4VW10Tk1ITldhbFJsVDA5YVdEUnNiMU5aZG5SMWJVb3laM1JJVUc5cmN6bGlSbWd0Vm5aTGVWSlJZVkI1WW5CV01rMVhRVlJ5VnpKMmNEZHpaMU54WldFNGFYZ3hWVkJZU2pGSWNIZFFhSG95Y3pGRGNGaEZhbk4wWldSS2VuaG9VVzFaWkZoSU9HVm1VemwzVERkeVkzQlJFaGR0U0hGRFdVb3pkRVJQUTFBNVVIZFFiM0o1Y1RoQmF4b2lRVTlOV1ZKM1ExWkxabTFhTUZodGNWaFBTVTh0UTNBd056UnphVTFSVVVsbVp3IiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMzkiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTW9uc3RlciBTaW5nYXBvcmUiLCJsaW5rIjoiaHR0cHM6Ly93d3cubW9uc3Rlci5jb20uc2cvam9iLXZhY2FuY3ktdnAtaXQtcmlzay0yNi1jb250cm9sLWxlYWQtZ3JvdXAtY29uc3VtZXItYmFua2luZy1hbmQtYmlnLWRhdGEtYW5hbHl0aWNzLXRlY2hub2xvZ3ktdGVjaG5vbG9neS1hbmQtb3BlcmF0aW9ucy1kYnMtYmFuay1sdGQtc2luZ2Fwb3JlLTEwLTEzLXllYXJzLTI3NDgxNTI5Lmh0bWw/c2lnPWpzLTQtLTFcdTAwMjZmcm9tXHUwMDI2cmZyPXJlZmluZTtmdHMlM0R2cCtvcGVyYXRpb25zO2RheSUzRDE4MDtzcnQlM0Rwc3Q7cmVmJTNELy93d3cubW9uc3Rlci5jb20uc2cvam9iLXNlYXJjaC5odG1sO3Nob3dfb21pdCUzRDE7cmVzX2NudCUzRDQwXHUwMDI2aGxXb3Jkcz12cC9oZWFkL2dtK29wZXJhdGlvbnMsbWFuYWdpbmcrZGlyZWN0b3IsdnArb3BlcmF0aW9ucyxvcGVyYXRpb25zLG9wZXJhdGlvbixoZWFkLGNlbyx2cCxnbVx1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Technical Project Manager - Group Consumer Banking and Big Data Analytics Technology - Technology - 26 Operations", "company_name": "DBS Bank Ltd", "location": "Singapore", "via": "via Monster", "description": "Business Function\nGroup Technology and Operations (T&O) enables and empowers the bank with an efficient, nimble and resilient infrastructure through a strategic focus on productivity, quality & control, technology, people capability and innovation. In Group T&O, we manage the majority of the Bank%27s operational processes and inspire to delight our business partners through our multiple banking delivery channels.\nResponsibility\n• Tracking, monitoring and reporting project progress.\n• Embedding a culture of trust and safe to make mistakes that encourages team members to raise issues and risks\n• Exhibit values and principles of an agile mindset\n• Accountable for cross team reporting to Program Manager, PMO and/or possibly steering committee – including project financials\n• Managing project E2E – which may include non-software development activities (e.g. training, change management etc)\n• Coordination across teams / platforms. The key for this is to keep transparency across the platform... in the A/B/C type of work so that delivery can effectively be coordinated including critical areas of:\n• Ensuring your project dependencies on other projects /platforms are on their roadmaps and timing and integration environments will be ready when your teams need them\n• Ensuring the work other teams need from your team/s are included and prioritised appropriately in your teams work backlog.\n• Highlighting capability gaps to respective team/tribe/ function leads\n• Work to clear project level impediments for the team: Teams will raise issues that are beyond their control that need to be cleared (e.g., test data, environments, platform coordination, prioritization)\n• Drive project and program delivery\n• Responsible for ensuring project delivery on time on schedule and with quality\n• Effectively communicate with team members and stakeholders in a timely and clear fashion.\n• Identify and resolve issues and conflicts within the program, projects and project management community and with other stakeholders if necessary.\n• Resolve issues at the project or line level and escalate issues which cannot be resolved in a timely and accurate manner.\n• Manage key stakeholders and business and technology leads\n• Manage and communicate effectively with domain leads at senior level and working level teams.\n• Responsible for ensuring project steering committee meetings, cross function meetings and other key project meetings are effective and achieve objectives on a consistent manner.\n• Change management\n• Ability to drive the adoption of agile methodology across teams\n• Able to work with users to drive changes within the organization for projects implementation\n• Develop best practices and tools for project execution and management. Ensure utilization of standards and practices across all projects.\n\nRequirement\n• 10-15 years of experience executing complex migration project is a must. Successful candidate should have led projects involving delivery across multiple applications/systems.\n• A proven track record of successfully implementing software programs\n• Successful candidate should have worked in financial industry\n• Balanced business/technical background:\n• Sufficient level of technical background to provide highly-credible leadership to development teams and be able to accurately and objectively evaluate complex program risks and issues\n• Excellent presentation, analytical and articulation skills\n• Self-starter and extremely hands on in the management of projects\n• Proven leadership skills and evidence of collaboration with customers to develop strategies and solutions of high business value\n• Able to manage and work with internal stakeholders, and vendors.\n• Ability to apply general organizational knowledge of the business and systems processes in problem analysis is required.\n• Ability to lead and negotiate business solutions that balance technical capability, cost, and time, against business need is required.\n• Must exhibit confidence and an extensive knowledge of emerging industry practices when solving business problems.\n• Ability to successfully engage in multiple initiatives simultaneously is required.\n• Must possess strong leadership skills and generate enthusiasm among stakeholders.\n• Ability to work independently with users to define concepts, under direction of project managers is required.\n• Must possess strong analytical, organizational and product management skills.\n• Ability to communicate difficult sensitive information tactfully is required. Must possess excellent verbal and written communication skills.\n• Ability to interact professionally with a diverse group, executives, managers, vendors and subject matter experts is required.\n\nApply Now\nWe offer a competitive salary and benefits package and the professional advantages of a dynamic environment that supports your development and recognises your achievements.\nSingapore-DBS Asia Central", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJUZWNobmljYWwgUHJvamVjdCBNYW5hZ2VyIC0gR3JvdXAgQ29uc3VtZXIgQmFua2luZyBhbmQgQmlnIERhdGEgQW5hbHl0aWNzIFRlY2hub2xvZ3kgLSBUZWNobm9sb2d5IC0gMjYgT3BlcmF0aW9ucyIsImNvbXBhbnlfbmFtZSI6IkRCUyBCYW5rIEx0ZCIsImNvbXBhbnlfbWlkIjoiL20vMDFxN241IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoibmg0S1JkeWRQUlFkVFpJZ0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVJQkNxSUJRVTVWWDA1eFVrRXdkVmhHUjNVNVNYVmFWV2hEVlU4eGVUTkxOMGt0UjNKMU9FbzBXSGhvUldkdlIxVjBVekJTYldGdVprdDJVbmRPZEZkeFMyTk9lbEJFUzBFM1RqUnRURWhCTmpKTFNtRm1NbTQwY1ZCQlNubE1ZMkpMZEZsTWEyTTNXbWxPZUdSRFlYUmpPVWRJZFRkeFEzZGtTRmhVWVcxU2RFTlpjWGRhVkROU1JFTkdaVXRXZVhwVVJscG1VV3QwWm5KMU9FSlFjbFJ4VERKSGFHRm5FaGR0U0hGRFdVb3pkRVJQUTFBNVVIZFFiM0o1Y1RoQmF4b2lRVTlOV1ZKM1EyTkZUM1EyVG1kR1NXSklWRlpoZHpRdE4wMVBObFkzVTJkUVFRIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNDYiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTW9uc3RlciIsImxpbmsiOiJodHRwczovL3d3dy5tb25zdGVyLmNvbS5zZy9qb2IvdGVjaG5pY2FsLXByb2plY3QtbWFuYWdlci1ncm91cC1jb25zdW1lci1iYW5raW5nLWFuZC1iaWctZGF0YS1hbmFseXRpY3MtdGVjaG5vbG9neS10ZWNobm9sb2d5LTI2LW9wZXJhdGlvbnMtZGJzLWJhbmstbHRkLXNpbmdhcG9yZS0xNTE0MjI5P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Associate, Application Support Plus Developer, Group Consumer Banking and Big Data Analytics Technology, Technology and Operations", "company_name": "DBS Bank", "location": "Singapore", "via": "via Glassdoor", "description": "Business Function\nGroup Technology and Operations (T&O) enables and empowers the bank with an efficient, nimble and resilient infrastructure through a strategic focus on productivity, quality & control, technology, people capability and innovation. In Group T&O, we manage the majority of the Bank's operational processes and inspire to delight our business partners through our multiple banking delivery channels.\n\nResponsibilities\n• To implement and support DBS Trading platform\n• Plan, co-ordinate and liaise with users, vendor and the development team on system requirements gathering, documentation and creating/performing user acceptance tests for successful system implementation\n• Design, develop and deploy applications for new business requirements\n• Provide operational support/troubleshooting for applications and their on-going maintenance\n\nRequirements\n• Experience in managing medium to large scale application project from beginning to end, with skills in requirement study and... functional/detail design, QA, testing, and software change/version control management is advantageous\n• Technical knowledge on Webservice (REST/SOAP), Openshift, Postgres, Apache Ignite, AWS, AWS EKS (Amazon Elastic Kubernetes Services), GIT, Jenkins is a must\n• Certified in AWS\n• Good hands-on knowledge of Source Code Management tools like Git/GitLab and Subversion, including branching strategies.\n• Good understanding of DevOps key concepts like cross-team collaboration, automate everything, CI/CD, continuous monitoring, continuous feedback\n• Strong vendor management and technical skills\n• Basic Financial product knowledge in equities products\n• Familiarity with trade processing/settlement experience is advantageous\n• Agile practice experience is a must\n• Strong analytical and problem-solving skill\n• Ability to work under pressure, handle multiple tasks and work to tight deadlines\n• High sense of ownership of task assigned, deliver applications with high quality and efficiency\n• Good communication, inter-personnel skills is required\n• Team player with strong interpersonal and communications skills\n• At least 5 years of working experience in application development and support, preferably in banking environments\n• A Bachelor’s degree in Computer Science (or equivalent experience)\n\nApply Now\nWe offer a competitive salary and benefits package and the professional advantages of a dynamic environment that supports your development and recognises your achievements.\n\nPrimary Location: Singapore-DBS Asia Hub\n\nJob: Technology\n\nSchedule: Regular\n\nEmployee Status:\n\nFull-time\n\n:\n\nJob Posting: Jan 5, 2021, 1:13:45 AM", "extensions": ["23 days ago", "Full–time"], "detected_extensions": {"posted_at": "23 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBc3NvY2lhdGUsIEFwcGxpY2F0aW9uIFN1cHBvcnQgUGx1cyBEZXZlbG9wZXIsIEdyb3VwIENvbnN1bWVyIEJhbmtpbmcgYW5kIEJpZyBEYXRhIEFuYWx5dGljcyBUZWNobm9sb2d5LCBUZWNobm9sb2d5IGFuZCBPcGVyYXRpb25zIiwiY29tcGFueV9uYW1lIjoiREJTIEJhbmsiLCJjb21wYW55X21pZCI6Ii9tLzAxcTduNSIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImVBTWdWY3VlZGZ5a3ZadzlBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1SUJDcUlCUVU1VlgwNXhVbEpIT1hSQ1YzcFlRVGx0TVMxRGRHVTBNRkJ0VDB0WmRtRlJZa1JJU1hSU1FYaFVOMkZwY1U5eU1tdDRUVE5MV1U1YWJVOTJRWFZKVWtaM1ZWZ3hiMDVVVldaeU1YZG1hVjl5ZEdKUk5WQlhWblo0UjFGVkxVa3llSFpNZUhRMlJsY3hRV3h3V0ZSSFkyMDJOMkZ5TUdodlVtODRTR0pKVFU1TlpqUjFTakZHUlVwUlRHUlNNbTF3ZFRaTFZreE1XRVZhWDJkVWJXbEdhREZSRWhkdFNIRkRXVW96ZEVSUFExQTVVSGRRYjNKNWNUaEJheG9pUVU5TldWSjNRMkU0UldGZlVrNUNNMWRTTUVGcmJEbFBjamRwYkVsaGNETjZadyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzUzIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEdsYXNzZG9vciIsImxpbmsiOiJodHRwczovL3d3dy5nbGFzc2Rvb3Iuc2cvam9iLWxpc3RpbmcvYXNzb2NpYXRlLWFwcGxpY2F0aW9uLXN1cHBvcnQtcGx1cy1kZXZlbG9wZXItZ3JvdXAtY29uc3VtZXItYmFua2luZy1hbmQtYmlnLWRhdGEtYW5hbHl0aWNzLXRlY2hub2xvZ3ktdGVjaG5vbG9neS1hbmQtb3BlcmF0aW9ucy1kYnMtYmFuay1KVl9JQzMyMzU5MjFfS08wLDEyN19LRTEyOCwxMzYuaHRtP2psPTM3ODgxNDE0NTJcdTAwMjZ1dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "VP - Site Reliability Engineer - Group Consumer Banking and Big Data Analytics Technology - Technology and Operations", "company_name": "DBS Bank Ltd", "location": "Singapore", "via": "via Monster", "description": "Business Function\nGroup Technology and Operations (T&O) enables and empowers the bank with an efficient, nimble and resilient infrastructure through a strategic focus on productivity, quality & control, technology, people capability and innovation. In Group T&O, we manage the majority of the Bank%27s operational processes and inspire to delight our business partners through our multiple banking delivery channels.\nSite Reliability Engineering (SRE) is an engineering discipline that combines software and systems engineering to build and run large-scale, massively distributed, fault-tolerant systems.\nThis position is for a Site Reliability Engineer responsible for the development and implementation of processes necessary to improve application / system reliability along with operational support. The position would comprise of approximately equal focus on both software development and operation disciplines. This position will also develop software to automate operational processes along... with coding for the shared engineering backlog deliverables.\nResponsibilities:\n• Engage with both the development and support teams throughout the life cycle to help build for reliability.\n• Develop software to automate manual operational work.\n• The workload for the position is multifaceted and would include:\n• Close working collaboration with development and application support teams through SDLC; to maintain and improve the service against established Service Level Objectives by applying software engineering principles.\n• Responsible for the availability, performance, change management, monitoring, and capacity management of their services.\n• Incident manage, troubleshoot business critical incidents, conduct post-mortems and ensure permanent closure of the incidents.\n• Analyse patterns of production incidents, develop permanent remediation plans, and implement automation to prevent future incidents from occurring through software engineering\n• Manage the efforts to split between manual operational work and engineering work.\n• Work with partner organizations and vendors to provide solutions to current business issues.\n• Participate in a shift model covering 24x7x365 support.\n\nRequirements:\n• Bachelor of Science degree or equivalent experience.\n• Proven experience with cloud platforms (AWS, PCF) is preferred.\n• 3+ years working with configuration management and CI/CD tools (SonarQube, Fortify, NexusIQ)\n• 5+ years of scripting/software experience (bash, python, java and perl)\n• Familiarity and working experience on DevOps testing and release techniques (i.e. A/B Testing, Blue / Green Deployments and Canary Release, etcâ€¦)\n• Working knowledge on DevOps tools/technologies (Docker, Kubernetes, OpenShift and Fabric8) will be preferred.\n• Basic knowledge of database technologies (MariaDB/MySQL, etc..)\n• Strong understanding of all LINUX security best practices\n• Extensive experience in application/system/network performance and availability monitoring (Grafana, Vizceral, Tivoli, Splunk, etc..)\n• Solid knowledge of APACHE/Weblogic and MQ Working knowledge of Cloud Engineering. Private and Public Cloud.\n• Proven experience with cloud platforms (AWS, PCF) is preferred.\n• AWS certification is preferred.\n• Proven technical leadership experience, including the ability to quickly understand an issue, appropriately / efficiently troubleshoot to detailed levels and direct swift resolution.\n• Ability to adapt to a dynamic work environment.\n• Strong ability to take ownership of issues and drive resolution across teams.\n• Assertive personality and drive improvement across environment.\n• Effective written and verbal communication skills.\n• Ability to develop strong client relationships and partner with technology engineering teams.\n\nApply Now\nWe offer a competitive salary and benefits package and the professional advantages of a dynamic environment that supports your development and recognises your achievements.Singapore-DBS Asia Hub", "extensions": ["7 days ago", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJWUCAtIFNpdGUgUmVsaWFiaWxpdHkgRW5naW5lZXIgLSBHcm91cCBDb25zdW1lciBCYW5raW5nIGFuZCBCaWcgRGF0YSBBbmFseXRpY3MgVGVjaG5vbG9neSAtIFRlY2hub2xvZ3kgYW5kIE9wZXJhdGlvbnMiLCJjb21wYW55X25hbWUiOiJEQlMgQmFuayBMdGQiLCJjb21wYW55X21pZCI6Ii9tLzAxcTduNSIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Ind4UFBCU1g4TDBmOUpWQ2FBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1SUJDcUlCUVU1VlgwNXhVemgwVjIxa2RWRlVPV3d3V25GWmNIaFdTVFI0VW1SS1NGRldOM2hpVWpkRmFuTnViV1l3U2w5UlZXUkRTWFJZVFdaaWIwcFBXbVZqV1ZOWmJrOHlTbk5IWkRoaWRGbzFjemczUjBOSFFrNHlTMXBSYjBRMU5XcEhPR1V0YWpaMk9VcFJWM1ZpYVhwbFpGUjNTbUoyVWpWVVNtdHFUMmxIT1hObGFsVjZlWG8yWWtnMlQwNU1NVkpyVVRob2QxbGxMWEYwY21OaFRIZDFaVGgzRWhkdFNIRkRXVW96ZEVSUFExQTVVSGRRYjNKNWNUaEJheG9pUVU5TldWSjNRWEp3UzJkcFR6ZzNPRVp0WVRoU2VWZGpOVWN5TW1jM2VYQndadyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzYxIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1vbnN0ZXIiLCJsaW5rIjoiaHR0cHM6Ly93d3cubW9uc3Rlci5jb20uc2cvam9iL3ZwLXNpdGUtcmVsaWFiaWxpdHktZW5naW5lZXItZ3JvdXAtY29uc3VtZXItYmFua2luZy1hbmQtYmlnLWRhdGEtYW5hbHl0aWNzLXRlY2hub2xvZ3ktdGVjaG5vbG9neS1hbmQtb3BlcmF0aW9ucy1kYnMtYmFuay1sdGQtc2luZ2Fwb3JlLTE2NTI0ODk/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Sr. Business Insights Analyst", "company_name": "Amazon", "location": "Singapore", "via": "via Jobrapido.com", "description": "DESCRIPTIONAmazon Web Services, Inc. (\"AWS\") enables customers of all sizes to run their applications on Amazon’s industry-leading cloud computing infrastructure\n\nAWS is growing very rapidly with hundreds of thousands of companies in over 190 countries on the platform\n\nThis growth is driving the need for an experienced Business Insights Analyst\n\nAmazon has a strong culture of data-driven decision-making; requiring timely, accurate, and actionable intelligence that delivers significant business value\n\nWe are looking for a hands-on and motivated self-starter who is passionate about using data to help us measure every area of the business and influence decision-making.In this role, the Business Insights Analyst serves as the subject matter expert to fulfil data-driven decision making demands\n\nAs the successful candidate, you must be able to roll-up your sleeves and work directly with large and complex datasets\n\nYou will continuously evolve business reporting, conduct data analysis, build... self-service reporting and analytical tools, and deliver business insights in an environment of rapid growth and increasing complexity.You will be passionate about your work, detail-oriented, analytical, and possess creative problem-solving abilities\n\nYou will need to demonstrate subject matter expertise in querying and extracting large datasets and the accompanying tools and programming languages needed to work with them\n\nYou will possess good communication and project management skills, is customer obsessed and able to communicate complex business insights; both verbally and in writing; in a clear and precise manner.Main responsibilities:· Lead the development of self-service reporting and analysis by creating and owning business reports and insight products· Conduct data analysis to solve business problems through the use of statistical and/or machine learning models· Continuously sharpen the skillset by learning and maintaining knowledge of existing and emerging business intelligence tools· Collaborate with the internal and global data engineering teams on the design, development and maintenance of data infrastructure including data models· Collaborate with the internal and worldwide data science teams on the design, development and maintenance of statistical and/or artificial intelligence/machine learning (AI/ML) modelsBASIC QUALIFICATIONS· Bachelor’s degree with emphasis on statistical and analytical skills· Proficiency in relational databases (Redshift, RDS, SQL Server, MySQL, etc.) and SQL for querying and extracting data· Proficiency in at least programming languages (Python, Java, R, etc.) for data gathering, data cleansing and statistical analysis· Expertise in data visualisation software (QuickSight, Tableau, PowerBI, QlikView, etc.) for effective data presentation· Creative and analytical thinking to generate interesting approaches to answering business questions· Strong and effective written and oral communication to clearly convey data findingsPREFERRED QUALIFICATIONS· 10+ years of work experience as a Business Analyst· Experience working in the Information Technology industry is highly beneficial· Proficiency in different types of databases (relational vs\n\nnon-relational, etc.) and their relevant use cases· Experience working with Cloud Computing· Experience in deploying artificial intelligence/machine learning (AI/ML) models into production· AWS certified (AWS Certified Solutions Architect – Associate, AWS Certified Data Analytics, etc.)Amazon is committed to a diverse and inclusive workplace\n\nAmazon is an equal opportunity employer, and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, disability, age, or other legally protected status", "extensions": ["8 hours ago", "Full–time"], "detected_extensions": {"posted_at": "8 hours ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTci4gQnVzaW5lc3MgSW5zaWdodHMgQW5hbHlzdCIsImNvbXBhbnlfbmFtZSI6IkFtYXpvbiIsImNvbXBhbnlfbWlkIjoiL20vMG1na2ciLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJPaHVKb3hOVldDUnhEc013QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFc3dCQ293QlFVNVZYMDV4VWtkd2FuVlFXVE5YUVVkbUxXeGlaV1V3ZERsdk1uRlZjbkpZZWxSNlpHVnFMVnBzUmpkQ1p6VmlVVEpXUTJWcFlrZGpTRkZsWVVwR1dWVm1TM2hCU1VNdFRIaEVjak5CYlhReWFYQlFiV05zTTJSUVpVUTJaRXhCYWxodVpXRk9VbFZWVFcxT1VHMXdPRTgyWm5KSWVXcG1abUk1UVUxM00ySnJaVVpOUVVSaFdFd3RXaTBTRjIxSWNVTlpTak4wUkU5RFVEbFFkMUJ2Y25seE9FRnJHaUpCVDAxWlVuZEVNemQxYkdwV1JHdEphRGxLUlU5RGVtUlNjVGcyVDBsQ1JVaDMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY182OCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JyYXBpZG8uY29tIiwibGluayI6Imh0dHBzOi8vc2cuam9icmFwaWRvLmNvbS9qb2JwcmV2aWV3LzIyOTM0MTgxP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Business Operations", "value": "GC06"}, {"text": "Science and Engineering", "value": "GC27"}, {"text": "Management", "value": "GC18"}, {"text": "Accounting and Finance", "value": "GC01"}, {"text": "Advertising and Marketing", "value": "GC03"}, {"text": "Admin and Office", "value": "GC02"}, {"text": "Human Resources", "value": "GC15"}, {"text": "Legal", "value": "GC17"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Sales and Retail", "value": "GC26"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "Data analyst", "value": "data analyst"}, {"text": "Business analyst", "value": "business analyst"}, {"text": "Analyst", "value": "analyst"}, {"text": "Associate", "value": "associate"}, {"text": "Senior", "value": "senior"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Data scientist", "value": "data scientist"}, {"text": "Insights analyst", "value": "insights analyst"}, {"text": "Operations analyst", "value": "operations analyst"}, {"text": "Project manager", "value": "project manager"}, {"text": "Project officer", "value": "project officer"}, {"text": "Administrators", "value": "administrators"}, {"text": "Builder", "value": "builder"}, {"text": "Business", "value": "business"}, {"text": "Cloud consultant", "value": "cloud consultant"}, {"text": "Control analyst", "value": "control analyst"}, {"text": "Data engineer", "value": "data engineer"}, {"text": "Executive", "value": "executive"}, {"text": "Intelligence analyst", "value": "intelligence analyst"}, {"text": "It analyst", "value": "it analyst"}, {"text": "Performance manager", "value": "performance manager"}, {"text": "Product analyst", "value": "product analyst"}, {"text": "Research analyst", "value": "research analyst"}, {"text": "Research assistant", "value": "research assistant"}, {"text": "Senior analyst", "value": "senior analyst"}, {"text": "Senior associate", "value": "senior associate"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Solution architect", "value": "solution architect"}, {"text": "Support analyst", "value": "support analyst"}, {"text": "Systems analyst", "value": "systems analyst"}, {"text": "Technology consulting", "value": "technology consulting"}, {"text": "Unit", "value": "unit"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Internship", "value": "INTERN"}, {"text": "Part-time", "value": "PARTTIME"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Accounting", "value": "/business/naics2007/5412"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Mining", "value": "/business/naics2007/21"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Travel", "value": "/business/naics2007/5615"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "DBS Bank", "value": "/m/01q7n5"}, {"text": "SingTel", "value": "/m/020zfl"}, {"text": "United Overseas Bank", "value": "/m/04gjd1"}, {"text": "Nanyang Technological University", "value": "/m/0l49k"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "Bank of Singapore", "value": "/m/0r3vczm"}, {"text": "Binance", "value": "/g/11hcz1r4wl"}, {"text": "Citi", "value": "/m/01dfb6"}, {"text": "Cognizant Singapore, Cognizant Technology Solutions", "value": "/m/03bf9h"}, {"text": "Dyson", "value": "/m/05cskg"}, {"text": "EPAM Systems", "value": "/m/0dlnrc"}, {"text": "Ernst & Young", "value": "/m/0g9jc"}, {"text": "Goldman Sachs Services Private Limited", "value": "/g/11g9mm5tzn"}, {"text": "GovTech Singapore", "value": "/g/11dxpkfs_6"}, {"text": "PEOPLE PROFILERS", "value": "/g/11dxq43n_6"}, {"text": "PwC Singapore", "value": "/g/11dxpz2lh8"}, {"text": "Sciente International", "value": "/g/11c73gj19n"}, {"text": "AIR LIQUIDE INDUSTRIAL SERVICES PTE LTD", "value": "/g/11hg55y1rb"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Accounting and Corporate Regulatory Authority", "value": "/m/09g7_b3"}, {"text": "Agency for Integrated Care", "value": "/g/11c73jd3yt"}, {"text": "Amazon", "value": "/m/0mgkg"}, {"text": "Amazon Web Services Singapore", "value": "/m/0rznzt1"}, {"text": "BeathChapman Pte Ltd", "value": "/g/11f01b3y2c"}, {"text": "Big Cloud", "value": "/g/11c743lwsr"}, {"text": "Bloomberg", "value": "/m/027sm6"}, {"text": "Burpple", "value": "/g/11dxps5yv5"}, {"text": "CPF Board", "value": "/m/0615qb"}, {"text": "ClearanceJobs", "value": "/g/11fy1pft9v"}, {"text": "Comfort Transportation Pte Ltd", "value": "/g/11f01gw2xt"}, {"text": "Credit Agricole Group", "value": "/m/028vbm"}, {"text": "DYSON OPERATIONS PTE. LTD.", "value": "/g/11fy29mc6g"}, {"text": "Deloitte", "value": "/m/02spfd"}, {"text": "Direct Search Asia", "value": "/g/11fy260nhz"}, {"text": "EngageRocket", "value": "/g/11c73p5x97"}, {"text": "Epson Singapore", "value": "/g/11dxpfq_tf"}, {"text": "Expedia Group", "value": "/m/03gq420"}, {"text": "GLOBALFOUNDRIES Singapore", "value": "/m/05pcrz0"}, {"text": "Goldman Sachs", "value": "/m/01xdn1"}, {"text": "Google", "value": "/m/045c7b"}, {"text": "Government Technology Agency (GovTech)", "value": "/g/11gh0528nq"}, {"text": "Ideallss", "value": "/g/11g70fpjm5"}, {"text": "IoTalents", "value": "/g/11dxq187wm"}, {"text": "JAC Recruitment", "value": "/g/121g71_s"}]}]}