{"search_metadata": {"id": "60827983c504e9772a625bc7", "status": "Success", "json_endpoint": "https://serpapi.com/searches/1a6294901d3ec19a/60827983c504e9772a625bc7.json", "created_at": "2021-04-23 07:38:43 UTC", "processed_at": "2021-04-23 07:38:43 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28system+analyst%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=60", "raw_html_file": "https://serpapi.com/searches/1a6294901d3ec19a/60827983c504e9772a625bc7.html", "total_time_taken": 0.84}, "search_parameters": {"q": "(system analyst) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "60"}, "jobs_results": [{"title": "Threat and Intel Analyst", "company_name": "SingTel", "location": "Singapore", "via": "via Jobs", "description": "Job Description : - 2.4.1 The ASOC Manager's responsibilities shall include, but not limited to the following tasks: Overseeing and coordinating the activities of the ASOC personnel supporting the monitoring and incident response; Collaborating with IHiS to ensure that effective monitoring is implemented for all environments; Ensuring that processes and procedures are followed; Leading the execution of response procedures to confirm, track and resolve cyber security incidents; Advising IHiS on initial incident activities and subsequent incident activities; Ensuring that IHiS' senior management is informed of key situations that require escalation; Providing weekly and monthly updates. - 2.4.2 The ASOC Manager shall have the following qualifications: At least FIVE (5) years of experience working in a Security Operation Center of similar with the portfolio as a Security Operation Center Manager; Relevant training on the proposed products, and has obtained professional certification such... as GIAC Continuous Monitoring Certification (GMON), GIAC Information Assurance Certified Intrusion Analyst (GCIA), GIAC Information Assurance Certified Incident Handler (GCIH) or Certified Information Systems Security Professional (CISSP), or equivalent; The necessary soft skills. The ASOC Manager shall be continually assessed on his/her interpersonal skills and strong communication skills. (Security Analyst) - 2.5.1 The Threat Monitoring Analyst's responsibilities shall include, but not limited to the following tasks: Providing continuous technical monitoring (such as intrusion identification, event correlation and threat containment), detection, correlation, analysis and support involving handling of cyber event such as identifying user security issues; Performing initial analysis (e.g. analysing and reviewing alerts, eliminating false positives and determining severity of threats) to determine impact of compromise; Determining the nature, mechanisms and scope of incident by performing event correlation and historical searches to determine the extent of a security compromise; Performing event correlation across the In-Scope Institutions to identify similar attack pattern and spread of attack; Handling case management, generating tickets and reports when required, and tracking open tickets until closure; Generating incident or investigative reports. - 2.5.2 The Threat Monitoring Analyst shall have the following qualifications: At least TWO (2) years of experience working in a Security Operation Center with security monitoring and escalation of threats responsibilities; Relevant training on the proposed products, and has obtained professional certification such as GIAC Information Assurance Certified Intrusion Analyst (GCIA), GIAC Information Assurance Certified Incident Handler (GCIH), or equivalent. (Threat & Intel Analyst) - 2.6.1 The Incident Investigation Analyst's responsibilities shall include, but not limited to the following tasks: Performing detailed system analysis and correlation to identify pattern of intrusion; Creating use cases for detecting similar intrusion; Identifying new or useful Indicator of Compromise; Conducting researches and evaluating trends in remediation approaches; Creating and maintaining procedures for utilising the EDR and NDR tools. - 2.6.2 The Incident Investigation Analyst shall have the following qualifications: At least FOUR (4) years of experience working in a Security Operation Center with security monitoring and escalation of threats responsibilities; Relevant training on the proposed products, and has obtained professional certification such as GIAC Information Assurance Certified Intrusion Analyst (GCIA), GIAC Information Assurance Certified Incident Handler (GCIH), or equivalent; The necessary soft skills. The Incident Investigation Analyst shall be continually assessed on his/her interpersonal skills and strong communication skills. - 2.7.1 The Incident Responder's responsibilities shall include, but not limited to the following tasks: Being on standby for 24/7 to execute the incident response process according to the incident response standard operating procedure, and to work closely with the IHiS Threat Hunting team to effectively scope and contain incidents; Conducting research and continuously improving investigative methodologies and techniques, including hard disk drive, network, and memory forensics and investigating systems for malware and reverse engineering malware; Conducting and documenting research on IHiS and the In-Scope Institution to better understand the environment, as well as researching and documenting critical services and systems. Incident response toolkits shall be regularly tested on identified critical services and systems; Regularly conducting meetings with IHiS to improve the incident response plan and associated documentation, run through table-top dry runs to drill all parties in responding effectively, present the latest threats, attacks and gaps in the In-Scope Institution's environment and work out how to improve the incident response procedures to match industry standards; Creating and maintaining procedures for utilising the EDR and NDR tools; Taking part in regular red/blue team exercises. - 2.7.2 The Incident Responder shall have the following qualifications: At least TWO (2) years of experience in hard disk drive, memory and network traffic acquisition and analysis; Relevant training on the proposed products, and has obtained professional certification such as GIAC Information Assurance Certified Incident Handler (GCIH) or equivalent; The necessary soft skills. The Incident Responder shall be continually assessed on his/her interpersonal skills and strong communication skills. Job Description : - 2.4.1 The ASOC Manager's responsibilities shall include, but not limited to the following tasks: 1. Overseeing and coordinating the activities of the ASOC personnel supporting the monitoring and incident response; 2. Coll Skills: Threat and Intel Analyst Experience: 0.00-50.00 Years", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJUaHJlYXQgYW5kIEludGVsIEFuYWx5c3QiLCJjb21wYW55X25hbWUiOiJTaW5nVGVsIiwiY29tcGFueV9taWQiOiIvbS8wMjB6ZmwiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJ5d2thd004bEttQUdsTEJXQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFc3NCQ293QlFVNVZYMDV4VVRkc09FSXhSVTB6YW13elNsOUVWazVhUnpKUlprVkRkVm8zUVRVd1FsQkdSVlJWVm1kNGVXTnFUSFZaTTJWallUTjRkR3hXVFRBM01UZGpabTlPUVdsNU0zZHZWMDFOUWtwWk9Vc3dPVEJ1UkVaSVEyUnBlbmhHU1Y5M1JGZHViR1prVVhkaVVrUmlRelJMUkVZNFdEVjJhR1ZITjJSelJVeGFlWE5mWkV4RFZ6TlNRamNTRm1jemJVTlpTVTlsUnpsVFVYUkJZbmRyY1hGM1FsRWFJa0ZQVFZsU2QwUlJlVVJGV21oNk1tUkVTbTgxUkdZd1VXcDRhM05LUmxwNGNtYyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzciLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9icyIsImxpbmsiOiJodHRwczovL3NnLmZpZGFudG8uY29tL2pvYnMvam9iLW9wZW5pbmcvaW5mb3JtYXRpb24tdGVjaG5vbG9neS1wcm9qZWN0LW1hbmFnZXJzL3RocmVhdC1hbmQtaW50ZWwtYW5hbHlzdC0yNzU3MzE2NTk/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Systems Administrator", "company_name": "volt", "location": "Singapore", "via": "via Expertini.Com", "description": "• Responsible for supporting the daily operations of Active Directory, DHCP, DNS, MDM, GPO, NPS, WSUS, and Endpoint Protection.\n• Manage windows server configuration changes, backup, security updates & patches, and high availability.\n• Develop automated process and system deployment scripts to reduce redundant and manual day-to-day activities.\n• Analyse existing infrastructure usage, research for emerging cloud technologies for potential migration and adoption these solutions.\n• Support the development and gap analysis of cloud-based solutions.\n• Coordinate with Group IT for support escalation, updates, enhancements, and new initiatives rollout.\n• Responsible for managing security access to all systems within the domain.\n• Provides recommendation to improve local Information Security postures to align with Group IT policies and compliance to local regulatory requirements.\n• Perform periodic system monitoring for security vulnerabilities, system access & change logs, privileged users... access, and inactive users housekeeping.\n• Perform OS hardening based on standard IT security guidelines and fix vulnerability findings in timely manner.\n• Monitor (and respond to) all system alerts and provide technical support in terms of troubleshooting, diagnosing and resolving hardware, software, cloud, and other inter-related system problems.\n• As required, escalate and follow up with OEM to rectify the issue for any hardware and software related issue.\n• Provide support to IT helpdesk team and end-users when required.\n\nThe Requirements:\n• Bachelor’s degree or equivalent in any relevant discipline.\n• Minimum 4 years’ experience working in Windows Server administation or similar role.\n• Must have certification in MSCA: Windows Server or equivalent. Additional certification in Information Security is a bonus.\n• Strong technical knowledge and understanding of Active Directory, PowerShell scripting, GPO, and networking technologies is a must.\n• Hands-on experience in AWS cloud. Certification in AWS SysOps or Solutions Architect would be a plus.\n• A hands-on engineer who is experienced in coordinating infrastructure project, rolling out new initiatives and enhancing security, and automating repetitive administrative tasks.\n• Proficient in Microsoft technologies such as O365, MS Office, Intune, AAD, etc.\n• Awareness of trends and directions in digital transformation such as Cloud Computing, Artificial Intelligence, Robotics Automation, Business Intelligence, etc.\n• Excellent interpersonal skills. An active listener who is patient, able to work well with others, motivate, and mediate conflicts.\n• Resourceful, independent, able to work under pressure and multi-task", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTeXN0ZW1zIEFkbWluaXN0cmF0b3IiLCJjb21wYW55X25hbWUiOiJ2b2x0IiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiIyeVRTWnM4X21rSkRJamliQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEV4cGVydGluaS5Db20iLCJsaW5rIjoiaHR0cHM6Ly9leHBlcnRpbmkuY29tL3NpbmdhcG9yZS9qb2JzL2pvYi9zeXN0ZW1zLWFkbWluaXN0cmF0b3Itc2luZ2Fwb3JlLTBmYjY3NWFhZjgzNS8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Senior System Analyst", "company_name": "Spring Professional", "location": "Singapore (+1 other)", "via": "via MNC Jobs Singapore | MNC Jobs In Singapore", "description": "About the Client:\n\nAn exciting Technical Lead role has just been made available with a renowned e-commerce organization in Singapore.\n\nMain Duties & Responsibilities:\n• Collaborate with team members to determine best practices and requirements for software\n• Oversight and approval of all final programs and products before the formal launch\n• Oversee and support the coaching and training of team members to ensure all necessary employees are confident in the use of software applications\n• Actively seek ways to improve business software processes and interactions\n• Prepare an easy to understand report for supervisors detailing achieved milestones and short-term project goals\n• Use a proactive approach to common challenges and by continually researching best practices in coding\n• Ensure software security by developing programs to actively monitor the sharing of private information\n• Troubleshoot coding problems quickly and efficiently to ensure a productive workplace\n• Creating high-level... product specifications and design documents.\n• Providing the development team with architectural blueprints to follow.\n• Troubleshooting and resolving issues with coding or design.\n\nCandidate Profile:\n• 5-7 years of experience designing and implementing software applications\n• Professional programs certification in Java and others is desirable but not mandatory\n• Experience working on large-scale software projects\n• Demonstrated knowledge of web applications, cybersecurity, and open source technologies\n• Experience developing software utilizing various coding languages such as Java, PYTHON, C++ and more\n• Outstanding collaboration and communication skill are essential\n• Experience overseeing customized development of processes for multiple projects simultaneously\n• Professional experience analyzing code for weaknesses and errors, and overseeing plans to improve them\n• Experience designing secure software systems based upon industry-specific specifications\n\nInterest & Apply\n\nAdvance your career to the level with this unique opportunity in Singapore. To further consult on this role, please reach out to Hannah via hannah.tiong@springasia.com\n\nPosted by\nHannah Tiong\nConsultant, Information Technology\n\nEA License No. 09C5803\n\nRegistration No. R2091611\n\nJN -032021-64218", "extensions": ["19 days ago", "Full–time"], "detected_extensions": {"posted_at": "19 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU3lzdGVtIEFuYWx5c3QiLCJjb21wYW55X25hbWUiOiJTcHJpbmcgUHJvZmVzc2lvbmFsIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiItdTNjTlJualVleGRxb05DQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1OQyBKb2JzIFNpbmdhcG9yZSB8IE1OQyBKb2JzIEluIFNpbmdhcG9yZSIsImxpbmsiOiJodHRwczovL3NnLm1uY2pvYnouY29tL2pvYnMvc2VuaW9yLXN5c3RlbS1hbmFseXN0LXNpbmdhcG9yZS0zMzkxMTg/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Business Systems Analyst (Integration & Automation)", "company_name": "Workato", "location": "Singapore (+1 other)", "via": "via Bayt.com", "description": "Workato is the operating system for today’s fast-moving business. As a high growth company with over 6000 customers, Workato is revolutionizing the integration and automation market with investments from the top 3 SaaS companies - Salesforce, Workday, ServiceNow. Recognized as a leader by both Gartner and Forrester, it is the only AI-based platform that enables both business and IT to integrate their apps and automate workflows across their enterprise with robust security and governance. Some of the world’s top brands including Slack, Grab, Box, Visa, Broadcom run on Workato.\n\nWe are looking for an exceptional Business System Analyst (Integration & Automation) to join our growing team. In this role, you will work closely with lines-of-business teams to review/develop sound business processes and identify automation opportunities in these processes. Being the vital link between IT and business function, you will empower teams to respond quicker to changing business needs. For a glimpse... into what a Business System Analyst (Integration & Automation) does in Workato, refer to our Inside Workato’s Kitchen ebook, which includes projects and processes that our team has accomplished internally over the past year.\n\nWorkato has a positive, diverse, and collaborative culture—we look for people who are curious, inventive, smart, hardworking and work to be a little better every day. Workato has also been recognized amongst the “Top 47 Enterprise Startups to Bet Your Career On in 2020” and the “Hottest 13 Productivity Software Startups to Watch in 2020!” by Business Insider.\n\nResponsibilities\n• Assess and procure applications for internal use; build new connections to those applications through APIs\n• Manage and implement projects that coordinate and integrate the flow of critical business data through multiple functional areas and applications\n• Build, test and deploy robust internal applications, tools, bots, and real-time integrations that support Workato's strategic business goal\n• Document processes, applications and integrations used; educate users on the best practices of these processes\n• Develop comprehensive management reporting capabilities by using data from multiple sources and visualising to gather insights on these data\n• Assist in IT audit review to ensure that business processes are aligned across teams\n\nRequirements\nQualifications and Experience\n• Degree from a cross-functional background such as Business IT, Information Systems Management or other similar disciplines\n• 2 -3 years of relevant Business Systems experience. Fresh graduates with relevant internships are welcome to apply\n\nSkills\n• Ability to translate business requirements into technical specifications\n• Excellent written and oral communication skills in English\n• Good understanding of integration concepts, methodologies, and technologies\n• Comfortable with interpreting API documentation of cloud-based applications, know basic programming logic and SQL\n• Deep understanding of/experience in Salesforce platform(s) (e.g. Salesforce Sales Cloud, Salesforce Marketing Cloud) as you will be involved in the design and delivery of Salesforce implementations\n• Understanding of SaaS tools (e.g. Marketo, Greenhouse, Freshdesk, Netsuite) is a plus\n\nWhy Workato?\n• Supportive, collaborative, international team environment that supports remote employees (Currently all of us!)\n• Long-term prospects for a professional career in a high growth company\n• Flexible Work Culture\n• Be part of a community-oriented organization with a history of giving back\n• Best in class technology tools to empower you to do your best work\n• Support for professional development and continuous learning\n• Wellness programs, including fitness challenges and an occasional company day off to recover from Zoom fatigue\n• Company-sponsored team-bonding activities and team celebrations\n• Employee and Customer referral bonuses\n\nAll full-time permanent employees in Singapore will also have the following benefits:\n• Workato Stock Options at one of Silicon Valley’s fastest growing startups\n• Flexible and personalised medical and wellness benefits (protection for hospitalisation and surgical procedures, clinical outpatient visits, accident coverage and more", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJCdXNpbmVzcyBTeXN0ZW1zIEFuYWx5c3QgKEludGVncmF0aW9uIFx1MDAyNiBBdXRvbWF0aW9uKSIsImNvbXBhbnlfbmFtZSI6IldvcmthdG8iLCJjb21wYW55X21pZCI6Ii9nLzExZHhweV8zeGQiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJuNkp4S2tpM1Eycm9UbGRLQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VTBGcFYycE1lbkYyTUhNelVFdzBWa2RFVkRneWRtMXpSMDlqZDFjeGNuZFRNbUV0ZGtaa2MzY3dOVWg1Y2xrNFpHeE1PSFpFY1ZKbFlrTTVNWEZNTUZSSWJHRkJjMlY1VjBWak5rcE5VMlpaVTI5ZmFUSTRWRTV1Vm5KeE9IbHNUekJoTW0xSlNuQldUelpuYVVSbldEUXRORUo0TXpONFJWQlRPVmxhTmxCWlkwVkxjVlpWUVVGUVdIQnpNRkprTm1sdFIxUlpTRE5WVlZwbkVoWm5NMjFEV1VsUFpVYzVVMUYwUVdKM2EzRnhkMEpSR2lKQlQwMVpVbmRCUW01TmJubzVabTlHZVRKS05FcG9jazkyTWtKcVdIVllOelpSIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMjMiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQmF5dC5jb20iLCJsaW5rIjoiaHR0cHM6Ly93d3cuYmF5dC5jb20vZW4vc2luZ2Fwb3JlL2pvYnMvYnVzaW5lc3Mtc3lzdGVtcy1hbmFseXN0LWludGVncmF0aW9uLWF1dG9tYXRpb24tNTg3NDc4MTYvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "System Analyst - PEGA", "company_name": "Dynamic Human Capital Pte. Ltd.", "location": "Singapore", "via": "via Monster", "description": "Job Description & Requirements\n\nSpecifications\n\nMandatory\n\nThe candidate shall have the following requirements:\n\nAt least 2 years of working experience in:\n\nRelational Databases:\n\n• DB2\n\n• MS SQL Server\n\nAt least 4 years’ in-depth hands on application development experience in Pega PRPC\n\nand Pega frameworks.\n\nAble to work independently in gathering requirements from users, designing,\n\nimplementing, maintaining application systems and project management\n\nPreferred\n\nWorking experience in one or more of the followings:\n\n• Java, JavaScript, HTML/ CSS, Web Services (REST and/or SOAP).\n\n• PEGA PRPC configuration, installation, external systems interface and database integration.\n\n• PEGA PRPC Production BAU Support.\n\nPega PRPC CSA/CSSA/CLSA certification will be an added advantage.\n\nRequirement\n\nMandatory\n\n• Good communication and written skills.\n\nHOW TO APPLY:\n\nWe would like to invite interested applicants to email detailed resume in MS Word format to:\n\nWe regret to inform that only... shortlisted candidates will be notified. All applications will be treated with the strictest confidence.\n\nHo Si Cong\n\nRegistration number R1982598\n\nEA License: 12C6253", "extensions": ["15 days ago", "Full–time"], "detected_extensions": {"posted_at": "15 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTeXN0ZW0gQW5hbHlzdCAtIFBFR0EiLCJjb21wYW55X25hbWUiOiJEeW5hbWljIEh1bWFuIENhcGl0YWwgUHRlLiBMdGQuIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJCZVlXU3kzRTM0UW42T2ZBQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1vbnN0ZXIiLCJsaW5rIjoiaHR0cHM6Ly93d3cubW9uc3Rlci5jb20uc2cvYW1wL2pvYi12YWNhbmN5LXN5c3RlbS1hbmFseXN0LXBlZ2EtZHluYW1pYy1odW1hbi1jYXBpdGFsLXB0ZS1sdGQtc2luZ2Fwb3JlLTI3NjI0NDM5Lmh0bWw/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Senior Business Analyst", "company_name": "Experis Singapore", "location": " (+1 other)", "via": "via Singapore", "description": "Job Description The Business Analyst/Senior Business Analyst is the main liaison between the business and IT in translating business needs into system solutions. The candidate is required to conduct research on client's business needs, processes, requirements and its traceability. Develop and communicate effective system solutions. The person should possess an analytical mind and is able to see interconnections in system solutions and usability. Also should adopt a systematic approach in addressing complex issues with good judgement and arrive at effective solutions. Requirements Bachelor's degree in Computer-related discipline or equivalent Minimum 8 years of IT experience Minimum 6 years of IT Business Analysis experience Minimum 2 years working in Agile development projects experience Certified Business Analyst (CBA) certification is good to have Experience in developing Agile and/or UML requirements artifacts is mandatory Preference will be given to candidate with the following... skillset, Liaise with stakeholders to identify business needs Review existing business processes to identify opportunities Prepare business cases defining potential benefits, solutions to increase efficiencies of business processes and associated risks Propose alternative solutions to streamline business processes Establish requirements for the implementation of changes in the business processes Conduct in-depth analysis of the business requirements specification and feasibility studies Translate business requirements and user needs into functional specifications Collaborate with developers to ensure requirements are incorporated into system design Guide the team to gather and document existing system specifications Function as the liaison between users and technical staff throughout the solution implementation cycle Supervise User Acceptance Testing when needed Supervise technical documentation and training materials Manage user training to facilitate adoption of new systems features Act as a point of contact for users regarding complex queries Scope out statement of works setting clear expectations of deliverable and exclusions Spearhead initiatives or projects Arvin Clark Sikat, Sombilla EA License No.: 02C3423 Personnel Registration No.: R1222536 Please note that your response to this advertisement and communications with us pursuant to this advertisement will constitute informed consent to the collection, use and/or disclosure of personal data by ManpowerGroup Singapore for the purpose of carrying out its business, in compliance with the relevant provisions of the Personal Data Protection Act 2012. To learn more about ManpowerGroup's Global Privacy Policy, please visit https://www.experis.com.sg/privacy-policy", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQnVzaW5lc3MgQW5hbHlzdCIsImNvbXBhbnlfbmFtZSI6IkV4cGVyaXMgU2luZ2Fwb3JlIiwiY29tcGFueV9taWQiOiIvZy8xMWR4cG53bTNzIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoieUI0RjU4MHBENThuekhrWEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZZQkNyY0JRVTVWWDA1eFV6Wm9RMTlCWVUxYWNXRk5kRFU1U21aeVVHOU9hR1ZFVGkxVlVrZGFhVlpWTTFsUlRUaEhTR3BPUTFwRGVVNWFjMkZ3UkdSWVlVVXpTME5JVjBscFpURm1aR1ZGVXkxV2VVcE5YMHRMZVdGMFFWRkJiMUpmTkc5Nk9XcDBlbDlxZDNwV0xVcDVNelU0WmtoNlIzSm5SbUo0YkdweWVIbHdWRlkwVjBoeFpFVXpTRE5MTTI5WlZUUlVSMFpmYXpsRGJIRmFlak15TTBRNFRFc3hOeTF4WlhaVVREZERRa1Z4WDFoMFJFNWthV3RWRWhabk0yMURXVWxQWlVjNVUxRjBRV0ozYTNGeGQwSlJHaUpCVDAxWlVuZEJOWE5rZDFCSVNtSXhUa1ZvY0RCUE5qaENSblExUVMxQ2RrUm4iLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18zMyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBTaW5nYXBvcmUiLCJsaW5rIjoiaHR0cHM6Ly9zZy5maWRhbnRvLmNvbS9qb2JzL2pvYi1vcGVuaW5nL2J1c2luZXNzLWludGVsbGlnZW5jZS1hbmFseXN0cy9zZW5pb3ItYnVzaW5lc3MtYW5hbHlzdC0yNzU0Mzc2Mzg/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Systems Analyst – Sharepoint and .Net", "company_name": "WSH Experts Pte Ltd", "location": "Singapore", "via": "via LinkedIn", "description": "Job Description\n\nRoles & Responsibilities\n• Requirements gathering and writing of specifications;\n• Design, development and maintenance of the software;\n• Project and vendor management and quality assurance of deliverables;\n• Preparation and submission of deliverables throughout the software development lifecycles such as Business Rules, Software Requirement Specifications, Software Architecture Document, Design Specification, Interface Requirements, Source Codes, Testing Specification, Operation and Maintenance Manual, Training Manual and other documents as required in the standard adopted by SP;\n• Maintenance and support of the system, including the resolution of day-to-day support issues;\n• Liaison with users on the requirement, design and testing issues.\nRequirements:-\n• Recognized qualification in Computer Science or a relevant discipline;\n• Excellent skills in requirements analysis and design for SharePoint 2013/2016 applications;\n• Strong experience with industry-accepted... design patterns and best practices for SharePoint;\n• Minimum 2 years' experience with SharePoint Workflow, Web Parts, SharePoint custom applications, CSOM and other APIs, Bootstrap, JQuery, .NET Framework 4.5, C# and ASP.NET, .Net Core;\n• Minimum 2 years' experience with SharePoint Server, PowerShell, OOTB features, Configurable features and interaction between SharePoint and IIS;\n• Experience designing and implementing an information architecture using content types, site columns, page layouts, managed metadata, search, etc.;\n• Certified SharePoint and/or ASP.NET Core Developer;\n• Development experience of SharePoint/.NET Core on AWS Cloud, Xamarin, iOS and Android Mobile apps will be a bonus;\n• Experience in Agile Development and Project Management will be preferred.\n\nJob Description : Roles & Responsibilities * Requirements gathering and writing of specifications; * Design, development and maintenance of the software; * Project and vendor management and quality assurance of deliverables; * Preparatio\n\nSkills: Sharepoint, .NET, Asp.net, Bootstrap, Jquery, Sharepoint Server, Powershell\n\nExperience: 0.00-50.00 Years", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTeXN0ZW1zIEFuYWx5c3Qg4oCTIFNoYXJlcG9pbnQgYW5kIC5OZXQiLCJjb21wYW55X25hbWUiOiJXU0ggRXhwZXJ0cyBQdGUgTHRkIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJQWkQwbVFYVnE4eDlMMzNMQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExpbmtlZEluIiwibGluayI6Imh0dHBzOi8vc2cubGlua2VkaW4uY29tL2pvYnMvdmlldy9zeXN0ZW1zLWFuYWx5c3QtJUUyJTgwJTkzLXNoYXJlcG9pbnQtYW5kLW5ldC1hdC13c2gtZXhwZXJ0cy1wdGUtbHRkLTI0OTIyOTk1OTA/cmVmSWQ9NTE4OWU0NjctMmZhZS00ODA5LWJmNzUtNmYyNDk4M2YzYTQ4XHUwMDI2dHJhY2tpbmdJZD1xd1JuWE5VOGJ6NUJsV284WTg5cGdBJTNEJTNEXHUwMDI2dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "System Analyst", "company_name": "EMBRIO CONSULTING PTE. LTD.", "location": "Singapore", "via": "via MNC Jobs Singapore | MNC Jobs In Singapore", "description": "Duties and Responsibilities\n• Ensure Application and Production Resiliency; review and manage development changes\n• Enforce proper release and compliance with technology governance standards\n• Track record of successful JAVA based platform/ project implementation.\n• Liaise with multiple vendor, business, operations and technology stakeholders to ensure project delivery is on track\n• Enforce system development life cycle framework, internal and applicable external regulations and policies\n• Contribute towards strategic planning and applying technology solutions to business/ operations\n• Promote and enforce standard technical architecture adoption and application\n• Review technical specification document, source code from vendor\n• Develop non-functional sanity test scripts\n• Experience in conducting root-case analysis and tracing to resolve issues\n• Team player/contributor.\n• Strong communication enabler\n• Experience leading cross-workstream(s) and off-shore vendor delivery team(s)\n•... Analytical and problem-solving skills\n• Proactive personality and rise to challenges\n\nQualifications\n• Degree in Computer Science, Information Technology, Electrical Engineering, Banking Finance IT or equivalent\n• At least 5 years’ experience in banking systems analysis, design and development with good technical JAVA knowledge of IT systems\n• Oracle Java Enterprise Architect certified\n• Familiar with NEWGEN IBPS/ OMNIDOCS/ OMNIExtract\n\nInterested applicants are open to apply through this job ad with your most updated Resume/CV.\nEA Reg No: R1222708\n\nEMBRIO CONSULTING PTE. LTD.\n\nEA License Number 10C4154\nJob Types: Full-time, Contract, Permanent\n\nminimumYearsExperience : 5\n\n[CANDIDATES WHO REQUIRE WORK PASSES NEED NOT APPLY", "extensions": ["21 days ago", "Full–time"], "detected_extensions": {"posted_at": "21 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTeXN0ZW0gQW5hbHlzdCIsImNvbXBhbnlfbmFtZSI6IkVNQlJJTyBDT05TVUxUSU5HIFBURS4gTFRELiIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiaEY2YXdhaWo4Ui1qQVVjbUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNTkMgSm9icyBTaW5nYXBvcmUgfCBNTkMgSm9icyBJbiBTaW5nYXBvcmUiLCJsaW5rIjoiaHR0cHM6Ly9zZy5tbmNqb2J6LmNvbS9qb2JzL3N5c3RlbS1hbmFseXN0LXNpbmdhcG9yZS0xNjk2MjE/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "System Analyst", "company_name": "Cochlear Ltd", "location": "Singapore", "via": "via Bayt.com", "description": "About Us\n\nImagine using your experience to help people around the world to hear again. We can offer a unique opportunity to join Cochlear, an iconic Australian company, leading the world in implantable hearing solutions. Cochlear is the global market leader in implant hearing solutions and is a top 50 company on the ASX. Our mission is to help people hear and be heard.\n\nAbout the Opportunity\n\nThis is a fantastic opportunity for a System Analyst – Application Services (Oracle) to work in our IT department at our Sydney office. You will be responsible and accountable for end-to-end delivery of the Cochlear Manufacturing service(s) and for providing functional expertise for solution configuration and incident/problem resolution.\n\nKey Responsibilities\n• Both reactively and proactively investigate the root cause of problems and either perform, or\n\ncoordinate where necessary with internal and external teams, the actions required to resolve the problem including classification... prioritisation and initiation of action, documentation of root causes and implementation of solutions to prevent future incidents.\n• Take ownership for the identification, diagnosis and resolution of application related incidents in the business area of responsibility.\n• Use strategies to enable smooth transition through the change. Find the optimum time to\n\nschedule changes for the business to minimize end user impact on training and testing requirements\n• Participate in the development of user training material and the delivery of training for the business area of responsibility\n• Assist with the functional testing of solutions in the testing environment and potentially support the business during PVT.\n• Provides the link between the technical and business views of the system by ensuring that the technical solutions being developed will satisfy the needs of the business.\n• To work with Global Service Desk team to drive the efficiency and effectiveness of the process\n• Partners with business, architecture and infrastructure and oversees all service levels to ensure business area satisfaction.\n• Work in an Agile team to deliver high value work to achieve enterprise strategies.\n\nAbout You\n• Minimum 4-6 years of experience as an Oracle System Analyst specializing in Oracle Manufacturing.\n• Proficient Oracle Manufacturing functional knowledge and sufficient technical knowledge required. (Oracle WIP, BOM Routing, Inventory, Quality, Install base and Purchasing)\n• Oracle Quality and Customer Experience\n• Has eAM implementation and support knowledge\n• Demonstrated experience in improving systems and processes within a commercial environment\n• Responsive to customer needs, with excellent verbal and written communication skills\n• Demonstrated experience in project and change management.\n• Are eager to learn new skills and are very detailed orientated\n• A great team player and are to help where needed to ensure the success of the team\n• Passionate about Agile Principles and Values\n\nDevelopment Value of this role\n\nYou will have exposure to other departments and teams across the organisation, and gain further experience in developing your career, whether it be in testing or delivery lead, or working closer with the business within our squads, through to more senior and leadership roles.\n\nCochlear Summary\n\nCochlear’s mission is to help people hear and be heard. Around the world, more people chose a Cochlear-branded hearing implant system than any other. Our employees tell us that the number one reason they enjoy working for Cochlear is the opportunity to make a difference to people’s lives. Learn and grow with us as we tackle the most complex challenges in helping people to Hear Now. And Always", "extensions": ["22 days ago", "Full–time"], "detected_extensions": {"posted_at": "22 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTeXN0ZW0gQW5hbHlzdCIsImNvbXBhbnlfbmFtZSI6IkNvY2hsZWFyIEx0ZCIsImNvbXBhbnlfbWlkIjoiL20vMGtxcWdjIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoibDZBUFBoWGYyXzFsamFEc0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFVuZFBVbEl4YTFSRFpsZFZkakZzWjNVdFdIVlJRblZoTFdOT01HaE5PR3hwTmpocU5FWnlWbVp6WVVGYWVWVnJURFU0TXpCU1UzcDZRMWxvVGpsbmEybE9iMlZwWHpJME5GTjFhRTF2VTBNMVp6bHNVbXRWY25GMWQwNWZlV2RmU2tObU5IUjJObXB4UVhWcGJuWnRlVUZXY1RseGNITmtjV3BrUm1GWmNWWXpkbDg0ZVc1d2FIWTFZek5tTW1KNE1tbHFUMWczVEVGTVJqVkJFaFpuTTIxRFdVbFBaVWM1VTFGMFFXSjNhM0Z4ZDBKUkdpSkJUMDFaVW5kRFdVWnpObU5ZYUVWalVXeGtSek5JVFdGVlFqRjRXWHBsT0ZOMyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzQ4IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJheXQuY29tIiwibGluayI6Imh0dHBzOi8vd3d3LmJheXQuY29tL2VuL2ludGVybmF0aW9uYWwvam9icy9zeXN0ZW0tYW5hbHlzdC01OTMxMTAzNy8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Test Analyst (Manual)", "company_name": "Flintex Consulting Pte Ltd", "location": "Singapore", "via": "via Expertini.Com", "description": "Job Description\n\nJob Description:\n• a) Responsible for the end-to-end testing activities of an integrated e-payment system.\n• b) Carry out the activities in the testing lifecycle including test planning, analysing\n\nbusiness and system requirements.\n• c) Design and develop test cases or test procedures based on system requirements and\n\ndesign.\n• d) Create traceability to requirements, analysing gaps and addressing them.\n• e) Execute the test procedures and support in reporting results to project stakeholders.\n• f) Report and track defects to closure.\n• g) Conduct test reviews with internal and external stakeholders including explaining test\n\nreports to stakeholders.\n• h) Conduct test execution with internal and external stakeholders and support in\n\nensuring requirements are satisfied.\n• i) Perform root cause analysis for production and user acceptance defects, addressing\n\ntest gaps to ensure test efficiency.\n\nRequirements\n• a) Diploma in Information Technology / Computer Science ... Computer Engineering or equivalent.\n• b) Minimum 1-year experience in software testing with hands-on manual testing experience. Fresh graduates are welcome to apply.\n• c) Experience in test execution phases such Functional Testing, Integration Testing, User Acceptance Testing etc.\n• d) Experience in designing/developing test cases based on requirements and specifications.\n• e) Good knowledge with database scripting – DB2, MySQL etc.\n• f) Good written and verbal communication skills.\n• g) Familiarity with the system development lifecycle from requirements gathering,\n\ndesign, implementation, testing and deployment.\n• h) Relevant experience with the tools used for test management and defect tracking.\n• i) Able to work well both independently as well as in a team.\n• j) ISTQB/ISEB test certification is an advantage.\n• k) Experience in micro-payment or Automatic Fare Collection systems using Smart Cards\n\nis an advantage.\n\nBenefits\n\n13th month salary\n\nvariable bonus.\n\nRequirements\na) Diploma in Information Technology / Computer Science / Computer Engineering or equivalent. b) Minimum 1-year experience in software testing with hands-on manual testing experience. Fresh graduates are welcome to apply. c) Experience in test execution phases such Functional Testing, Integration Testing, User Acceptance Testing etc. d) Experience in designing/developing test cases based on requirements and specifications. e) Good knowledge with database scripting – DB2, MySQL etc. f) Good written and verbal communication skills. g) Familiarity with the system development lifecycle from requirements gathering, design, implementation, testing and deployment. h) Relevant experience with the tools used for test management and defect tracking. i) Able to work well both independently as well as in a team. j) ISTQB/ISEB test certification is an advantage. k) Experience in micro-payment or Automatic Fare Collection systems using Smart Cards is an advantage", "extensions": ["4 days ago", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJUZXN0IEFuYWx5c3QgKE1hbnVhbCkiLCJjb21wYW55X25hbWUiOiJGbGludGV4IENvbnN1bHRpbmcgUHRlIEx0ZCIsImNvbXBhbnlfbWlkIjoiL2cvMTFoMXo0MXB6YiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6InM5MXRCWUVJdXdYQUo4YWVBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVvc0NDc3dCUVU1VlgwNXhVMkV3VldGYWRUQXlRMnhWTVd4SFpUQkROVmRQUXpWUlZYWXRWRzFOWkVoaGRGVTNUek10ZWtVeVduTlVjR1pLUW5sTmRIZDNTVzh5UjJsa2FEQTJSV0ZEVEY5UmEzcHNSeTFDY2tsUmRrZEhXbmx2U3paNGJtcFRhVmxVUkhCNGMxbHdlRUV3YzI1WlowZHhMVmxPTXpGS1pFbGtObmt3Tm5jdFVFbEJWMFpvWnpkdWJ6bFBjR3hUUTBobGVIaHpiVzFpZDJseVZXcHpaWHBHUVUxNFgwTnFXbVJGZVY5U1gyaEpVMVU1TXkxelZsQk1ORXMxUkRGSFdqbFhhMFozTTFWaFMwNDJFaFpuTTIxRFdVbFBaVWM1VTFGMFFXSjNhM0Z4ZDBKUkdpSkJUMDFaVW5kQ1ptZHVXR3hXTTNKV1VFRkJUakJ0TWtKMkxYUnpZVmswV1VKQiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzU1IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEV4cGVydGluaS5Db20iLCJsaW5rIjoiaHR0cHM6Ly9leHBlcnRpbmkuY29tL3NpbmdhcG9yZS9qb2JzL2pvYi90ZXN0LWFuYWx5c3QtbWFudWFsLXNpbmdhcG9yZS0wMzk2YmRjMjI4NzUvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Business Operations", "value": "GC06"}, {"text": "Accounting and Finance", "value": "GC01"}, {"text": "Customer Service", "value": "GC10"}, {"text": "Human Resources", "value": "GC15"}, {"text": "Management", "value": "GC18"}, {"text": "Education", "value": "GC11"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Protective Services", "value": "GC23"}, {"text": "Science and Engineering", "value": "GC27"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "System analyst", "value": "system analyst"}, {"text": "Systems analyst", "value": "systems analyst"}, {"text": "Business analyst", "value": "business analyst"}, {"text": "It analyst", "value": "it analyst"}, {"text": "Analyst", "value": "analyst"}, {"text": "Senior", "value": "senior"}, {"text": "Security analyst", "value": "security analyst"}, {"text": "Application analyst", "value": "application analyst"}, {"text": "Engineer", "value": "engineer"}, {"text": "Project manager", "value": "project manager"}, {"text": "Software engineer", "value": "software engineer"}, {"text": "Hris analyst", "value": "hris analyst"}, {"text": "Lecturer", "value": "lecturer"}, {"text": "Manager", "value": "manager"}, {"text": "Senior analyst", "value": "senior analyst"}, {"text": "Soc analyst", "value": "soc analyst"}, {"text": "Sr analyst", "value": "sr analyst"}, {"text": "Support analyst", "value": "support analyst"}, {"text": "Support manager", "value": "support manager"}, {"text": "System", "value": "system"}, {"text": "Systems administrator", "value": "systems administrator"}, {"text": "Technology analyst", "value": "technology analyst"}, {"text": "Test analyst", "value": "test analyst"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Internship", "value": "INTERN"}, {"text": "Part-time", "value": "PARTTIME"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Mining", "value": "/business/naics2007/21"}, {"text": "Research", "value": "/business/naics2007/5417"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Accommodation", "value": "/business/naics2007/721"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Real Estate", "value": "/business/naics2007/53"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "OCBC", "value": "/m/055r27"}, {"text": "Jobline Resources Pte Ltd", "value": "/g/11gp2647pn"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Workato", "value": "/g/11dxpy_3xd"}, {"text": "Avensys Consulting", "value": "/g/11g7022gjf"}, {"text": "Chevron", "value": "/m/01pvx3"}, {"text": "ELITEZ PTE. LTD.", "value": "/g/11dxptfkcf"}, {"text": "ILLUMINA SINGAPORE PTE. LTD", "value": "/m/09mxkxs"}, {"text": "M1 LIMITED", "value": "/m/05n486"}, {"text": "Mantu", "value": "/m/0b6mxkc"}, {"text": "Public Service Division", "value": "/g/11g6__bv10"}, {"text": "Rakuten Asia", "value": "/g/11g7072z1v"}, {"text": "Techcom Solutions", "value": "/g/11c73vztx3"}, {"text": "United Overseas Bank Limited", "value": "/m/04gjd1"}, {"text": "VISA", "value": "/m/01kqjn"}, {"text": "Venture Corporation Limited", "value": "/g/11bc61gglw"}, {"text": "Xilinx", "value": "/m/03dwkc"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "Activate Interactive Pte Ltd", "value": "/g/11dxq192l5"}, {"text": "Aramco", "value": "/m/01qjg2"}, {"text": "Avnet", "value": "/m/0c8xmc"}, {"text": "BGC Group", "value": "/g/11g0j3fjv8"}, {"text": "Bgc Group Pte. Ltd.", "value": "/g/11g9mphr4f"}, {"text": "CONNECT ENERGY SERVICES PTE. LTD.", "value": "/g/11dxptylw6"}, {"text": "Cochlear Ltd", "value": "/m/0kqqgc"}, {"text": "Crédit Agricole Corporate and Investment Bank", "value": "/m/04n1_w"}, {"text": "Ecquaria Technologies Pte Ltd", "value": "/g/11dxq26pxz"}, {"text": "Edwards Lifesciences", "value": "/m/03p20ps"}, {"text": "Equinix", "value": "/m/07btnq"}, {"text": "Experis Singapore", "value": "/g/11dxpnwm3s"}, {"text": "Flintex Consulting Pte Ltd", "value": "/g/11h1z41pzb"}, {"text": "ITCAN Pte Limited", "value": "/g/11dxpstz9t"}, {"text": "Institute of Technical Education", "value": "/m/05_02p"}]}]}