{"search_metadata": {"id": "60827ab09bddf7433f8d3651", "status": "Success", "json_endpoint": "https://serpapi.com/searches/12ea1b6818b6fdd8/60827ab09bddf7433f8d3651.json", "created_at": "2021-04-23 07:43:44 UTC", "processed_at": "2021-04-23 07:43:44 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28software+developer%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=140", "raw_html_file": "https://serpapi.com/searches/12ea1b6818b6fdd8/60827ab09bddf7433f8d3651.html", "total_time_taken": 1.14}, "search_parameters": {"q": "(software developer) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "140"}, "jobs_results": [{"title": "Application Security Engineer", "company_name": "itForte Staffing Services Private Ltd", "location": "Singapore", "via": "via Learn4Good", "description": "Responsibilities:\n\n- Conduct white box and black box security scan, harden systems and application platform - Develop scripts to automate systems hardening and security vulnerability assessment - Maintain security test suite in QA build - Work with Software Quality Engineer on system integration testing - Work with Software Quality Engineer to manage defect life cycle - Work with Software Quality Engineer to improve testing processes and tools - Take on secondary role as an Application Performance Engineer or Software Quality Engineer Key Skills/Qualifications:\n\n- Min 2 years of experience in application security vulnerability assessment, analysis and remediation - Experience in agile development environment will be an added advantage\n\n- Experience with continuous integration and continuous delivery, using Atlassian Bamboo or other similar tools will be an added advantage - Experience in public cloud providers such as GPC, GCC (i.e. AWS, Azure, Google Cloud) will be an added... advantage\n\n- Experience with ZAP, Burp Suite, SQL Map, HP WebInspect or equivalence will be an added advantage\n\n- Experience with Checkmarx or equivalence will be an added advantage - Certified Secure Software Lifecycle Professional (CSSLP), Certified Information Systems Security Professional (CISSP) or equivalence will be an added advantage - Degree or Diploma in Computer Science, Computer or Electronics Engineering, Information Technology or related disciplines", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBcHBsaWNhdGlvbiBTZWN1cml0eSBFbmdpbmVlciIsImNvbXBhbnlfbmFtZSI6Iml0Rm9ydGUgU3RhZmZpbmcgU2VydmljZXMgUHJpdmF0ZSBMdGQiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IkJjU1dnWmplbnpoTHI5QnJBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGVhcm40R29vZCIsImxpbmsiOiJodHRwczovL3d3dy5sZWFybjRnb29kLmNvbS9qb2JzL3NpbmdhcG9yZS9pbmZvX3RlY2hub2xvZ3kvMjcxMjkxNzI0L2UvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Software Developer (BB-A47EA)", "company_name": "Globaltix Pte Ltd", "location": "Singapore (+1 other)", "via": "via BeBee", "description": "GlobalTix is a comprehensive technology solutions provider to the travel trade. Today, it is the one of the largest B2B marketplace for tours and activities in Asia, linking over 2,000 partners with more than 80,000 products from 120 cities. GlobalTix’s cloud-based and platform agnostic e-ticket distribution platform serves to connect tourist attractions and niche services with online and offline travel agents across the globe. Its integrated solution supports attraction owners’ online sales, empowering them to meet end consumers’needs via real-time bookings and the convenience of a single, all-in-one paperless ticket.GlobalTix solution won the Best Business Innovation Award by Singapore Tourism Board. With a passionate team, we were rewarded with the 8th fastest growing companies in Singapore in 2020 and ranked 34 in Asia-Pacific.The company, which was launched in 2014, has offices in Singapore, Malaysia, Thailand, Indonesia and Philippines. It handles more than S$150 million worth... of transactions on its platform annually. GlobalTix works with customers such as Singapore Airlines, Wildlife Reserves Singapore, Nerf Action Xperience, National Gallery Singapore, Kidzania Thailand, Escape Theme Park in Malaysia, Viator and TripAdvisor, among others.The RoleSoftware DevelopmentBe a Scrum development team member Ability to collaborate with team effectivelyAble to support storyboarding effort of the teamCapability to contribute in all phases of the development cycleDevelop and enhance applicationsDevelopment activities are expected to be carried out with minor supervisionAble to deliver working software on timeAble to design and develop high quality code as per standards and guidelinesPeer-Review of codeCan perform peer-review to ensure code quality and requirements are metSoftware SupportSupport SIT and UAT activitiesAble to assist smooth delivery of software to SIT and UAT environmentsProvide support for productionCapable to fix assigned bugs quicklyAble to update status and work details in Bug/Issue Tracking SystemIdeal ProfileCandidate must possess at least Bachelor's Degree/Post Graduate Diploma/Professional Degree in Computer Science/Information Technology or equivalent.Minimum of 2 years of experience in software developmentPossessing any of the certifications or equivalent would be an added advantage a) Certified JAVA Developer b) Certified Scrum Developer (CSD)Strong analytical skills, able to solve complex problemGood knowledge and implementation of REST APIsKnowledge of Agile and ScrumExperience with modern web technologies, HTML5, CSS3Experience with Javascript and frontend frameworks e.g. AngularExperience with JDK 1.5 and above, J2EE and Spring, Hibernate framework, Grails/GroovyKnowing C, C++ and C# is advantageousExperience with J2EE application servers GlassFish, Jetty or equivalentWorking with Databases – MySQL, Oracle, SQL Server or equivalentKnowledge of Design Patterns e.g. MVCFamiliar with source control management system such as SVN, GIT or equivalent.Familiar with usage of bug tracking system such as BugZilla, JIRA or equivalent.Experience with mobile hybrid development as well as native e.g. Cordova/PhonegapAble to communicate in English fluently both verbal and writtenWhat's on Offer?Great work environmentWork alongside & learn from best in class talentOpportunity to make a positive impact", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBEZXZlbG9wZXIgKEJCLUE0N0VBKSIsImNvbXBhbnlfbmFtZSI6Ikdsb2JhbHRpeCBQdGUgTHRkIiwiY29tcGFueV9taWQiOiIvZy8xMWR4cHFkaHJmIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoicE00Q0dpSHBNX1VwekJUWEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZZQkNyY0JRVTVWWDA1eFVuQnlZMHBwTnkwemIwVk5ZbWxCUTJnM2EwdEZSV0pSUW14Tk9IaHFRV3MyYmtRdGNVeDVNVkpwUm1kZlFXeEdMVWhmTTI4MGRYUlZNbWxxVkVad1Z6Sm5RMkpSZWpZNU9YWlJhVGhWVkVoeGFqWktNSFZMTWswMlJVZHRUR2RCTFVkSFowWlpTMFpRVEhGbk1qWXhVa3MyTnpOMWFXVldUV1JyTVRJelptVmhXSGh3V1VOMlpXNTZRMGN6Y0d3eldVcHViVGxaT1ZaV2VpMXZlRlJUVGkxbWFuWjVPVzVQY21wT2JGZHdiMTlORWhaelNIRkRXVkJITTB3NWJVZDBVV0UwZEdKUFNVRjNHaUpCVDAxWlVuZEVSbk5mWVhWWk0zVnJYek00VTAxa05HWktUamhPVUdWYU5EQm4iLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18xMSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCZUJlZSIsImxpbmsiOiJodHRwczovL3NnLmJlYmVlLmNvbS9qb2IvMjAyMTA0MTctYjg4YTZkMjgwYmMyYTBjMjNkYTc4MjA3MzllYTQ3ZWE/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "JavaScript Developer", "company_name": "The Talent Shark", "location": "Singapore (+1 other)", "via": "via Glassdoor", "description": "Our client, a top 10 global IT services provider with 130,000+ employees in more than 50 countries, who excel in blending IT and business expertise with decades of industry know-how. They help clients transform through consulting, industry solutions, business process services, IT modernization and managed services. They enables clients, as well as society, to move confidently into the digital future.\n\nDue to the business expansion, they are seeking local talents who have the experience as a Javascript developer to develop evolving ecosystems with our clients through leading-edge technologies.\n\nResponsibilities:\n• Develops software solutions by studying information needs; conferring with users; studying systems flow, data usage, and work processes; investigating problem areas; following the software development lifecycle.\n• Determines operational feasibility by evaluating analysis, problem definition, requirements, solution development, and proposed solutions.\n• Documents and... demonstrates solutions by developing documentation, flowcharts, layouts, diagrams, charts, code comments and clear code.\n• Prepares and installs solutions by determining and designing system specifications, standards, and programming.\n• Improves operations by conducting systems analysis, recommending changes in policies and procedures.\n• Updates job knowledge by studying state-of-the-art development tools, programming techniques, and computing equipment; participating in educational opportunities; reading professional publications; maintaining personal networks; participating in professional organizations.\n• Protects operations by keeping information confidential.\n• Provides information by collecting, analyzing, and summarizing development and service issues.\n• Accomplishes engineering and organization mission by completing related results as needed.\n• Supports and develops software engineers by providing advice, coaching and educational opportunities.\n• Provide level 2 and 3 support to business users.\n\nRequirements:\n• Minimum 3 years of relevant working experience\n• Proven experience as a JavaScript Developer with good knowledge on Java scripting framework\n• Good working knowledge in Node JS, Express, React\n• Extensive experience with JavaScript Framework, front end or backend development.\n• Strong JavaScript development experience with RDMS like Oracle or MongoDB\n• Good understanding of development methodologies, testing practices, and tools and knowing when to apply each method to achieve the desired outcomes.\n• Good knowledge of Jest, Mocha and DevOps (Jenkins), automated testing would be beneficial.\n• Familiarity with architecture styles/APIs (REST, API, MVC)\n• Client/Server scripting framework (JavaScript, Angular.js, React JS, Node.js)\n• Excellent troubleshooting and communication skills\n• BSc/BA in Computer Science, Engineering or a related field\n• Knowledge of security standards and techniques for web applications\n• Understand browser-specific compatibility issues\n• Expertise in the design, implementation, and deployment of user-centric software, with focus on usability\n\nAdded advantages\n• Understanding and practicing of Agile methodologies\n• Certification in Java or equivalent\n• Familiar with Cloud application deployment such as (azure, aws or google cloud)\n• Experience in Java based mobile application\n• Experience in Java/J2EE, .Net and/or mobile Technologies\n• Experience in Form.IO implementation", "extensions": ["2 days ago", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJKYXZhU2NyaXB0IERldmVsb3BlciIsImNvbXBhbnlfbmFtZSI6IlRoZSBUYWxlbnQgU2hhcmsiLCJjb21wYW55X21pZCI6Ii9nLzExZ214Nmh2MnoiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJPb0Rsd0FETzg4YjN3bXExQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdllCQ3JjQlFVNVZYMDV4VkRSb0xVdGlTMEZpU0hjdGJtcFFhRzVHTjIxa1VGVjRkREI1U1VoaWR6WnBUbEpIVDFoNmJGUXRhVlJCUmxwQk5uVktkRTFwYW5WSldtRlNhVEZUY3pCSVZVcG9RVWRhWjNCUE4xRkJTWFl0Um14MU1sZzNjMk5xTUVaT2VuaE5NM2xVVWxoVlIwZFZZVU5EYmpGSFIwcDJPV0pDZVRkeFQzZEhWemRtZUVjd1UwRk9hVEpxWTFBMmVtUmFOV040YjBzelRtRnplVEZSWkdWaFZqZHVNWEV0WDNadk9GaGFWVzVHTVdFNFZXUkJFaFp6U0hGRFdWQkhNMHc1YlVkMFVXRTBkR0pQU1VGM0dpSkJUMDFaVW5kQ05qUTNiVVZYUTB0R1RXRmFhVEZCYkhwTFdtWm5RM1J0WHpkQiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzE5IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEdsYXNzZG9vciIsImxpbmsiOiJodHRwczovL3d3dy5nbGFzc2Rvb3Iuc2cvam9iLWxpc3RpbmcvamF2YXNjcmlwdC1kZXZlbG9wZXItdGhlLXRhbGVudC1zaGFyay1KVl9JQzMyMzU5MjFfS08wLDIwX0tFMjEsMzcuaHRtP2psPTQwNjMyNzYzMjFcdTAwMjZ1dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior Software Engineer", "company_name": "Cardinal Health Singapore 225 Pte. Ltd", "location": "Singapore (+1 other)", "via": "via Jobs", "description": "Show recruiters you're immediatley available for job opportunities Posted On: 5 days ago Total Views: 6 Total Applications : 1 Job Id: 27388169 Permanent Job Job DescriptionReporting to: R&D Section ManagerJob Summary Work on software design, implementation, verification and coordinate with US software team and software vendors on software related projects. Ensure that all product development conforms to design specifications and coding standards for medical devices.Responsibilities Support project team activities related to product development lifecycle, certification, and problem solving Member of small project development team Design and develop web-based solutions Work on technical problems related web development Comfortable with doing both frontend and backend work Support validation activities per organization policies and procedures Create technical deliverables and provide technical Subject Matter Expertise Participate in Agile development lifecycle methodology, code... configuration management process and code deployment process Provide input into technical design & implementation and system configuration management Generate and maintain technical documentation required to support design control requirement and regulatory submissions Work closely with cross functional teams and external vendors to ensure timely project delivery Requirements Bachelor’s degree in computer science, web development or equivalent is required Experience working in medical device industry is advantageous Experience in Spring Boot, Git and API integration Knowledge of software integration testing Basic cybersecurity knowledge Familiarity with cloud computing Vue.js framework and Database experience is preferred Agile environment is preferred Swift/IOS and/or Android development for mobile development is preferred Team player qualities and good interpersonal skills We currently have an outstanding opportunity for a Senior Software Engineer who will focus on developing software components for video management applications. You will be based in our research & deveJob Description Develop high-quality IT-oriented software products Participate and contribute in the requirement consolidation and product design Manage the product development lifecycle fromThe day-to-day activities: * Design and write with the cutting edge GO language to improve the availability, scalability, latency, and efficiency of Grab's range of services * Design and write dThe Position: Senior Software Engineer will develop information systems by studying operations; designing, developing and installing software solutions; support and develop software team. He/she will 1. Job Description a. Responsible to configure, setup, design process sequences, troubleshoot and fine-tune of process on project using FASA applications or help to develop them. b. Responsible to cWe are on the lookout for software engineers excited about working on today’s cloud native and Kubernetes challenges. You enjoy solving the complexities of cloud native development and are passionate Location: 1 Fusionopolis Place, #06-20, Galaxis (West Lobby), Singapore 138522 We are Aria Health. Advancing technology, building community, and bringing a personal focus to therapy. We’re working tJob Description * Embedded system development * Wireless AP router software and firmware development * Participate in full system development life cycle with application design, development, 1. Job Description a. Responsible to configure, setup, design process sequences, troubleshoot and fine-tune of process on project using FASA applications or help to develop them. b. Responsible to cJob Responsibilities: - Create specifications and define software architecture for embedded systems - Design and develop MCU based firmware for embedded system - Design and develop middleware, applGive your career a boost with Monster's resume services.Simple body text this will replace with orginal content Toll Free No: +8001-012-339 91-40 66116994", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgRW5naW5lZXIiLCJjb21wYW55X25hbWUiOiJDYXJkaW5hbCBIZWFsdGggU2luZ2Fwb3JlIDIyNSBQdGUuIEx0ZCIsImNvbXBhbnlfbWlkIjoiL20vMDluMGpobSIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Ikw0MzRxbEI2ZlZoVU53RjVBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVxRUNDdUlCUVU1VlgwNXhVazgxYTFOemFGaHBObGh4U1ROdmNEWlJTSFZLT0hGd2VURjFVVEpGYUVGR2JuTjRhbkJaVTJOMFNYbzRWa2xFV0dscFEwTnJabE5DYm5wblVHOTBSQzFsWjNSdGFHdFFTakZ1UTA5ZlZuSnBVelJUT1dka05HOWlZekl6VmpNeWJqWktXblpSTFROU1QwWk5jVGM1V0VsR1ZrMXBlR2xIWHkxa1JWZzBWVk5ITjB0bFZuZFZhMk5XWWxKNGVFVm5aMXBHYm5CM1gwWjRaRzFtZW1ReE5rMTRTRk5pWVRCdFpta3RZVlp0VEZVNWVHSk5la3BJV2pSQllYcEpTazA0Y3pGWlpqSlVNRkZZU21SZlZsTkVhMnd5VURoRmMxTkJXVWRMVVJJV2MwaHhRMWxRUnpOTU9XMUhkRkZoTkhSaVQwbEJkeG9pUVU5TldWSjNRbDlZWDNGWlgzSnhNbWhNWmpsUVFtaG9hMVUyV25wdVdFVlVkdyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzI2IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnMiLCJsaW5rIjoiaHR0cHM6Ly9zZy5maWRhbnRvLmNvbS9qb2JzL2pvYi1vcGVuaW5nL3NvZnR3YXJlLWRldmVsb3BlcnMtc3lzdGVtcy1zb2Z0d2FyZS9zZW5pb3Itc29mdHdhcmUtZW5naW5lZXItMjc1NDM3MjUzP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Frontend Software Engineer", "company_name": "Zühlke", "location": "Singapore (+1 other)", "via": "via NodeFlair", "description": "• Thrive in an environment where you can express your passion and enthusiasm for software development and be inspired by your colleagues’ enthusiasm. As a frontend software engineer, you will cooperate with interdisciplinary teams in projects and experience how technology and team spirit unite to create innovative solutions.\n• Your job will involve working closely with clients to develop, test, and ship software that meets their needs. You will efficiently and competently solve complex software challenges. Continuous further development and active knowledge exchange mean that you will be working with the latest methods and tools to stay up to date with the latest trends.\n• Our reputation is fundamental to our business, so our culture emphasizes quality, reliability, and respect. We value learning new technologies and skills; thus, you will get a generous budget to attend conferences, participate in certified courses, and our annual technical camp is a lot of fun.\n\nWhat you should... offer?\n• You have a degree in computer science or an equivalent related field (bachelor's/master's).\n• You have professional experience in ReactJS for at least 3-5 years.\n• You have proven expertise in the JavaScript ecosystem (Es, Typescript) and frameworks like ReactJS and its ecosystem (Redux, ES6, CodePush) where you apply your in depth knowledge to build highly-responsive user interfaces or progressive web applications which integrate with REST APIs AJAX and JSON.\n• You have strong knowledge in development (IDEA, Storybook), state management (Redux), application architectures (Flux).\n• You leverage your development workflow with tools like npm, webpack, NodeJS.\n• You have multiple years of experience with state-of-the-art web architectures and enjoy developing modern web applications where you design, develop, and maintain code that meets requirements, is high quality, and performs efficiently and effectively to provide a great customer experience.\n• You value high quality code standards and your implementation includes best practices with considerations of performance, security, scalability, and maintainability and you want to satisfy your thirst for knowledge of the latest technologies every day.\n• You have data visualization experience with tools like Plotly, D3.js, or Highcharts.\n• You have good experience with Development and Operations (DevOps), using continuous integration (CI) and continuous delivery (CD) to ship incremental improvements and have used CI/CD tools such as git, GitHub, Jira, Jenkins, or equivalents.\n• You have a thorough knowledge of building and deploying Full Stack applications, including experience in automated testing frameworks like Mocha, Jest and Enzyme or similar.\n• You have professional experience working in an agile development environment where you lead the collaboration within internal application stakeholders, Infrastructure team and vendors / third-party services to deliver the full lifecycle , including requirements, architecture, design, development, testing, deployment and support. Ideally, you are a certified Scrum developer or master.\n• You have strong communication skills, like making decisions, believe in continual improvement and investment in your knowledge and work independently.\n• As a plus, you have experience in AWS cloud engineering & implementation\n• As a plus, you have good understanding of digital banking products, processes, and retail banking systems", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJGcm9udGVuZCBTb2Z0d2FyZSBFbmdpbmVlciIsImNvbXBhbnlfbmFtZSI6IlrDvGhsa2UiLCJjb21wYW55X21pZCI6Ii9nLzFoaF9yZzIxNiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IlBSb01DSktRQm1TbXc4WFZBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhWRzB4YjNaNWIwTm5RMEpZV1dGWGIyZHJUemt3TUZsMVUzcFllR0pCVWtRMmVUUndNRmhWYUVGemFUTkdWR3gzVDFCbFdrcFpkVXd4WW05UFYwOXZWMlIwZEdkNGJHWjZkVWh2Y1MxMGRWcFRWakZSTUd4cVIzWlVVekp6UTJkclNrZE1MVmxNUjIxMFVtRklhRjlpZWw5c1VXaFNjbkkxYVVoamQzQlFhVmhSV2w4ek1uaDJNelZ0WWkwd1gyUm1TMFp0VXpReWNuTTROMkZCRWhaelNIRkRXVkJITTB3NWJVZDBVV0UwZEdKUFNVRjNHaUpCVDAxWlVuZEVMV2xPTTFGZmNHYzNPVEZ4WmxsclVVVkRRMTlqZEhSdWVYWlIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18zMyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBOb2RlRmxhaXIiLCJsaW5rIjoiaHR0cHM6Ly9ub2RlZmxhaXIuY29tL2pvYnMvbGlzdGluZ3MvODM2ND91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Software Developer", "company_name": "GlobalTix - Tours & Activities Tech Provider", "location": "Singapore", "via": "via LinkedIn", "description": "GlobalTix is a comprehensive technology solutions provider to the travel trade. Today, it is the one of the largest B2B marketplace for tours and activities in Asia, linking over 2,000 partners with more than 80,000 products from 120 cities.\n\nGlobalTix’s cloud-based and platform agnostic e-ticket distribution platform serves to connect tourist attractions and niche services with online and offline travel agents across the globe. Its integrated solution supports attraction owners’ online sales, empowering them to meet end consumers’needs via real-time bookings and the convenience of a single, all-in-one paperless ticket.\n\nGlobalTix solution won the Best Business Innovation Award by Singapore Tourism Board. With a passionate team, we were rewarded with the 8th fastest growing companies in Singapore in 2020 and ranked 34 in Asia-Pacific.\n\nThe company, which was launched in 2014, has offices in Singapore, Malaysia, Thailand, Indonesia and Philippines. It handles more than S$150 million... worth of transactions on its platform annually. GlobalTix works with customers such as Singapore Airlines, Wildlife Reserves Singapore, Nerf Action Xperience, National Gallery Singapore, Kidzania Thailand, Escape Theme Park in Malaysia, Viator and TripAdvisor, among others.\n\nThe Role\n\nSoftware Development\n\nBe a Scrum development team member\n• Ability to collaborate with team effectively\n• Able to support storyboarding effort of the team\n• Capability to contribute in all phases of the development cycle\n\nDevelop and enhance applications\n• Development activities are expected to be carried out with minor supervision\n• Able to deliver working software on time\n• Able to design and develop high quality code as per standards and guidelines\n\nPeer-Review of code\n• Can perform peer-review to ensure code quality and requirements are met\n\nSoftware Support\n\nSupport SIT and UAT activities\n• Able to assist smooth delivery of software to SIT and UAT environments\n\nProvide support for production\n• Capable to fix assigned bugs quickly\n• Able to update status and work details in Bug/Issue Tracking System\n\nIdeal Profile\n• Candidate must possess at least Bachelor's Degree/Post Graduate Diploma/Professional Degree in Computer Science/Information Technology or equivalent.\n• Minimum of 2 years of experience in software development\n• Possessing any of the certifications or equivalent would be an added advantage a) Certified JAVA Developer b) Certified Scrum Developer (CSD)\n• Strong analytical skills, able to solve complex problem\n• Good knowledge and implementation of REST APIs\n• Knowledge of Agile and Scrum\n• Experience with modern web technologies, HTML5, CSS3\n• Experience with Javascript and frontend frameworks e.g. Angular\n• Experience with JDK 1.5 and above, J2EE and Spring, Hibernate framework, Grails/Groovy\n• Knowing C, C++ and C# is advantageous\n• Experience with J2EE application servers GlassFish, Jetty or equivalent\n• Working with Databases – MySQL, Oracle, SQL Server or equivalent\n• Knowledge of Design Patterns e.g. MVC\n• Familiar with source control management system such as SVN, GIT or equivalent.\n• Familiar with usage of bug tracking system such as BugZilla, JIRA or equivalent.\n• Experience with mobile hybrid development as well as native e.g. Cordova/Phonegap\n• Able to communicate in English fluently both verbal and written\n\nWhat's on Offer?\n• Great work environment\n• Work alongside & learn from best in class talent\n• Opportunity to make a positive impact", "extensions": ["Over 1 month ago", "$36K–$60K a year", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time", "salary": "$36K–$60K a year"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBEZXZlbG9wZXIiLCJjb21wYW55X25hbWUiOiJHbG9iYWxUaXggLSBUb3VycyBcdTAwMjYgQWN0aXZpdGllcyBUZWNoIFByb3ZpZGVyIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJRM3Z5ZUJfUHc2Rm8tRXo0QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExpbmtlZEluIiwibGluayI6Imh0dHBzOi8vc2cubGlua2VkaW4uY29tL2pvYnMvdmlldy9zb2Z0d2FyZS1kZXZlbG9wZXItYXQtZ2xvYmFsdGl4LXRvdXJzLWFjdGl2aXRpZXMtdGVjaC1wcm92aWRlci0yNDI1NjE4OTAxP3JlZklkPTllYzFjNWQwLTE5NGQtNGMzMC1iY2ViLTNmMjJiMzYxZWY2NFx1MDAyNnRyYWNraW5nSWQ9TnpSZmZMeGlzVlc3NGc2WUpjYjZJdyUzRCUzRFx1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Senior Software Quality Assurance Engineer", "company_name": "Dyson", "location": "Singapore", "via": "via Monster Singapore", "description": "About us\nSoftware Test & Quality Assurance ensures the products we sell represent the high Quality and Reliability of the Dyson brand, by using the world class techniques to implement automated methods of testing. This can involve simulating elements of the product to allow testing of all scenarios, to using image recognition or advanced technologies for automatic identification of elements displayed on the user interface. Quality is ensured and actively maintained during the Scaled Agile Framework development process by our QMS experts, and accepting customer correspondence to improve future products. Our labs allow unattended testing of partial to full products including moving robots, allowing the team to work remotely. It is a great opportunity if you want to enrich your cross subjects skillset to join the world best software test & QA teams. About the role\nIn this role you will provide software quality assurance support to software development teams. This role will ensure that... project teams follow the defined software development process and conformance to related regulations and related industry standards. As a member of the software quality assurance team you will work with the team to implement continuous improvement to the software quality process, monitor the health of implemented software systems and provide guidance to project teams. As a key member of the software quality department, the individual in this role will be responsible for ensuring compliance to Dyson software quality policies and procedures.\n• Provide ongoing software quality engineering support throughout the software development life cycle. Assist teams in determining verification and validation needs and requirements.\n• Provide support for software development projects by review/approval software deliverables:\n• Software assessment, software development, verification & validation plans\n• User requirements, functional/software requirements\n• Configuration specification, software architectural and design documents, peer review\n• Risk management documents\n• Test protocols, requirement traceability matrix, summary reports\n• Provide review and approval of software related change orders\n• Ensure successful transfer of software from development into manufacturing product support\n• Participate in software risk management process throughout the entire software development lifecycle\n• Ensure compliance of validation efforts performed by internal/external validation personnel\n• Provide quality assurance support to software related CAPAs\n• Provide software project status updated and software validation status to management\n• Participate in the process improvements to the software quality assurance program\n• Assist in the development and delivery of training to employee on principles of software validation, software risk management, and general quality tools\n• Responsible for exhibiting professional behaviour with both internal/external business associated that reflect positively on the company and is consistent with the companys policies and practices\n• Optimize Dyson products software developments process, ensure followed throughout the entire development and QA\nAbout you\n• >3 years software quality management or relevant experience.\n• Certified software quality engineer preferred, such as CQQE, ISO auditor\n• Bachelor Degree in Computer Engineering / Electrical / Electronic Engineering, or related fields.\n• Knowledge of software in IOT products, such as embedded, app, cloud and so on.\n• Experience in regulated environment, such as ISO, IEC, FDA and so on standards,\n• Experience with Agile software development, Devop, software verification and validation\n• Excellent attention to detail, strong communication skill, and ability to work independently and in teams.\n• Able to work in fast-paced environment and delivery quality under minimal supervision\n• Deep understanding of Software and SQA processes and methodologies in a software development environment\n• Experience with software configuration management\nBenefits\nDyson Singapore monitors the market to ensure competitive salaries and bonuses. Beyond that, youll enjoy a transport allowance and comprehensive medical care and insurance. But financial benefits are just the start of a Dyson career. Professional growth, leadership development and new opportunities abound, driven by regular reviews and dynamic workshops. And with a vibrant culture, the latest devices and a relaxed dress code reflecting our engineering spirit, its an exciting team environment geared to fuelling and realising ambition.\n#LI-DYSON Interview guidance\nWe are following the government guidelines regarding COVID19. At this time all interviews will be conducted via video or telephone. Were taking these precautionary measures to protect both our employee and candidate wellbeing. Our Talent Acquisition team will work with you and provide further information as appropriate", "extensions": ["7 days ago", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgUXVhbGl0eSBBc3N1cmFuY2UgRW5naW5lZXIiLCJjb21wYW55X25hbWUiOiJEeXNvbiIsImNvbXBhbnlfbWlkIjoiL20vMDVjc2tnIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiYS0wTkZ3VUhlTzRNZW14NUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXNzQkNvd0JRVTVWWDA1eFZHNVBUa2hSUzNZeE1tMUVTM2w1YzNweFZuUTVOSHBXZUZSdFEzSndjVFp6Tkd0NlZXZFdTWEo0UkZKdlZGZFhTMUZYVXpKYVZtTndlbmxtVjE5U2JuZzVaSGN3Wm1adFYyRnVaV1ZQTldwVVNXcEllV0pRTm1GaVNHYzJiSFZMWTJWbFVHbEJMVWQyYjE5RVJGSnVObE5xTkZScGFqVktZWEpXU1ZkdFozTkxWRU5SYlU4U0ZuTkljVU5aVUVjelREbHRSM1JSWVRSMFlrOUpRWGNhSWtGUFRWbFNkMFJWZFVNNGRYWlJaRk0wZWpOTldtZEtOek15ZW1SSWJsQjBZWGMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY180NyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNb25zdGVyIFNpbmdhcG9yZSIsImxpbmsiOiJodHRwczovL3d3dy5tb25zdGVyLmNvbS5zZy9hbXAvam9iLXZhY2FuY3ktc2VuaW9yLXNvZnR3YXJlLXF1YWxpdHktYXNzdXJhbmNlLWVuZ2luZWVyLWR5c29uLXNpbmdhcG9yZS0yNzc0NDA4NS5odG1sP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Application Developer​/Magento Commerce", "company_name": "ACCENTURE PTE LTD", "location": "Singapore (+1 other)", "via": "via Learn4Good", "description": "Position: Application Developer (Magento Commerce)\nRoles &\n\nResponsibilities\n\nJob\n\nDescription:\n\nDesign, build and configure applications to meet business process and application requirements. Work with the platform technologies and languages such as PHP, graphql, HTML, CSS, JavaScript, and REST/API services.\n\n- Customize the platform's storefront accelerator to build fully functioning e-commerce sites on desktop, tablet, and mobile devices - All code must conform to platform-specific & industry-leading practices.\n\nKey\n\nResponsibilities:· Demonstrated ability to understand technical documentation such as functional requirements and technical designs and translate these documents into working code.· Demonstrated ability to debug and troubleshoot issues with both existing and new code on the Magento Commerce platform· Develop Digital Consumer experiences based on a foundation of Magento commerce· Develop awesome features such as product search, order management, promotions, store... locator, social ecommerce etc· Setup Magento development environments and sandboxes· Develop and deploy simple custom CMS components· Diagnose and solve technical problems related to commerce and Magento implementation· Write application code that exceeds the defined quality standards· Knowledge of project and collaboration tools such as JIRA, Rally, Microsoft Teams, Confluence, and SharePoint.\n\nRequirements· 3-4yrs of Magento commerce development experience· Solid understanding of Magento Commerce architecture. Fastly, Redis, Database, Search, MCOM etc· Knowledge expertise in Magento version 2 is required and should have experience in implementing supporting Magento B2C, B2B applications· Good in Object Oriented Programming concepts, MVC architecture· Magento Expertise - basic concepts configurations, DB schema, Theming Layouts· JavaScript/JQuery, MySQL, CSS, HTML5, Bootstrap, PHPUnit, Web services· Good communication and team handling skills·\n\nGood analytical and presentation skills· Knowledge on software architecture and multiple project methodologies: waterfall, agile, Scrum, et al.· Good Communication skills and should be able to handle client communications· Bachelor’s degree· Magento developer certification is a plus\n\nTell employers what skills you have\n\nAgile Methodologies\n\nBusiness Process\n\nHTMLJavaScript\n\nJob Descriptions\n\nMicrosoft Technologies\n\nSoftware Developmentdesigned\n\nCascading Style Sheets\n\nPHP3/4work platforms", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBcHBsaWNhdGlvbiBEZXZlbG9wZXLigIsvTWFnZW50byBDb21tZXJjZSIsImNvbXBhbnlfbmFtZSI6IkFDQ0VOVFVSRSBQVEUgTFREIiwiY29tcGFueV9taWQiOiIvbS8wOW44dzk0IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiTnpsaE1oRWwxWThWaTlQYUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZZQkNyY0JRVTVWWDA1eFUyMVRMVUpHWm5KZmVFMWxYM2hLTWpSRFJreE1lRWN5VWpodlUwWkpaR1pMUkdFeFpFdEdha1I0YzNaQ1ZHRnBVbk5UVTNkbk9GUkxabkpuV0ZoRlpXY3ROMEpTYkV3d1MwbGZZMWt3YmtzeWRFMUlkbTlDZUdwSFRHNTJhalJhVURSUVpGZDZPSGt6ZVdSSGVYRnlSak5hZFZablZFbG5aRzV5WjFCWU9GRkJabGhuZUdwMmJHUjRTMFZIVmtOc1RsSjBXV1kwV25sWlNuQnpYemhHUkZkaFowZ3hkblZRVFhOc1gwUkNZM05yRWhaelNIRkRXVkJITTB3NWJVZDBVV0UwZEdKUFNVRjNHaUpCVDAxWlVuZERaemR6WlVaMmNtaDZlRGhqVG10MFJuSTBlRWR2WVhOdFoyRm4iLCJmY3YiOiIzIiwiZmNfaWQiOiJmY181NCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMZWFybjRHb29kIiwibGluayI6Imh0dHBzOi8vd3d3LmxlYXJuNGdvb2QuY29tL2pvYnMvc2luZ2Fwb3JlL3NvZnR3YXJlX2RldmVsb3BtZW50LzI3MTMyNzAwNi9lLz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior Technical Developer (Full Stack - Ecommerce)", "company_name": "CLEARgo", "location": "Singapore", "via": "via NodeFlair", "description": "We are looking for a full-stack Senior Technical Developer to join us at our Singapore office\n\nLocation : Circular Road (Raffles Place)\n\nJob Description / Responsibilities\n• Evaluate and provide technical feedback on project requirements\n• Provide solutions for technical problems with recommendations\n• Perform programming and technical tasks according to project requirements to defined quality standards\n• Competent in technical design capabilities\n• Responsible for design, implementation, deployment, and maintenance of web-based applications and e-Commerce/shopping cart development\n• Prepare technical documentations including functional/programming specifications, etc.\n• Mentor junior professionals and contributing to building a solid team\n\nJob Requirements\n• Higher Certification, Diploma or above in Information Technology / Computer Science / Computer Engineering / e-Commerce or related discipline\n• Hands on experience and proficiency in PHP, MySQL, Javascript, jQuery, AJAX, JSON... XML and HTML 5 is a must; Knowledge in NodeJS and/or React is advantage\n• Comfortable with containerization ecosystems development, ie. Docker\n• Comfortable with working using Linux OS\n• Experience with full-stack development including mobile platforms (Android/iOS) is preferred\n• Ability to adapt to fresh, new development frameworks which are more often than not loosely documented\n• 5-7 years' experience in web application development\n• Familiar with e-Commerce related development, eg. payment gateway and shopping cart development is highly preferable\n• Experienced in Magento and/or Shopify is a great advantage;\n• Good communication skills with passion at programming and software development;\n• Highly independent, willing to learn and being flexible\n• Responsible and accountable", "extensions": ["Over 1 month ago", "$4K–$5K a month", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time", "salary": "$4K–$5K a month"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgVGVjaG5pY2FsIERldmVsb3BlciAoRnVsbCBTdGFjayAtIEVjb21tZXJjZSkiLCJjb21wYW55X25hbWUiOiJDTEVBUmdvIiwiY29tcGFueV9taWQiOiIvZy8xMWc3MGd6cnowIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiVnBweVlsMUdERC1McDVybEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFVVdHplRFpVY1ZFeWJtbHVZazk0UTI0MlpFRmlTMHQ0U21sTlUwTk1PRWg0YmxORmRsWTRZMjVZTWtOaVFsazVVbVJRYmtwMk1EUXpWRll6U0dkeU5YTlJPR05NWVVneFJHTlNRbE5wZVdGd2F5MVFaVWs0YTE5Wk5HcFJaREpNTmt0dVUyRTNObkZ4WnpOTmVHRXphVEpNVDJ0eGIyNVhaM0JCZVZaRFRFWlBVbFpsUkVWWWJrOVZWUzFmVWtObVVHVXRjemN6YzNKUGRITm5FaFp6U0hGRFdWQkhNMHc1YlVkMFVXRTBkR0pQU1VGM0dpSkJUMDFaVW5kQ2VFaFRXR1Z1WW1aM1ZHNXlWRTR6ZDFCZlUwbHJOVVpLVGt0QiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzYwIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE5vZGVGbGFpciIsImxpbmsiOiJodHRwczovL3d3dy5ub2RlZmxhaXIuY29tL2pvYnMvbGlzdGluZ3MvNzkzMT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior software Engineer Full Stack Developer", "company_name": "Collins Aerospace (Hamilton Sundstrand Pacific Aerospace Pte Ltd", "location": "Singapore (+1 other)", "via": "via Jobs", "description": "Senior software Engineer Full Stack Developer Collins Aerospace (Hamilton Sundstrand Pacific Aerospace Pte Ltd) Posted on 22-Mar-21 Senior software Engineer Full Stack Developer Collins Aerospace (Hamilton Sundstrand Pacific Aerospace Pte Ltd) Job DescriptionWe are looking for a highly skilled application programmer who is comfortable with both front and back end programming. Full Stack Developers are responsible for designing the application architecture, exploring best fit technology, developing the front end and back end components, and ensuring the applications performance, among other duties. Full Stack Developers will be required to see out a project from conception to final product, as a sole contributor, or part of a developer team, that requiring good organizational skills and attention to detail. This role will also be responsible for the integration with different application frameworks and platforms within the organization’s Industry 4.0 digital solution ecosystem, as well... as supporting exploration of new technology and innovation solution. Roles and Responsibilities (Essential roles, responsibilities an d activities a candidate can expect to assume in this position) Works with application development team, business unit process experts, and outsource technology partner to design and develop software applications. Evaluate and implement best fit frameworks and integrated development environment required to provide required development infrastructure Provide expertise to identify and translate system requirements into software design artefacts. Creates architecture designs (at conceptual and logical level) of large and complex systems in the enterprise with the aim to make the systems sustainable and future-proof after they have been realized Ensure the efficiency, security, and support of the organization's goals in the solution. Create methods for compliance architecture, such as data storage, metadata management, and change control. Synchronize IT systems in development plan with business needs Develop well designed, efficient, testable and high-quality code Develop front end application architecture - UI. Develop back end applications. Setting up apps servers and databases for functionality. Ensure applications performance (responsiveness) and friendliness - UX. Seeing through a project from conception to finished product. Design and develop APIs. Qualification and Education Requirements (Education and Work experience that a candidate should have when applying for position) Minimum Education required (specific field or equivalent): Degree in Computer Science/ Computer Engineering/Information technology. A passion for Enterprise systems integration, sustainability and future-proof Minimum years of experience in role: Minimum 4 years of working experience in full software development lifecycle Extensive practical Enterprise Architecture experience, certified with a recognised EA framework, e.g. TOGAF Experience within Solution Design & Architecture Experience with Software Development Project Management Experience on Secure Software Development, secure code quality control, and application and system integration vulnerability assessment. Experience with Application Development and Software Assurance in a highly regulated industry Robust knowledge within Security Architecture Experience working within mobile, cloud and infrastructure solutions environments Proficiency with server side languages such as .Net, Node JS, Java, PHP, Python, etc. Proficiency with database technology such as Ms SQL, Oracle, MySQL and MongoDB. Experience with mobile apps development Experience with Cloud services and cloud API services (Google Cloud, Azure, Amazon) Strong communication and interpersonal skills. Great individual performer as well as contributor in a team Preferred Skills (if any): Demonstrated Excellent level of analytical ability, communication and interpersonal skills required to build relationships with team members to solve problems and resolve issues. Experiences in full software development lifecycle Extensive practical Enterprise Architecture experience, certified with a recognised EA framework, e.g. TOGAF Experience within Solution Design & Architecture Additional Information Senior Executive Qualification Bachelor's Degree, Post Graduate Diploma, Professional Degree Collins Aerospace, a unit of United Technologies Corporation, is a leader in technologically advanced, intelligent solutions that help to redefine the aerospace and defense industry. Our solutions make the skies and spaces we touch smarter and more amazing than ever. Created in 2018 by bringing together UTC Aerospace Systems and Rockwell Collins, we have the capabilities, comprehensive portfolio and expertise to solve customers’ toughest challenges and to meet the demands of the global marketplace. Our customers include aircraft manufacturers, engine manufacturers, airlines, airports and business aviation owners and operators, along with defense ministries and government agencies and contractors. Additional Company Information Registration No. 198905242N Company Size 1001 - 2000 Employees Average Processing Time 18 days Aerospace / Aviation / Airline Benefits & Others Medical, Regular hours, Mondays - Fridays, Business (e.g. Shirts", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3Igc29mdHdhcmUgRW5naW5lZXIgRnVsbCBTdGFjayBEZXZlbG9wZXIiLCJjb21wYW55X25hbWUiOiJDb2xsaW5zIEFlcm9zcGFjZSAoSGFtaWx0b24gU3VuZHN0cmFuZCBQYWNpZmljIEFlcm9zcGFjZSBQdGUgTHRkIiwiY29tcGFueV9taWQiOiIvZy8xMWR4cHpscTUyIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoicjIyRXVoTG5nSUp6N3RKZ0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZZQ0NyY0NRVTVWWDA1eFVsVmlYekYzV0hCQ05XaEtWR05SVEVGQ2JVSjJWSFF4TUMweVVWaEJZa0ZoVVROV2VEVkhPRXhETmkxSlZsazFWRFpuZUhKVGVYQXdXR05RYzBaNmRYSmZUMU5IYVRCallsQnVjVEoyTVVsVVEwUmxhVTFzY1RNMFpsRklTVk5hVFY5TFpGWmpMVjloTUMxMFRWZHRlRTUxWmxodk9UVXRORkpsTkdKQlQwMTRVVzAxWjBSWGVsWldORXR6TW5FeGRrVjVZWGw2VVU1amVrbENWVTFxUlVFMVpHdHlhR1ZwTTBNdE1GVjNVbkF4YTBVNE5HTnhWak5HYVVnM1RYTllVRUl5VjA1cWFERTNVVmxyWVhGaVpEWlpZbTFoWjNsbVpqZzNZV05CVDA1eFMwWktTV0ZQVkdoUVp6SkRTV05tU1ZWMUxVTnRhSEV3WjNaV1VrOVRXRU5GUzNNemJUQmtOazQzWDFaYU1TMUlNVGRDTlMxNmNrTjFVazlRVlZObWR6QkRXbEZ6UzJoMU5YUjFPRlJmTnpRU0ZuTkljVU5aVUVjelREbHRSM1JSWVRSMFlrOUpRWGNhSWtGUFRWbFNkMFExTTJSUVVUWkpRWEE0VVVOMFRqTlBiRTV1Y25KSFlWUjVYMEUiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY182NiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIiwibGluayI6Imh0dHBzOi8vc2cuZmlkYW50by5jb20vam9icy9qb2Itb3BlbmluZy9zb2Z0d2FyZS1kZXZlbG9wZXJzLXN5c3RlbXMtc29mdHdhcmUvc2VuaW9yLXNvZnR3YXJlLWVuZ2luZWVyLWZ1bGwtc3RhY2stZGV2ZWxvcGVyLTI3NTUxODAyNT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}], "chips": [{"type": "Title", "param": "job_family_1", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Software engineer", "value": "software engineer"}, {"text": "Senior", "value": "senior"}, {"text": "Test engineer", "value": "test engineer"}, {"text": "Cloud engineer", "value": "cloud engineer"}, {"text": "Engineer", "value": "engineer"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Assurance engineer", "value": "assurance engineer"}, {"text": "Programmer", "value": "programmer"}, {"text": "Coach", "value": "coach"}, {"text": "Qa engineer", "value": "qa engineer"}, {"text": "Devops engineer", "value": "devops engineer"}, {"text": "Frontend engineer", "value": "frontend engineer"}, {"text": "Java engineer", "value": "java engineer"}, {"text": "Solutions engineer", "value": "solutions engineer"}, {"text": "Testing engineer", "value": "testing engineer"}, {"text": "Analyst", "value": "analyst"}, {"text": "Data engineer", "value": "data engineer"}, {"text": "Design engineer", "value": "design engineer"}, {"text": "Development manager", "value": "development manager"}, {"text": "Devops consultant", "value": "devops consultant"}, {"text": "Firmware engineer", "value": "firmware engineer"}, {"text": "Lead engineer", "value": "lead engineer"}, {"text": "Lecturer", "value": "lecturer"}, {"text": "Manager", "value": "manager"}, {"text": "Network systems", "value": "network systems"}, {"text": "Principal", "value": "principal"}, {"text": "Principal engineer", "value": "principal engineer"}, {"text": "Quality engineer", "value": "quality engineer"}, {"text": "Science", "value": "science"}, {"text": "Scrum master", "value": "scrum master"}, {"text": "Security architect", "value": "security architect"}, {"text": "Security engineer", "value": "security engineer"}, {"text": "Senior engineer", "value": "senior engineer"}, {"text": "Senior lecturer", "value": "senior lecturer"}, {"text": "Senior system", "value": "senior system"}, {"text": "Senior technical", "value": "senior technical"}, {"text": "Software architect", "value": "software architect"}, {"text": "Specialist", "value": "specialist"}, {"text": "Stack engineer", "value": "stack engineer"}, {"text": "System engineer", "value": "system engineer"}, {"text": "Technical", "value": "technical"}, {"text": "Trainee", "value": "trainee"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Wholesale", "value": "/business/naics2007/42"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Mining", "value": "/business/naics2007/21"}, {"text": "Rental", "value": "/business/naics2007/532"}, {"text": "Retail", "value": "/business/naics2007/44"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": ".AB4Jjf.qPB6Vc{padding-right:11px}.qfpP8d{padding:7px 0 7px 11px}.S003Ke{flex:none}.ZoN4Lb{color:rgba(0,0,0,.54)}.nAXVG{color:#70757a}.IxQsL{color:rgba(0,0,0,.26)}.xFO1De{color:#fff}.ooFpK{color:rgba(255,255,255,.30)}.mtnwac{color:#4285f4}.WxeeKb{color:#34a853}.hIVRU{color:#f29900}.EXaTMc{color:#fbbc04}.sxn46d{color:#000}.gqMTF{color:#1a73e8}.zpn8Mb{color:#d93025}.dEUPmd{color:#1e8e3e}.PJNo1{color:#fbbc04}Actively Hiring", "value": "e"}, {"text": "EPAM", "value": "/m/0dlnrc"}, {"text": "VISA", "value": "/m/01kqjn"}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Zühlke", "value": "/g/1hh_rg216"}, {"text": "Cardinal Health", "value": "/m/040vzx"}, {"text": "Credit Agricole Group", "value": "/m/028vbm"}, {"text": "GlobalTix Pte Ltd", "value": "/g/11dxpqdhrf"}, {"text": "HCL SINGAPORE PTE. LTD.", "value": "/g/11fy25ngsv"}, {"text": "Jobline Resources Pte Ltd", "value": "/g/11gp2647pn"}, {"text": "Mediacorp", "value": "/m/03qtz1"}, {"text": "Realtek", "value": "/m/05wrm7"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "TECHNOPALS PTE. LTD.", "value": "/g/11dxpvkynp"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "Thales", "value": "/m/01phj4"}, {"text": "UST", "value": "/m/08kb8g"}, {"text": "UrbanFox", "value": "/g/11ghs7y0w6"}, {"text": "Activate Interactive", "value": "/g/11dxq192l5"}, {"text": "Cognizant", "value": "/m/03bf9h"}, {"text": "DELL", "value": "/m/0py9b"}, {"text": "HCL Technologies", "value": "/m/0698gv"}, {"text": "ORACLE", "value": "/m/05njw"}, {"text": "PUBLICIS SAPIENT", "value": "/m/09n8_2k"}, {"text": "Singapore Press Holdings Limited", "value": "/m/0d7mwh"}, {"text": "Temasek Polytechnic", "value": "/m/098s73"}, {"text": "TikTok", "value": "/g/11fy265933"}, {"text": "Zendesk", "value": "/m/0wkm4pl"}, {"text": "A-it Software Services Pte Ltd", "value": "/g/11dxpy_gl_"}, {"text": "ACCENTURE PTE LTD", "value": "/m/09n8w94"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "Adecco GS", "value": "/m/08gz46"}, {"text": "Atidan Technologies", "value": "/g/11c74f0b8_"}, {"text": "Autodesk", "value": "/m/018nm3"}, {"text": "Avnet", "value": "/m/0c8xmc"}]}]}