{"search_metadata": {"id": "60827a422fe30229fe7fa6ca", "status": "Success", "json_endpoint": "https://serpapi.com/searches/13e5b29edb89590d/60827a422fe30229fe7fa6ca.json", "created_at": "2021-04-23 07:41:54 UTC", "processed_at": "2021-04-23 07:41:54 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28data+analyst%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=100", "raw_html_file": "https://serpapi.com/searches/13e5b29edb89590d/60827a422fe30229fe7fa6ca.html", "total_time_taken": 2.29}, "search_parameters": {"q": "(data analyst) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "100"}, "jobs_results": [{"title": "Assistant Manager - Data Analytics", "company_name": "Nanyang Technological University", "location": "Singapore (+1 other)", "via": "via Monster", "description": "Job Description :\nSummarized JD:\n• The Data Analyst role is important to the sustained progression of Student Data Management project, which helps to build the foundation for the implementation of Student Management System (SMS) and our vision of operational optimization and data-driven decision-making.\n• He/she will be responsible for\n• develop and manage student data marts in preparation for reporting and data analytics projects\n• lead, develop and manage data analytics projects to provide enhanced insights from student data (e.g. Admission Analytics Projects to compare student academic performance)\n• design and develop student administration management dashboards to support decision-making\n• train selected SASD officers in data-related framework, concepts and competency in data analytics\n• support business data users in student data migration activities (incl. profiling, cleansing, mapping of data,) during SMS project implementation\n\n[The role is expected to lead and facilitate, in... addition to execution.]\nRequirements:\n• a recognised Bachelor degree in data sciences / computer science / mathematics;\n• possesses technical expertise in data models, database design & development, data mining & segmentation techniques\n• good knowledge of and experience with data visualisation tools (e.g. Qlik Sense), and programming languages including SQL and Python/R.\n• experience in planning and developing data analytic projects to support business needs\n• able to communicate effectively with business users on data-related requirements and outcomes\nHiring Institution: NTU", "extensions": ["25 days ago", "Full–time"], "detected_extensions": {"posted_at": "25 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBc3Npc3RhbnQgTWFuYWdlciAtIERhdGEgQW5hbHl0aWNzIiwiY29tcGFueV9uYW1lIjoiTmFueWFuZyBUZWNobm9sb2dpY2FsIFVuaXZlcnNpdHkiLCJjb21wYW55X21pZCI6Ii9tLzBsNDlrIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiQWdmbTdUN21CR211c0g5bkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXFFQ0N1SUJRVTVWWDA1eFUwWjBPVE5vVVdsT2RrTnllbVE1VXpsRVZFUkliMkV0VTFWb04yTnZjMnBuT1dwMk5EUkxaR3BNV1d4aWNFOW1PRWhIWkUxa04zcG5ibk0yVWpkNVpFRkxhVGRtZVRJNU9ESmhlRVZ4TUZJM05VOU5aRVF6T0haQmNuTXpMWGx6TkRKRVJFTlBZamgwWVhSbU1GbHFkVlEwU1hsU1IyZFBTVkZwTjAxR2JuSndWekJ2YlVKb2MzaHFabFI0TlZwSmNGWk9aVTFhV1d4VFNqRlFPRE14ZVRGbVUwMWxjVWhFYXpWTlMyVmlTWE01V1hvdGRDMXVhVGMzWlRndGIwOHdZVXQ1ZWtoV01WSTJiMDFJY2xjd1pXUjZWVEJLWDJ3NVV6Wk9aeElXVVROeFExbExSMkZKYnpaMmRHZFhPR3hLVjBGRVp4b2lRVTlOV1ZKM1EwRmpURGs0ZG5aVVRrMWZhREYyZW5WcFVtMUVVbTVGYlY5RVp3IiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNb25zdGVyIiwibGluayI6Imh0dHBzOi8vd3d3Lm1vbnN0ZXIuY29tLnNnL2FtcC9qb2ItdmFjYW5jeS1hc3Npc3RhbnQtbWFuYWdlci1kYXRhLWFuYWx5dGljcy1uYW55YW5nLXRlY2hub2xvZ2ljYWwtdW5pdmVyc2l0eS1zaW5nYXBvcmUtMjY3Mjc3MjMuaHRtbD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Data Presentation Analyst", "company_name": "Singapore Pools", "location": "Singapore", "via": "via Jobs | Fidanto", "description": "We are looking for a passionate and professional Data Presentation Analyst to join our team to develop dashboards and presentations on technology projects/ systems/ program performance.Based in Singapore and reporting into the Deputy Director, Enterprise Architecture & Insights Platform (EAIP), the incumbent will ensure data presentation is comprehensible and can be used to draw meaningful insights.We also recognize that each individual has a unique blend of skills. Whether your strength is in data analytics or stakeholder engagement, we want to talk to you.\nWhat You'll Do\nYou will ensure data presentation is comprehensible and can be used to draw meaningful insights.\nYou will develop and refine presentation templates based on stakeholder feedbacks.\nYou will analyze data set and organize information in a logical and structured manner.\nYou will filter and \"clean\" data to present in a format that is understandable and can be used to draw meaningful conclusions.\nYou will create and... maintain dashboards, utilizing visualization tools such as Qlik, Kibana, Tableau, Bluemix, Cognos Analytics to maximize decision making and provide executive visibility.\nYou will review and continuously improve analytics solution.\nYou will work with key stakeholders to define key performance measures and develop KPIs and other tracking mechanisms to assess project health.Who You Are\nYou have a Bachelor's Degree in Business, Analytics, or related Quantitative field\nYou have 3 years experience as Business/ Data Analyst\nYou are familiar with ELT, Qlik, SQL and NoSQL\nYou have proven ability to analyze and present large sets of data in a logical and comprehensive manner\nYou have experience with various data visualization tools\nYou have a knack for details, and are self-motivated.\nYou have strong interpersonal skills with the ability to work effectively with diverse teams within and outside the Group Business Technology Team\nYou demonstrate knowledge of data architecture and implementation features\nYou may have a Project Management Professional Certification (PMP)\nBenefits\nCompetitive salaries\nFlexi Benefits\nStaggered working hours\nMedical Insurance\nLearning & Development Opportunities\n\nSingapore Pools welcomes you not for how you look, where you come from, or differences you may have. We want you here for who you are. Diversity at the company helps us see a greater picture represented by different voices, helping us in contributing back to the society. So, feel free to express who you are, and be proud of your heritage and personal experience as you begin your journey with us!Singapore Pools was established by the Government on 23 May 1968 to provide safe and trusted betting to counter illegal gambling. As a not-for-profit organisation, all of Singapore Pools' surplus is channeled to Tote Board to fund a wide range of causes in social service, community development, sports, the arts, education and health. Currently, Singapore Pools contributes about $2 billion annually to the Government in the form of taxes and duties, and for the funding of good causes.If you are interested, please send your resume to P&C@sgpoolz.com.sg. We will reach out to shortlisted candidates for further career conversations", "extensions": ["17 days ago", "$600 a month", "Full–time"], "detected_extensions": {"posted_at": "17 days ago", "schedule_type": "Full–time", "salary": "$600 a month"}, "job_id": "eyJqb2JfdGl0bGUiOiJEYXRhIFByZXNlbnRhdGlvbiBBbmFseXN0IiwiY29tcGFueV9uYW1lIjoiU2luZ2Fwb3JlIFBvb2xzIiwiY29tcGFueV9taWQiOiIvbS8wNXoxZjYiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJHb3RPa2t1SWtacnBXVW1EQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VVZSU1dUTklSMGQ2ZW5OaWEyVnZkSFJQUlVWT2VXZGxMWEZuY0RsS1ZXUXpSRU5MWTBGSldXOHlhV1ppYTFSMFJUZFdPVE5uYjBzNWRYVkhibmhHYTFGb1VFWlJTbGQxZVhWNUxUbHlWV1ptTTFGWVRqbHRObDlsU1ZobVpXaHZNM2RtV2tvMldFcDVSakJGTjFCNWRuQm9VRnBqV2w4M1VUVmhkakpoUkV4blRrVm1jVkpWZUhaNmJFZGFkbU5GYXkwMloycG1RamhwUkVWbkVoWlJNM0ZEV1V0SFlVbHZOblowWjFjNGJFcFhRVVJuR2lKQlQwMVpVbmRFYWxKSFV6RjNWWHBUVlc1cWVqbFRZVVZ6YlZKd2MydDVYMDFCIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMTUiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9icyB8IEZpZGFudG8iLCJsaW5rIjoiaHR0cHM6Ly9zZy5maWRhbnRvLmNvbS9qb2JzL2pvYi1vcGVuaW5nL2RhdGFiYXNlLWFkbWluaXN0cmF0b3JzL2RhdGEtcHJlc2VudGF0aW9uLWFuYWx5c3QtMjY3ODczMDk5P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Data Support Analyst (BB-8AFB3)", "company_name": "Sciente International", "location": "Singapore (+1 other)", "via": "via BeBee", "description": "18 February 2021 We are seeking a data support analyst to help with Group Finance projects in the banking space. Mandatory Skill(s) Degree in Computer Science, Computer Engineering or Information Systems; At least 3 years of experience in data related projects and with data visualization, data quality checks and monitoring; Hands-on experience : Qlik Sense / SQL / PBI; Proficient in SQL based querying of database for data analysis; Prior experience in banking; Knowledgeable in data analytics processes; Strong communication skills with an analytical mindset. Desirable Skill(s) Proficient in Informatica IDQ, QlikSense; Relevant Qliksense / Qlikview / Tableau Certification. Responsibilities Monitor the health of data elements and conduct checks; Create and upload manual templates for data quality processing; Conduct data quality checks; Take part in designing and user acceptance testing; Build and improve regulatory reporting dashboards and conduct monthly reporting; Manage stakeholders... and provide training to business users on new reports and dashboards", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEYXRhIFN1cHBvcnQgQW5hbHlzdCAoQkItOEFGQjMpIiwiY29tcGFueV9uYW1lIjoiU2NpZW50ZSBJbnRlcm5hdGlvbmFsIiwiY29tcGFueV9taWQiOiIvZy8xMWM3M2dqMTluIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiSzBPclZMbXJFbUlDVnZCX0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZZQkNyY0JRVTVWWDA1eFZISjZhazFVVWtjMFl6TlhMVUl4TjNWQ2VrRm1jV28xWnpsVmRrMTVRbEJxU2xKRWRYTmpjemxqWDNCdVduRk9kamM0TTBaU09HNDRiMUJOYWxsd2VGVkNTbFJYVEMxWmVGUnNiM280TTNKQlJEUkNPR2xrUjNGamNHMW5XV0ptY1hneU5YUjRWMmhPWnpNNE5FRndlWGg0UkRsaE9YcFZhMk5hYzNOaWJXNVFORlJ4TmtsYVFsQTVZMUZXVEVSa2FtWk1jbFZ1T0VoVFdEbDJYMnRhVTJ4SlEweDNZa0pUVnpOcFZXOUplVFJORWhaUk0zRkRXVXRIWVVsdk5uWjBaMWM0YkVwWFFVUm5HaUpCVDAxWlVuZERSbDlLUW1JdGNtTkhjVWRHV1VsQ1pERTFSMWx5Tmt0ck5XcG4iLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18yMiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCZUJlZSIsImxpbmsiOiJodHRwczovL3NnLmJlYmVlLmNvbS9qb2IvMjAyMTA0MTctZjIwMGUwZWI2ZmRkYmVmMzZhNDZjOTY3NThjOGFmYjM/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Senior Analyst, Enterprise Data Platform & Datamarts", "company_name": "RHB Singapore", "location": "Singapore", "via": "via Glassdoor", "description": "Company Description\n\nRHB Singapore is a progressive and growing financial organization. We are committed to creating a fulfilling, dynamic and engaging work environment for our team of more than 15,000 employees across nine locations in ASEAN, China and Hong Kong.\n\nJob Description\n\nPrimary Objective\n\nCustodian and system expert who can advise, analyze, plan, implement, maintain, support (and retire/refresh where required) all locally hosted (On premise, Cloud) data related platforms inclusive of data lakes, data warehouses, data marts, ETL, reporting, dash boarding and analytics:\n\nCommon to all Senior Data Analyst\n• Maintain and ensure data platforms running in production are kept running and supported in a healthy state;\n• Analyze and recommend new application and platform acquisitions to meet evolving Singapore Operation’s needs based on capturing and documenting business requirements elicited from business stakeholders\n• Where the data platforms are in-house developed do the... required coding and development, otherwise engage with 3rd party vendor to get enhancements developed and then deploy into test and prod when ready\n• Ensure IT is operated in a manner that complies with Bank Policies and frameworks, standards, circulars, guidelines and MAS regulated act, notices, circulars, and guidelines applicable to technology (Compliance, Audit, Risk Adherence). – Application and Platforms\n• Ensure IT assets are protected and secure – Applications and Platforms\n• Assist in annual budgeting – Applications and Platforms\n• Be a key stakeholder and technology partner on the bank Digital journey.\n• Foster and champion bank PRIDE values within the technology department and imbue the department with a culture of teamwork, innovation, discipline, resiliency and dedication to how work is approached.\n• Where vendor based solution approach adopted and/or outsourced approach, arrange due diligence and assessment from technology perspective on behalf of users.\n• Provide day-to-day support to business users on any data platform related system issues or constraints\n• Ensure assigned application deployments running on bank managed environments are properly QA and meet conditions.\n• Co-ordinate the setup and manage test environments to ensure business can do their enhancements and new projects testing.\n\nSpecific to Senior Data Analyst\n\nSenior Data Analysts are assigned to specialize in one of the following groupings of data platforms:\n• Enterprise Data Platform and Datamarts: Next Generation Cloud Data lake platform, theme specific cloud data marts, on premise legacy data warehouse system, on premise staging database, custom developed ETL\n• Reporting and Analytics: Reporting platform, canned reports and dashboards based on user requests, ad-hoc analysis and data query requests, Cloud based dashboards, regulatory reports generation (CBS, SDIC, MAS, BNM, SPRING)\n\nKey Responsibilities\n\nStrategy, Planning, Mgmt. Reporting\n• Provide expert advice and support to technology management in the area of expertise\n• Contribute in the formulation a comprehensive Branch IT strategy covering IT policies and procedures, security, architecture, business solutions and operational functional requirements\n• Keep abreast of developments and innovations in the FI IT landscape\n• Provide mentorship, support and guidance to colleagues, share information and facilitate problem solving\n• Contribute in the yearly budgeting for IT expenditures and investments.\n\nIT Operations\n• Ensure data platforms running in production are healthy and functioning per expected.\n• Ensure prompt and efficient provision of IT support based on assigned area of expertise (includes request from Data center operations team)\n• Oversee contingency plans and ensure their adequacy\n• Ensure IT assets are protected and secure\n• Maintain and ensure timely renewal of digital certificates and proper lodgment with IT security team.\n• Ensure IT operations run in a manner consistent with high score from audit, risk, compliance assessments. The following to be operationalized as standard procedure against all IT asset components:\n\n– Administrative Accounts – All admin accounts lodged into PAM solution per group IT Security guidelines and MAS notice 655 point 4.1\n\n– Patching – Patch notification process established with vendors and patch calendar updated, upon patch release assessment and implementation as needed Per patching guidelines and MAS notice 655 point 4.2\n\n– Hardening - Per component definition and enforcement against SG security standard and Group IT Security guidelines and SG addendum/s and MAS notice 655 point 4.3\n\n– Network Perimeter Defense – Network traffic and segments, firewalls, proxies, dns, vpn access setup in secure manner per group IT security guidelines and MAS notice 655 4.4\n\n– Malware – IT Security consulted and all required IT security protections installed on IT assets per MAS notice 655 point 4.5\n\n– Multi-factor Authentication – MFA, where applicable implement MFA of administrative and internet accounts with access to customer information using PAM per MAS notice 655 point 4.6\n\n– Logging and Monitoring – Security, Capacity, Downtime, Audit\n\n– Capacity Mgmt. – Pre-emptive monitoring (via monitoring), planning and execution of capacity upgrades as needed\n\n– EOL/EOS Upgrades – Per group guidelines. Track and execute upgrades and/or do risk assessment and deviation approval.\n\n– Housekeeping – scripted clean-ups and truncations of logs and temp files after necessary archives executed\n\n– Backups – Required backup strategy per backup guidelines operationalized to central Backup Platform. Recurring scheduled backup validation activities scheduled and performed ongoing to ensure backups working per need.\n• Work with system stakeholders to ensure proper classification of system criticality and ensure design and architecture can meet the assessed criticality needs:\n\n– MAS 644 defined Critical system – Ensure DR setup and working and can achieve RTO within 4 hours, RPO within 2 hours and maximum unplanned downtime of not more than 4 hours per rolling 12 months;\n\n– MAS 644 defined non-critical system – Ensure HA/DR per stakeholder requirement.\n• BCM related activity planning and execution\n• Review and Approve/Reject production change requests as part of TCAB committee\n• Raise CAB CR as necessary\n• Cutover related planning and execution\n• Ensure and maintain adequate test environments in good working order to support enhancements and new projects;\n• Adhere to SDLC for both in-house and 3rd party solution platforms.\n• Take BAU day 2 operational ownership in terms of maintenance, support and minor enhancement ownership of new systems and/or major enhancements delivered by the Digital Delivery and DevOps team\n• Track IT related spend against budget.\n• Write Memos to authorize procurements\n• Write Memos to get deviation approvals where required.\n\nApplication and Systems Development / New Platform Acquisition\n• Lead in the requirements gathering and documentation, design and where in-house the coding, test support and implementation of new systems or enhancements of existing systems:\n\n– Analyze, design, document and develop technical solutions according to business requirements (or in case of off the shelf, co-ordinate with 3rd party vendor)\n\n– Provide accurate, complete and up to date system documentation\n\n– Provide training to users to ensure correct usage and proper adoption upon rollout\n\n– Oversee the QA of software implementation\n• Oversee the deployment and implementation of applications to run on Cloud for existing systems based on end-user needs and business rationale.\n• Assist team lead to write and table committee papers as required to get new systems and/or platforms, or major refreshes approved.\n• Write Memos to authorize procurements\n• Write Memos to get deviation approvals where required\n• Work together with Digital Delivery and DevOps team to support digital and cloud initiatives in terms of initial advisory and then follow-on necessary analysis and co-ordination/implementation related to integration requirements and enhancement required to existing data platforms to enable the digital initiative.\n• Work with Digital Delivery and DevOps team to support migration of workloads running on-premises to Cloud.\n\nRegulatory and Procedural Expertise\n• Keep up to date and refreshed on required reading related to guiding how IT must be run in a regulated Financial institution. Minimum read list:\n\n– MAS Technology Risk Management Guidelines (TRMG)\n\n– MAS Notice 644 – Technology Risk Management.\n\n– MAS Notice 655 – Cyber Hygiene\n\n– MAS Outsourcing Guidelines\n\n– RHB Group IT Security Guidelines and SG addendum/s\n\n– SG Patching Guidelines\n\n– SG Backup Guidelines\n\n– SG Technology Department Operational Manual (OM)\n\n– SG IT Standard Operational Procedures (SOP), and System Manuals (SM)\n\n– SG Procurement Operational Manual (OM)\n\nOther Responsibilities\n• Participate in Monthly Technology Department meetings.\n• Participate in regular Team meeting.\n• Use Department issue and work tracking platform.\n• Maintain and keep up to date team knowledge base and assist in updating team document assets such as system manual / standard operating procedures (SOP), and operations manuals\n\nQualifications\n\nFormal Education:\n• Bachelor Degree/Masters Qualification\n\nProfessional Accreditation:\n• TOGAF architecture certification (not mandatory)\n• .Net developer related certification (not mandatory)\n• Java developer related certification (not mandatory)\n• SQL Developer related certification (not mandatory)\n\nPreferred level of Experience (by years/function/industry):\n• Minimum 5 years of experience documenting requirements, designing solutions, and coding or configuring data related platforms as part of technology department in a financial institution based in Malaysia or Singapore\n• Minimum 3 years of experience in providing level 3 IT operations support in a financial institution based out of Malaysia or Singapore.\n• Experience managing vendors\n\nOther skills required:\n• Working knowledge of bank operations and products\n• Experience in DWH schema design (on oracle, SQL Server, MySQL, PostgreSQL DB platforms), ETL and Reporting platforms\n• Experience in agile based SDLC methodologies\n• .Net | Java | SQL | Python | Scripting | ETL platform | Reporting Platforms development skills\n• Technical experience in industry data management and reporting platforms such as SAP BI, Tableau, Talend, Crystal reports\n• Hadoop, AWS EMR, Sparks platform experience.\n\nAdditional Information\n\nRHB is a dynamic organization that promotes a work culture of high performance, where its biggest asset, the RHB-ians, are continuously developed & nurtured to their fullest potential through its robust talent management practices.\n\nAt RHB, we take PRIDE in our people and our teams. Great relationships built on trust, a ‘leading it right’environment, challenging assignments and a culture of excellence are the pillars to the dynamic and diversified workplace we call home", "extensions": ["18 days ago", "Full–time"], "detected_extensions": {"posted_at": "18 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQW5hbHlzdCwgRW50ZXJwcmlzZSBEYXRhIFBsYXRmb3JtIFx1MDAyNiBEYXRhbWFydHMiLCJjb21wYW55X25hbWUiOiJSSEIgU2luZ2Fwb3JlIiwiY29tcGFueV9taWQiOiIvZy8xMWM3M3NyZzdmIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiaExDZFF1Zk1LWXpubWp1c0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFVUWk1abFp0YTJWWlVEZ3paVkJXT1hORlZGWnlSMUYzUkhOcU9ITmhVMWRmWHpoa1dHSTVUR1IwWjFZMVJFbDFXWEZWTVZwU1ZFaEhZM0ZWV0hwMVRuVnNkakZXWnpKTk1IZzNiVVYwUlZOekxWRllXRlpyTjJKSVdHZEJjMHh5U0hKMWRrRmtSekpaYUhWU1luaGZjRFpNWlhsalEyNXVNMjFtTVc1NVdUTmxVV3RrV2pCT1VEaENablpLV0dnM1FsODFaRW8yVnpSMlYyTkJFaFpSTTNGRFdVdEhZVWx2Tm5aMFoxYzRiRXBYUVVSbkdpSkJUMDFaVW5kRWMxRjBkRk5UTTNaU1VWbzNaRE54Vm14aVNFeHpOR1JxU0RCMyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzI5IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEdsYXNzZG9vciIsImxpbmsiOiJodHRwczovL3d3dy5nbGFzc2Rvb3Iuc2cvam9iLWxpc3Rpbmcvc2VuaW9yLWFuYWx5c3QtZW50ZXJwcmlzZS1kYXRhLXBsYXRmb3JtLWRhdGFtYXJ0cy1yaGItc2luZ2Fwb3JlLUpWX0lDMzIzNTkyMV9LTzAsNDlfS0U1MCw2My5odG0/amw9MzgxOTI4OTQ5MFx1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Digital Performance Manager (BB-43850)", "company_name": "Yara International", "location": "Singapore", "via": "via BeBee", "description": "ResponsibilitiesResponsible in building, conceptualizing & executing campaign plan to engage users at various cycle using different touchpoints Work closely with country GTM lead and regional / global lead to translate strategy and market intel into short and long term product roll out strategy (i.e. always-on vs ad-hoc) Oversee inmarket regional campaign and provide constant update on campaign activities in collaboration with data team. Coordinate activities between agency, inhouse branding team, customer success and in-market team to ensure campaign roll out smoothly Initiate and materialize various market experimentation within GTM workstream in collaboration with data analyst, Incubation market team Responsible in defining post activity analysis agenda, compile report from various parties and translate data into actionable insight Profile Hands on trading experience in using search, programmatic, social media , email, messaging platform to drive at least 5 brands or performance... campaign Tertiary qualification in Digital marketing, Marketing or Data Science (with experience in digital environment). Certified in Facebook Blueprint, Google Analytics Individual Qualification and Display & Video 360 Exposure in building customer lifecycle marketing in ecommerce environment (awareness, consideration, convert, word of mouth, loyalty) Exposure in mobile app and web analytics tool , tag management system, ad server, trafficking, attribution model & ad fraud Solid understanding of users data handling from marketing or advertising standpoint, in the context of GDPR. Curious, passionate, roll up the sleeve attitude", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEaWdpdGFsIFBlcmZvcm1hbmNlIE1hbmFnZXIgKEJCLTQzODUwKSIsImNvbXBhbnlfbmFtZSI6IllhcmEgSW50ZXJuYXRpb25hbCIsImNvbXBhbnlfbWlkIjoiL20vMDRxcDY1IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoibUc1eEg1VWdBUUVxUnVqQkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZZQkNyY0JRVTVWWDA1eFVrOVJhR0pZZFc1clJtaDZPRWhxT0c4eVpHVkNka0k0U1Y5S2FEWjRaWFpFZURoRVdIVkxiMVJuUTNsQ1VtTmZjMGx0UVRGeFpqWkNOWFJ2UlZsUVNtTmxaVXhHVms0NWFXTnpZVWx6WmsxS05WbEJTWGRWYmxZNE0zVmZRMGxpVFZaT2JWcFJPRVJMZWxkU1pEaGtXRmxyTjB0dGNVSm9NblZFZVVGcFJYb3paak5SWjFWWllVUnRWazVPZEZGVU1VZGhNazlqTFhOWExTMVRkVFJ3Vkc1VFZrVkRZbWh6ZVU0ek1sRXhPRFpKRWhaUk0zRkRXVXRIWVVsdk5uWjBaMWM0YkVwWFFVUm5HaUpCVDAxWlVuZEVTRGRvZDNwU01YZzBOakp4UzNaalduZGpUek5ZZVZvM1FXdG4iLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18zNyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCZUJlZSIsImxpbmsiOiJodHRwczovL3NnLmJlYmVlLmNvbS9qb2IvMjAyMTA0MTctYWFiMjhhMmNlMmE3NTRhZmYyYzk5OTg2MTA4NDM4NTA/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Senior Associate / Associate, Data Engineer, Group Consumer Banking and Big Data Analytics Technology, Technology & Operations", "company_name": "DBS Bank Limited", "location": "Singapore", "via": "via Laimoon.com", "description": "Business Function\n\nGroup Technology and Operations (T&O) enables and empowers the bank with an efficient, nimble and resilient infrastructure through a strategic focus on productivity, quality & control, technology, people capability and innovation. In Group T&O, we manage the majority of the Bank's operational processes and inspire to delight our business partners through our multiple banking delivery channels.\nAs a Data Engineer, you'll be a Data Engineering Specialist and help us discover the information hidden in vast amounts of data. You'll be part of the team which builds a hybrid cloud data platform that supports dynamical data replication across different environments and leverages cloud-native technologies.\nResponsibilities\n• Design and implement key components for highly scalable, distributed data collection and analysis system built for handling petabytes of data in the cloud and on-premises.\n• Work with architects of the analytics system and help in adopting best practices... in backend infrastructure and distributed computing.\n• Implement core practice of Agile, leveraging cloud-native architecture patterns and using Test Driven Development, continuous integration/continuous delivery\n• Continuously discover, evaluate and implement new cloud technologies to maximize analytical system performance\nRequirements\n• 3+ years of experience in one or more areas of big data and/or cloud0native application development\n• Development experience in Java and pride in producing clean, maintainable code. Knowledge of reactive programming and related frameworks would be an advantage.\n• Experience using AWS/GCP managed services (especially those related to data processing and data movement)\n• Hands-on experience with Test Driven Development methodology\n• Familiarity with operational technologies, including k8s, docker, ZooKeeper,\n• Experience with Spark and different schema formats (Avro, Parquet, Carbondata)\n• Experience using high-throughput, distributed message queueing systems such as Kafka.\n• Familiarity with tracing/observability solutions, e.g. OpenTracing, OpenTelemetry, Zipkin\n• An ability to periodically deploy systems to on-prem/cloud environments\n• Mastery of key development tools such as GIT, and familiarity with collaboration tools such as Jira and Confluence or similar tools.\n• Experience with distributed databases, such as Cassandra, and the key issues affecting their performance and reliability.\n• Experience with SQL engines (e.g. MySQL, PostgreSQL)\n• The ability to work with loosely defined requirements, and exercise your analytical skills to clarify questions, share your approach and build/test elegant solutions in weekly sprint/release cycles.\nApply Now\nWe offer a competitive salary and benefits package and the professional advantages of a dynamic environment that supports your development and recognises your achievements. Technology", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQXNzb2NpYXRlIC8gQXNzb2NpYXRlLCBEYXRhIEVuZ2luZWVyLCBHcm91cCBDb25zdW1lciBCYW5raW5nIGFuZCBCaWcgRGF0YSBBbmFseXRpY3MgVGVjaG5vbG9neSwgVGVjaG5vbG9neSBcdTAwMjYgT3BlcmF0aW9ucyIsImNvbXBhbnlfbmFtZSI6IkRCUyBCYW5rIExpbWl0ZWQiLCJjb21wYW55X21pZCI6Ii9tLzAxcTduNSIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IkhyMmx1ejc2Q0MtRjNkZmZBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2WUJDcmNCUVU1VlgwNXhVaTFWTTFkT1RXaEdWa3hHY1U1V1NsOVNXa3h6ZFRjelkzcFhlRWQ0ZVcxWldIcDNSemhIUzBOeFUwaDNNbDlaVldRelpuUklabTFyUm5BeWN6RlBiM1IwUWtWRE1sSkRaM2h5Ym5abVJHNTFWblYyTmpVelpUTkZZMmRMYTNwamNVNXFWRTVaWmtGdFdEUlljRWRtZGw5V1IzaHZVWE5mVEdwNFl6RXpZbXRXUlhZeVdtTm9RVWx4UlVsUmQyd3RVRVk1VVVNemNVMUlZWE5qVVd0cldtNW9PVTlzTUhsTlQzaElSbkZoVnpaVkVoWlJNM0ZEV1V0SFlVbHZOblowWjFjNGJFcFhRVVJuR2lKQlQwMVpVbmRCVVRkdlJuRjZVVlp4T1dwUVoyWktTMVJRYUdaRlZuaEdkSGRuIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNDUiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGFpbW9vbi5jb20iLCJsaW5rIjoiaHR0cHM6Ly9qb2JzLmxhaW1vb24uY29tL2pvYnMvZXh0ZXJuYWx2aWV3LzI1OTg1Nzk5P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "BSA, Business Intelligence", "company_name": "Quinnox Solutions", "location": "Singapore (+1 other)", "via": "via Glassdoor", "description": "Job Description:\n\nThe Job Scope:\nSupport the delivery of a multi-million Data Mart project from that will integrate various external and internal data sources and build a best-in-class data mart and data access self-service tool. The data mart will be the source of data and insights to support data-driven executive decisions. He/she is detail-oriented, analytical, and have excellent problem-solving abilities. He/she will be an expert at working with large data sets and the technical tools needed to work with them. He/she possess good communication and project management skills, is customer focused and able to communicate complex business insights, both verbally and in writing. He/she will partner with IT team to influence and drive the project plan/milestones to ensure project will achieve the business objectives.\n\nThe Responsibilities:\n• Work directly with business users and stakeholders to understand the business needs and translate business requirements into detailed requirements... documentation.\n• Employ best practices during requirements gathering and documentation stages.\n• Partner with the IT project manager to manage the data mart project phases/releases from initiation to completion.\n• Manage stakeholder expectations and communications within and beyond functional track.\n• Interacts regularly with senior management level stakeholders to provide periodical project status updates, raise risks and issues encountered in the project.\n• Develop and communicate test strategy and test cases.\n• Coordinate execution and validation of test cases with stakeholders for user acceptance testing, training, and obtaining project sign offs.\n• Coordinate defects clarification, triage, and resolution with IT team.\n• Develop and actively maintain the data mart data dictionary.\n\nThe Requirements:\n• Degree in data management, analytics, statistics, mathematics, or business management.\n• At least 3 to 5 years strong experience in business analysis and requirements gathering and documentation.\n• Strong knowledge and experience in industry standard project management practices.\n• Strong knowledge of data warehouse modeling and business intelligence concepts (e.g. entity relationship diagramming, SQL querying, source to target mapping, etc.)\n• Excellent visualization skills using Tableau, SiSense or other relevant visualization tools preferred.\n• Advanced knowledge of Excel and SQL.\n• Good knowledge on CRM, ERP or Financial systems preferred.\n• PMP certification is desirable.\n\nTo Apply:\nPlease send your latest CV in word file to sales@quinnox-solutions.com\nKindly indicate your availability, current and expected remuneration package.\nWe regret that only shortlisted candidates will be notified.\n\nFor more job opportunities, please visit our career page: http://quinnox-solutions.com/careers/\n\nQuinnox Solutions Pte Ltd (License Number: 06C3126)\nRegistered EA Personnel (Reg. No.:R1111100)\n\nRequired Skills:\n\nBusiness", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJCU0EsIEJ1c2luZXNzIEludGVsbGlnZW5jZSIsImNvbXBhbnlfbmFtZSI6IlF1aW5ub3ggU29sdXRpb25zIiwiY29tcGFueV9taWQiOiIvZy8xMWc3MGR0ZGdnIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoid0dUcnlHMk85RVBHTkU0Q0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZZQkNyY0JRVTVWWDA1eFUweGpOalZMYW1scWVVTjBUa3hETTFsNVZtZG9NMXBPTjBwR1JqSk5SazFyWkdkU2NsWklNRnBoWjJaeWVIRlJjekkwWkhOMlVscFhXa1p6U1ZZNUxVeEljbHBMYkhSR1RrTTVRazVrTUY4elZGbERNVWhOUm1WM2JERk9OR3RMWlRoNFNrTkZTRU5PY0ROZlJqZGxWalV0VDBZM1VVMTVTRzEyTW5aS2VVUnRhMHhVV1U1RVMzaDVaekZrYUhkRWVERTRWR0Y0YXpZeldWWTBOamhGTUdaT05sTk1SMGQwVUVSWVRUZDJkVWhSRWhaUk0zRkRXVXRIWVVsdk5uWjBaMWM0YkVwWFFVUm5HaUpCVDAxWlVuZERNVTR0UzBZeFJGb3RjemRpYmpsRlRHaEdhbE5GZWxvd1MzVkIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY181MiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBHbGFzc2Rvb3IiLCJsaW5rIjoiaHR0cHM6Ly93d3cuZ2xhc3Nkb29yLnNnL2pvYi1saXN0aW5nL2JzYS1idXNpbmVzcy1pbnRlbGxpZ2VuY2UtcXVpbm5veC1zb2x1dGlvbnMtSlZfSUMzMjM1OTIxX0tPMCwyNV9LRTI2LDQzLmh0bT9qbD00MDQwMzI2NTk3XHUwMDI2dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Research Assistant - Business Data Analytics", "company_name": "Nanyang Technological University", "location": "Singapore (+1 other)", "via": "via Monster", "description": "Job Description :\nA Research Assistant position is currently available in the College of Business, Nanyang Business School.\nJob Responsibilities\n• Data cleaning, preparation, and statistical analysis\n• Prepare literature survey, reports\n• Ad-hoc task assigned tasks assigned by the principal investigator related to the project\n\nJob Requirements\n• Bachelor/Master degree in Business, Social Sciences, or Computer Science\n• Experience/knowledge in econometric, statistical analyses\n• Hands-on experience with data analysis using R\n• General research experience in completing a research project\n• Excellent communication & writing skills\n• Excellent organizational skills and able to work effectively within deadlines\n• Ability to independently work\n\nWe regret to inform that only shortlisted candidates will be notified.Hiring Institution: NTU", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJSZXNlYXJjaCBBc3Npc3RhbnQgLSBCdXNpbmVzcyBEYXRhIEFuYWx5dGljcyIsImNvbXBhbnlfbmFtZSI6Ik5hbnlhbmcgVGVjaG5vbG9naWNhbCBVbml2ZXJzaXR5IiwiY29tcGFueV9taWQiOiIvbS8wbDQ5ayIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IlBWell1akxENW15bmlidmFBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVxRUNDdUlCUVU1VlgwNXhVVU5rWVdOaVFqWmtNR1ZaT0U5VGVHeG5VWGxNZERjMU5uZDVTazlsTkdGc1dUbDRjbTFGUVVSemJGY3pTbU5zTTBkUVZsQm5iMWxtVWswek9UaEpkMkpyU0hNemEySTVWa1k0ZWw5UmJXaEJNamRxUlhwMWFrdzVlamgzUVZGUFZFMUNSVGxzZFRZeVNFSlVWalZSVVRkS1luTlBSRlZSUm1FdFJ6Wk5PVkowTUZoc2VFSjBiamhmUWtSNGJGQkNibXhsWkhsSk0wWjNVbXBQUkRCcFlWZE5ZWFZyY1dobWMzZDBjbVV5UzJZeFJUTTBVRWszTWtWSFdqRlBXbGRzV1VOQ1MwRmFhalJUUzNoRUxWUkRaV2t5VTBWTVdWVlpYMTloWnhJV1VUTnhRMWxMUjJGSmJ6WjJkR2RYT0d4S1YwRkVaeG9pUVU5TldWSjNRMU10UVhSaWRVczJlRGN0WVUxbVMwZE1ObTlQY1MxSFoyTnFVUSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzYwIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1vbnN0ZXIiLCJsaW5rIjoiaHR0cHM6Ly93d3cubW9uc3Rlci5jb20uc2cvYW1wL2pvYi12YWNhbmN5LXJlc2VhcmNoLWFzc2lzdGFudC1idXNpbmVzcy1kYXRhLWFuYWx5dGljcy1uYW55YW5nLXRlY2hub2xvZ2ljYWwtdW5pdmVyc2l0eS1zaW5nYXBvcmUtMjcwNzA3NzcuaHRtbD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "VP, Data Scientist, Personal Financial Services", "company_name": "United Overseas Bank", "location": "Singapore", "via": "via Laimoon.com", "description": "Posting Date: 14-Apr-2021\n\nLocation: SG\n\nCompany: United Overseas Bank Limited\n\nAbout UOB\nUnited Overseas Bank Limited (UOB) is a leading bank in Asia with a global network of more than 500 branches and offices in 19 countries and territories in Asia Pacific, Europe and North America. In Asia, we operate through our head office in Singapore and banking subsidiaries in China, Indonesia, Malaysia and Thailand, as well as branches and offices.\nOur history spans more than 80 years. Over this time, we have been guided by our values - Honorable, Enterprising, United and Committed. This means we always strive to do what is right, build for the future, work as one team and pursue long-term success. It is how we work, consistently, be it towards the company, our colleagues or our customers.\n\nAbout the Department\nThe Retail function provides Personal and Business Banking customers with financial solutions tailored to their needs. We help them manage their money wisely and meet their financial... goals through an extensive range of products and services. These include deposit, insurance, secured and unsecured loans, investment and wealth advisory services.\n\nPersonal Financial Services\nWe design and provide products and services that empower our customers to enjoy greater banking convenience while they extract more value from their money. In particular, we are focused on promoting and developing healthy saving and investment practices across generations.\n\nJob Responsibilities\n• Understand business requirements and design analytical solutions to solve identified business problems\n• Develop advanced analytics workflows for exploratory analysis, feature engineering, model development, resultvalidation and insight visualization\n• Create analytical assets and capabilities to support various analytics projects\n• Collaborate with business stakeholders and analytics/platform teams to operationalize models and drivemeasurable business impact\n• Perform regular audits and improvements on models to ensure consistency and relevancy\n\nJob Requirements\n• Advanced degree in Statistics, Mathematics, Engineering, Computer Science or other related field\n• Relevant working or internship experience in banking / financial services / consulting industry\n• Familiarity with analytical frameworks and languages such as SQL, R, Python and SAS\n• Practical experience in solving complex problems using scientific methods and modelling approach usingexperimental, statistical, machine learning and visualization techniques\n• Ability to work independently and collaboratively\n• Excellent written and verbal communication skills\n• A drive to learn and master new technologies and techniques\n\nBe a part of UOB Family\nUOB is an equal opportunity employer. UOB does not discriminate on the basis of a candidate's age, race, gender, color, religion, sexual orientation, physical or mental disability, or other non-merit factors. All employment decisions at UOB are based on business needs, job requirements and qualifications. If you require any assistance or accommodations to be made for the recruitment process, please inform us when you submit your online application.\n\nApply now and make a difference.\n\nretail banking", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJWUCwgRGF0YSBTY2llbnRpc3QsIFBlcnNvbmFsIEZpbmFuY2lhbCBTZXJ2aWNlcyIsImNvbXBhbnlfbmFtZSI6IlVuaXRlZCBPdmVyc2VhcyBCYW5rIiwiY29tcGFueV9taWQiOiIvbS8wNGdqZDEiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJpaHNyNGEyelJEOF9zTkpJQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdllCQ3JjQlFVNVZYMDV4VVdKR1YydHNOR1ZZVW1KMVdWSnpNMTlRVTBSbGNHSkJYelpHYTFGdlRqYzFUekJzY2tNNFJtMXpVSGxmUjBWTU1UZGtUV053YkZSeE0zWnpNRU5rT1ROMlMwZHNjbE5qU2toVU0zWTRSRU13VXpSRlZWaFhZM2xtYW1oQ1ZEWlJSRmxUTlhWUFduQkZWSEpWVEZoRmIzTnZTR1pLWTNjdGIwdFBSM0J5UzJGbU1tc3RZa1p3U1RGRmEybzNNMkppWTB4elMyWlBZM1EzZUVObVpsQk5kSGxWYWt0a1Yxb3pkMDAzVEd4NU4wZEZFaFpSTTNGRFdVdEhZVWx2Tm5aMFoxYzRiRXBYUVVSbkdpSkJUMDFaVW5kQ2RubDBhMWw1TFZsck5UWjJVM2QzU1ZOeFYycE9PVlY0YUhSQiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzY4IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExhaW1vb24uY29tIiwibGluayI6Imh0dHBzOi8vam9icy5sYWltb29uLmNvbS9qb2JzL2V4dGVybmFsdmlldy8yNTk4NTgxMj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Business Analyst (BB-D9DBB)", "company_name": "DYSON OPERATIONS PTE. LTD.", "location": "Singapore (+1 other)", "via": "via BeBee", "description": "Roles & ResponsibilitiesDyson Global ITAt Dyson, we demand the highest standard of performance from the technologies we engineer. Our people expect the same from the technology that supports them. We are a community that appreciates and advocates better engineering. A community of pioneers.Dyson IT are mid-transformation. Our aim, to create robust IT architecture, to manage data effectively and efficiently and continue to grow our world-class team. A team who is strategic, enabling business acceleration, growth and success.Our Application Business Services TeamDyson’s Global IT applications service has end to end accountability for the design, delivery and support of all business applications enabling Dysons global commercial, operational and enterprise business process. Forming a large proportion of the IT Function, the team are arranged into investment areas including Owner Experience & Retail, Supply Chain, Manufacturing, Finance & compliance and People and collaboration. About the... roleReporting to the Business Analyst Lead, you will be responsible for: Supporting analysis activity in order to elicit requirements and inform business decisions. Supporting the implementation of information system and enhancements in line with business need and aiding benefits realisation. Investigating, analysing and reviewing project or business documentation. Supporting the definition of requirements for improving processes and systems. Supporting the creation and iteration of acceptance criteria in preparation for the deployment of information and communication systems. Producing business models and assisting in the development of business cases. Working independently or collaboratively on complex situations and tasks. Providing specialist advice on subject to multiple stakeholders on complex issues. Acting as a role model and/or coach to Associate Business Analysts. Core Competencies (SFIA):Business analysis - BUAN – Level 4 Investigates operational requirements, problems, and opportunities, seeking effective business solutions through improvements in automated and non-automated components of new or changed processes. Assists in the analysis of stakeholder objectives, and the underlying issues arising from investigations into business requirements and problems, and identifies options for consideration. Works iteratively with stakeholders, to identify potential benefits and available options for consideration, and in defining acceptance tests. Requirements definition and management - REQM – Level 3 Defines scope and business priorities for small-scale changes and may assist in larger scale scoping exercises. Elicits and discovers requirements from operational management and other stakeholders. Selects appropriate techniques for the elicitation of detailed requirements taking into account the nature of the required changes, established practice and the characteristics and culture of those providing the requirements. Specifies and documents business requirements as directed, ensuring traceability back to source. Analyses them for adherence to business objectives and for consistency, challenging positively as appropriate. Works with stakeholders to prioritise requirements. Business Modelling – BSMO – Level 3 Conversant with techniques covering full range of modelling situations. Models current and desired scenarios as directed. Selects appropriate modelling techniques for meeting assigned objectives. Gains agreement from subject matter experts to models produced. Reviews resulting models with stakeholders and gains resolution to resultant issues. Data Analysis – DTAN – Level 3 Applies data analysis, data modelling, and quality assurance techniques, based upon a detailed understanding of business processes, to establish, modify or maintain data structures and associated components (entity descriptions, relationship descriptions, attribute definitions). Advises database designers and other application development team members on the details of data structures and associated components. About youEssential: Years (>2) of broad practical experience in the role, with repeated practice performing business analysis in a variety of complex situations. Knowledge requirements: Deep functional SAP PP, MES knowledge and machine integration via OPC UA or TCP/IP Once embedded, will typically demonstrate good Domain and/or System knowledge inside own area. Minimal Domain and/or System knowledge outside of own area. Awareness of the wide range of activities performed by BAs. Can cope with complex cases through deliberate analysis and planning. Can achieve excellent results on small, less complicated work without supervision. Project implementation via Agile or waterfall or hybrid and enhancement process. Desirable: Relevant professional qualifications; including either: BCS International Diploma in Business Analysis, or IIBA Level 3 Certified Business Analysis Professional (CBAP) A willingness to work towards more advanced Qualification such as: BCS Advanced International Diploma in Business Analysis Experience of working in matrix structures, with cross functional teams and operating under both line reporting and project task managers Experience of working in Agile / scrum framework environments Has experience with S/4 Hana implementation. FMCG industryTell employers what skills you haveAgile & Waterfall MethodologiesBusiness AnalysisCommunication SkillsInformation TechnologyManagementMESProcess ImprovementProject ManagementRequirements AnalysisRequirements GatheringSAPSAP PPStakeholder EngagementStakeholder Management", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJCdXNpbmVzcyBBbmFseXN0IChCQi1EOURCQikiLCJjb21wYW55X25hbWUiOiJEWVNPTiBPUEVSQVRJT05TIFBURS4gTFRELiIsImNvbXBhbnlfbWlkIjoiL2cvMTFmeTI5bWM2ZyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6InhiWi1hMTZEV19zOUJCRE1BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVvc0NDc3dCUVU1VlgwNXhVVEZRV0RkTGFFbHpNalYxWjJwaGNVeFVObG90TUZOVU5rNHdaakpNWkU5U1ltUjNaamMwUTJOcWRtNW5lbEpZTVdoaVlXSXdXRmRzZUhGcU5YWk5aMVY0ZVVwVmFGTkZVbTVoYTBRNFQza3djVWcwVEdWUGRrTTVORXQyZW5KWWFUVkpkVGt4VDA5bWMyOVZjems1ZDNaQ2VHMDJiVXM1VDNwak1VUlpUMmxqWVVkRk4zcE1WMWgwZFZsSE1rUXlTSEkyUVc1T1RHWkhPVVF4UTBoRlNrZERNMjVVZGpsM2FVZDRjV2hMWlY5SWRXWk9XRUp3TWpaMVltRnhhMHRWU3pkbWJUTkpFaFpSTTNGRFdVdEhZVWx2Tm5aMFoxYzRiRXBYUVVSbkdpSkJUMDFaVW5kRFFsTXhXazFoUW5oT2ExWXdTMFl0VUdrdGF6QnRSblkwV1dKMyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzc1IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJlQmVlIiwibGluayI6Imh0dHBzOi8vc2cuYmViZWUuY29tL2pvYi8yMDIxMDQxNy0wMzBlNzg5MjEwZGI5YzM4NGQ0NzcwNDY2ZjRkOWRiYj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Business Operations", "value": "GC06"}, {"text": "Science and Engineering", "value": "GC27"}, {"text": "Management", "value": "GC18"}, {"text": "Accounting and Finance", "value": "GC01"}, {"text": "Advertising and Marketing", "value": "GC03"}, {"text": "Admin and Office", "value": "GC02"}, {"text": "Human Resources", "value": "GC15"}, {"text": "Legal", "value": "GC17"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Sales and Retail", "value": "GC26"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "Data analyst", "value": "data analyst"}, {"text": "Business analyst", "value": "business analyst"}, {"text": "Analyst", "value": "analyst"}, {"text": "Associate", "value": "associate"}, {"text": "Senior", "value": "senior"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Data scientist", "value": "data scientist"}, {"text": "Insights analyst", "value": "insights analyst"}, {"text": "Operations analyst", "value": "operations analyst"}, {"text": "Project manager", "value": "project manager"}, {"text": "Project officer", "value": "project officer"}, {"text": "Administrators", "value": "administrators"}, {"text": "Builder", "value": "builder"}, {"text": "Business", "value": "business"}, {"text": "Cloud consultant", "value": "cloud consultant"}, {"text": "Control analyst", "value": "control analyst"}, {"text": "Data engineer", "value": "data engineer"}, {"text": "Executive", "value": "executive"}, {"text": "Intelligence analyst", "value": "intelligence analyst"}, {"text": "It analyst", "value": "it analyst"}, {"text": "Performance manager", "value": "performance manager"}, {"text": "Product analyst", "value": "product analyst"}, {"text": "Research analyst", "value": "research analyst"}, {"text": "Research assistant", "value": "research assistant"}, {"text": "Senior analyst", "value": "senior analyst"}, {"text": "Senior associate", "value": "senior associate"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Solution architect", "value": "solution architect"}, {"text": "Support analyst", "value": "support analyst"}, {"text": "Systems analyst", "value": "systems analyst"}, {"text": "Technology consulting", "value": "technology consulting"}, {"text": "Unit", "value": "unit"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Internship", "value": "INTERN"}, {"text": "Part-time", "value": "PARTTIME"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Accounting", "value": "/business/naics2007/5412"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Mining", "value": "/business/naics2007/21"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Travel", "value": "/business/naics2007/5615"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "DBS Bank", "value": "/m/01q7n5"}, {"text": "SingTel", "value": "/m/020zfl"}, {"text": "United Overseas Bank", "value": "/m/04gjd1"}, {"text": "Nanyang Technological University", "value": "/m/0l49k"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "Bank of Singapore", "value": "/m/0r3vczm"}, {"text": "Binance", "value": "/g/11hcz1r4wl"}, {"text": "Citi", "value": "/m/01dfb6"}, {"text": "Cognizant Singapore, Cognizant Technology Solutions", "value": "/m/03bf9h"}, {"text": "Dyson", "value": "/m/05cskg"}, {"text": "EPAM Systems", "value": "/m/0dlnrc"}, {"text": "Ernst & Young", "value": "/m/0g9jc"}, {"text": "Goldman Sachs Services Private Limited", "value": "/g/11g9mm5tzn"}, {"text": "GovTech Singapore", "value": "/g/11dxpkfs_6"}, {"text": "PEOPLE PROFILERS", "value": "/g/11dxq43n_6"}, {"text": "PwC Singapore", "value": "/g/11dxpz2lh8"}, {"text": "Sciente International", "value": "/g/11c73gj19n"}, {"text": "AIR LIQUIDE INDUSTRIAL SERVICES PTE LTD", "value": "/g/11hg55y1rb"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Accounting and Corporate Regulatory Authority", "value": "/m/09g7_b3"}, {"text": "Agency for Integrated Care", "value": "/g/11c73jd3yt"}, {"text": "Amazon", "value": "/m/0mgkg"}, {"text": "Amazon Web Services Singapore", "value": "/m/0rznzt1"}, {"text": "BeathChapman Pte Ltd", "value": "/g/11f01b3y2c"}, {"text": "Big Cloud", "value": "/g/11c743lwsr"}, {"text": "Bloomberg", "value": "/m/027sm6"}, {"text": "Burpple", "value": "/g/11dxps5yv5"}, {"text": "CPF Board", "value": "/m/0615qb"}, {"text": "ClearanceJobs", "value": "/g/11fy1pft9v"}, {"text": "Comfort Transportation Pte Ltd", "value": "/g/11f01gw2xt"}, {"text": "Credit Agricole Group", "value": "/m/028vbm"}, {"text": "DYSON OPERATIONS PTE. LTD.", "value": "/g/11fy29mc6g"}, {"text": "Deloitte", "value": "/m/02spfd"}, {"text": "Direct Search Asia", "value": "/g/11fy260nhz"}, {"text": "EngageRocket", "value": "/g/11c73p5x97"}, {"text": "Epson Singapore", "value": "/g/11dxpfq_tf"}, {"text": "Expedia Group", "value": "/m/03gq420"}, {"text": "GLOBALFOUNDRIES Singapore", "value": "/m/05pcrz0"}, {"text": "Goldman Sachs", "value": "/m/01xdn1"}, {"text": "Google", "value": "/m/045c7b"}, {"text": "Government Technology Agency (GovTech)", "value": "/g/11gh0528nq"}, {"text": "Ideallss", "value": "/g/11g70fpjm5"}, {"text": "IoTalents", "value": "/g/11dxq187wm"}, {"text": "JAC Recruitment", "value": "/g/121g71_s"}]}]}