{"search_metadata": {"id": "608279395fc4936108f7cd78", "status": "Success", "json_endpoint": "https://serpapi.com/searches/61d1ea4ed8e6787f/608279395fc4936108f7cd78.json", "created_at": "2021-04-23 07:37:29 UTC", "processed_at": "2021-04-23 07:37:29 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28data+scientist%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=30", "raw_html_file": "https://serpapi.com/searches/61d1ea4ed8e6787f/608279395fc4936108f7cd78.html", "total_time_taken": 1.5}, "search_parameters": {"q": "(data scientist) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "30"}, "jobs_results": [{"title": "Data Scientist (BOS AML) - AI Lab", "company_name": "OCBC Bank", "location": "Singapore", "via": "via Laimoon.com", "description": "Job description:\n• Understand and solve identified business problems from curated datasets.\n• Design analytical solutions and experiments.\n• Conduct data exploration, feature engineering, visualization and develop models.\n• Model validation and deployment preparation with engineering team.\n• Be a thought-leader and drive innovation within the organisation.\n\nQualifications\nRequirements:\n• Postgraduate degree in Statistics, Mathematics, Artificial Intelligence, Machine Learning or a related field.\n• Minimum 4 years of working experience with AI, ML, Data Science or a related field.\n• Minimum 1 year of project management/team leading experience.\n• Experience in applying machine learning techniques and designing algorithms that are scalable and production-grade.\n• Working experience with analytical tools and languages such as Python scikit-learn, R, SAS ML or equivalents. Experience with Spark, H2O or other Hadoop based frameworks is a plus.\n• Clear communicator, with the ability to... articulate ideas with data and have experience with stakeholder management.\n• Experience with operating in a corporate environment and stakeholder management.\n• Strong results driven personality with an innovative spirit.\nResearch", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEYXRhIFNjaWVudGlzdCAoQk9TIEFNTCkgLSBBSSBMYWIiLCJjb21wYW55X25hbWUiOiJPQ0JDIEJhbmsiLCJjb21wYW55X21pZCI6Ii9tLzA1NXIyNyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Ink3UXRsbnI2ZHQzNHpxOXJBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhVV1JSYld4NGJWa3diRlV3U2kxeFNIZFhaRWRFTkd3eE9VWmxVRE5IUzJFemJITjNiVjlCV1dkc1F6Vk5ObmRSU0VwZllVcG5TMUpGTFhaMmJVMXNXUzFmWjJ4NmJrWnNhV3MyV0hsalN5MWpUMGR2YjNaQmJsSTNUM1YwU1ROWk5uQmZhM1pzVkVSWmFVaEVkV2RYYjE5elNFTXRVelkzY0c5aFdWOTJVVE42ZFVWblNtOVZTV2xYZDJKMVYwTXpiVEp0TkVSSFRFaHJVRXAzRWhaUFdHMURXVXBsY1UwMWFsZDBVV0ZoZG5CeVdVRjNHaUpCVDAxWlVuZEJNREJKVlRrNVZsQlRTa2RVU1dsRU9HaFJTWFp2U0RGS056TjMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY183IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExhaW1vb24uY29tIiwibGluayI6Imh0dHBzOi8vam9icy5sYWltb29uLmNvbS9qb2JzL2V4dGVybmFsdmlldy8yNTk4NTc5NT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "School of Infocomm - Lecturer​/Emerging Technologies ​/Machine Learning ​/Artificial Intelligence", "company_name": "Republic Polytechnic", "location": "Singapore (+1 other)", "via": "via Learn4Good", "description": "Position: School of Infocomm - Lecturer (Emerging Technologies / Machine Learning / Artificial Intelligence)\nAbout Republic Polytechnic\n\nThe first educational institution in Singapore to leverage the Problem-based Learning approach for all its diploma programmes, Republic Polytechnic (RP) has seven schools offering courses in Applied Science, Engineering, Management and Communication, Hospitality, Infocomm, Sports, Health & Leisure, and Technology for the Arts.\n\nTo support Singapore’s national effort to promote continuous, lifelong learning, our Academy for Continuing\n\nEducation (ACE) offers a wide range of part-time programmes.\n\nWe welcome you to grow with us! Discover a people- and family-oriented culture, where you are inspired to improve as you nurture lifelong learners.\n\nFor more information from RP, please visit or follow us on .\n\nResponsibilities\n\nThe school is looking for dynamic individuals who can perform the following tasks for our full time and part-time course offerings... in areas related to Machine Learning and Artificial Intelligence:\n\nCurriculum development, facilitate student learning, project supervision, assessment setting and associate tasks for modules related to areas related to Machine Learning and Artificial Intelligence and other foundational ICT related modules\n\nDesigning and developing materials, including e-learning\n\nSupporting student development in areas of mentoring, career guidance and competition training\n\nSoliciting and supervising student internships\n\nParticipating in the delivery of outreach activities to market the school and our course offerings to potential students\n\nPossibly involved in supervising poly-wide projects as well as off-campus projects with the industry\n\nYou will also get the opportunity to work closely with other staff in developing new and innovative technologies to showcase such capabilities via use of AI in edge devices and conversational UI for use in bots. You should possess good oral and written skills along with a high degree of self-motivation and ability to work effectively in a team environment.\n\nRequirements Qualification preferably in the field of Data Science, Artificial Intelligence and Machine Learning\n\nA minimum of five years industry experience, preferably in a related field. Teaching experience is an added advantage\n\nMust have experience in one or more of the following areas:\n\nKnowledge of Machine Learning algorithms, Deep Neural Network and Reinforcement Learning\n\nDemonstrated ability in the application of Machine Learning/AI in real-world industrial settings with large scale data\n\nCertification/Knowledge on cognitive tools like Microsoft Bot Framework & Cognitive Services, IBM Watson, Amazon Alexa etc.\n\nExperienced in distributed processing, database modeling, database development, data pipelines, API design, optimization, modelling, big data, model implementation, data visualization, messaging systems\n\nExperienced in using Deep Learning frameworks such as Keras, Tensor\n\nFlow, Caffe, Caffe2, PyTorch, or MxNetExperienced in using Apache Kafka, Apache Spark, Scala, Apache Flink, Apache Airflow, Apache Storm, Python, NumPy, Pandas, Mesos, Cassandra, HBase, ZooKeeper, Map-Reduce, Hadoop HDFS, Hadoop YARN\n\nAbility to work independently as well as in a team\n\nAbility to work within tight deadlines\n\nGenuine passion to share knowledge and interact with youths, with strong communication and interpersonal skills", "extensions": ["1 day ago", "Contractor"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Contractor"}, "job_id": "eyJqb2JfdGl0bGUiOiJTY2hvb2wgb2YgSW5mb2NvbW0gLSBMZWN0dXJlcuKAiy9FbWVyZ2luZyBUZWNobm9sb2dpZXMg4oCLL01hY2hpbmUgTGVhcm5pbmcg4oCLL0FydGlmaWNpYWwgSW50ZWxsaWdlbmNlIiwiY29tcGFueV9uYW1lIjoiUmVwdWJsaWMgUG9seXRlY2huaWMiLCJjb21wYW55X21pZCI6Ii9tLzA2amd6dyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6InhUZ3habDF0cFhGdEEzMWpBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2WUJDcmNCUVU1VlgwNXhVMkpyWmt0UlVHSmpablkzTXpKWVVWWlRhR00zZVRVdFZtMHpabEpmYzNKSGVXNW5WbmxpYVhWVmRsOVVkRW8yWkZJM2JXMXFSMWRwWWxCRlMzVnBjVjlOVWpRM09VaE9MVWMzUlVjeloxQXRjM2xSU0VaamRURkJaelo1T0dWYVowZzFjMUZRTjBSNFNqQldVV1ZOZUdwd2RYbHpZMVpuY3pGaVEyeFhhM2hCU1U4dFpHWnFkRWx1WlcxU1lVaEJhV05tUjJGR1psQndkell0WjBSYVNYcFZWblpUU0RRd1ptNTJjME5RWm1GUkVoWlBXRzFEV1VwbGNVMDFhbGQwVVdGaGRuQnlXVUYzR2lKQlQwMVpVbmRCV1c4eVkwUTVialpvUVVjeE5sSnljME10YlU5RFYwZDJiVFZSIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMTQiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGVhcm40R29vZCIsImxpbmsiOiJodHRwczovL3d3dy5sZWFybjRnb29kLmNvbS9qb2JzL3NpbmdhcG9yZS9pbmZvX3RlY2hub2xvZ3kvMjcxMzg2NjUyL2UvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Research Associate (Computer Science and Data Science) (R00005334)", "company_name": "Nanyang Technological University", "location": "Singapore (+1 other)", "via": "via Jobs Guide Hub", "description": "Research Associate (Computer Science and Data Science) (R00005334) Jobs in Singapore at Nanyang Technological University\n\nTitle: Research Associate (Computer Science and Data Science) (R00005334)\n\nCompany: Nanyang Technological University\n\nLocation: Singapore\n\nType: Full-Time\n\nCategory:\n\nSchool of Computer Science and Engineering (SCSE) invites applications for the position of Research Associate.\n\nKey Responsibilities:\n\nThe Research Associate (RA) will be conducting research and development in the area of spatiotemporal and graph data mining and learning. The RA will be researching, designing and developing models and algorithms for mining spatiotemporal and graph data.\n\nJob Requirements:\n\nMaster degree in Computer Science and Data Science discipline\n\nResearch and development experience on spatiotemporal and graph data\n\nProgramming skills and good knowledge and experience on Software Engineering are an asset\n\nEnglish writing and speaking skills\n\n​\n\nWe regret that only shortlisted... candidates will be notified", "extensions": ["5 days ago", "Full–time"], "detected_extensions": {"posted_at": "5 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJSZXNlYXJjaCBBc3NvY2lhdGUgKENvbXB1dGVyIFNjaWVuY2UgYW5kIERhdGEgU2NpZW5jZSkgKFIwMDAwNTMzNCkiLCJjb21wYW55X25hbWUiOiJOYW55YW5nIFRlY2hub2xvZ2ljYWwgVW5pdmVyc2l0eSIsImNvbXBhbnlfbWlkIjoiL20vMGw0OWsiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJ3T1dOcVJUOS1CbDdHLUxMQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFcUVDQ3VJQlFVNVZYMDV4VkV0MU4yTm1ORnBGZVcxVmEySnZiSEZRWDFsRU1tbElXbVJqV1V4eWExSm5aRGxDVm1aUVpsaFBja1JCWVZwTFFTMTZiRU56WW1GMWFVcDJlbUZpV1VWUGR6SnlTVkJJU2tGdWVrRnpjR00xUTJaaVJtMTFjRTVIU1RaU2RrdzVSV0ZJUWxGc1NYQTNObHBKTkdGb1ZtVmZRMGxLU1dFdE9EWnVlV0ZuUjJJMWIxZERiRXhmVW5OZmRFOHpWRkoyYzJ0U05XdGpaSHAwYUhONFUycFBTR2xCU0ZSTFprSmFlbXM1WW5wSGVrTmtlbEZaWlhZM1NuTkVWR1Y0WlZWU1lrdGhZVjlSY2psT1JuazJVM0k1TkV0bFpVVlJSVmh0UjBSbmR4SVdUMWh0UTFsS1pYRk5OV3BYZEZGaFlYWndjbGxCZHhvaVFVOU5XVkozUVdwS05GZHpTWGMzTjFob2VXcElUbXBXZEdob2VVOXVZMjA1UVEiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18yMSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIEd1aWRlIEh1YiIsImxpbmsiOiJodHRwczovL2pvYnNndWlkZWh1Yi5jb20vam9iL3Jlc2VhcmNoLWFzc29jaWF0ZS1jb21wdXRlci1zY2llbmNlLWFuZC1kYXRhLXNjaWVuY2UtcjAwMDA1MzM0Lz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Data Engineer/data Scientist", "company_name": "Singapore Tourism Board", "location": "Singapore (+1 other)", "via": "via MNC Jobs Singapore | MNC Jobs In Singapore", "description": "Purpose of job:\n\nSupport the Data Science team in:\n• Ensuring optimised data collection and data flow\n• Helping project manage and coordinate DT's data ingestion and data processing pipelines across platforms\n• Ensuring that all data systems meet our business requirements and allow scalability\n\nMain Responsibilities:\n• Collaborate with the data science team to create data tools to assist the team in building and optimising our data-related initiatives\n• Help setup, configure, deploy and validate machine learning models and analytics scripts on Amazon Sagemaker\n• Develop data integrations (through API, SFTP etc) between AWS S3, Redshift instances and on-premise database instances (e.g. HANA)\n• Work closely with team to identify, define, ingest and process data from multiple sources in support of model development\n• Analyse and assess the effectiveness and accuracy of new data sources (e.g. datasets received from stakeholders) and annotation/ labelling of new training inputs.\n• Assemble... large, complex datasets that meet functional and non-functional business requirements\n• Identify, design and implement internal process improvements: automating manual processes, optimising data delivery, re-designing infrastructure for greater scalability, etc.\n• Work closely with vendors and internal stakeholders to project manage and coordinate DT’s data ingestion and data processing pipelines across platforms which can include mobile apps, SaaS platforms, on-premise databases and partner systems\n• Support the integration and deployment of developed algorithms, machine learning and analytical models into current analytics system / production\n• Develop monitoring toolkits to ensure that integration is executed successfully and alerts where integrations have failed\n• Help architect DT’s data integrations and data processing flows between external / 3rd party data sources, AWS cloud datawarehouses (e.g. Redshift) and internal on-premise database instances for workloads at scale\n• Provide guidance to internal teams on best practices for cloud to on-premise data integrations\n• Develop set processes for data mining, data modelling and data production\n• Recommend different ways to constantly improve data reliability and quality, including helping review and enhance the existing data collection procedures to include data for building analytics models relevant for industry transformation\n\nRequirements:\n• At least 5 years of experience in a related field with real-world skills and testimonials from formal employers.\n• Working experience for structured and unstructured datasets is essential\n• Experience with big data tools: Hadoop, Spark, Hive, Sqoop, etc.\n• Experience with relational SQL and noSQL databases, including Postgres and Cassandra.\n• Experience with AWS cloud services: EC2, S3, EMR, Redshift, RDS, Lambda functions.\n• Experience with AWS Sagemaker.\n• Experience with stream-processing systems: Storm, Spark-Streaming, etc.\n• Experience with data pipeline and workflow management tools.\n• Experience with object-oriented / object function scripting languages: Python, R, Java, etc.\n• Experience building and optimising ‘big data’ data pipelines, architectures and databases\n• Experience in performing root cause analysis on internal and external data and processes to answer specific business questions and identify opportunities for improvement.\n• Strong analytics skills related to working with structured and unstructured datasets.\n• Build processes supporting data transformation, data structures, metadata, dependency and workload management.\n• Intellectual curiosity to find new and unusual ways of how to solve data management issues.\n• A successful history of manipulating, processing and extracting value from large disconnected datasets\n• Experience in using Qliksense will be advantageous\n• Experienced data pipeline builder and data wrangler who enjoys optimising data systems and building them from ground up.\n• Strong project management and organisational skills.\n• Experience supporting and working with cross-functional teams in a dynamic environments\n• Certified Scrum Master/ Agile Developer\n• Certified AWS Cloud Architect", "extensions": ["11 days ago", "Full–time"], "detected_extensions": {"posted_at": "11 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEYXRhIEVuZ2luZWVyL2RhdGEgU2NpZW50aXN0IiwiY29tcGFueV9uYW1lIjoiU2luZ2Fwb3JlIFRvdXJpc20gQm9hcmQiLCJjb21wYW55X21pZCI6Ii9tLzA2MjdyeiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IktlUFpOa0tyZjJyclhQMzZBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2WUJDcmNCUVU1VlgwNXhVVzVDYVV0dWVtZFlWVGRyV2tFd1JXRklhVFJsTjJSVVIwVmFRa1kwYVVKelpIRXpUR05NVUY5QlluVllTMmxHVjJGNUxXcFlNMnBKTmxkNFZVRnhaM0Y0TTI5ME1GOU5kbXMxTXpSTlgwcFNabTVxUW1wa2VrOTRlVVZpYW5OYVRXeG9UVWxxVVdOaVFXOTZWMUp2UTJ0Nk1tZDNSRkJFTFRoVFEyMVZZbVJvY1dkbVdFWlRVbkJQVG1zM2ExRTVNa1ZNVjI1TVIzZGxMVFZhVEdGeVJrbFJjREExT1dFdGVEVk5aa0o0VVVaVkVoWlBXRzFEV1VwbGNVMDFhbGQwVVdGaGRuQnlXVUYzR2lKQlQwMVpVbmRFZG1WNmJEUkthWGxyV1dwd2JHc3RaMjVFU2xWU1RuWkpZWGxuIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMjkiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTU5DIEpvYnMgU2luZ2Fwb3JlIHwgTU5DIEpvYnMgSW4gU2luZ2Fwb3JlIiwibGluayI6Imh0dHBzOi8vc2cubW5jam9iei5jb20vam9icy9kYXRhLWVuZ2luZWVyZGF0YS1zY2llbnRpc3Qtc2luZ2Fwb3JlLTEyMzczNT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "AI/ML - Annotation Analyst- Thai Language Specialist", "company_name": "Apple", "location": "Singapore", "via": "via Jobs At Apple", "description": "Summary\nPosted: Apr 19, 2021\nWeekly Hours: 40\nRole Number:200198824\n\nImagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. The people here at Apple donʼt just craft products - they build the kind of wonder thatʼs revolutionized entire industries. Itʼs the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it.\n\nAre you interested in being part of a team that continues to innovate the way people and machines interact? The launch of Siri was a defining moment in the history of Artificial Intelligence. Siri offers a faster, easier way to get things done on your Apple devices, even before you ask. Millions of people now use Siri to send a message, play their favorite song or even take a selfie. The Siri team is... passionate about technology with a focus on enriching the Siri customer experience. We are looking for motivated Annotation Analysts that demonstrate active listening, integrity and acute attention to detail. Bring passion and dedication to your job and there's no telling what you could accomplish.\n\nThis position will be based at the Apple corporate campus at Ang Mo Kio.\n\nKey Qualifications\n\nKey Qualifications\n• Fluency in Thai reading, writing, and comprehension skills\n• Fluency in English reading, writing and comprehension skills\n• Excellent active listening skills with the ability to understand verbal nuances in the Thai language\n• Highly organized with strong attention to detail\n• Understanding of the APAC region and cultural variations where the Thai language is spoken\n• Demonstrates attention to detail and critical thinking skills in evaluation of Siri’s language usage and dialect\n• Ability to independently navigate systems and tools\n• Demonstrates integrity and focuses on customer privacy\n• Experience in content review or a similar environment, prior testing experience preferred\n• Demonstrates flexibility and adaptability to changing work-flows and responsibilities\n• Grows with a team where expertise is shared and feedback is welcomed\n• Excels at working independently to make timely decisions and take appropriate actions\n• Experience as an end user of Siri, similar Intelligent Personal Assistants, or other AI\n• Successfully meets or exceeds targets, working within tight deadlines\n• Ability to identify business process solutions that increase efficiencies\n• Ability to maintain focus and aim for high results through large volumes of tasks\n\nDescription\n\nDescription\nOur team is comprised of very talented individuals, who are passionate about AI/ML and ensuring Apple services are at their best. As part of the Annotation Team you'll play a central role in enhancing the user experience. We work in a fast paced, dynamic, technology focused environment. As an Annotation Analyst, you'll listen and transcribe audio files and evaluate Siri’s response and language usage, from customers who have opted in to the grading program. You'll use your language and cultural knowledge, along with analytical skills, to evaluate responses against guidelines. Your flexibility and the ability to prioritize tasks is essential. We focus on the user experience, thinking creatively on how customers use Siri and use this knowledge for improvements.\n\nBecause we believe our individual backgrounds, perspectives, and passions help us build the ideas that move all of us forward. We'll train you to be an expert in understanding, supporting and improving the customer experience. This position comes with competitive pay, great benefits, eligibility to participate in our company stock plan, time off, and employee discount.\n\nEducation & Experience\n\nEducation & Experience\nBachelors degree or equivalent work experience preferred\n\nAdditional Requirements\n\nAdditional Requirements\n• Ability to work Monday- Friday from 8:00am-5:00pm or 9:00am-6:00pm local time; with scheduling and work flexibility based on business needs\n• Positions with language skills require strong grammar and cultural awareness\n• Successful completion of a pre-employment assessment and background check\n• Successful completion of initial training and certification testing", "extensions": ["4 days ago", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBSS9NTCAtIEFubm90YXRpb24gQW5hbHlzdC0gVGhhaSBMYW5ndWFnZSBTcGVjaWFsaXN0IiwiY29tcGFueV9uYW1lIjoiQXBwbGUiLCJjb21wYW55X21pZCI6Ii9tLzBrOHoiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJST2h0aDJqR18zS2JDaHlTQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFc3NCQ293QlFVNVZYMDV4VVdGTlkxOVFiMnhHVDNCcmVqRlJNbkJRZHpaNlVWUkRUakZtVG1rNFlXVnBkWE5EYzFKYU1ISXRiV1p3UzBoSlNGSnZhMUpGZVdWVVlqRnhSVVI0ZVV0eVQwOWFPRXRHUTFab1MweFlkVFk0U0hodE9HVXdiRWxQTmpOM1REUktkVU0yVkhabWVIUkNNbEpKZFdwUWJYRmtWVm96UW5rM1NtMTFOR2N4Tld4V1drWllkazhTRms5WWJVTlpTbVZ4VFRWcVYzUlJZV0YyY0hKWlFYY2FJa0ZQVFZsU2QwRlhTWEJQZVhnemJFZzBXazB6TUhwQ2VVTkpVVzFCYjFaaFNuYyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzM3IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnMgQXQgQXBwbGUiLCJsaW5rIjoiaHR0cHM6Ly9qb2JzLmFwcGxlLmNvbS9lcy1jby9kZXRhaWxzLzIwMDE5ODgyNC9haS1tbC1hbm5vdGF0aW9uLWFuYWx5c3QtdGhhaS1sYW5ndWFnZS1zcGVjaWFsaXN0P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Data Science Customer Success Owner - APAC", "company_name": "Sparkline Pte. Ltd.", "location": "Singapore (+1 other)", "via": "via Monster", "description": "Our Team’s mission statement:\n\nWe are on a mission to harness the collective intelligence of humanity to solve the world's most impactful problems. We created an AI-powered problem-solving engine capable of coming up with creative ideas, hypotheses and solutions for a broad range of problem domains and industries, thus enabling social and business impact – worldwide.\n\nOur product is used by Data Scientists and Management Consultants in many of the largest and most prestigious companies in the world. Ensuring that they are empowered to use it to solve their problems efficiently and that they are not held back by knowledge gaps is crucial for our business\nWhat will you do?\n• Own the customer success space in APAC\n• Shape the tools and materials needed to onboard new customers and ensure their success\n• Work with our global teams on adapting existing training and certification materials for our market\n• Partner with our Data Scientist on how to shape analytics problems to be best suited... for our platform\n• Understand & collect the users’ needs of the product & develop the voice of the user within the company\nWhat will you need?\n\nThe following is what is a data scientist is expected to bring to the table - if you lack some of the background but still believe that you’re the right fit for the role, let us know why\n• Relevant work experience in data science - no specific length, but you must have experienced the difference between a real world analytics problem and an academic / kaggle exercise\n• A knack for teaching, mentoring and speaking. Upskilling our users through demonstrations, documentation or dialogue must be something you thrive in\n• University degree in a quantitative field - higher degrees are welcome\n• Experience with Machine Learning techniques (classification, regressions, feature engineering etc.)\n• Programming experience in a data-related language - ideally Python, but R & SQL are welcome, too\n• Exposure to other advanced analytics software (e.g., Alteryx, RapidMiner, Dataiku) is welcome but not essential\nWhat will you learn?\n• How Data Science gets applied in the real world to drive business & social impact\n• Expand your knowledge in the cutting-edge of applied AI technology\n• Much more!\nWhat do we offer?\n• Autonomous, open environment with smart and inspiring colleagues who support your ideas and growth\n• Opportunity to enhance your skill sets & creativity on cutting edge AI products that will have a genuine impact on our clients\n• Opportunity to work across various Industries and Domains and across different regions\n• An environment where your needs are taken seriously - whether it is with regards to working from home, child care leave, budget for training, and more", "extensions": ["16 days ago", "Full–time"], "detected_extensions": {"posted_at": "16 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEYXRhIFNjaWVuY2UgQ3VzdG9tZXIgU3VjY2VzcyBPd25lciAtIEFQQUMiLCJjb21wYW55X25hbWUiOiJTcGFya2xpbmUgUHRlLiBMdGQuIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJzQ0NuWDZsY0NVZHZlODJzQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1vbnN0ZXIiLCJsaW5rIjoiaHR0cHM6Ly93d3cubW9uc3Rlci5jb20uc2cvYW1wL2pvYi12YWNhbmN5LWRhdGEtc2NpZW5jZS1jdXN0b21lci1zdWNjZXNzLW93bmVyLWFwYWMtc3BhcmtsaW5lLXB0ZS1sdGQtc2luZ2Fwb3JlLTI2OTEzMjY3Lmh0bWw/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Data Scientist - In-App Service", "company_name": "Shopee", "location": "Singapore (+1 other)", "via": "via Karkidi", "description": "Job Description:\n• Mining cues from on-device data to detect suspicious behavior of users who tend to violate or abuse the system and policies of Shopee\n• Develop new features and components to enable inferencing of machine learning models on mobile devices\n• Write clean, maintainable and optimized codes that is properly tested and reviewed\n• Work cross-functionally with business, operation, and engineering teams during the whole life-cycle of security products, from problem formulation, solution design, implementation, maintenance and improvement.\n\nRequirements:\n• Bachelor's or higher degree in Computer Science or related fields\n• Passionate about coding and programming, innovation, and solving challenging problems\n• Hands-on experience with Android/iOS platform development\n• Experience with using Android/iOS framework, performance tools and optimization techniques\n• Developed apps that have been published\n• Experience with App SDK development is a plus\n• Experience with development... or deployment of machine learning models on mobile devices is a plus", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEYXRhIFNjaWVudGlzdCAtIEluLUFwcCBTZXJ2aWNlIiwiY29tcGFueV9uYW1lIjoiU2hvcGVlIiwiY29tcGFueV9taWQiOiIvZy8xMWdoM2ZrMzRyIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiQlNsa1g5emZRZzRxdFEyd0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFUxbDBibXc1VG1aR1lWODNPRlo1U0ZwNFVrMUdkVGxtWlRoSFRWcFNhM0ZzVWtsVmRYVllaemQzU1d4M1ltcGlRbXAwVldkTFZrRnFSVW94YmxkaUxUVmFSQzFIZW1wcFRXRllOVmxSTTBweFQyZFlSRW8yVFRVNFRqRXpSMHBUV0VwVFpqZGhaMjVXYTBSWGVrdDNVbVZUU3pVd2NVMHhNVVptVm5RdE9HWmpWM1J6ZUhKSE1XWTNjbU5pZEZadllYcHBhRXBFUmxkcGNubEJFaFpQV0cxRFdVcGxjVTAxYWxkMFVXRmhkbkJ5V1VGM0dpSkJUMDFaVW5kRU9FRjNhM1pSVjNrNVh6Tm1kVFJUVXkxdk9WOXplVXMwZVZCQiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzQ5IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEthcmtpZGkiLCJsaW5rIjoiaHR0cHM6Ly93d3cua2Fya2lkaS5jb20vam9iLWRldGFpbHMvMTE2Mz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior Machine Learning Engineer", "company_name": "AIR LIQUIDE INDUSTRIAL SERVICES PTE LTD", "location": "Singapore (+1 other)", "via": "via Jobs | Fidanto", "description": "Missions and Responsibilities\n\nTo lead AI /Machine learning projects for the APAC digital team.\nDesigning and developing machine learning and deep learning systems\nRunning machine learning tests and experiments Implementing appropriate ML algorithms\nStudy and transform data science prototypes\nAble to support chatbot deployment in countries with software engineer experiences\nDesign machine learning systems\nResearch and implement appropriate ML algorithms and tools\nDevelop machine learning applications according to requirements\nSelect appropriate datasets and data representation methods\nRun machine learning tests and experiments\nPerform statistical analysis and fine-tuning using test results\nTrain and retrain systems when necessary\nExtend existing ML libraries and frameworks\nKeep abreast of developments in the field\n\nCompetencies and Profile\n\nMSc or BSc graduate in Statistics, Mathematics or Computer Science\n5 - 7 years of relevant work experience in data science field\nProven experience... as a Machine Learning Engineer or similar role\nUnderstanding of data structures, data modeling and software architecture,Experience using statistical computer languages (R, Python, SLQ, etc.) to manipulate data and draw insights from large data sets.\nDeep knowledge of math, probability, statistics and algorithms\nKnowledge of a variety of machine learning techniques (clustering, decision tree learning, artificial neural networks, etc.) ,including Linear Regression, Decision Trees, Random Forest, Deep Learning, etc.\nFamiliarity with machine learning frameworks (like Keras or PyTorch) and libraries (like scikit-learn)\nExcellent written and verbal communication skills for coordinating across teams.\nA drive to learn and master new technologies and techniques.\nExperience visualizing/presenting data for stakeholders\nAbility to work as part of a distributed team.\nAbility to utilize and lead interns on projects.\nSpecific Training or Certification; Data Science, R or Python.\n• *We thank you for your interest in Air Liquide. Interested applicants are encouraged to send in a detailed resume, including reason for leaving for past employment. Please be informed that only shortlisted candidates would be notified", "extensions": ["28 days ago", "$13K a month", "Full–time"], "detected_extensions": {"posted_at": "28 days ago", "schedule_type": "Full–time", "salary": "$13K a month"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgTWFjaGluZSBMZWFybmluZyBFbmdpbmVlciIsImNvbXBhbnlfbmFtZSI6IkFJUiBMSVFVSURFIElORFVTVFJJQUwgU0VSVklDRVMgUFRFIExURCIsImNvbXBhbnlfbWlkIjoiL2cvMTFoZzU1eTFyYiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IkY2VzdmdmtvNEN4QUhZWllBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVyWUNDdmNCUVU1VlgwNXhVbTFVZDNOcFdGaG5Ra05ET0dOMFVUUk1lSEJLVjBOU05Fc3hSSFU0YVRFeVZqRlJNblpXUzNKdFNFNHpjMnR2WWxOeE9IZHZkREEyVUdkR1ZEWTJha0ZDTkhoSlZuTnlkRk5sWmpaVGFHSXlaRWRSU0ZsS2JGWjRhVWN0Y20xWFFsRk9jMVowTlU0M09XMXdOMEZETkRsQlNVMUxXbmw1VFZOS1NGcHBialZZVldGb2N6ZDNOV3BmWkRNNU9EaFJaalIwV0c5V2RGQnhTMTh5YTFGc05GRTJWbGxtUkVsb1dtNU1TMDF6ZFdsa2JFVkZlbmhrV0U4d1pVcGZRa0UwVjFwR2IwTjRhR3RoTVZCTWVYSnhXSHBPVTBWMWQxaFZia2x4ZG1aNWFFSmtjblpMUzJkcldGcFRjbEZ0TjFaMmN4SVdUMWh0UTFsS1pYRk5OV3BYZEZGaFlYWndjbGxCZHhvaVFVOU5XVkozUVdaYU4wZDFlaTExUTBRNVgwVjVhV05FUmxoRWFscFZXRTlPWnciLCJmY3YiOiIzIiwiZmNfaWQiOiJmY181NiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIHwgRmlkYW50byIsImxpbmsiOiJodHRwczovL3NnLmZpZGFudG8uY29tL2pvYnMvam9iLW9wZW5pbmcvY29tcHV0ZXItb2NjdXBhdGlvbnMtYWxsLW90aGVyL3Nlbmlvci1tYWNoaW5lLWxlYXJuaW5nLWVuZ2luZWVyLTI2MDUxNjE1Nz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Data Scientist", "company_name": "Titansoft Pte Ltd", "location": "Singapore (+1 other)", "via": "via Job Vacancies In Singapore", "description": "Game changer, armed with data.< strong>< p>\n\nYou know all about our users, through data analysis. And because you do, you can identify issues and present insights to our Product Owners, spurring them into action. Working with your team, you play a key role in enhancing our business value. After all, you're the one who ignited the spark. And no spark, no fire.< p>\n\nWhat a Data Scientist does in Titansoft:< strong>< p>\n• Apply statistical and machine learning techniques to build models for user classification, fraud detection and other objectives.< li>\n• Mine, analyze and visualize data from company databases to drive optimization and improve product development, marketing techniques and business strategies.< li>\n• Identify, understand and solve business problems based on the company's overall targets.< li>\n• Coordinate with different feature teams to implement models and design proper performance evaluation metrics.< li>< ul>\n\nWhat we are looking for in a Data Research Engineer... strong>< p>\n\nQualifications< strong>< p>\n• Bachelor (and above) in Computer Science, Mathematics or Physics, Engineering, Statistics or other equivalent qualifications< li>< ul>\n\nExperience< strong>< p>\n• Equip with knowledge and experience in application of a variety of Machine Learning techniques (clustering, decision tree, neural network, etc.)< li>\n• Equip with knowledge and experience in application of advanced statistical techniques (regression, various statistical tests, etc.).< li>\n• Real-world Machine Learning project experiences.< li>\n• Having kaggle or other competition experience is a plus.< li>< ul>\n\nSkills< strong>< p>\n• Proficiency in Python (must), SQL or other programming languages.< li>\n• Proficiency in common Machine Learning frameworks, etc., Scikit-learn, Keras, Tensorflow< li>\n• Strong problem-solving skills< li>\n• Excellent written and verbal communication skills for coordinating across teams and with stakeholders.< li>< ul>\n\nPlease apply for our position at the following link below.< strong>< p>\n\nhttps: www.titansoft.com en career 122< strong>< p>\n\nWhat everyone gets in Titansoft (psst. We didn't get that Best Tech Company to Work for Award in 2017 for nothing!)< strong>< p>\n• 18 days of rest and relaxation for each year (P.S. It gets even better over the years!)< li>\n• Competitive salaries and bonuses bench-marked against big players in the industry (Yeap, those companies!)< li>\n• Flexible working hours (Sleep in a little longer after fixing that pesky bug from last night)< li>\n• Comprehensive insurance coverage Very well-stocked pantry (We've never heard of the term 'Hunger Games', nope)< li>\n• Communities of Practice and Workshops catered for your growth and learning< li>\n• Substantial subsidies and programs to keep that creative flow while having fun (Health promotion program, annual overseas company outing, an annual dinner that nobody will ever forget, etc.)< li>\n• Hardcore work and hardcore fun!< li>< ul", "extensions": ["14 days ago", "Full–time"], "detected_extensions": {"posted_at": "14 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEYXRhIFNjaWVudGlzdCIsImNvbXBhbnlfbmFtZSI6IlRpdGFuc29mdCBQdGUgTHRkIiwiY29tcGFueV9taWQiOiIvZy8xMWc3MDUyajhwIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiODdSNS1nbzBHanlaQ0N6UUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZZQkNyY0JRVTVWWDA1eFVXRmhlRXhITjFSa05ERlVNVmxIZUhFM09HaG9lRjlhTWpKQlVWaHNkakJ1WVhoVGFXOVVTR1JDVEdSUlMzbDNNa2RrZW10S1h6QnFXblJuWVhWSGNqUjRSV1ZMUWs4NFptRlhRVEI1YTFoTU0xZEZUbTFCU1V0V2VHNHRRUzFqTUdwSWN6bElZMEpzYmtsc2VXSjBObm8xVUhGUGRHaHNYM0JaUm5OWmNrSjZkekZxWTFsYWFHdFNVSFo2WDNod2MybHRNazFSTFdKekxXRjZRa2hmUm10MFQyZGhiek5pU1ZnNVJVSmxabEJGRWhaUFdHMURXVXBsY1UwMWFsZDBVV0ZoZG5CeVdVRjNHaUpCVDAxWlVuZERWVmxJZFVwcE9Ya3pabTVXUTFoSk5pMDFSRmt3V0ZSVk5teG4iLCJmY3YiOiIzIiwiZmNfaWQiOiJmY182NCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2IgVmFjYW5jaWVzIEluIFNpbmdhcG9yZSIsImxpbmsiOiJodHRwczovL2pvYmVrYS5zZy9qb2JzLzE0NjE4L1RpdGFuc29mdC1QdGUtTHRkLURhdGEtU2NpZW50aXN0LTIwMjEtMDQtMDk/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Data Scientist Intern (Platform Services)-2021", "company_name": "TikTok", "location": "Singapore", "via": "via Bayt.com", "description": "About Platform Services Team\nThe Platform Services team mainly builds platform services for our core businesses and provide business/technical solutions in areas including location-based, social and international payment services, serving a series of key products such as Toutiao, Douyin, Hotsoon, Xigua Video, Dongchedi, Duoshan, Fanqie Novel, TikTok, Helo, etc. (apps with hundreds of millions of users). In terms of technology, we are exploring a global technical architecture, optimizing infrastructure services with tens of millions of queries per second, building company-level large-scale general components and platform services, and providing architecture solutions for major events (such as Spring Festival events and Douyin Night, etc.). We are promoting the development of our technology system. At the same time, we also learn from \"Hello World\" and strive to truly say \"Hello\" to the world. There are still many things to do, and there are many excellent people in our team. Are you... interested in joining us? We are looking for talented individuals to join us - people who want to inspire creativity and co-create the future with us. Successful candidates must be able to commit to the internship cycle below: -\n1. Off-cycle Internship - 02 Aug to 17 Dec (20 weeks)\nPlease state your availability clearly in the comments section (Start date, End date). Responsibilities\n1. Work with large, complex data sets. Solve difficult, non-routine analysis problems, applying advanced analytical methods as needed;\n2. Conduct analysis that includes data gathering and requirements specification, processing, analysis, ongoing deliverables, and presentations;\n3. Research and develop analysis, forecasting, and optimization methods to improve the quality of our core products like payment, growth, and game.\n1. Undergraduate who is currently pursuing a master in Engineering, Computer Science, Statistics, Mathematics, Physics or a related technical discipline from a university;\n2. Experience with statistical software (e.g., R, Python, MATLAB, pandas) and database languages (e.g., SQL);\n3. Expertise with statistical data analysis such as linear models, multivariate analysis, stochastic models, sampling methods;\n4. Experience articulating and translating business questions and using statistical techniques to arrive at an answer using available data. Application deadline: 15 April 2021\n1. Applications will be reviewed on a rolling basis and we encourage you to apply early;\n2. Interview starts from February 2021", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEYXRhIFNjaWVudGlzdCBJbnRlcm4gKFBsYXRmb3JtIFNlcnZpY2VzKS0yMDIxIiwiY29tcGFueV9uYW1lIjoiVGlrVG9rIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiI2aHFBQmhnbXNUMXF1MkJKQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJheXQuY29tIiwibGluayI6Imh0dHBzOi8vd3d3LmJheXQuY29tL2VuL3NpbmdhcG9yZS9qb2JzL2RhdGEtc2NpZW50aXN0LWludGVybi1wbGF0Zm9ybS1zZXJ2aWNlcy0yMDIxLTU4MTAyOTQ0Lz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}], "chips": [{"type": "Title", "param": "job_family_1", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Data scientist", "value": "data scientist"}, {"text": "Learning engineer", "value": "learning engineer"}, {"text": "Research associate", "value": "research associate"}, {"text": "Data science", "value": "data science"}, {"text": "Data engineer", "value": "data engineer"}, {"text": "Scientist", "value": "scientist"}, {"text": "Trainer", "value": "trainer"}, {"text": "Associate", "value": "associate"}, {"text": "Data analyst", "value": "data analyst"}, {"text": "Engineer", "value": "engineer"}, {"text": "Officer", "value": "officer"}, {"text": "Project manager", "value": "project manager"}, {"text": "Project officer", "value": "project officer"}, {"text": "Senior", "value": "senior"}, {"text": "Audit", "value": "audit"}, {"text": "Consultant", "value": "consultant"}, {"text": "Consulting", "value": "consulting"}, {"text": "Customer", "value": "customer"}, {"text": "Deputy director", "value": "deputy director"}, {"text": "Lecturer", "value": "lecturer"}, {"text": "Operations engineer", "value": "operations engineer"}, {"text": "Owner", "value": "owner"}, {"text": "Research engineer", "value": "research engineer"}, {"text": "Research scientist", "value": "research scientist"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Specialist", "value": "specialist"}, {"text": "Technical architect", "value": "technical architect"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Internship", "value": "INTERN"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Mining", "value": "/business/naics2007/21"}, {"text": "Research", "value": "/business/naics2007/5417"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Staffing", "value": "/business/naics2007/5613"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "NANYANG TECHNOLOGICAL UNIVERSITY", "value": "/m/0l49k"}, {"text": "Shopee", "value": "/g/11gh3fk34r"}, {"text": "DBS Bank Ltd", "value": "/m/01q7n5"}, {"text": "Michael Page", "value": "/m/04cxldw"}, {"text": "Micron", "value": "/m/02gdqy"}, {"text": "Air Liquide", "value": "/m/079tgb"}, {"text": "Apple", "value": "/m/0k8z"}, {"text": "ByteDance", "value": "/g/11ghnfr0sv"}, {"text": "CTES Consulting Pte Ltd", "value": "/g/11jrn4m1xc"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "SEPPIC", "value": "/m/0g558ww"}, {"text": "Standard Chartered", "value": "/m/02hszk"}, {"text": "United Overseas Bank", "value": "/m/04gjd1"}, {"text": "AIR LIQUIDE INDUSTRIAL SERVICES PTE LTD", "value": "/g/11hg55y1rb"}, {"text": "Acronis", "value": "/m/04pjlt"}, {"text": "BIGTAPP PTE. LTD.", "value": "/g/11dxpsg5nn"}, {"text": "Burpple", "value": "/g/11dxps5yv5"}, {"text": "Covance by Labcorp", "value": "/m/03ll59"}, {"text": "DHL", "value": "/m/021086"}, {"text": "DUN & BRADSTREET (SINGAPORE) PTE. LTD.", "value": "/g/11g9mpp2ph"}, {"text": "Dathena Science", "value": "/g/11dxprdn6y"}, {"text": "EasyMile", "value": "/g/11bwh58jhs"}, {"text": "Engine Biosciences Pte. Ltd.", "value": "/g/11gxm8pr96"}, {"text": "Experis Singapore", "value": "/g/11dxpnwm3s"}, {"text": "FieldBox.ai", "value": "/g/1ptyw89vr"}, {"text": "GIC Private Limited", "value": "/g/11mpj15pxw"}, {"text": "Government Technology Agency", "value": "/g/11gh0528nq"}, {"text": "Health Sciences Authority", "value": "/m/0h7fhh"}, {"text": "Hewlett Packard Enterprise (HPE)", "value": "/g/11b804x9ty"}, {"text": "Infineon Technologies", "value": "/m/02jzkj"}, {"text": "Infinite Computer Solutions Pte Ltd", "value": "/g/11g9mj72yz"}, {"text": "Institute Of Technical Education (ITE)", "value": "/m/05_02p"}, {"text": "KPMG Singapore", "value": "/g/11dxpsb9nr"}, {"text": "Lazada", "value": "/g/1q5bfkdqp"}, {"text": "Ministry of Defence Singapore", "value": "/m/0566dt"}, {"text": "Ngee Ann Polytechnic", "value": "/m/05451y"}, {"text": "Republic Polytechnic", "value": "/m/06jgzw"}]}]}