{"search_metadata": {"id": "608279081988e50e7dd6f0e7", "status": "Success", "json_endpoint": "https://serpapi.com/searches/9d774c1d0fa3a081/608279081988e50e7dd6f0e7.json", "created_at": "2021-04-23 07:36:40 UTC", "processed_at": "2021-04-23 07:36:40 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28solution+architect%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=20", "raw_html_file": "https://serpapi.com/searches/9d774c1d0fa3a081/608279081988e50e7dd6f0e7.html", "total_time_taken": 7.82}, "search_parameters": {"q": "(solution architect) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "20"}, "jobs_results": [{"title": "Solution Architect - 18927", "company_name": "Splunk", "location": "Singapore", "via": "via Splunk", "description": "Solution Architect - Sales Engineering\n\nJoin us as we pursue our disruptive new vision to make machine data accessible, usable and valuable to everyone. We are a company filled with people who are passionate about our product and seek to deliver the best experience for our customers. At Splunk, we’re committed to our work, customers, having fun and most importantly to each other’s success. Learn more about Splunk careers and how you can become a part of our journey.\n\nOur Splunk families are a focused and collaborative bunch spanning functions across sales, customer success, support, marketing, and G&A functions. We love to work as a team, celebrate success, and learn from our losses. We have a great team culture with end-of-quarter celebrations, volunteering activities, and a culture based on respect, transparency and always doing the right thing.\n\nJob Description: That’s a cool job, I want it!\n\nSplunk Solutions Architects are domain experts on the Splunk Cloud services, cloud service... providers (CSPs), and demonstrating data from cloud services. As one of Splunk’s senior-most technical presales resources, you will be a catalyst for securing the technical win on strategic and sophisticated opportunities.\n\nA successful Solutions Architect will not only maintain a deep technical understanding of cloud products and services, but also build multi-functional relationships, and create collateral to build scale and impact Splunk’s rapid growth rate.\n\nRequirements: I’ve already done that or have that!\n• Serve as the highest-level technical escalation in support of Splunk Cloud services, and cloud-related pre-sales efforts including operationalizing cloud service data in Splunk\n• Engage with APAC sales teams including both strategic commercial and public sector accounts\n• Provide standard methodologies and root cause analysis of the most complex technology challenges -- This may include building test environments and experiments, establishing ad-hoc teams of experts, and/or collaborating with Product Management and Engineering\n• Act as an internal technical SME, fielding questions related to Splunk Cloud services, and cloud services provided by Microsoft Azure, Google Cloud Platform, and Amazon Web Services\n• Develop and deliver technical training for internal and external audiences covering both Splunk Cloud and public cloud services\n• Articulate the value of solutions at sophisticated sales stages and at high-impact marketing or tradeshow events such as Splunk’s annual user conference\n• Maintain and extend personal expertise related to evolving and newly emerging technologies underpinning the latest industry trends and prototype solutions for integration with Splunk\n• Influence product capabilities and direction based on crosscutting customer challenges and needs\n• You will be a self-starter who is motivated by an intense desire to learn, grow, teach & solve business problems using Splunk.\nKey Candidate Differentiators:\n• Proven experience in a senior technical pre-sale and/or delivery capacity\n• demonstrated ability architecting and/or implementing Splunk Enterprise\n• 3+years of experience working with a CSP IaaS and PaaS offerings\n• Possess deep knowledge and expertise in Amazon Web Services (AWS), Azure, and/or Google Cloud Platform service, certifications a plus\n• Experience operationalizing data cloud services for specific use cases\n• Experience creating, communicating, and presenting technical content for large and diverse audiences, including CxOs\n• Expertise in at least one scripting language (Python, bash, etc.) is highly desirable\n• Expertise with an enterprise data streaming capability (e.g., DSP, Confluent, Kinesis) including architecture, deployment, sources/sinks, functions and building pipelines.\n• Strong growth mindset with an entrepreneurial spirit; a self-starter who is always thinking about how to drive growth exponentially\nEducation:\n• Bachelor's degree in an engineering subject area (e.g., computer science, electrical engineering, information systems, or similar) -- outstandingly well-qualified candidates with equivalent experience will be considered\nTravel Requirements:\n\nAbility to travel up to 25% (when/where public health conditions allow due to COVID-19)\n\nAre you looking for an incredible place to work that celebrates innovation, leadership and creativity? Please contact us. Splunk offers competitive compensation and excellent benefits. When you join Splunk you'll be working with a team of smart people who are as passionate about our products as our customers' success.\n\nWe value diversity at our company. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, or any other applicable legally protected characteristics in the location in which the candidate is applying", "extensions": ["21 days ago", "Full–time"], "detected_extensions": {"posted_at": "21 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2x1dGlvbiBBcmNoaXRlY3QgLSAxODkyNyIsImNvbXBhbnlfbmFtZSI6IlNwbHVuayIsImNvbXBhbnlfbWlkIjoiL20vMDVuendtIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiWDY1WGxNMTF4bGQ4OUxmTUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXNzQkNvd0JRVTVWWDA1eFZGSkVhVk55ZW1SaFdFNDNRMnhaWmxCcWMwOW5Oa1l3VjNwT2RWRjFXV1JYZW5NeU5GQm1VMUpsTmxwaU1Fc3pOMWxuYmxvMlNrbEJZMlZzTW1WaGFEWTRUaTFtV1U5ME0wNVZTRTVTWjJjNVRuZHdSVUpNTjBkdmMzZGhZVFJYVldsSFZuSXRkSGxWUWpkUWNHTmFTRmRVVUd4c2RuaEJkbTFKTFVwclZuUkdkV1JyU2tRU0ZrTlliVU5aVEZkcFFYQmhSblJSWVRCblRHNDBSRkVhSWtGUFRWbFNkME5wZDJ4dUxUVkJPRWxTUjB0RFVEY3diVkV3UzA1Q05WRktUbEUiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY182IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFNwbHVuayIsImxpbmsiOiJodHRwczovL3d3dy5zcGx1bmsuY29tL2VuX3VzL2NhcmVlcnMvam9icy9zb2x1dGlvbi1hcmNoaXRlY3QtMTg5MjcuaHRtbD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Cloud Architect Infrastructure", "company_name": "Michael Page", "location": "Singapore", "via": "via Neuvoo", "description": "About Our Client\n\nOur client is a leading logistics firm with strong presence across the region. They are looking to hire a Cloud Architect Infrastructure.\n\nJob Description\n\nAs a Cloud Architect Infrastructure, you will be responsible for the following:\n• Leading and managing the project delivery and the road-map for the cloud Infra team.\n• Working with internal stakeholders to align the infrastructure to meet the business requirements.\n• Reviewing the current infrastructure solutions to identify the gaps and propose enhancements.\n• Working with vendors to ensure all Sla's are being followed.\n• Managing internal and external stakeholders by communicating proper delivery status and performance reports.\n\nThe Successful Applicant\n\nAs a successful candidate you will have a bachelor's degree or equivalent with at least 8 years of architecture experience working with Public and private cloud platforms. You will experience in delivering, designing and supporting the infrastructure solutions... for the business along with providing technical guidance on cloud platforms such as Azure and AWS. You will also have hands on experience on AWS or Microsoft Azure. Cloud certification will be good to have.\n\nWhat's on Offer\n• Great Working Environment\n• Newly Created Role", "extensions": ["2 days ago", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDbG91ZCBBcmNoaXRlY3QgSW5mcmFzdHJ1Y3R1cmUiLCJjb21wYW55X25hbWUiOiJNaWNoYWVsIFBhZ2UiLCJjb21wYW55X21pZCI6Ii9tLzA0Y3hsZHciLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJDdjV3MnFFRkFYMXpRNGtLQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VVRSTmMwdGhMWGx5Y0RsNVoyTktUMEpYTmpnM1FrbHVkVGhuYW1scVUxbGtNMjFmYVdaVFdFcHRTWGxhUVV0dGVUaHBjak16UTBSa1J6WmlhR1ZPTUVkNWJFTjFVbDlvVjJZeFEybGZaSFJOWVVFNGRFUXpWWE0yVjNwUGFWQm9lbkI1UzBGdlR6aHNWRTQyVmsweU1XMVlWbmhoZERrMFMyTm5WMTkwYW14WVJIWlZMVXRJVm05ek5IWmlkbWs0ZUVvM1NVNDViVFF4T0VSQkVoWkRXRzFEV1V4WGFVRndZVVowVVdFd1oweHVORVJSR2lKQlQwMVpVbmRDVm1GTFUxQkZURzlWZWpFd2NFSjVSekZHZGxaSVdXWmZaV1JSIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMTMiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTmV1dm9vIiwibGluayI6Imh0dHBzOi8vc2cubmV1dm9vLmNvbS92aWV3Lz9pZD0xMzdhNTkzZjMwZTFcdTAwMjZ1dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Cloud Architect", "company_name": "Capgemini", "location": "Singapore (+1 other)", "via": "via EFinancialCareers", "description": "Capgemini are looking for Cloud Architect role that strong experience and capabilities to focus on full project lifecycle activities such as consulting, strategy, architecture, high-level design, client relationships, risk management, and resolution. It may be necessary to own and be responsible for aspects of design, as well as provide technical leadership including team management.\n\nAs an Cloud Infrastructure Architect, you will get exposure to the following types of roles & responsibilities :\n• Public & Hybrid Cloud solutions – architecting, designing, building and testing new cloud solutions. Often large and complex projects, with inputs from multiple technology domains (network, compute, monitoring, security).\n• Cloud migrations- Apps, data and workloads, infrastructure consolidation and transformation programmes\n• Responsible for Billing(50%) & generate revenue via order booking, focus on CM% (Contribution Margin)\n\nExperience and evidence of working on enterprise Cloud... Infrastructure projects are core to these roles.\n\nKey Responsibilities\n\nThese are some of the standard skills that we would expect you to be able to demonstrate.\n• Strong Communication skills (written and verbal) in English\n• Team player but capable of working independently where required\n• Proven track record working with clients\n• Ability to converse with various stakeholders at different levels\n• Knowledge of various portfolio of offerings\n• Have the mindset to challenge where appropriate and discuss decision points\n• Demonstration of a wide Infrastructure & Industry knowledge on various technical products\n• Capable of delivering presentations to internal and external stakeholders\n• Understanding of Project and Programme Governance\n• Good working knowledge of processes and procedures (e.g. DELIVERY, ITIL)\n• Understanding of commercial models and costing development\n• Ability to identify opportunities to expand Capgemini’s client footprint and/or project work\n• Ability to manage and control technical risks and work with assumptions\n• Ability to create Architectural documentation to suitable standards (HLD, DLD, Build & Standard Operating Procedures, etc.)\n• Knowledge on various cloud service platforms like Iaas, Paas, SaaS is desirable\n\nKey Skills & Experience required\n• Cloud Infrastructure Architect should have a minimum experience level of 12-16 years, with evidence of exposure to Enterprise Cloud Infrastructure projects during this time\n• Knowledge of the various Cloud Adoption Framework and related tools\n• Proven track record in providing design and consultancy covering cloud Infrastructure, availability, security, scalability, operability and extensibility\n• Cloud integration aspects for hybrid solutions such as WAN networking, Direct Peering, VPN, B2B, B2C, Active Directory, etc.\n• Cloud hybrid solutions such as Cloud Interconnect, Cloud VPN, Anthos, Hybrid Indentity scenariosKnowledge of cloud-native and 3rd party tools for management, monitoring security and automation\n• Exposure to cloud governance, billing and optimisation, and target operating models\n• Exposure to application discovery and dependency mapping as part of app migration and rationalisation activities and tooling\n• Architecting and deploying Enterprise Cloud Infrastructure solutions as part of Public, and Hybrid cloud platforms\n• Experience of upgrades, consolidation as well as new deployments\n\nCloud Infrastructure Architect Certification\n\nCloud architect certification on any one of these GCP/Azure and AWS platforms are must and knowledge of and certification any other Cloud platforms is desirable", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDbG91ZCBBcmNoaXRlY3QiLCJjb21wYW55X25hbWUiOiJDYXBnZW1pbmkiLCJjb21wYW55X21pZCI6Ii9tLzAzdmxrMCIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImtfeldreU0zWG1WaUxRblJBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhVMGhEY0d0NE5XOW1iM0pTZUhwM2FIZFdWMFk0VUZWRFNIUlpYMDh6UW1WTGVHNTBhV3RTTjBSTlZXWkZkVzFqU2tSTVNVNWpkamwxZW5WbU1WWnNYMnRDWlRBeVZUQm9XREZSVTJaTWRHcHpOWFp0UTBkalgybDJlWGhyYmpWNVZXTk5iRGt0Yld0amNISTNWV2RPYlVOYWEyNVdTRTVSVVRNd1VEUXdWbFZoWTNaZkxVTjVSWG8zZUVWQlprTnNXRFpDV2sxWFJEbGpVbDlCRWhaRFdHMURXVXhYYVVGd1lVWjBVV0V3WjB4dU5FUlJHaUpCVDAxWlVuZEVRVEpwUmxFMGIyVjJOMHBpWWxCMVUzZHRjR2RYVDFSaFJuTjMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18yMSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBFRmluYW5jaWFsQ2FyZWVycyIsImxpbmsiOiJodHRwczovL3d3dy5lZmluYW5jaWFsY2FyZWVycy5zZy9qb2JzLVNpbmdhcG9yZS1TaW5nYXBvcmUtQ2xvdWRfQXJjaGl0ZWN0LmlkMDg0ODk0MzQ/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "ServiceNow Solution/Technical Architect", "company_name": "IBM", "location": "Singapore", "via": "via IBM Global Careers", "description": "Introduction\nAs an IBM Application Architect, you directly help clients transform their business and solve complex problems. You will define the scope and vision for projects that deliver customized solutions using your knowledge of IBM platforms. You are a technical leader, serving as a liaison among business partners, technical resources, and project stakeholders.\n\nYour Role and Responsibilities\nIBM’s ServiceNow business is growing rapidly, and we are looking for a new leader to drive this growth. As a Technical Architect – ServiceNow, you will be responsible for providing architecture oversight to our projects as well as help in architecting solutions for our top national and international clients. You will provide thought leadership, review and advice on the client’s ServiceNow Architecture and integration within ServiceNow modules and 3rd Party solutions and build new methods and tools to be used across all our projects.\n\nResponsibilities for the ServiceNow Technical Architect\n•... Handle Architectural role in ServiceNow area. Analyse current technologies used within the target project and determine ways to improve by implementing ServiceNow and its architecture.\n• Provide technical consultation to our clients in terms of using ServiceNow best practices for implementations and ongoing operations\n• Lead and govern end-to-end ServiceNow implementations, migrations, transformation projects using onshore, offshore and nearshore models.\n• Establish enterprise wide best-practices and IT thought leadership in Service Management, Service Integration and Management, Intelligent Automation Platform and Robotic Process Automation.\n• Implement complex ServiceNow solutions for our clients in all applications/modules such as TSM Pro, ITSM Pro, HRSD, ITOM Pro, SAM Pro, HAM Pro, ITBM Pro, Security Operations, GRC, FSM Pro and CSM Pro.\n• Lead & investigate complex technical issues and review code as required.\n• Account for possible project challenges on constraints including, risks, time, resources and scope\n• Work closely with project management teams to successfully monitor technical progress of ServiceNow implementations and maintenance/administration tasks\n• Design ServiceNow technical solutions and also provide detailed specifications for those proposed solutions\n• Provide expert guidance for best practices related to ServiceNow administration\n\nRequired Professional and Technical Expertise :\n• 10+ years of IT experience with Proven ServiceNow Product knowledge\n• 3-5 years of experience as a ServiceNow Solution/Technical Architecture with implementing SaaS/PaaS Solution on specific cloud architecture.\n• Experience in multiple end-to-end ServiceNow implementations across all modules - TSM Pro, ITSM Pro, HRSD, ITOM Pro, SAM Pro, HAM Pro, ITBM Pro, Security Operations, GRC, FSM Pro and CSM Pro.\n• Strong experience in integrating ServiceNow to several other applications using SOAP/REST. Preferred to have experience working with ServiceNow to ServiceNow and ServiceNow to Remedy ebondings or anyother Products of similar nature.\n• Strong working in an Agile/DevOps environment in Continuous Integration, Continuous Delivery, automated testing, Agile metrics Preferred Tech and Prof Experience\n• Strong understanding of the key technologies relevant to the ServiceNow integration solutions including: SSO, SAML, SSL, Web Services, LDAP, JDBC, ODBC, REST,FTP and also well versed with cloud technologies.\n• Mandatory ServiceNow certifications – Certified System Administrator, Certified Application Developer, Implementation Specialist in 2 or more of these modules – ITSM/HRSD/CSM/FSM/ITBM/Discovery/Service Mapping/GRC/SIR/PPM/Cloud Management\n• Experience with enterprise level tool migrations\n• Experience in software engineering and design architecture\n• Excellent Communication skills – ability to communicate at an executive level\n\nPreferred Professional and Technical Expertise :\n• Preferably ITIL v4 certified\n• Preferably be TOGAF 9 certified or have a similar enterprise architecture certification\n• Should have strong Agile/DevOps delivery experience\n• Should have good knowledge of network/infrastructure/database/asset setup for an organization to be able to assist client using ServiceNow ITOM/ITAM\n• Current understanding of best practices regarding system security measures\n• Experience with scripting in the ServiceNow platform using JavaScript, Jelly, and/or AngularJS for Business Rules, Client Scripts, UI Actions, UI Pages, Widgets, Background scripts etc.\n• Ambitious individual who can work under their own direction towards agreed targets/goals.\n• Ability to handle change and be open to it along with good time management and an able to work under stress\n• Proven interpersonal skills while contributing to team effort by accomplishing related results as needed\n\nRequired Technical and Professional Expertise\nAs above\n\nPreferred Technical and Professional Expertise\nAs above\n\n", "extensions": ["27 days ago", "Full–time"], "detected_extensions": {"posted_at": "27 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZXJ2aWNlTm93IFNvbHV0aW9uL1RlY2huaWNhbCBBcmNoaXRlY3QiLCJjb21wYW55X25hbWUiOiJJQk0iLCJjb21wYW55X21pZCI6Ii9tLzAzc2M4IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiNmVjQ0FQYWc4aHhnOWF2ckFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXNzQkNvd0JRVTVWWDA1eFVWQmZVVUYxWWpSZlRVZDZkalZuUkd0RmRrdDBZVlpHYmtSZkxWZDZSbEUyUkdaV1ZFTmFkVU5YVGxBeVdVOXdXbHBzZGkxdFNFWm5iRnBXYzFSVk56WnFhVVZsVldKZllrOUJkVTVXZGpocVdsRndiams0UlRodFNscEVkbTl6TVhJNFduVnNkRVpzWkdVdFNHZzVNRFZIU1RSUU5USXhPRGhyVDAxT1MyRktZbmxyTlhnU0ZrTlliVU5aVEZkcFFYQmhSblJSWVRCblRHNDBSRkVhSWtGUFRWbFNkME5hVDNKU1dGVXhRMjVCV1ZVdGNrZDJNa2xvYTBkUk0xOWhjWGMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18yOSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBJQk0gR2xvYmFsIENhcmVlcnMiLCJsaW5rIjoiaHR0cHM6Ly9jYXJlZXJzLmlibS5jb20vam9iLzEyNDkxMjEyL3NlcnZpY2Vub3ctc29sdXRpb24tdGVjaG5pY2FsLWFyY2hpdGVjdC1zaW5nYXBvcmUtc2cvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Solution Architect - AWS Cloud", "company_name": "Antaes Asia Pte. Ltd.", "location": "Singapore", "via": "via Monster Singapore", "description": "Job Description:\n\n· Contribute to projects for Antaes clients\n\n· Build and maintain the high-level architecture view of the program\n\n- Support the investigation on areas of the solution not fully decided yet by organizing brainstorming/follow-ups with internal and external experts and by contributing with his own expertise/experience.\n\no E.G. but not restricted to: data platform, workflow automation tool, target Cloud patterns, multi-entity guidelines etc.\n\n- Follow-up with the program management team and participates in the weekly/monthly project meetings, act as SPOC for the Program PMO\n\n- Follow-up with application teams on the progress of architecture validation of their applications\n\n- Review solutions proposed by application teams and Domain solutions architects and check their alignment with our target principles.\n\n- Contribute to the promotion of Antaes services on top of assistance provided to clients\n\nJob Requirements:\n\n- Minimum Bachelor’s Degree or equivalent experience... required\n\n- At least 10 years in technical architecture or equivalent and have successfully carried out transformation projects\n\n- At least 2 years of experience in cloud technologies\n\n- Able to design cloud and legacy architectures (application and infrastructure), define cloud migration strategies (application and infrastructure)\n\n- Very good understanding of all the building blocks of the information system: application layers, networks, virtualization servers, storage and cloud systems, security, and business requirements to propose solutions to meet business needs.\n\n- Strong knowledge of the following technologies:\n\no Linux / Windows system administration\n\no Languages: .NET, Java\n\no Network and security concept: Routing, Firewall, IDS, IPS etc\n\no CI / CD tools: Jenkins, GitlabCI,, AWS tools\n\no Infra As Code tools: Terraform, cloudformation\n\no Containerization tools: Docker, rkt\n\no Container orchestrators: K8s, Openshift, EKS\n\n- AWS Cloud solution architect certification and other relevant professional certifications", "extensions": ["7 days ago", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2x1dGlvbiBBcmNoaXRlY3QgLSBBV1MgQ2xvdWQiLCJjb21wYW55X25hbWUiOiJBbnRhZXMgQXNpYSBQdGUuIEx0ZC4iLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IncwcThoZ2NSTEc0MF95QWlBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTW9uc3RlciBTaW5nYXBvcmUiLCJsaW5rIjoiaHR0cHM6Ly93d3cubW9uc3Rlci5jb20uc2cvYW1wL2pvYi12YWNhbmN5LXNvbHV0aW9uLWFyY2hpdGVjdC1hd3MtY2xvdWQtYW50YWVzLWFzaWEtcHRlLWx0ZC1zaW5nYXBvcmUtMjc3NDc0NDcuaHRtbD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Analytics Solutions Architect  Acceleration Lab", "company_name": "Amazon Web Services Singapore", "location": "Singapore (+1 other)", "via": "via Jobs", "description": "3+ years of experience in Data Warehouse, Data Integration and Business Intelligence technologies.\nUndergraduate degree or 6+ year’s work experience in technical role\n3+ years of experience in MPP platforms i.e. (Redshift, Teradata, Netezza, Greenplum, Vertica, etc.)\n2+ years in Cloud Data Warehouse platforms (Snowflake, BigQuery,Azure Synapse)\n\nAre you a Data Warehousing specialist? Do you like to solve the most complex and large-scale data challenges in the world today? Do you want to have an impact in the development and use of new Analytics technologies? Come join us?\n\nAmazon Web Services (AWS) offers a comprehensive set of services to handle every step of the analytics process chain including data warehousing, business intelligence, batch processing, stream processing, machine learning, and data workflow orchestration. Amazon Redshift offers a fully managed, petabyte-scale data warehouse that integrates cleanly with existing business intelligence tools. Amazon QuickSight delivers... fast, easy-to-use business analytics and visualization for customers looking to build new applications. In combination with other AWS services, these core DW tools allow customers to extract the maximum business value from their operational and transactional data.\n\nWe are looking for a POC Specialist Solutions Architect to be a hand’s on engineer who performs Proof of Concepts (POCs) on behalf of our customers and help them to adopt AWS services towards their successes. You will partner with other Solution Architects, Customer Account Managers, Business Development Representatives and the DW Service teams to enable customer adoption and revenue attainment. You will develop repeatable mechanisms, POC processes, white papers, blogs, reference implementations, labs, and presentations to build efficiency into the way that customers accomplish POCs.\n\nRoles & Responsibilities:\n\nHave fun at work. As the right candidate, you will love what you do, and instinctively know how to make work fun. You will be dynamic, creative, entrepreneurial, and willing to take on any challenge.\nMigrate customer data. You will be hand’s on with the customer’s data and will work to load that data into AWS in order to run tests. These tests will be varied in nature and will be a combination\nPerformance tune. As POCs are often “speed races” you will be responsible for performance tuning the environment, including, but not limited to data distribution, sharding/partitioning, rewriting SQL, etc.\nPresent results. You will be responsible for gathering the POC results and sharing these with the customers in the way that the customer wants to receive information. This can include documentation, scoring, and live presentations of results.\nExhibit thought leadership. Obsess over simplification. You have a passion for eliminating redundancy and establishing new practices with self-service solutions to allow customers to prove the value of AWS solutions quickly. You will evangelize others and share best practices through forums such as AWS blogs, whitepapers, reference architectures and public speaking events such as AWS Summit and AWS re: Invent. You will help develop and support the AWS internal community of Analytics technologists.\nBuild great services. Act as technical liaison between customers and the service engineering teams, providing product improvement feedback to AWS developers and accelerating the adoption of new features in customer deployments.\nExcellent written and verbal skills\nExpert knowledge of on-premises DataWarehouse solutions.\nExperience managing customer Proof of Concepts and Pilots.\nOperational experience working with website/web services as well as traditional IT networking, operations, management, and security experience.\nAWS Solution Architecture certification or relevant cloud expertise.\nWorking knowledge of software development tools and methodologies.\nDemonstrated ability to adapt to new technologies and learn quickly.\nAbility to present with a high degree of comfort speaking with executives, IT Management, and developers\nExperience with a programming or scripting language.\nCompany- or regional-level recognition in the Database and/or Data Warehousing field (conference presentations, Meet-Ups, etc).\nAbility to understand complex application data flows and bridge the gap between technical and business app requirements.\nGraduate degree in Computer Science, Technology, Engineering or Math.Amazon is committed to a diverse and inclusive workforce. Amazon is an equal opportunity employer and does not discriminate on the basis of race, ethnicity, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us", "extensions": ["3 days ago", "$3K a year", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time", "salary": "$3K a year"}, "job_id": "eyJqb2JfdGl0bGUiOiJBbmFseXRpY3MgU29sdXRpb25zIEFyY2hpdGVjdCAgQWNjZWxlcmF0aW9uIExhYiIsImNvbXBhbnlfbmFtZSI6IkFtYXpvbiBXZWIgU2VydmljZXMgU2luZ2Fwb3JlIiwiY29tcGFueV9taWQiOiIvbS8wcnpuenQxIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiLUhrS3ZYMHdHS05nbm9zMkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRW9zQ0Nzd0JRVTVWWDA1eFVuQmZXVFpCTUdwNkxYTXphVVU1WjJKelIwOTZNVGQ1T1RGbmFrTkxhbFZ0TTNBeVYwNUhSa1ZITUhSWVJqTk9VRXRDT1RSbllqZFlTako2VkU5MmFqRmtUa2RRYVdSeVRVOVlhbWRMYXpad2FEWkxhR1pDU0VKSU0yOU9jRXR4TVRodmFqTklka1YzUjI1VWNHMUhTVlZOUW1sWE1VVm1NMjB3WDJ0ek1HUmFkMVZvWWxsaVRVcHViMjlYZVV4Vk5rZFRVelJzZUROMWExbE5ha3hsVVd4T1h6VnpWamh6U1V4RVVrZHBSVWR4U0daTVprOURUV1ZyWTFWSU9IUnZMVTFYTTJKWUVoWkRXRzFEV1V4WGFVRndZVVowVVdFd1oweHVORVJSR2lKQlQwMVpVbmRDY1dJdGFqUm9Ra1E0VG0xWVJ6ZzFSbk5JZWxwd01UWlRXVjkzIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNDEiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9icyIsImxpbmsiOiJodHRwczovL3NnLmZpZGFudG8uY29tL2pvYnMvam9iLW9wZW5pbmcvYXJjaGl0ZWN0cy1leGNlcHQtbGFuZHNjYXBlLWFuZC1uYXZhbC9hbmFseXRpY3Mtc29sdXRpb25zLWFyY2hpdGVjdC1hY2NlbGVyYXRpb24tbGFiLTI3NzM2MzAwMT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Salesforce Solution Architect", "company_name": "Volt Singapore", "location": "Singapore", "via": "via Volt Singapore", "description": "Salesforce Solution Architect - Singapore\n\nAs part of the new technology center, our client is looking for a Salesforce expert to define the technical architecture of CRM using Salesforce.\n\nThe key responsibilities are:\n• Be involved in designing and developing of Salesforce solution components and implementation is align to the design\n• Lead technical requirements gathering and oversee the creation of application and system documentations, managing integration process and efforts\n• Develop specifications with IT partners for Salesforce and ensure integration of local and regional systems globally\n• Provide insights and expertise for various technical product offerings for application and infrastructure\n• Work closely extensively with various teams and other headquarters to ensure the fulfillment of business requirements\n\nThe ideal fit:\n• Hands-on experience on Salesforce and relevant technologies\n• Collaborate with multiple stakeholders and team members to evaluate solutions and set... a right tone on technical direction\n• Good knowledge on middleware technologies\n• Good understanding of best practices on salesforce platform\n• Strong experience with service-oriented and event-driven system architecture\n• Salesforce architect certified\n\nPlease send your resume in WORD format by clicking the apply button below or contact Rosette Chong at +65 6701 1513 for a confidential discussion. Please note that only short-listed candidates will be contacted. CEI Reg. Number R1658433 (Chong Xinmei", "extensions": ["25 days ago", "Contractor"], "detected_extensions": {"posted_at": "25 days ago", "schedule_type": "Contractor"}, "job_id": "eyJqb2JfdGl0bGUiOiJTYWxlc2ZvcmNlIFNvbHV0aW9uIEFyY2hpdGVjdCIsImNvbXBhbnlfbmFtZSI6IlZvbHQgU2luZ2Fwb3JlIiwiY29tcGFueV9taWQiOiIvZy8xMWc3ejA1a2MzIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoicGotbmt1c3pnNTQ4MzRwQUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZZQkNyY0JRVTVWWDA1eFZHSlZOSFZ6TjJkcFVVeGlWVzlSVDJSU1JGb3diVlExV0hOVU4xOXRWMEpsVDI5RlgwRjFTbHBXVTJWWVZGWlNYMmRhVDJaR2FWaDFaVlYyVlZVMmJtcEhjVjk2V0dOeVJqY3RNWFZrU1c5ZmFFOUJaR2x1WDB0TlpXNVBUMDAwWVY5UGFYSnFkRXBaU25SNFJtZEhUV2xtYVhreGEwcEtZVloxT1VselVITjZNVGxVYW5oblZrSXdjRkZRU1doR2VYRldNRzFHTkRsS1ZDMXJTMmhNY2tselQxcGxlWHBNZVRkVlZXdEVWRkZ6RWhaRFdHMURXVXhYYVVGd1lVWjBVV0V3WjB4dU5FUlJHaUpCVDAxWlVuZEVXbmx2ZGpGNlNrbHJRblZWYnpKTmFXbDVNRGRaVG1GYU1XTjMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY180OSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBWb2x0IFNpbmdhcG9yZSIsImxpbmsiOiJodHRwczovL3d3dy52b2x0aW50ZXJuYXRpb25hbC5jb20uc2cvam9iL3NhbGVzZm9yY2Utc29sdXRpb24tYXJjaGl0ZWN0LTEvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Senior Analyst, Cyber Security", "company_name": "e2i Job Bank", "location": "Singapore", "via": "via Why USPUR - E2I", "description": "•This role requires both broad and deep technology and information security industry knowledge, ability to design and architect cybersecurity solutions on Microsoft platform. Deep understanding of knowledge experience across the Microsoft suite of security technologies and solutions. Demonstrated ability to engage with company solution Owner and Enterprise Architecture Review Board on discussions related to agility, business value and end-to-end information technology security is a must. He/she will manage, lead and engage the complete life-cycle for large cybersecurity projects.\n•Responsible for setting up strategic security directives, design and architect on ASM cybersecurity posture such as:\n1.Identity Management (SSO, IAM, PAM, etc)\n2.Data Loss Prevention (IRM, AIP, Intune, etc)\n3.Other security solutions/services.\n•Ensure solutions and processes support the achievement of security and compliance requirements.\n•Experience in managing the team responsible for the administration... operational support, service delivery and provide recommendations.\n•Provides authoritative advice and guidance on Information assurance architecture and strategies to manage identified risk.\n•Establish a Governance program to support security and compliance (i.e. ISO27001, NIST, COBIT, GDPR) initiatives forward and increase security posture", "extensions": ["2 days ago", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQW5hbHlzdCwgQ3liZXIgU2VjdXJpdHkiLCJjb21wYW55X25hbWUiOiJlMmkgSm9iIEJhbmsiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IlV5T29mQlRKR01DRUZqRkFBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gV2h5IFVTUFVSIC0gRTJJIiwibGluayI6Imh0dHBzOi8vdXNwdXIuZTJpLmNvbS5zZy9qb2IvMzYxMy9zZW5pb3ItYW5hbHlzdC1jeWJlci1zZWN1cml0eS8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Senior Cloud Architect (AWS)", "company_name": "Randstad Singapore", "location": "Singapore (+1 other)", "via": "via Randstad Singapore", "description": "about the company\n• technology development company specialize in network security, privacy protection and VPN products and solutions\n• over 100 of developers and product managers over the world\n\nabout the job\n• Responsible for designing and continuously optimizing microservices-based back-end system architecture.\n• Development of technical design specifications for back-end\n• Develop strategies and drive performance optimization of the system to improve its availability.\n• Direct and work with development, testing and operations teams to complete system development and implementation\n\nskills and experience required\n1. good understanding of the microservice system (practical experience)\n2. good understanding of AWS services (practical experience), otherwise, profound microservice knowledge\n3. good documentation skills in Chinese, so that the China counterparts can understand\n4. familiarity with AWS serverless technologies such as ECS, Fargate, Lambda, etc.\n5. preferably with AWS... certified solution architect\n6. experience in design/diagram/monitor/debug hundreds of microservices\n\nTo apply online please use the 'apply' function, alternatively you may contact Stella at 96554170 (EA: 94C3609 /R1875382)\n\nskills\nAWS, microservices, API, network, cloud\n\nqualification\nno additional qualifications required\n\nworking hours\nFull-Time\n\neducational requirements\nBachelor Degree", "extensions": ["Over 1 month ago", "$12K–$20K a month", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time", "salary": "$12K–$20K a month"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQ2xvdWQgQXJjaGl0ZWN0IChBV1MpIiwiY29tcGFueV9uYW1lIjoiUmFuZHN0YWQgU2luZ2Fwb3JlIiwiY29tcGFueV9taWQiOiIvZy8xMWc3MGI1MG1yIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiV2thQzBxdlNiSXgzcGQwZ0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZZQkNyY0JRVTVWWDA1eFZFeHZVblIxZWt0dWFXMW5WVWREZUZwU1NTMTBTSE56WmxsbVpHRlJiMlppV2t3d2FVWlRWRkJxVW5CaVpIUldlRTlZTlZkNmNucG9RMXBGUkhwUlJrbzRUbmR6YzJoc2VsVkJaV05wTmt0d1pIQkhURFoyVm10M1VrVnNkRTh0VkVod01XNWZVVEZ3VEMxd1psOWxXRXN3UjJ4elJsaEdSemN3UlZSQmFrUnhkV1pYZWxoZlRGZHNMV0ZCUm5GMVlYSk9iRGQ2Y0c5M2FreHJWREEyVkROMVdqaEZSMk5tVG5GUmVUUkJaa05SRWhaRFdHMURXVXhYYVVGd1lVWjBVV0V3WjB4dU5FUlJHaUpCVDAxWlVuZERhVE4zU0VwSGJXZHBVR3RyTkU1dVExcHlTME5NTW5WdVJWRlIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY182MSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBSYW5kc3RhZCBTaW5nYXBvcmUiLCJsaW5rIjoiaHR0cHM6Ly93d3cucmFuZHN0YWQuY29tLnNnL2pvYnMvc2VuaW9yLWNsb3VkLWFyY2hpdGVjdC1hd3Nfc2luZ2Fwb3JlXzM2NDcxNzY3Lz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "GIT _ Senior Solution Architect (126716)", "company_name": "Singtel Group", "location": "Singapore", "via": "via Singtel Careers", "description": "Singtel, Asia’s leading communications technology group, provides an extensive range of telecommunications and digital services to millions of consumers and businesses across Asia, Australia, Africa and the USA. With over 140 years of innovation behind us, we continue to push boundaries in our networks and services, to enrich lives and transform businesses.\n\nOur core values – Customer Focus, Challenger Spirit, Teamwork, Integrity, and Personal Excellence – shape the way we work. We are passionate about making a difference and have an open and inclusive culture where everyone is empowered to do their best. Our diverse business means you will enjoy unique opportunities and rewarding experiences to learn and grow your career in a dynamic industry.\n\nJoin us and experience what it’s like to be with an Employer of Choice*. Together, let’s create a brighter digital future for all. *Awarded at the HR Fest Awards 2020\n\nSingtel are at the leading edge of technology development to improve the... experience of our customers as they consume services across mobile, voice and data infrastructure, managed services, cloud computing, IT services and professional consulting. To support that journey, we are searching for top talent and have an exciting opportunity for a Sr Solution Architect to strengthen our team.\n\nThis is a strategic role expected to focus on Mobile Architecture for various digital channels and platforms\n\nKey Responsibilities\n\n• Understands business functions and transform requirements into architecture and blueprint for the solution being created. Need to propose new innovative solutions, updates to existing solutions, negotiate alternative options, build technical and release roadmaps\n\n• Understands the client necessities, create mobile architecture, perform product development and launching the mobility solutions. Construct scalable Mobile Architecture for various Mobile channels built around Microservices and APIs.\n\n• Work closely with the development team and get their buy-in into accepting the design to be implemented. Also, work with different stake holders, product owner, senior executives, architects, external parties like system integrators, product partners.\n\n• Provide technology perspective to business to achieve roadmap and prioritization by keeping abreast with industry trends. Where required, help business size the complexity of problem and help simplify and define MVP\n\nExperience & Qualification Required\n\n• Degree in Information Technology, Computer Science, Engineering or its equivalent\n\n• 10+ years of experience in the technology industry including 8+ years of proven experience in software architecture design, ideally in a validated environment, focusing on scalability, security and compliance\n\n• Possess strong background and experience as a successful Software engineer/Architect in building highly available Mobile and Web architecture at scale.\n\n• To design the required web and hybrid enterprise mobile applications for several mobile platforms. Good Knowledge of both environments and associated tools (iOS and Android)\n\n• Hands on experience in Native Mobile Technology (Swift, Objective-C, Java, and Kotlin). Experience in hybrid mobile technologies i.e. React Native, Flutter, Xamarin etc. Experience in Web technologies a big plus\n\n• Knowledge on cloud native architectures microservices architecture, Service mesh, container orchestration with Kubernetes/OpenShift.\n\n• Good experience in Mobile and API Security including OAuth2/OIDC, Tokens, mTLS etc.\n\n• Conduct research on the evolving trends in mobile security space and keep abreast of the latest vulnerabilities. Also, identify mobile security design gaps in existing and proposed architectures and recommend changes or enhancements\n\n• Oversee the fraud prevention and other detection mechanisms on the device and advise suitable changes in strategy and implementation\n\n• Passion for architecture and ability to pick up and learn new technological advances very quickly\n\n• Exhibits leadership in guiding engineering team members, adapts to changes in technology and business domains, has good knowledge of latest trends in the market and is well respected within the team\n\n• Solid understanding of Public Cloud Services (pref. AWS) architecture. AWS certification is a big plus\n\nWe believe in the strength of a vibrant, diverse and inclusive workforce where backgrounds, perspectives and life experiences of our people help us innovate and create strong connections with our customers. We strive to ensure all our people practices are non-discriminatory and provide a fair, performance-based work culture that is diverse, inclusive and collaborative", "extensions": ["2 days ago", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJHSVQgXyBTZW5pb3IgU29sdXRpb24gQXJjaGl0ZWN0ICgxMjY3MTYpIiwiY29tcGFueV9uYW1lIjoiU2luZ3RlbCBHcm91cCIsImNvbXBhbnlfbWlkIjoiL20vMDIwemZsIiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiTkR0b2htVXZpX3dBbVktOEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFV6SnhNVEF4YVc1d2FFaG1NVGt3ZEZwalJHSmlSblYwZFVoVVNVNURlVzlaYm5neFNUUkZXbU5uV2xkSFVsUjZVMmRhWDNWNlZ6WkxTVXhpTlV4UlZGOTJaVlY0ZHpWSlNtcE1XV0ZQTTFKcVpGUjVWMGx6V1hGdGJWZHNVbTlDWmxkVVYzbEZVVlZsTnpRd1pEWTBWVGhKU2w5c09HTjBaSFp1VmpremFsRnZSWGR5VTNaS1FtUk5iVFZ1TURKSlJXVklla2ROVGtoUlVXWm5FaFpEV0cxRFdVeFhhVUZ3WVVaMFVXRXdaMHh1TkVSUkdpSkJUMDFaVW5kQlpYSnhhRWhrY3pCaFUwa3lla2R6YjJ0UWFUSlVibFJRZWtWMyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzY5IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFNpbmd0ZWwgQ2FyZWVycyIsImxpbmsiOiJodHRwczovL2dyb3VwY2FyZWVycy5zaW5ndGVsLmNvbS9qb2IvR0lULV8tU2VuaW9yLVNvbHV0aW9uLUFyY2hpdGVjdC0lMjgxMjY3MTYlMjktU2luZy81ODA1OTEzMTAvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}], "chips": [{"type": "Title", "param": "job_family_1", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Solution architect", "value": "solution architect"}, {"text": "Solutions architect", "value": "solutions architect"}, {"text": "Architect", "value": "architect"}, {"text": "Cloud architect", "value": "cloud architect"}, {"text": "Technical architect", "value": "technical architect"}, {"text": "Enterprise architect", "value": "enterprise architect"}, {"text": "Senior", "value": "senior"}, {"text": "Consultant", "value": "consultant"}, {"text": "Financial services", "value": "financial services"}, {"text": "Infrastructure architect", "value": "infrastructure architect"}, {"text": "Manager", "value": "manager"}, {"text": "Application architect", "value": "application architect"}, {"text": "Cloud engineer", "value": "cloud engineer"}, {"text": "It architect", "value": "it architect"}, {"text": "Lead architect", "value": "lead architect"}, {"text": "Network architect", "value": "network architect"}, {"text": "Security architect", "value": "security architect"}, {"text": "Senior architect", "value": "senior architect"}, {"text": "Systems engineer", "value": "systems engineer"}, {"text": "Associate director", "value": "associate director"}, {"text": "Deputy", "value": "deputy"}, {"text": "Engineers", "value": "engineers"}, {"text": "Head", "value": "head"}, {"text": "Infrastructure", "value": "infrastructure"}, {"text": "Lab", "value": "lab"}, {"text": "Network engineer", "value": "network engineer"}, {"text": "Presales consultant", "value": "presales consultant"}, {"text": "Public sector", "value": "public sector"}, {"text": "Senior analyst", "value": "senior analyst"}, {"text": "Senior consultant", "value": "senior consultant"}, {"text": "Senior director", "value": "senior director"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Software architect", "value": "software architect"}, {"text": "Solution consultant", "value": "solution consultant"}, {"text": "System architect", "value": "system architect"}, {"text": "System engineer", "value": "system engineer"}, {"text": "Systems analyst", "value": "systems analyst"}, {"text": "Systems architect", "value": "systems architect"}, {"text": "Technical trainer", "value": "technical trainer"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Accounting", "value": "/business/naics2007/5412"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Management", "value": "/business/naics2007/55"}, {"text": "Real Estate", "value": "/business/naics2007/53"}, {"text": "Wholesale", "value": "/business/naics2007/42"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Amazon", "value": "/m/0mgkg"}, {"text": "Microsoft", "value": "/m/04sv4"}, {"text": "EPAM Systems", "value": "/m/0dlnrc"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "IBM", "value": "/m/03sc8"}, {"text": "Salesforce", "value": "/m/07btr5"}, {"text": "EY", "value": "/m/0g9jc"}, {"text": "Publicis Sapient", "value": "/m/02myjp"}, {"text": "Randstad", "value": "/m/08pt1z"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Alibaba Group Holding Limited", "value": "/m/07s6ctl"}, {"text": "Avanade", "value": "/m/094456"}, {"text": "Capgemini", "value": "/m/03vlk0"}, {"text": "Comtel Solutions Pte Ltd", "value": "/g/11dxpztgnb"}, {"text": "DELL", "value": "/g/11c54ch2jm"}, {"text": "Ericsson", "value": "/m/02kyh"}, {"text": "HTZ Resources", "value": "/g/11h21p9b4d"}, {"text": "Infinite Computer Solutions Pte Ltd", "value": "/g/11g9mj72yz"}, {"text": "Michael Page", "value": "/m/04cxldw"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "Orange Business Services", "value": "/m/08zvyz"}, {"text": "Recruitment Hub Asia Pte Ltd", "value": "/g/11dxpww_0f"}, {"text": "TEKsystems (Allegis Group Singapore Pte Ltd)", "value": "/g/11b6g4bkv0"}, {"text": "Talent Trader Group Pte Ltd", "value": "/g/11dxpmlc5b"}, {"text": "Tata Consultancy Services", "value": "/m/01psx8"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "VMware", "value": "/m/01t9k5"}, {"text": "Verizon", "value": "/m/07_dn"}, {"text": "A-Speed Infotech Pte Ltd", "value": "/g/11g9mxswl4"}, {"text": "ABeam Consulting", "value": "/g/11bc6whr_f"}, {"text": "Amazon Web Services (AWS)", "value": "/g/11dxprr2xv"}, {"text": "Amazon Web Services Singapore", "value": "/m/0rznzt1"}, {"text": "Aon", "value": "/m/0z7n"}, {"text": "Avaya", "value": "/m/01sqlk"}, {"text": "Azendian Solutions Pte Ltd", "value": "/g/11dxpvcjj2"}, {"text": "Big Cloud", "value": "/g/11c743lwsr"}]}]}