{"search_metadata": {"id": "60827e2818ca868bc4cd8393", "status": "Success", "json_endpoint": "https://serpapi.com/searches/a4b4abaa002e757f/60827e2818ca868bc4cd8393.json", "created_at": "2021-04-23 07:58:32 UTC", "processed_at": "2021-04-23 07:58:32 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28programmer%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=0", "raw_html_file": "https://serpapi.com/searches/a4b4abaa002e757f/60827e2818ca868bc4cd8393.html", "total_time_taken": 1.03}, "search_parameters": {"q": "(programmer) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "0"}, "jobs_results": [{"title": "Programmer (.net)", "company_name": "Adecco SG - BB", "location": "Singapore (+1 other)", "via": "via Adecco", "description": "Involved in the design, development, programming, implementation and maintenance of large scale web-based and general application systems\n\nOur client is Singapore's renowned brand.\n\nWORKS SPECIFICATIONS\n\nSCOPE OF WORK\n\n(a) The overall scope of the works expected from the from the Contract Programmer shall include the following:-\n\ni. Gather user requirements and prepare specifications and other relevant documentation according to the documentation standard required and etc;\n\nii. Design, develop, implement and maintain web-based and other applications;\n\niii. Perform project administrative duties, including disseminating project information to project stakeholders and monitoring the progress of project milestones;\n\niv. Trouble-shoot, diagnose and rectify reported application problems while at the same time, resolving the related diagnosed application problems within a satisfactory time period;\n\nv. Conduct End User briefings and training entailing the use of the software applications when... required;\n\nvi. Assist in rolling out new projects/applications or enhancements of existing systems/applications; and\n\nvii. Arrange logistics for meetings, conferences, trainings, and other project-related events. Organise project committee meetings and prepare the necessary materials, including reports, presentations, agendas and other meeting collateral. Transcribe and accurately record key decisions and action items resulting from meetings.\n\n(b) The personnel to be provided must have at least 5 years of working experience in the design, development, programming, implementation and maintenance of large scale web-based and general application systems. They should preferably hold a certification in Microsoft Certified Application Developer (MCAD) and Sun Certified Java Programmer (if possible).\n\n(c) The personnel must have working knowledge and experience in the following environment :-\n\ni. Development Languages/Tools\n\nVB.NET, C#.NET, Visual Basic 6 (At least 5 years)\n\nOO Analysis and Design (At least 2 years)\n\nii. Internet Technologies\n\nASP.NET\n\nHTML, Java Script, AJAX\n\nMS SharePoint Online\n\nMS PowerApp\n\nMS PowerAutomate\n\niii. Database and Others\n\nMS SQL Server 2008 (At least 5 years)\n\nMS SQL Server 2016\n\nMS Visual Studio 2008 (At least 5 years)\n\nMS Visual Studio 2017\n\n.NET Framework 3.5 (At least 5 years)\n\n.NET Framework 4.5\n\nIIS, SSL\n\nWindows 2003 or above / Windows XP\n\nNext Steps\n\nIf interested, you can click on \"Apply here\" or write an e-mail to asha.yadav@adecco.com with your updated resume.\n\nNOTE: - Only shortlisted candidates will be contacted back.\n\nAsha Yadav| EA LIcence No.91C2918 | Personnel Registration No. R1876730", "extensions": ["6 days ago", "Contractor"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Contractor"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9ncmFtbWVyICgubmV0KSIsImNvbXBhbnlfbmFtZSI6IkFkZWNjbyBTRyAtIEJCIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiIwVjVfNy1IQnI3S3pOZ1NpQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEFkZWNjbyIsImxpbmsiOiJodHRwczovL3d3dy5hZGVjY28uY29tLnNnL2ktdC1hbmQtdC1qb2JzL3Byb2dyYW1tZXItbmV0LS8zMjE0MzU4P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Software Engineer", "company_name": "PALO IT", "location": "Singapore (+1 other)", "via": "via LinkedIn", "description": "About us\n\nPALO IT is a global innovation consultancy specialised in human-centered design, Agile software development and in the AI-driven transformation of large, forward-thinking companies. As a community of innovators, designers and technologists, we are committed to helping businesses embrace tech as a force for good. We work with clients to rapidly launch products and services, create new business models, and prepare leadership and culture for the future.\n\nStarted in Paris in 2009 and with offices across five continents, we are proud to be a B-Corp certified company in Singapore (the first tech company to do so!) and Hong Kong, and working towards certification across all other locations. To further our vision of bringing positive change to better our world, we are looking for a new team member to join our exciting team in Singapore.\n\nAt PALO IT, your happiness is our success. People are the heart of our organisation and the centre of everything we do. We constantly strive to... provide the best employee experience, as well as cultivate a diverse, inclusive and multicultural work environment, with many opportunities where you grow professionally and personally.\n\nOur Vision and Values\n\nWe aspire to positively impact the world by empowering organisations to harness the power of transformative technology for the greater good.\n• We care about our World\n• We act with Courage\n• We Share, it’s in our DNA\n• We choose Positivity\n• We Deliver Awesomeness\n\nYour profile & role on the project\n\nYOU:\n• Thrive on challenge. When was the last time you failed?\n• Are curious & always learning. What are you up to right now?\n• Can deal with constant change. When were you last surprised?\n• Have mastered at least one skill of your trade but you’re not defined by it. What can you teach us? Can you wear many hats?\n\nYOUR RESPONSIBILITIES:\n\nHaving graduated from an Engineering School, you have at least 3 years demonstrated experience in the role of Software Engineer. You are passionate about new technologies and digital innovation. You have already worked in an Agile environment, understand Scrum methodologies and can communicate well. You are an independent thinker with strong opinions, loosely held. Most importantly, you are someone who loves CODE!\n\nWithin projects, you will initiate development, carry out scoping estimations, implement architecture designs and write architecture documents. You will assist our customers in adopting best practice in new architecture patterns. You will carry out code, performance and security reviews and make proposals for improvement appropriate to the client's business context. Some important attributes:\n• Writing reusable, testable, and efficient code.\n• Ensuring high performance, low latency application design.\n• Familiarity with Agile / Scrum Methodologies and will be part of daily stand ups, backlog management, demos, retros, etc.\n• Proven experience providing end to end development that includes testing, maintenance, and support.\n\nYOUR PROFILE:\n• You have at least 3 years of hands-on experience in front-end development (Javascript/AngularJS/ReactJS/VueJS etc) and back-end development (NodeJS/Java/GoLang/.NET/Python/Spring/SpringBoot etc). Experience in hybrid and native mobile development (Swift/Java/Kotlin/React Native etc) is a bonus.\n• You have strong experience with dB design and application - both relational and NoSQL\n• You have strong experience in API development, using REST, GraphQL or SOAP.\n• You have deep experience with the developer tool chain, in particular npm, SCSS/SASS, Webpack, Web Assembly, Bash, Ant and the Command line.\n• You are interested in designing scalable, reliable and secure software using a combination of different languages, frameworks, libraries and technical environments.\n• You like to work in all phases of a rapid product development lifecycle.\n• You have good experience in Agile practices and Scrum in particular with exposure to Design Thinking, Lean Start-up, TDD, BDD, or XP.\n• You are an articulate communicator and inherent collaborator.\n• You are endlessly curious and thrive in an environment where you are continually challenged.\n\nYour role at PALO IT\n\nYou will be part of a project team working at various client sites, building or enhancing complex applications in the digital domain and serving as a touchstone for clients around agile development, best practices and emerging technologies. You will use your skills and experience to teach others and take advantage of opportunities to learn and improve your own skill sets.\n\nYou will also be invited to take part in R&D works done within our Practices. You will have the chance to assist or be a speaker at must-attend international IT conferences. You will have the opportunity to write articles for our Blog or specialized press. Genuine ambassador of PALO IT, you will present our offers and take an active role in the development of the company. In addition, you will contribute to the social, environmental and purpose driven objectives and initiatives of PALO IT in order to positively impact our environment, customers, communities and ourselves as an organization and individual.\n\nIf you like what you just read, we’d love to have a chat with you!\n\nWe might not be able to get back to every applicant but we promise your application will be reviewed by one of our recruitment experts.\n\nProtecting your privacy and the security of your data are longstanding top priorities for Palo-IT.\n\nYour personal data will be processed for the purposes of managing Palo-IT’s recruitment related activities, which include setting up and conducting interviews and tests for applicants, evaluating and assessing the results, and as is otherwise needed in the recruitment and hiring processes.\n\nPlease consult our Privacy Notice (https://www.palo-it.com/en/privacy-policy) to know more about how we collect, use, and transfer the personal data of our candidates.\n\nHere you can find how you can request for access, correction and/or withdrawal of your Personal Data", "extensions": ["23 hours ago", "Full–time"], "detected_extensions": {"posted_at": "23 hours ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciIsImNvbXBhbnlfbmFtZSI6IlBBTE8gSVQiLCJjb21wYW55X21pZCI6Ii9nLzExZHhwd2o3NXIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJNeGFOXzlhdTE2bGtDNm9wQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUlCQ3FJQlFVNVZYMDV4VWpCZlJsaDJhalJoUW5KNVRUVlRRa1ppTlRWM01GSkNiVFZMVFd4b2JGZERiWHBvTW5sUFYxVkRlakpCY1U1aldFaDZVVXBaVHpONVRYWm9iV2xzUzA5MWJuRnhaREpGVmpoVmEwWXlZamxwZDNRMWRrSllPRUpQVFZOb1pqQnNMVGsxVDFaUWFVMVhSM051YjNKSlExWm9ibU42TTNoMFMwZGFNM1ZzY1ZOT2FYWkNhRTQzTjNsSGNWWldMVlZJVFdSRFltWjFhM2RMYzJ4M0VoZExTRFpEV1ZCVE1FMDRVMncxVG05UWEyVkRlRFpCTUJvaVFVOU5XVkozUTBoTk1sSkNVRFE0TFc5T2NVZFpUV2cyVmpGVE9HMUNZVXMyUVEiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18xMSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL3NnLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvc29mdHdhcmUtZW5naW5lZXItYXQtcGFsby1pdC0yNDY5NTQ4MDA5P3JlZklkPTM1ZTlmNzA5LTJmNDYtNDUyMy04ZjI3LWRjMDc1MzMyMzY2MFx1MDAyNnRyYWNraW5nSWQ9M3hFT2h6ejQzY0lSZFZTVWhGaU1ydyUzRCUzRFx1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "CNC Programmer", "company_name": "Snaphunt", "location": "Singapore", "via": "via Jobs", "description": "The Offer Join a precision engineering solutions provider A chance to accelerate your career Supervise and oversee the automation & programming team The Job You will be responsible for : Using robotics/automation to develop new programming processes Implementing robotics process and liaising with production unit to ensure full understanding of future robotics process Generating relevant programmes and selecting appropriate tools to ensure smooth manufacturing of products Analysing and monitoring production output and machining issues as well as conducting test runs to ensure efficiency in machining process Providing relevant inputs for manufacturing process Planning, designing and installing relevant programmes to support production operations Monitoring and controlling any changes that is made to the existing programmes Assisting in overseeing progress of production team The Profile You have a Trade Certification with at least 5 years of working experience in the Precision... Engineering field. You have an understanding of the production procedure and tools, ideally within the Engineering Field. You have a working knowledge of Unigraphic. You possess leadership skills with experience managing a team You are performance driven and thrive in fast-paced environments. The Employer Our client is a leading provider of precision engineering solutions and they build products that cater to specific needs and enhance the general manufacturing process", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDTkMgUHJvZ3JhbW1lciIsImNvbXBhbnlfbmFtZSI6IlNuYXBodW50IiwiY29tcGFueV9taWQiOiIvZy8xMWM3NHQ2MXc4IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoicnFJb3A5WkNCOXAwbEJMVEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVJQkNxSUJRVTVWWDA1eFUxSjFUelptT0dkSlFsZG5Sbk01ZUZKVllUQlRlRzFuZVdWamFYRlJaM1UyVmt0V1FYUnViVVI1T1VjM1MybGxhbXh5UlUxb1owZExXbXRpVVVORlQzWmtOMjl1V21remJWUkthbkl3V25kMmVHWjVTVFl3ZERKVFlqQlhhbGMxTWpoRFdGbGtXRmQxZVRaeVIxWnhUMDlyVEZKdmMyb3RRa1l0WkRVd2VYUmFPV2QxYkVGbVVsaHdhbU5sUkVodGVVcDNUVWMzUkZOalRrcEJFaGRMU0RaRFdWQlRNRTA0VTJ3MVRtOVFhMlZEZURaQk1Cb2lRVTlOV1ZKM1FYVnlOWEpwZVVOd1NWODVjMkp5YzFwbGFtVXlRVkZCU0hjMWR3IiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMTkiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9icyIsImxpbmsiOiJodHRwczovL3NnLmZpZGFudG8uY29tL2pvYnMvam9iLW9wZW5pbmcvc29mdHdhcmUtZGV2ZWxvcGVycy1zeXN0ZW1zLXNvZnR3YXJlL2NuYy1wcm9ncmFtbWVyLTI3Nzg2Njg4ND91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Programmer Analyst 5 It", "company_name": "Oracle", "location": "Singapore", "via": "via MNC Jobs Singapore | MNC Jobs In Singapore", "description": "Programmer Analyst 5-IT-21000H73\n\nApplicants are required to read, write, and speak the following languages: English\n\nPreferred Qualifications\n\nOracle Applications Lab (OAL) runs the applications that run Oracle. ERP New Initiative is a global organization within OAL and is responsible for the Fusion Migration to the Oracle Public Cloud (OPC) program, a multi-year corporate initiative to move Oracle's internal business applications to the OPC. The OAL Corporate Programs and Operations (CPO) PMO drives OAL's development of custom solutions, implementation of Oracle Applications Cloud services, testing, production transition, and post go-live stability support.\nResponsibilities:\nThe Fusion Program Director will report to Director, Fusion Migration to the Oracle Public Cloud (OPC) program, and will be responsible for driving multiple initiatives, programs, and projects at the same time to successful completion. Specific responsibilities:\n• Manage programs and projects simultaneously to... successful completion.\n• Agile Release Train (ART) Release Train Engineer (RTE):\n• Be a servant leader and coach for the Agile Release Train (ART)\n• Facilitate the ART events and processes\n• Assist the teams in delivering value\n• Facilitate removal of impediments to help the ART and the teams to deliver business values via committed PI objectives\n• Engage and communicate with OAL and business stakeholders, help manage risk, and drive relentless improvement\n• Synchronize within the ART and across other ARTs\n• Work closely with OAL development teams, ATG, product development, and other stakeholders to mitigate risks, resolve issues, and remove impediments\n• Track and communicate program, project, and ART metrics and risks/issues\n\nQualifications:\n• Minimum of 10 years of experience in software product development or IT program and project management\n• Minimum of 10 years of experience as a scrum master, program or project manager, or development lead\n• SAFe knowledge or implementation experience is a plus\n• Demonstrated leadership and people management skills\n• Possess strong communication and analytical skills and a thorough understanding of product development and product management\n• Excellent interpersonal skills, good with people, ability to negotiate\n• Knowledge on product management, software development, DevOps, CICD, and Agile methodologies\n\nTools:\n• Atlassian JIRA, Confluence or other Agile project management tools\n\nEducation, certification, & training experience:\n• BS degree required; MS, MIS, or MBA is a plus\n• PMI PMP, SAFe Agilest, and Certified Scrum Master are ideal\n\nDetailed Description and Job Requirements\n\nWork with Oracle's world class technology to develop, implement, and support Oracle's global infrastructure.\n\nAs a member of the IT organization, lead the design, development, modification, debugging, and evaluation programs for extremely complex internal systems. Provide expertise to analyze existing programs or formulate logic for new internal systems. Develop conversion and system implementation plans. Recommend changes to development, maintenance, and system standards.\n\nProvide leadership and expertise in extremely complex internal systems, frequently operating at the leading edge of technology. Recommend and justify major changes to existing internal systems. BS or MS degree or equivalent experience relevant to functional area. Ten or more years of related experience recommended.\n\nJob: Information Technology\nTravel: Yes, 25 % of the Time\nLocation: SG-Singapore\nJob Type: Regular Employee Hire\nOrganization: Oracle", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9ncmFtbWVyIEFuYWx5c3QgNSBJdCIsImNvbXBhbnlfbmFtZSI6Ik9yYWNsZSIsImNvbXBhbnlfbWlkIjoiL20vMDVuanciLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJfUDBtUmF6QmtOMEowSkhrQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFc3dCQ293QlFVNVZYMDV4VVVwVFIxWlpVbTlMVVhwS01FTlFUWEZ5VGpGWlptaFRZWFJaTkd0elNGWXpTVGRhYkhweWNIb3laMHRSTUZkUmFWaGZObEJoT0dWTFJtZFZPRmxmUVdOU1ZUZFRjRTlUTTBSRk16ZDBSRUpyVmpJeFoyWTBlRUZtU0RSdFFYRk9jUzFvU1VKVk9IQkVlREF6UzNOQ2IwbzVORjgxVFRrMlJFUkxMV3hTZDJWMk0wSlZNMFVTRjB0SU5rTlpVRk13VFRoVGJEVk9iMUJyWlVONE5rRXdHaUpCVDAxWlVuZEVXWGxFVkdGRFFUQkdZV2RDU0U5bVYwRTJXblZDYlVOVGRWOW4iLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18yNiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNTkMgSm9icyBTaW5nYXBvcmUgfCBNTkMgSm9icyBJbiBTaW5nYXBvcmUiLCJsaW5rIjoiaHR0cHM6Ly9zZy5tbmNqb2J6LmNvbS9qb2JzL3Byb2dyYW1tZXItYW5hbHlzdC01aXQtc2luZ2Fwb3JlLTM2NzY5Mz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior Software Engineer (TO-20F61)", "company_name": "None", "location": "Singapore", "via": "via Jobs Trabajo.org", "description": "Software Development 1. Perform USB2.0 and USB3.0, USB PD device driver development, test, optimisation and maintenance 2. Undertake WHQL testing and certification of drivers and device frameworks 3. Participate in all phases of SDLC and prepare corresponding documentation 4. Undertake porting and maintenance of existing drivers to new frameworks and OSes 5. Resolve defects reported by internal and external customers Work closely with USB host & device firmware development teams Knowledge and skill requirement: 1. Degree/Master in Computer Science/Engineering 2. 5-10 years or above experience in the area of USB device drivers development 3. Working experience from specification to delivery of certified products 4. In-depth understanding of WDM and KMDF frameworks, multi-threading and DLLs 5. Thorough knowledge of USB2.0 and USB3.0 protocols and USBCV is a must 6. Thorough understanding of USB Device Classes (HID, MSC, CDC, UVC, UAC, , DFU, Custom) is required. D2XX and D3XX knowledge... is a definite plus. 7. Knowledeable in WinUSB and libusb (Windows or Linux) 8. Embedded development experience in WinCE, MacOS, Android and Linux is a definite plus 9. Experience working with hardware boards, scope and USB analysers 10. Experience in USB device pre-testing and USB certification 11. Professional attitude to work and meticulous in coding and testing Must have participated and experienced in SQA processes Software Development 1. Perform USB2.0 and USB3.0, USB PD device driver development, test, optimisation and maintenance 2. Undertake WHQL testing and certification of drivers and device frameworks Skills: Agile Methodologies, C++, Firmware, Information Technology, Java, Javascript, Linux, Maintenance, Software Development, Software Engineering, Usb, Xml, Software Developing, Device Driver Development Experience: 5.00-7.00 Years", "extensions": ["10 hours ago", "Full–time"], "detected_extensions": {"posted_at": "10 hours ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgRW5naW5lZXIgKFRPLTIwRjYxKSIsImNvbXBhbnlfbmFtZSI6Ik5vbmUiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Ikl3Y1ZlcjEzU1lLR1hzQWJBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9icyBUcmFiYWpvLm9yZyIsImxpbmsiOiJodHRwczovL3NnLnRyYWJham8ub3JnL2pvYi0zOTQtMjAyMTA0MjItMjBmNjFlY2Q3YjM3Yjk3ZTZkY2Q3Yjg1NGY4N2UyOTk/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Analyst Programmer (specialization in K2)", "company_name": "Flintex Consulting Pte Ltd", "location": "Singapore (+1 other)", "via": "via LinkedIn", "description": "• At least 2 years’ experience in building K2 Forms or K2 process Automation\n• Strong Knowledge in .NET (C#) Building Custom controls and Dealing with Ajax and JavaScript\n• Strong knowledge in Object Oriented Programming (OOP) concept .NET based language (C# .Net) custom solution development for K2\n• Prior knowledge of the K2 4.7/5.0 Upgrade\n• Able to attend to the customer business requirement and fully document the process to prepare for the K2 implementation\n• Able to develop on K2 black pearl/K2 Five and use the smartForms to create the interfaces.\n• Able to handle admin K2 tasks & provide K2 support for business owners\n• Creating and deploying K2 workflows using K2 studio and K2 SmartForms Designer\n• Troubleshooting multiple scenarios on K2 products implementation\n• Being a fast learner with a keen eye for details & be able to work under constant pressure against compressing timeline\n• Experience in - MS SQL server, Active directory\n• Advantageous to have any K2 product... certification\n• Specifics of skill requirement (versions):\n• K2 studio\n• K2 Designer\n• MS Visual studio\n• NET, K2 Degree, Diploma", "extensions": ["14 hours ago", "Full–time"], "detected_extensions": {"posted_at": "14 hours ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBbmFseXN0IFByb2dyYW1tZXIgKHNwZWNpYWxpemF0aW9uIGluIEsyKSIsImNvbXBhbnlfbmFtZSI6IkZsaW50ZXggQ29uc3VsdGluZyBQdGUgTHRkIiwiY29tcGFueV9taWQiOiIvZy8xMWgxejQxcHpiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiSGdqS2tPQVE0NzJwTm16VUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRW93Q0Nzd0JRVTVWWDA1eFZFSlFiWHBxZHpjNGJXWTNkVEo2UzB0RlJHZGFNRVJaUWpCRmFUVkRjM0JYTWtveVZGUkRiV2htWDFaUGEzbDFOR0pVYWxneVgwUk9TMHh1Y21JMlJFNVRWM05YYTFrdGQyRndkVEJCYTJsTFRVUk5ORGRhWmpnd05YRk1MV1ZMWlRReWVuRmhNMFJUYXpkU09WQTFlalpCY21wc1RWTlhjSFZuWTNsZkxVRlhObU5MUlRObmFVcFJNeTFHUW5adWJVdGxkR3cwT1hvNGVFazRSMjg0TTNveFUxSTJkbDk2ZGpaalZ6QkRjVFZUZURodVgzbElUWEY2TmtoNFozZHFlR1p3WjJObEVoZExTRFpEV1ZCVE1FMDRVMncxVG05UWEyVkRlRFpCTUJvaVFVOU5XVkozUVVaSVNraFRSVWQ2UVRGS2RrZElMVWM1VDFKWFZVaHhRVkp6WnciLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18zOSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL3NnLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvYW5hbHlzdC1wcm9ncmFtbWVyLXNwZWNpYWxpemF0aW9uLWluLWsyLWF0LWZsaW50ZXgtY29uc3VsdGluZy1wdGUtbHRkLTI1MTU3MjMwNzY/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Programmer Analyst -IT", "company_name": "NetSuite Inc", "location": "Singapore", "via": "via Learn4Good", "description": "Return to job search\n\nPrintable Format\n\nJob Description - Programmer Analyst 5-IT (21000H73)\n\nJob Description\n\nAll over the world, people's lives are better because of Oracle. Want to make a difference? Join our company of change-makers.\n\nFrom Oracle to culinary school and back again. Bonnie Carlson Kaypaghian uses the skills she learned to create recipes for her daughter’s Type 1 Diabetes and has written a cookbook to share with the world. #Lifeat\n\nOracle\n\nProgrammer Analyst 5-IT-21000H73\n\nApplicants are required to read, write, and speak the following languages:\n\nEnglish\n\nPreferred Qualifications\n\nOracle Applications Lab (OAL) runs the applications that run Oracle. ERP New Initiative is a global organization within OAL and is responsible for the Fusion Migration to the Oracle Public Cloud (OPC) program, a multi-year corporate initiative to move Oracle's internal business applications to the OPC. The OAL Corporate Programs and Operations (CPO) PMO drives OAL's development of custom... solutions, implementation of Oracle Applications Cloud services, testing, production transition, and post go-live stability support.\n\nResponsibilities:\n\nThe Fusion Program Director will report to Director, Fusion Migration to the Oracle Public Cloud (OPC) program, and will be responsible for driving multiple initiatives, programs, and projects at the same time to successful completion. Specific responsibilities:\n\nManage programs and projects simultaneously to successful completion. Agile Release Train (ART) Release Train Engineer (RTE):\n\nBe a servant leader and coach for the Agile Release Train (ART) Facilitate the ART events and processes Assist the teams in delivering value Facilitate removal of impediments to help the ART and the teams to deliver business values via committed PI objectives Engage and communicate with OAL and business stakeholders, help manage risk, and drive relentless improvement Synchronize within the ART and across other ARTs Work closely with OAL development teams, ATG, product development, and other stakeholders to mitigate risks, resolve issues, and remove impediments Track and communicate program, project, and ART metrics and risks/issues Qualifications:\n\nMinimum of 10 years of experience in software product development or IT program and project management Minimum of 10 years of experience as a scrum master, program or project manager, or development lead SAFe knowledge or implementation experience is a plus Demonstrated leadership and people management skills Possess strong communication and analytical skills and a thorough understanding of product development and product management Excellent interpersonal skills, good with people, ability to negotiate Knowledge on product management, software development, DevOps, CICD, and Agile methodologies Tools:\n\nAtlassian JIRA, Confluence or other Agile project management tools\n\nEducation, certification, & training experience: BS degree required; MS, MIS, or MBA is a plus PMI PMP, SAFe Agilest, and Certified Scrum Master are ideal Detailed Description and Job\n\nRequirements\n\nWork with Oracle's world class technology to develop, implement, and support Oracle's global infrastructure. As a member of the IT organization, lead the design, development, modification, debugging, and evaluation programs for extremely complex internal systems. Provide expertise to analyze existing programs or formulate logic for new internal systems. Develop conversion and system implementation plans. Recommend changes to development, maintenance, and system standards.\n\nProvide leadership and expertise in extremely complex internal systems, frequently operating at the leading edge of technology. Recommend and justify major changes to existing internal systems. BS or MS degree or equivalent experience relevant to functional area. Ten or more years of related experience recommended.\n\nJob:\n\nInformation Technology\n\nTravel:\n\nYes, 25 % of the Time\n\nLocation:\n\nSG-Singapore\n\nJob Type:\n\nRegular Employee HireOrganization:\n\nOracle", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9ncmFtbWVyIEFuYWx5c3QgLUlUIiwiY29tcGFueV9uYW1lIjoiTmV0U3VpdGUgSW5jIiwiY29tcGFueV9taWQiOiIvbS8wNW45NTIiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJlYWdKM3pMemgxOGFnMUJtQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUlCQ3FJQlFVNVZYMDV4VkVOVlMyOXlNbU5OV205RFMzSTRVMU5LVWpsaWVIUjVNMVZhTW1OUGRWRjRlRXBIWHpoeFFqRnJUbWhQZUdjMGJsUTNUMDlTYjJsclYySkhTSFp2Y1ZOb2RtdHdOV0ZmVFc0NE5XbGZOM0ZhU1VSaVdETTVSbk5MUjFoUmJIaHhhMkYzYVcxQ1IyaHFUM0JZUjNJNFkwSjVXbE5SUmtsTFIzQmpNa2xGV214WFpFbHplVUoxY25Vek0zTm1TbU5ITjNBNGRWUTRXVmswV21SbkVoZExTRFpEV1ZCVE1FMDRVMncxVG05UWEyVkRlRFpCTUJvaVFVOU5XVkozUVRWVGQyMDRkR3RXU21sTFNrdFVObG8wWHpWcVNEZFdXa2hsVVEiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY180NiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMZWFybjRHb29kIiwibGluayI6Imh0dHBzOi8vd3d3LmxlYXJuNGdvb2QuY29tL2pvYnMvc2luZ2Fwb3JlL2luZm9fdGVjaG5vbG9neS8yNzEyOTEyMzMvZS8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Senior Game Programmer", "company_name": "None", "location": "Singapore", "via": "via Jobs", "description": "Gamelogic started out with a small group of gaming enthusiasts and has since expanded into a full-fledged game development studio. As gaming enthusiasts, we are adamant about one thing: which is to have fun. We are experts in having a good time and we hope to offer fellow gamers a chance to unleash their inner child through our awesome games.Our goal is to create innovative casual games that will penetrate the global market. Our team is made up of experienced game designers, programmers and artists and we are constantly looking to nurture the next generation of game developers.When it comes to gaming for us at Gamelogic; the sky's the limit.------------------------Title: Senior Game Programmer Responsibilities: · Brainstorming game concepts, design elements, and specifications with the game design team.· Leading a team of programmers and set work schedules and deadlines.· Assist project leaders with statistical testing, and suggest new methods based on output.· Selecting suitable game... frameworks and translating concepts into clean and efficient code.· Designing and testing gameplay features and prototypes.· Generating game scripts and storyboards, as well as animating game characters and objects.· Contributing to user interface development, as well as the integration of graphic design and audio features.· Performing tests and implementing validation procedures.· Documenting the full lifecycle of game development.· Maintaining code, resolving issues, and performing bug fixes.· Integrating the latest game industry trends into game designs.· Working closely with a lead game developer to create task/project deliverables.· Interface with Quality Assurance, Game Producers, Game Designers and Artists.Requirements: · Bachelor's degree in computer science, computer engineering, or similar.· At least 5 years' experience as a game programmer.· Proficiency in Unity3D.· Able to work in Windows, Linux and Mac environment.· In-depth knowledge of full lifecycle game programming and related technologies.· Highly proficient in programming languages, such as C++, C# and Java.· Superb analytical and problem-solving skills.· Excellent communication and collaboration abilities.· Great organizational and time management skills.· Able to troubleshoot and solve complex technical issues.· Highly analytical with excellent written and verbal communication skills.· Excellent time management skills with the ability to work under pressure to meet tight deadlines.· Contribute to innovation in game design.Bonus: · Coursework or certification in game design and development preferred.· Experience in mobile games development", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgR2FtZSBQcm9ncmFtbWVyIiwiY29tcGFueV9uYW1lIjoiTm9uZSIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiM0Z6NEIzSy1VRk9ONllJWUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIiwibGluayI6Imh0dHBzOi8vc2cuZmlkYW50by5jb20vam9icy9qb2Itb3BlbmluZy9zb2Z0d2FyZS1kZXZlbG9wZXJzLXN5c3RlbXMtc29mdHdhcmUvc2VuaW9yLWdhbWUtcHJvZ3JhbW1lci0yNzc4NDYzNzI/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Software Engineer (Nucleus) #BAS2020 (Singapore,  Singapore)", "company_name": "Singtel", "location": "Singapore", "via": "via APAC Tech Jobs", "description": "About NCS\n\nNCS is a member of the Singtel Group and the leading information, communications and technology (ICT) service provider with presence in the Asia Pacific region.\n\nWe deliver end-to-end ICT solutions to help governments and enterprises realise business value through digital transformation and the innovative use of technology. Over the years, NCS has played a critical role in the Singapore government’s efforts to computerise the civil service sector and integrate IT into its public services\n\nSoftware Engineer (Nucleus)\n\nNucleus is an NCS programme that equips software engineers with professional training, technical expertise and industry experience. We help you develop your ICT skills and accelerate your career as you work on technology projects that make a difference in the lives of people.\n\nWe have designed Nucleus to help build your foundation, develop your technical skillsets and deepen your specialisation experience. You will be immersed in challenging projects and attain... NUS-ISS accredited graduate certification programmes. Through this, you will be on your way to attain a Master of Technology.\n\nNCS is looking for talents with strong interest in application development and maintenance to join our Nucleus programme. Join us as we make a difference and impact to the lives of people to champion digital transformation for the future.\n\nKey Responsibilities\n• Participate in discussions with stakeholders to understand business and system requirements\n• Perform technical tasks to develop/enhance software applications according to Functional and Technical specifications\n• Maintain and improve software applications\n• Execute unit, integration, system and user acceptance testing\n• Using configuration management, integration and build automation tools to deploy applications\n• Identify opportunities and suggest recommendations for system improvement\n\nThe ideal candidate should have/be:\n• Degree in Computer Science or related engineering fields\n• Fresh graduates or with less than two years equivalent practical work experience\n• Proficiency in one or more frontend framework (HTML5/Angular/React JS)\n• Proficiency in one or more backend languages (Java/.NET/Python/PHP)\n• Proficiency in database will be added advantage\n• Experience in frontend and backend web application development will be added advantage", "extensions": ["19 hours ago", "Full–time"], "detected_extensions": {"posted_at": "19 hours ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciAoTnVjbGV1cykgI0JBUzIwMjAgKFNpbmdhcG9yZSwgIFNpbmdhcG9yZSkiLCJjb21wYW55X25hbWUiOiJTaW5ndGVsIiwiY29tcGFueV9taWQiOiIvbS8wMjB6ZmwiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJLZEhWb3dBM3BabG0yVUE2QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFc3dCQ293QlFVNVZYMDV4VkVaRVVqUlpMVXQwTW01WFRVSTBVMk5KVERVMk9GcExiR1YxTTJjeFdYQnRWVkJKVEZSNFVrRlZjbTVuTVhZMFQxZGFlRkJXYnpWRmFGTldhblExY2tWWllrUnRja3hoUzJ3eFMyUmFUVTFNTkVzMlQyTjNXV3g0UkdaT1FWUm5iSGhDWkdRMldrVlhTR2h3Ulc0eVFqZHhZMU4yV1RVemJ6STNlbXBKVm5odU9WSldOallTRjB0SU5rTlpVRk13VFRoVGJEVk9iMUJyWlVONE5rRXdHaUpCVDAxWlVuZENielJhZVhSR2NYcDZOSE54Vm5oVVIwRm5Xa0kyVUdJMVdIVjMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY181OCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBBUEFDIFRlY2ggSm9icyIsImxpbmsiOiJodHRwczovL2FwYWN0ZWNoam9icy5jb20vam9iLzE1NDY0L3NvZnR3YXJlLWVuZ2luZWVyLW51Y2xldXMtYmFzMjAyMC1zaW5nYXBvcmUtc2luZ2Fwb3JlLz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Software Developer", "company_name": "TOSS-EX PTE. LTD.", "location": "Singapore (+1 other)", "via": "via Learn4Good", "description": "Roles &\n\nResponsibilities\n\nJob Description\n\nDevelopment of salesforce features like APEX class coding, process builders, triggers, lightening components and visual workflows.\n\nUnderstanding of salesforce security practices, Code quality and security tools, specifically PMD Static Code Analyzer and force.com, Salesforce security around Site Guest User profiles, encryption methods and tools.\n\nPrepared Design document in order to support the business.\n\nCo-ordinate with BA and testers during the development.\n\nRequirements5+ years relevant experience in salesforce development.\n\nFamiliar with CICD and has experience of using Gitlab as a code repository and management tool.\n\nIs able to produce technical design documents before development commences.\n\nExtensive knowledge on SDLC and exposure to QA testing processes and how to Create Test Data based on requirements/Test Scenarios\n\nAgile knowledge and experience as a developer and has used Agile tools such as Jira and confluence\n\nCan conduct... Root cause analysis and investigations during incidents and is able to create and implement fixes to resolve. Desired Skills and\n\nExperience:\n\nAgile, Apex Data Loader, Apex Programming, Development, Encryption, Salesforce, Salesforce.com Certified Developer\n\nTell employers what skills you have\n\nC#C++Development\n\nJavaJavaScript\n\nJob Descriptions\n\nMySQLSalesforce\n\nSalesforce Training\n\nSalesforce.comSalesforce.com Certified Developer\n\nSalesforce.com Consulting\n\nSoftware Development\n\nSQLXMLcodingcode qualityoracle Aplication Express\n\nSecurity Toolscode analyzer", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBEZXZlbG9wZXIiLCJjb21wYW55X25hbWUiOiJUT1NTLUVYIFBURS4gTFRELiIsImNvbXBhbnlfbWlkIjoiL2cvMTFnNzA2emQ3YyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6InlYZDlQZlBFRDBXazg1YXVBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2Y0JDcmNCUVU1VlgwNXhWRWh2YnpsT1pEVnBVMWhwVWxoamVISTFWazloYjJOUVZrVlpPWHBaWVhKM1kxWkVha3RTVlRCUFdFcHVSMlJsY1dneVNEazRXVkZUTWpSSFIxaE9VbVIzUkRkSWVqQTJSV3BoYkV0cVZFNUJabTB3VUZnMU1uSm1aa3BXZWxFd1F6ZEVWblZSY0hOSk1VUTVhRmhCZEhneVgwaHljRkIyZEdNeGNrbGtRVkZ4UW1JMlVsbzJUVXhqYnpFMFpEQk9lR2hzUVdwdU4yYzFNRnBxT0hCTVNVZGlNbXRmYTNrMlMwVlNRbW96VDJaTkVoZExTRFpEV1ZCVE1FMDRVMncxVG05UWEyVkRlRFpCTUJvaVFVOU5XVkozUkhSWFRXNTJkbXRNYVRBM1VHZG5Oa0U1V0c5RE1uWkphbFJvWnciLCJmY3YiOiIzIiwiZmNfaWQiOiJmY182NSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMZWFybjRHb29kIiwibGluayI6Imh0dHBzOi8vd3d3LmxlYXJuNGdvb2QuY29tL2pvYnMvc2luZ2Fwb3JlL3NvZnR3YXJlX2RldmVsb3BtZW50LzI3MTI4MzU3NS9lLz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}], "chips": [{"type": "Title", "param": "job_family_1", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Software engineer", "value": "software engineer"}, {"text": "Programmer", "value": "programmer"}, {"text": "Programmer analyst", "value": "programmer analyst"}, {"text": "Senior", "value": "senior"}, {"text": "Cnc programmer", "value": "cnc programmer"}, {"text": "Engineer", "value": "engineer"}, {"text": "Analyst programmer", "value": "analyst programmer"}, {"text": "Science", "value": "science"}, {"text": "Software programmer", "value": "software programmer"}, {"text": "Assistant", "value": "assistant"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Electrical engineer", "value": "electrical engineer"}, {"text": "Executive", "value": "executive"}, {"text": "Java engineer", "value": "java engineer"}, {"text": "Java programmer", "value": "java programmer"}, {"text": "Lecturer", "value": "lecturer"}, {"text": "Manager", "value": "manager"}, {"text": "Operator", "value": "operator"}, {"text": "Project officer", "value": "project officer"}, {"text": "Senior programmer", "value": "senior programmer"}, {"text": "Senior system", "value": "senior system"}, {"text": "Senior technical", "value": "senior technical"}, {"text": "Sr. programmer", "value": "sr. programmer"}, {"text": "Systems programmer", "value": "systems programmer"}, {"text": "Technical", "value": "technical"}, {"text": "Trainee", "value": "trainee"}, {"text": "Trainer", "value": "trainer"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Mining", "value": "/business/naics2007/21"}, {"text": "Rental", "value": "/business/naics2007/532"}, {"text": "Wholesale", "value": "/business/naics2007/42"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "EPAM", "value": "/m/0dlnrc"}, {"text": "VISA", "value": "/m/01kqjn"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "Citi bank", "value": "/m/01dfb6"}, {"text": "TikTok", "value": "/g/11fy265933"}, {"text": "Ubisoft", "value": "/m/02qdyj"}, {"text": "Cognizant", "value": "/m/03bf9h"}, {"text": "HCL SINGAPORE PTE. LTD.", "value": "/g/11fy25ngsv"}, {"text": "Oracle", "value": "/m/05njw"}, {"text": "Credit Agricole Group", "value": "/m/028vbm"}, {"text": "Mindteck (India) Limited", "value": "/m/0cqj8w1"}, {"text": "Nanyang Technological University", "value": "/m/0l49k"}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Zühlke Group", "value": "/g/1hh_rg216"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Avensys Consulting Pte Ltd", "value": "/g/11g7022gjf"}, {"text": "Avnet", "value": "/m/0c8xmc"}, {"text": "GlobalTix Pte Ltd", "value": "/g/11dxpqdhrf"}, {"text": "Government Technology Agency", "value": "/g/11gh0528nq"}, {"text": "J.P.Morgan", "value": "/m/01hlwv"}, {"text": "Optimum Solutions (Singapore) Pte Ltd", "value": "/g/11g70hkrbx"}, {"text": "Razer Inc.", "value": "/m/075hc0"}, {"text": "Realtek Malaysia", "value": "/m/05wrm7"}, {"text": "Realtek Singapore Private Limited", "value": "/g/11g9n26trs"}, {"text": "Success Human Resource Centre Pte Ltd", "value": "/g/11g709_209"}, {"text": "TECHNOPALS PTE. LTD.", "value": "/g/11dxpvkynp"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "UST", "value": "/m/08kb8g"}, {"text": "Adecco GS", "value": "/m/08gz46"}, {"text": "Alphanova Pte. Ltd.", "value": "/g/11f8h_czps"}, {"text": "BioMind", "value": "/g/11dymfr2l6"}, {"text": "Biqmind", "value": "/g/11g21fzhrb"}, {"text": "BitTitan", "value": "/g/11dxpksv89"}]}]}