{"search_metadata": {"id": "60827a86fe41d0b2e526f666", "status": "Success", "json_endpoint": "https://serpapi.com/searches/aebc0a78577a3f53/60827a86fe41d0b2e526f666.json", "created_at": "2021-04-23 07:43:02 UTC", "processed_at": "2021-04-23 07:43:02 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28project+manager%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=120", "raw_html_file": "https://serpapi.com/searches/aebc0a78577a3f53/60827a86fe41d0b2e526f666.html", "total_time_taken": 6.66}, "search_parameters": {"q": "(project manager) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "120"}, "jobs_results": [{"title": "Senior Associate/Assistant Vice President – FICC Digital Services Platform Manager", "company_name": "SGX", "location": "Singapore", "via": "via EFinancialCareers", "description": "The Digital Services team is part of SGX Fixed Income, Currencies and Commodities team (FICC) and our Digital Assets joint venture (Marketnode) and focuses on creation of new platforms and marketplaces using a combination of digital workflows, smart contracts and distributed ledgers. Given the team’s pipeline of new projects and platform in 2021, we are looking for a Digital Services Platform Manager to provide end-to-end oversight and project management including planning, analysis and trouble-shooting while being the key contact point for internal & external stakeholders.\n\nThe role will appeal to those with a project management background in capital markets who are interested in building a multi-asset digital marketplace of the future working in a fast paced environment, as we build the next generation market infrastructure.\n\nResponsibilities\n\n• Manage FICC and Digital project scopes, timeline and delivery\n\n• Coordinate sprints, retrospective meetings and daily stand-ups across... team\n\n• Key contact point for internal/external stakeholder communications\n\n• Work with product team on backlog management and grooming\n\n• Development team guidance, Agile framework education\n\nJob Qualifications\n\n• Bachelor’s in Engineering, Computer Science / Information Technology or equivalent technical discipline\n\n• 3-5 years’ experience in a similar role within in capital markets\n\n• Proven track record in project management & delivery\n\n• Knowledge of Scrum techniques/artifacts (such as definition of done, user stories, automated testing, backlog refinement)\n\n• Working understanding of software development, platform deployments\n\n• Scrum Master or Project Management Certification is an advantage, e.g. PMP, DevOps Leader\n\n• Self-starter with excellent leadership and team building skills\n\n• Ability to resolve complex problems creatively across various teams (business, technology, Ops)\n\n• Experience in managing senior internal and external stakeholders", "extensions": ["4 days ago", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQXNzb2NpYXRlL0Fzc2lzdGFudCBWaWNlIFByZXNpZGVudCDigJMgRklDQyBEaWdpdGFsIFNlcnZpY2VzIFBsYXRmb3JtIE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJTR1giLCJjb21wYW55X21pZCI6Ii9tLzAzZl94eSIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImZJR0tfUUU4c1JURmk5ZzRBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVza0JDb3dCUVU1VlgwNXhVMWhrY1Uxa2IxTnpNV1ZsZFc1dFh6VTBSMXBDVFc5ak5tUjJiekJDWWtOdFVGcDVRVlZxTUdSc1JUaDRORVV6VkdKTFJGQm9iSHBsZWxWR1drVkhWalJhZUVaU2FEbE9ZMlJPUVdkMmQyZG5OMmRvVWkxS1MwWkhUbDlvYTJKa05VRlhXV3c0TTJSMmRXWlZXa0ZYUlhSaVZGOVBjSFpCVmpOYU4wWXpZamxyTWxkNVJFMFNGR2xJY1VOWlRTMVJUM1JJTlMxblZIbzFjV1JCR2lKQlQwMVpVbmREYWpaYU5YZE9iVWhEWTNBeVMySnhlVzFVTjA1WU5FeDFSRFIzIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBFRmluYW5jaWFsQ2FyZWVycyIsImxpbmsiOiJodHRwczovL3d3dy5lZmluYW5jaWFsY2FyZWVycy5zZy9qb2JzLVNpbmdhcG9yZS1TaW5nYXBvcmUtU2VuaW9yX0Fzc29jaWF0ZUFzc2lzdGFudF9WaWNlX1ByZXNpZGVudF8lRTIlODAlOTNfRklDQ19EaWdpdGFsX1NlcnZpY2VzX1BsYXRmb3JtX01hbmFnZXIuaWQxMDcwOTM2MD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Project Manager (PMP/CITPM, Infrastructure)", "company_name": "Expert Healthcare Recruit", "location": "Singapore", "via": "via LinkedIn", "description": "• Responsible for the successful implementation of infrastructure projects\n\nRequirements\n• PMP/CITPM certified\n• Degree in Engineering Computer Science or equivalent.\n• At least 5 years of project management experience in infrastructure.\n\nIf you are keen to apply for the position, kindly email your detailed resume in MS Word to hr@recruit-expert.com\n\nPlease note that only shortlisted candidates will be notified.\n\nFor more job opportunities, please visit our website at www.recruit-expert.com\n\nEA Licence: 19C9701\n\nRegistration: R1326740", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIgKFBNUC9DSVRQTSwgSW5mcmFzdHJ1Y3R1cmUpIiwiY29tcGFueV9uYW1lIjoiRXhwZXJ0IEhlYWx0aGNhcmUgUmVjcnVpdCIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoidXQ1UGpKSHcycWpEZEpPR0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL3NnLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvcHJvamVjdC1tYW5hZ2VyLXBtcC1jaXRwbS1pbmZyYXN0cnVjdHVyZS1hdC1leHBlcnQtaGVhbHRoY2FyZS1yZWNydWl0LTI1MTIyMTI0MDE/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Project Manager", "company_name": "ENTERPRISE ADVANCED SYSTEM INTELLIGENCE PTE. LTD.", "location": "Singapore (+1 other)", "via": "via MNC Jobs Singapore | MNC Jobs In Singapore", "description": "• Create and execute project work plans and revises as appropriate to meet the changing needs and requirements.\n• Provide consultancy service to business users in both technical and business domain areas.\n• Identify resources needed and assigns individual responsibilities.\n• Ensure on time delivery of project with good quality and within budget.\n• Effectively apply IT Project Management methodology and enforces project standards.\n• Manage day-to-day operational aspects of the project.\n• Minimize exposure and risk on project.\n• Resolve and/or escalate issues in a timely fashion.\n• Gather business requirements from the business user(s).\n• Review deliverables prepared by 3rd party contractor(s).\n• Provide regular project status update to key stakeholders, project sponsor and management.\n\nRequirements:\n• Recognized degree in IT-related discipline.\n• Project Management Professional (PMP) Certification or Certified IT Project Management (CITPM) preferred.\n• Minimum of 2 years’ experience in... IT or POS Project Management role including significant experience in implementation of medium-sized projects within the enterprise.\n• Strong working knowledge of enterprise technologies, infrastructure and ability to multi-task.\n• Experience in supervising and/or managing resources.\n• POS related experience will be an added advantage.\n• Retail and/or F&B related experience will be a definite plus\n\nInterested candidates are invited to apply online with a comprehensive resume, via the APPLY NOW button below.\n\nWe regret that only shortlisted candidates will be notified.\n\nThank you for applying.\n\nminimumYearsExperience : 2\n\n[CANDIDATES WHO REQUIRE WORK PASSES NEED NOT APPLY", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJFTlRFUlBSSVNFIEFEVkFOQ0VEIFNZU1RFTSBJTlRFTExJR0VOQ0UgUFRFLiBMVEQuIiwiY29tcGFueV9taWQiOiIvZy8xMWYwMThzcjdsIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiYWlFYmhxcUVoWVEwUzhfa0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXNrQ0Nvd0NRVTVWWDA1eFVqRmZMVWhTWDB3NFpEQlZTMGhIV1ZaeWVHSm1WSGxwVVRORVEyWkpPV05CTkc1eVozVmxhM0ZpWDBoTU4xVlFlRTl0UTJOeWFUWkRjRXRWYXpsdVVVeENiWHBDYkVKb1NVVTNVamRZYW01a0xXUnZVMHRrUkVaVk5GWklURE4xY1doc2RHWkpUVWRzZERkR2FqZGZkRVZLYmxOYWEwcE1VVlF0WHpKM1MxTnVTbTFGU1ZWUlNYUmlRVzl6Y0dSRFRHbGFXVFppU1c1R2VWWTRUbWswY2xkWVRtTTVTemhtWVdzek5XNDVjbTlUVTBoalVtZ3RNazFXYjJ0d1FtZEVaVjlVVFZsMlJ6WTRibTFmZGxCcFRXVTBaRVZzVFRBdGN6SkZMWG95Vkc1VWQwdHZabEJOWmt0TlpteElMVTF3UmpWTFprUjNiMU51WVZsQ04wVk1Sa1kzZG01bE9SSVVhVWh4UTFsTkxWRlBkRWcxTFdkVWVqVnhaRUVhSWtGUFRWbFNkMEZZU0hWMFNVWlhkbGhQWWxJeWJWazVRMmM1UW5GQ1RXUklXWGMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18yMCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNTkMgSm9icyBTaW5nYXBvcmUgfCBNTkMgSm9icyBJbiBTaW5nYXBvcmUiLCJsaW5rIjoiaHR0cHM6Ly9zZy5tbmNqb2J6LmNvbS9qb2JzL3Byb2plY3QtbWFuYWdlci1nZXlsYW5nLTE2MjYyMD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior Delivery Manager (Data Projects)", "company_name": "Singtel Group", "location": "Singapore", "via": "via Singtel Careers", "description": "Singtel, Asia’s leading communications technology group, provides an extensive range of telecommunications and digital services to millions of consumers and businesses across Asia, Australia, Africa and the USA. With over 140 years of innovation behind us, we continue to push boundaries in our networks and services, to enrich lives and transform businesses.\n\nOur core values – Customer Focus, Challenger Spirit, Teamwork, Integrity, and Personal Excellence – shape the way we work. We are passionate about making a difference and have an open and inclusive culture where everyone is empowered to do their best. Our diverse business means you will enjoy unique opportunities and rewarding experiences to learn and grow your career in a dynamic industry.\n\nJoin us and experience what it’s like to be with an Employer of Choice*. Together, let’s create a brighter digital future for all. *Awarded at the HR Fest Awards 2020\n\nData and Platform Management team within Singtel Group IT is looking for an... experienced Service Delivery Manager to deliver enterprise-wide data programs/projects, manage stakeholders, business and other IT delivery at different levels.\n\nThe successful candidate will be responsible for managing resources (internal or external) within the IT and business domains to deliver data programs & projects on time and within budget meeting the business objectives. The Service Delivery Manager will be managing multiple projects of various sizes and complexities. The incumbent will exhibit a broad range of qualities gain/maintain credibility and leading the projects. The successful candidate should possess the ability to demonstrate strong leadership skills.\n\nKey Responsibilities\n\nStakeholder Management & Communications\n\nThe role requires extensive engagement with senior management and hence strong negotiation and influencing skills are needed. The candidate will be required to exhibit evidence of directly influencing and managing the program business ‘outcome’ rather than purely managing the program ‘process’. The incumbent will have demonstrated proven people management experience and skills to lead, motivate and develop teams of industry professionals to solve culturally diverse technical and business issues. This role requires high level of thought clarity and communications skills. The role will entail communication with senior project stakeholders (sponsor, owners, and Product Managers) within Singtel IT and the business (Executive and C-level).\n\nDelivery Management\n• Managing and delivering programs and projects related to data solutions and owning the complete end-to-end project management accountability\n• Developing, managing and improving stakeholder relations – both internal and external\n• Use of project management artefacts to ensure effective outcomes such as:\n• Accuracy of forecasting\n• Delivery timelines and schedules are met\n• Adherence to quality standards\n• Leading in the identification of business impacts resulting from project implementation and proactively managing them\n• Ensuring compliance to Singtel Project Management policies and procedures\n• Supporting the Delivery team with appropriate resource, reporting and financial management inputs\n• Delivering financial submissions and updates to sponsors and senior stakeholders in accordance with Singtel capital management processes\n• Preparing monthly financial forecasts and reconciliations against budget to ensure forecasting variance maintained within 10%\n• Resolving program/project escalated issues and disputes while maintaining constructive working relationships and achieving schedule commitments\n• Preparing resource plans and managing ongoing resource forecasts\n• Leading and motivating a core team of cross functional members from across Singtel (including Commercial, Sales, Marketing, Customer Service, IT, Engineering, Testing teams) to deliver the best possible project outcome\n• Managing offshore teams & vendors\n• Ensuring a high standard and continuous development of market knowledge, business unit operations, consultative and presentation skills, education and experience relevant to the role\n\nFinancial Management\n• Meeting both key program/project delivery milestones along with financial and customer centric KPIs\n• Strong financial and commercial management skills are required to ensure financial budgets are managed effectively and program delivers to sponsor’s expectations\n\nContract & Vendor Management\n• A significant component of this role requires working with internal employees, contractors and third-party vendors to deliver quality outcomes for the business\n• Managing the entire procurement process leading to successful vendor selection through standard tender processes\n• Timely contract negotiations and managing contracts is a vital\n• Ensuring that all procurement governance guidelines are strictly adhered to\n\nThe ideal candidate should possess\n• Bachelor’s degree in Business Management, IT, Computer Science, Computer Engineering or equivalent with 8-10 years of experience in delivery of complex IT applications projects within a matrix environment\n• PMP certified\n• Telecommunications industry experience\n• Experience managing vendor engagements\n• Experience in procurement process – managing tenders and negotiating contracts\n• Experience in managing Capex of over S$4M\n• Experience in IT financial management and budgeting skills\n• At least 5 years of experience in the area of big data, data warehouse, BI & reporting and / or data management\n• In depth knowledge of full software delivery life cycle & challenges involved\n• Well versed with various project management methodologies and frameworks\n• Contract negotiation and management skills\n• Advanced experience with Microsoft Office Excel, PowerPoint, Word, Visio and MS Project & tools supporting agile project delivery\n• Strong communication and stakeholder management skills\n• Proven ability to work with people from different cultures and backgrounds\n• Strong stakeholder management skill\n• Experience delivering Telco projects\n• Exposure to solution architecture and design\n• Experience in delivering projects in agile delivery methodologies\n• Experience in vendor environment as well end-user environment\n\nWe believe in the strength of a vibrant, diverse and inclusive workforce where backgrounds, perspectives and life experiences of our people help us innovate and create strong connections with our customers. We strive to ensure all our people practices are non-discriminatory and provide a fair, performance-based work culture that is diverse, inclusive and collaborative", "extensions": ["20 days ago", "Full–time"], "detected_extensions": {"posted_at": "20 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgRGVsaXZlcnkgTWFuYWdlciAoRGF0YSBQcm9qZWN0cykiLCJjb21wYW55X25hbWUiOiJTaW5ndGVsIEdyb3VwIiwiY29tcGFueV9taWQiOiIvbS8wMjB6ZmwiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJJZEEzd0E0VllZRE1xcE1UQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdDhCQ3FJQlFVNVZYMDV4VWxaMVFWQmpXVlZVTFZOQlNUbG9jRlE0ZFVwb1RXZDNNbVIxVFZOMWFqbFBWV2h5TXpCeGVuWnNka0ZLVUhGVk1FaFdWVlE0VTJ4YVEydFBZM2RGZVRsUWRUZ3hSbmsxV1ZsVlNrMVRhbGRxYVhoaVpGSnBWMEUzV1VkUFoyTXlSRUZrWmpGd1VESnVhMWhoV2xwcFVYRnViVFE0ZUVWTWVVeDZlbkJIZUU5eVZVbzNWbkkyWTBSMk9YbFpabEp4YzI1T0xXRkNaR3RLZG05QkVoUnBTSEZEV1UwdFVVOTBTRFV0WjFSNk5YRmtRUm9pUVU5TldWSjNRWGxqVVZOcGVuWkNSREpMTmxsWlRtSjRTalJMVkhZeGFHb3pVUSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzI3IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFNpbmd0ZWwgQ2FyZWVycyIsImxpbmsiOiJodHRwczovL2dyb3VwY2FyZWVycy5zaW5ndGVsLmNvbS9qb2IvU2VuaW9yLURlbGl2ZXJ5LU1hbmFnZXItJTI4RGF0YS1Qcm9qZWN0cyUyOS1TaW5nLzU3MzQ1MDYxMC8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Project Manager (Engineering| Functional| Jurong)", "company_name": "Manpower Singapore", "location": "Singapore", "via": "via JobsCentral", "description": "Project Manager (Engineering| Functional| Jurong)\n\nJob Summary\nThe Project Manager shall serve as a primary interface by providing a single point of contact between the company and customer/sales and to act for and on behalf of company.\nThe Project Manager shall be responsible for the effective management and delivery of equipment and services as defined by customers order with respect to safety, quality, cost and schedule requirements of the project.\n\nSupport the upfront pre-tender / tender phase by providing input such as lessons learnt, challenges, risks and/ or opportunities to the proposal/costing team.\n• Responsible for implementing client requirements and contractual obligations are\nmade known and understood by all personnel involved with the project execution\n• Produce project deliverables in a safe manner, to specifications and quality\nrequirements, on schedule and within budget\n• Responsible for leading a cross functional team (Planners, buyers, engineers,\nmanufacturing) and... ensuring they can meet the obligations of the contract/project\n• Coordinate with various functional departments to support the project\n• Comprehends contractual conditions and specifications and looks for commercial and\ntechnical cost savings.\n• Ensures resources are deployed where applicable.\n• Communicates with other managers to ensure accurate information is made available\nat all times to facilitate effective decision-making.\n• Performs & Manages Risks: Identifies problem areas, evaluates and initiates corrective\naction, monitors and reschedules the project schedule with respect of time and\nrequired resources.\n• Maintains a record of all communications related to the project.\n• Work with Project Accountant to develop and present financial performance reports\nand project P&L statements.\n• Monitors project performance against an agreed plan and budget and initiates\ncorrective action where appropriate to ensure projects are completed on time and\nwithin budget.\n• Performs Management of Change: Identifies and records changes to the project scope\nof supply and negotiates/document variation orders for customer driven changes and\nadvice all concerned of the impact on cost, manpower and schedule.\n• Creates a project schedule and maintains for the duration of the project\n• Maintains action items registers for the project\n• Advises plants on invoicing for milestone payments at attainment and maintains the\nschedule for milestone payment invoicing.\n• Creates/Estimates revenue forecast documents for the duration of the project.\n• Provides internal project reporting by using monthly dashboards, and project\nreviews as needed\n• Provides external project reporting as defined by the customer in project\nspecifications.\n• Completes all project closeout activities including evaluation of project performance,\ndocumenting lessons learnt, archiving and close out report.\n\nMinimum Job Qualifications :\n• Bachelor Degree in Engineering preferred\n• Minimum 3years in Oil & Gas industry or other relevant industry experience\n• Knowledge of project management principles with specific experience managing projects.\n• Proven leadership experience with the ability to plan, organize and execute.\n• A good working knowledge of production and inventory control systems\n\nQualifications:\n\nProject Management Professional (PMP) certified would be an advantage\n\nOthers\n\nComputer literate: Microsoft Office, Project Management Software, SAP knowledge is a plus\nAbility to take night calls due to worldwide customers/ stakeholders\nProactive/ independent learner\nPossess strong communication skills\n\nIf you have the releavnt skillsets, please send an updated CV in word format to [Click Here to Email Your Resume].\n\nWe shall contact shortlisted candidates.\n\nNg Yew Koon Sherry\nSenior Recruitment Consultant (R1657259)\n\nSherry, Yew Koon Ng EA License No.: 02C3423 Personnel Registration No.: R1657259\n\nPlease note that your response to this advertisement and communications with us pursuant to this advertisement will constitute informed consent to the collection, use and/or disclosure of personal data by ManpowerGroup Singapore for the purpose of carrying out its business, in compliance with the relevant provisions of the Personal Data Protection Act 2012. To learn more about ManpowerGroup's Global Privacy Policy, please visit https://www.manpower.com.sg/privacy-policy", "extensions": ["11 days ago", "$54K–$72K a year", "Full–time"], "detected_extensions": {"posted_at": "11 days ago", "schedule_type": "Full–time", "salary": "$54K–$72K a year"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIgKEVuZ2luZWVyaW5nfCBGdW5jdGlvbmFsfCBKdXJvbmcpIiwiY29tcGFueV9uYW1lIjoiTWFucG93ZXIgU2luZ2Fwb3JlIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiItelJfdkIxbHJyTkwydEg5QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnNDZW50cmFsIiwibGluayI6Imh0dHBzOi8vam9ic2NlbnRyYWwuY29tLnNnL2pvYi9wcm9qZWN0LW1hbmFnZXItZW5naW5lZXJpbmctZnVuY3Rpb25hbC1qdXJvbmctajNyNWJsNm1ocG5yeTByMWc4Mz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Service Chain Operations Project Manager", "company_name": "None", "location": "Singapore", "via": "via Jobs", "description": "Job Responsibilities. Coordinates, optimizes and harmonizes the efforts of the MNC across geography, stakeholders, external and partner efforts in the delivery units, Strongly cooperating with internal and external delivery parties in all phases of the delivery agreement to ensure a maximum of efficiency Harmonizes the cooperation and communication between delivery units of different cultures, time zones and languages. In case of a Customer escalation leads a service improvement program (taskforce), defines and implements measures in order to resolve Customer complaint. Concludes an Operational Level Agreement between SDM/Customer and between the Service Delivery Unit. Reviews these agreements on a regular basis and initiates amendments if required. Defines / improves the sourcing mix, where and how the service has to be provided. Designs and implements custom-made service processes based on Standards Push Standards to improve cost effectiveness in operation From professional point of... view drives, trains, monitors and supports the community of Local Operations Managers Rolls-out and operates global standards how to setup an international Service Delivery in terms of steering quality and costs in accordance to Corporate's governance Pinpoints best demonstrated practices within delivery units, standardize it and after that rolls-out for the whole client base in order to increase the quality of the services Designs and implements improvement measures based on his/her experience in order to increase customer satisfaction on the whole service chain. Participates actively in customer related projects and transitions. In collaboration with other supporting departments and cross-functions clarifies problems arising in the service processes. Suggests and implements resolution measures for the process issues. Follows-up the publications of call-center and service desk organizations (associations, communities, institutes etc.), attends professional events, and builds relationship with experts. Based on his/her network is able to benchmark the service delivery units against competitors and improve competitiveness of the own organisation. Internal analysis, calculation and planning of measures with the aim to increase the competitiveness of the delivery unit. Requirements. Relevant information technology degree and or relevant tertiary degree/diploma is beneficial At least 12 years in an IT Service Delivery Management / Operations Management role with significant client contact across all levels at senior management level within a technical environment (preferably within an outsourcing environment. Proven track record in client relations management is compulsory Formal training in management disciplines will be an advantage Sound ICT market know-how Competent working knowledge of a very broad range of ICT systems Extensive Technical Knowledge of end to end ICT supply Profound know-how of Corporate's SOP Good experience in presenting complex issues on Top Management Level Cost control and budget planning skills Solid and hands-on experience in performance analysis and project controlling. Person of high integrity, unbiased, decisive, results oriented and a keen sense of business ownership. Strong change management and project management skills Experience in quality frameworks, ITIL, PMP Certified Excellent communication – written, verbal and presentation skills (on executive level) Strong negotiation skills, decision making ability as well as presentation skills – even in critical situations Politically astuteness and conflict management skills Profound commercial knowledge Excellent networking skills - being able to build up excellent working relationships with the customer decision makers and influencers Analytical and problem solving attributes Exhibiting tact and diplomacy in dealing with sensitive customer issues Self-motivated and able to work independently and autonomously. Ability to quickly identify goals to be pursued, and to influence others towards these same goals Job Responsibilities. Coordinates, optimizes and harmonizes the efforts of the MNC across geography, stakeholders, external and partner efforts in the delivery units, Strongly cooperating with in Skills: Budget Preparation, Client Relationship Management, Communication, Conflict Management, Cost Control, Ict, Itil Certified, Management, Networking, Operations Management, Pmp, Presentation Skills, Problem Solving, Project Control, Project Management, Results Oriented, Service Delivery Experience: 10.00-15.00 Years", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZXJ2aWNlIENoYWluIE9wZXJhdGlvbnMgUHJvamVjdCBNYW5hZ2VyIiwiY29tcGFueV9uYW1lIjoiTm9uZSIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiNGNlNWdvdzI0cWlDUURQQkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIiwibGluayI6Imh0dHBzOi8vc2cuZmlkYW50by5jb20vam9icy9qb2Itb3BlbmluZy9pbmZvcm1hdGlvbi10ZWNobm9sb2d5LXByb2plY3QtbWFuYWdlcnMvc2VydmljZS1jaGFpbi1vcGVyYXRpb25zLXByb2plY3QtbWFuYWdlci0yNzg0OTY1ODQ/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Project Manager (IoT)", "company_name": "Sciente Inc", "location": "Singapore", "via": "via SCIENTE", "description": "Our client is seeking for an experienced Project Manager to lead end-to-end delivery of IoT project and solutions for major clients and government sectors.\n\nMandatory Skill(s)\n• Bachelor of Computing/Electrical Engineering/Computer Science/Information Systems or equivalent;\n• At least 5 years experience of relevant working experience;\n• Proven track record in managing projects with at least 1 full project life-cycle ;\n• Exposure and/or experience in Cloud, Smart City, IoT and Cyber Security related technologies and projects is a plus;\n• Possesses excellent interpersonal communication and analytical skills;\n• A fast-learner with a passion in picking up new domain knowledge;\n• Strong leadership skill to engage teams and confident to engage C-level, client and vendors;\n• An independent & meticulous out-of-the-box thinker who works well in teams.\n\nDesirable Skill(s)\n• PMP Certified.\n\nResponsibilities\n• Responsible for the overall project management from initiation to delivery;\n• Be the... point of contact for clients reporting to the Head of System Delivery;\n• Lead requirements and discussion with client on project ,progress and issues;\n• Managed partner, vendors, sub-contractors and ensure quality successful delivery;\n• Responsible for risk management, project budgeting and cash flow as well as milestone and implementation;\n• Review and implement program directives in the area of administration, financial, contracts and technical procedures;\n• Ensure safety measure are in place and adhere during execution;\n• Review and test product readiness prior to system and user acceptance tests;\n• Collaborate with HR and Procurement teams for the delivery of bill of materials and labour during execution;\n• Roll up sleeves and take other responsibilities as required", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIgKElvVCkiLCJjb21wYW55X25hbWUiOiJTY2llbnRlIEluYyIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiOEQ0SU9zdjh4OVdSTXNrbkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBTQ0lFTlRFIiwibGluayI6Imh0dHBzOi8vd3d3LnNjaWVudGUuY29tL3NjaWVudGUtaW5jL3RlY2hub2xvZ3ktam9icy82MDExL3Byb2plY3QtbWFuYWdlci0oaW90KS8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Project Manager (Banking Applications)", "company_name": "Randstad Singapore", "location": "Singapore (+1 other)", "via": "via Randstad Singapore", "description": "about the role\n\n-Manage project and execute system integration project plan in banking application development\n\n-Manage members and multiple vender relationship with all hardware / software vendors or service providers, when necessary, to complete all tasks as required and planned\n\n-Manage projects, including Asian regional projects and ensuring the completion of all processes and tasks as a project manager\n\n-Manage projects, which includes resolving issues, controlling vendors/ resources/ schedules, and preparing reports to Management, the Bank and Head Office for approval if required\n\n-Consult with the Bank and define system requirement for system development/ maintenance\n\nDesign infrastructure, if required, or helping members or vendors to design infrastructure to meet users or system requirements\n\n-Coordinating all processes to ensure that these are progressing smoothly for the Bank and developers/vendors, Head Office relevant development team\n\n-Strictly comply with policy and... procedures including Head Office System Development Rules.\n\n-System engineering for International Banking System’s In-house Application\n\n-Designing and developing\n\n-Specifying Application design based on requirement\n\n-Review of design documents delivered from vendors\n\nskills and experience required\n\nAt least 3 year project management experience of banking application software development is a must.\n\n-Knowledge and experience of SWIFT and ISO20022 project are preferred.\n\n-Knowledge and experience of FAST payment system project are preferred.\n\n- Knowledge and experience of transaction banking project are preferred.\n\n-Knowledge and experience of banking package software, such as ACBS, Eximbills and Flex cube are preferable.\n\n-Certification holder of project management, such as PMP is an advantage.\n\n-Coordination skills to handle various parties, such as both local and international clients, vendors and counterparts\n\nTo apply online please use the 'apply' function, alternatively you may contact Chloe Chen at chloe.chen(@)randstad.com.sg. (EA: 94C3609 /R1768253)\n\nskills\nno additional skills required\n\nqualification\nno additional qualifications required\n\nworking hours\nFull-Time\n\neducational requirements\nBachelor Degree", "extensions": ["Over 1 month ago", "$6K–$8K a month", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time", "salary": "$6K–$8K a month"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIgKEJhbmtpbmcgQXBwbGljYXRpb25zKSIsImNvbXBhbnlfbmFtZSI6IlJhbmRzdGFkIFNpbmdhcG9yZSIsImNvbXBhbnlfbWlkIjoiL2cvMTFnNzBiNTBtciIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Il9wVWFOeGRsbEstbkgwUklBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2UUJDcmNCUVU1VlgwNXhVVGRZZWtaZldGQjJkakpHZVVNemFGZHBRME0yVURZd2VtbFJSRzFVTUVOa2FWWlZORkZyZG1wSmNWRnJabXM0VTNCaFR5MXlOM2x1TFVVNWVFMVlZWFZWVlVSbFlWSXpWRkpHUlhoRFVFRjFkakJoZVZOemRsQktXbFZoWlRCQ2VEbE9SaTFLY1dRd1prUmpWQzFHUXpoamMxb3pjRjh0YTNCelNGOTFhRXBWY2xsWmVGcEZMWFJHZVZwTk1sOUpiakl6TkhKRVIwZDNha0ZFT1daRE1qUTJiMmRPWkRkTU5sbFFTRk5XVjJOQkVoUnBTSEZEV1UwdFVVOTBTRFV0WjFSNk5YRmtRUm9pUVU5TldWSjNRM1ZuZWpkT01FeEZXazVaYlZKSU5WVldZVU5wVm5JMU5teGtadyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzQ5IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFJhbmRzdGFkIFNpbmdhcG9yZSIsImxpbmsiOiJodHRwczovL3d3dy5yYW5kc3RhZC5jb20uc2cvam9icy9wcm9qZWN0LW1hbmFnZXItYmFua2luZy1hcHBsaWNhdGlvbnNfc2luZ2Fwb3JlXzM2NTAyMDE2Lz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Project Manager, Trustwave, Singapore, Singapore", "company_name": "Trustwave", "location": "Singapore", "via": "via BizLINKS Resources Pte Ltd", "description": "Employer Referral\n\nProject Manager at Trustwave --------------------------------------------------------------------------------------------------------- Trustwave is a leading cybersecurity and managed security services provider that helps businesses fight cybercrime, protect data and reduce security risk. Offering a comprehensive portfolio of managed security services, security testing, consulting, technology solutions and cybersecurity education, Trustwave helps businesses embrace digital transformation securely. Trustwave is a Singtel company and the global security arm of Singtel, Optus and NCS, with customers in 96 countries. For more information about Trustwave, visit https://www.trustwave.com Project Manager Primary Purpose Manage, define and implement IT infrastructure security projects and the quality and progress of these projects to ensure on time, effective project outcomes. Duties & Responsibilities As a project manager, manage infrastructure security deployment projects... involving security solutions such as firewalls, intrusion prevention/detection systems, VPN, authentication, content filtering, anti-virus, patch management, data loss prevention, SIEM, etc. To ensure the project tasks are monitored, track and complete on time and negotiate with the customer if there is any delay or/and gaps Manage internal project team members and the external vendor or/and partners Responsible for the project P&L, financial forecast and ensure the cost is within the budgeted cost The Ideal Candidate Should Possess Preferably a degree in IT equivalent qualifications with experience as project manager position in the SI industry At least 5 years’ experience in project management roles Experience as a technical lead in migration projects, which involve security, LAN/WAN and servers. Knowledge or experience in firewall, IPS, IDS, VPN, authentication, anti-virus, content filtering, patch management, cloud security, web & database security, data loss prevention & SIEM is a plus point Knowledge or experience in LAN internetworking, including hubs, switches, load-sharing equipment, and bandwidth optimizers is a plus point Knowledge or experience in OS-hardening, UNIX and Window platforms is a plus point PMP certification is required CISSP certification is preferred Excellent interpersonal, presentation, writing and communication skill Highly motivated and willing to learn new technologies and able to work under pressure Successful track record of managing (large size/complex) IT security solution implementation projects Distinct ability to communicate technology effectively and manage many security domains tracks Good project management skills Trustwave is an Equal Opportunity Employer of Minorities, Females, Protected Veterans, and Individuals with Disabilities. To All Agencies Please, no phone calls or emails to any employee of Trustwave outside of the Talent Acquisition team. Trustwave’s policy is to only accept resumes from agencies via the Trustwave Agency Portal. Agencies must have a valid fee agreement in place and they must have been assigned the specific requisition to which they submit resumes, by the Talent Acquisition team. Any resume submitted outside of this process will be deemed the sole property of Trustwave and in the event a candidate is submitted outside of this policy is hired, no fee or payment of any kind will be paid. Show moreOriginal Joblink: https://sg.linkedin.com/jobs/view/project-manager-at-trustwave-1991010358?refId=1c053e0c-8076-41df-9ce7-be04f27a0d47&position=9&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click ", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIsIFRydXN0d2F2ZSwgU2luZ2Fwb3JlLCBTaW5nYXBvcmUiLCJjb21wYW55X25hbWUiOiJUcnVzdHdhdmUiLCJjb21wYW55X21pZCI6Ii9tLzBuM3hqZjUiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJBeTA3VzNxQW5EOUktcXJOQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdDhCQ3FJQlFVNVZYMDV4VTFsTE4zZEpObGxqYlhNNVYwbDRTR1YzZW1vM056RkRhRmsyVlVGaWVuVmpNMUJhVUVac05GRlhUV1pDT1dwNE5FVlJXV1JEZEd4cVUwbHVPVGszVkVjM2QxRlNNbWRFVmxwd1luVmlYMEl5UW1FMlduVmpVM0Y0VjNoa1gxbzNUR2RRUjA5VlRWazBSR05IV0RGbVQweHJObkJGUlhoNU15MTZVM2xZWkRONVNFNTBOVWM1TlZkUlZFMTZOM1pKTkVOTWQycE9kVFF5YkZSM0VoUnBTSEZEV1UwdFVVOTBTRFV0WjFSNk5YRmtRUm9pUVU5TldWSjNRa05NVGxwZloxSlFTbmRTU1habVIwMWhSRmxOWlhWUk1GRm1VUSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzU3IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJpekxJTktTIFJlc291cmNlcyBQdGUgTHRkIiwibGluayI6Imh0dHBzOi8vd3d3LmJpemxpbmtzcmVzb3VyY2VzLmNvbS5zZy9pbmRleC5waHAvam9iLWxpc3RpbmdzLXB1YmxpYy81Ny1uZXR3b3JrLWVuZ2luZWVycy8yNDkzLXByb2plY3QtbWFuYWdlcj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Security Program Manager", "company_name": "Amazon", "location": "Singapore", "via": "via Monster", "description": "Job Description :\nAmazon Web Services (AWS) Infrastructure Operations Security is seeking a highly talented and motivated Security Project Manager to join our APJC team based from Bangkok, Thailand. The role is responsible for the design and installation of physical security systems including Access Control/Intrusion Detection and CCTV Surveillance systems.\nYou will also be responsible for the continuous review of existing standards and to stay abreast of developments in new technology that will enhance the physical security of AWS data centers and co-locations. You will work directly with the Cluster Security Manager (CSM), the Infrastructure Operations and Construction teams, and other internal customers, to integrate the business requirements into physical security systems design and implementation. Your work will include supporting the construction and deployment of physical security packages for remote AWS data centers and co-locations. You will also work closely with contractors... and vendors to ensure compliance with all security standards during the construction, testing and acceptance phases of the projects.\nThe ideal candidate for the role will have demonstrated the ability to work in all disciplines, at all levels; from technology research to system design and layout, oversight of construction and implementation, as well as maintenance and upgrades over the life of the system. You will have an in-depth knowledge of security technology, be innovative, highly organized, and will have demonstrated the ability to deliver results on time and within budget. The role may involve domestic and international travel and the ability to work autonomously is essential.\nRoles and Responsibilities\n· Responsible for remote non-traditional data center environments builds.\n· Up to 50% time of domestic and international travel across APJC regions might be required.\n· Installation of approved physical security system hardware, which includes access control devices, intrusion detection devices, and other components of data center physical security systems.\n· Design of a physical security system for data center expansion projects, subject to CSM's approval for implementation.\n· Preparation of security design documentation and bills of material for expansion projects for the purposes of pricing by approved vendors.\n· Review and quality assurance of vendor quotes along with the CSM.\n· Submission of complete and accurate vendor quote packages to the Infrastructure Technical Project Manager for inclusion in expansion project requisitions.\n· Project management of security system installation vendors in support of data center expansion projects.\n· Representative for physical security system acceptance, sign-off, and operational readiness validation in conjunction with the CSM.\n· Indexing and archiving of project close-out documentation.\n· Reporting performance metrics such as physical security system installation vendor service delivery performance and device performance as required.\nBasic Qualifications :\n· Must have the ability to read, write and communicate fluently and effectively in English, with both technical and non-technical individuals regarding physical security standards and designs.\n· 3+ years of experience working in Project Management related to construction or physical security.\n· Ability to manage programs/projects of medium to large scale that are complex in nature.\n· Ability to interpret program objectives and the compilation of and adherence to project timetables.\n· Proficient in all Microsoft Office applications.\n· Have a track record for being detail-oriented with a demonstrated ability to self-motivate and follow-through on projects.\nPreferred Qualifications :\n· BA/BS degree or higher in related field of architecture, engineering, or project management.\n· Fluency/competency in more than one language.\n· Certification with Lenel Access Control Systems.\n· PSP, CPP, PMP Certification.\n· Training in Crime Prevention Through Environmental Design (CPTED).\n· Subject Matter Expertise with Access Control, Intrusion Detection, and Video Surveillance Systems.\n· Data Center Experience.\n· Proficient in AutoCAD.\nAmazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer, and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, disability, age, or other legally protected status", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZWN1cml0eSBQcm9ncmFtIE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJBbWF6b24iLCJjb21wYW55X21pZCI6Ii9tLzBtZ2tnIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiRHc0NzJwTFN5UzktRUt2dkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXNrQkNvd0JRVTVWWDA1eFVYTXhRa00zZVcxTmFFWktORzFtU1VWSGIwTkJkVk53VjNkTVRHSkZabWd4Tkc1SGJGWjNkRlJVYzJOVU5IRlFibTEyYVU1M1gzbEhVVUkyUm01UVpuZ3pPWFJFYldKNE56UTFlVlZxVVZsWFdFMXlkalpNWTAxUlpWaHVRMlEyYjA5eGEzRnpRMDVPY0RNemFIVjVNMHBuVFRjMmN6TlFSV05YUVZaalowZHhRbE41TVc4U0ZHbEljVU5aVFMxUlQzUklOUzFuVkhvMWNXUkJHaUpCVDAxWlVuZENiRVpKTW0xWFFXVmZYM1JKWlZCaFQzWmlXbTltU21sbWVrZDMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY182NCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNb25zdGVyIiwibGluayI6Imh0dHBzOi8vd3d3Lm1vbnN0ZXIuY29tLnNnL2FtcC9qb2ItdmFjYW5jeS1zZWN1cml0eS1wcm9ncmFtLW1hbmFnZXItYW1hem9uLXNpbmdhcG9yZS0yNzQxODA1NS5odG1sP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:Google Sans,arial,sans-serif}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Management", "value": "GC18"}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Advertising and Marketing", "value": "GC03"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Media, Communications and Writing", "value": "GC20"}, {"text": "Transportation and Logistics", "value": "GC30"}, {"text": "Art, Fashion and Design", "value": "GC05"}, {"text": "Construction", "value": "GC09"}, {"text": "Education", "value": "GC11"}, {"text": "Human Resources", "value": "GC15"}, {"text": "Protective Services", "value": "GC23"}, {"text": "Property", "value": "GC24"}, {"text": "Science and Engineering", "value": "GC27"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "Project manager", "value": "project manager"}, {"text": "Program manager", "value": "program manager"}, {"text": "Manager", "value": "manager"}, {"text": "Delivery manager", "value": "delivery manager"}, {"text": "Project director", "value": "project director"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Senior", "value": "senior"}, {"text": "Consultant", "value": "consultant"}, {"text": "Coordinator", "value": "coordinator"}, {"text": "Deputy director", "value": "deputy director"}, {"text": "Director", "value": "director"}, {"text": "Group manager", "value": "group manager"}, {"text": "Management system", "value": "management system"}, {"text": "Operations", "value": "operations"}, {"text": "Programme manager", "value": "programme manager"}, {"text": "Scrum master", "value": "scrum master"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Services", "value": "services"}, {"text": "Vice president", "value": "vice president"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Engineering Services", "value": "/business/naics2007/5413"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Entertainment", "value": "/business/naics2007/71"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Management", "value": "/business/naics2007/55"}, {"text": "Real Estate", "value": "/business/naics2007/53"}, {"text": "Research", "value": "/business/naics2007/5417"}, {"text": "Retail", "value": "/business/naics2007/44"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": ".AB4Jjf.qPB6Vc{padding-right:11px}.qfpP8d{padding:7px 0 7px 11px}.S003Ke{flex:none}.ZoN4Lb{color:rgba(0,0,0,.54)}.nAXVG{color:#70757a}.IxQsL{color:rgba(0,0,0,.26)}.xFO1De{color:#fff}.ooFpK{color:rgba(255,255,255,.30)}.mtnwac{color:#4285f4}.WxeeKb{color:#34a853}.hIVRU{color:#f29900}.EXaTMc{color:#fbbc04}.sxn46d{color:#000}.gqMTF{color:#1a73e8}.zpn8Mb{color:#d93025}.dEUPmd{color:#1e8e3e}.PJNo1{color:#fbbc04}Actively Hiring", "value": "e"}, {"text": "Michael Page", "value": "/m/04cxldw"}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Randstad Singapore", "value": "/g/11g70b50mr"}, {"text": "NANYANG TECHNOLOGICAL UNIVERSITY", "value": "/m/0l49k"}, {"text": "GECO Asia", "value": "/g/11gk72_bt_"}, {"text": "Facebook", "value": "/m/0hmyfsv"}, {"text": "HP", "value": "/m/03mnk"}, {"text": "IoTalents", "value": "/g/11dxq187wm"}, {"text": "Jobline Resources Pte Ltd", "value": "/g/11gp2647pn"}, {"text": "NCS Group", "value": "/m/0282746"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Apple", "value": "/m/0k8z"}, {"text": "Avensys Consulting", "value": "/g/11g7022gjf"}, {"text": "Ceridian", "value": "/m/07f8h6"}, {"text": "Ensign InfoSecurity", "value": "/g/11g4jhymjr"}, {"text": "FUJITSU ASIA PTE LTD", "value": "/g/11g9mnp7dl"}, {"text": "Humanica Asia Pte. Ltd", "value": "/g/11h1y98c9z"}, {"text": "Kerry Consulting", "value": "/g/11c73vtzc8"}, {"text": "Marsh and McLennan", "value": "/m/053rw"}, {"text": "NSEARCH GLOBAL", "value": "/g/11dxpksll4"}, {"text": "NTT", "value": "/m/05mybp8"}, {"text": "National University of Singapore", "value": "/m/01q460"}, {"text": "OakTree Consulting", "value": "/g/11g70jfhtq"}, {"text": "Optimum Solutions (singapore) Pte Ltd", "value": "/g/11g70hkrbx"}, {"text": "Salesforce", "value": "/m/07btr5"}, {"text": "Standard Chartered", "value": "/m/02hszk"}, {"text": "TEKsystems", "value": "/g/11b6g4bkv0"}, {"text": "Teradyne", "value": "/m/04bzqp"}, {"text": "Thermo Fisher", "value": "/m/02pt04f"}, {"text": "Toshiba Tec Singapore Pte. Ltd", "value": "/g/11g9n9q547"}, {"text": "Trustwave", "value": "/m/0n3xjf5"}, {"text": "Wood Plc", "value": "/m/07vv9s"}, {"text": "Workiva", "value": "/m/0113m1rd"}, {"text": "A-it Software Services Pte Ltd", "value": "/g/11dxpy_gl_"}, {"text": "ABS Group", "value": "/g/11dxplj1z6"}]}]}