{"search_metadata": {"id": "6082795fa3f4ef48d5a47298", "status": "Success", "json_endpoint": "https://serpapi.com/searches/ac09af8f39220e90/6082795fa3f4ef48d5a47298.json", "created_at": "2021-04-23 07:38:07 UTC", "processed_at": "2021-04-23 07:38:07 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28IT+analyst%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=50", "raw_html_file": "https://serpapi.com/searches/ac09af8f39220e90/6082795fa3f4ef48d5a47298.html", "total_time_taken": 1.08}, "search_parameters": {"q": "(IT analyst) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "50"}, "jobs_results": [{"title": "Analyst, Network Technical Ops Job in Singapore | Jooble", "company_name": "American Express Company", "location": "Singapore", "via": "via Jooble", "description": "Network Solutions and Operations (NSO) is a critical organisation within American Express as it runs the Network used by our Global Partners (Acquirers and Issuers) to process card transactions. NSO also provides the platforms, defines the policies and creates exciting new products consumed by our Global Partners.\n\nThis job opportunity will reside within Network Certification & Servicing (NCS), which is an arm of NSO dedicated to certify and onboard new customers and products. This entails securely connecting our Proprietary Merchants, Processors and Network Partners to the American Express Network and certifying the authorisation and clearing messages developed by them before they are enabled in production. NCS also supports and certifies existing customers when deploying new and existing products such as EMV Chip Processing, Safekey, Quick Response Code, Mobile Wallets and Secure Remote Commerce, to name a few.\n\nGeographically, NCS operates and functions as a global organization... with hubs in locations such as Phoenix, UK, Gurgaon, Tokyo, Sydney and Singapore.\n\nWithin the above context, a Certification Analyst opportunity has arisen, to be based in Singapore, to manage certification projects requested by Amex customers, as well as managing internal initiatives that impact the certification processes.\n\nResponsibilities\n• Manage assigned projects related to the certification of link connectivity, financial settlement and authorisation messages that support new and existing payment products such as EMV Chip Processing, Safekey, Quick Response Code, Mobile Wallets and Secure Remote Commerce.\n• Manage the setup of file transfers between Amex customers and Amex.\n• Provide testing support and technical consultancy to internal and external customers pertaining to Amex technical specifications and certification processes.\n• Develop and document certification processes and procedures for new initiatives.\n• Work with various American Express Technology groups to support the installation of network connectivity and implementation of authorisation and settlement solutions.\n• Lead and drive regional or global internal projects, specifically ensuring that NCS test tools, test plans and certification processes are updated or enhanced.\n• Participate in calls that can be held outside of office hours in order to support regional or global projects that span different time zones.\n• Support all project types – simple or complex to help the team manage project volumes throughout the year.\n• Participate or lead employee related activities within the local campus.\n\nMinimum Qualifications\n• Knowledge of Payments industry including but not limited to EMV, Express Pay, SafeKey, mobile wallets, POS products, is essential.\n• Can readily understand technical specifications, decipher the technical contents and use that knowledge to validate test results. Can independently identify root causes that can arise during certification & resolve themShow phone number;\n• Knowledge of telecommunication and networking components such as TCP/IP & SFTP, Router capabilities, VPN and Web Services, are pluses.\n• Demonstrates strong relationship management skills used to influence without authority both internally and externally, across multiple international territories with different cultural considerations.\n• Must be able to communicate effectively both orally and in written form, with internal and external customers at both a technical and business level.\n• Highly self-motivated, growth mindset and results driven with the ability to work without supervision in a matrix organization and demonstrating strong teamwork.\n• Ability to work flexibly in an ever-changing environment, demonstrating adaptability & a keen interest to learn.\n• Proven business analysis and project planning experience including strong problem solving and analytical skills.\n• Proven ability to support multiple projects simultaneously in a fast paced, multi-time zone environment.\n• Must be willing to work outside office hours whenever the project calls for it.\n• A minimum of 3 years of experience working in the payment industry with hands on payment product certification experience being essential.\n• Ability to speak Mandarin, Japanese or both, are pluses.\n\nOffer of employment with American Express is conditioned upon the successful completion of a background verification check, subject to applicable laws and regulations.\n\nAmerican Express has been awarded Aon Hewitt Best Employer Singapore six times. Join us and you’ll soon see why.\n\nAs an employee, you can expect challenging work, with purpose. Be more than just your job. Be the voice of inspiration and transform the way the world does business for a living. By joining American Express, you are choosing to become a part of the dynamic team that is recognized as Singapore's \"Best Employer 2018\".\n\nWhy American Express?\nThere’s a difference between having a job and making a difference.\n\nAmerican Express has been making a difference in people’s lives for over 160 years, backing them in moments big and small, granting access, tools, and resources to take on their biggest challenges and reap the greatest rewards.\n\nWe’ve also made a difference in the lives of our people, providing a culture of learning and collaboration, and helping them with what they need to succeed and thrive. We have their backs as they grow their skills, conquer new challenges, or even take time to spend with their family or community. And when they’re ready to take on a new career path, we’re right there with them, giving them the guidance and momentum into the best future they envision.\n\nBecause we believe that the best way to back our customers is to back our people.\n\nThe powerful backing of American Express.\nDon’t make a difference without it.\nDon’t live life without it.\n\nReqID: 21004498\nSchedule (Full-Time/Part-Time): Full-time\nDate Posted: AprShow phone numberAM", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBbmFseXN0LCBOZXR3b3JrIFRlY2huaWNhbCBPcHMgSm9iIGluIFNpbmdhcG9yZSB8IEpvb2JsZSIsImNvbXBhbnlfbmFtZSI6IkFtZXJpY2FuIEV4cHJlc3MgQ29tcGFueSIsImNvbXBhbnlfbWlkIjoiL20vMDF3NmR3IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiUmpEdm45Q3Y2Z3FySTMxdkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRW93Q0Nzd0JRVTVWWDA1eFUyVk1RMmgzTlRGVGFrdzBja2hTU0V4ZmNYVkVVM0JxZEhkRFptaGliSGx4YzJNdFZHbEVTV2hHVFUxRFJrSm9UVGh5TjJGbVRUVkxkVm94UkY5WU5qWlpaRFE0YlRGWk5VbEdWWFZpWlY5emVWVkdlbFJCZFRneVFrWklSa2RsTldSclRsWmpSa1pvYkZoaFkzRllkWFZ0Y3pNNWRtMXJSalZaVm5KcGVVWm9XSHBZYlZRdFdFeFBRakIzUzNOalZXaGhYMnQ0YlZGT2JWaFVRbEZVTVRoNFJuaDZNbGR2Tm01a1pIVk9Va04xZHpGNlVtVklWbTU1T0ZkWWFFdHROWE5LVVdObUVoZFlNMjFEV1VscVZFZE9Na1k1VUhkUWJVbFRaM2xCTkJvaVFVOU5XVkozUVVwdVZUSTVja1ZVVW0xSGNIUnhSa3N6Y2pWYVRIQTNWRXhDUVEiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY183IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvb2JsZSIsImxpbmsiOiJodHRwczovL3NnLmpvb2JsZS5vcmcvamRwLy04MDgzNjAyMTMwOTg5Mjc2NjI3L0FuYWx5c3QlMkMtTmV0d29yay1UZWNobmljYWwtT3BzLVNpbmdhcG9yZT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Security Analyst at SITA", "company_name": "SITA", "location": "Singapore", "via": "via BizLINKS Resources Pte Ltd", "description": "Security Analyst at SITA\n\nJob Description\n\nAs Security Analyst, you will work within the Security Operation Center (SOC) on identifying/evaluating risks, conduct log analysis and act upon security threats across a complex and disperse IT estate. You will carry out threat analysis and handling process to ensure the efficient and timely mitigation of security threats, as well as understanding the threats' risks and potential business impacts of both threats and mitigation measures. By leveraging the SIEM and the current security toolset, the SOC team members are expected to investigate security issues and conduct root analysis, as well as resolving or escalating security incidents. Their responsibilities also involve communicating the agreed action plan and to do the follow-up with the resolver groups, clients and production teams. The world is changing. Are you ready to define with future of travel with us? What You Will Do Monitoring security logs sources and alerts from the SIEM and... other threat detection systems for threats activity. Interpreting, conducting analysis and making recommendations for resolution. Hunting potential internal and external threats and developing detection mechanisms and reports. Handling security incidents in line with the incident response processes. Assuring the prompt and adequate follow-up on priority action items with resolver groups. Producing security incidents reports and recommendations. Following, maintaining and helping in the evolution of the SOC processes and procedures, including use case, SOP, etc. Working with resolver groups to evaluate and recommend new security practices and solutions. Providing security advices and promoting security awareness to other IT teams and clients. Working actively on evolving our threats detection and team efficiency by acting on noise and false positive. Helping in the production of threat intelligence and IoC by leveraging threats information from past incidents, sandboxes reports, malware reversing and data forensic. Who you are Significant experience (3 years +) of working within a mature SOC organization or as a security threat analyst in an equivalent security environment. Experience in using SIEM technologies, endpoint protection, IDS and other security technologies. High level of analytical and problem-solving skills. Mini mum of2-3 of experience in information technology in Windows servers, Linux or network. Good understanding of system, and application logs from a variety of platforms, from firewall, domain controllers to IDS, etc. Technical expertise in multiple security technologies would be an advantage including security incident handling experience. Good knowledge of threat intelligence data, IoC, threat actors, kill chain, Stix/Taxii, etc. Having experience in the pen testing/ethical hacker field is a plus. Functional skills with regex, IDS signature, SPL and SQL is a plus. Skills in network analysis, sandboxing, malware reversing or forensic is an asset. Strong knowledge of vulnerabilities, CVE, 0day and their potential impacts. Keeping aware and continually informed of the worldwide security landscape new threats, actors, du jour attack, as well as the new security technologies and products. Ability to comprehend the priority on enabling the business, while working on security incidents mitigation/containment and possible impacts on the production environment. Strong customer/client focus, interact with a variety of stakeholders in a well-mannered, positive, and professional way, and building long-term relationships. Strong written/verbal communication skills. Ability to effectively prioritize and execute tasks in a high-pressure environment. Experience with IT compliance assessments (ISO 27000 etc.). Certified Information Systems Auditor Global Information Assurance Certifications (GIAC) e.g. Certified Incident Handler (GCIH), Certified Intrusion Analyst (GCIA), Certified Enterprise Defender (GCED) or other relevant GIAC certifications. What We Offer SITA's workplace is all about diversity many different countries and cultures are represented in our workforce, and colleagues who've been working here for decades collaborate with those just out of college and early in their careers. SITA is a place of change and constant improvement, where we're always pushing ourselves to find better ways of doing things smarter, quicker, easier, for us and our customers and for their customers too. And we offer all the good stuff you'd expect like holidays, bonus, flexible benefits, medical policy, pension plan and access to world class learning. Welcome to SITA SITA is the world's leading specialist in air transport communications and information technology. We don't just connect the global aviation industry. We apply decades of experience and expertise to address almost every core business, operational, baggage, and passenger process in air transport. We design, build, and support technology solutions all with one vision to create easy air travel every step of the way. As an organization, we cover 95% of all international air travel destinations and work with over 2,800 air transport and government customers in every corner of the globe. Are you ready to explore the opportunities? Keywords SOC Engineer, Security Analyst, Security Operations Centre In case of issues with uploading your CV or accessing the application system, please contact us @ This email address is being protected from spambots. You need JavaScript enabled to view it. document.getElementById('cloak7bb78316797eff230ef1482694a18a12').innerHTML = ''; var prefix = 'ma' + 'il' + 'to'; var path = 'hr' + 'ef' + '='; var addy7bb78316797eff230ef1482694a18a12 = 'careers' + '@'; addy7bb78316797eff230ef1482694a18a12 = addy7bb78316797eff230ef1482694a18a12 + 'sita' + '.' + 'aero'; var addy_text7bb78316797eff230ef1482694a18a12 = 'careers' + '@' + 'sita' + '.' + 'aero';document.getElementById('cloak7bb78316797eff230ef1482694a18a12').innerHTML += ''+addy_text7bb78316797eff230ef1482694a18a12+''; Profession Service Operations Work Location Asia Pacific-Singapore-Singapore Schedule Full-time Job Posting Jan 25, 2021, 14906 AM Show more\n\nOriginal Joblink : https://sg.linkedin.com/jobs/view/security-analyst-at-sita-2403637763\n\nGoogle Company: https://www.google.com/search?q=Security%20Analyst%20at%20SITA", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZWN1cml0eSBBbmFseXN0IGF0IFNJVEEiLCJjb21wYW55X25hbWUiOiJTSVRBIiwiY29tcGFueV9taWQiOiIvbS8wNmwyMHoiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJOZ0oteVlEMEVZaEFSMGJUQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFc3dCQ293QlFVNVZYMDV4VW5WNmMybHhhVVpNYzNaRmVURldVVlZ1UnpSaVNVRk1NRlJ5VFhGUmVGQmFiRlJPZW5Zd1VFMVFXVzEwV0U1NGNWWmtkMGRLZFRkblRHOUdiRVZQWldoRWRIVTVPWHBDYUZOaFIwcE1VRFk0VlV4b1pYZDBUVlZmTkdoR1JVcE9VMWgxYVROS1dpMU5kRkJQVFhSSVZFTlJVWFJFV2xOQ05USnVZWEZmUjJJNFYwMHhPRk1TRjFnemJVTlpTV3BVUjA0eVJqbFFkMUJ0U1ZObmVVRTBHaUpCVDAxWlVuZENTbkZsWWxOU2NqWjZkR0UyVUhNdFZGUm1ha2g2V0RaMlkzTjMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18xNCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCaXpMSU5LUyBSZXNvdXJjZXMgUHRlIEx0ZCIsImxpbmsiOiJodHRwczovL3d3dy5iaXpsaW5rc3Jlc291cmNlcy5jb20uc2cvaW5kZXgucGhwL2pvYi1saXN0aW5ncy1wdWJsaWMvOTQtc2VjdXJpdHktZW5naW5lZXJzLzUyNTMtc2VjdXJpdHktYW5hbHlzdC1hdC1zaXRhP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Principle Business Analyst, Omni Channel APAC Job", "company_name": "Boston Scientific", "location": "Singapore", "via": "via Jobs At Boston Scientific", "description": "Purpose and Passion • Comprehensive Benefits • Life-Work Integration • Community • Career Growth\n\nAt Boston Scientific, you will find a collaborative culture driven by a passion for innovation that keeps us connected on the most essential level. With determination, imagination and a deep caring for human life, we’re solving some of the most important healthcare industry challenges. Together, we’re one global team committed to making a difference in people’s lives around the world. This is a place where you can find a career with meaningful purpose—improving lives through your life’s work.\n\nAbout the role:\n\nDigitization is the key strategic direction to transform the commercial operations model of Boston Scientific to provide exceptional customer experience and deliver better patient outcome to drive strong business growth.\n\nThis role will be responsible for the analysis, setup, and execution of various Omni Channel initiatives with the Boston Scientific APAC region to meet the... business needs of the company. This role supports the design and configuration of Omni Channel solutions and is also responsible for deploying a system that meets the business strategy across business units and franchises, executes testing, and writes configuration and/or technical documentation. This individual will be required to communicate and coordinate with business management, project executives, Marketing and Sale organization, and Distribution Partners to ensure appropriate integration of processes across the organization. The role collaborates with the central capability team, and division heads of the assigned area, to support the business needs of the company.\n\nKey Responsibilities:\n• Drive the deployment of Omni Channel solutions from identifying business opportunities, evaluation through implementation to support end-to-end Omni Channel business processes.\n• Works with Business and Technical resources to design and create Boston Scientific APAC’s end-to-end Omni Channel business process flows, technical solutions, and integration with 3rd party tools.\n• Participate in all phases of the solution delivery including the creation of functional specifications, creation of technical specifications, data mapping, test planning, test management, test execution, collaborate with business function to provide training and deployment; consult with technical analysts and developers as needed to develop customized solutions\n• Facilitate requirements gathering sessions with all levels of business and technical teams.\n• Coordinate testing activities associated with any new development or modification to any systems or business processes directly or indirectly associated with the end-to-end Omni Channel business process.\n• Continually evaluate the current business process. Demonstrate thought leadership in the Omni Channel space by continuing to evaluate current capabilities to identify new opportunities that improve the business process and the supporting systems.\n• Work with the business teams to become a highly sought-after strategic business partner.\n• Collaborate with the data science team to quickly propose and work to identify capability gaps, identify plausible solutions, develop prototypes, and implement new functionality based on business needs.\n• Provide ad hoc training and consulting to business users as required in both run and maintain activities, such as remedial training, issue resolution, etc.\n• Contribute to the evaluation, implementation, and ongoing use of 3rd party vendor solutions associated with the end-to-end Omni Channel business process.\n\nWhat we’re looking for in you:\n\nKey Skills & Experiences:\n\nTo be successful, you should be an experienced Business Analyst with the following skills:\n• Bachelor’s degree in computer science/information technology or equivalent\n• 8+ years of experience with leading exploratory business requirements, solution validation, and design workshops with 3+ years of experience working with E-commerce, or more accurately, Omni Channel solutions.\n• Experience in enhanced content delivery, asset transformation management, and digital content analysis\n• 5+ years of practicing in data management and data governance\n• Experience working in the healthcare industry\n• Ability and proven track record in applying agile framework with a solution-driven approach\n• Demonstrated skill in Data configuration/governance, channel mapping, base syndication/management to enhanced content, workflow management, and reporting automation\n• Ability to engage various stakeholders in a multination environment virtually.\n• Ability to create and meet timelines cognizant of business needs and constraints.\n• Highly self-motivated, driven work ethic, keen attention to detail, and exceptional customer service orientation.\n• Ability to collaboratively work directly with distributors, internal business partners, outside consultants, and IT team members\n• Strong communication skills including the ability to communicate technical information understandably to non-technical audiences through writing and presentations.\n• Ability to multi-task and prioritize in a fast-paced environment.\n• Strong analytical skills; ability to perform system analysis and draw conclusions by relating information from different sources, including root-cause analysis and issue resolution.\n\nPreferred Qualifications\n• Hands-on experience in putting machine learning into business operations\n• Hands-on experience in using RPA to deliver business objective\n• Hands-on experience with Adobe Experience Manager\n• Hands-on experience with Adobe Captivate Prime\n• Understanding of AWS and SFDC platform\n• Certified Scrum Product Owner and/or Certified Scrum Master\n• 5+ years Working in a global organization within a multi nation company\n\nThe position is on local employment contract ONLY\n\nAbout us\n\nAs a global medical technology leader for more than 35 years, our mission at Boston Scientific (NYSE: BSX) is to transform lives through innovative medical solutions that improve the health of patients. If you’re looking to truly make a difference to people both around the world and around the corner, there’s no better place to make it happen.\n\nBoston Scientific is an Equal Opportunity Employer – Race, Color, Religion, Sex, Sexual Orientation, Gender Identity, National Origin, Disability, Veteran\n\nBoston Scientific is proud to be recognized for our innovations that impact patients' lives, our performance as a company, our workplace culture and our contributions to communities around the world. Some of our recent accolades include:\n• Forbes Most Innovative Companies (2018)\n• Forbes list of World's Best Employers (2018)\n• FORTUNE World’s Most Admired Companies (2018, 2017, 2016)\n• Glassdoor’s Highest Rated CEOs (2018, 2017)\n\nFor more information, please visit us at\n\nVisit www.bostonscientific.com to learn more and apply", "extensions": ["16 days ago", "Full–time"], "detected_extensions": {"posted_at": "16 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcmluY2lwbGUgQnVzaW5lc3MgQW5hbHlzdCwgT21uaSBDaGFubmVsIEFQQUMgSm9iIiwiY29tcGFueV9uYW1lIjoiQm9zdG9uIFNjaWVudGlmaWMiLCJjb21wYW55X21pZCI6Ii9tLzA0czZoMCIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Ik14M0wwdkJaUGcya1VYRHZBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2Y0JDcmNCUVU1VlgwNXhVMFJYUVd4dk1tdG1RMFl4TWs5MmJFWTFWa055WnpsWVlVZzRORFZ4ZGkxSVgxUnBjRTg0WlhGclkzTnZZV0oxUTFkR1ZFSmFRMHMxYUVGamRVVnhiWHAzV1d3NFZ6STFXalJZYWpSR2RHMXZOWFJUWVdKT2MyNUxjWFU1UkZWa1NrUlRPRXB1Tm05d09VOTNkV0kyV0dwMVZVUkliVTVVZDI1VVNXZ3RjMmxhVm1Jek1EQnJSVzAxTVdWS2NVVm5jWGhhZGpaQ09WZG5kWGRVUzFGTVV6UmpWRXBVVUhkVVpGOWpNbXMzYUZSUkVoZFlNMjFEV1VscVZFZE9Na1k1VUhkUWJVbFRaM2xCTkJvaVFVOU5XVkozUTFoWVVHdE1RbUZPWmtrdGMyMUpVMHRHYVRWeFZrTkVVSHBuWnciLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18yMSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIEF0IEJvc3RvbiBTY2llbnRpZmljIiwibGluayI6Imh0dHBzOi8vam9icy5ib3N0b25zY2llbnRpZmljLmNvbS9qb2IvU2luZ2Fwb3JlLTAxLzczMDc4OTMwMC8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Data Analyst - Singapore", "company_name": "EngageRocket", "location": "Singapore (+1 other)", "via": "via NodeFlair", "description": "We are looking for a passionate certified Data Analyst. The successful candidate will turn data into information, information into insight and insight into business decisions.\n\nData analyst responsibilities include conducting full lifecycle analysis to include requirements, activities and design. Data analysts will develop analysis and reporting capabilities. They will also monitor performance and quality control plans to identify improvements.\n\nResponsibilities\n• Collaborate with stakeholders from Marketing, Sales, People Science, Product, Customer Success and Engineering to understand their needs/pain points\n• Interpret data, analyze results using statistical techniques and provide ongoing reports\n• Design solutions to be used for strengthening marketing and/or product for prospects and customers, including but not limited to developing and maintaining visualisations, reports, and metrics using data from multiple systems (G Suite, Hubspot, EngageRocket, etc.) that communicate... information effectively using Tableau / Metabase or similar tools\n• Identify, analyze, and interpret trends or patterns in complex data sets\n• Filter and “clean” data by reviewing raw and processed data tables to locate and correct code problems\n• Work with management to prioritise business and information needs\n• Locate and define new process improvement opportunities\n\nRequirements\n• At least 2-3 years working experience as a data analyst or business data analyst\n• Technical expertise regarding data models, database design development, data mining and segmentation techniques\n• Strong knowledge of and experience with reporting packages (Business Objects etc), databases (SQL etc), programming (XML, Javascript, or ETL frameworks)\n• Knowledge of statistics and experience using statistical packages for analyzing datasets (Excel, python, R, etc)\n• Analyse Web Application data and suggest actionable insights for improvements\n• Strong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracy\n• Strong communications skills: adept at queries, report writing and presenting findings\n• BS in Mathematics, Economics, Computer Science, Information Management or Statistics", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEYXRhIEFuYWx5c3QgLSBTaW5nYXBvcmUiLCJjb21wYW55X25hbWUiOiJFbmdhZ2VSb2NrZXQiLCJjb21wYW55X21pZCI6Ii9nLzExYzczcDV4OTciLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJtNEN4Rmw5VTBlMmxsVGZlQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUlCQ3FJQlFVNVZYMDV4VXpGYWNWUkVXakJmYXpGNmQzVklZMDVXYXkxUlJXMURTSFZrVkdGNFNFNUxXRlU1TTFGTVREZEtkR2xCUTJORVFUWXpObGRCYTBGdFNVMU5PV1UzVjNJeGIxOXRXV3RsWTJKd1ExWlpOVmRsY1ZKTVEySkpRbEpGTnkxeVdFTlVPSFowYVdvMVIwNVRWbEIyVXpsWmVsUndWVXhZTWswNFdqTmtjazlPTTIwd2NGTjFSMTlIVFdGdVYyWmFNWHBXYjJ4SVNXcEVZMWt0VW05M0VoZFlNMjFEV1VscVZFZE9Na1k1VUhkUWJVbFRaM2xCTkJvaVFVOU5XVkozUTJoUlJWcDZaM0IzY2xwdGEyTjVXRkZyU1ZveVQyRnhkR0ZwVVEiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18yOCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBOb2RlRmxhaXIiLCJsaW5rIjoiaHR0cHM6Ly8zLjEuMC4xMjMvam9icy9saXN0aW5ncy84MTI0P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Business Intelligence Analyst (on-going project for a cosmetics leader / digital marketing)", "company_name": "Forizons", "location": "Singapore", "via": "via Meet Jobs", "description": "About the company\n\nWherever you are, whatever the nature of your business, Forizons helps you to improve your end-to-end supply chain performance\n\nLocation\nFrance\nIndustries\nConsulting\nEmployees\n11 – 50\n\nJob description & requirements\n\nProject undergoing for a global leader in cosmetics.\n\nWorking directly for the digital marketing department\n\nJob Responsibilities\n\nWork directly with business users and stakeholders to understand the business needs and translate business requirements into detailed requirements documentation\nInteracts regularly with senior management level stakeholders to provide periodical project status updates, raise risks and issues encountered in the project.\nWork with different business owners and able to communicate seamlessly between the business and the back end IT team,\nInteracts regularly with senior management level stakeholders to provide periodical project status updates, raise risks and issues encountered in the project.\nCoordinate defects clarification... triage and resolution with IT team.\nEmploy best practices during requirements gathering and documentation stages.\nCoordinate and perform execution and validation of test cases with stakeholders for user acceptance testing, training, and obtaining project signoffs.\nJob Requirements\n\nDegree holder in Computer Science, Information Technology, Business or related area\n2-3 years strong experience in business analysis and requirements gathering and documentation.\nExperience working on various digital transformation projects, and familiar with the digital marketing ecosystem.\nSolid analytical skills to convert findings into strategic business recommendations based on the rapidly changing business environment.\nKnowledge of data warehouse modeling and business intelligence concepts\nCertification on any BI tools is preferred (DOMO, Power BI, Tableau & etc)\nKnowledgeable in handling data process via various methods: ETL, Query, SQL. Fluent in coding language is a plus\nExcellent verbal and written communication skills and the ability to interact professionally with diverse group of stakeholders\nGood team player and able to work independently.\nFluent in both written and spoken English.\nRequired skills\n\nDigital Marketing Business Analysis Business Intelligence Data Visualization Data Analysis\nCulture\n\nWhat’s it like working at Forizons?\n\nAt Forizons, we are driven, nurturing, collaborative, passionate and innovative.\n\nBenefits and perks of working with us include:\n\nCompensation: Bonuses, Competitive salaries\nProgression: Professional development\nWelfare: Vacation time\n\nOur consulting practice focuses delivering results to our clients beyond reports and slides. We believe that hands-on implementation is the key to success for both our clients and ourselves.\n\nWith Forizons you can expect a flexible approach to our projects. We can be independent problem solvers, (temporary) managers in your organization, trainers or digital tool providers", "extensions": ["Over 1 month ago", "$4K–$5K a month"], "detected_extensions": {"posted_at": "Over 1 month ago", "salary": "$4K–$5K a month"}, "job_id": "eyJqb2JfdGl0bGUiOiJCdXNpbmVzcyBJbnRlbGxpZ2VuY2UgQW5hbHlzdCAob24tZ29pbmcgcHJvamVjdCBmb3IgYSBjb3NtZXRpY3MgbGVhZGVyIC8gZGlnaXRhbCBtYXJrZXRpbmcpIiwiY29tcGFueV9uYW1lIjoiRm9yaXpvbnMiLCJjb21wYW55X21pZCI6Ii9nLzExaGJtM2t5emQiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiItUzQ2WGkwQ19nVU92bkFOQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUlCQ3FJQlFVNVZYMDV4VkhnMFQwWTVkMnR1YTNSMmIyZFFTbDlyTFhwRGJEbGhSblJJWVdodGQycGhkVVZHWVRCRFRGaGFOUzE1YTE5NlIwMVplbkpOY1RsUGRYUTBWa1pqUjFWdE9YUllWVXRUU3kxU1RtVlBaM0UzWjBWVWNsRlRNMmRuTWtsMVkzWjRXRkpKUW5OQlltWmFPSEZ3TTJkcFNsSlpVamsxYjAxRFh6QjNUSEZWV0Y5NlRuQXpNMmxXZERabE1YbFZVemQ0TkRoT2JWTlJTalIwZG5oQkVoZFlNMjFEV1VscVZFZE9Na1k1VUhkUWJVbFRaM2xCTkJvaVFVOU5XVkozUTNKalVWOXdMVWRxZEhWMlZHcHZTVWxZTVVaTGJrVTFTMFpTWnciLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18zNSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNZWV0IEpvYnMiLCJsaW5rIjoiaHR0cHM6Ly9tZWV0LmpvYnMvZW4vam9icy8yNjA4Ni1idXNpbmVzcy1pbnRlbGxpZ2VuY2UtYW5hbHlzdC1vbi1nb2luZy1wcm9qZWN0LWZvci1hLWNvc21ldGljcy1sZWFkZXItZGlnaXRhbC1tYXJrZXRpbmc/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Privacy Analyst, APAC, China and India", "company_name": "Takeda Pharmaceutical", "location": "Singapore", "via": "via Takeda Careers", "description": "By clicking the “Apply” button, I understand that my employment application process with Takeda will commence and that the information I provide in my application will be processed in line with Takeda’s Privacy Notice and Terms of Use. I further attest that all information I submit in my employment application is true to the best of my knowledge.\n\nJob Description\n\nABOUT TAKEDA\n\nAt Takeda, we are transforming the pharmaceutical industry through our R&D-driven market leadership and being a values-led company. To do this, we empower our people to realize their potential through life-changing work. Certified as a Global Top Employer, we offer stimulating careers, encourage innovation, and strive for excellence in everything we do. We foster an inclusive, collaborative workplace, in which our global teams are united by an unwavering commitment to deliver Better Health and a Brighter Future to people around the world through leading innovation in medicine in our four core therapy areas of... Oncology, Gastroenterology (GI), Rare Diseases and Neuroscience, plus Plasma-Derived Therapies (PDT) and Vaccines.\n\nDiscover more at www.takeda.com.\n\nPURPOSE\n• Proactively and independently manage the risk of Takeda’s handling of personal data across the organization, assess privacy risks, and maintain compliance with privacy legislation.\n• Serve as a Privacy Subject Matter Expert (SME), serving all business units and functions globally.\n\nRESPONSIBILITIES\n• Evaluate and advise the business globally on privacy risks associated with new technologies, programs and systems.\n• Conduct privacy impact assessments.\n• Serve as point of contact for business units and functions in relation to records, drafting of privacy notices and general privacy guidance and support.\n• Manage internal and external requests to the Privacy Office, including from regulators, data subjects and internal stakeholders.\n• Ensure timely response to data subject requests and maintain compliance documentation.\n• Support the investigation and resolution of privacy incidents.\n• Support delivery of privacy training initiatives.\n• Conduct privacy related vendor due diligent assessments.\n• Support implementation of new privacy rules and regulations.\n• Develop and deliver privacy guidance to client base and training and awareness campaigns to large audiences globally.\n• Interact with outside counsel, regulatory authorities and experts as appropriate.\n• Collaborate with privacy and non privacy colleagues to develop relationships and accomplish goals.\n• Participate in external expert networks and groups to maintain level of expertise and for benchmarking purposes.\n• Interact with data protection regulators as required.\n\nQUALIFICATIONS\nEducation and Experience\n• Bachelor degree, preferably in Law, Computer Science, Business or related field.\n• Minimum of 3-5 years' professional experience in Privacy. Experience in the pharmaceutical / health sector is advantageous.\n• Privacy certifications like IAPP-CIPM / CIPT / CIPE or equivalent are advantageous.\n• Demonstrated professional SME privacy expertise applied in programs, training and tools\n• Fluent in English.\n\nCapabilities and Behaviors\n• Strong analytical and organizational skills and ability to prioritize.\n• Strong verbal and written communication skills.\n• Team player with strong communication and interpersonal skills, including a demonstrated ability to work with various functions and levels within an organization.\n• Ethical, with the ability to remain impartial and report all non-compliance\n• Ability to act independently, globally and with required cultural awareness savviness.\n• Ability to provide support across all geographic and functional areas.\n• Ability to advise on risk based decisions involving reputational and financial risk globally and to act with a high degree of autonomy.\n• Have an interest in piloting new approaches to improve privacy services in a risk appropriate manner.\n• Ability to navigate successfully in a highly matrixed global work environment.\n• Ability to assimilate and understand privacy and related laws in every country Takeda operates, and translate those requirements into harmonized practices with understanding of important differences.\n\nLocations\n\nSingapore, Singapore\n\nWorker Type\n\nEmployee\n\nWorker Sub-Type\n\nRegular\n\nTime Type\n\nFull time", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcml2YWN5IEFuYWx5c3QsIEFQQUMsIENoaW5hIGFuZCBJbmRpYSIsImNvbXBhbnlfbmFtZSI6IlRha2VkYSBQaGFybWFjZXV0aWNhbCIsImNvbXBhbnlfbWlkIjoiL20vMDFybTR0IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoidjl0ZVZHS3A0cWdhUnd1UUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZjQkNyY0JRVTVWWDA1eFZFeEZNREkwY2tsbE1uVTRWbTlRVkRGTFRIUkZaa2N3WlVkdlpXbEVaeTFRVlcxdlFXUkxhMjlaYUhwTmFpMVlabkJ3VldjMmJXSllOMnBDYTFGcFNEQlhjek5pYnpaa2QwWkhhbXBwZWt4b1pqVnlUa3RtUlZnNU9GQTVZVWRoV1hCTE1qQXpUbWg2YzI1SmNqRkJiREkxV2toWVdVNDFhMDlXVXpKcWRFVldjR2xqY1RCYVZIVnVPV294TUd0UU5tZGpPRWQwZVRjeVVIYzJaMVJKT1VKemFWTlBaR0pQTjJGNFQwSm1OaTAwRWhkWU0yMURXVWxxVkVkT01rWTVVSGRRYlVsVFozbEJOQm9pUVU5TldWSjNRVFZNU25SeldUWlZiMGxZUVdremFtUjFRbmwwUVcwNFQwVkVRUSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzQzIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFRha2VkYSBDYXJlZXJzIiwibGluayI6Imh0dHBzOi8vd3d3LnRha2VkYWpvYnMuY29tL2pvYi9zaW5nYXBvcmUvcHJpdmFjeS1hbmFseXN0LWFwYWMtY2hpbmEtYW5kLWluZGlhLzExMTMvNDg5ODgyNTg1Nj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "System Analyst, IT (SAP ABAP)", "company_name": "Venture Corporation Limited", "location": " (+1 other)", "via": "via Venture Corporation Limited", "description": "Responsibilities :\n• Responsible for performing daily SAP helpdesk support, trouble-shooting on SAP reports and EDI/B2B issues for local & regional operations.\n• Responsible for all SAP ABAP development, EDI and B2B-BizTalk development and enhancement.\n• Perform SAP Helpdesk support, trouble-shooting and debugging.\n• Perform SAP ABAP development changes.\n• Perform SAP Sap script / Smart forms changes.\n• Perform SAP EDI / B2B – BizTalk support and development changes.\n\nRequirements :\n• Degree/Diploma in Computer Science, Information Systems or equivalent, with 3-5 years’ relevant experience.\n• Prior experience in SAP Abap reports using ALV, dialog programming, BDC, Layout sets, LSMW and Data dictionary.\n• Experience in User Exits, Enhancement points, BADIs and BAPI is a must.\n• Experience in EDI / ALE and work flow and any middleware and B2B applications.\n• Professional SAP Certification will be advantageous\n• Any prior experience working with EDI / ALE and work flow and any middleware... and B2B applications", "extensions": ["7 days ago", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTeXN0ZW0gQW5hbHlzdCwgSVQgKFNBUCBBQkFQKSIsImNvbXBhbnlfbmFtZSI6IlZlbnR1cmUgQ29ycG9yYXRpb24gTGltaXRlZCIsImNvbXBhbnlfbWlkIjoiL2cvMTFiYzYxZ2dsdyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImtkX1ZRRjFrVG0xbjFwQ0tBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVvd0NDc3dCUVU1VlgwNXhVMjlVUmw5TVdrMXpUVE4wV1RWd1ZqbGxlRTE2ZEdndGFFVnBOMk0xV1RoaFMwOXRiRUpsYW1wQ01EVXdOM2RKVmtKeFZWY3pkVVpDYkZKSFFWZE5WRmxzT0Y5cFJ5MURNMHRwUWtoZmNTMXJSMHBaVUdOcVYxUXRhRXRUYkVKRlRERlBla0Z2WkdSU1luVklWMjFaT1U5blRFOVRZVEJLTm5GV2RVaHNZMlpXY2kxeGVYUk9jakpJWW1SZlRFMWZSR3hQUTNWWldHdFpkMWRhY25SWFNtRkJRMVptUnpGbVJISndWM1ZUY2tSTFMwdElNa1Z0ZWtOb2NrNVNkWFJvYkhGWFVFRndFaGRZTTIxRFdVbHFWRWRPTWtZNVVIZFFiVWxUWjNsQk5Cb2lRVTlOV1ZKM1EwVlBUR2RsZEd4UmQwMTBaV1JRWWxseGVHRlRSbmxLUkdaMmR3IiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNTAiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gVmVudHVyZSBDb3Jwb3JhdGlvbiBMaW1pdGVkIiwibGluayI6Imh0dHBzOi8vd3d3LnZlbnR1cmUuY29tLnNnL2pvYi9zeXN0ZW0tYW5hbHlzdC1pdC1zYXAtYWJhcC8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Salesforce Business/ Functional Analyst", "company_name": "Accenture", "location": "Singapore", "via": "via Accenture", "description": "About Accenture\n\nAccenture is a global professional services company with leading capabilities in digital, cloud and security. Combining unmatched experience and specialized skills across more than 40 industries, we offer Strategy and Consulting, Interactive, Technology and Operations services—all powered by the world’s largest network of Advanced Technology and Intelligent Operations centres. Our 506,000 people deliver on the promise of technology and human ingenuity every day, serving clients in more than 120 countries. We embrace the power of change to create value and shared success for our clients, people, shareholders, partners and communities. Visit us at www.accenture.com.\n\nYour Role\n\nWe are currently looking for a Salesforce Consultant to join our Salesforce Business Group, with the focus on Salesforce projects. You will become part of the Global Salesforce Business Group practice and you will be working on a project basis in a multi-disciplinary team engaged in a wide range... of Salesforce projects. Candidates for this role should possess a knowledge of public cloud applications with a focus on Salesforce.com & the application landscape around it.\n\nThe Salesforce Consultant supports the implementation from proposal to delivery. This includes developing a thorough understanding of the Client’s requirements then applying industry best practices and detailed knowledge of the Salesforce solution to design an optimal solution that supports the business process and meets/exceeds functional requirements. This position builds a trusting relationship with major project stakeholders and leads them to the adoption of the best solution. Specifically, this role guides teams that will successfully deliver the Salesforce project.\n\nYour Responsibilities\n• Deliver, oversee and ensure quality of Salesforce implementation projects from start to finish on time and within budget.\n• Performs “As-Is” and Fit/Gap analyses in to map the Cloud technology’s offerings and capabilities to the Client business needs.\n• Works closely with technical architects to make the bridge between the business team and IT team.\n• Presents and leads sessions and requirement workshops, based on Waterfall or Agile Delivery Methods.\n• Has sufficient knowledge of the Salesforce platform to make adequate design decisions & propose solutions to requirements based on industry & technology best practices.\n• Understands the importance and is able to design Salesforce solutions integrated in the IT application landscape (example: integrations to ERP & reporting systems)\n• Manages teams of highly qualified functional and technical resources (both on-shore and off-shore).\n• Defines test cases and leads contractual testing to confirm that solution performs as per the business requirements.\n• Coordinates releases and post Go-Live materials (e.g. training documentation, training sessions", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTYWxlc2ZvcmNlIEJ1c2luZXNzLyBGdW5jdGlvbmFsIEFuYWx5c3QiLCJjb21wYW55X25hbWUiOiJBY2NlbnR1cmUiLCJjb21wYW55X21pZCI6Ii9tLzAxcnAyYyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6InduZzJ2eUF2QjdVWklHYmhBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1SUJDcUlCUVU1VlgwNXhWR3RFTFY5SlFuVk1OMHhrZWtwemFFVkllakJSV0ZZNFlURk5NMVJqU0ZBMVdWWkdTVXBSWDFsdGJESkxSakpETlhWMVdVOVBjVjgzZVhaTWNsUkdSR1ptTjNGQ1dUZDVNbVp0V0RaWFZIVmpSalF4UldGVFkwOVZkMkZNTUdoeFFWQm9NV1YwVld3MlkxZHZZVGs0VUhBeFJXVklYMFZQY1dabGRXTTNUM1p2WW1ScFMwc3dPV2RXZGxRMGJUTlVkVXR2YkRCWE4ySmFiRVJSRWhkWU0yMURXVWxxVkVkT01rWTVVSGRRYlVsVFozbEJOQm9pUVU5TldWSjNRbkpLTUdoWldsSkNaWFJ3VERoQ1VqSkxRa0ZSVXpkNWRVTkxRUSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzU4IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEFjY2VudHVyZSIsImxpbmsiOiJodHRwczovL3d3dy5hY2NlbnR1cmUuY29tL3NnLWVuL2NhcmVlcnMvam9iZGV0YWlscz9pZD0wMDg5NTQxMF9lblx1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Project Analyst (Scrum certified)", "company_name": "EBC CONNECT PTE. LTD.", "location": "Singapore", "via": "via Singapore Job Mela", "description": "SCRUM Certified is highly preferredIndustry: Container ShippingResponsibilities:Effectively capture requirements and user stories from business users.Successfully communicate these requirements to the IT and development teams and ensure the work is carried out to a satisfactory level prior to deployment.Fully understand the interdependencies of various business processes, workflow and requirements to drive the implementation of functional, process and product initiatives for each transformation stage.Prepare estimates and detailed project plans for each phase of the project and when required procure adequate resources to achieve project objectives in planned timeframes.Manage actuals vs budget implementation hours, and communicate revised budgets for any scope changes.Work creatively and analytically in a problem-solving environment using proven methodologies.Demonstrate leadership, teamwork, stakeholder management and excellence.Assist the Business Transformation Head in delivering... appropriate and effective executive level communication through weekly progress reports, proposals, requirements documentation and presentations to various audiences of the team and internal business stakeholders.Educating team members and enforcing best SCRUM practice within the business transformation team.Requirements:Degree holder or equivalent.Certification and proven experience in SDLC Methodologies, Agile, SCRUM is preferred.Skilled in project management best practices to manage on-time on-budget goals, and deliver project milestones.Certified Scrum Product OwnerCertified PMP and/or Prince2 preferredWorking experience:+4 years of experience working on complex agile scrum projects.+4 years’ experience working in a software project as a qualified scrum product owner.1+ years of project management experience working on software projects is preferred.Proven experience in managing transformation and process reengineering projects involving software (build/buy) technology components.Experience in managing software Implementation, and running software development team.Interested candidates please forward your updated CVs in MS Word format to [email protected]Reg ID: R1984062EBC Connect Pte LtdLicence no. 17C8975", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IEFuYWx5c3QgKFNjcnVtIGNlcnRpZmllZCkiLCJjb21wYW55X25hbWUiOiJFQkMgQ09OTkVDVCBQVEUuIExURC4iLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6InlRN292Um1tUEwwNVlsMVNBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gU2luZ2Fwb3JlIEpvYiBNZWxhIiwibGluayI6Imh0dHA6Ly93d3cuc2luZ2Fwb3Jlam9ibWVsYS5jb20vY2VudHJhbC1qb2JzL3Byb2plY3QtYW5hbHlzdC1zY3J1bS1jZXJ0aWZpZWQtOTMwNzE/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Business Analyst - AVP", "company_name": "TRINITY CONSULTING SERVICES PTE. LTD.", "location": "Singapore", "via": "via Learn4Good", "description": "Location: null\nRoles &\n\nResponsibilities Should have worked as Project Manager and/or Business analyst at least for 8-10 years. Hands on experience in the following areas are anticipated(or a mix) in implementations :\n\nFinance process and reporting’s Credit-risk Core banking solutions Demonstrable experience in a similar role with Financial Services. Good knowledge and working capability of product life cycle like loans, deposits, derivatives,Gurantees,securities etc. Should have good knowledge and understanding of the information flow and various business functions in a financial services/bank . Should have knowledge on Accounting /finance system implementation lifecycle.\n\nExperience working throughout the entire project life cycle; including analyzing and documenting requirements, workshops, testing and stakeholder management throughout.\n\nAbility to prioritize and execute tasks in a high pressure environment\n\nAble to conduct the workshops with business teams and challenging the... requirements Collaborate with teams and work with groups effectively spread across various regions Strong critical thinker with problem solving aptitude. Excellent written and oral communication skills. PMP certified / Scrum certification would be advantageous\n\nTell employers what skills you have\n\nAccounting\n\nAnalysis\n\nBusiness Analysis\n\nCore Banking\n\nCredit RiskFinance\n\nFinancial Services\n\nManagement\n\nProcess Improvement\n\nProject Management\n\nRequirements Analysis\n\nRequirements Gathering\n\nSDLChands-on experience\n\nCapability\n\nProduct Lifecycle", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJCdXNpbmVzcyBBbmFseXN0IC0gQVZQIiwiY29tcGFueV9uYW1lIjoiVFJJTklUWSBDT05TVUxUSU5HIFNFUlZJQ0VTIFBURS4gTFRELiIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiS19zV3ZnZUZUTHp3TURLZkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMZWFybjRHb29kIiwibGluayI6Imh0dHBzOi8vd3d3LmxlYXJuNGdvb2QuY29tL2pvYnMvc2luZ2Fwb3JlL2ZpbmFuY2UvMjcxMzk0MDg3L2UvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Business Operations", "value": "GC06"}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Accounting and Finance", "value": "GC01"}, {"text": "Advertising and Marketing", "value": "GC03"}, {"text": "Science and Engineering", "value": "GC27"}, {"text": "Protective Services", "value": "GC23"}, {"text": "Customer Service", "value": "GC10"}, {"text": "Legal", "value": "GC17"}, {"text": "Management", "value": "GC18"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Property", "value": "GC24"}, {"text": "Sales and Retail", "value": "GC26"}, {"text": "Social Services and Non-Profit", "value": "GC28"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "Business analyst", "value": "business analyst"}, {"text": "Analyst", "value": "analyst"}, {"text": "Security analyst", "value": "security analyst"}, {"text": "Systems analyst", "value": "systems analyst"}, {"text": "It analyst", "value": "it analyst"}, {"text": "Support analyst", "value": "support analyst"}, {"text": "Data analyst", "value": "data analyst"}, {"text": "System analyst", "value": "system analyst"}, {"text": "Management analyst", "value": "management analyst"}, {"text": "Operations analyst", "value": "operations analyst"}, {"text": "Senior analyst", "value": "senior analyst"}, {"text": "Soc analyst", "value": "soc analyst"}, {"text": "Qa analyst", "value": "qa analyst"}, {"text": "Risk analyst", "value": "risk analyst"}, {"text": "Senior", "value": "senior"}, {"text": "Test analyst", "value": "test analyst"}, {"text": "Associate", "value": "associate"}, {"text": "Financial analyst", "value": "financial analyst"}, {"text": "Intelligence analyst", "value": "intelligence analyst"}, {"text": "Manager", "value": "manager"}, {"text": "Process analyst", "value": "process analyst"}, {"text": "Project analyst", "value": "project analyst"}, {"text": "Research analyst", "value": "research analyst"}, {"text": "Researcher", "value": "researcher"}, {"text": "Service analyst", "value": "service analyst"}, {"text": "Specialist", "value": "specialist"}, {"text": "Technology analyst", "value": "technology analyst"}, {"text": "Application analyst", "value": "application analyst"}, {"text": "Behavior analyst", "value": "behavior analyst"}, {"text": "Business", "value": "business"}, {"text": "Center analyst", "value": "center analyst"}, {"text": "Compliance analyst", "value": "compliance analyst"}, {"text": "Control analyst", "value": "control analyst"}, {"text": "Coordinator", "value": "coordinator"}, {"text": "Desk", "value": "desk"}, {"text": "Desk analyst", "value": "desk analyst"}, {"text": "Functional analyst", "value": "functional analyst"}, {"text": "Hr analyst", "value": "hr analyst"}, {"text": "Insights analyst", "value": "insights analyst"}, {"text": "Interns", "value": "interns"}, {"text": "Operations", "value": "operations"}, {"text": "Pmo analyst", "value": "pmo analyst"}, {"text": "Programmer analyst", "value": "programmer analyst"}, {"text": "Project manager", "value": "project manager"}, {"text": "Security operations", "value": "security operations"}, {"text": "Senior associate", "value": "senior associate"}, {"text": "Senior consultant", "value": "senior consultant"}, {"text": "Sr analyst", "value": "sr analyst"}, {"text": "Support executive", "value": "support executive"}, {"text": "Technical analyst", "value": "technical analyst"}, {"text": "Technical architect", "value": "technical architect"}, {"text": "Trainee", "value": "trainee"}, {"text": "Treasury analyst", "value": "treasury analyst"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Research", "value": "/business/naics2007/5417"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Mining", "value": "/business/naics2007/21"}, {"text": "Real Estate", "value": "/business/naics2007/53"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Engineering Services", "value": "/business/naics2007/5413"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Utilities", "value": "/business/naics2007/22"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "SingTel", "value": "/m/020zfl"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "Government Technology Agency", "value": "/g/11gh0528nq"}, {"text": "OCBC", "value": "/m/055r27"}, {"text": "Trustwave", "value": "/m/0n3xjf5"}, {"text": "Snaphunt Pte Ltd", "value": "/g/11c74t61w8"}, {"text": "Binance", "value": "/g/11hcz1r4wl"}, {"text": "HSBC", "value": "/m/096k1t"}, {"text": "Randstad Singapore", "value": "/g/11g70b50mr"}, {"text": "Visa", "value": "/m/01kqjn"}, {"text": "Xcellink Pte Ltd", "value": "/g/11c73prcqy"}, {"text": "American Express", "value": "/m/01w6dw"}, {"text": "Avensys Consulting", "value": "/g/11g7022gjf"}, {"text": "BlueVoyant", "value": "/g/11h1y4qdlf"}, {"text": "Caterpillar", "value": "/m/0319hp"}, {"text": "Citibank", "value": "/m/01hlzm"}, {"text": "DBS Bank Ltd", "value": "/m/01q7n5"}, {"text": "Deloitte SEA", "value": "/g/11f_g4x9d_"}, {"text": "Dyson", "value": "/m/05cskg"}, {"text": "EPAM Systems", "value": "/m/0dlnrc"}, {"text": "Experis Singapore", "value": "/g/11dxpnwm3s"}, {"text": "JPMorgan Chase & Co.", "value": "/m/01hlwv"}, {"text": "Medtronic", "value": "/m/03z4j3"}, {"text": "Mizuho Bank", "value": "/m/022103"}, {"text": "NSEARCH GLOBAL PTE. LTD.", "value": "/g/11dxpksll4"}, {"text": "NTT MSC", "value": "/g/11fd_nds29"}, {"text": "Optimum Solutions (S) Pte Ltd", "value": "/g/11g70hkrbx"}, {"text": "People Profilers", "value": "/g/11dxq43n_6"}, {"text": "Public Service Division", "value": "/g/11g6__bv10"}, {"text": "RECRUIT EXPRESS PTE LTD", "value": "/g/11g706hzhq"}, {"text": "RHB Singapore", "value": "/g/11c73srg7f"}, {"text": "Randstad", "value": "/m/08pt1z"}, {"text": "SITA", "value": "/m/06l20z"}, {"text": "Selby Jennings", "value": "/g/11fy2ds3gn"}, {"text": "Underwriters Laboratories", "value": "/m/01q1gj"}, {"text": "Xilinx", "value": "/m/03dwkc"}, {"text": "103 Golden Agri International Pte Ltd", "value": "/g/11fy210tb9"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Activate Interactive Pte Ltd", "value": "/g/11dxq192l5"}, {"text": "Amazon.com, Inc.", "value": "/m/0mgkg"}]}]}