{"search_metadata": {"id": "60827ed4a5ad6d915c3f97e8", "status": "Success", "json_endpoint": "https://serpapi.com/searches/b8eb0c15ae497742/60827ed4a5ad6d915c3f97e8.json", "created_at": "2021-04-23 08:01:24 UTC", "processed_at": "2021-04-23 08:01:24 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28project+manager%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=230", "raw_html_file": "https://serpapi.com/searches/b8eb0c15ae497742/60827ed4a5ad6d915c3f97e8.html", "total_time_taken": 1.53}, "search_parameters": {"q": "(project manager) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "230"}, "jobs_results": [{"title": "Project Manager", "company_name": "Db & B Pte Ltd", "location": "Singapore (+1 other)", "via": "via Jobs | Fidanto", "description": "Show recruiters you're immediatley available for job opportunities Posted On: 3 days ago Total Views: 3 Job Id: 27641169 Permanent Job Job DescriptionMain responsibilities: Meet potential clients with Business Development Managers to enquire and understand clients’ needs Co-ordinate layout plan, M&E plan and visuals, prepare project schedule and quotations to clients and submit tenders for the project to clients Arrange submission of plans to local authorities for approval and arrange inspections of building work Prepare costing report for management’s approval and manage budget accordingly Work closely with project and operation teams and contractors to ensure timely delivery of the project and excellent quality of work done Being the key single interface between the company and clients, obtain client's feedback and resolve project related issues such as payments, etc. Requirements Recognized qualification in interior design, architecture or equivalent Candidate must possess minimum... 5 years’ experience in corporate office design and build project management. Those with PMP Certification have an added advantage. Able to interpret architectural plans and familiar with building and safety regulations Experience in leading and managing multiple projects within tight timelines Excellent project, presentation, leadership and people management skills Highly self-motivated, positive working attitude with a high level of professionalism and integrity Good communication & interpersonal skills Job Description: * Assess project and resource requirements. * Manage a team of project co-ordinator and executives. * Project cost tracking and control. * Manage suppliers and sub-contracJob Responsibilities: * Undertake supervisory and coordination role, evaluate feasibility studies, lead technical discussions with consultants and co-ordination of building projects * Manage peoJob Responsibilities: * Responsible for project planning, monitor site work progress, safety, meeting project time lines and project budget. * Overall supervision all of site team, sub-contract Job Description: - - Work closely with Business Development Team, Account Management Team, as well as internal stakeholders, to ensure all projects are delivered on-time, within scope and budget. - Roles & Responsibilities Job Brief * Study contract documents, drawings and requirements * Plan, implement and monitor project progress to ensure timely completion * Liaise with all stakeholJOB RESPONSIBILITIES Planning and scheduling of Project activities. * Manage on site project to ensure timely completion. * Project planning, quality control planning and risk management for pJob Description * Responsible for successful planning and execution of a project. * To handle maintenance work document submission and follow up with the service report upon completion of work. Job Description 1. Lead a Project Team of consultants, contractors, developer in daily-site activities 2. Conduct project briefing and kick start meeting 3. Responsible for periodic progress report* Project Management * Responsible for planning, managing and ensuring smooth implementation of projects assigned from inception to completion within the specified time frame and of the desired qOverview Aurum Group is searching for a Senior Project Manager to provide the executional leadership and management necessary to ensure successful completion of existing and new Aurum Land residentiaGive your career a boost with Monster's resume services.Simple body text this will replace with orginal content Toll Free No: +8001-012-339 91-40 66116994", "extensions": ["6 days ago", "Contractor"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Contractor"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJEYiBcdTAwMjYgQiBQdGUgTHRkIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJEMVBhc1gweFNvTmtBT0NIQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnMgfCBGaWRhbnRvIiwibGluayI6Imh0dHBzOi8vc2cuZmlkYW50by5jb20vam9icy9qb2Itb3BlbmluZy9pbmZvcm1hdGlvbi10ZWNobm9sb2d5LXByb2plY3QtbWFuYWdlcnMvcHJvamVjdC1tYW5hZ2VyLTI3NTUzMDY0MT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Project Manager", "company_name": "Shell Infotech Pte. Ltd", "location": "Singapore", "via": "via WhatJobs", "description": "Show recruiters you're immediatley available for job opportunities\n\nPosted On: 4 days ago Total Views: 6 Job Id: 27747775\n\nPermanent Job\n\nJob Description\n\n• 8+ years’ experience on MySQL (Oracle) Implementation + roll out projects across Asia Pacific countries\n• Solution architect or DB architect using MySQL will be preferred\n• Shall have strong Functional consulting background especially in Healthcare industry\n• Good Knowledge on PMI Project Management Body of Knowledge Processes and ITIL Processes\n• Experience on planning, scheduling and driving all party meetings\n• Sensitivity to working across other cultures and respects and values diversity\n• Demonstration of desire to keep abreast of technological changes and recommends service improvements and cost savings measures.\n• Proven experience in managing/supporting large complex environments with multiple applications versions, tools and customers\n• Project Management Professional Certification is required\n• Self-motivated and have... the ability to deliver results and meet timelines with minimal direct supervision.\n• Good command of Microsoft Excel, Project, Power Point, VISIO is required\n\nWorking Location: Paya Lebar Permanant role Role & Responsibilities: * Assist the manager in organizing, planning, and directing all activities as required for the full implementation of project\n\nJob Scopes & Responsibilities: * Reports to Project Director * Works closely with client, vendors, subcontractors, consultants and construction team to ensuretimely submission and approval of pr\n\nJob Summary The successful candidate will be responsible for leading a team to deliver projects on time and within budget, ensuring the quality of deliverables, and keeping your team on task. You wil\n\nAbout Us Murex is a recognized global leader in software development for trading, risk management, and processing. Every day banks, asset managers, corporations, and utilities, across the world, rel\n\nDeliverables * Carry out the follow ups of the team and provide the producer with information on the progress of the work on a regular basis; * Suggest a plan of attack for any delays that could\n\nCodigo is a digital agency with a strong in-house UI/UX and development team. We craft high quality mobile apps, websites and backend systems. Project Management The Project Manager is a challengin\n\nRequirements : 1 Diploma, Degree in Civil Engineering or its equivalent discipline. 2 Preferably Senior Executive specialized in Engineering - Civil/Construction/Structural or equivalent. 3 Require\n\nJob Responsibilities: · Overall-in-charge of project's operation and workforce. · Attend site show round and advice on material and workforce costing. · Plan, Lead and motivate subordinates, includ\n• Bachelor’s Degree in appropriate field of study or equivalent work experience * Proven working experience managing projects, preferably 10+ years relevant experience * Project Management Pro\n\nThe global VMware Professional Services Organization (PSO) influences the success of each VMware implementation. We are committed to the satisfaction and success of the customer and their SDDC strateg\n\nGive your career a boost with Monster's resume services.\n\nSimple body text this will replace with orginal content\n\nToll Free No: +8001-012-339\n91-40 66116994", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJTaGVsbCBJbmZvdGVjaCBQdGUuIEx0ZCIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoicm01VlVHbUxTZ08tTC1mM0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBXaGF0Sm9icyIsImxpbmsiOiJodHRwczovL2VuLXNnLndoYXRqb2JzLmNvbS9qb2ItZm9yLVByb2plY3QtTWFuYWdlci1pbi1TaW5nYXBvcmUtY29vcDE3NTkxMTkxP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Project Manager", "company_name": "Xypher Pte. Ltd.", "location": "Singapore (+1 other)", "via": "via Monster Singapore", "description": "Job Purpose\n\nThe Project Manager will assist in the areas of IT application systems, specifically in the areas of Analytics, data science, AI, ML and association management systems.\n\nYou will be responsible to manage the project for the implementation of the IT application system or services and ensure it meets the business operation goals.\n\nYou are an independent, resourceful, decisive and driven individual who takes a proactive approach to analyze business requirements with stakeholders and usher projects through the entire project lifecycle. You will need to be a capable project manager with project management knowledge as well as a good communicator.\n\nThe Senior Project Manager will manage and oversee a series of projects on big data from initiation to implementation, working with BI and Analytics team, Integration/ETL team, QA team, project members, data architects, and business sponsors and business representatives to jointly design, develop and implement the best-fit solutions... The Service Manager is required to plan, manage, execute and track the progress of concurrent projects, to bring the projects to their successful completion.\n\nThis role entails identifying and initiating opportunities across the Enterprise, building collaboration, and influencing strategic direction by raising visibility of trends and issues across the competitive landscape. The position requires a wide understanding new IT technology stacks and industry trends and practices.\n\nHighly effective in engaging senior management, project sponsors in communication and collaboration across internal and external teams with demonstrated success, building strong relationships and delivering results in cross-group projects.\n\nJob Description\n• Own and be responsible for the successful delivery of projects, ensuring they are completed on time, meeting requirements and within allocated budget.\n• Manage project lifecycle, from requirement, design, technical construction, testing, acceptance, training, documentation and implementation, in accordance with the GE's Project Management Process and Methodology.\n• Participate in pre-project activities such as estimation of project efforts, preparation of high-level project plan with project timeline and resource requirements and staffing and organization of project team.\n• Plan, coordinate and communicate project plan, timeline and activities to the project team.\n• Work closely with the group of key business owners and source systems SMEs, IT Risk & compliance, IT Security, QA on the agreed project objectives.\n• Monitor and track progress of projects and stay on top of the projects to ensure smooth execution.\n• Manage and coordinate project deliverables, ensuring their quality and configuration management.\n• Analyse and highlight project risks and develop necessary risk mitigation plans.\n• Analyse and highlight project dependencies to pre-empt project issues.\n• Maintain project issue register to keep close match of the project issues till their resolution.\n• Manage performance of the project team, guide the project team in resolving issues, and resolve conflicts within the project team.\n• Manage customer's expectation by understanding customers needs and providing realistic expectations and scope of the projects.\n• Manage and work closely with vendors, business partners and data centre involved in projects.\n• Provide periodic update on project progress to project sponsors and escalate project issues not resolvable not project team level.\n• Provide periodic update on project progress to project sponsors and escalate project issues not resolvable not project team level and PSC team.\n• Takes accountability in considering business and regulatory compliance risks and takes appropriate steps to mitigate the risks.\n• Maintains awareness of industry trends on regulatory compliance, emerging threats and technologies in order to understand the risk and better safeguard the company.\n• Highlights any potential concerns /risks and proactively shares best risk management practices.\n\nRequirements\n• Degree in Computer Science, Computer Engineering, or equivalent.\n• Good knowledge of development methodologies and implementation.\n• Possess experience in managing the entire Software Development Life Cycle (SDLC) using Agile or Waterfall software development practices.\n• Possess experience in managing vendor and contracts for application maintenance supports and services.\n• Candidates with relevant Industry certifications would be preferred.\n• Good interpersonal and communication skills to manage relevant stakeholders.\n• Certified Project Manager, either CITPM or PMP, with at least 10 years of experience in managing IT projects and software/application development lifecycles, Scrum Certified.\n• Strong delivery management experience, with proven track records in managing and steering projects towards smooth execution and on time delivery.\n• Strong problem solving and analytical skills, with passion for making data-driven decisions.\n• Experience in use of project management and collaboration tools is required (E.g. Microsoft Project, Confluence, Jira Software, Kanban Boards, etc.)\n• Knowledge of big data platforms and analytics tools is required E.g. Hortonworks, Hive, Spark, Sqoop, Tableau, Qilk, SAS Vija etc.\n• Knowledge of technology, tools and process related to data governance, master data management and data lineage is required.\n• Knowledge of cloud technology Eg. AWS, snowflake etc.\n• Excellent in verbal and written communication skills.\n• Strong interpersonal and leadership skills, effective in fostering teamwork and managing high performance project team.\n• A working understanding of Cloud computing, Data Science, and/or Machine Learning.\n• Experience leading cross-functional teams.\n• Familiar with current topics in big data / data analytics such as natural language processing, complex event processing, machine learning, computer vision, deep learning, supervised or unsupervised skills, OpenCV, tensorflow, dockers container management is desired.\n• Experience or skill for software programing language for Java, Shell scripting, Python or Java Scripts.\n• High level of integrity takes accountability of work and good attitude over teamwork.\n• Takes initiative to improve current state of things and adaptable to embrace new changes.\n\nInterested Candidate please email me at", "extensions": ["14 days ago", "Full–time"], "detected_extensions": {"posted_at": "14 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJYeXBoZXIgUHRlLiBMdGQuIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJORXA2V25LYWlOcWI2TVVPQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1vbnN0ZXIgU2luZ2Fwb3JlIiwibGluayI6Imh0dHBzOi8vd3d3Lm1vbnN0ZXIuY29tLnNnL2FtcC9qb2ItdmFjYW5jeS1wcm9qZWN0LW1hbmFnZXIteHlwaGVyLXB0ZS1sdGQtc2luZ2Fwb3JlLTI3NjQ0OTIxLmh0bWw/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Technical Project Manager, Infrastructure", "company_name": "Sea", "location": "Singapore", "via": "via LinkedIn", "description": "Our Infrastructure team provides the end-to-end managed services and solutions for the Group's entire Internet infrastructure alongside running business applications. We excel in building the architecture, providing solutions and operations of data centre, connectivity, cloud, networking, system, storage and security. We are a proud provider of high-quality and stable running business applications and services to our internal business units.\n\nAs a (Senior) Technical Project Manager, you will plan, direct, and coordinate activities of designated Infrastructure projects to ensure timely delivery and in accordance with the business requirements.\n\nJob Description\n• Work closely with business units to identify and analyse their requirements from IT Infrastructure point of view.\n• Develop high quality project proposals and plan based on the business requirements and available project resources.\n• Direct and manage project resources to ensure services are delivered in accordance to the... Service Level Agreement.\n• Track ETA delivery of equipment and services from Telco/Data Center, and ICT Principles/Distributors.\n• Work closely with business units regularly to review infrastructure service quality. Review risks, issues, incidents and planned changes.\n• Ensure regular reports on project progress for stakeholders and management.\n\nJob Requirements\n• Bachelor’s Degree of IT or business discipline.\n• 1 to 3 years of experience in project management.\n• Have a passion in project management or service delivery in the IT Infrastructure domain.\n• Good project management skills and high-quality project delivery experiences.\n• Strong stakeholder management capabilities, and strategic mindset to advise and manage both internal and external partners.\n• Good reporting/documentation skills to ensure timely, clear and concise information flow among all stakeholders.\n• ITIL certification is a plus.\n• Possess technical knowledge in Network, Data Center, Security is a plus.\n• Result oriented, with strong analytical and problem solving skills, able to drill down to details.\n• Proficient in English and Mandarin due to regional coverage", "extensions": ["7 days ago", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJUZWNobmljYWwgUHJvamVjdCBNYW5hZ2VyLCBJbmZyYXN0cnVjdHVyZSIsImNvbXBhbnlfbmFtZSI6IlNlYSIsImNvbXBhbnlfbWlkIjoiL2cvMTFmMW5qOWx2ciIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IklTSk1kWW8xazcwSFVpTEZBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVzc0JDb3dCUVU1VlgwNXhVVmQxVGt0aVVESTNUVkZ4Wmt0MFVqTjViRk5OU25sMk5rUmtUMGQ0UzJaZlJ6WlZWVTVSU2pkNWNXSkZXa1ZJZHpFeVVrbE5MWE40TTFvMlJtWXlWME14YWw5d1JEZFRhRjlYY1hodGNrNVBlV2hJTFUxQ2JXWkROR0YxUkU1M2RYUjZMVzVMYmtwUlFXbFhjMmszVHkxZlUwOXRjR0ZFTW5GVlQxTk9RamxPVmt0WVRtRVNGakZZTmtOWlVEZHFRWE4yV0hSQlluVnhXWEpKUkVFYUlrRlBUVmxTZDBJd1psVm5XVk5hYkY5WFgzQXlNMlJ0TW5ad00xZ3dUVE4wWkdjIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMTkiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGlua2VkSW4iLCJsaW5rIjoiaHR0cHM6Ly9zZy5saW5rZWRpbi5jb20vam9icy92aWV3L3RlY2huaWNhbC1wcm9qZWN0LW1hbmFnZXItaW5mcmFzdHJ1Y3R1cmUtYXQtc2VhLTI0ODgzMDM5NTA/cmVmSWQ9YWVhZjE4ZWYtZjA3Mi00MTBiLTkzYmItOTgxYjUwYmMxNGY5XHUwMDI2dHJhY2tpbmdJZD1kcFM4dnd6Z1U1ZUJPZm5odTQyOThBJTNEJTNEXHUwMDI2dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Senior / Project Manager, Digital Transformation (BB-8A888)", "company_name": "Wildlife Reserves Singapore", "location": "Singapore (+1 other)", "via": "via BeBee", "description": "Senior / Project Manager, Digital Transformation (People) Wildlife Reserves Singapore (WRS) is the holding company of the award-winning attractions Jurong Bird Park, Night Safari, River Safari and Singapore Zoo. WRS is dedicated to the management of world-class leisure attractions that foster conservation and research while educating visitors about animals and their habitats. As champions for Wildlife, we lead actions to protect them, inspire a love for wildlife and spark a sense of wonder in everyone, regardless of our roles. Come 2024, we will add a new Bird Park, a Rainforest Park, nature themed indoor attraction and Eco-resort as part of our Mandai rejuvenation plan. If you are a team leader, self-driven, and looking for growth and new challenges, we want you to be part of our team. Main Duties and Responsibilities: ·Play a key role in Transformation Project Team (as Project Manager / Functional Technical Lead) responsible for Project Initiation, Planning, Procurement, Execution... Tracking, Delivery, Vendor Management and Benefits Realisation. ·Providing support in conducting Feasibility Studies, Industry Benchmarking / Research and Pilots. ·Analysis and Design - Capture, validate and value-add to functional and technical requirements from business stakeholders to deliver qualityspecification documents for implementation (either in-house or out-sourced). ·Provide secretariat support for Transformation Project Committee meetings. Requirements: ·Degree in Information Technology / Computer Science / Computer Engineering / Human Resources / Tourism / Hospitality or equivalent. ·3 and more years of experience in managing IT Projects related to People / HR transformation. ·Preferably in manpower intensive business environment with operations requiring workforce scheduling. ·Possess one (1) or more of the following professional credentials: CITMP / PMP / PMI-ACP Certification / SCRUM Master or equivalent IHRP Certified Associate and higher or equivalent Prosci Certified Change Practitioner or equivalent IAAPA Certified Attractions Manager and higher or equivalent ·Working Knowledge in two (2) or more of the following areas is preferred: Industry 4.0 / Workforce of the Future Industry Transformation Map (by MTI), Skills Framework (by SSG-WSG) Design Thinking and Journey Mapping (example: IDEO Human Centred Design using Desirability, Feasibility, Viability lens) Productivity / Lean or equivalent Prosci ADKAR change management model OKR (Objectives and Key Results) model ·Experience in the following technical areas will be highly advantageous: SAP SuccessFactors Basic data analysis", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgLyBQcm9qZWN0IE1hbmFnZXIsIERpZ2l0YWwgVHJhbnNmb3JtYXRpb24gKEJCLThBODg4KSIsImNvbXBhbnlfbmFtZSI6IldpbGRsaWZlIFJlc2VydmVzIFNpbmdhcG9yZSIsImNvbXBhbnlfbWlkIjoiL20vMGRsa2d3NyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjhxZWdtRmdTOEx6eFhsZF9BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVvc0NDc3dCUVU1VlgwNXhVbGhIT1RRelQyYzVNM0owVms5ZlFsRnJjVzF2YURkM2FWTlRVMlJuWjNkRVh6bEpiWFpHZWxjd1ExOHhPVms1YkhKWVozcFhZV05qY0RGeFJ6QkdabFZMY2pGNFNWOWZTbkJWVDFrd1NHcENaWEJzUm1OSWRYWlpVMHR6ZVhka2QwVjJYMVZIZWpoM2IxRnFMWFExY2s5dFVHMHhTVmN0VldKWlIxUjRTVzlvYldoWGJsZzBOMm96YjJsMFRrRnRTMU5xUldkZlJDMW1hVFUxTTIxcFpGTktlbVEyTTFCVFRHODFabGxSWlY4eldYZHVUelUyTUhJNE0wZHdWSGhYVWxORU5uVlVFaFl4V0RaRFdWQTNha0Z6ZGxoMFFXSjFjVmx5U1VSQkdpSkJUMDFaVW5kQ2NHbERWek5IVUY5TFNFNUxSRmt3U21OSlZsOTNTMk52Vm1OQiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzI3IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJlQmVlIiwibGluayI6Imh0dHBzOi8vc2cuYmViZWUuY29tL2pvYi8yMDIxMDQxNy00NTgwZjc5YTZlY2JhMGQ0MzRjMzkyYjRhYzc4YTg4OD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "IT Project Manager", "company_name": "Steenbok", "location": "Singapore", "via": "via Jobs", "description": "Over the years, it has cultivated a niche in interconnecting applications from mobile and web frontends to the traditional ERP systems through middleware. Today, its best value to the customer is its experience and ability in cross-application connectivity.To date, its business has remained as that of an outsourced IT arm to the industries.The Role Responsibilities Liaise with stakeholders and vendors on business requirements Prepare and execute project plans Manage project development resources, schedules and risks Escalate and report risk and issues to stakeholders timely Ideal Profile Requirements An IT degree Minimum 5 years of relevant experience G3/ePayment domain knowledge Track record of business solution implementation within a formal SDLC framework PMP certification is an advantage What's on Offer? Work within a company with a solid track record of success Work alongside & learn from best in class talent Excellent career development opportunities", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJJVCBQcm9qZWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJTdGVlbmJvayIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiMEcydEU5ak5nNk5Ic204TUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIiwibGluayI6Imh0dHBzOi8vc2cuZmlkYW50by5jb20vam9icy9qb2Itb3BlbmluZy9jb21wdXRlci1zeXN0ZW1zLWVuZ2luZWVyc2FyY2hpdGVjdHMvaXQtcHJvamVjdC1tYW5hZ2VyLTI3NTIxODE4OT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Project Manager", "company_name": "AIA", "location": "Singapore (+1 other)", "via": "via Glassdoor", "description": "Bring your career aspirations to life with AIA!\nThis role is to partner the Division Heads to execute value creation strategies and delivering the business outcomes and objectives of the programmes/projects that he/she is accountable for under the Digital Business Transformation roadmap.\n• Lead large scale projects (>S3mil setup cost) independently across the entire project lifecycle (i.e. conceptualization, business case, vendor selection, delivery, change management and benefits realization planning)\n• Support the business teams to write the business paper/business case, develop RFP documentation, vendor on-boarding documentation\n• Develop and maintain key project artefacts such as the Project Plan Documentation, RAID Log and Project Budget\n• Direct diverse teams (inc. vendors) from many backgrounds and disciplines in a team-oriented and relationship-driven environment to produce the respective project artefacts and deliverables\n• Provide regular management reporting to Project... Board, Business Sponsors, Stakeholders, Steering committees and other platforms as required (e.g. Exco, Regional/Group Office reporting, Board)\n• Performs other responsibilities and duties periodicaly assigned by supervisor in order to meet the needs and demands of the department\n\nRequirements:\n\nEducation\n• University Degree and its equivalent\n\nExperience\n• At least 8 years of proven track record in successful delivery of digital/technology projects above S$3mil (setup cost)\n• Experience in both Waterfall delivery and Agile delivery\n• Experience in managing offshore or distributed project teams\n• Proven ability to manage C-suite stakeholders\n• At least 10 years of experience in financial services / insurance industry is preferred\n• Experience in management consulting is preferred\n\nCertification/Licenses\n• Relevant Project Management certifications like Prince2 , PMP, Prince2 is preferred\n• Relevant Agile certifications like CSM or PSM is preferred\n\nSpecial Skills\n• Experience in implementing mobile applications, portals, Artificial Intelligence related projects is highly desirable\n\nBuild a career with us as we help our customers and the community live healthier, longer, better lives.\n\nYou must provide all requested information, including Personal Data, to be considered for this career opportunity. Failure to provide such information may influence the processing and outcome of your application. You are responsible for ensuring that the information you submit is accurate and up-to-date", "extensions": ["4 days ago", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJBSUEiLCJjb21wYW55X21pZCI6Ii9tLzAycjVjZ3giLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJhcV9xWjhzZmFHdUs1OG96QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFc3NCQ293QlFVNVZYMDV4VWxWbk16VnlUVE01YlV4dFgyUmpkak0wY1VsR2NteExVQzFGVkRoQmFFWk5UVE01WjJzemNUSTBaRGt3WlhsWmJ6TjFPRXhOYTBsM2JGSjZjR0ZYWmsxU2FXVTFTVWRPVVRjd1JuRlBka1JKU0cxMlNHeGtUbXByY0ZselYwVTFaekZ2WlRWcVNFZGtUVzVNUTJoUVpERk9ibkZCY25ObFMyeDNUWFo2WHpKcFFtaFRSVllTRmpGWU5rTlpVRGRxUVhOMldIUkJZblZ4V1hKSlJFRWFJa0ZQVFZsU2QwUmhNVXhLVWt0MVFsVjFWM1ZPUjFOc2VGWXdZMnBwYkhGUVpFRSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzM5IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEdsYXNzZG9vciIsImxpbmsiOiJodHRwczovL3d3dy5nbGFzc2Rvb3Iuc2cvam9iLWxpc3RpbmcvcHJvamVjdC1tYW5hZ2VyLWFpYS1KVl9JQzMyMzU5MjFfS08wLDE1X0tFMTYsMTkuaHRtP2psPTQwMzkyMTA0MjFcdTAwMjZ1dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "IT - Project Manager", "company_name": "Ntt Data Singapore Pte. Ltd.", "location": "Singapore (+1 other)", "via": "via Monster", "description": "We are a top 8 global IT services company with operations in 50+ countries. We offer an advanced portfolio of application, business process, cloud, and infrastructure services to businesses and governments worldwide.\n\nNTT DATA Singapore PTE Ltd is a wholly-owned subsidiary of NTT DATA Corp, a part of NTT Group, the world’s 65th Largest Company according to Fortune Magazine. The Singapore entity of NTT DATA is an S10 government-registered supplier and forms the core of NTT DATA’s APAC operations and is positioned as a gateway of our global capabilities in Singapore and the APAC region.\n\nAt NTT DATA SINGAPORE, we pride ourselves on being an inclusive and equal opportunity employer that puts our people and clients first. We welcome different ideas, backgrounds and passionate individuals to join us in our inclusive environment to achieve stronger and better results through teamwork, foresight, and innovation. We pledge to create a harmonious and nurturing culture, where all individuals... feel a sense of pride and belonging, regardless of age, gender identity, race, sexual orientation, physical or mental ability, ethnicity.\n\nWhat do we offer:\n\nContract Employment for 9 months\n\nWork Location: Changi Business Park\n\nDescription\nResponsibilities\n• Develop, execute and closure of project plan. Revise as appropriate to meet changing needs and requirements\n• Drive project scoping and initiation document, business case and business requirements document\n• Manage project team, sponsors and stakeholders across business and technology lines and functions from Front, Middle and Back Office\n• Work across business and technology lines and functions to define, analyse and lead improvements to business processes and procedures in line with best practice, regulatory and legal compliance.\n• Manage project resource and budget, scope, risk, schedule and progress, performance, deliverables, issues, escalations and conflicts\n• Engage team and stakeholders throughout the various stages of projects (including but not limited to facilitating requirements gathering workshops, design specification, identifying target operating model, identifying and facilitating user training need, managing UAT /dress rehearsals/ parallel run/ Go-Live rollout etc)\n• Produce and maintain key project documentation throughout the project lifecycle (i.e. plans, status reports, issue and risk logs)\n• Produce accurate and detailed project reports and presentations to update the team’s project milestones and status to senior management on a timely basis\n• Effectively apply project management methodology and enforces bank’s project standards\n• Perform post-implementation review\nRequirements\n• University Graduate with major in Business Management, Information Systems/Technology or Finance from a recognized university\n• At least 5 years of experience in managing large scale projects directly, responsible for all end-to-end matters of the project (from managing users and technology partners to senior stakeholders and external service providers), preferably in a large, global financial institution.\n• Certification in project management and/or Agile (Product Owner or Scrum Master) methodologies would be advantageous\n• Strong influencing and negotiation skills along with excellent interpersonal and communication skills; strong verbal, written and presentation skills to key stakeholders within the organization\n• Results orientated with the ability to engage multiple initiatives simultaneously and work to deadlines\n• Ability to work independently to gather requirements, prepare project plan, communicate to stakeholders\n• Self-starter, with tenacity to succeed and able to work with people of all cultures across the region\n• Willing to challenge the status quo to drive better outcomes\n• Proficient with all standard office applications such as MS Office (Word, Powerpoint, Excel)\nKnowledge of Treasury and/or Wholesale\n\nMust-haves:\n\nSuccessful candidate will have strong project management experience, familiarity with Fixed Income products and bond origination workflows. High attention to detail is a must as the successful candidate will need to manage multiple workstreams concurrently.\n\nPerks and Benefits\n\nMedical Insurance\n\n5 days’ workweek\n\nRegular working hours. No Shifts", "extensions": ["17 days ago", "Full–time"], "detected_extensions": {"posted_at": "17 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJJVCAtIFByb2plY3QgTWFuYWdlciIsImNvbXBhbnlfbmFtZSI6Ik50dCBEYXRhIFNpbmdhcG9yZSBQdGUuIEx0ZC4iLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Ik1uNFIxd19wZFlGT2FSU1dBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTW9uc3RlciIsImxpbmsiOiJodHRwczovL3d3dy5tb25zdGVyLmNvbS5zZy9hbXAvam9iLXZhY2FuY3ktaXQtcHJvamVjdC1tYW5hZ2VyLW50dC1kYXRhLXNpbmdhcG9yZS1wdGUtbHRkLXNpbmdhcG9yZS0yNzU5NjkyMy5odG1sP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Project Manager (BB-F47AE)", "company_name": "HUMANICA ASIA PTE. LTD.", "location": "Singapore", "via": "via BeBee", "description": "Roles & ResponsibilitiesQualifications:Minimum Degree Required: Bachelor’s degree, preferably in Computer Science or Information Technology. PMP certification is a plus. Required Skills and Experience:You will be a key member of our solution delivery team, playing an important role in helping businesses implement technology solutions. You are responsible for coordinating internal resources and client for seamless execution of projects, ensure that projects are delivered on-time, within scope and within budget. Most importantly, you will be developing project scope and objectives, involving all stakeholders and ensuring operational and technical feasibility. You will be trained on the functionalities of our award winning solution and is expected to take a hand-on approach, partnering our application consultants, in gathering requirements, performing user testing and conducting train-the-trainers session. You need to have a passion in client service and set your sight in delivering a... solution that constantly exceed the clients’ expectation. You should enjoy continual learning and is often excited over new technologies. Proven working experience as a project manager in the information technology section Solid hand-on experience in software development and web technologies a plus. Experience in implementing HCM applications a plus. Ability to speak and write in fluent English Excellent communication skills, written and verbal and ability to liaise effectively with various stakeholders. Team attitude and ability to work with a variety of skillsets and autonomously. Detail-oriented, organized with solid time-management experience and able to work under time pressure. Opportunities to work overseas for short term assignment. Candidate without relevant experience but with keen interest in HCM fields are welcome to apply as Assistant Project Manager.Tell employers what skills you haveBusiness AnalysisChange ManagementCoordinationInformation TechnologyLeadershipManagementProgram ManagementProject ManagementProject PlanningStrategyOn timewithin budgetscopequalificationsSolution DeliveryProactive Maintenance Planning", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIgKEJCLUY0N0FFKSIsImNvbXBhbnlfbmFtZSI6IkhVTUFOSUNBIEFTSUEgUFRFLiBMVEQuIiwiY29tcGFueV9taWQiOiIvZy8xMWgxeTk4Yzl6IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiRnd0dFpvQUVjNkhINWRnZkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRW9zQ0Nzd0JRVTVWWDA1eFVXbzBNVFp5WkdoTE0wSkhSRUozWW5CT05YWnNSRmhpTTFVdFlWUjRUWEpLZWxCTE4zTTRVM2xaVW01TmJqQm9RMlJNVTBReE1FOWZObGxYT1d0UVltMTFhVFZvYTNsalEyVnZVSEJ4UkdaTVUzRmFWbEozZWxKSmN6SXliRkJSYmpSbGNXMTZNMko1WVRreFZWaHpVVGRLUW5Gd1NrMU1NMjVWTlVFM2NrRk9jWE13ZG1sUWJGUkRZVXRFTlVsbmNXSXdiMGhKUmxReE16TkRlalowTmxCdE5YUlVaMjl5Wm5kSmFtNWpRblZQWkZGaFVUaDFibk5oWkZsU1IyTkNSRGd5UTJGd0VoWXhXRFpEV1ZBM2FrRnpkbGgwUVdKMWNWbHlTVVJCR2lKQlQwMVpVbmRFYUZaNlRXeFBVVk5MUVZWSldXbGFYMUZRYzBoaU1qbENNalpSIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNTAiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQmVCZWUiLCJsaW5rIjoiaHR0cHM6Ly9zZy5iZWJlZS5jb20vam9iLzIwMjEwNDE3LTFiMDZlNmYzZjI3MWE2OTlhZWIxNTYzYjIzZmY0N2FlP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Project Manager (Integrated Digital Product Centre), I2R", "company_name": "Agency for Science, Technology and Research (A*STAR)", "location": "Singapore (+1 other)", "via": "via LinkedIn", "description": "TheIntegrated Digital Product Centre translates research outcomes by co-creating with the industry products and solutions that leverage A*STAR digital technologies for commercial applications, economic development, and public benefit.\nThe project manager will drive multiple translation projects, in partnership with internal technical teams and external service/equipment providers, from conceptualization to completion, within budget, schedule and scope.\n\nResponsibilities\n\nConceptualise, plan, direct and manage projects in partnership with internal R&D and engineering teams, and external commercial service/equipment providers, with the aim to translate A*STAR digital R&D technologies into commercial products.\nWork strategically and independently across multiple simultaneous projects covering different technological areas and industry sectors.\nAcquire manpower and budget resources for carrying out the projects by securing collaboration agreements with industry partners and/or obtaining... funding from internal and external funding agencies.\nDefine project objectives, purpose, scope, as well as shared expectations with internal and external stakeholders.\nManage project schedule, manpower resources and budget to ensure that project requirements, milestones and deliverables are met.\nManage the relationships with all internal and external stakeholders, understand their needs and expectations, and resolve conflicts and issues.\nDefine, monitor, and mitigate project risks by working with the project team and stakeholders to create and implement plans to respond to and resolve the risks.\nActively monitor project progress and resolve problems to keep projects moving forward. Report and escalate issues as needed.\nEnsure project deliverables meet or exceed quality standards, and that project management process and procedures adhere to internal governance and policies.\nCarry out progress reporting and status updates to internal and external management.\nCreate and maintain comprehensive project documentation.\nUpon project closure, evaluate project outcomes and implement future improvements.\nJob Requirements\nMinimum Bachelor's degree in Electrical Engineering, Communication Engineering, Computer Science, Information Technology, or related field.\nGood technical background, with an excellent knowledge and skills in a wide range of infocomm and digital technologies.\n8-10 years of experience in the ICT sector, with at least 5 years of proven track record in a project management role.\nPMP certification is preferred though not compulsory.\nExperience in Agile and DevOps methodologies, as well as knowledge of major commercial cloud platforms (e.g. Amazon Web Services, Azure and AliCloud).\nAbility to understand both technical and business issues and interface effectively between technical teams and industry.\nSolid organizational skills including attention to detail and multi-tasking.\nExcellent written, verbal communication and presentation skills.\nAbility to effectively prioritize and execute tasks while under pressure", "extensions": ["7 days ago", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIgKEludGVncmF0ZWQgRGlnaXRhbCBQcm9kdWN0IENlbnRyZSksIEkyUiIsImNvbXBhbnlfbmFtZSI6IkFnZW5jeSBmb3IgU2NpZW5jZSwgVGVjaG5vbG9neSBhbmQgUmVzZWFyY2ggKEEqU1RBUikiLCJjb21wYW55X21pZCI6Ii9tLzBnbWpjZyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjRBOVVHNHFMUDkzcXozYjNBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUNDcUlDUVU1VlgwNXhVMEphTUhobE4xTlFhR3BUVlZwWGMwNWZja1UxUnpWUlJGSklWVkl5V0RGVk5FMUZhVkl4WmtGMFNIWm1jbW8wU3pGa2JqbFJlVEp0ZEVaTk56SlhSM1p2ZGxoS2FuUjFSM2x5UW5kd05tZ3pSVXRNWjJkTmVsSndXVXh3TmkxRlRrNUNXVk5ZVXpWb1ltNDFaRXhGWDBZd1ZGbGpSMUp1WW1KelMzbEhRMngyTlZaTGQxSkZTWGRrTTJoaGRVMWZRV2wzYkZOQ2NVOW1jamMyZVY5b01XOVhTVzEzWVVadk5ISjZPVU01VURWd1FWbEtURXh3TlRoUFdHODFZbVZMWjFKWVkxTXRRVUpRYnpoVVJrMTVTbVJyY0VKWlRXNVFOMll6VjJFMk1YQlNjM2xmWVZwR1RqTllSVGxVVWpoVVoybHdjRkJxYVZkRmJuRlNiMjVwVWtoWmFISlVXa2hmTldSa1EyWkdUemhYVkRKR2RsOXRhRmRGTFhjU0ZqRllOa05aVURkcVFYTjJXSFJCWW5WeFdYSkpSRUVhSWtGUFRWbFNkMEkzVFdvM2QydFNOMjVDTlc5cVdHRjZVRkJ4UjFrNU1EWkhPSGMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY181NiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL3NnLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvcHJvamVjdC1tYW5hZ2VyLWludGVncmF0ZWQtZGlnaXRhbC1wcm9kdWN0LWNlbnRyZS1pMnItYXQtYWdlbmN5LWZvci1zY2llbmNlLXRlY2hub2xvZ3ktYW5kLXJlc2VhcmNoLWEtc3Rhci0yNTA1NTM1NTAyP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Management", "value": "GC18"}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Media, Communications and Writing", "value": "GC20"}, {"text": "Advertising and Marketing", "value": "GC03"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Transportation and Logistics", "value": "GC30"}, {"text": "Art, Fashion and Design", "value": "GC05"}, {"text": "Construction", "value": "GC09"}, {"text": "Education", "value": "GC11"}, {"text": "Human Resources", "value": "GC15"}, {"text": "Protective Services", "value": "GC23"}, {"text": "Property", "value": "GC24"}, {"text": "Science and Engineering", "value": "GC27"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "Project manager", "value": "project manager"}, {"text": "Program manager", "value": "program manager"}, {"text": "Manager", "value": "manager"}, {"text": "Project director", "value": "project director"}, {"text": "Delivery manager", "value": "delivery manager"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Senior", "value": "senior"}, {"text": "Consultant", "value": "consultant"}, {"text": "Coordinator", "value": "coordinator"}, {"text": "Deputy director", "value": "deputy director"}, {"text": "Director", "value": "director"}, {"text": "Group manager", "value": "group manager"}, {"text": "Operations", "value": "operations"}, {"text": "Scrum master", "value": "scrum master"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Services", "value": "services"}, {"text": "Vice president", "value": "vice president"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Engineering Services", "value": "/business/naics2007/5413"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Entertainment", "value": "/business/naics2007/71"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Management", "value": "/business/naics2007/55"}, {"text": "Real Estate", "value": "/business/naics2007/53"}, {"text": "Research", "value": "/business/naics2007/5417"}, {"text": "Retail", "value": "/business/naics2007/44"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": ".AB4Jjf.qPB6Vc{padding-right:11px}.qfpP8d{padding:7px 0 7px 11px}.S003Ke{flex:none}.ZoN4Lb{color:rgba(0,0,0,.54)}.nAXVG{color:#70757a}.IxQsL{color:rgba(0,0,0,.26)}.xFO1De{color:#fff}.ooFpK{color:rgba(255,255,255,.30)}.mtnwac{color:#4285f4}.WxeeKb{color:#34a853}.hIVRU{color:#f29900}.EXaTMc{color:#fbbc04}.sxn46d{color:#000}.gqMTF{color:#1a73e8}.zpn8Mb{color:#d93025}.dEUPmd{color:#1e8e3e}.PJNo1{color:#fbbc04}Actively Hiring", "value": "e"}, {"text": "Michael Page", "value": "/m/04cxldw"}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Nanyang Technological University", "value": "/m/0l49k"}, {"text": "Jobline Resources Pte Ltd", "value": "/g/11gp2647pn"}, {"text": "Randstad Singapore", "value": "/g/11g70b50mr"}, {"text": "GECO Asia", "value": "/g/11gk72_bt_"}, {"text": "Facebook", "value": "/m/0hmyfsv"}, {"text": "HP", "value": "/m/03mnk"}, {"text": "IoTalents", "value": "/g/11dxq187wm"}, {"text": "NCS Group", "value": "/m/0282746"}, {"text": "National University of Singapore", "value": "/m/01q460"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "OPTIMUM SOLUTIONS (SINGAPORE) PTE LTD", "value": "/g/11g70hkrbx"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Apple", "value": "/m/0k8z"}, {"text": "Avensys Consulting", "value": "/g/11g7022gjf"}, {"text": "BNP Paribas", "value": "/m/02qhk4"}, {"text": "Ceridian", "value": "/m/07f8h6"}, {"text": "Ensign InfoSecurity", "value": "/g/11g4jhymjr"}, {"text": "Humanica Asia Pte. Ltd", "value": "/g/11h1y98c9z"}, {"text": "Kerry Consulting", "value": "/g/11c73vtzc8"}, {"text": "Marsh and McLennan", "value": "/m/053rw"}, {"text": "NSEARCH GLOBAL", "value": "/g/11dxpksll4"}, {"text": "NTT", "value": "/m/05mybp8"}, {"text": "OakTree Consulting", "value": "/g/11g70jfhtq"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "TEKsystems", "value": "/g/11b6g4bkv0"}, {"text": "Teradyne", "value": "/m/04bzqp"}, {"text": "Toshiba Tec Singapore Pte. Ltd", "value": "/g/11g9n9q547"}, {"text": "Trustwave", "value": "/m/0n3xjf5"}, {"text": "Wood Plc", "value": "/m/07vv9s"}, {"text": "Workiva", "value": "/m/0113m1rd"}, {"text": "A-it Software Services Pte Ltd", "value": "/g/11dxpy_gl_"}, {"text": "ABS Group", "value": "/g/11dxplj1z6"}, {"text": "ACI HR Solutions Ltd", "value": "/g/11c73ryh3p"}, {"text": "AIA", "value": "/m/02r5cgx"}, {"text": "ASEAN CABLESHIP PTE. LTD.", "value": "/g/11b7dsfph2"}]}]}