{"search_metadata": {"id": "60827912c504e977bcc68411", "status": "Success", "json_endpoint": "https://serpapi.com/searches/7065b1a8b8c36d2a/60827912c504e977bcc68411.json", "created_at": "2021-04-23 07:36:50 UTC", "processed_at": "2021-04-23 07:36:50 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28product+manager%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=20", "raw_html_file": "https://serpapi.com/searches/7065b1a8b8c36d2a/60827912c504e977bcc68411.html", "total_time_taken": 1.08}, "search_parameters": {"q": "(product manager) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "20"}, "jobs_results": [{"title": "Sr. Manager Product Management Unified Communication", "company_name": "Tata Communications", "location": "Singapore", "via": "via LinkedIn", "description": "Job Family Descriptor\n\nPosition Summary\n\nResponsible for entire product life cycle management - development and management of products as per new product/service requirement and enhancement of existing products and features.\n\nAlso responsible for augmentation of network capacity to meet growing customer needs, new technology introduction, or increasing operational efficiencies, with the objective of ensuring increase in product and service profitability, revenue and market competitiveness; and developing and delivering effective multi product solutions to meet customer requirements.\n\nDrive P & L management through product strategy development and manage a group of products within a technology area across multiple regions. Works with the sales team on market strategy, pricing and positioning of the product.\n\nEngage and partner with technology providers to recruit new features or new product. Assess performance of product/service portfolio against annual operating plan and discuss... achievement of targets with Sales.\n\nBroad outline of the Role\n\nDrive P & L management for product portfolio through product development and management, sales support and enablement discussions with Sales, Customers, Engineering, Operations Technology and Service Development.\n\nTactical role which provides a marked contribution to defining the product strategy, direction of new products, processes, standards or operational plans based upon business strategy, with a significant midterm impact on business unit overall results.\n\nIdentifies problems and suggests inputs to product development and engineering team to significantly improve process or fulfil service realisation and operationalise product/service and associated costs individual contributor in regions Involved in planning and strategizing of new and existing products. Impact of decisions made is mid-term in nature.\n\nTypically has small to medium profit and loss responsibility for a product portfolio May lead regional projects for a specific product portfolio\n\nPurpose - Broad objective of the role\n\nOperating Network - Key External\n\nOperating Network - Key Internal\n\nSize and Scope of Role - Financial\n\nSize and Scope of Role - No. of direct reports\n\nSize and Scope of Role - Total team size\n\nSize and Scope of Role - Other size parameters\n\nMinimum Qualification & Experience\n\nBachelor’s degree in Engineering majoring in technology and/or telecommunications with strong working experience involving telecommunications and IT services operations\n\nAt least 10 years in telecommunications industry in techno-commercial assignments and other related ICT experience\n\nStrong working knowledge and ideally with Microsoft 365 Certified Teams Administration certification, MCSE, MCP or Skype for Business and other related certifications for business collaboration\n\nUnderstanding of systems polycoms and video collaboration (MS Team systems)\n\nProblem solving and resourcefulness in conditions of ambiguity, defining approaches and processes where none exist.\n\nProfessional attitude, with excellent interpersonal skills able to present and influence internal to the company, and with external partners and customer.\n\nPossesses good communication skills (oral and written", "extensions": ["14 hours ago", "Full–time"], "detected_extensions": {"posted_at": "14 hours ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTci4gTWFuYWdlciBQcm9kdWN0IE1hbmFnZW1lbnQgVW5pZmllZCBDb21tdW5pY2F0aW9uIiwiY29tcGFueV9uYW1lIjoiVGF0YSBDb21tdW5pY2F0aW9ucyIsImNvbXBhbnlfbWlkIjoiL20vMDQzMzhrIiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiM2xHUzhqXzJpS0tMamRTMkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZRQkNyY0JRVTVWWDA1eFVuUjJlak5GVDJaNlVIRkphMmxmVDJWc1NXMTZPSGsxTkdaVk1IbGlWWFJYU0RVMGFrcEhjRVZzYUZFMVRIZzNZVUZpV21kd1UxTndiM1pPZVdsNVNFRlRlVGxtY2toTVYwVnpVMko2TVhGZmFHUlFWMHR3YTJKR05UaHZNVFpPZEcxMVVYbHpWVk41ZWxVMWFrNTBWVTV4ZWtsQ05WOU5iblJYTlRSNFRuVjJhM0o0TlRKQ2JGVjNaRWROTUZBeVlXSm1Xa1o0VkZoR2RrczJNMWxDVVhocFZqUktZbGRsUldrMVUyUnhTQzFSRWhSRmJtMURXVWxZVUU5Tk1uQmZVV0ZYTTB3eFFSb2lRVTlOV1ZKM1FuTkJPR2REV2pCWExYVkNhblJhTWsxQ1VsTnVjbll3U1hVd1p3IiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL3NnLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvc3ItbWFuYWdlci1wcm9kdWN0LW1hbmFnZW1lbnQtdW5pZmllZC1jb21tdW5pY2F0aW9uLWF0LXRhdGEtY29tbXVuaWNhdGlvbnMtMjUxNTcwNjcwNz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Product Manager", "company_name": "Yuanyi Agency", "location": "Singapore", "via": "via Yuanyi Agency", "description": "Job Description\n\nWe are looking for a Product Executive/ Product Assistant Manager with a strong technical background as well as excellent communications and some management skills. You are expected to work closely with our Project Director and CEO on our Mobile App and Web App Product developments as well as supporting our IT development plans, with autonomy in shaping our future product plans\n\nResponsibilities:\n• Work on Product development and Project management with in-house employees and external vendors.\n• Function as the key point of contact for working, liaising and coordinating with all relevant stakeholders\n• Manage our vendors, testing and debugging of our digital products under development to ensure quality deliverables, following defined processes of working\n• Drive project discipline to document scope changes, issues and risks that affect implementation and work closely with vendors and management to determine and resolve issues associated with project implementation\n•... Develop metrics and reporting for features\n• Handle rollout for our product in the Japanese market\n• Analyze data to optimize business and operational procedures\n• Advise CEO and project team on technology and innovation\n• Create a technological masterplan for innovative transformation\n• Structure and plan company IT development strategies\n• Have an eye for detail while keeping the big picture in mind\n• Define key requirements and go deep into details as needed\n• Provide IT support to the rest of the team as and when needed\n\nDesired Qualities:\n• Eye for detail\n• Analytical skills to understand & generate insights from user data\n• Self-driven and motivated, with a knack for strategic, technical and creative problem-solving\n• Strong work ethic and high level of initiative\n• Excellent troubleshooting and analytical skills\n• Value team success over individual accomplishment\n• Work hard, play hard\n• Strong prioritization skills, taking complete ownership of the product\n• Sound product and execution skills and ability to perform under tight deadlines\n\nDesired Skills:\n• BS in Computer Science or related field\n• Minimum 3+ years of experience in end-end product development\n• Experience in project management and task delegation with good issue tracking skills\n• Familiarity in Agile and Scrum development processes\n• Experience in managing development teams\n• Experience in DevOps processes\n• Hands-on experience and strong understanding of the technical aspects of product development - experience with project management tools such as JIRA/Confluence, Azure DevOps, GitLab\n• Ability to balance priorities and multiple-tasks\n• Data analytics skills (Python, R, Excel, SQL)\n• Fluency in English\n\nGood to Have:\n• Fluency in Japanese will be a plus but not necessary\n• Any Project Management certification like PMP or CSM\n• Experience in Mobile app development (iOS/Android", "extensions": ["28 days ago", "Full–time"], "detected_extensions": {"posted_at": "28 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9kdWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJZdWFueWkgQWdlbmN5IiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiI4aWEyZlBmaWVMc2JCcDdqQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFl1YW55aSBBZ2VuY3kiLCJsaW5rIjoiaHR0cHM6Ly95dWFueWlpYWdlbmN5LmNvbS9qb2JzL3Byb2R1Y3QtbWFuYWdlci8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Assistant - Manager - Product", "company_name": "Sistic.com Pte Ltd", "location": "Singapore (+1 other)", "via": "via Monster", "description": "• Lead ideation, development, launch, and iteration of approaches to improve revenue and user experience for our site across desktop, mobile and apps\n• Conduct market and competitor analysis to assess market needs and ensure products are competitive\n• Gain a deep understanding of the user experience, identify and fill product gaps and generate new ideas that grow market share, improve customer experience and drive growth\n• Influence stakeholders through constant evangelism to build cross-functional buy-in and commitment to a shared product vision\n• Develop and implement quarterly product roadmaps to provide a balance of business needs and customer/consumer experience priorities within the context of delivering SISTIC's strategic themes\n• Think multi-platform. We're across online, mobile, video, social and events - so how can we build great products and content cleverly across all these mediums.\n• Test and measure everything and integrate quantitative and qualitative analysis into all... product and management decisions\n• Work closely with the Product Design and UX team and keep an ear out to our users through social networks, conversations with our sales team, events and face-to-face to continuously make improvements, get new ideas and get a better understanding of our consumers\n• Manage the entire product lifecycle, from identifying user needs, planning the business case to creating products and services that are valuable, usable and feasible\n• Work closely with the Client Service, Business Development & Marketing team to communicate product benefits, positioning and targets\n• Take the initiative in delivering communications and conducting regular brainstorming sessions across the organisation on product features and performance, as well as acting as the key liaison for training needs as emerging products are launched\n\nJob Requirements\n• Bachelor degree, MBA beneficial\n• 4+ years of product management experience\n• In-depth knowledge of web standards in design and usability\n• Agile or scrum certification preferred\n• Expertise in product development tools (like JIRA, Confluence) preferred\n• Understanding of SEA online/mobile lifestyle, entertainment and sports. Interest in ticketing services market and competitive landscape a plus\n• Expert on modern forms of product planning, customer discovery, product discovery, product development process and execution\n• Strong analytical, business, project management, and organizational skills\n• Exceptional influencing skills\n• Self-motivated, positive-thinking, team player, leader, problem-solver\n• Entrepreneurial and commercially minded, highly creative, and able to innovate quickly\n• Passion for data, testing, and building a world-class customer experience", "extensions": ["4 days ago", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBc3Npc3RhbnQgLSBNYW5hZ2VyIC0gUHJvZHVjdCIsImNvbXBhbnlfbmFtZSI6IlNpc3RpYy5jb20gUHRlIEx0ZCIsImNvbXBhbnlfbWlkIjoiL2cvMTFnazc0eno5OCIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6InBSYUdhLW9oNE5ERTR5SUZBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2UUJDcmNCUVU1VlgwNXhVVlpwWldwWVJIZFZXbDh5VEZSSmJVWndSVkV0WXpSSVIzWXlObFpKU1dGVGJIcGFWMEUyZVZvMmFreGZNMmcwVTB4V09VUnVZMU5DZDNoUFMxSnhVR1JLUzBzeFYxOHlNbE13UjBkT1dFSnpWM281WldOamFtMUxjbGRyVWkxbU9IWmZhbWRJY1ZOM1dESm5jV2RWYzNWYUxUSnNSVm8yYVV0VlozUm9aSGxEVFhkb2JGUnBOSEk1U0VONGRGcDVkVVZyTlc4MmJIWTVkMmRyTm10MFkweHpTUzF2ZFhkTVZuWnRUMmRLYVUxWkVoUkZibTFEV1VsWVVFOU5NbkJmVVdGWE0wd3hRUm9pUVU5TldWSjNRV2RPYWxaV1ExcGxUSGRoVVhvd2FFaDNkRnBoVjNST2FWOUpVUSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzE3IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1vbnN0ZXIiLCJsaW5rIjoiaHR0cHM6Ly93d3cubW9uc3Rlci5jb20uc2cvYW1wL2pvYi12YWNhbmN5LWFzc2lzdGFudC1tYW5hZ2VyLXByb2R1Y3Qtc2lzdGljLWNvbS1wdGUtbHRkLXNpbmdhcG9yZS0yNzc4OTIxMS5odG1sP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Product Manager, eChannels - Global Transaction Services (GTS) - Singapore", "company_name": "DBS Bank", "location": "Singapore", "via": "via JobWiz", "description": "Business Function Global Transaction Services (GTS) comprises of Cash & Trade, Securities Services and Fiduciary Services. In an increasingly borderless world marked by burgeoning trade flow, expertise in trade finance services is an invaluable asse Business Function Global Transaction Services (GTS) comprises of Cash & Trade, Securities Services and Fiduciary Services. In an increasingly borderless world marked by burgeoning trade flow, expertise in trade finance services is an invaluable asset. With cash the lifeblood of every company, so too, is a good understanding of how to manage these cashflows. Trade Finance, together with Cash Management, is the mainstay of GTS, and is extended to SME and corporate clients for their local and cross-border financial transaction needs. Responsibilities %26bull; The selected candidate will join the GTS eChannels team to manage the existing online and connectivity channels, drive enhancements in functionality and usability whilst driving... commercialisation and utilisation. %26bull; Involved in the entire product lifecycle of Corporate Online Banking products, from conception to the successful delivery, which also includes product management; %26bull; Experience with Cash Management, Trade Finance and Supply Chain with focus on user experience with various products including domestic transfers, international transfers, real time transfers, payables and receivables financing; %26bull; Experience in mobile channel product management and usability in the digital space; %26bull; Excel in stakeholder management with Technology, Sales, Operations, and Implementation; %26bull; Define, design and deliver innovative solutions. PRODUCT MANAGEMENT: %26bull; Primary responsibility includes driving greater penetration and usage of online banking regionally; %26bull; Assist in the tracking, analysis and reporting of product performance throughout its lifecycle including product strategy, product planning, pricing, bundling and issue prioritization; %26bull; Work with various internal stakeholders and leverage on tools such as direct marketing and campaigns to drive awareness, penetration and usage; %26bull; Draft and execute internal and external product communication and information. PRODUCT DEVELOPMENT: %26bull; Development of business cases and requirement specifications to support new product recommendations; %26bull; Manage product commercialization and operationalization to bring the product to market; %26bull; Define and prioritize product road map with reference to customer needs, competitive landscape, regulations and bottom line to increase stakeholder value. Requirements %26bull; Eight plus years%26rsquo; experience in the financial services or consulting or software industry; %26bull; Previous experience in Product Management; %26bull; Online Banking experience within Corporate space with a focus on User Experience (UX %26bull; Experience with various delivery channels including mobile, internet, and host to host; %26bull; Certification in Project Management is a plus but not mandatorySingapore-DBS Asia Central\n\nMonster", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9kdWN0IE1hbmFnZXIsIGVDaGFubmVscyAtIEdsb2JhbCBUcmFuc2FjdGlvbiBTZXJ2aWNlcyAoR1RTKSAtIFNpbmdhcG9yZSIsImNvbXBhbnlfbmFtZSI6IkRCUyBCYW5rIiwiY29tcGFueV9taWQiOiIvbS8wMXE3bjUiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJmb1FrU2doQnJ3ZU9veWJLQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdDhCQ3FJQlFVNVZYMDV4VW1sc1QxTjFibGRvUVVWalNXWjNSbGR6TFV0Zk4wdFlURlpsYWpobFZHUTRjVGRpT0ROUWFIQnFNMHh4YWpaWFNFbFZSSEl0YkVkUWRXVk5jazR6ZW14Rk9YQkxhRmQ1TTFkRFRXWkpVVUoyV21salZsSlJPV3BDVWtReVgzSjJabVYxZUc1cVJUYzRlbGxST0hoRWVWQk5Va3BZZGpSTlFUazNkVlF4WlVaRlZVUk1RbGgzV2pGdFlWRlBOM2RqY0VOeVFWWjBVMFpQYVVsbkVoUkZibTFEV1VsWVVFOU5NbkJmVVdGWE0wd3hRUm9pUVU5TldWSjNSRlZvVEhOMFZGUnpOM0Y0YTFWS1JHdG1UMUJGTkZGeFNtVkVkdyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzI0IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYldpeiIsImxpbmsiOiJodHRwczovL2pvYndpei5zZy9qb2IvQ1ItODMyMjUyNzE2P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Senior Product Manager", "company_name": "TEKsystems (Allegis Group Singapore Pte Ltd)", "location": "Singapore", "via": "via Laimoon.com", "description": "Our client is an early stage startup who is redefining the way customers behave in a very consumer-centric market. They are looking for ambitious and driven talents who are excited about cutting edge developments in Technology, and always keen on learning new tools and technologies to deliver a great end-to-end experience for customers. Backed by an iconic brand with strong funding, the company is in hypergrowth stage and very well-positioned to disrupt a $250 billion industry once they launch.\n\nThe position will require the candidate to:\n• Build products and features for a lifestyle-tech platform that solves real customer problems (B2C)\n• End-to-end product management experience from ideation to execution and delivery to bringing it onto the market\n• Able to also add on UI/UX Thinking to Product strategy\n• Strong business acumen and able to think strategically about commercial elements\n• Be comfortable with data and experienced with leveraging data to make informed decisions\n•... Experience working with high-traffic platforms\n• Finally, most importantly, able to collaborate with stakeholders while still maintaining a consumer-centric focus\n• At least 5+ years of pure product management experience\n\nTechnology", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgUHJvZHVjdCBNYW5hZ2VyIiwiY29tcGFueV9uYW1lIjoiVEVLc3lzdGVtcyAoQWxsZWdpcyBHcm91cCBTaW5nYXBvcmUgUHRlIEx0ZCkiLCJjb21wYW55X21pZCI6Ii9nLzExYjZnNGJrdjAiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJ0eklvZVRnQktSNVhiM21mQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFc2tDQ293Q1FVNVZYMDV4VkV4TmNUVnBkMDh5Y2twaWRqVlZlbG8zTWpGcFdTMXJaRXR1UXpjd1l6QnVXVEpUVUZCc1pGODJhSEo1TURoNVUyaEdlRzF1T0hkdlIxcG1TM1JrVm5KRlp5MDJXRVJTYVhWamMxQTRTaTFIWTJzMU1tVk9NMDFCUW5Ob1lXODRhVXhaWms4MlprZEdka3AxVFVOd05sZFpVV1l0Tkc4dFlTMXBSWEZKU0VsTmFIa3hXV1JPYmtJMlJ6WkROV05JZEVKaGNrZG5XV0k1WWtKSFRtbHZjblJIVkdGaWMxVlJhV2hwVXpOYU5YVk1TM2xvZG5kbE9UQTVkbWx2YWtGRU9HOXJhVU4wVWtFeFpUaHpkazFPWjNWRE1FUXRSRFl3Y0hsaVZsUjFjRU5VUzNOM2MwdGpSbmwzUTNCbGRsUlhNMHMxV1VaRVZXdDJVVmRzTlRsdVYxTmxZbEJ2YlJJVVJXNXRRMWxKV0ZCUFRUSndYMUZoVnpOTU1VRWFJa0ZQVFZsU2QwUm5WV3hIWHpoQlMyRlRiRTg0VTNaVk5YZEJRV2RKTUhkbVZsRSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzMyIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExhaW1vb24uY29tIiwibGluayI6Imh0dHBzOi8vam9icy5sYWltb29uLmNvbS9qb2JzL2V4dGVybmFsdmlldy8yNjEwOTI4NT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Product Manager", "company_name": "Hg Exchange", "location": "Singapore", "via": "via Jobs | Fidanto", "description": "We are looking for a Product Manager to lead, manage, and support various products and initiatives for the exchange, which may span across related companies, as well as different departments and functions, including exchange operations, technology infrastructure, etc.Roles & ResponsibilitiesCoordinate closely with all stakeholders of the exchange: Management, Technology, Business Development, Legal/Compliance and others to identify new business opportunities, areas of improvement and to resolve open issues as they arise.Prioritize, plan and manage major projects with input from Member Firms and stakeholdersBalance technology, user experience and revenue generation goals — innovate, make informed decisions and continuously measure processes and activities that have a significant impact on those decisionsReduce entropy by managing the huge influx of ideas and data, and prioritising every task so that all stakeholders are always clear about their current goals and what's coming up... nextManage exchange development and delivery closely with technology team members while consistently prioritising feature demands and backlog together with expected timelinesEngage and challenge stakeholders to surface problems and refine ideas, while complement that with data and researchSkills & Experience RequiredAt least 5 years in the field of Product Management, preferably in a high-growth technology companyExperience working in financial institutions, preferably in private equities and/or stock brokerageStrong understanding of product life cycles and methodologiesStrong understanding of a variety of digital solutions and processesAble to manage multiple products concurrently, using product management tools like JIRAAgile development experienceStrong understanding of digital processes and tools such as UX and their impact to strategic objectivesBasic technical skills including PHP, HTML, CSS, JavaScript , SQL and/or SAS.Participate in reviewing QA and leading UAT plansPreferably certified in Product Management (PMP/Prince2/CITPM)A sense of ownership and take on responsibilities and challenges, thrive on logic, accept and create changes with flexibilityThe Ideal Candidate Should BeAble to multitask, handle additional roles and work independently in often in a time-sensitive environmentPassionate about finance, trading and blockchain technologyIf you are interested, please send your resume to hr@hg.exchange.Only successful applicants will be contacted", "extensions": ["2 days ago", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9kdWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJIZyBFeGNoYW5nZSIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiVUlqU09pdUdrcjcxNWxfUEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIHwgRmlkYW50byIsImxpbmsiOiJodHRwczovL3NnLmZpZGFudG8uY29tL2pvYnMvam9iLW9wZW5pbmcvZmlyc3RsaW5lLXN1cGVydmlzb3JzLW9mLXByb2R1Y3Rpb24tYW5kLW9wZXJhdGluZy13b3JrZXJzL3Byb2R1Y3QtbWFuYWdlci0yNzc0NjgwMDQ/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Product Manager, Business Integrity", "company_name": "TikTok", "location": "Singapore", "via": "via Bayt.com", "description": "TikTok is the leading destination for short-form mobile video. Our mission is to inspire creativity and bring joy. Product Managers at TikTok connect ambiguous opportunities to ambitious outcomes. They do this by working with teams of diverse talent to identify clear goals, develop comprehensive strategies, and ensure successful execution. The Business Integrity team's mission is to inspire business trust and joy by upholding ethical advertising on TikTok, and we're looking for teammates who are passionate about fostering best faith business practices toward our global audience. Product Managers in Business Integrity will be part of an experienced team, working alongside experts in engineering, data science, operations and policy. At the same time, new team members will also be joining an initiative that has only just gotten started--we have far more questions than answers--even as new challenges appear each day. Thus, candidates must be hungry for perspective when forming their... product hypotheses, but also relentless in driving those hypotheses toward tangible results. The ideal candidate is adept at defining and refining why the product decisions they make and develop are the way they are, and can attract believers who each bring their own ideas. Responsibilities\n- Define success by leading team definition of product scope, strategy and solutions\n-Define success by leading team definition of product scope, strategy and solutions\n-Nurture team empathy for needs and wants of both customers and competitors\n-Keep teammates from disciplines spanning engineering to operations set up for success\n-Align team development with company priorities through concise communication\nExperience & Education\n- 3-10 years experience in product management, having launched at least one product from scratch\n- Experience building solutions addressing content quality or authenticity a plus\n- Experience building solutions based on artificial intelligence or machine learning a plus\n- Bachelors or Masters degree\n- Degree in Computer Science or Engineering a plus Qualifications\n- Experience working side-by-side with engineers\n- Experience synthesizing data both quantitative and qualitative to inform product decisions\n- Outstanding interpersonal skills communicating both in person and in writing\n- Ability to influence without authority\n- Intellectual humility, honesty and curiosity", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9kdWN0IE1hbmFnZXIsIEJ1c2luZXNzIEludGVncml0eSIsImNvbXBhbnlfbmFtZSI6IlRpa1RvayIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiWEhVd0o4c3hiT0xlMlFSV0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCYXl0LmNvbSIsImxpbmsiOiJodHRwczovL3d3dy5iYXl0LmNvbS9lbi9zaW5nYXBvcmUvam9icy9wcm9kdWN0LW1hbmFnZXItYnVzaW5lc3MtaW50ZWdyaXR5LTU2OTM3MDg4Lz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Product Localisation Manager", "company_name": "Apple", "location": "Singapore", "via": "via Jobs At Apple", "description": "Summary\nPosted: 20 Mar 2020\n\nRole Number:200030313\n\nThe right product, at the right place and at the right time. That’s our mantra at Pacific Operations. Want to be a part of what it takes to bring Apple’s products to the hands of millions of customers across Greater China, North East Asia, South East Asia and Australia & New Zealand? Read on, to learn more. The Product & Launch Readiness (PLR) team is responsible for leading cross functional teams to align on the product launch strategy (timing, volume, channel coverage etc) and closely track execution, ensuring operational risks are raised and mitigated.\n\nAs a Product Localization Manager, you will lead the full compliance of our hardware products with regulations required for each country in the Pacific region (Japan, Australia, New Zealand and Asia Pacific). You will also support speed to market improvements for product launches and seamless updates to current products. You will develop in-depth knowledge in select countries and... products and become the go-to subject matter expert connecting compliance requirements to business impact. Finally, you will drive optimal business decisions regionally and globally with sound business recommendations detailing requirements, impacts, timelines and risks.\n\nThe Pacific Region’s business is growing, with all teams scaling up to support this dynamic market. This role offers the opportunity to solve some of the most challenging issues due to the complexity of emerging markets and its dynamic business environment. PLM leads the cross functional collaboration to identify solutions which ultimately include the proper localization and customization of the Bill of Materials (BOM) to ensure readiness for the market.\n\nThis role requires close collaboration across functions: Product Marketing, Operations (e.g. Supply & Demand Planning, Logistics, Reseller Channel Management), Legal, Compliance (e.g. Environmental, Regulatory, Safety & Trade) and Government Affairs.\n\nKey Qualifications\n\nKey Qualifications\n• Driven professional who is comfortable working in a fast-paced & dynamic environment\n• A leader who can quickly understand the intricacy of issues/requirements, develop the business case and drive a plan to resolution\n• Exceptional project management & analytical problem solving skills\n• Excellent time management, ability to be “hands on” with great attention to detail and ability to handle incomplete / ambiguous information with agility and comfort\n• Remarkable ability to build relationships and operate in a matrix organization (e.g. influence without authority)\n• Experienced in risk assessment and developing mitigation plans\n• Exceptional communicator (both written/verbal)\n• Does not accept status quo and can drive business process improvements\n• Minimum 8-10 years of professional experience in developing the required Skills & Competencies, including international professional experience (Pacific Region is a plus)\n• Experience and knowledge of multiple disciplines within supply chain operations (order to fulfilment, supply/demand planning, logistics, manufacturing, etc.) and product management (localization, certification and new product launches) is a plus\n• Business proficient in Mandarin is a plus\n\nDescription\n\nDescription\nDefine each NPI (new product introduction) localization requirements with WW and regional cross-functional teams\nEnsure flawless execution of NPI launch with accurate BOM creation\nExecute BOM roll-in or cut-in requirements\nPerform First-Article-Inspections (FAIs) on new localized product components\nCollaborate with global teams on the implementation of Pacific regulatory markings & artworks\nWork with Regulatory Compliance, Legal, Environmental, Safety, Government Affairs and Trade Compliance teams on resolving and mitigating issues relating to product regulatory requirements\nDevelop & execute localization solutions that are feasible (simple vs complex), scalable and cost effective to ensure products meet 100% of the in-country regulations\nIdentify and communicate risks and priorities to drive on-time and compliant delivery of products\n\nEducation & Experience\n\nEducation & Experience\nBS/BA degree required; MBA or advanced degree a plus.\n\nAdditional Requirements\n\nAdditional Requirements", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9kdWN0IExvY2FsaXNhdGlvbiBNYW5hZ2VyIiwiY29tcGFueV9uYW1lIjoiQXBwbGUiLCJjb21wYW55X21pZCI6Ii9tLzBrOHoiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJRclpTbFZjVHgzZGxTUkhUQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFc2tCQ293QlFVNVZYMDV4VkRCWVZFRlVSRXBpWDNwRmRFWnZPVTlFUkRSc1EyMTVVa0ppVVZCSVlrSmxXbnB1UjFOUWRrY3hRakpzU1dWUmJGWkZOR3hIZG1ZMlIyeEVZa296YnpoMlUwUmxOM2s0Ylhkb1ZWRXpjbkpNTmtndFZITTBZa3RtT0hCZlRFZEthRUZZYm5ReVdWWkNSeTFzVEdGVlJXMW1XbEZZVFVnMVNFNVZWRlI1YlVkVE9HcHhZa0VTRkVWdWJVTlpTVmhRVDAweWNGOVJZVmN6VERGQkdpSkJUMDFaVW5kRVpraGxNM2xaYVhsM2NYcHNWa1JvZEhNNFFtZzFVM1JLWkdaMyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzQ4IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnMgQXQgQXBwbGUiLCJsaW5rIjoiaHR0cHM6Ly9qb2JzLmFwcGxlLmNvbS9lbi1zZy9kZXRhaWxzLzIwMDAzMDMxMy9wcm9kdWN0LWxvY2FsaXNhdGlvbi1tYW5hZ2VyP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Food Production & Manufacturing Plant Manager - WEST MNC", "company_name": "Recruit Express Pte Ltd", "location": "Singapore (+1 other)", "via": "via JobsCentral", "description": "• Production planning and making sure the operation goes smoothly\n• Responsible to implement safety and environment practices in the workplace\n• Constantly monitor the products packed are within quality norms\n• Support market needs by producing the required quantity and type of product according to the agreed production programme\n• Constant monitoring of usages of materials, water, energy and manpower\n• Increases productivity through optimum organization of labor, improves and rationalizes work method, minimize plant downtimes\n• Establishes and updates manufacturing instructions to ensure correct operation procedures are used by operators\n• Ensure staffs are well trained and motivated with high standard of discipline and morale\n• Ensures all industrial safety or health precautions in plant are maintained and additional necessary safety measures are installed and implemented to achieve zero accident rates\n\nJob Requirement:\n• Diploma or Degree in Food Science, Applied Science, Food... Technology, Biochemistry or Chemical Process Technology\n• At least 2 years of relevant experience with good attitude to work and ability to interact with people\n• Green Belt (DMAIC) certification will preferred\n• Demonstration of leadership ability by leading a project within a factory environment\n• Demonstration of Leadership skills in positively confronting inappropriate behavior and using everyday coaching to ensure involvement of the workforce\n\nInterested candidates please submit your resume to [Click Here to Email Your Resume]\n\nJace Choo Oi Kei\n\nPersonnel EA License No.: R1875164\n\nRecruit Express Pte Ltd (EA Licence No.: 99C4599", "extensions": ["4 days ago", "$5.8K–$6.8K a month", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time", "salary": "$5.8K–$6.8K a month"}, "job_id": "eyJqb2JfdGl0bGUiOiJGb29kIFByb2R1Y3Rpb24gXHUwMDI2IE1hbnVmYWN0dXJpbmcgUGxhbnQgTWFuYWdlciAtIFdFU1QgTU5DIiwiY29tcGFueV9uYW1lIjoiUmVjcnVpdCBFeHByZXNzIFB0ZSBMdGQiLCJjb21wYW55X21pZCI6Ii9nLzExZzcwNmh6aHEiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJlLXpQMHMtVlJrSFV6RUFuQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFb2tDQ3N3QlFVNVZYMDV4VTJKa1NFRjVkSHAxVDAxT2RuWXRhRU0xVGtGa1kzcG1NV05qZVMxT1JXSkxNemxVUTBWWFltUjBMWE5HZGxsb1UySnljRVU1WWxWSFpHWk5kVEE0VEZOVVVETkVia3R3UzJaVGNIbEZSMlI2VmxCMmJGUmtkV05VWm1FNFFWaDRiMU5yU2xGQ2FIRkhXbE14ZFcxaFZYVktOWGx5TjBsNWEyTk5TMk5oTm5sRVMwdzVaR1pNVWpRMU5VeHNkbGRDVUhOdWJFRlZkekZHY25SdmRFazRZVWRET1hSUWVYSm9MVUpvVkdwZlVHTjJPRzgwWmtkbmJUa3dlalJRTmxvMVZqaFVhalpZRWhSRmJtMURXVWxZVUU5Tk1uQmZVV0ZYTTB3eFFSb2lRVTlOV1ZKM1JISm5NRUpTY25OVk1HSlVkRlZvTWpSd1lsVk5TRWxGTFZacVFRIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNTUiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9ic0NlbnRyYWwiLCJsaW5rIjoiaHR0cHM6Ly9qb2JzY2VudHJhbC5jb20uc2cvam9iL2Zvb2QtcHJvZHVjdGlvbi1tYW51ZmFjdHVyaW5nLXBsYW50LW1hbmFnZXItd2VzdC1tbmMtajN3NHl5NXdmdGt5MTR2OTVtaj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Operational Risk Manager - Product Control", "company_name": "Sciente Inc", "location": "Singapore", "via": "via SCIENTE", "description": "A well established organization in the banking domain is seeking a dynamic operational risk manager (UORM) for their Product Control division.\n\nMandatory Skill(s)\n• Degree in finance or accounting ;\n• At least 5 years of experience in operational risk management and governance in the financial services sector;\n• Proficient in risk controls and processes associated with product control function;\n• Basic understanding of accounting and treasury transaction life cycle;\n• Strong communication and interpersonal skills;\n• Out of the box thinker with good attention to details.\n\nDesirable Skill(s)\n• Prior experience in banking;\n• CFA certification;\n• Ability to leverage analytics to gain insights.\n\nResponsibilities\n• Responsible for the risk management and governance related to the Product Control processes;\n• Assess existing risk monitoring tools and processes for effectiveness and drive related enhancements;\n• Validate risk events for factual accuracy, identify cause and remedial... measures/action plans to prevent recurrence;\n• Continuously monitor risks and identify weaknesses in risk controls and processes;\n• Conduct risk related processes like Risk & Control Self-Assessment (RCSA), Business Continuity Planning (BCM) and Quality Assurance Review;\n• Act as a central liaison party to collaborate with internal and external personnel for audits, regulatory inspections;\n• Track and monitor the execution of action plans and audit based recommendations;\n• Keep abreast of vulnerabilities in product control processes and continuously enhance the risk governance framework", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJPcGVyYXRpb25hbCBSaXNrIE1hbmFnZXIgLSBQcm9kdWN0IENvbnRyb2wiLCJjb21wYW55X25hbWUiOiJTY2llbnRlIEluYyIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiX3BGMmR4clJVTzZhMXRtaUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBTQ0lFTlRFIiwibGluayI6Imh0dHBzOi8vd3d3LnNjaWVudGUuY29tL3NjaWVudGUtaW5jL3RlY2hub2xvZ3ktam9icy81NDYxL29wZXJhdGlvbmFsLXJpc2stbWFuYWdlci0tLXByb2R1Y3QtY29udHJvbC8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Management", "value": "GC18"}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Business Operations", "value": "GC06"}, {"text": "Advertising and Marketing", "value": "GC03"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Accounting and Finance", "value": "GC01"}, {"text": "Legal", "value": "GC17"}, {"text": "Farming and Outdoors", "value": "GC13"}, {"text": "Human Resources", "value": "GC15"}, {"text": "Sales and Retail", "value": "GC26"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "Product manager", "value": "product manager"}, {"text": "Manager", "value": "manager"}, {"text": "Project manager", "value": "project manager"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Development manager", "value": "development manager"}, {"text": "Director", "value": "director"}, {"text": "Manufacturing manager", "value": "manufacturing manager"}, {"text": "Marketing manager", "value": "marketing manager"}, {"text": "Plant manager", "value": "plant manager"}, {"text": "Production manager", "value": "production manager"}, {"text": "Program manager", "value": "program manager"}, {"text": "Regional", "value": "regional"}, {"text": "Senior", "value": "senior"}, {"text": "Sr. manager", "value": "sr. manager"}, {"text": "Account manager", "value": "account manager"}, {"text": "Admin manager", "value": "admin manager"}, {"text": "Affairs manager", "value": "affairs manager"}, {"text": "Assistant", "value": "assistant"}, {"text": "Brand manager", "value": "brand manager"}, {"text": "Commodity manager", "value": "commodity manager"}, {"text": "Communication", "value": "communication"}, {"text": "Customer", "value": "customer"}, {"text": "Dealer", "value": "dealer"}, {"text": "Devops engineer", "value": "devops engineer"}, {"text": "Engineering", "value": "engineering"}, {"text": "Executive", "value": "executive"}, {"text": "Product specialist", "value": "product specialist"}, {"text": "Production supervisor", "value": "production supervisor"}, {"text": "Risk manager", "value": "risk manager"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Transactional", "value": "transactional"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Internship", "value": "INTERN"}, {"text": "Part-time", "value": "PARTTIME"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Toiletries", "value": "/business/naics2007/3256"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Foods & Beverages", "value": "/business/naics2007/311"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Management", "value": "/business/naics2007/55"}, {"text": "Research", "value": "/business/naics2007/5417"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "Citi", "value": "/m/01dfb6"}, {"text": "Binance", "value": "/g/11hcz1r4wl"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "Amazon", "value": "/m/0mgkg"}, {"text": "Standard Chartered", "value": "/m/02hszk"}, {"text": "United Overseas Bank", "value": "/m/04gjd1"}, {"text": "Apple", "value": "/m/0k8z"}, {"text": "Tata Communications", "value": "/m/04338k"}, {"text": "Workato", "value": "/g/11dxpy_3xd"}, {"text": "BNY  Mellon", "value": "/m/02vps5x"}, {"text": "DBS Bank", "value": "/m/01q7n5"}, {"text": "EPAM Systems", "value": "/m/0dlnrc"}, {"text": "GVT Government Technology Agency (GovTech)", "value": "/g/11gh0528nq"}, {"text": "Grab", "value": "/m/0134c_p9"}, {"text": "Paypal", "value": "/g/122s91_5"}, {"text": "PeopleSearch Pte Ltd", "value": "/g/11c73ngn0w"}, {"text": "Randstad", "value": "/m/08pt1z"}, {"text": "Singapore Airlines", "value": "/m/015f2x"}, {"text": "TEKsystems (Allegis Group Singapore Pte Ltd)", "value": "/g/11b6g4bkv0"}, {"text": "ABBOTT LABORATORIES (SINGAPORE ) PRIVATE LIMITED", "value": "/m/09m57z3"}, {"text": "ADVANCE INTELLIGENCE PTE. LTD.", "value": "/g/11dymfkxss"}, {"text": "AXA", "value": "/m/04mn99"}, {"text": "Adecco Personnel Pte Ltd", "value": "/m/08gz46"}, {"text": "Adidas Group", "value": "/m/01jtml"}, {"text": "Aetna, a CVS Health Company", "value": "/m/0kg8x"}, {"text": "Agency for Science, Technology and Research", "value": "/m/0gmjcg"}, {"text": "Alibaba", "value": "/m/07s6ctl"}, {"text": "Argyll Scott", "value": "/g/11dxpk2374"}, {"text": "Autodesk", "value": "/m/018nm3"}, {"text": "Barry Callebaut", "value": "/m/03clky2"}, {"text": "BioMind", "value": "/g/11dymfr2l6"}, {"text": "CHUBB ASIA PACIFIC PTE. LTD.", "value": "/m/09m8xyh"}, {"text": "Cargobase", "value": "/g/11dxppfsjn"}, {"text": "Cargobase Pte Ltd", "value": "/g/11fy240nxm"}, {"text": "DKSH", "value": "/m/0dj2nh"}, {"text": "Dathena", "value": "/g/11dxprdn6y"}, {"text": "Dyson", "value": "/m/05cskg"}, {"text": "Enggsol Pte Ltd", "value": "/g/11g9mnfmm1"}, {"text": "Ethos BeathChapman", "value": "/g/11c73z0xm0"}, {"text": "Eu Yan Sang", "value": "/m/03cl9hn"}, {"text": "Flintex Consulting Pte. Ltd.", "value": "/g/11h1z41pzb"}, {"text": "GIVAUDAN SINGAPORE PTE LTD", "value": "/g/11f00wn519"}, {"text": "Goldman Sachs", "value": "/m/01xdn1"}, {"text": "GovTech Singapore", "value": "/g/11dxpkfs_6"}]}]}