{"search_metadata": {"id": "608278eb797ac676e1aecc27", "status": "Success", "json_endpoint": "https://serpapi.com/searches/4847c4ab669ffccd/608278eb797ac676e1aecc27.json", "created_at": "2021-04-23 07:36:11 UTC", "processed_at": "2021-04-23 07:36:11 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28product+manager%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=10", "raw_html_file": "https://serpapi.com/searches/4847c4ab669ffccd/608278eb797ac676e1aecc27.html", "total_time_taken": 1.56}, "search_parameters": {"q": "(product manager) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "10"}, "jobs_results": [{"title": "7104-Product Manager (IT Software Technical/ Product Marketing/ Kaki Bukit)", "company_name": "The Supreme HR Advisory", "location": "Singapore (+1 other)", "via": "via LinkedIn", "description": "Kaki Bukit\nAttractive Salary\nCareer Progression Opportunities\n\nInterested applicants can send your resume to supreme.cyred@gmail.com and allow our Consultants to match you with our Clients. No Charges will be incurred by Candidates for any service rendered.\n\nProduct managers are responsible for guiding the success of a product and leading the cross-functional team that is responsible for improving it sets the strategy, roadmap, and feature definition for a product or product line.\nThe position may also include marketing and recommending or contributing information in setting product pricing.\n\nOther Responsibilities Include\n• Provide the deep product expertise needed to lead the organization and make strategic product decisions.\n• Analyze market and competitive conditions, laying out a product vision that is differentiated and delivers unique value based on customer demands.\n• Plan activities from strategic to tactical and provides important cross-functional leadership — most notably... between engineering, marketing, sales, and support teams\n• Responsible for defining the release process and coordinating all of the activities required to bring the product to market\n• Own the creative process of generating, developing, and curating new ideas\n• Develops the business case for new products, improvements to existing products, and business ventures.\n• Ensure that feedback and requests are seamlessly integrated into their product planning and development processes.\n• Prioritizes features by ranking them against the strategic goals and initiatives.\n\nRequired Experience And Knowledge In The Product Manager Role\n• Minimum 4 years of relevant working experiences.\n• IT Related Bachelor’s Degree\n• Attains certification in product management is an advantage.\n• Has technical knowledge or relevant domain knowledge that deals with document/content management\n• Demonstrated success in defining and launching products that meet and exceed business objectives\n• Excellent written and verbal communication skills\n• Excellent teamwork skills\n• Proven ability to influence cross-functional teams without formal authority\n• Someone with Estate Management or Facility Management background will have added advantage", "extensions": ["12 hours ago", "Full–time"], "detected_extensions": {"posted_at": "12 hours ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiI3MTA0LVByb2R1Y3QgTWFuYWdlciAoSVQgU29mdHdhcmUgVGVjaG5pY2FsLyBQcm9kdWN0IE1hcmtldGluZy8gS2FraSBCdWtpdCkiLCJjb21wYW55X25hbWUiOiJUaGUgU3VwcmVtZSBIUiBBZHZpc29yeSIsImNvbXBhbnlfbWlkIjoiL2cvMTFjNzN3MmdzcSIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IlFjRUlXcllnYjRpbDBxanRBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVvc0NDc3dCUVU1VlgwNXhWSE53WXpRNGFraEVSbEZ1Um5sUFMwTk9SakJJVWpKS01rNUdSbmQ1V2xGUVdXTkpVM1ZHYTJOa1dUVjBVWFV6YjJwMFV6aHpjRlozWm5Zd1FXeEpabk5WZFZwVFoyNDJiSGh1YmtSa1JHcERXazB6UXpKcVdtOXRTMUppY21kS01tVkJNR3RoTWxOR1RYTnBNMVpQT0dKcGN6Um9iR1o0VEd0dmQzWjBRWEJETVhOMGNpMXhORlpZZW13MmIxQXhXVTgxTjBvNU4wSktNMHcxU0UxUFJXZGthRFZtYjI1NmNtSlhURGQ2TlcwemVHOWtTbmx3TldGb1FUVmlWRUk0UTB4UlVrUnBFaFkyTTJsRFdVNXVZVTkxYVRGbloyWnBPR0ZmUVVSQkdpSkJUMDFaVW5kRFEwbDZUV2cyWjBFMU5HVnFhekZVTFdSNmVUbGxlbHA2ZFZGMyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzciLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGlua2VkSW4iLCJsaW5rIjoiaHR0cHM6Ly9zZy5saW5rZWRpbi5jb20vam9icy92aWV3LzcxMDQtcHJvZHVjdC1tYW5hZ2VyLWl0LXNvZnR3YXJlLXRlY2huaWNhbC1wcm9kdWN0LW1hcmtldGluZy1rYWtpLWJ1a2l0LWF0LXRoZS1zdXByZW1lLWhyLWFkdmlzb3J5LTI1MTU4MDMzOTE/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Associate Product Manager, Respiratory Interventions & Patient Monitoring", "company_name": "Medtronic", "location": "Singapore", "via": "via Bayt.com", "description": "Careers that Change Lives\n\nTogether, we will change healthcare worldwide. Join us in our Mission to alleviate pain, restore health and extend life worldwide. Let’s work together to address the universal healthcare needs and improve patients’ lives, optimize costs and efficiencies, and expand global access. Together, we can make a real difference in the global disparity in care. By providing quality care at the lowest possible cost, we will succeed as a company, and take the future of healthcare Further, Together.\n\nA Day in the Life\n\nAssociate Product Manager, Respiratory Interventions & Patient Monitoring\n\nKEY RESPONSIBILITIES:\n• Based in Singapore or Malaysia\n• This role will be responsible for leading marketing cradle to grave associated within the Respiratory Monitoring System and Patient Monitoring portfolio\n• They will act as a liaison between the Operating Units in building and executing the strategy for both downstream and upstream activities which includes leading strategic... marketing plans for the portfolio to achieve revenue, profit and market share targets\n• Leads and coordinates product planning, product launches, product management, market development and market research activities\n• Interacts directly with product managers to identify new marketing opportunities. Works individually or with a team in recommending action, scheduling and planning projects, estimating cost and managing projects to completion\n• Identifies unmet customer requirements and new business opportunities and provides vision and focus to move products from idea to market place\n• Facilitates and coordinates marketing activities with geographic areas to increase teamwork and build partnerships\n• Responsibilities may also include: coordinating trade show activities, website development, developing future e-commerce strategies, and tracking of marketing campaigns to evaluate results and provide recommendations for future marketing promotions\n\nMust Have: Minimum Requirements\n• Bachelors degree required\n• Minimum of 4 years of relevant experience, or advanced degree with a minimum of 2 years relevant experience\n\nAbout Medtronic\n\nTogether, we can change healthcare worldwide. At Medtronic, we push the limits of what technology, therapies and services can do to help alleviate pain, restore health and extend life. We challenge ourselves and each other to make tomorrow better than yesterday. It is what makes this an exciting and rewarding place to be.\n\nWe want to accelerate and advance our ability to create meaningful innovations - but we will only succeed with the right people on our team. Let’s work together to address universal healthcare needs and improve patients’ lives. Help us shape the future.\n\nPhysical Job Requirements\n\nThe physical demands described within the Responsibilities section of this job description are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. For Office Roles: While performing the duties of this job, the employee is regularly required to be independently mobile. The employee is also required to interact with a computer, and communicate with peers and co-workers. Contact your manager or local HR to understand the Work Conditions and Physical requirements that may be specific to each role. (ADA-United States of America)\n\nAdditional Information\n• Posting Date: Jan 3, 2021\n• Travel: No", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBc3NvY2lhdGUgUHJvZHVjdCBNYW5hZ2VyLCBSZXNwaXJhdG9yeSBJbnRlcnZlbnRpb25zIFx1MDAyNiBQYXRpZW50IE1vbml0b3JpbmciLCJjb21wYW55X25hbWUiOiJNZWR0cm9uaWMiLCJjb21wYW55X21pZCI6Ii9tLzAzejRqMyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IkM5Z19KRXMwMFNSVy03dmtBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhVWHBvWlVrdFMzTnhlRVZLYVRSTVEzZGZibTAyZURkUFFTMWtVRGRvWmtaMU0yVldhRkk0ZVRJd1ZWRTNjbVp2VW5kNlFUbFhVVmhsYzA1a1UwdGZibHBIVG1rNWQxbFZVVTl1TVVNd2JXUk5VV2xIYzI1aFpHTkxWbkZQVUhsamNuWjVjbGRIV0VaMllXaDVhWFJ3Y1ZkblpUWjJSMEpaY1VKelpGVmhiR1pLZDNObmNFSldkV1JmU1hsWFkxSTFiVXhEZDJGdlJGUlFSVkZuRWhZMk0ybERXVTV1WVU5MWFURm5aMlpwT0dGZlFVUkJHaUpCVDAxWlVuZEROemxFV0hZelpHVlJiWEJSY1dzdGJWcEljbEZoYmxCMFprVm4iLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18xNSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCYXl0LmNvbSIsImxpbmsiOiJodHRwczovL3d3dy5iYXl0LmNvbS9lbi9zaW5nYXBvcmUvam9icy9hc3NvY2lhdGUtcHJvZHVjdC1tYW5hZ2VyLXJlc3BpcmF0b3J5LWludGVydmVudGlvbnMtcGF0aWVudC1tb25pdG9yaW5nLTU5NTU1NDEyLz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Manager - Tax Product and Innovation - APTC", "company_name": "Ey Corporate Advisors Pte. Ltd.", "location": "Singapore", "via": "via Monster Singapore", "description": "At EY, you’ll have the chance to build a career as unique as you are, with the global scale, support, inclusive culture and technology to become the best version of you. And we’re counting on your unique voice and perspective to help EY become even better, too. Join us and build an exceptional experience for yourself, and a better working world for all.\n\nTax technology continues to disrupt the profession and presents increased opportunities for technology and tax professionals to think innovatively, drive and influence change that transform business models and services and leverage emerging technology to launch new revenue offerings and improve client-centricity.\n\nTo support this disruption, EY’s Asia Pacific Tax Center ( APTC) Innovation team is on a mission to incubate and launch new value-creating initiatives that challenge the status quo that positively impact our people and clients.\n\nThe opportunity\n\nSignificant investment in innovation and technology underpin EY’s NextWave... strategy. As a trusted innovation and technology advisor, you will partner with some of the most senior leaders across APTC to spearhead the ideation and development of high impact, scalable products through the adoption of pre-existing and emerging technologies.\n\nTeaming with likeminded technology enthusiasts, your challenger mindset will help identify new ways to improve efficiencies, maximize margins, and deliver superior experience to our People and clients. And, with deep industry knowledge and demonstrated experience in rapid prototyping, you will champion a culture of innovation and inspire a team of talented Product Managers on a mission to build the next big idea for Tax.\n\nThis opportunity is open to candidates who are interested in both contract or permanent work, and we are flexible on location.\n\nYour key responsibilities\n\nIn the role as Asia-Pac Tax Product and Innovation Lead, you’ll guide the team to ideate, incubate and scale new tech-enabled solutions and emerging technologies. Bringing forth a diverse skillet across data, automation, emerging technology and agile product management, your challenger approach to innovation will deliver high impact opportunities to our business and clients.\n\n· Challenge the status quo to identify product gaps and discover new market opportunities\n\n· Lead with a customer-centric approach to uncover the real Problem and align the Solution with the business/ SSL strategic priorities\n\n· Build business cases for new products based on the four Innovation Product pillars (Desirability, Viability, Feasibility and Alignment)\n\n· Oversee the product lifecycle from ideation and MVP development, to user testing and launch, engaging internal technology teams such as Client Technology, Tax Technology & Transformation and offshore teams) throughout the process\n\n· Drive a healthy pipeline of new ideas from across the business and qualify each against the Innovation Evaluation model so only the best progress to prototyping.\n\n· Develop metrics and tracking tools to ensure effective implementation and momentum of the product roadmap\n\n· Strong executive presence - build and maintain a strong network of stakeholders and collaborators to influence cross functional teams to delivery against the product plan across multiple geographies\n\n· Champion a culture of innovation through thought leadership initiatives\n\n· Be open to taking risks and not afraid to fail (pivot fast)\n\n· Flexibility to adjust to multiple demands, shifting priorities, ambiguity, and rapid change\n\n· Comfortable with working in a cross-cultural virtual team\n\n· Provide formal and informal coaching on-the-job to grow team members to their full potential\n\nSkills and attributes for success\n\n· 6 years experience in product or project management in a corporate or start-up environment\n\n· Expert knowledge of design thinking, agile and innovation methodologies\n\n· Strong track record of launching and scaling new products\n\n· Mastery of agile, SAFE and PMP or Prince2\n\n· Knowledge and experience in managing and delivering web and mobile applications development, analytics and data science/AI initiatives\n\n· Strong stakeholder management, presentation and facilitation skills\n\nTo qualify for the role you must have\n\n· A Bachelor's Degree\n\n· Project Management Professional (PMP)\n\n· Certified ScrumMaster (CSM)\n\n· SAFE\n\n· Design Thinking\n\nIdeally, you also have\n\n· Experience working in a professional services firm\n\n· Tax experience\n\nWhat we look for\n\nHighly motivated individuals with excellent problem-solving skills and the ability to prioritize shifting workloads in a rapidly changing industry. An effective communicator, you’ll be a confident team player equipped with strong people management skills and a genuine passion to make things happen in a dynamic organization. If you’re ready to take on a wide range of responsibilities, and are committed to seeking out new ways to make a difference, this role is for you.\n\nWhat we offer\n\nEY offers a competitive remuneration package where you’ll be rewarded for your individual and team performance. We are committed to being an inclusive employer and are happy to consider flexible working arrangements. Plus, we offer:\n\n· Continuous learning: You’ll develop the mindset and skills to navigate whatever comes next.\n\n· Success as defined by you: We’ll provide the tools and flexibility, so you can make a meaningful impact, your way.\n\n· Transformative leadership: We’ll give you the insights, coaching and confidence to be the leader the world needs.\n\n· Diverse and inclusive culture: You’ll be embraced for who you are and empowered to use your voice to help others find theirs.\n\nIf you can demonstrate that you meet the criteria above, please contact us as soon as possible.\n\nThe exceptional EY experience. It’s yours to build.\n\nEY | Building a better working world\n\nEY exists to build a better working world, helping to create long-term value for clients, people and society and build trust in the capital markets.\n\nEnabled by data and technology, diverse EY teams in over 150 countries provide trust through assurance and help clients grow, transform and operate.\n\nWorking across assurance, consulting, law, strategy, tax and transactions, EY teams ask better questions to find new answers for the complex issues facing our world today", "extensions": ["2 days ago", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJNYW5hZ2VyIC0gVGF4IFByb2R1Y3QgYW5kIElubm92YXRpb24gLSBBUFRDIiwiY29tcGFueV9uYW1lIjoiRXkgQ29ycG9yYXRlIEFkdmlzb3JzIFB0ZS4gTHRkLiIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoibURmdlNCYU9DOHpZOHhaOEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNb25zdGVyIFNpbmdhcG9yZSIsImxpbmsiOiJodHRwczovL3d3dy5tb25zdGVyLmNvbS5zZy9hbXAvam9iLXZhY2FuY3ktbWFuYWdlci10YXgtcHJvZHVjdC1hbmQtaW5ub3ZhdGlvbi1hcHRjLWV5LWNvcnBvcmF0ZS1hZHZpc29ycy1wdGUtbHRkLXNpbmdhcG9yZS0yNzMxOTg4OS5odG1sP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Director, Multi-Currency and FX Snr Principal Product Manager", "company_name": "THE BANK OF NEW YORK MELLON", "location": "Singapore", "via": "via Learn4Good", "description": "Position: Director, Multi-Currency and FX Payments Snr Principal Product Manager\nRoles &\n\nResponsibilities\n\nIn this role you would be a member of a global Product team, within Treasury Services, responsible for managing a suite of Multi-currency, FX and Mass payment solutions (referred to as Smart\n\nPay Global).\n\nThis is a leadership role, within the Smart\n\nPay Global Product team covering the APAC region. You would be responsible for developing and executing a growth strategy in the region, aligned to team and group priorities. In this role you will report to the Global Head of Multicurrency and FX Payments.\n\nYou would be responsible for developing an in-depth and comprehensive knowledge of our capabilities and an understanding of the firm’s products and services, the marketplace and client needs. You would be responsible for enhancing Smart\n\nPay Global product performance and profitability in the region.\n\nThe role will also involve increasing adoption and utilization of our solutions... by our clients and new prospects through participation in sales strategy meetings, demonstrations, presentations and client meetings as well as attending industry/professional events.\n\nYou will use your in-depth knowledge of the market and competitive landscape and subject-matter expertise to identify the right solutions for clients to address specific client needs.\n\nAs a member of the team you must be highly collaborative and adaptable to lead or contribute to new product developments or enhancements or projects relating to Smart\n\nPay Global or contributing to team or group objectives as well as providing subject matter expertise or knowledge to support programs or enterprise initiatives from within or outside of the team.\n\nWhilst there are no direct reports for this role at the outset, the anticipated growth of the business may lead to opportunities for team leadership in the future.\n\nPrimary responsibilities would include:\n\nThe development and implementation of our Smart\n\nPay Global product and growth strategy in the region End to End ownership of the regional Smart\n\nPay Global product roadmap including developing business cases aligned with overall business objectives Achievement of revenue goals/targets, profitability, and establishing pricing strategies for our products sold in the region Seeking opportunities to accelerate revenue realization and enhance client experience Leading/managing a range of products and services and introducing enhancements and improvements from development to launch Leveraging your strong market knowledge to integrate the requirements of the region into the product set and stay ahead of competitors Driving business and pipeline growth by supporting deal structuring, sales training and delivering solutions to solve client needs Develop ideas for new products and generate buy-in from the business to integrate into product pipeline To keep up to date on the competitive landscape and industry environment and provide subject-matter expertise when offering solutions to address specific client or operational/organizational needs Work closely with Markets FX Product Management, Relationship Management, Business Development, Account Management, and Product Development teams and other stakeholders to deliver on business goals Collaborate with Marketing to raise awareness and increase adoption and utilization of Smart\n\nPay Global services Work closely with Legal, Risk, and Compliance teams to ensure that solutions adhere to regulatory requirements and risks are mitigated or addressed Take an active role in the team, including development and coaching of less experienced Product Managers or team members Other responsibilities as required by the business Experience required Prior experience and knowledge, and a strong track record of driving growth in the Multi-currency and FX payments business Prior experience in Product Management and/or Sales preferred Bachelor’s degree or the equivalent combination of education and experience is required.\n\nAdvanced/graduate degree preferred. 12 plus years of total work experience preferred. MBA or CFA preferred. Product Leadership Certification preferred. Applicable local/regional licenses or certifications as required by the business.\n\nTell employers what skills you have\n\nPayment Solutions\n\nPayments\n\nSWIFT Payments\n\nTransaction Bankingclients needs\n\nSales strategypriorities\n\nPerformance\n\nCapabilityleadership role\n\nGrowth Strategy", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEaXJlY3RvciwgTXVsdGktQ3VycmVuY3kgYW5kIEZYIFNuciBQcmluY2lwYWwgUHJvZHVjdCBNYW5hZ2VyIiwiY29tcGFueV9uYW1lIjoiVEhFIEJBTksgT0YgTkVXIFlPUksgTUVMTE9OIiwiY29tcGFueV9taWQiOiIvbS8wMnZwczV4IiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoibmhpSml0VnBXeVZJYS1NTEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRW9zQ0Nzd0JRVTVWWDA1eFUwMDJTbTA1WkhOTVIzVmlNemd6YzJKMmVFZFpkVlJNUW5aUlNFdFphMU53WDJ4bU1XcElZVGxMVmtzeU9XcENTMjlEVmtGVFdtbDZZVzgxVHpSdmF6ZG5iRFZxVUUweVFVcEZXV0Z3TkdocFFUQjZNRFpVVkV4aVQyVkdYMk5ETm10VE1VMXZORmRzV0VGWlYyaDRSMUJmU2xNeFZ6VmtXbEEwVFVGRloxbE9WSFJEZUU5elFYbGpObFJxWVVWamVHcE1TSFZvUVZSR2NXZGFObFV0UkdGUmNtaDNVRUZSWld0cVUzSnpaMUZuVTI1U1VGZFVaSEZHVkZnNFdHMWtORkpWYVRGTkVoWTJNMmxEV1U1dVlVOTFhVEZuWjJacE9HRmZRVVJCR2lKQlQwMVpVbmRFTmpCS1NHWkRZVlZSY1RGdloxQk5TR1ZKUTJwWVFYYzRMWFJSIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMjYiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGVhcm40R29vZCIsImxpbmsiOiJodHRwczovL3d3dy5sZWFybjRnb29kLmNvbS9qb2JzL3NpbmdhcG9yZS9tYW5hZ2VtZW50X2FuZF9tYW5hZ2VyaWFsLzI3MTQwMTc1MS9lLz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "VP, Product Manager - Structured Products and Equities, Personal Financial Services", "company_name": "United Overseas Bank", "location": "Singapore", "via": "via Laimoon.com", "description": "Posting Date: 16-Apr-2021\n\nLocation: Singapore, SG\n\nCompany: United Overseas Bank Limited\n\nAbout UOB\nUnited Overseas Bank Limited (UOB) is a leading bank in Asia with a global network of more than 500 branches and offices in 19 countries and territories in Asia Pacific, Europe and North America. In Asia, we operate through our head office in Singapore and banking subsidiaries in China, Indonesia, Malaysia and Thailand, as well as branches and offices.\nOur history spans more than 80 years. Over this time, we have been guided by our values - Honorable, Enterprising, United and Committed. This means we always strive to do what is right, build for the future, work as one team and pursue long-term success. It is how we work, consistently, be it towards the company, our colleagues or our customers.\n\nAbout the Department\nThe Retail function provides Personal and Business Banking customers with financial solutions tailored to their needs. We help them manage their money wisely and meet their... financial goals through an extensive range of products and services. These include deposit, insurance, secured and unsecured loans, investment and wealth advisory services.\n\nPersonal Financial Services\nWe design and provide products and services that empower our customers to enjoy greater banking convenience while they extract more value from their money. In particular, we are focused on promoting and developing healthy saving and investment practices across generations.\n\nJob Responsibilities\nResponsible for managing different aspects of the structured products and equities business, which have direct impact on the products' P&L. It will include implementing and driving sales activities, product development, defining product strategy and ideations.\n\nKey deliverables\n• Responsible for the P&L and quality/growth of PFS structured products and equities books\n• Manage the product program - approving product coverage; target market and segment; sales manual / pricing /advisory process, ensuring strict adherence to product compliance and governance\n• Lead and drive timely and relevant advisory solutions for structured products and equities\n• Provide weekly and ad-hoc product ideas internally to our wealth specialists and client advisors\n• Develop product solutions and communications across segments\n• Design product strategy differentiation to serve each segment\n• Work closely with wealth specialists to deliver the right structured product and equity solutions to our clients via our client advisors\n• Liaise with internal & external product providers to identify product opportunities and emerging risks\n• Conduct accurate and comprehensive competitors' analysis, products review and data analysis\n• Build strong partnerships and share ideas/advices with other product specialists and sales teams\n• Familiar with platform solutioning, and expected to participate in product-related projects\n• Expected to participate in product-related projects\n\nJob Requirements\n• Recognized university degree with minimum 8 years' of relevant investment experience with established financial institutions\n• Strong understanding of structured products and equities market\n• Strong analytical skills, meticulous, proactive and able to think independently and creatively.\n• Has excellent communication and writing skills; with ability to present and advise our wealth specialists and client advisors on structured products and equities.\n• A self-motivated individual with strong sense of accountability and ownership\n• Has strong interpersonal skills to effectively interact with all relevant stakeholders and external parties\n\nBe a part of UOB Family\nUOB is an equal opportunity employer. UOB does not discriminate on the basis of a candidate's age, race, gender, color, religion, sexual orientation, physical or mental disability, or other non-merit factors. All employment decisions at UOB are based on business needs, job requirements and qualifications. If you require any assistance or accommodations to be made for the recruitment process, please inform us when you submit your online application.\n\nApply now and make a difference.\n\nretail banking", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJWUCwgUHJvZHVjdCBNYW5hZ2VyIC0gU3RydWN0dXJlZCBQcm9kdWN0cyBhbmQgRXF1aXRpZXMsIFBlcnNvbmFsIEZpbmFuY2lhbCBTZXJ2aWNlcyIsImNvbXBhbnlfbmFtZSI6IlVuaXRlZCBPdmVyc2VhcyBCYW5rIiwiY29tcGFueV9taWQiOiIvbS8wNGdqZDEiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJBZ1N0NFRPRGdyX2I4alZTQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdllCQ3JjQlFVNVZYMDV4VkdnMllqUXRWV04xU25CMmNVWlVlWFZtUzJReU5UbGhUV1JwV1VoTVZXZHlkSEIyZW05U0xXRm1TVlF4VVZoTWFDMVdjV3hmVmpCbFJEQXphbEZrTTA4NGVWTk5jbEp6V0VOaVlreElVMGQ0U0d0MlJEZDBhbmxRZW01SU1YRnBWRGxzYUVSRldIbEdMVkZpTlMxWWVuTkxhbmhFZEVabVYwUmhhM1JsWW5Wd2FXZHhaMEZ1ZVRWeWVYZEVYMm8yTVVKalExcGpWVk13T0dwUGNEUjNhMEpyU21SdWQxZE9UR1I2YWxoUmVGSlpFaFkyTTJsRFdVNXVZVTkxYVRGbloyWnBPR0ZmUVVSQkdpSkJUMDFaVW5kQ1NsTTBhVEpmWmtGRVZ6QkJaVVo0VVcxMlZ6RkRNVzl5UmxCMyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzMzIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExhaW1vb24uY29tIiwibGluayI6Imh0dHBzOi8vam9icy5sYWltb29uLmNvbS9qb2JzL2V4dGVybmFsdmlldy8yNjEwOTI3MD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Product Manager", "company_name": "Revez Motion Pte. Ltd", "location": "Singapore (+1 other)", "via": "via Jobs", "description": "Show recruiters you're immediatley available for job opportunities Posted On: 3 days ago Total Views: 40 Total Applications : 1 Job Id: 27231933 Permanent Job Job DescriptionJob Summary An independent contributor role responsible for developing the channels and alliances and many others to meet the channel alliance relationships in the assigned region. The successful candidate will have broad knowledge and demonstrated success in developing and securing successful reseller partnerships. This role will be responsible to develop and build long term strategic relationships with possible channel and alliance partners through the development and deployment of clear and actionable channel and alliance strategies within the assigned region for the Cyber Security distribution business.Duties & Responsibilities Business unit Cyber Security· Drive channel and alliance product and platform related revenue for assigned region;· Responsible for delivering on quarterly and annual sales revenue... based on the Alliance resale of product and platform offerings;· Identify new channel partners and develop/manage existing partners in the assigned region;· Achieve targets as agreed with respective channel partners. Manage day-to-day business relationship with channel partners;· Identify and create new business opportunities with channel partners focused on revenue and strategic market impact;· Communicate consistently with channel partners and internal stakeholders, manage issues, resolve conflicts and enable support;· Help channel partners build (pre)Sales / Sales and Post Sales capacity and capability on product and platform offerings;· Create, implement and manage channel partner onboarding and training program. Drive training and certification in partner ecosystem;· Support strategy and pipeline with Senior Management and confirm channel partner capabilities prior to deal is signed;· Participate in tender/RFQ/RFP/RFI;Job Holder’s Specifications · Diploma and above in IT, Business IT, Business Administration, or a related field, or equivalent work experience.· 5+ years of sales experiences in the IT industry; experiences in sales of Cybersecurity products and platforms would be highly advantages;· Experience in business development planning and execution to drive sales pipeline, demand-gen, and enablement with channel partners;· Passion for working with partners. Ability to understand channel partner ecosystem, business drivers and ability to establish buy-in at all levels;· Market knowledge and understanding (IT industry, Cybersecurity Domain, Trends, Vertical market industries, etc.);· Good knowledge of up to date technologies, applications, products/solutions and platform;· Effective communication and presentation skills at executive level;· Proven capability to work in a team and collaborate; with independent accountability;· Strong communication and negotiation skills with good business acumen;· Able to perform well in a fast pace and high ambiguity environment;Responsibilities: • Own the relationship with Supplier in South Asia and build & maintain relationship at all levels • Work with Corporate colleagues to engage Supplier • Align with Supplier the StratResponsibilities: · Planning product direction, functional design, user/market survey analysis, and in-depth thinking about user needs of community-type products. · Focus on target users, refine theThe Facebook business toolset helps 8mm advertisers and 200mm businesses get value out of the Facebook ecosystem. While we try to make those tools as intuitive and effective as possible, over 300k timNE Digital is the digital, data and technology organization that serve as a center of excellence to drive digital transformation for our group of NTUC Social Enterprises to meet the critical social neJob Description * Develop product strategy and roadmap for company product lines * Design intuitive and effective user flows for product features * Work with the engineering team to drive exeResponsibilities * As the Product Manager for Partner Management Platforms, you will be responsible for building a unified portfolio of tools that will be used daily by our internal teams and exterWe are looking for a Product Manager who will be managing clients in Singapore. The selected candidate will be responsible for the implementation of Tracesafe product and support the customer after thYour Challenges -To develop the growth of new product (FinTech. Eg: consumer lending, credit cards, digital wallet, digital risk management and big data platform) across Singapore, Malaysia and PhilJob Responsibilities: 1. Responsible for overseas product planning, according to market demand, competitive situation and resource status, collect and analyze user demand, reasonably plan version dem* Develop, implement, and execute customer engagement, retention, and loyalty products/projects based on customer behaviour, data, and best practices * Turn business requirements into a roadmap oGive your career a boost with Monster's resume services.Simple body text this will replace with orginal content Toll Free No: +8001-012-339 91-40 66116994", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9kdWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJSZXZleiBNb3Rpb24gUHRlLiBMdGQiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Ilpla3JtTXJ5SE13Vlpld01BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9icyIsImxpbmsiOiJodHRwczovL3NnLmZpZGFudG8uY29tL2pvYnMvam9iLW9wZW5pbmcvZmlyc3RsaW5lLXN1cGVydmlzb3JzLW9mLXByb2R1Y3Rpb24tYW5kLW9wZXJhdGluZy13b3JrZXJzL3Byb2R1Y3QtbWFuYWdlci0yNzc4Mzk4NzI/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Brand Manager", "company_name": "Procter and Gamble", "location": "Singapore", "via": "via Bayt.com", "description": "Overview of the job\n\nDo you want to lead marketing and commercial plans for one of our billion-dollar brands? The Brand Manager identifies business opportunities and works with the multi-functional team to build cohesive commercial plans! You are expected to lead and collaborate with different subject matter experts to deliver end-to-end plans for the region via qualifying communication ideas, adjusting portfolio pricing and identifying shopping barriers and opportunities.\n\nYour Team\n\nYou and other Brand Managers (each handling a brand/category) will report to the Brand Director for the Category or Business Unit. You will work extensively with colleagues from Consumer Market Knowledge, Sales, Communications, Finance etc.\n\nWhat Success Looks Like\n• Demonstrate positive relationship building skills in initial engagements with multi-functional teams\n• Deliver Scorecard Business Targets, in line with the goals of the Business Unit\n• Deliver Category growth, market penetration and gaining... of New Users via Products Innovation Design\n• Successful Design and Deployment of Marketing Toolkits for the Brand\n\nResponsibilities of the role\n• Identify consumers’ needs and wants for P&G’s products, and provide inputs to Research & Development and technical team to design the right package and formula to win with local consumers\n• Lead consumer researches to develop qualified brand concept, benefit and claims that addresses consumers’ unmet needs\n• Communicate with local market partners, stakeholders and suppliers to drive P&G business initiatives\n• Lead creative agencies to develop communication ideas and execute TV copy production designed/customized for the cultural nuances of local consumers\n• Develop initiatives fit-for-use toolkits (including copy, prints, digital i-banners, social & eCommerce contents, sampling trial toolkits, in-store activation and demos, etc.)\n• Coordinate with R&D, Consumer Research teams to qualify the product and package through various tests.\n• Craft promotion/pricing strategy and customer/distributor trade terms with the local trade team\n• Work with technical team to find the best solution of supply chain to manage the product cost within affordable level\n\nQualifications\n\nA college degree (Bachelor’s or Master’s is fine, preferably with some business focus)\n\n0-4 years of brand management, consulting or consumer journey design experience or similar\n\nExcellent forward-thinking, strategic and courageous leadership skills\n\nStrengths with strategic and analytical thinking\n\nAn ability to drive innovation and brand growth\n\nStrong ability to communicate and team capabilities\n\nAbout us\nWe produce globally recognized brands and we grow the best business leaders in the industry. With a portfolio of trusted brands as diverse as ours, it is paramount our leaders are able to lead with courage the vast array of brands, categories and functions. We serve consumers around the world with one of the strongest portfolios of trusted, quality, leadership brands, including Always®, Ariel®, Gillette®, Head & Shoulders®, Herbal Essences®, Oral-B®, Pampers®, Pantene®, Tampax® and more. Our community includes operations in approximately 70 countries worldwide.\n\nVisit http://www.pg.com to know more.\n\nOur consumers are diverse and our talents - internally - mirror this diversity to best serve it. That is why we’re committed to building a winning culture based on Inclusion and our ideal candidate is passionate about the same principle: you will join our daily effort of being “in touch” so we craft brands and products to improve the lives of the world’s consumers now and in the future. We want you to inspire us with your unrivaled ideas.\n\nWe are committed to providing equal opportunities in employment. We do not discriminate against individuals on the basis of race, color, gender, age, national origin, religion, sexual orientation, gender identity or expression, marital status, citizenship, disability, veteran status, HIV/AIDS status, or any other legally protected factor", "extensions": ["2 days ago", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJCcmFuZCBNYW5hZ2VyIiwiY29tcGFueV9uYW1lIjoiUHJvY3RlciBhbmQgR2FtYmxlIiwiY29tcGFueV9taWQiOiIvbS8wMXF5Z2wiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiIyRnFtSFpYa190eDZjY0xxQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdllCQ3JjQlFVNVZYMDV4VW04MmJuVlBjV1F6VWtwWmVqWm5abkpmY0hWTE4xaDBVV2RrUkc5Q05HSmlWVzVZV1dSSVJGVmhWVEZzZVd4bk4yWmlUMko2VTJGcFFUWnNSbGhSWXpoc1NIVXpUWFJVZGs1dVUxUnJWVVl0YkVGbWNVVkhNMXB1U2pRMU1tNTBjR1JOUVZKSVkxTnNWRTFsVkVVNWJXdHpXbVUxVlZBeVRURk9NbHBpU0ZjdFZDMXFiRXRSUzNocE9EVnJjVFpzUlRWNVVIaExXREJRUlRKa2MxZFBTVU5pVFdGR1lUQkljR2RyVVdwdFRIZEpFaFkyTTJsRFdVNXVZVTkxYVRGbloyWnBPR0ZmUVVSQkdpSkJUMDFaVW5kQ1J6WlZVMDgxTFhsVFNFODJRbHBSWVhGd05qbHJXSFJmUVd0QiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzQ1IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJheXQuY29tIiwibGluayI6Imh0dHBzOi8vd3d3LmJheXQuY29tL2VuL3NpbmdhcG9yZS9qb2JzL2JyYW5kLW1hbmFnZXItNTk1NzAxODQvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Product Marketing Management (PMM) Manager - Industrial Automation", "company_name": "Omron Asia Pacific Pte Ltd", "location": " (+1 other)", "via": "via Workable For Job Seekers", "description": "The individual is focused on manage the product designated product portfolio and its related solution with clear Go-To-Market strategies into targeted industries, while creating competitive edge against our keen competitor(s) working with stakeholders in global, regional and local.\n\nKey Roles and Responsibilities\n• Manage for Product Marketing department\n• Define vision, strategy, and roadmap for product portfolio with SMART goals for Industrial Automation.\n• Responsible for the product performance by revenue and profit (%).\n• Responsible for defining the release process and coordinating all the activities required to bring the product to market\n• Collaborate with respective business unit and marketing teams to ensure that customer needs/values are incorporated into product design, branding, and marketing approaches as Voice of Customers (VOC).\n• Develop product training framework and facilitate new and existing product training sessions.\n• Manage each product family pricing through... market competition review and positioning through analysis of pricing matched with market expectations to determine the ideal target price for products of the business.\n• Degree / Diploma in Engineering or relevant discipline.\n• Machinery Safety Certification is preferred.\n• Product Marketing Manager or similar role with leading and mentoring a team of 5.\n• At least 10 years of experience in Product Marketing Management in a regional role (Asia Pacific) and proven prior working experience\n• Comprehensive understanding of Product & Market Trends to Machinery Safety products\n• Prior experience in Industrial Automation industry.\n• Basic strategy tools (4P, 3C, PLM, Ansoff’s Growth Matrix, Porter’s Generic Strategies, SWOT, etc.)\n• Finance Concepts (ROI, PL, Breakeven Analysis, etc.)\n• Domestic travel between customer sites and regional work travel as and when required. May involve international travel from time to time.\n• Company culture - fast paced, multi-tasking, team focusing, empowering, creative, innovative and open communication\n• Competitive salaries\n• Excellent career advancement opportunities\n• Corporate Health Screening", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9kdWN0IE1hcmtldGluZyBNYW5hZ2VtZW50IChQTU0pIE1hbmFnZXIgLSBJbmR1c3RyaWFsIEF1dG9tYXRpb24iLCJjb21wYW55X25hbWUiOiJPbXJvbiBBc2lhIFBhY2lmaWMgUHRlIEx0ZCIsImNvbXBhbnlfbWlkIjoiL2cvMTFmMDFsNmo4MiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6InJIVHh6Q1ZRNjZJTnZKMjNBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVvc0NDc3dCUVU1VlgwNXhVVE5TUzBaV2NFWk1NbU5YZEVwZmFsSkJORzlYUVRCS1EyZHpTbFpCUzJ4SVFsUTRYMTl1ZVVGUkxUSmpOams1VjJKcVVtUkxlREF5TlZwUlQxUklTMWRDYmxSWU9XaGxSMk10YkVwbWVpMTFOelYyWm1oTVdGRldaSEpmWVZscGIwcDJRMVY2ZVhkQlZWTTFMWFpSVTJGZlNVMWtUR2wxWTE5YVZHTTFaVXQ0ZVZKVFQwUTVSMVl4VkdaMlgyMUhTak5rYzAxVmFVTlhka1owVHpGdFNVcDVVMU13U21wWGFubE9VSFZyTkZkUlJHODNVRWhuVXpka1FVWTNSRU5SUVhjeFlsaDVFaFkyTTJsRFdVNXVZVTkxYVRGbloyWnBPR0ZmUVVSQkdpSkJUMDFaVW5kQ2JXOXpXVVJzWDFoV1RXOUxVVGRzUW5SMVh6ZFdiRGhXV1hwbiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzUyIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFdvcmthYmxlIEZvciBKb2IgU2Vla2VycyIsImxpbmsiOiJodHRwczovL2FwcGx5LndvcmthYmxlLmNvbS9vbXJvbi1hc2lhLXBhY2lmaWMtcHRlLWx0ZC9qLzhGMzA4N0QxN0YvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "[new Role] Product Manager/specialist (private Bank/wealth Management)", "company_name": "The Resolute Hunter Pte Ltd", "location": "Singapore (+1 other)", "via": "via MNC Jobs Singapore | MNC Jobs In Singapore", "description": "• Seeking for a Product Manager with minimum 3 years of Product Management in Private bank/Wealth Management, certified with CACS and CMFAS from Banking industry*\nTHE COMPANY\nArmed with their growth plans, this bank wants to build their Private Bank operations. Currently, they seek for Product Manager to be part of their team.\nJOB RESPONSIBILITIES\n• Handle the structuring and be part of the marketing for Private Bank/Wealth Management products (Deposit, Loans, Mutual Funds, FX, Bonds, Equities products)\n• Ensure the smooth execution of new product launches\n• Support Private bankers in their pitches to clients\n• Act as liaison between clients and internal departments\n• Work closely with other business stakeholders\n\nJOB REQUIREMENTS\n• Degree in Business Studies/Finance/Banking/Economics/Commerce or any other relevant education\n• Minimum 3 years of Product Management in Private bank/Wealth Management\n• Certified with CACS and CMFAS\n• Keen eye for details, able to multi-task, highly... organized, strong interpersonal and communication skills\n\nIf you will like to explore this opportunity, please email your resume in Microsoft Word format to marie@resolutehunter.com\nWe thank you for your interest and will contact shortlisted candidates for more detailed discussion.\nFor more job openings, please visit our website at https://resolutehunter.com/opportunities/\nEA Licence 18C9105\nEA Reg R1105305", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJbbmV3IFJvbGVdIFByb2R1Y3QgTWFuYWdlci9zcGVjaWFsaXN0IChwcml2YXRlIEJhbmsvd2VhbHRoIE1hbmFnZW1lbnQpIiwiY29tcGFueV9uYW1lIjoiVGhlIFJlc29sdXRlIEh1bnRlciBQdGUgTHRkIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJNaGx0RmsyanNGVU56bUNkQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1OQyBKb2JzIFNpbmdhcG9yZSB8IE1OQyBKb2JzIEluIFNpbmdhcG9yZSIsImxpbmsiOiJodHRwczovL3NnLm1uY2pvYnouY29tL2pvYnMvbmV3LXJvbGUtcHJvZHVjdC1tYW5hZ2Vyc3BlY2lhbGlzdC1wcml2YXRlLWJhbmt3ZWFsdGgtbWFuYWdlbWVudC1zaW5nYXBvcmUtMjI5MTc5P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Manager, Delivery, Smart Enterprise Platform, GEC", "company_name": "ST Engineering Group", "location": "Singapore", "via": "via ST Engineering", "description": "Key Responsibilities:\n• Provide support in the full product development life-cycle e.g. design, development, and testing of highly scalable, expandable and maintainable “Smart Enterprise Platform” (SEP) product\n• Work closely with technical solution architects, developers, data scientists, data engineers, ML engineers in the implementation and deployment of SEP product to internal & external customers\n• Communicate and coordinate with customer side PMT and internal teams to ensure smooth delivery of projects\n• Provide support throughout the full SDLC process including but not limited to the below activities:\n• Facilitate product co-creation workshops with clients using Design Thinking methods\n• Conduct business requirements workshops and create functional specifications\n• Work with customers and SEP development team to craft user stories and acceptance criteria\n• Work with UX consultants to facilitate UX activities with business users throughout\n• Assist in the preparation work for... System Integration Testing (SIT) and User Acceptance Testing (UAT)\n• Take the lead in designing the UAT approach and conducting UAT\n• Manage change requests (CR) if there are changes to timeline, scope, or resourcing\n• Take minutes and follow-up with all stakeholders during PMT meetings\n• Monitor and track project action items\n• Conduct functional training for customers in the usage and maintenance of the solution\n• Ensure project documentation is properly created, disseminated, and archived\n• Provide project support in heightened maintenance periods after project Go-Live\n• Own the incident management process for assigned SEP delivery projects and act as point of contact for the appropriate levels of incidents related to production systems with clients\n\nJob Requirements:\n• Bachelor’s in Computer Science, Computer Engineering, Information Systems, or similar IT courses\n• Minimum 7 years of IT related experience and at least 4 years in a Business Analyst / PM project role for IT solutioning projects\n• Understand both traditional waterfall and agile approaches to development and can reconcile both approaches\n• Understanding of user centred design, software engineering, data science and AI at a broad level\n• Experience working in an iterative fashion with development teams using Agile, and demonstrate strong working level experience with product owners and business users\n• Excellent written and verbal communication skills, and ability to work well with customers\n• Strong co-ordination and time management skills to handle complex projects\n\nGood to Have\n• Certified ScrumMaster, Certified Scrum Product Owner, Project Management Professional (PMP)\n• Prior exposure to and experience in SAP integration, SAP BW, ETL for data warehousing\n• Interest or prior experience in telecommunications / defence / smart city domains\n• Ability and interest in analytical modelling and evaluation for product R&D purposes", "extensions": ["8 days ago", "Full–time"], "detected_extensions": {"posted_at": "8 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJNYW5hZ2VyLCBEZWxpdmVyeSwgU21hcnQgRW50ZXJwcmlzZSBQbGF0Zm9ybSwgR0VDIiwiY29tcGFueV9uYW1lIjoiU1QgRW5naW5lZXJpbmcgR3JvdXAiLCJjb21wYW55X21pZCI6Ii9tLzBka24wbSIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Ii1rSkhsS2RJS1dDaFg0YmtBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2WUJDcmNCUVU1VlgwNXhVM3AyWjA5b2VrMW5aMVJJU1ZobVdEVkRWbVJQWVdad1JVbE5UM1YyYTNORFZHaHlXbEIyTmpodk5WRXhSbkZFU1U1VUxXRmhNRE40TjFOWlVVTkVSMDlhUlV0cVJqUXlhMFZKTjNoRU5rZ3RhVzF2Y25sak4wNXBXVFE1UWtkWU1XczVkWEZHY0MxcU1tSnhNa1ZET0V3MFFWWmlSbE5TU1ZkSE0wRldXREpXZEdkWWNYZDRNV010ZVZacFEzRkJVMU5pWmtvMFkwSndkME5tU0RKclZXRjJhMWRsTkc5Q2NFeHNXRE4xY0daQkVoWTJNMmxEV1U1dVlVOTFhVEZuWjJacE9HRmZRVVJCR2lKQlQwMVpVbmRFZGxBMVZYSnZPR0V5YzNOd1MyVjNPSEkzU21aMk5qbGZkM0ZCIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNjMiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gU1QgRW5naW5lZXJpbmciLCJsaW5rIjoiaHR0cHM6Ly9jYXJlZXJzLnN0ZW5nZy5jb20vam9iL1NpbmdhcG9yZS1NYW5hZ2VyJTJDLURlbGl2ZXJ5JTJDLVNtYXJ0LUVudGVycHJpc2UtUGxhdGZvcm0lMkMtR0VDLzU4MDQ0MTUxMC8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:Google Sans,arial,sans-serif}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Management", "value": "GC18"}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Business Operations", "value": "GC06"}, {"text": "Advertising and Marketing", "value": "GC03"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Accounting and Finance", "value": "GC01"}, {"text": "Legal", "value": "GC17"}, {"text": "Farming and Outdoors", "value": "GC13"}, {"text": "Human Resources", "value": "GC15"}, {"text": "Sales and Retail", "value": "GC26"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "Product manager", "value": "product manager"}, {"text": "Manager", "value": "manager"}, {"text": "Project manager", "value": "project manager"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Development manager", "value": "development manager"}, {"text": "Director", "value": "director"}, {"text": "Manufacturing manager", "value": "manufacturing manager"}, {"text": "Marketing manager", "value": "marketing manager"}, {"text": "Plant manager", "value": "plant manager"}, {"text": "Production manager", "value": "production manager"}, {"text": "Program manager", "value": "program manager"}, {"text": "Regional", "value": "regional"}, {"text": "Senior", "value": "senior"}, {"text": "Sr. manager", "value": "sr. manager"}, {"text": "Account manager", "value": "account manager"}, {"text": "Admin manager", "value": "admin manager"}, {"text": "Affairs manager", "value": "affairs manager"}, {"text": "Assistant", "value": "assistant"}, {"text": "Brand manager", "value": "brand manager"}, {"text": "Commodity manager", "value": "commodity manager"}, {"text": "Communication", "value": "communication"}, {"text": "Customer", "value": "customer"}, {"text": "Dealer", "value": "dealer"}, {"text": "Devops engineer", "value": "devops engineer"}, {"text": "Engineering", "value": "engineering"}, {"text": "Executive", "value": "executive"}, {"text": "Product specialist", "value": "product specialist"}, {"text": "Production supervisor", "value": "production supervisor"}, {"text": "Risk manager", "value": "risk manager"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Transactional", "value": "transactional"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Internship", "value": "INTERN"}, {"text": "Part-time", "value": "PARTTIME"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Toiletries", "value": "/business/naics2007/3256"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Foods & Beverages", "value": "/business/naics2007/311"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Management", "value": "/business/naics2007/55"}, {"text": "Research", "value": "/business/naics2007/5417"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "Citi", "value": "/m/01dfb6"}, {"text": "Binance", "value": "/g/11hcz1r4wl"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "Amazon", "value": "/m/0mgkg"}, {"text": "Standard Chartered", "value": "/m/02hszk"}, {"text": "United Overseas Bank", "value": "/m/04gjd1"}, {"text": "Apple", "value": "/m/0k8z"}, {"text": "Tata Communications", "value": "/m/04338k"}, {"text": "Workato", "value": "/g/11dxpy_3xd"}, {"text": "BNY  Mellon", "value": "/m/02vps5x"}, {"text": "DBS Bank", "value": "/m/01q7n5"}, {"text": "EPAM Systems", "value": "/m/0dlnrc"}, {"text": "GVT Government Technology Agency (GovTech)", "value": "/g/11gh0528nq"}, {"text": "Grab", "value": "/m/0134c_p9"}, {"text": "Paypal", "value": "/g/122s91_5"}, {"text": "PeopleSearch Pte Ltd", "value": "/g/11c73ngn0w"}, {"text": "Randstad", "value": "/m/08pt1z"}, {"text": "Singapore Airlines", "value": "/m/015f2x"}, {"text": "TEKsystems (Allegis Group Singapore Pte Ltd)", "value": "/g/11b6g4bkv0"}, {"text": "ABBOTT LABORATORIES (SINGAPORE ) PRIVATE LIMITED", "value": "/m/09m57z3"}, {"text": "ADVANCE INTELLIGENCE PTE. LTD.", "value": "/g/11dymfkxss"}, {"text": "AXA", "value": "/m/04mn99"}, {"text": "Adecco Personnel Pte Ltd", "value": "/m/08gz46"}, {"text": "Adidas Group", "value": "/m/01jtml"}, {"text": "Aetna, a CVS Health Company", "value": "/m/0kg8x"}, {"text": "Agency for Science, Technology and Research", "value": "/m/0gmjcg"}, {"text": "Alibaba", "value": "/m/07s6ctl"}, {"text": "Argyll Scott", "value": "/g/11dxpk2374"}, {"text": "Autodesk", "value": "/m/018nm3"}, {"text": "Barry Callebaut", "value": "/m/03clky2"}, {"text": "BioMind", "value": "/g/11dymfr2l6"}, {"text": "CHUBB ASIA PACIFIC PTE. LTD.", "value": "/m/09m8xyh"}, {"text": "Cargobase", "value": "/g/11dxppfsjn"}, {"text": "Cargobase Pte Ltd", "value": "/g/11fy240nxm"}, {"text": "DKSH", "value": "/m/0dj2nh"}, {"text": "Dathena", "value": "/g/11dxprdn6y"}, {"text": "Dyson", "value": "/m/05cskg"}, {"text": "Enggsol Pte Ltd", "value": "/g/11g9mnfmm1"}, {"text": "Ethos BeathChapman", "value": "/g/11c73z0xm0"}, {"text": "Eu Yan Sang", "value": "/m/03cl9hn"}, {"text": "Flintex Consulting Pte. Ltd.", "value": "/g/11h1z41pzb"}, {"text": "GIVAUDAN SINGAPORE PTE LTD", "value": "/g/11f00wn519"}, {"text": "Goldman Sachs", "value": "/m/01xdn1"}, {"text": "GovTech Singapore", "value": "/g/11dxpkfs_6"}]}]}