{"search_metadata": {"id": "6082792918ca868c5a996ecd", "status": "Success", "json_endpoint": "https://serpapi.com/searches/01f3deaddf172791/6082792918ca868c5a996ecd.json", "created_at": "2021-04-23 07:37:13 UTC", "processed_at": "2021-04-23 07:37:13 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28software+engineer%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=30", "raw_html_file": "https://serpapi.com/searches/01f3deaddf172791/6082792918ca868c5a996ecd.html", "total_time_taken": 2.36}, "search_parameters": {"q": "(software engineer) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "30"}, "jobs_results": [{"title": "Senior Software Engineer", "company_name": "Ninja Van", "location": "Singapore", "via": "via AngelList", "description": "Ninja Van is a late-stage logtech startup that is disrupting a massive industry with innovation and cutting edge technology. Launched 2014 in Singapore, we have grown rapidly to become one of Southeast Asia's largest and fastest-growing express logistics companies. Since our inception, we’ve delivered to 100 million different customers across the region with added predictability, flexibility and convenience. Join us in our mission to connect shippers and shoppers across Southeast Asia to a world of new possibilities.\n\nMore about us:\n• We process 250 million API requests and 3TB of data every day.\n• We deliver more than 1.5 million parcels every day.\n• 100% network coverage with 1000+ hubs and stations in 6 SEA markets (Singapore, Malaysia, Indonesia, Thailand, Vietnam and Philippines), reaching 500 million consumers.\n• 600,000 active shippers in all e-commerce segments, from the largest marketplaces to the individual social commerce sellers.\n• Raised US$400 million over four... rounds.\n\nWe are looking for world-class talent to join our crack team of engineers, product managers and designers. We want people who are passionate about creating software that makes a difference to the world. We like people who are brimming with ideas and who take initiative rather than wait to be told what to do. We prize team-first mentality, personal responsibility and tenacity to solve hard problems and meet deadlines. As part of a small and lean team, you will have a very direct impact on the success of the company.\n\nRole & Responsibilities\n• Design, develop and maintain software that powers Ninja Van's complex logistics operations.\n• Help design the architecture, own development of major initiatives and modules.\n• Work in cross functional teams with product managers, UX designers and QA engineers to ship software on-quality and on-time.\n• Help level up the team; share knowledge, conduct code and design review; drive code quality and process improvement initiatives.\n• Write code that you are proud of, with extensibility, scalability and performance in mind.\n\nRequirements\n• Solid Computer Science fundamentals, excellent problem-solving skills.\n• 3-6 years of backend or frontend development in a product company, with a proven track record of shipping successful software products.\n• Deep experience in most of our tech stack or similar technologies.\n• Bachelor’s or Master’s degree in Computer Science or related field from a top university.\n\nTech stack:\n• Data storage: MySQL, TiDB, Elasticsearch\n• Cache: Hazelcast, Redis\n• Real-time data pipeline: Apache Kafka\n• Backend: Play (Java 8), GoLang, Node.js\n• Frontend: React, AngularJS\n• Mobile: Android SDK, Dart (Flutter), React Native\n• Orchestrator: Kubernetes\n• Containerization: Docker, Containerd\n• Cloud Provider: GCP, AWS\n• Architecture: Micro Services (Frontend and Backend)\n\nSubmit a job application\n\nBy applying to the job, you acknowledge that you have read, understood and agreed to our Privacy Policy Notice (the “Notice”) and consent to the collection, use and/or disclosure of your personal data by Ninja Logistics Pte Ltd (the “Company”) for the purposes set out in the Notice. In the event that your job application or personal data was received from any third party pursuant to the purposes set out in the Notice, you warrant that such third party has been duly authorised by you to disclose your personal data to us for the purposes set out in the the Notice.\n\nNinja Van focuses on Enterprise Software, E-Commerce, Transportation, Logistics, and Content Delivery. Their company has offices in Singapore and Special Capital Region of Jakarta. They have a large team that's between 501-1000 employees. To date, Ninja Van has raised $32.5M of funding; their latest round was closed on April 2016.\n\nYou can view their website at https://www.ninjavan.co/ or find them on Twitter, Facebook, and LinkedIn", "extensions": ["Over 1 month ago", "$55K–$80K a year", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time", "salary": "$55K–$80K a year"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgRW5naW5lZXIiLCJjb21wYW55X25hbWUiOiJOaW5qYSBWYW4iLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjVLb2tHekFGNW9YY3AtZUlBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQW5nZWxMaXN0IiwibGluayI6Imh0dHBzOi8vYW5nZWwuY28vY29tcGFueS9uaW5qYS12YW4vam9icy85Mjc2OC1zZW5pb3Itc29mdHdhcmUtZW5naW5lZXI/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Senior Software Quality Assurance Engineer", "company_name": "Motional", "location": "Singapore", "via": "via NodeFlair", "description": "We are currently looking for a Senior Software Quality Assurance engineer to work on our quality management systems. You will be working on establishing and executing software quality assurance processes and procedures. From the control plans, to audits and facilitating corrective actions teams; the whole Software Quality Assurance is your arena.\n\nThings You'll Get To Work On\n• Establishing and executing software quality assurance processes\n• Oversees Internal Software Quality Assurance, providing direction, advice, and guidance\n• Develops control plan with new and existing product/service lines\n• Conducts system, process and software quality audits\n• Facilitates corrective action teams\n• Performs root cause analysis and verification of corrective actions of conditions adverse to quality\n\nEducation And Experience We Want From You\n• MS or BS in computer science, computer engineering or related field\n• 5+ years professional work experience as a software quality assurance... engineer\n\nSkills And Traits You Will Likely Already Have\n• Excellent knowledge of international quality standards such as IATF 16949 and ISO 9001 (ISO preferred, but IATF would be nice to have)\n• Strong experience with Software Development Life Cycle, comfortable with both waterfall and Agile methodologies in a V-Model systems development environment\n• Strong experience with software improvement model/s e.g. ASPICE, CMMI\n• Familiar with Software Quality Control tools (e.g., Klokwork, HelixQAC, cppcheck, shellcheck, OR Tools C++)\n• Familiar with software testing tools for unit test, verification testing (e.g., AI, dSPACE, Simphera)\n• Familiar with relational database management system (PLM, DCRM)\n• Experienced in Quality Management system auditing\n• Technical editorial skills\n• Good interpersonal skills\n\nBonus Points (but Not Required)\n• C++ Experience or any coding experience\n• Experience with creating and executing software test plan\n• Certified Auditor\n• Experience with ISO 2626\n\nMotional is making driverless vehicles a safe, reliable, and accessible reality.\nOur team is commercializing a world-class driverless system. The Motional team is behind some of the industry’s largest leaps forward in the last decade, including the first fully-autonomous cross-country drive in the U.S, the launch of the world’s first robotaxi pilot, and operation of the world’s most-established public robotaxi fleet. Strategically formed by Hyundai Motor Group and Aptiv, Motional is fundamentally changing how people move through their lives.\n\nHeadquartered in Boston, Motional has operations in the US and Asia. For more information, visit www.Motional.com and follow us on Twitter, LinkedIn, Facebook, Instagram and YouTube.\n\nMotional AD Inc. is an EOE. We celebrate diversity and are committed to creating an inclusive environment for all employees. To comply with Federal Law, we participate in E-Verify. All newly-hired employees are queried through this electronic system established by the DHS and the SSA to verify their identity and employment eligibility", "extensions": ["2 days ago", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgUXVhbGl0eSBBc3N1cmFuY2UgRW5naW5lZXIiLCJjb21wYW55X25hbWUiOiJNb3Rpb25hbCIsImNvbXBhbnlfbWlkIjoiL2cvMTFtcGQwal9uYiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjE3b2h2dTNBajZIS3NnZlBBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhVa1E1TjBNM09XcGhaVUZuWlZONmExVk1VRmsyWVhsNFJuUjJjbUpCWjJ4a1pWaHdiV0k1VDNWUE9HOTFTRmd5Tm5kb1dsSlpSalEwTFZodVFtRkxURk5JUTJKdFRrMW5kekEzTVc5MWRXVjZPRTluUWtVNVp6QnNWblUyTm1ZelpsVnZTbXRWUm5OWU5sZzRWMVY0T1hoM05EbFRPWGxhUTNKbmFtdFJUbDloWm1KSVJGSkVXVzVQUkRkVVRqUTVOMjFuZG1WcWJXNUNiWFpuRWhaTGJtMURXVTVVVWtaT1JHMWZVV0ZhT0ZsUVowUjNHaUpCVDAxWlVuZEJNV0pmVG5CRk1HWnhUMDVHYjNNMVYzVm5RVWhFVUU1eWRGcG4iLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18xMyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBOb2RlRmxhaXIiLCJsaW5rIjoiaHR0cHM6Ly93d3cubm9kZWZsYWlyLmNvbS9qb2JzL2xpc3RpbmdzLzEyOTkwP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "IT SOFTWARE QUALITY ASSURANCE ENGINEER - ISO CERTIFIED - SINGAPOREANS ONLY", "company_name": "APBA TG Human Resource Pte Ltd", "location": "", "via": "via Joblum Singapore", "description": "Job Description\n• Enforce that the team adhere to the software development processes and quality processes defined\n• Participate in the review processes for documents and software\n• Conduct audit to ensure adherence to defined quality processes\n• Collaborate with Project Manager / Software Managers to improve the existing processes to maintain a high level of quality software\n• Actively contribute to quality process improvement, testing and software quality development strategy and roadmap / vision\n• Develop and maintain quality assurance metrics for performance improvement\n• Provide briefing / training on the documented processes and tools used\nRequirement\n• Degree in Science (Mathematics), Computer Science, Computer Engineering or Information Technology\n• IT Software Development Management experience preferred\n• Minimum 4 years of software engineering/object orientated software development experience\n• ISO certified\n• Preferable gone through at least 2 cycles of SLDC\n• Experience in... software quality assurance, process definition, software audit and change management will be an advantage\n• Experience in MiniTab and/or Oracle Crystal Ball will be an added advantage\n• Able to articulate and write proficiently\n• Keen eye on details\n• Demonstrate leadership skills and have a strong team spirit with can-do attitude\n\nNote: This is NOT an engineering/ hardware related job.\nThis is a full time job. It is a yearly renewabe contract position with benefits. This is NOT a perm position", "extensions": ["14 days ago", "$5K–$6K a month", "Full–time"], "detected_extensions": {"posted_at": "14 days ago", "schedule_type": "Full–time", "salary": "$5K–$6K a month"}, "job_id": "eyJqb2JfdGl0bGUiOiJJVCBTT0ZUV0FSRSBRVUFMSVRZIEFTU1VSQU5DRSBFTkdJTkVFUiAtIElTTyBDRVJUSUZJRUQgLSBTSU5HQVBPUkVBTlMgT05MWSIsImNvbXBhbnlfbmFtZSI6IkFQQkEgVEcgSHVtYW4gUmVzb3VyY2UgUHRlIEx0ZCIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiYmdiUDZTOUVZSENSc3Fxa0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JsdW0gU2luZ2Fwb3JlIiwibGluayI6Imh0dHBzOi8vc2cuam9ibHVtLmNvbS9qb2IvaXQtc29mdHdhcmUtcXVhbGl0eS1hc3N1cmFuY2UtZW5naW5lZXItaXNvLzYwNzY3Mz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior Software Quality Assurance Engineer", "company_name": "Dyson", "location": "Singapore", "via": "via Jobs", "description": "About usSoftware Test & Quality Assurance ensures the products we sell represent the high Quality and Reliability of the Dyson brand, by using the world class techniques to implement automated methods of testing. This can involve simulating elements of the product to allow testing of all scenarios, to using image recognition or advanced technologies for automatic identification of elements displayed on the user interface. Quality is ensured and actively maintained during the Scaled Agile Framework development process by our QMS experts, and accepting customer correspondence to improve future products. Our labs allow unattended testing of partial to full products including moving robots, allowing the team to work remotely. It is a great opportunity if you want to enrich your cross subjects skillset to join the world best software test & QA teams. About the roleIn this role you will provide software quality assurance support to software development teams. This role will ensure that... project teams follow the defined software development process and conformance to related regulations and related industry standards. As a member of the software quality assurance team you will work with the team to implement continuous improvement to the software quality process, monitor the health of implemented software systems and provide guidance to project teams. As a key member of the software quality department, the individual in this role will be responsible for ensuring compliance to Dyson software quality policies and procedures. Provide ongoing software quality engineering support throughout the software development life cycle. Assist teams in determining verification and validation needs and requirements. Provide support for software development projects by review/approval software deliverables: Software assessment, software development, verification & validation plans User requirements, functional/software requirements Configuration specification, software architectural and design documents, peer review Risk management documents Test protocols, requirement traceability matrix, summary reports Provide review and approval of software related change orders Ensure successful transfer of software from development into manufacturing product support Participate in software risk management process throughout the entire software development lifecycle Ensure compliance of validation efforts performed by internal/external validation personnel Provide quality assurance support to software related CAPAs Provide software project status updated and software validation status to management Participate in the process improvements to the software quality assurance program Assist in the development and delivery of training to employee on principles of software validation, software risk management, and general quality tools Responsible for exhibiting professional behaviour with both internal/external business associated that reflect positively on the company and is consistent with the companys policies and practices Optimize Dyson products software developments process, ensure followed throughout the entire development and QA About you (3 years software quality management or relevant experience. Certified software quality engineer preferred, such as CQQE, ISO auditor Bachelor Degree in Computer Engineering / Electrical / Electronic Engineering, or related fields. Knowledge of software in IOT products, such as embedded, app, cloud and so on. Experience in regulated environment, such as ISO, IEC, FDA and so on standards, Experience with Agile software development, Devop, software verification and validation Excellent attention to detail, strong communication skill, and ability to work independently and in teams. Able to work in fast-paced environment and delivery quality under minimal supervision Deep understanding of Software and SQA processes and methodologies in a software development environment Experience with software configuration management BenefitsDyson Singapore monitors the market to ensure competitive salaries and bonuses. Beyond that, youll enjoy a transport allowance and comprehensive medical care and insurance. But financial benefits are just the start of a Dyson career. Professional growth, leadership development and new opportunities abound, driven by regular reviews and dynamic workshops. And with a vibrant culture, the latest devices and a relaxed dress code reflecting our engineering spirit, its an exciting team environment geared to fuelling and realising ambition.#LI-DYSON Interview guidanceWe are following the government guidelines regarding COVID19. At this time all interviews will be conducted via video or telephone. Were taking these precautionary measures to protect both our employee and candidate wellbeing. Our Talent Acquisition team will work with you and provide further information as appropriate", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgUXVhbGl0eSBBc3N1cmFuY2UgRW5naW5lZXIiLCJjb21wYW55X25hbWUiOiJEeXNvbiIsImNvbXBhbnlfbWlkIjoiL20vMDVjc2tnIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoib25CZ3J1VmM3Q2xkbmVoVUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXNzQkNvd0JRVTVWWDA1eFVWQmtVVTFVVUZkYWVWcDVUSGRmZEdVdFEzTk5RWGQxZURKUlZWaDZUbFkzYlVKV1RqUkVlSGRNTjFGeFRtMVZPR3BLUnpWMlFVZHJVRXg1ZFhkU2VqWlBjMXBxY2pKMWVXMXZPRE5JWmxJdExUQXhlRTlGWXpkbFdsWkZlak10YURBNE4yZHRSbk5ITkV4aE5ESjZhMVJoWkU5cFRXdDJhMWxtWmpjMVdHUnJNRkJYYW5RU0ZrdHViVU5aVGxSU1JrNUViVjlSWVZvNFdWQm5SSGNhSWtGUFRWbFNkMEpIZGpGVmJtWjNWVkUyY25ONFpITmZMVTVaY0ZSSVZ6Wk1iM2MiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18yNyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIiwibGluayI6Imh0dHBzOi8vc2cuZmlkYW50by5jb20vam9icy9qb2Itb3BlbmluZy9zb2Z0d2FyZS1xdWFsaXR5LWFzc3VyYW5jZS1lbmdpbmVlcnMtYW5kLXRlc3RlcnMvc2VuaW9yLXNvZnR3YXJlLXF1YWxpdHktYXNzdXJhbmNlLWVuZ2luZWVyLTI3Nzg0Mjg3NT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "System/Cloud Engineer(Certified AWS, Server/AWS/Azure)", "company_name": "OakTree Consulting", "location": "Singapore (+1 other)", "via": "via LinkedIn", "description": "Responsibilities\n• Design cloud system based on client's requirement by utilizing cloud services and tools such as AWS, Microsoft Azure or Google Cloud.\n• Work on cloud platform setup, implementation and administration\n• Integrate or deploy third party projects into system\n• Administrate, configure and troubleshoot applications in Linux or Windows environment.\n\nRequirements\n• Bachelor Degree in IT or related fields.\n• Minimum 2 years' experience designing and configuring any Linux distribution and/or Window servers.\n• Seasonal coder in Python/Bash/PowerShell or other server-side scripting language.\n• Experience setting up cloud platform such as AWS, Azure, GCP.\n• Ability to communicate value, progress of projects to required stakeholders in English language.\n• Motivated learner in new technology.\n• Experience in infrastructure of code (IoC) such as Cloudformation, Terraform takes a big advantage.\n• Experience in DevOps, CI/CD techniques such as GIT, Jenkins, Bamboo is preferrable.\n•... Experience in containerization such as Docker and Kubernetes orchestration is a plus.\n• AWS certified solution architect is a plus.\n• GCP certified engineer is a plus.\n\nPlease submit resumes to click apply with the following details in MS Word format:\n• Position applying for\n• Current remuneration\n• Expected remuneration\n• Notice period\n\nJohn Goh Meng Chye\n\nEA License No : 06C4642\n\nEA Reg No : R1102621\n\nView All JobsCompany Overview\n\nWe help our clients by providing prompt and quality human resource solutions through long term client partnerships, while enhancing the career prospects of the candidates.\n\nLearn More", "extensions": ["2 days ago", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTeXN0ZW0vQ2xvdWQgRW5naW5lZXIoQ2VydGlmaWVkIEFXUywgU2VydmVyL0FXUy9BenVyZSkiLCJjb21wYW55X25hbWUiOiJPYWtUcmVlIENvbnN1bHRpbmciLCJjb21wYW55X21pZCI6Ii9nLzExZzcwamZodHEiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJvZnZ1NEtCYklHenZUTmRuQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdllCQ3JjQlFVNVZYMDV4VVRSNGNHUnFZa2wxVGs5c1R6Sm5VSGhNUTFSRVNtRlhUMXBwTkdNdFlrZGZabWcxTVdSdVIyaEtPVXhCYjA1VVRsaHlkRWh3ZVdwMVRIUXhORGh2WkhwclEyNWxjRWh2VUVNd01XUTBNSGxVVm1ZdE5uQTNNM0JVUlZoWlVHSlJjR0ZsUWtoNlNqTkthRWhpV25SVmExVlVaazlTTWpWb2NGTnVSMDlhY3pORVpuRXlhMmhVYXpJelNYbGhXa3RPTjA1TVdHaDRiMkl3Y0dNNFoxUk9OemRYVERoSFduWTBWbHBQV2pOTVNVVk5FaFpMYm0xRFdVNVVVa1pPUkcxZlVXRmFPRmxRWjBSM0dpSkJUMDFaVW5kQmQyNXpTbXBuV0ZGT1VuSkRRMDlPU0MxTlJGTmFSMU5ZTkZGMyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzM1IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExpbmtlZEluIiwibGluayI6Imh0dHBzOi8vc2cubGlua2VkaW4uY29tL2pvYnMvdmlldy9zeXN0ZW0tY2xvdWQtZW5naW5lZXItY2VydGlmaWVkLWF3cy1zZXJ2ZXItYXdzLWF6dXJlLWF0LW9ha3RyZWUtY29uc3VsdGluZy0yNTEzOTU0NzIzP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Software Engineer (Nucleus) #BAS2020", "company_name": "Singtel Group", "location": "Singapore", "via": "via Singtel Careers", "description": "About NCS\n\nNCS is a member of the Singtel Group and the leading information, communications and technology (ICT) service provider with presence in the Asia Pacific region.\n\nWe deliver end-to-end ICT solutions to help governments and enterprises realise business value through digital transformation and the innovative use of technology. Over the years, NCS has played a critical role in the Singapore government’s efforts to computerise the civil service sector and integrate IT into its public services\n\nSoftware Engineer (Nucleus)\n\nNucleus is an NCS programme that equips software engineers with professional training, technical expertise and industry experience. We help you develop your ICT skills and accelerate your career as you work on technology projects that make a difference in the lives of people.\n\nWe have designed Nucleus to help build your foundation, develop your technical skillsets and deepen your specialisation experience. You will be immersed in challenging projects and attain... NUS-ISS accredited graduate certification programmes. Through this, you will be on your way to attain a Master of Technology.\n\nNCS is looking for talents with strong interest in application development and maintenance to join our Nucleus programme. Join us as we make a difference and impact to the lives of people to champion digital transformation for the future.\n\nKey Responsibilities\n• Participate in discussions with stakeholders to understand business and system requirements\n• Perform technical tasks to develop/enhance software applications according to Functional and Technical specifications\n• Maintain and improve software applications\n• Execute unit, integration, system and user acceptance testing\n• Using configuration management, integration and build automation tools to deploy applications\n• Identify opportunities and suggest recommendations for system improvement\n\nThe ideal candidate should have/be:\n• Degree in Computer Science or related engineering fields\n• Fresh graduates or with less than two years equivalent practical work experience\n• Proficiency in one or more frontend framework (HTML5/Angular/React JS)\n• Proficiency in one or more backend languages (Java/.NET/Python/PHP)\n• Proficiency in database will be added advantage\n• Experience in frontend and backend web application development will be added advantage", "extensions": ["2 days ago", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciAoTnVjbGV1cykgI0JBUzIwMjAiLCJjb21wYW55X25hbWUiOiJTaW5ndGVsIEdyb3VwIiwiY29tcGFueV9taWQiOiIvbS8wMjB6ZmwiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJCZDR2djA1UEJaRDJkR2VDQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VVZKaU0xOWthRzk1ZVZOSlZYZFVlRTFQTUZwSVZtOVBNVFYzTWtSV1VtVmlUR1J3VW5jelIyWnlSRlJCUWtaSE5teDBSVmw2YjB4Mk1sZFBjazFIY1RaNmFTMWpTak5IVkdoNVpVVlpTRE5YZEc1eVFtTmpVRTV0WkVaeVdXZEhRak10U1dSbmNEUlNlSGxIY1ZaSlQxbHllV053TjBSUE9IaHlhRTF5ZUZCVGVDMVhTV3Q1WDBsemJtaE9PVlp0YlZGaU5IWTRZamhZZVVWQkVoWkxibTFEV1U1VVVrWk9SRzFmVVdGYU9GbFFaMFIzR2lKQlQwMVpVbmREWlVsTlJUWXRNVEV4ZUUxT05YTndUV2hvV0ZJNGVXSk1PR1pCIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNDMiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gU2luZ3RlbCBDYXJlZXJzIiwibGluayI6Imh0dHBzOi8vZ3JvdXBjYXJlZXJzLnNpbmd0ZWwuY29tL2pvYi9Tb2Z0d2FyZS1FbmdpbmVlci0lMjhOdWNsZXVzJTI5LUJBUzIwMjAtU2luZy81ODA1OTQ5MTAvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "System​/Cloud Engineer​/Certified AWS Associate", "company_name": "OakTree Consulting", "location": "Singapore", "via": "via Learn4Good", "description": "Position: System/Cloud Engineer(Certified AWS Associate)\nJob Description\n\nResponsibilities:· Design cloud system based on client's requirement by utilizing cloud services and tools such as AWS, Microsoft Azure or Google Cloud.· Work on cloud platform setup, implementation and administration· Integrate or deploy third party projects into system· Administrate, configure and troubleshoot applications in Linux or Windows environment.\n\nRequirements:· Bachelor Degree in IT or related fields.· Minimum 2 years' experience designing and configuring any Linux distribution and/or Window servers.· Seasonal coder in Python/Bash/Power\n\nShell or other server-side scripting language.· Experience setting up cloud platform such as AWS, Azure, GCP.\n\n· Ability to communicate value, progress of projects to required stakeholders in English language.· Motivated learner in new technology.· Experience in infrastructure of code (IoC) such as Cloudformation, Terraform takes a big advantage.· Experience in... DevOps, CI/CD techniques such as GIT, Jenkins, Bamboo is preferrable.· Experience in containerization such as Docker and Kubernetes orchestration is a plus.· AWS certified solution architect is a plus.·\n\nGCP certified engineer is a plus. Please submit resumes to [Click Here to Email Your Resume] with the following details in MS Word format:\n\n- Position applying for\n\n- Current remuneration\n\n- Expected remuneration\n\n- Notice period John Goh Meng Chye EA License No : 06C4642EA Reg No : R1102621", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTeXN0ZW3igIsvQ2xvdWQgRW5naW5lZXLigIsvQ2VydGlmaWVkIEFXUyBBc3NvY2lhdGUiLCJjb21wYW55X25hbWUiOiJPYWtUcmVlIENvbnN1bHRpbmciLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IkdXeTJzbnU1Mm1rNkJXcWtBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGVhcm40R29vZCIsImxpbmsiOiJodHRwczovL3d3dy5sZWFybjRnb29kLmNvbS9qb2JzL3NpbmdhcG9yZS9zb2Z0d2FyZV9kZXZlbG9wbWVudC8yNzEzMDU3NzkvZS8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Software C Developer", "company_name": "Aryan Solutions Pte Ltd", "location": "Singapore", "via": "via JobsCentral", "description": "We are looking for a Senior C Developer for an ongoing long-term project in Singapore. The role will be permanent with a client based in Singapore.\n\nRESPONSIBILITIES\n• You will work within a growing research and development team to improve existing and build brand new Client products\n• You will work closely with Product Managers, Architects, Security, Operations, and QA through all phases of the software development lifecycle\n• You will be developing distributed, highly scalable efficient microservices for data protection and cybersecurity features in Client products\n• You continuously improve your own and your teammate's technical skills via mentoring, PR reviews, and feedback\n• You should be open to jumping into unfamiliar codebases, languages and start contributing\n\nREQUIREMENTS\n• Preferably a degree in computer science or equivalent engineering education or relevant work experience in the IT industry\n• 3+ years of backend development experience on large scale systems\n• Experience... with Golang development is highly preferred\n• Experience with developing microservices for cloud products and REST APIs\n• You can find your way around working with various data stores like PostgreSQL/ MySQL, Elasticsearch\n• Experience in Python, knowledge of Pytest or other test automation frameworks and tools would be a plus\n• Hands-on Docker and Kubernetes experience will be added advantage\n• Experience with Agile and CI/CD tools such as Jenkins is preferred\n\nInterested, Candidates please share their resumes at [Click Here to Email Your Resume] or call at 6708 7429 for a confidential discussion", "extensions": ["3 days ago", "$5K–$10K a month", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time", "salary": "$5K–$10K a month"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBDIERldmVsb3BlciIsImNvbXBhbnlfbmFtZSI6IkFyeWFuIFNvbHV0aW9ucyBQdGUgTHRkIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJpSDYycGZUeTllY25nUzVTQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnNDZW50cmFsIiwibGluayI6Imh0dHBzOi8vam9ic2NlbnRyYWwuY29tLnNnL2pvYi9zb2Z0d2FyZS1jLWRldmVsb3Blci1qM242Yzg3OGhwMDc1cGdmc2IzP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Part-time Software Engineer - Accounting Firm", "company_name": "3E Accounting Pte Ltd", "location": "Singapore (+1 other)", "via": "via 3E Accounting", "description": "3E Accounting Singapore is currently looking to appoint a Part-time Software Engineer to join their company digital R&D team in Singapore office.\n\n3E Accounting Pte Ltd aims to be the leading corporate service provider and top accounting firm in Singapore providing One-Stop Solution services for our clients.\n\n3E Accounting Pte Ltd, Singapore is the global headquarters of 3E Accounting International, an International Accounting network with a global presence in more than 80 countries worldwide.\n\nOur Mission\nTo offer the Three Es: efficiency, effectiveness and economy, all part of our One-Stop Solution services for our clients.\n\nOur Vision\nThe World’s leading corporate service provider, offering services beyond excellence.\n\nRemuneration is commensurate with qualifications and work experience. Qualified and interested candidates should email their resume to info@3ecpa.com.sg\n\nPlease state your current and expected salary.\n\nJob Responsibilities:\n\n• Responsible in supporting the full... software development of new and existing applications.\n• Work with internal team to explore and create new design/architectures (but not limited to) for better scaling and performance of front-end and back-end services\n• Document systems enhancements and details specifications\n• Prepare test data to satisfy user acceptance test scenarios\n• Support/prepare project status reports for stakeholders\n• Any other ad-hoc duties as required or assigned\n\nRequirements:\n\n• Degree in Computer Science, Information Technology or related degrees\n• Experience in back-end software development preferred.\n• Ability to adapt quickly to new technology and in-house application\n• Good written and communication skills to be able to work effectively with IT and Digital R&D team.\n• Ability to translate business needs into technical solutions\n• Proficient in Front-end (HTML, CSS, JavaScript, ajax, bootstrap)\n• Knowledge in Python, RestApi, OOP (object-oriented programming), MVC (model-view-controller), Django, SQL, GitHub, angular.js and Principle of Accountancy preferred", "extensions": ["Over 1 month ago", "Part-time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Part-time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQYXJ0LXRpbWUgU29mdHdhcmUgRW5naW5lZXIgLSBBY2NvdW50aW5nIEZpcm0iLCJjb21wYW55X25hbWUiOiIzRSBBY2NvdW50aW5nIFB0ZSBMdGQiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Imgyc29JMkJkeFJveEowMlhBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gM0UgQWNjb3VudGluZyIsImxpbmsiOiJodHRwczovL3d3dy4zZWNwYS5jb20uc2cvY2FyZWVycy9wYXJ0LXRpbWUtc29mdHdhcmUtZW5naW5lZXIvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Senior Software Engineer, Cloud Threat Detection Product", "company_name": "Horangi", "location": "Singapore (+1 other)", "via": "via TalentTribe", "description": "At Horangi we’re building Warden, a multi-cloud solution that enables continuous cloud security, compliance monitoring and risk management for AWS and GCP. Warden deploys in minutes, delivering actionable insights to help our customers identify, prioritize and fix security threats in their multi-cloud environments.\n\nHorangi is looking for experienced senior software engineers to join our team. You will be part of an engineering team building scalable systems capable of detecting real time threats and adversarial activities within our customer’s cloud environment.\n\nYour team will build a rule-based and behavior-based analysis engine that monitors real-time events and log streams from multiple cloud providers to identify real threats faster, thereby reducing time to remediation. You will plan detection based on real-world data and well-understood scenarios, and codify threat detection rules that can be rapidly deployed.\nWhat you’ll be doing\n• You will design and develop stream... processing infrastructure and application\n• You will build a scalable system that can handle events at scale\n• You will work with AWS technologies like Amazon Kinesis, DynamoDB and EventBridge\n• You will help build a framework for our threat detection engine and a repeatable process of building rules\n• You will learn to encode security insights into automation\n• You will continuously monitor system health and optimize performance\nWhat we’re looking for\n• You have at least 5 years experience in backend engineering. Python is your lingua franca\n• You are experienced with designing and building products with AWS and serverless technologies\n• You are a strong communicator. Explaining complex technical concepts to non-technical audiences is not a problem for you\n• You possess strong computer science fundamentals: data structures distributed systems, networking and graph algorithms\n• You write high quality code, that can be safely co-authored in a fast grown organization\n• You have a good understanding of how various cloud services work across all major cloud providers. Relevant cloud certification is a strong bonus\n• You have a bachelor’s degree in Computer Science, Engineering or related field, or equivalent training, fellowship, or work experience\nBonus points if you have\n• You have experience building real-time stream processing systems\n• You have prior experience in cybersecurity or intelligence fields\n• You have knowledge of CI/CD & DevOps tools\n• Contributed to open source projects\n\nAt Horangi, we pride ourselves as Cloud Security Champions in Asia backed by a team of global cybersecurity experts and trusted by Industry Leaders such as Gojek, MoneySmart, PropertyGuru and Tiket.com.\n\nWe built our Cloud Security product using AWS technology and cloud best practices to provide the security, performance and reliability of our platform as we ship rapidly in our agile software development. We adopt an event-driven architecture and embrace serverless technologies that are backed with 100% infrastructure as code. We build our app using reliable tools and frameworks that our team knows and trusts, including Python, Docker, TypeScript, React and GraphQL.\n\nHorangi has a positive, diverse, and supportive culture, and we look for people who are curious, inventive, and work to be a little better every single day. We work in a fast-paced, dynamic and get-things-done culture. Horangi is always looking to hire collaborative, humble and highly driven individuals who want to make a difference.\n\nLevel yourself up as a cloud security expert and do the best work of your life here at Horangi", "extensions": ["Full–time"], "detected_extensions": {"schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgRW5naW5lZXIsIENsb3VkIFRocmVhdCBEZXRlY3Rpb24gUHJvZHVjdCIsImNvbXBhbnlfbmFtZSI6IkhvcmFuZ2kiLCJjb21wYW55X21pZCI6Ii9nLzExZm00MXdkaDMiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiI2YW42X0tjekhNaTUwd3BoQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VTNKSlgzQXdVRnBTUmpscGQxRk5UbnBqY25waFNYRndMWFY2VFVkYVJFNVRabVpyU25wcmNXOTVZMmMyU0dSNU5FNVBXamRYWkdGQlQxSnpUbDk1TlhKcFVEVktjVWRhWjBadk1FRnVaVkJqZG00MU9WbDZXbTQzYWtOVVZIUnRXbDlDV0VGNVFrbEJZakJvVDNCMFJERlJSbDlLZFhWSExTMWhkVmxyVEVRd1YyeHhibFZzUWpCS1NqUkxWMncxTWpORk0zSnVaRkpwYXpCbkVoWkxibTFEV1U1VVVrWk9SRzFmVVdGYU9GbFFaMFIzR2lKQlQwMVpVbmREVmpnMFRsRldaRmhmTkVKNGMwOXZjRkpKUm1KNGVISTNXRGRCIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNjMiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gVGFsZW50VHJpYmUiLCJsaW5rIjoiaHR0cHM6Ly90YWxlbnR0cmliZS5hc2lhL2pvYnMvaG9yYW5naS9zZW5pb3Itc29mdHdhcmUtZW5naW5lZXItY2xvdWQtdGhyZWF0LWRldGVjdGlvbi1wcm9kdWN0LU9xTXZwaD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}], "chips": [{"type": "Title", "param": "job_family_1", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Software engineer", "value": "software engineer"}, {"text": "Engineer", "value": "engineer"}, {"text": "Senior", "value": "senior"}, {"text": "Cloud engineer", "value": "cloud engineer"}, {"text": "Test engineer", "value": "test engineer"}, {"text": "Research engineer", "value": "research engineer"}, {"text": "Assurance engineer", "value": "assurance engineer"}, {"text": "It engineer", "value": "it engineer"}, {"text": "Java engineer", "value": "java engineer"}, {"text": "Qa engineer", "value": "qa engineer"}, {"text": "System engineer", "value": "system engineer"}, {"text": "Data engineer", "value": "data engineer"}, {"text": "Devops engineer", "value": "devops engineer"}, {"text": "Network engineer", "value": "network engineer"}, {"text": "Principal engineer", "value": "principal engineer"}, {"text": "Quality engineer", "value": "quality engineer"}, {"text": "Solutions engineer", "value": "solutions engineer"}, {"text": "Technical", "value": "technical"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Associate", "value": "associate"}, {"text": "Associate engineer", "value": "associate engineer"}, {"text": "Automation", "value": "automation"}, {"text": "Design engineer", "value": "design engineer"}, {"text": "Development engineer", "value": "development engineer"}, {"text": "Development manager", "value": "development manager"}, {"text": "Engineering manager", "value": "engineering manager"}, {"text": "Firmware engineer", "value": "firmware engineer"}, {"text": "Frontend engineer", "value": "frontend engineer"}, {"text": "Hardware engineer", "value": "hardware engineer"}, {"text": "Lecturer", "value": "lecturer"}, {"text": "Manager", "value": "manager"}, {"text": "Officer", "value": "officer"}, {"text": "Principal", "value": "principal"}, {"text": "Product engineer", "value": "product engineer"}, {"text": "Programmer", "value": "programmer"}, {"text": "Project officer", "value": "project officer"}, {"text": "Research associate", "value": "research associate"}, {"text": "Science", "value": "science"}, {"text": "Security engineer", "value": "security engineer"}, {"text": "Senior engineer", "value": "senior engineer"}, {"text": "Senior lecturer", "value": "senior lecturer"}, {"text": "Senior system", "value": "senior system"}, {"text": "Senior technical", "value": "senior technical"}, {"text": "Services engineer", "value": "services engineer"}, {"text": "Software architect", "value": "software architect"}, {"text": "Software engineering", "value": "software engineering"}, {"text": "Specialist", "value": "specialist"}, {"text": "Stack engineer", "value": "stack engineer"}, {"text": "Systems analyst", "value": "systems analyst"}, {"text": "Systems engineer", "value": "systems engineer"}, {"text": "Technical marketing", "value": "technical marketing"}, {"text": "Testing engineer", "value": "testing engineer"}, {"text": "Trainee", "value": "trainee"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Wholesale", "value": "/business/naics2007/42"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Rental", "value": "/business/naics2007/532"}, {"text": "Staffing", "value": "/business/naics2007/5613"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": ".AB4Jjf.qPB6Vc{padding-right:11px}.qfpP8d{padding:7px 0 7px 11px}.S003Ke{flex:none}.ZoN4Lb{color:rgba(0,0,0,.54)}.nAXVG{color:#70757a}.IxQsL{color:rgba(0,0,0,.26)}.xFO1De{color:#fff}.ooFpK{color:rgba(255,255,255,.30)}.mtnwac{color:#4285f4}.WxeeKb{color:#34a853}.hIVRU{color:#f29900}.EXaTMc{color:#fbbc04}.sxn46d{color:#000}.gqMTF{color:#1a73e8}.zpn8Mb{color:#d93025}.dEUPmd{color:#1e8e3e}.PJNo1{color:#fbbc04}Actively Hiring", "value": "e"}, {"text": "EPAM", "value": "/m/0dlnrc"}, {"text": "VISA", "value": "/m/01kqjn"}, {"text": "Nanyang Technological University", "value": "/m/0l49k"}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Zühlke", "value": "/g/1hh_rg216"}, {"text": "HCL SINGAPORE PTE. LTD.", "value": "/g/11fy25ngsv"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "Experis Singapore", "value": "/g/11dxpnwm3s"}, {"text": "OakTree Consulting", "value": "/g/11g70jfhtq"}, {"text": "Realtek Malaysia", "value": "/m/05wrm7"}, {"text": "TikTok", "value": "/g/11fy265933"}, {"text": "UST", "value": "/m/08kb8g"}, {"text": "UrbanFox", "value": "/g/11ghs7y0w6"}, {"text": "Activate Interactive Pte Ltd", "value": "/g/11dxq192l5"}, {"text": "Cardinal Health", "value": "/m/040vzx"}, {"text": "Cognizant", "value": "/m/03bf9h"}, {"text": "Collins Aerospace", "value": "/m/0kv61y1"}, {"text": "Credit Agricole Group", "value": "/m/028vbm"}, {"text": "DELL", "value": "/m/0py9b"}, {"text": "EPS Consultants Pte Ltd", "value": "/g/11gbxgscvy"}, {"text": "GlobalTix Pte Ltd", "value": "/g/11dxpqdhrf"}, {"text": "HCL Technologies", "value": "/m/0698gv"}, {"text": "Jobline Resources Pte Ltd", "value": "/g/11gp2647pn"}, {"text": "Metropolitan Wireless International Pte Ltd", "value": "/g/11g9m_xbc4"}, {"text": "PALO IT", "value": "/g/11dxpwj75r"}, {"text": "Singapore Press Holdings Limited", "value": "/m/0d7mwh"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "Thales DIS (Singapore) Pte. Ltd.", "value": "/g/11f0197yrz"}, {"text": "Thales Group", "value": "/m/01phj4"}, {"text": "Zendesk", "value": "/m/0wkm4pl"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "Aryan Solutions", "value": "/g/11dxptv4s4"}, {"text": "Atidan Technologies", "value": "/g/11c74f0b8_"}, {"text": "Bee Cheng Hiang Hup Chong Foodstuff Pte Ltd", "value": "/g/11dxpq9hhl"}]}]}