{"search_metadata": {"id": "60827e165119a62812c3be08", "status": "Success", "json_endpoint": "https://serpapi.com/searches/238279585bb6b4c7/60827e165119a62812c3be08.json", "created_at": "2021-04-23 07:58:14 UTC", "processed_at": "2021-04-23 07:58:14 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28system+analyst%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=0", "raw_html_file": "https://serpapi.com/searches/238279585bb6b4c7/60827e165119a62812c3be08.html", "total_time_taken": 1.23}, "search_parameters": {"q": "(system analyst) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "0"}, "jobs_results": [{"title": "Senior IT Systems Analyst", "company_name": "Capiteq", "location": "Singapore (+1 other)", "via": "via LinkedIn", "description": "Established in 2013, Capiteq is a Singapore/Hong Kong based technology company with a core focus in delivering high quality I.T. services to Hedge Funds and Private Family Offices in Asia.\n\nFounded in 2013, the company has established itself as a leading technology provider focused in delivering Technology Support & System Management, CTO Advisory, Cyber Security and Project Management services.\n\nDue to expansion and growth targets, we are now looking for a Senior IT Systems Analyst to be based in Singapore. Reporting into the Head of Infrastructure, this role will involve troubleshooting user client issues through our helpdesk as well as acting as a point of escalation for first responders on servers system related issues. You will also be responsible for the overall maintenance, upgrade, monitoring and patching of all related systems. Including backup management, disaster recovery testing, policy enforcement and hardening. Candidates highly proficient across managing Microsoft... technologies - 2016/2019/AD/Office 365/Azure.\n\nApplicants should be highly experienced in providing both level 2 and 3 support for companies operating in financial markets. The successful candidate should come from a support background with high exposure to server administration and Microsoft technologies. You must also be able to demonstrate solid experience across managing VMWARE, WINTEL environments and troubleshooting issues particularly across AD, SSO, DFS.\n\nThis position is best described as a hybrid role combining level 2 and 3 support levels with a strong focus in server / office 365 and azure.\n\nEnsuring server-side systems are running optimal, through stringent health checks, maintenance plans, system monitoring and security patch management / reporting.\n\nThe Successful Applicant Will Be Responsible For\n\nEnsuring clients issues are resolved/whether deskside or server side.\n• Providing troubleshooting assistance to clients with regards to system issues through our central helpdesk.\n• Acting as point of escalation for first responder team.\n• Server maintenance and patch management\n• VMware / Windows Servers maintenance / backup and patch management of all Windows Servers 2016/19 and Windows 10\n• Monitoring and Administration of Citrix Cloud\n• Administration of Office 365 Enterprise environments- policy creation / deployment / reporting\n• Maintaining Exchange Server 2013/2016 Infrastructure (advantage)\n• Basic Administration of Linux servers\n• Backup & Disaster Recovery Operation for client environments\n• Consistently Advancing and improving IT Policy/Server Architecture.\n• Maintaining Assets Tracking and Warranty/Licensing\n• IT Projects- implementing projects for system upgrades and new setups from the ground up\n• Enforcing IT Policy and hardening policy across client environments.\n• Testing of new technologies in UAT environment.\n\nTechnical Skills Required\n• At least 8 years of experience in Wintel Server, Client Administration, Windows Server 2016/2019, and Windows 10\n• Proven experience in VMware ESX / Azure\n• Experience with Citrix Administration\n• Strong across Microsoft Technologies – Office 365 Administration/Azure/Server 2016/ 2019\n• Experience using virtualized backup technologies.\n• Exposure to Citrix Technology\n• Good knowledge across hardening of devices and current auditing standards, e.g. (TRM) – (NIST)\n• Nessus - Vulnerability Scanning\n• Experience with monitoring software\n• Powershell scripting expertise (Advantageous)\n\nSoft Skills Required\n• A proactive self-starter\n• Genuine interest in furthering own technical ability and improving client environments\n• Ability to communicate with team and articulate ideas well- a strong team player\n• Ability to work well and collaborate with other team members in different geographical locations\n• Reliable, Positive with a Can-do attitude\n• Ability to translate complex issues into solutions people can understand\n• Quick-thinking; the person must be able to think on their feet and provide alternative solutions when needed\n• Ability to Multi-Task and Priorities\n\nCapiteq will provide the successful applicant with an opportunity to progress their career, learn new technologies as well as further advance in certification and training. You can expect to be rewarded with a competitive remuneration package, autonomous work environment with attractive benefits.\n\nPlease note that this role is based in Singapore, only candidates based in Singapore will be considered. Your cover letter and resume should be sent to recruit@capiteq.com. We look forward to receiving your application", "extensions": ["12 hours ago", "Full–time"], "detected_extensions": {"posted_at": "12 hours ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgSVQgU3lzdGVtcyBBbmFseXN0IiwiY29tcGFueV9uYW1lIjoiQ2FwaXRlcSIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoic3dMMEYwd29rWTdRVFJHS0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL3NnLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvc2VuaW9yLWl0LXN5c3RlbXMtYW5hbHlzdC1hdC1jYXBpdGVxLTI1MTU4MDQzNTk/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Senior System Analyst", "company_name": "RHB Singapore", "location": "Singapore", "via": "via SmartRecruiters Jobs", "description": "Company Description\n• RHB Singapore is a progressive and growing financial organization. We are committed to creating a fulfilling, dynamic and engaging work environment for our team of more than 15,000 employees across nine locations in ASEAN, China and Hong Kong.\n\nJob Description\n\nPrimary Objective\n\nCustodian and system expert who can advise, analyze, plan, implement, maintain, support (and retire/refresh where required) all locally hosted (On premise, Cloud) business applications and platforms required to run Singapore operations:\nCommon to all Senior System Analyst\n• Maintain and ensure business application running in production are kept running and supported in a healthy state;\n• Analyze and recommend new application and platform acquisitions to meet evolving Singapore Operation’s needs based on capturing and documenting business requirements elicited from business stakeholders\n• Where the business application is in-house developed do the required coding and development... otherwise engage with 3rd party vendor to get enhancements developed and then deploy into test and prod when ready\n• Ensure IT is operated in a manner that complies with Bank Policies and frameworks, standards, circulars, guidelines and MAS regulated act, notices, circulars, and guidelines applicable to technology (Compliance, Audit, Risk Adherence). – Application and Platforms\n• Ensure IT assets are protected and secure – Applications and Platforms\n• Assist in annual budgeting – Applications and Platforms\n• Be a key stakeholder and technology partner on the bank Digital journey.\n• Foster and champion bank PRIDE values within the technology department and imbue the department with a culture of teamwork, innovation, discipline, resiliency and dedication to how work is approached.\n• Where vendor based solution approach adopted and/or outsourced approach, arrange due diligence and assessment from technology perspective on behalf of users.\n• Provide day-to-day support to business users on any application system issues or constraints\n• Ensure assigned application deployments running on bank managed environments are properly QA and meet conditions.\n• Co-ordinate the setup and manage test environments to ensure business can do their enhancements and new projects testing for assign applications.\n\nSpecific to Senior System Analyst\n\nSenior System Analysts are assigned to specialize in one of the following groupings of business applications and platforms:\n• Core Systems: Back-office systems such as core banking systems (Customer, Statements, Loans/Limits, Deposit, GL, Branch Banking, Trade, Asset Based Financing) and In-house Systems (loans related, bank notes system, Safe deposit box, excel based).\n• Digital and Payments: Digital, Payments and Channel systems such as Mobile Banking (MBK), SOA / API and Messaging platforms, UAS/E2EE/MFA customer token platform, Digital onboarding, ATMs, SWIFT/MEPS+, G3 Fast and Bulk Payments, Cheque processing system, Enterprise workflow system, document share system, RPA\n\nKey Responsibilities\n\nStrategy, Planning, Mgmt. Reporting\n• Provide expert advice and support to technology management in the area of expertise\n• Contribute in the formulation a comprehensive Branch IT strategy covering IT policies and procedures, security, architecture, business solutions and operational functional requirements\n• Keep abreast of developments and innovations in the FI IT landscape\n• Provide mentorship, support and guidance to colleagues, share information and facilitate problem solving\n• Contribute in the yearly budgeting for IT expenditures and investments.\n\nIT Operations\n• Ensure business applications running in production are healthy and functioning per expected.\n• Ensure prompt and efficient provision of IT support based on assigned area of expertise (includes request from Data center operations team)\n• Oversee contingency plans and ensure their adequacy\n• Ensure IT assets are protected and secure\n• Maintain and ensure timely renewal of digital certificates and proper lodgment with IT security team.\n• Ensure IT operations run in a manner consistent with high score from audit, risk, compliance assessments. The following to be operationalized as standard procedure against all IT asset components:\n\n– Administrative Accounts\n\n– All admin accounts lodged into PAM solution per group IT Security guidelines and MAS notice 655 point 4.1\n\n– Patching – Patch notification process established with vendors and patch calendar updated, upon patch release assessment and implementation as needed Per patching guidelines and MAS notice 655 point 4.2\n\n– Hardening - Per component definition and enforcement against SG security standard and Group IT Security guidelines and SG addendum/s and MAS notice 655 point 4.3\n\n– Network Perimeter Defense\n\n– Network traffic and segments, firewalls, proxies, dns, vpn access setup in secure manner per group IT security guidelines and MAS notice 655 4.4\n\n– Malware – IT Security consulted and all required IT security protections installed on IT assets per MAS notice 655 point 4.5\n\n– Multi-factor Authentication – MFA, where applicable implement MFA of administrative and internet accounts with access to customer information using PAM per MAS notice 655 point 4.6\n\n– Logging and Monitoring – Security, Capacity, Downtime, Audit – Capacity Mgmt. – Pre-emptive monitoring (via monitoring), planning and execution of capacity upgrades as needed\n\n– EOL/EOS Upgrades – Per group guidelines. Track and execute upgrades and/or do risk assessment and deviation approval.\n\n– Housekeeping – scripted clean-ups and truncations of logs and temp files after necessary archives executed\n\n– Backups – Required backup strategy per backup guidelines operationalized to central Backup Platform. Recurring scheduled backup validation activities scheduled and performed ongoing to ensure backups working per need.\n\n• Work with system stakeholders to ensure proper classification of system criticality and ensure design and architecture can meet the assessed criticality needs:\n\n– MAS 644 defined Critical system – Ensure DR setup and working and can achieve RTO within 4 hours, RPO within 2 hours and maximum unplanned downtime of not more than 4 hours per rolling 12 months;\n\n– MAS 644 defined non-critical system – Ensure HA/DR per stakeholder requirement.\n\n• BCM related activity planning and execution.\n\n• Review and Approve/Reject production change requests as part of TCAB committee • Raise CAB CR as necessary.\n\n• Cutover related planning and execution.\n\n• Ensure and maintain adequate test environments in good working order to support enhancements and new projects;\n\n• Adhere to SDLC for both in-house and 3rd party solution platforms.\n\n• Take BAU day 2 operational ownership in terms of maintenance, support and minor enhancement ownership of new systems and/or major enhancements delivered by the Digital Delivery and DevOps team.\n\n• Track IT related spend against budget.\n\n• Write Memos to authorize procurements.\n\n• Write Memos to get deviation approvals where required.\n\nApplication and Systems Development / New Platform Acquisition\n\n• Lead in the requirements gathering and documentation, design and where in-house the coding, test support and implementation of new systems or enhancements of existing systems:\n\n– Analyze, design, document and develop technical solutions according to business requirements (or in case of off the shelf, co-ordinate with 3rd party vendor).\n\n– Provide accurate, complete and up to date system documentation.\n\n– Provide training to users to ensure correct usage and proper adoption upon rollout – Oversee the QA of software implementation.\n\n• Oversee the deployment and implementation of applications to run on Cloud for existing systems based on end-user needs and business rationale.\n\n• Assist team lead to write and table committee papers as required to get new systems and/or platforms, or major refreshes approved.\n\n• Write Memos to authorize procurements.\n\n• Write Memos to get deviation approvals where required.\n\n• Work together with Digital Delivery and DevOps team to support digital and cloud initiatives in terms of initial advisory and then follow-on necessary analysis and coordination/implementation related to integration requirements and enhancement required to existing business applications to enable the digital initiative.\n\n• Work with Digital Delivery and DevOps team to support migration of workloads running onpremises to Cloud.\n\nRegulatory and Procedural Expertise\n\n• Keep up to date and refreshed on required reading related to guiding how IT must be run in a regulated Financial institution. Minimum read list:\n\n– MAS Technology Risk Management Guidelines (TRMG)\n\n– MAS Notice 644 – Technology Risk Management.\n\n– MAS Notice 655 – Cyber Hygiene\n\n– MAS Outsourcing Guidelines\n\n– RHB Group IT Security Guidelines and SG addendum/s\n\n– SG Patching Guidelines\n\n– SG Backup Guidelines\n\n– SG Technology Department Operational Manual (OM)\n\n– SG IT Standard Operational Procedures (SOP), and System Manuals (SM)\n\n– SG Procurement Operational Manual (OM)\n\nOther Responsibilities\n\n• Participate in Monthly Technology Department meetings.\n\n• Participate in regular Team meeting.\n\n• Use Department issue and work tracking platform.\n\n• Maintain and keep up to date team knowledge base and assist in updating team document assets such as system manual / standard operating procedures (SOP), and operations manuals.\n\nQualifications\n\nFormal Education:\n• Bachelor Degree/Masters Qualification\n\nProfessional Accreditation:\n• TOGAF architecture certification (not mandatory)\n• Net developer related certification (not mandatory)\n• Java developer related certification (not mandatory)\n• SQL Developer related certification (not mandatory)\n\nPreferred level of Experience (by years/function/industry):\n• Minimum 5 years of experience documenting requirements, designing solutions, and coding or configuring off the shelf software as part of technology department in a financial institution based in Malaysia or Singapore\n• Minimum 3 years of experience in providing level 3 IT operations support in a financial institution based out of Malaysia or Singapore.\n• Experience managing vendors\n\nOther skills required:\n• Working knowledge of bank operations and products\n• Experience in supporting and configuring core banking systems\n• Experience in agile based SDLC methodologies\n• JavaScript / Node.js | .Net | Java | SQL | Python | Shell Scripting development skills\n\nAdditional Information\n\nRHB is a dynamic organization that promotes a work culture of high performance, where its biggest asset, the RHB-ians, are continuously developed & nurtured to their fullest potential through its robust talent management practices.\n\nAt RHB, we take PRIDE in our people and our teams. Great relationships built on trust, a ‘leading it right’environment, challenging assignments and a culture of excellence are the pillars to the dynamic and diversified workplace we call home", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU3lzdGVtIEFuYWx5c3QiLCJjb21wYW55X25hbWUiOiJSSEIgU2luZ2Fwb3JlIiwiY29tcGFueV9taWQiOiIvZy8xMWM3M3NyZzdmIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiLXBnZjRiQ3BYNkV4NkdKeUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFV6ZEVlbkpmV0UxTmVWQnpOa280UjNOMk0xSmhZbFpSVERnNGNWSllRbmwxVm5RMmNYbG1jSGxsTWw5amVGRnhTbk5qZDBGbmFtTnZNMWd3V2kxZk5XVXpWV2RWVWpoRWQwUnpURm8xYTFKVGRsSmlSblZFU2pRMVpsRXlUMjlFU0ZwNlkyNUllRWR6WTNOTFpuaHplWEppWkd0WGJtMHdlSFIzTUV0MWJYSTNMV1ZGT1V4U2QxSklVRUZCYTNSNWFIZzRkSEpsVkVsRUxWUjNFaFpHYmpaRFdVMDJaVWx6WWxKMFFXRkZhVXBFU1VOM0dpSkJUMDFaVW5kRFMwcG9ZemQwZFcxaU1reFNSRFpUVUdSTGVHbE1SMnh2YVdaUiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzExIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFNtYXJ0UmVjcnVpdGVycyBKb2JzIiwibGluayI6Imh0dHBzOi8vam9icy5zbWFydHJlY3J1aXRlcnMuY29tL1JIQlNpbmdhcG9yZS83NDM5OTk3MjQwNzQwNTAtc2VuaW9yLXN5c3RlbS1hbmFseXN0P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "IT Systems Analyst", "company_name": "Capiteq", "location": "Singapore (+1 other)", "via": "via LinkedIn", "description": "Established in 2013, Capiteq is a Singapore based technology company with a core focus in delivering high quality I.T. services to Hedge Funds and Private Family Offices in Asia. Founded in 2013, the company has established itself as a leading technology provider focused in delivering IT Support & System Management, CTO Advisory, Cyber Security and Project Management services.\n\nAs a result of continued growth and demand for our services, we are interested to hear from IT professionals with experience in providing level 2 user helpdesk support and server/cloud administration.\n\nThe ideal candidate would be someone who possesses a technical skill set across a wide range of technologies, knowledge across Windows Server administration, Desktop support as well as solid experience in Office 365 is a requirement of the role.\n\nSuccessful candidates should be able to demonstrate knowledge in Microsoft technologies and have strong experience providing support to VIP members of staff. Experience... in Window Server Administration, backup management, patch management of systems will also be deemed advantageous.\n\nThis role will require a strong communicator as it will involve interfacing with C level staff. The position will work within a team of engineers providing support to our clients in Hong Kong and Singapore delivering.\n\nWe are looking for someone who understands service delivery and what it takes to deliver IT at the highest level.\n\nTechnical Skills Required\n• At least 6 years of Level 2 support experience (End user/ Server side)\n• Experience in Windows 10/Office 365/2016, Windows Server 2016,2019\n• Strong Microsoft Office 365 Administration,\n• Experience in administering Microsoft Windows 2016/2019 Servers\n• Experience supporting/troubleshooting trading applications e.g. Bloomberg\n• Active Directory/DHCP/DNS, Patch Management, VMware, Veeam Backup,\n• Basic Level Knowledge in IT Networks\n\nInterpersonal Skills Required\n• Strong work ethic and understanding of service delivery (Extremely important)\n• Strong team player with ability to work independently.\n• Strong communication skills as the role will involve liaising with clients on a day-to-day basis.\n• Ambition to work hard and learn/progress in the industry.\n\nCapiteq will provide the successful applicant with an opportunity to progress their career, learn new technologies as well as further advance in certification and training.\n\nYou can expect to be rewarded with a competitive remuneration package, autonomous work environment with highly experienced colleagues.\n\nPlease note that this role is based in Singapore, only candidates based in Singapore will be considered.\n\nYour cover letter and resume should be sent to recruit@capiteq.com.\n\nWe look forward to receiving your application", "extensions": ["13 hours ago", "Full–time"], "detected_extensions": {"posted_at": "13 hours ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJJVCBTeXN0ZW1zIEFuYWx5c3QiLCJjb21wYW55X25hbWUiOiJDYXBpdGVxIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJvNkdtSjVLTzVGWkNSTF9vQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExpbmtlZEluIiwibGluayI6Imh0dHBzOi8vc2cubGlua2VkaW4uY29tL2pvYnMvdmlldy9pdC1zeXN0ZW1zLWFuYWx5c3QtYXQtY2FwaXRlcS0yNTE1Nzg2NTI4P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Business System Analyst", "company_name": "Volt - International", "location": "Singapore", "via": "via LinkedIn", "description": "Position: Business System Analyst\n\nThe Client\n\nMy client is a global leader in semiconductor manufacturing.\n\nThey are currently looking for a Business System Analyst to set sail on their digitalisation journey with them.\n\nThe role will focus on providing internal stakeholders with new analytical products to support the achievement of business objectives.\n\nThe Role\n• Consult and communicate stakeholders and business users to understand, shape and agree on the requirements for new products\n• Perform proof of concepts/protyping to validate concepts with stakeholders and users\n• Write and review functional/technical specifications\n• Perform BI tasks such as ETL and translate data onto reports/dashboards\n\nJob Requirements\n• Bachelor’s Degree in Computer Science/Engineering or equivalent\n• 3 years of work experience in similar capacity required to perform the role\n• Proficient in Oracle Data warehouse design and concepts\n• Proficient with data visualisation tools such as Tableau\n•... Demostrated experience with PLSQ and ETL process\n• Project Management certification is a plus\n\nNext Step\n\nInterested applicants please send your resume to henry.tan@voltasia.com.sg or contact Henry Tan on +65 6701 1521 for a confidential discussion.\n\n-\n\nEA Registration No. 12C5526 | CEI Registration No. R1763552, Tan Ee Boon (Chen Yiwen", "extensions": ["23 hours ago", "Full–time"], "detected_extensions": {"posted_at": "23 hours ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJCdXNpbmVzcyBTeXN0ZW0gQW5hbHlzdCIsImNvbXBhbnlfbmFtZSI6IlZvbHQgLSBJbnRlcm5hdGlvbmFsIiwiY29tcGFueV9taWQiOiIvbS8wOW0yM2R5IiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoibnFsYlZuNTJhWTZvR0FjQkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZZQkNyY0JRVTVWWDA1eFZIZGtYMFZMY1dsR2FXUXlTMHczUmw4d1R6TnZkbEJuY0dOUlZWbDNaM0oxU1VGUFZIWnNYMlZ6T0hGVlZDMUZkbmxWWnpoWVdHY3RPREI0UkU5S1JVcFJSV1puYTIxS1NTMVdjRXhSY25vdGJtOU9YM1pqWm05TU4zWXlPVmhhYW5jeGFHZGxhelZQYzBOeE5XVm1NRlY2VWxCdWJuUlhjVGg1ZG5GRGVURlVWVXBYTmtsSlVtdE9TMmRyUVZwSVEzRkdWbWhaV2s0NGFVbEtiRkpMVkRreFowVnJSVzVKUm1seFdsUllYMFV3RWhaR2JqWkRXVTAyWlVsellsSjBRV0ZGYVVwRVNVTjNHaUpCVDAxWlVuZENkVGR5Y0c5SlZXZGFRbDlPV2tKUFZrWlBUbG95ZEVOUmVuaEIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18yNCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL3NnLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvYnVzaW5lc3Mtc3lzdGVtLWFuYWx5c3QtYXQtdm9sdC1pbnRlcm5hdGlvbmFsLTI0OTc3MDk1NzU/cmVmSWQ9NWVmNTk5YmQtODNlYS00YzA5LWJjZWUtNWE0ODdhYzE4YTk3XHUwMDI2dHJhY2tpbmdJZD1xRnhxb0d3WEN4JTJCRUM5STkyeGtzVXclM0QlM0RcdTAwMjZwb3NpdGlvbj0xOFx1MDAyNnBhZ2VOdW09MFx1MDAyNnRyaz1wdWJsaWNfam9ic19qb2ItcmVzdWx0LWNhcmRfcmVzdWx0LWNhcmRfZnVsbC1jbGlja1x1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "System Analyst, IT (SAP ABAP)", "company_name": "Venture Corporation Limited", "location": " (+1 other)", "via": "via Venture Corporation Limited", "description": "Responsibilities :\n• Responsible for performing daily SAP helpdesk support, trouble-shooting on SAP reports and EDI/B2B issues for local & regional operations.\n• Responsible for all SAP ABAP development, EDI and B2B-BizTalk development and enhancement.\n• Perform SAP Helpdesk support, trouble-shooting and debugging.\n• Perform SAP ABAP development changes.\n• Perform SAP Sap script / Smart forms changes.\n• Perform SAP EDI / B2B – BizTalk support and development changes.\n\nRequirements :\n• Degree/Diploma in Computer Science, Information Systems or equivalent, with 3-5 years’ relevant experience.\n• Prior experience in SAP Abap reports using ALV, dialog programming, BDC, Layout sets, LSMW and Data dictionary.\n• Experience in User Exits, Enhancement points, BADIs and BAPI is a must.\n• Experience in EDI / ALE and work flow and any middleware and B2B applications.\n• Professional SAP Certification will be advantageous\n• Any prior experience working with EDI / ALE and work flow and any middleware... and B2B applications", "extensions": ["7 days ago", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTeXN0ZW0gQW5hbHlzdCwgSVQgKFNBUCBBQkFQKSIsImNvbXBhbnlfbmFtZSI6IlZlbnR1cmUgQ29ycG9yYXRpb24gTGltaXRlZCIsImNvbXBhbnlfbWlkIjoiL2cvMTFiYzYxZ2dsdyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImtkX1ZRRjFrVG0xbjFwQ0tBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVvc0NDc3dCUVU1VlgwNXhVVVE1U1dsT1VqRkVaMnhWUkdOelJUbGpiWEk1VUVWeU5IZFhlWEI1YjNseVJqQnpSVUUzVkV4emJXMUxSMWwzUjFoeFdqbEtjbXhQWVZCdVdUUjFjSFJmYWw5eU0yNU5WbGhpYTBsemJ6VnZOMnh5TVc5cmVYTktXVmhET1ZJek9WQmZRV3BTVm5OMGN6QjJSV3hXUnpBM1JFZFJkemhXU2twWWRtOXFVM1paTlY5a2NXSjRiRnBpVW14cVZtVkVORk5IVTJ3MWRUSjBWRkpuUlhKWldXWnJNamwzZERBeFlubzBVMFZwTm1WQlJqSnNUMGRYUlhSS1pVMVRMV05VU0dwZk4xWlFFaFpHYmpaRFdVMDJaVWx6WWxKMFFXRkZhVXBFU1VOM0dpSkJUMDFaVW5kRFUzTnZURU14VHkweGVYcFRaRVI0TTFsV1QxOTRTeTFqWWtWbiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzMxIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFZlbnR1cmUgQ29ycG9yYXRpb24gTGltaXRlZCIsImxpbmsiOiJodHRwczovL3d3dy52ZW50dXJlLmNvbS5zZy9qb2Ivc3lzdGVtLWFuYWx5c3QtaXQtc2FwLWFiYXAvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "EPIC Application Analyst", "company_name": "Accenture", "location": "Singapore", "via": "via Accenture", "description": "About Accenture\n\nAccenture is a global professional services company with leading capabilities in digital, cloud and security. Combining unmatched experience and specialized skills across more than 40 industries, we offer Strategy and Consulting, Interactive, Technology and Operations services—all powered by the world’s largest network of Advanced Technology and Intelligent Operations centres. Our 506,000 people deliver on the promise of technology and human ingenuity every day, serving clients in more than 120 countries. We embrace the power of change to create value and shared success for our clients, people, shareholders, partners and communities. Visit us at www.accenture.com.\n\nWe are looking for:\n\nApplication Analysts, who will serve with Process Analysts as part of the primary support team for their designated application. They will take on more advanced issues that arise during the project for their application area and will take on more complex tasks with respect to system... configuration, testing and administration.\n\nResponsibilities:\n• Acting as the primary support contact for the application's end-users, after initial triage by help desk staff\n• Identifying issues that arise in their application area as well as issues that impact other application teams and working to resolve them\n• Guiding workflow design, completing advanced build and testing of the system\n• Identifying and implementing requested changes to the system configuration and cross-application master data files\n• Maintaining regular communication with Epic representatives, including participating in weekly project team meetings\n• Working with Epic representatives, your organization's business community, Process Analysts and end users to ensure the system meets the organization's business needs in regard to the project deliverables and timeline\n• Developing an understanding of operational and clinical needs to set the direction for the organization's workflows by attending discussion sessions\n• Critical thinking and willingness to see things in an open-minded way and examine an idea or concept from as many angles as possible\n• Seeking, logically examining, and interpreting information from different sources to determine a problem's cause and developing a course of action to resolve the problem and to prevent its recurrence\n• Relationship building to gain trust and establish effective relationships with Epic counterparts and stakeholders", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJFUElDIEFwcGxpY2F0aW9uIEFuYWx5c3QiLCJjb21wYW55X25hbWUiOiJBY2NlbnR1cmUiLCJjb21wYW55X21pZCI6Ii9tLzAxcnAyYyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IlpYdVM0U0VzSnV2TkEyUU9BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhVekJyU0RKR01VeG9kVmh5VXpabVJHWkdNWFJFWVRoQ2RYZGhNRWM0WTIxZmVUWllSM0pEZEV0UVlteDZWVEJTV1dKZmRrRldTSHBUVFRSeFMxOW1ibVJ2VnpRMGIyRnhVVUpZVm1ObE9GSkxTV3A0UTNCeFdFZzFNV3hsY3pkeFoyRktURXR5WjFCVkxUaElkaTFIU25KblFtcEdiMnh5YjFZM2FWaHNkak5JUnpGRlRqWndVRFpJYlVZd1dITlFOSEV0UVV0SGFsbGZTUzFSRWhaR2JqWkRXVTAyWlVsellsSjBRV0ZGYVVwRVNVTjNHaUpCVDAxWlVuZEJiVTEwV1dSVVh6TkdlbEozUzNsNGFVNVBVV3hOTWpWdmRuZEIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18zOSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBBY2NlbnR1cmUiLCJsaW5rIjoiaHR0cHM6Ly93d3cuYWNjZW50dXJlLmNvbS9zZy1lbi9jYXJlZXJzL2pvYmRldGFpbHM/aWQ9MDA4OTU0MDZfZW5cdTAwMjZ1dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Business Systems Analyst (Netsuite Administrator)", "company_name": "Workato", "location": "Singapore (+1 other)", "via": "via Jobs", "description": "We are looking for an exceptional Business System Analyst (Netsuite Administrator) to join our growing team. In this role, you will work closely with lines-of-business teams to review/develop sound business processes and identify automation opportunities in these processes. Being the vital link between IT and business function, you will empower teams to respond quicker to changing business needs. For a glimpse into what a Business System Analyst (Integration & Automation) does in Workato, refer to our , which includes projects and processes that our team has accomplished internally over the past year. Workato has a positive, diverse, and collaborative culture—we look for people who are curious, inventive, smart, hardworking and work to be a little better every day. Workato has also been recognized amongst the “Top 47 Enterprise Startups to Bet Your Career On in 2020” and the “Hottest 13 Productivity Software Startups to Watch in 2020!” by Business Insider. Responsibilities Implement... administer and manage Netsuite together with other functional units and act as the subject matter expert for all Netsuite related projects. Assess and procure applications for internal use; build new connections to those applications through APIs Manage and implement projects that coordinate and integrate the flow of critical business data through multiple functional areas and applications Build, test and deploy robust internal applications, tools, bots, and real-time integrations that support Workato's strategic business goal Document processes, applications and integrations used; educate users on the best practices of these processes Develop comprehensive management reporting capabilities by using data from multiple sources and visualising to gather insights on these data Assist in IT audit review to ensure that business processes are aligned across teams Requirements Qualifications and Experience Netsuite Certified Administrator is a Must. Degree from a cross-functional background such as Business IT, Information Systems Management or other similar disciplines 2 -3 years of relevant Business Systems experience. Fresh graduates with relevant internship experience are welcome to apply Skills Ability to translate business requirements into technical specifications Excellent written and oral communication skills in English Good understanding of integration concepts, methodologies, and technologies Comfortable with interpreting API documentation of cloud-based applications, know basic programming logic and SQL Deep understanding of/experience in Salesforce platform(s) (e.g. Salesforce Sales Cloud, Salesforce Marketing Cloud) as you will be involved in the design and delivery of Salesforce implementations Understanding of SaaS tools (e.g. Marketo, Greenhouse, Freshdesk, Netsuite) is a plus", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJCdXNpbmVzcyBTeXN0ZW1zIEFuYWx5c3QgKE5ldHN1aXRlIEFkbWluaXN0cmF0b3IpIiwiY29tcGFueV9uYW1lIjoiV29ya2F0byIsImNvbXBhbnlfbWlkIjoiL2cvMTFkeHB5XzN4ZCIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjU3WTZHOGxtOENzRnJpVXJBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhWSGxFYmpoelEyeFZUbkJrWjFKMGNFcDVWa3B5YjNKeE15MVBXVkpPYlc4MlJIWm5TREUyZWtWNFdFRjZUMkV6WDFsYWVscGpia3AyZGpkR1VXc3phblZvWTJRMFoxZHFPRUptVlRVd2JrRjFSVTF2WDFndFRrVnpVRzF1WkRBM1FYRnFjRFZoUkRneVdUVnZiVTlsWlhWNlMyRnRiRXBPTlZGaGQzaE5OMHhJUzBwVGFqQndaRUU1WDBkVGQxZEZia1YyVG5rdE1YQTRlbk5SRWhaR2JqWkRXVTAyWlVsellsSjBRV0ZGYVVwRVNVTjNHaUpCVDAxWlVuZEJkUzFLUldRd2JHSTFaSE5wVVUxcFVuUmpUVmRpYVZSNlNtZG4iLCJmY3YiOiIzIiwiZmNfaWQiOiJmY180NiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIiwibGluayI6Imh0dHBzOi8vc2cuZmlkYW50by5jb20vam9icy9qb2Itb3BlbmluZy9idXNpbmVzcy1vcGVyYXRpb25zLXNwZWNpYWxpc3RzLWFsbC1vdGhlci9idXNpbmVzcy1zeXN0ZW1zLWFuYWx5c3QtbmV0c3VpdGUtYWRtaW5pc3RyYXRvci0yNzc4NTA1MjU/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Senior Systems Analyst (SG08082)", "company_name": "Parkway Pantai Limited", "location": "Singapore", "via": "via Joblum Singapore", "description": "The Role\n\nImplementation of Projects and day to day operational support of IT systems. Execution of projects, change requests and operation of IT systems.\nKey accountabilities\n• Collaboration with stakeholders to develop, implement and support the delivery of required functionality. Investigate processes to assure system capabilities and process requirements are aligned and plays a critical role in clinical system requirement, solutioning, design, development, testing, implementation and support activities.\n• Work closely with the AVP or Senior Manager in the approval, acquisition and implementation of Clinical projects that include the acquisition, management, and use of information technology (IT) resources, capital planning and investment analyses, the IT operating plan and budget, as well as IT acquisition strategy and performance measures.\n• Resolve project issues with vendors and key stakeholders and ensure the smooth implementation of the clinical projects.\n• Project... evaluation\n• Project Integration\n• Scope management\n• Time management\n• Managing project cost\n• Quality management\n• Human resource management\n• Project communication management\n• Project risk management\n• Project procurement\n• Organisation management\n• Building client relationship\n• Ensure optimum resource allocation and utilization and financial effectiveness for the conduct of the IT activities\n• Oversee the planning, directing, supervising and coordinating of department operations which include the provision of appropriate supporting infrastructure for running the operational systems and in the dissemination of information; assign work activities, projects and programs; monitor work flow; review and evaluate work methods and procedures. Prepare a variety of correspondence including general and special reports.\n• Oversee the preparation and monitoring of IT capital project budgets for approval, IT operating budgets and control of expenditure.\n• Ensure that the Lab Information System and other Lab related IT systems are performing optimally and meets the requirements of Parkway Labs. Establish and develop SLAs with Parkway Labs and ensure that the projects are able to meet these SLAs. Work with Parkway Labs to set and prioritize short and long-term IT goals. Ensure that IT goals are properly executed with proper staffing and budget. Knowledge and experience with Cerner would be an added advantage.\n• Lead and support the IT team and ensure that team members are properly assigned. Develop, coach and grow team members’ capabilities. Maintain team moral and good team relationships. Able to ensure IT team is able to work with other members across the organization.\n\nQualifications:\n• Bachelor Degree or Diploma in Computer Science / Information Technology or equivalent.\n• Experience with Cerner lab systems and solutions preferred.\n• Clinical operations experience to support, implement, configure and extend the capabilities of the Lab IT systems preferred.\n• PMP (Project Management Professional) or CITPM (Certified IT Project Management) preferred.\n• Healthcare experience preferred.\n• Minimum 3 to 5 years’ experience in leading medium to large scale application projects.\nSkills & Knowledge:\nGeneral\n• Hands on SLDC management for medium to major projects.\n• Good interpersonal and negotiation skills.\n• Excellent communication and leadership skills with strong initiative.\n• Able to think analytically and solve problems effectively.\n• Excellent command of spoken and written English.\n• Positive work attitude and ability to work under pressure.\n• Ability to learn and pick up new technical skills.\n• Strong problem solving and analytical skills.\n• Work effectively in a team environment.\n• Using initiative and independent judgment within established guidelines and procedures.\n• Organizing work, setting priorities and meeting critical time deadlines and communicating effectively with co-workers and superiors.\n\nClinical / Ancillary\n• Experience in design, development, testing, implementation and support of clinical systems\n• Clinical awareness, and implementing medical devices integration with lab information systems (ideally Cerner, Siemens, Konica Minolta, Roche)\n• Good background in data mapping and clinical data analysis\n• Strong background in developing test scenarios, test case, and leading system testing activities with users.\n• Working with Lab and Rad users to determine business and clinical requirements, and translating them to system and technical requirements for the systems analysts\n• Background in service design, process optimisation and process automation\n• Experience in clinical systems, healthcare standards such as HL7 Messaging, ICD10, DICOM, DRG and Snomed CT, and LOINC.\n• Experience in Cerner lab systems and solutions is an advantage.\n• Good knowledge of clinical and ancillary applications and workflow.\n• Experience in software development and testing experience using Visual Basic, .NET applications using Oracle database, and background in scripting.\n• Experience in working with or collaborating with Singapore government health agencies.\n• Experience in a healthcare environment or healthcare vendor is an advantage", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU3lzdGVtcyBBbmFseXN0IChTRzA4MDgyKSIsImNvbXBhbnlfbmFtZSI6IlBhcmt3YXkgUGFudGFpIExpbWl0ZWQiLCJjb21wYW55X21pZCI6Ii9tLzA3eDkyZCIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6InZmUUp0R2hIN3FkaF9vM0hBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2WUJDcmNCUVU1VlgwNXhVWE53TXpsQ01HVndXSE4yWjFaQ2NEWmphMDl1WkVoVVNFeEhlbmhvZUVFM1puVlNNVGxWTmxKbVEyRnhhbTVoYjBKRWJreDNNSEZ5VWkxcWRqbHBkMmxYZHpCU1FrOW1Zak00V0ZweldubEtNeTEwTkZKeE56VldlV05DU0hsamIxSjRiek16Y1VOblNYZG5XVVppUVVOaFZFZFRVVE16TkVGVVJHTnJTR1U0WW01dlIxcDNSVkp5V2taWVJtVlhUR3hOWVRWMVNGbHdZelZ3ZW5WMFFXbExlVGgwYzBsTlZFbEJkR0U1VHpabkVoWkdialpEV1UwMlpVbHpZbEowUVdGRmFVcEVTVU4zR2lKQlQwMVpVbmRET1VObFUwZEVaamxFZDFBeWRHVkhkMHB5VW5OQmVXSTRRbFpCIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNTMiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9ibHVtIFNpbmdhcG9yZSIsImxpbmsiOiJodHRwczovL3NnLmpvYmx1bS5jb20vam9iL3Nlbmlvci1zeXN0ZW1zLWFuYWx5c3Qtc2cwODA4Mi82MjU4MTE/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Pega System Analyst", "company_name": "IoTalents", "location": "Singapore (+1 other)", "via": "via Jobs007", "description": "Job Description:\n• Design banking applications using Pega platform and delivering high-quality applications.\n• Responsible and perform end-to-end development for Pega based applications.\n• Work closely with key stakeholders to deliver projects and solutions.\n• Provide support to SIT and UAT, investigate and resolve technical issues reported in projects.\n• Conduct system and performance management, application vulnerability management and control, software release management.\n• Plan and commission production system implementation.\n• Develop and review technical documents and other System Development Life Cycle (SDLC) related documents.\n• Provide thought leadership within own area of responsibility.\n• Integrates applications by interface specification and designing database architecture and server scripting.\n\nRequirement:\n• Minimum PCSA (Pega Certified System Architect) in Pega 7.4 and above, preferably Pega CSSA (certified Senior System Architect). A Pega CLSA (Certified Lead System... Architect) will be advantage.\n• Possess working experience in Pega 7 or above with min. 3-4 years working experience in banking applications development\n• Preferably with Information Technology / Engineering /Computer Science related degree.\n• Strong technical knowledge and development experience in object-oriented languages like Java.\n• Strong competency in design OO pattern and enterprise integration patterns\n• Relevant experience in Java, Spring, or J2EE technologies and Angular JS\n• Possess development experience in ASP or Web/REST API, JavaScript, jQuery, and CSS.\n• Strong technical knowledge on database systems such as SQL Server, Oracle, RDBMS design and optimization.\n• Experience with Messaging, Python, NoSQL DB (MongoDB) is a plus.\n• Experience in Software Development Life Cycle (SDLC) and AGILE methodology.\n• Self-motivated and possess drive, and ability to work independently and a good team player.\n• Strong analytical, communications and interpersonal skills as well as able proficient in English language both spoken and written.\n• Passion to learn new technology and deliver high quality deliverables in first go\n• Able to work independently and be self-motivated", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQZWdhIFN5c3RlbSBBbmFseXN0IiwiY29tcGFueV9uYW1lIjoiSW9UYWxlbnRzIiwiY29tcGFueV9taWQiOiIvZy8xMWR4cTE4N3dtIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiVnNpTmo0dzRhQVl1LTgwYUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFVtaFFNelJDU1Vsb1NYb3dSVkZXV0dkUFVYaFFNMDFNUzNZNE1FZEhiMVpSZUhCVWNXSlNOemhvUVZNM2RuZFJaSEpVUXpCUWEySk1jWEpCT0dFd1RFOW5RM1IxUlVWT1lsOXpMVFpHWTFGVmVUbGxYMVU0UkVaTWVuSndhREZEWkhNNFJuSjZjekEwVFhkc1RITkJTM0ZvYkdOdWJGRndNMDR5UjBSNmVXNDFVMk5ETW5SamFWSlpkR2xJVkhSd09XVmZibGMxWVhCWmRVTlJFaFpHYmpaRFdVMDJaVWx6WWxKMFFXRkZhVXBFU1VOM0dpSkJUMDFaVW5kQk5tMDJVbkZWVDB4NGJFWkViM2RwVTNCclYwMWxYME5WZVZWQiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzYxIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnMwMDciLCJsaW5rIjoiaHR0cHM6Ly9qb2JzMDA3LmlvL2pvYnMvaW90YWxlbnRzLXB0ZS1sdGQvcGVnYS1zeXN0ZW0tYW5hbHlzdF81NjA/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Senior Business Systems Analyst", "company_name": "Xilinx Careers", "location": "Singapore", "via": "via Xilinx - Careers", "description": "Description\n\nAt Xilinx, we are leading the industry transformation to build an adaptable, intelligent world. ARE YOU bold, collaborative, and creative? We develop leaders and innovators who want to revolutionize the world of technology. We believe that by embracing diverse ideas, pushing boundaries, and working together as ONEXILINX, anything is possible.\n\nOur culture of innovation began with the invention of the Field Programmable Gate Array (FPGA), and with the 2018 introduction of our Adaptive Compute Acceleration Platform (ACAP), has made a quantum leap in capability, solidifying our role as the adaptable platform supplier of choice. From the beginning, we have always believed in providing inventors with products and platforms that are infinitely adaptable. From self-driving cars, to world-record genome processing, to AI and big data, to the world's first 5G networks, we empower the world's builders and visionaries whose ideas solve every day problems and improve people's... lives.\n\nIf you are PASSIONATE, ADAPTABLE, and INNOVATIVE, Xilinx is the right place for you! At Xilinx, we care deeply about creating significant development experiences while building a strong sense of belonging and connection. We champion an environment of empowered learning, wellness, community engagement, and recognition, so you can focus on work that matters - world class technology that improves the way we live and work. We are ONEXILINX.\n\nFinance BI & Reporting Analyst\n\nJob description\n\nThe Finance BI & Reporting Analyst will provide both functional support (business process and systems analysis, testing, user support and training) and light technical support (report and dashboard development, maintenance of Tableau views and hierarchies) to the Finance organization from Business Intelligence & Data Analytics perspective. As a key member of our Finance Infrastructure Team the Finance BI & Reporting Analyst will be a first point of contact for Finance BI report troubleshooting and development in our new Snowflake DW solution.\n\nPrimary responsibilities\n• The Finance BI & Reporting Analyst will work closely with key stakeholders across Finance and IT to deliver reporting and analytics capabilities that support our efforts to increase process efficiencies.\n• Responsibilities include business analysis, requirements gathering, output and format evaluation, report creation and automation.\n• In addition to helping to build new reports and automating existing manual and/or duplicate reports, the Finance BI & Reporting Analyst will provide ongoing user support to the Finance organization, including reporting tools training and troubleshooting of BI reporting issues.\n• Individuals will also be responsible for analyzing complex data models and building reports to generate business insights and satisfy evolving management requirements.\n\nDesired skills and experience\n• 3-5 years experience applying analytical techniques to solve real business problems\n• Advanced Tableau skills are a must (preferably with Tableau certification) experience working with Snowflake or other cloud-based data sources is very desirable\n• Ability to retrieve, manipulate, and analyze large datasets\n• Strong interpersonal skills; must be able to effectively work with Finance and IT users and be able to drive projects and reporting improvements\n• Excellent presentation, communication and social skills, with solid attention to detail\n• Ability to comprehensively understand data elements, sources and relationships in business and technical terms\n• Bachelor’s degree preferably in a quantitative field (finance/accounting/statistics/engineering", "extensions": ["8 days ago", "Full–time"], "detected_extensions": {"posted_at": "8 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQnVzaW5lc3MgU3lzdGVtcyBBbmFseXN0IiwiY29tcGFueV9uYW1lIjoiWGlsaW54IENhcmVlcnMiLCJjb21wYW55X21pZCI6Ii9tLzAzZHdrYyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImgwV2FTU0lHbUZuRlcwZWlBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhVM2RSWlVreVVtcDRabGhaTFdWRVUyZG5iVVUzYkVWVFNrZ3djVWxTZEc5bVRXTndUekZZTTNrNU5qRkNNM0p3UldsQ1ducEJZVnBVVGtKdll6YzVSSGQzZVdrMlJGWm5VRWhHYUhwaVkzTkpPRmxQUVZsbFVXbGFVakJzY1VOMlpqSklUV1p5Y1RBeVkwRjBSR2xDYW1WV1F6RktSSFU1TFRGMVRHZE1WbkZ0YkZCdmJ6bHBNMnhOTFhSTlRqTkNSVFJ4YzFGdlZYWk1iRVJuRWhaR2JqWkRXVTAyWlVsellsSjBRV0ZGYVVwRVNVTjNHaUpCVDAxWlVuZERaa001YzFSZlVtVkljVTFZWVVNNGEwcDBNMlYyUlhwd1FtVkIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY182OSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBYaWxpbnggLSBDYXJlZXJzIiwibGluayI6Imh0dHBzOi8vY2FyZWVycy54aWxpbnguY29tL2pvYnMvNjQxOTEwMi1zZW5pb3ItYnVzaW5lc3Mtc3lzdGVtcy1hbmFseXN0P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Business Operations", "value": "GC06"}, {"text": "Accounting and Finance", "value": "GC01"}, {"text": "Customer Service", "value": "GC10"}, {"text": "Human Resources", "value": "GC15"}, {"text": "Management", "value": "GC18"}, {"text": "Education", "value": "GC11"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Protective Services", "value": "GC23"}, {"text": "Science and Engineering", "value": "GC27"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "System analyst", "value": "system analyst"}, {"text": "Systems analyst", "value": "systems analyst"}, {"text": "Business analyst", "value": "business analyst"}, {"text": "It analyst", "value": "it analyst"}, {"text": "Analyst", "value": "analyst"}, {"text": "Senior", "value": "senior"}, {"text": "Security analyst", "value": "security analyst"}, {"text": "Application analyst", "value": "application analyst"}, {"text": "Engineer", "value": "engineer"}, {"text": "Project manager", "value": "project manager"}, {"text": "Software engineer", "value": "software engineer"}, {"text": "Hris analyst", "value": "hris analyst"}, {"text": "Lecturer", "value": "lecturer"}, {"text": "Senior analyst", "value": "senior analyst"}, {"text": "Soc analyst", "value": "soc analyst"}, {"text": "Sr analyst", "value": "sr analyst"}, {"text": "Support analyst", "value": "support analyst"}, {"text": "Support manager", "value": "support manager"}, {"text": "System", "value": "system"}, {"text": "Systems administrator", "value": "systems administrator"}, {"text": "Technology analyst", "value": "technology analyst"}, {"text": "Test analyst", "value": "test analyst"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Internship", "value": "INTERN"}, {"text": "Part-time", "value": "PARTTIME"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Mining", "value": "/business/naics2007/21"}, {"text": "Research", "value": "/business/naics2007/5417"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Accommodation", "value": "/business/naics2007/721"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Real Estate", "value": "/business/naics2007/53"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "OCBC", "value": "/m/055r27"}, {"text": "Jobline Resources Pte Ltd", "value": "/g/11gp2647pn"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Workato", "value": "/g/11dxpy_3xd"}, {"text": "Avensys Consulting", "value": "/g/11g7022gjf"}, {"text": "Chevron", "value": "/m/01pvx3"}, {"text": "ELITEZ PTE. LTD.", "value": "/g/11dxptfkcf"}, {"text": "ILLUMINA SINGAPORE PTE. LTD", "value": "/m/09mxkxs"}, {"text": "M1 LIMITED", "value": "/m/05n486"}, {"text": "Mantu", "value": "/m/0b6mxkc"}, {"text": "Public Service Division", "value": "/g/11g6__bv10"}, {"text": "Rakuten Asia", "value": "/g/11g7072z1v"}, {"text": "Techcom Solutions", "value": "/g/11c73vztx3"}, {"text": "United Overseas Bank Limited", "value": "/m/04gjd1"}, {"text": "VISA", "value": "/m/01kqjn"}, {"text": "Venture Corporation Limited", "value": "/g/11bc61gglw"}, {"text": "Xilinx", "value": "/m/03dwkc"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "Activate Interactive Pte Ltd", "value": "/g/11dxq192l5"}, {"text": "Aramco", "value": "/m/01qjg2"}, {"text": "Avnet", "value": "/m/0c8xmc"}, {"text": "BGC Group", "value": "/g/11g0j3fjv8"}, {"text": "Bgc Group Pte. Ltd.", "value": "/g/11g9mphr4f"}, {"text": "CONNECT ENERGY SERVICES PTE. LTD.", "value": "/g/11dxptylw6"}, {"text": "Cochlear Ltd", "value": "/m/0kqqgc"}, {"text": "Crédit Agricole Corporate and Investment Bank", "value": "/m/04n1_w"}, {"text": "Ecquaria Technologies Pte Ltd", "value": "/g/11dxq26pxz"}, {"text": "Edwards Lifesciences", "value": "/m/03p20ps"}, {"text": "Equinix", "value": "/m/07btnq"}, {"text": "Experis Singapore", "value": "/g/11dxpnwm3s"}, {"text": "Flintex Consulting Pte Ltd", "value": "/g/11h1z41pzb"}, {"text": "ITCAN Pte Limited", "value": "/g/11dxpstz9t"}, {"text": "Institute of Technical Education", "value": "/m/05_02p"}, {"text": "IoTalents", "value": "/g/11dxq187wm"}]}]}