{"search_metadata": {"id": "60827ec0eb690fd07d1d47a3", "status": "Success", "json_endpoint": "https://serpapi.com/searches/f790901817ba5ff2/60827ec0eb690fd07d1d47a3.json", "created_at": "2021-04-23 08:01:04 UTC", "processed_at": "2021-04-23 08:01:04 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28programmer%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=220", "raw_html_file": "https://serpapi.com/searches/f790901817ba5ff2/60827ec0eb690fd07d1d47a3.html", "total_time_taken": 1.01}, "search_parameters": {"q": "(programmer) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "220"}, "jobs_results": [{"title": "Manager, Database Service", "company_name": "Nanyang Technological University", "location": "Singapore (+1 other)", "via": "via Monster", "description": "Job Description :\n\nThe Manager will support and administer daily operation of Data Services\nin NTU. Maintain quality service, uptime, and round-the-clock\navailability of DB services to various Universitys business systems.\nResponsibilities:\nDatabase Administration\n• Act as the Subject Matter Expert for database related services\n• Manage daily BAU operation of database related services\n• Perform service monitoring, end-to-end performance correlation, and\ndatabase performance fine tuning\n• Create, review and update system documentation and work instructions\nto enhance efficiency of daily operations\n• Perform capacity planning to database resources to meet the demands\nof application workload\n• Plan, execute and monitor backup schedules according to business\nrequirement and data retention policy\n• Review database security, perform database hardening, apply regular\nor ad-hoc security patches to ensure compliance with IT security\npolicy\n• Coordinate/Support with application support team to... schedule database\nupdates and perform database upgrade with minimal business impact\n• Provide Level 2 support for database service related queries\n• Perform incident escalation in accordance to escalation procedures\n• Coordinate with other functional teams in incident handling, and\nensure incidents are resolved or work- around within stipulated SLAs\n• Provide input and finding for root-cause analysis\n\nDB Service Provisioning\n• Perform requirement gathering with application support team\n• Recommend appropriate database platform and system capacity\n• Provision database platform according to agreed system requirements\n• Derive and recommend system and software configuration policies to\noptimize security, performance and availability\n• Setup databases components according to system configuration\npolicies and guidelines\n• Coordinate with other functional teams to perform the necessary work\nto get a database operational e.g. IP address assignment, DNS\nrequest, firewall port opening and security scans\n• Derive, implement, perform regular review and improve SOPs and work\ninstructions to enhance the efficiency of the provisioning processes\n\nImplementation of IT Initiatives and Solutions\n• Provision of consultancy on databases design for new systems.\n• Lead and drive new database services initiatives and manage project\ndeliverables.\n• Identify and drive the optimal solution for NTU and manage the\nimplementation of these solutions\n\nRequirements:\n• A recognized diploma or degree in IT or related fields\n• Minimal 5 years hands-on experience in systems and database\nadministration in an enterprise or campus environment\n• Excellent skills and experience in administering MySQL, Oracle\ndatabase (10g and above), Oracle high availability technologies such\nas RAC and Data Guard, database performance tuning and\ntroubleshooting, and database upgrades and migrations tools.\n• Some experience in MariaDB, MySQL, and PostgreSQL\n• Experience in Windows, Linux variants, preferably Red Hat and Ubuntu\n• Possess relevant DevOps skillset and scripting skill for system\nautomation, e.g. bash, ksh\n• Experience in system and application performance tuning\n• Experience in capacity planning, availability management and business\ncontinuity management\n• Good project management & outsourcing vendor management skills\n• Certified in Oracle Database Administrator Certified Professional,\nOracle Certified Professional, MySQL, Red Hat Certified System or\nITIL Foundation Level will be an added advantageous\n\nHiring Institution: NTU", "extensions": ["25 days ago", "Full–time"], "detected_extensions": {"posted_at": "25 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJNYW5hZ2VyLCBEYXRhYmFzZSBTZXJ2aWNlIiwiY29tcGFueV9uYW1lIjoiTmFueWFuZyBUZWNobm9sb2dpY2FsIFVuaXZlcnNpdHkiLCJjb21wYW55X21pZCI6Ii9tLzBsNDlrIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiLTlpQXh6Q1ZsaERFU3h1SUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXA4Q0N1SUJRVTVWWDA1eFVYQk1SbXBYVUhkSWNXOHlaVXBYV2tSRFNWbHFSMDlCYW1KeGJYbEpMVWh4TUdZNGMwZFhNMWxsT0VwVFQzWndTemRwTFZabGNHUlliMlJaTTFsMGVHZGpOSGRFV25oQ2RUTmFSR2xrTmpoRlNXUTJVMUkzTVVWcmVFaDRNV2h6WDBkVVJsUkhUSEIxWWkxWGNFOTVXbkpKUzJ0SlpsUjVNWE5TVkVoWGRXSmZXbTVvZUd4SlZFZG1jR0kwZURWU1MyNU5ORmRRTTJGZldqSndXbUZrYmpZME5VTk5ZMEZmVW1OeGRtaGFSemhUTmtsNll6bDVSVzlTTUU0MGNEa3RVMUZCUzNWNGJsQnJRV3hEUkZSSWEyZG9hM2xMYXpCVVRHYzRaeElVZDBnMlExbE9jVzFJU1V4WGRFRmhXbmhpWkc4YUlrRlBUVmxTZDBGUFMyNW9jMnBGYkZSSGVtcE9ObE5xYTJkUVVrYzRVVVI2VFhjIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNb25zdGVyIiwibGluayI6Imh0dHBzOi8vd3d3Lm1vbnN0ZXIuY29tLnNnL2FtcC9qb2ItdmFjYW5jeS1tYW5hZ2VyLWRhdGFiYXNlLXNlcnZpY2UtbmFueWFuZy10ZWNobm9sb2dpY2FsLXVuaXZlcnNpdHktc2luZ2Fwb3JlLTI2NzI3NjA5Lmh0bWw/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "SoC Software Engineer (Malaysia)", "company_name": "Realtek Malaysia", "location": "Singapore", "via": "via LinkedIn", "description": "SoC Software Engineer - KL , Malaysia\n\ns\n\n1、Develop APK to meet customer's requirement\n\n2、Handle Live TV and country logo related issues for different countries\n\n3、Handle HDMI CEC, ARC, and compliance test related issues\n\n4、Handle media player related issues\n\n5、Debug Google certification related issues(CTS, GTS, VTS…)\n\n6、Debug OTT certification related issues(Netflix, Youtube, Amazon)\n\n7、Develop TV middleware\n\n8、Support customer factory request and manufacture related issues\n\nJob Requirements\n\n1、Familiar with C/C++, Java programming language\n\n2、Experience on TV, Set-top box, Smart phone, multimedia player products.\n\n3、Better having experience with: Linux kernel driver porting or development、Android APK development、TV related experience(ATSC 1.0/ATSC 3.0/DVB/ISDB)、Android framework (TIF/HAL/HIDL)、Media playback、HDMI CEC/ARC、Android certification debug experience(CTS/GTS/VTS)、OTT certification experience(Netflix/Youtube/Amazon)、Wifi(WOWL)、Middleware... (Ginga/FreeviewHD/HbbTV/CI+/SI)、ATV(NTSC, PAL, SECAM)、Subtitle(CC, TT)、System debug skill(Memory leak, Memory trash, Performance analysis).\n\n4、Work Location: KL Area, Malaysia.\n\nRealtek Malaysia officially opened in June 2020, located in the KL City area, and is a wholly owned subsidiary of Realtek Semiconductor Corp. from Hsinchu, Taiwan. Realtek founded in 1987, and has a track record of delivering uninterrupted profitable growth every year since its inception. We aims to attract top R&D talents in Malaysia and the greater Southeast Asia. We efforts to provide the ultimate in pioneering Multimedia IC technology", "extensions": ["11 days ago", "Full–time"], "detected_extensions": {"posted_at": "11 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb0MgU29mdHdhcmUgRW5naW5lZXIgKE1hbGF5c2lhKSIsImNvbXBhbnlfbmFtZSI6IlJlYWx0ZWsgTWFsYXlzaWEiLCJjb21wYW55X21pZCI6Ii9tLzA1d3JtNyIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Ik1CbGJZTU5WR2hreVh0b25BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2UUJDcmNCUVU1VlgwNXhVV3QxY0hRMllqbGFTbk5LZDBWNlZTMXNWbkZTZGxFMk1VcHBhamRyTW1wNlMxWmhSMmhwVkZaU2NuSjFSREpUYldaT1pHYzBZVGd5VG0xVFdHdHdlV0ZxVXpOUmJrWk9UVUZWWm5WSVZuY3dPVWN6VjBGdVZ5MUhNMmRITFV0RFptRnFVVEpSUTFRelRuUTBaM1YzWWpoaVRFSmhjRjlRZEhOaVFtbFVhR2hpVkROR2JXRmtlREU1T1hOWGJVMXFjRTFZV1ZSTmJsRlJhMmxtUzFvdGN6WjZZM2hYYUZSV2JHZ3dNV1JwV0hkSkVoUjNTRFpEV1U1eGJVaEpURmQwUVdGYWVHSmtieG9pUVU5TldWSjNRMlJYTWsxSmNpMWxlRGxrYkMxVk5IVkhaREJJTWt4MkxWTXpadyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzE1IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExpbmtlZEluIiwibGluayI6Imh0dHBzOi8vc2cubGlua2VkaW4uY29tL2pvYnMvdmlldy9zb2Mtc29mdHdhcmUtZW5naW5lZXItbWFsYXlzaWEtYXQtcmVhbHRlay1tYWxheXNpYS0yNTEzOTgzODgxP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Software Development Lead", "company_name": "Lendlease Digital Asia Pte. Ltd", "location": "Singapore", "via": "via WhatJobs", "description": "Show recruiters you're immediatley available for job opportunities\n\nPosted On: 3 days ago Total Views: 6 Total Applications : 1 Job Id: 27690137\n\nPermanent Job\n\nJob Description\n\nLendlease is searching for a Software Development Lead to join our new digital business, based in Singapore.\n\nAbout us\n\nLendlease is a global leader within construction and infrastructure, headquartered in Australia, with offices in Asia, the Americas and Europe. Lendlease is responsible for various renowned developments around the globe, including Paya Lebar Quarter and 313 Somerset in Singapore and a $21 billion district development for Google in the San Francisco Bay area.\n\nHarnessing over 60 years of Lendlease’s applied experience in property development, construction and investment, our new Lendlease Digital business group is building a global digital software technology platform, Podium, that will transform and disrupt the property and construction industry. We develop products that solve real problems... and deliver solutions that are feasible, viable and desirable to our customers. Our core philosophy is digital before physical, share data, not files, fully simulated and tested before manufacture and assembly (not construct). As a team, we are innovative, brave, and continually learning and trying new ways of doing things.\n\nAbout the role\n\nReporting directly into the Head of Product Development Centre in Singapore, you will be responsible for managing our software and product development program of works, as we grow our digital business, transforming how and what we build towards autonomous buildings of the future.\n\nAs part of our Global Product Development organization, your program will work in tandem with our PDC teams in San Francisco and Sydney, creating a scalable supply chain and logistics software platform that will support the supply of building materials to construction sites in Singapore, and other regions around the globe, including SE Asia and North America.\n\nYour role will involve the management of cross-functional software development team, driving the creation of the software platform, you have the capability to marry Front and Back End systems to ensure debugging process are fulfilled and work seamlessly with codes that are efficient and effective in translating business needs to technical requirements\n\nAbout you\n\nAn experienced Software Development Lead with a strong technical background in software development/engineering/architecture Experience driving programs of work within enterprise level organisations and technology start-ups. Experience in component/ cloud/ web development environments (GCP/AWS/Azure) Knowledge and experience in supply chain systems engineering and logistics software or ecommerce(preferred) Strong coding language expertise in a variety of languages (JAVA, C++, Python) Program management experience in a cloud and web-based delivery environment – SaaS/PaaS and Applications with proven software product release track record Flexibility to adjust dynamically to new demands & priorities with a highly collaborative style, coupled with strong influencing and negotiating skills Bachelor’s or Masters of Engineering or Computer Science degree and either PMP or Certified Scrum Master (CSM) qualification\n\nWhy choose us?\n\nAn opportunity to drive an innovative program of work in a dynamic global environment with a start-up mentality, that values passion for excellence and courage to test the boundaries, viewing setbacks as learning opportunities Career and growth opportunities with our outstanding variety of projects, international presence and investment in talent and leadership Diverse and inclusive workplace, offering flexibility and allowing you to bring your whole self to work Market-leading leave benefits program, including annual leave, wellbeing leave and parental leave. Health and wellbeing programs to support the physical and mental wellbeing of you and your family Comprehensive healthcare coverage, including unlimited outpatient consultation, a flexible healthcare budget and onsite health screening and assessments\n\nWe're a Singapore based software consulting firm trying to find exceptionally smart people with strong development skills and an avid interest in web/mobile development. You should be able to learn qu\n\nI. Main activities / tasks: * Design, Develop, Test and Integrate Web apps. * Develop and Integrate front-end UI to match project/client specifications * Hooking up projects into CI/CD pip\n\nJob Description: * Participate in all aspects from pre-development to execution and delivery of the Internet-Of-Things (IoT) functions. * Design, develop and deploy business software application\n\nResponsibilities * Co-ordinate with the product development team to translate requirements and designs into web applications or services using Node.js, Express, React, Mongo and other tools/framewo\n\nKey Responsibilities: * Development of High Performance Java Service API and Business Systems * Using SpringBoot to build microsservices in Java * Writing deployment pipelines to deploy Java\n\nTraining and Development Lead A newly created role for this European headquartered Financial Services organisation Your new company Our client is a large, established Financial Services institution\n\nKey Responsibilities * Work closely with the clients to understand the requirements and create unique offerings * Lead a team of onsite / offsite developers focusing on the various workstreams\n\nResponsibilities 1) Software Development a) Be a Scrum development team member * Ability to collaborate with team effectively * Able to support storyboarding effort of the team * Capability\n\nJOB DESCRIPTION Department: Business Engineering Report to: Section Manager Functional Relationships with Sales, Production, and Logistics POSITION PROFILE Based in: Singapore The successful ca\n\nSoftware Development Manager · Provide Leadership and management skill practice - Product Development efforts including design, architecture testing and support along with infrastructure management.\n\nGive your career a boost with Monster's resume services.\n\nSimple body text this will replace with orginal content\n\nToll Free No: +8001-012-339\n91-40 66116994", "extensions": ["4 days ago", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBEZXZlbG9wbWVudCBMZWFkIiwiY29tcGFueV9uYW1lIjoiTGVuZGxlYXNlIERpZ2l0YWwgQXNpYSBQdGUuIEx0ZCIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiS0JwSjNhSUdhbFdNY2NYSUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBXaGF0Sm9icyIsImxpbmsiOiJodHRwczovL2VuLXNnLndoYXRqb2JzLmNvbS9qb2ItZm9yLVNvZnR3YXJlLURldmVsb3BtZW50LUxlYWQtaW4tU2luZ2Fwb3JlLWNvb3AxNzUwODM1MT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Apps Dev Sr. Programmer Analyst - AVP", "company_name": "Citi bank", "location": "Singapore", "via": "via Bayt.com", "description": "This position is responsible for project management and business analysis for Client Reporting applications, Advice Generation System and O&T programs for Citi Private Bank Asia. The incumbent is required to engage and work with various global and regional businesses, operations and internal/external technology partners to deliver against objectives. The Project Manager responsibility to understand the business process, definition and Systems requirements. Also responsible for staying informed of the latest operational issues/ decisions and the team’s goals and direction.\n\nResponsibilities:\n• Responsible for end-to-end execution and program delivery of for Advice Generation System and Client Reporting applications projects for Citi Private Bank Asia\n• Be responsible for program / project from start to end, involving requirements definition, functional specification verification, user acceptance testing and business change management / integration\n• Collaborate with regional and global... technology partners and other stakeholders from operations, Product, Compliance and Legal to ensure quality delivery of software solution from project conception through implementation.\n• Responsible for identifying/managing project issues/risks and escalations. Deliver effective communication and report on initiatives to various levels including executive management and senior leadership\n• Release coordination with Development teams, Test Center of Excellence (TCOE) and Operations teams.\n• Lead Asia business interests in global or cross-business programs / projects, and contribute to effort to build common practices, processes and platforms across regions.\n• Responsible for reviewing the end-to-end process flows, identify opportunities for automation, translate into business requirements and follow through till implementation\n• Liaise with project sponsors and regional business leads on an ongoing basis to understand their needs and priorities as well as to pro-actively manage expectations, buy-in, feedback and resolution of issues.\n• Assist in performing testing through different phases of project implementations and provide SME support\n• Develop change management and communications plan to actively engage key stakeholders, as well as to provide training and post-implementation support to business users.\n• Conduct project post-mortems to identify successful project elements as best practices for subsequent projects\n\nQualifications:\n\nRequired\n• 5 – 8 years of relevant working experience in Business Analysis and Project management in a large, multi-national organization or an entity with similar global reach and complexity\n• Experience in writing SQL queries in Oracle to perform data analysis to finalize business requirements and analyze complex problems\n• Experience in writing of business requirements, functional designs and complex project plans\n• Experience in managing and implementing successful projects\n• Demonstrate ability to analyze complex problems, propose workable solutions and implement corrective actions in all situations with creativity.\n• Strong oral and written communication skills including presentation development and delivery\n• Strong interpersonal skills – demonstrate ability and proven track record in building partnerships and collaborative relationships at various levels within the organization, people and relationship management\n• Good Knowledge of banking / financials products\n\nPreferred\n• Industry-specific experience in Private Banking/Wealth Management\n• Knowledge in Client Reporting applications and handling of legal statements and advices will be advantageous\n• Performance and risk calculation methodologies (IRR, TWR, Sharpe Ratio, etc.)\n\nEducation:\n• Bachelor’s degree/University degree or equivalent experience\n\nThis job description provides a high-level review of the types of work performed. Other job-related duties may be assigned as required.\n\n-------------------------------------------------\n\nJob Family Group:\n\nTechnology\n\n-------------------------------------------------\n\nJob Family:\n\nApplications Development\n\n------------------------------------------------------\n\nTime Type:\n\n------------------------------------------------------\n\nCiti is an equal opportunity and affirmative action employer.\n\nQualified applicants will receive consideration without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.\n\nCitigroup Inc. and its subsidiaries (\"Citi”) invite all qualified interested applicants to apply for career opportunities. If you are a person with a disability and need a reasonable accommodation to use our search tools and/or apply for a career opportunity review Accessibility at Citi.\n\nView the \"EEO is the Law\" poster. View the EEO is the Law Supplement.\n\nView the EEO Policy Statement.\n\nView the Pay Transparency Posting", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBcHBzIERldiBTci4gUHJvZ3JhbW1lciBBbmFseXN0IC0gQVZQIiwiY29tcGFueV9uYW1lIjoiQ2l0aSBiYW5rIiwiY29tcGFueV9taWQiOiIvbS8wMWRmYjYiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJXUXBOR0dxZ3BSVzRmTWtiQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdDhCQ3FJQlFVNVZYMDV4VkZKYWRuaEdUVm90UVRacFREWktWMDl2YVVwbGQzRTJkMk0zY1VweFlXOVhjbWMxZGs1NFRubGlhWHBZWWsxa1MxUk1VemhYYzFsaFowTnFWRTVyUW13eVN6SmZNVU5MTmxoRlJEbG9hemx2YWpkMGRqbEpNM0pYV2tRMVdEVXRSQzFGWlZoM2FUWnZObFZvYldsdVpscFVWMXBYU0ZwMFoySnJMVUZxY1hsVVZETXdXREp2Y21aSFRVOTZOMGx1YUhWVmMwcDRNQzExY2s1QkVoUjNTRFpEV1U1eGJVaEpURmQwUVdGYWVHSmtieG9pUVU5TldWSjNSRVl5WTB0U01VZEZPRUpTV0RoTGFtcDBVM2RaWTJsT05YcHlVUSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzI3IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJheXQuY29tIiwibGluayI6Imh0dHBzOi8vd3d3LmJheXQuY29tL2VuL3NpbmdhcG9yZS9qb2JzL2FwcHMtZGV2LXNyLXByb2dyYW1tZXItYW5hbHlzdC1hdnAtNTg4NTU5NjYvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Software Engineer", "company_name": "Techcom Solutions Pte Ltd", "location": "Singapore", "via": "via Monster", "description": "• Supporting application changes that might impact existing functionalities and processes or involve new features altogether\n• Maintenance and upgrading of product tech stack\n• Provide solutions or workarounds with regards to existing functionalities\n• Answer functional queries: - E.g. how to use functionalities\n• Testing and release management\n• Participate in users training\n• Provide Audit and security review support\nRequirements:\n• Well-versed in agile ways of working and familiar with common tools including JIRA and Confluence;\n• With 5 – 7 years of experience working with various language stacks, focusing on Node.js, Python, React and React Native;\n• Familiarity with cloud-based technologies and architectures (AWS, Azure or GCP). AWS know-how is preferred;\n• Broad-based knowledge on custom (primarily web) application development\n• Demonstrable expertise with web and mobile application and related architectures and concepts (e.g. security, microservices, etc.);\n• Experience with... CI/CD practices and systems (e.g. git, git flow, trunk-based development). GoCD experience will be advantageous;\n• Understanding of containers and associated tools in the orchestration and monitoring space including but not limited to Kubernetes, Terraform, Prometheus, Kibana and Grafana", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciIsImNvbXBhbnlfbmFtZSI6IlRlY2hjb20gU29sdXRpb25zIFB0ZSBMdGQiLCJjb21wYW55X21pZCI6Ii9nLzExYzczdnp0eDMiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJ4bGtBenAtRFNCUEx3V3V5QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFb2tDQ3N3QlFVNVZYMDV4VWxsWmMxVkRRMDVsWkZSSlVYcElaV0pVVURGNGIwRm1jR3RTY2xkb0xUWkZXRUV6ZDI5dVFVbFlOMVJOTVRsSWMzVjRkVmhmT0hOc1ptNXBaWHBaVDNKd09XUkxiME5hT1dkcGVqbHpNRzVHWlROR1VrTTJTVWRCVFRSVVkwRjVVSE5NZEZCTU4wcE9TMHA2ZGxKRFYyeEVObmM0T0VGd1kyTTJTMjUzUmtacFMyWk5RVW8xWjNGRlpWSkNNR0pwUzI5VlpGQndRbVpNUTNaek1FaDRlbEJEWkVKUlpIcG9TeTFhVjJwa1VYWjVWSGRzYjB4NGIyeDFPVTlhTUd0aFIycDVVbmxmRWhSM1NEWkRXVTV4YlVoSlRGZDBRV0ZhZUdKa2J4b2lRVTlOV1ZKM1JIbFdha3huUmpSSVdXUkhNMnRKVWpGSFpUQnliblJhWWtab2R3IiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMzQiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTW9uc3RlciIsImxpbmsiOiJodHRwczovL3d3dy5tb25zdGVyLmNvbS5zZy9qb2Ivc29mdHdhcmUtZW5naW5lZXItdGVjaGNvbS1zb2x1dGlvbnMtcHRlLWx0ZC1zaW5nYXBvcmUtMjIwMTg2Nz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior Software Engineer (JavaScript)", "company_name": "EPAM Systems", "location": "Singapore (+1 other)", "via": "via Bayt.com", "description": "EPAM is committed to providing our global team of more than 41,150 EPAMers with inspiring careers from day one. EPAMers think creatively and lead with passion and honesty. Our people are the source of our success. We value collaboration, work in partnership with our customers, and strive for the highest standards of excellence. In today’s market conditions, we’re supporting operations for hundreds of clients around the world remotely. No matter where you are located, you’ll join a dedicated, diverse community that will help you discover your fullest potential.\n\nDESCRIPTION\nWe are looking for an experienced Senior Software Engineer with strong experience in JavaScript and some experience in Java.\n\nYour team:\n• You’ll be working with Derivs & Solutions in Singapore as a DeskDev working closely with the wider DeskDev team in IT, Development & QA teams both locally and globally\n• In addition you will be working closely with global business stakeholders to elicit and review... requirements\nWhat You’ll Do\n• The role involves working together with front office trader and sales, utilizing a variety of technologies to provide fast time-to-market and applications, covering all aspects of equity derivatives: pricing and quoting, data analytics, market data, risk management, trade capture, etc\n• The role will be responsible for developing high quality trading and sales tools for the desk with a side focus of integrating proven solutions\n• The candidate will be participating in the design and development of cutting edge infrastructure, systems, and applications(both client and server side) used by Front Office to provide streamlined and revenue-generating services to our clients, examples of which include:\n• Building and expanding a leading Electronic RFQ platform for the client’s Flow Structured Business globally\n• Designing and building a micro-service based Pre-Trade platform for global Equity Derivatives business\n• Enhancing Excel-based pricing / param / risk management tools onto service-based Web apps\n• The candidate will be expected to closely liaise with trading, sales, quants, structuring and the tech groups in the equity derivatives business. The products spread across exchange listed, OTC and exotics\n• The candidate will be able to rapidly learn in-depth knowledge and gain experience of Equity Derivatives trading / risk management from both technology and business perspective\nRequirements\n• This position is open to professionals with >7 years of experience\n• Minimum Bachelor degree from a recognized University. Computer Science / Engineering / Mathematics majors preferred\n• Self-motivated with independent thinking, and a quick learner that can thrive in a fast-paced environment\n• Strong communication skills in both written and verbal English. Experience in working across business and IT at all levels will be a plus\n• An excellent team player with a good balance of strategic view & rapid application development\n• Strong interest in applying academic knowledge/technical skills to solving practical problems in the Investment Banking industry\n• Technical Capabilities:\n• Strong scripting language (Python / Javascript / ReactJS + TypeScript) and one core language (Java / C#)\n• Solid background in data structure and algorithms\n• Knowledge of Web development will be a plus\n• Knowledge of Equity Derivatives will be a plus\n• Knowledge of Kafka, Kubernetes, Docker, SQL, KDB, Excel/VBA and Unix programming will be a plus\n• Good understanding of testing and familiarity with different testing approaches. Familiarity of TDD / BDD will be a plus\n\nWe offer\n• Friendly team and enjoyable working environment\n• Work-life balance and flexible schedule\n• Online training library, mentoring, career development and potential partial grant of certification\n• Unlimited access to LinkedIn learning solutions\n• Referral bonuses\n• Compensation for sick leave and paid time off\n• Opportunities for self-realization", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgRW5naW5lZXIgKEphdmFTY3JpcHQpIiwiY29tcGFueV9uYW1lIjoiRVBBTSBTeXN0ZW1zIiwiY29tcGFueV9taWQiOiIvbS8wZGxucmMiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiItQjVaY2hqT0pYTzc1UE5zQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdDhCQ3FJQlFVNVZYMDV4VVZaVGNrNVhNR2xuVFRGV1kyRkNlSHAwV1dKM2VIbFZhak5RTW1acU0xbzNXVmxoVVhNMmVsODJNRXhWVUdVd1ptVXplbXBNVWtzNE4wWm9aVUpxTkhKSE5VSmpPVWRIZVZwaGRVVnFNRk40U2xaUWNYUmlXVTV0YTJaUlgyazNMVlUxVmxoWFYyTjJORkpUYkZGVkxXTlpWMGxZWlhoSk5XVXdiRGhpVDFkVVNYUnBURWxaWm1aUVpDMDRlRE5RWlVGbmMwRlBiRGN0T1RkUkVoUjNTRFpEV1U1eGJVaEpURmQwUVdGYWVHSmtieG9pUVU5TldWSjNRMkptVlhjMGQzbDRaWE5OVUhkSGMyTk5lRXgzYjA1MVMwbE9kdyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzQxIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJheXQuY29tIiwibGluayI6Imh0dHBzOi8vd3d3LmJheXQuY29tL2VuL3NpbmdhcG9yZS9qb2JzL3Nlbmlvci1zb2Z0d2FyZS1lbmdpbmVlci1qYXZhc2NyaXB0LTU5MTcwMzk3Lz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior Lead Engine Programmer", "company_name": "Ubisoft", "location": "Singapore", "via": "via Bayt.com", "description": "Company Description\n\nCREATOR OF WORLDS\n\nUbisoft’s 19,000 team members, working across more than 40 locations around the world, are bound by a common mission to enrich players’ lives with original and memorable gaming experiences. Their dedication and talent has brought to life many acclaimed franchises such as Assassin’s Creed, Far Cry, Watch Dogs, Just Dance, Rainbow Six, and many more to come. Ubisoft is an equal opportunity employer that believes diverse backgrounds and perspectives are key to creating worlds where both players and teams can thrive and express themselves. If you are excited about solving game-changing challenges, cutting edge technologies and pushing the boundaries of entertainment, we invite you to join our journey and help us Create the unknown.\n\nOpening its doors in July 2008, Ubisoft Singapore features the largest AAA studio in Southeast Asia and is home to a culture that celebrates serious fun and diversity. As proud innovators of naval gameplay and water... technology, we’re super excited to be the lead studio in bringing a brand-new IP to you – Skull and Bones! Our other notable works include every Assassin’s Creed game since Assassin’s Creed II, with our latest Viking adventure being Assassin’s Creed Valhalla.\n\nJob Description\n\nYOUR DAILY ADVENTURE\n\nAs a Senior Lead Engine Programmer, your role is to own the game engine for the project and to support the team to ensure the success of the game, managing:\n• Quality and stability of the visual and game experience\n• Own the overall design and architecture for the Singapore scope.\n• Realization of the game/artistic vision within the constraints of the tech and platforms by working with the Art Director and Lead Designer / Creative Director.\n• Push high production values and realization for the missions developed by Singapore.\n• Engine tasks scope & timeline management\n\nWHAT YOU WILL DO\n\nThe role has a major emphasis on visual quality, stability, implementation & communication.\n\nFor code changes or new features, responsible for:\n• Gathering & “negotiating” clear requirements and specifications for features\n• Writing technical brief and confluence documentation for the architecture of the systems you own, and the usage instructions for the artists and designers.\n• Providing best estimate of feature delivery\n• Contributing to the art budgets/guidelines for each target platform/feature.\n• Accountable for:\n• Features complying to agreed design\n• Stability and performance (frame rate, multi-platform support, memory, CPU) of the features\n• Support and evolution (troubleshooting, tools, workflow, data reviews, etc.)\n• o Code quality: practice code/design reviews and share best practice\n• o Delivering the features on time\n\nQualifications\n\nWHAT YOU BRING\n• Exensive years of Game Engine programming or specialised in Real-Time Simulation Interactive\n• Experience in managing a small team\n• Excellent verbal and written communication skills.\n• Ability to work in a dynamic and collaborative team environment.\n• Constantly innovate how to improve product quality and group productivity.\n• Excellent decision making capabilities.\n• Ability to quickly learn and apply new concepts, principles and solutions.\n• Demonstrates dependability and commitment to projects/tasks.\n\nAdditional Information\n\nJOIN THE SQUAD\n\nMaking games is serious business, but it's very important for us to have fun while creating awesome worlds so that we can convey the same sense of joy to millions of players in the world.\n\nCome on board and experience #LifeAtUbi for yourself, we are always on the lookout for talents who thrive in bringing their A-game to work. If this sounds like you, shoot us\n\nWe are an equal-opportunity employer and value diversity at our company. We do not discriminate on the basis of race, ethnicity, religion, gender, sexual orientation, age or disability status", "extensions": ["9 days ago", "Full–time"], "detected_extensions": {"posted_at": "9 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgTGVhZCBFbmdpbmUgUHJvZ3JhbW1lciIsImNvbXBhbnlfbmFtZSI6IlViaXNvZnQiLCJjb21wYW55X21pZCI6Ii9tLzAycWR5aiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImxxNmVGRjZ4bVZ2SHBfeXVBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVza0JDb3dCUVU1VlgwNXhWR2xzUlVVMGFEWm1iWHB0WkZCdE16aGpORmhMVEhKbExYcExjRmhJZHpCV1ptZDRMVGg2Wm0xdFJubG1VVUpWVjJkVmF6UjJibVJGV0Uwd2NtZHphMnRzZEdGaFdGTnhOa2RSWVVOWE1IVXRhbUZRY1U1a2ExWjZhbGc0VlhCcWJtbElPSHBOUWpWdlJuWkdhak13WldwRVdrdDJPRzkzWXpSYU1VMVhZWFZHWkdGVGFXOFNGSGRJTmtOWlRuRnRTRWxNVjNSQllWcDRZbVJ2R2lKQlQwMVpVbmRETW05S1lVdHdWRE5GTVdsbGMxUkxha0ZDWjNreVFYRTJNMEZCIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNDkiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQmF5dC5jb20iLCJsaW5rIjoiaHR0cHM6Ly93d3cuYmF5dC5jb20vZW4vc2luZ2Fwb3JlL2pvYnMvc2VuaW9yLWxlYWQtZW5naW5lLXByb2dyYW1tZXItNTk0NzI4MTYvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Software Engineer - Associate Consultant - Senior Software Engineer - Consultant - Lead Engineer - Android", "company_name": "Hcl Singapore Pte. Ltd.", "location": "Singapore (+1 other)", "via": "via Monster", "description": "We are looking for an Android developer, responsible for development and maintenance of applications aimed at a range of android devices including mobile phones, tablet and computers. Your primary focus will be development of Android applications and their integration with back-end services. You will be working alongside other engineers and developers working on different layers of the infrastructure. Therefore, a commitment to collaborative problem solving, sophisticated design, and the creation of quality products is essential.\n\nYears of experience 3 to 4 year\n\nDomain Banking and Finance domain experience\n\nTools\n\nWorking knowledge on AXIOM, Control-M, Geneos, Axway Integration Broker(XIB), Message Builder, Boomi\n\nTechnical Skills Non-Technical / Soft Skills\n\nHands on expirence on Kotlin and Native android application development . Good communication and interpersonal skills\n\nExperience working with remote data via REST and JSON\n\nAbility to support user queries with the right spirit... and optimal resolution time\n\nExperience with offline storage, threading, and performance tuning Ability to work with the team in need and contribute individually wherever required\n\nFamiliarity with RESTful APIs to connect android applications to back-end services Should be self sufficient to manage the customer expectations\n\nKnowledge of other web technologies and UI/UX standards\n\nShould have good attitude to work in teams when required\n\nUnderstanding of Apple’s design principles and interface guidelines\n\nGood learning ability to understand the existing application and propose new ideas\n\nKnowledge of low-level C-based libraries is preferred\n\nExperience decomposing complex problems into component parts for effective problem solving\n\nExperience with performance and memory tuning with tools {{such as Instruments and Shark, depending on project needs}}\n\nProven ability to work with people from different cultures\n\nFamiliarity with cloud message APIs and push notifications\n\nAbility to operate not on basis of past experiences, but in the light of the approaches and developments that occur in the market.\n\nKnack for benchmarking and optimization\n\nExperience working with external Vendors & outsourced projects\n\nProficient understanding of code versioning tools {{such as Git, Mercurial or SVN}}\n\nFamiliarity with continuous integration\n\nShould be excellent in Web Services call like JSON & RESTFUL client", "extensions": ["1 month ago", "Full–time"], "detected_extensions": {"posted_at": "1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciAtIEFzc29jaWF0ZSBDb25zdWx0YW50IC0gU2VuaW9yIFNvZnR3YXJlIEVuZ2luZWVyIC0gQ29uc3VsdGFudCAtIExlYWQgRW5naW5lZXIgLSBBbmRyb2lkIiwiY29tcGFueV9uYW1lIjoiSGNsIFNpbmdhcG9yZSBQdGUuIEx0ZC4iLCJjb21wYW55X21pZCI6Ii9nLzExZnkyNW5nc3YiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJXdkdSY3RFN3d4OUNjd3pRQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFb2tDQ3N3QlFVNVZYMDV4VVUxV1ltczVlbXRXVmt4dlJXZG1MVmhNTm5ScmFFVTBOMHBmTWpGSVFUTnpkRUZPY0dGbGNsZDVRbmx2ZVRCNloxOXlTbWRuVFhCdGRFNW1Uelp4UWpOSFRWbGtjbm94U1hoRU9GZGtMVmxIY0ZCUmREZzBWMVJ2WjI1TFRGcGFURWhRYlVadGVtdHVaalJwT0d4Q1FqZGlaREozVTJVNFZUQllORXhLV1VoR1EwNW5kMmRETWtoSlZtcFRhSEZrUkV0TVNUWnRPVXhwY2t4eVRreFlkRWxTYzIxbU5rOTJVVTVJYVMxa2JFaFFlaTFMWjB0SVNYZEZRMHRaYXpaWFdtSnpjRkJvRWhSM1NEWkRXVTV4YlVoSlRGZDBRV0ZhZUdKa2J4b2lRVTlOV1ZKM1EwZDFjVzVuUlhGdk9ERjRZMEZrZGtSVE1tcFNhMFJRYTB4b1VRIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNTYiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTW9uc3RlciIsImxpbmsiOiJodHRwczovL3d3dy5tb25zdGVyLmNvbS5zZy9hbXAvam9iLXZhY2FuY3ktc29mdHdhcmUtZW5naW5lZXItYXNzb2NpYXRlLWNvbnN1bHRhbnQtc2VuaW9yLXNvZnR3YXJlLWVuZ2luZWVyLWNvbnN1bHRhbnQtbGVhZC1lbmdpbmVlci1hbmRyb2lkLWhjbC1zaW5nYXBvcmUtcHRlLWx0ZC1zaW5nYXBvcmUtMjc0NzMzODkuaHRtbD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Staff Software Engineer (Golang / Java / Fullstack)", "company_name": "VISA", "location": "Singapore", "via": "via Bayt.com", "description": "Job Description and Responsibilities\n\nQualifications", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTdGFmZiBTb2Z0d2FyZSBFbmdpbmVlciAoR29sYW5nIC8gSmF2YSAvIEZ1bGxzdGFjaykiLCJjb21wYW55X25hbWUiOiJWSVNBIiwiY29tcGFueV9taWQiOiIvbS8wMWtxam4iLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJjT3JPb3I3RzVNdEcxdXpyQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFc2tCQ293QlFVNVZYMDV4VkU5UWIxTnFka3BRYjJwQ0xVVTVUM2xNTW10a2FrbFJkMDV6UTFGb1oyMTZhRU40TUdGVWNWWlRkM1JrUjB0U1pEZEdlRzVRTWxWcVlsWTNPVEk1VW5NMlZuZGhlVEYxZGpOS1Z5MHpVek5qUVUxR1FWZERaV3MxWDJSQ2FXaHZWVVpxV2pWblNEVklNM0phVGpoNllsaFJNVmhUWjBVelRpMVNXVkkxWVhFMFJsYzNUWGdTRkhkSU5rTlpUbkZ0U0VsTVYzUkJZVnA0WW1SdkdpSkJUMDFaVW5kQk0wdEhlVGR2WmpGWmNtWmZTVXhTWWxWV2RIaGhjbTQ1TmxkQiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzYzIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJheXQuY29tIiwibGluayI6Imh0dHBzOi8vd3d3LmJheXQuY29tL2VuL3NpbmdhcG9yZS9qb2JzL3N0YWZmLXNvZnR3YXJlLWVuZ2luZWVyLWdvbGFuZy1qYXZhLWZ1bGxzdGFjay01ODc2MzAyNy8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Senior Software Engineer / Software Engineer (Java with Angular / ReactJS)", "company_name": "EPAM Systems", "location": "Singapore (+1 other)", "via": "via Bayt.com", "description": "EPAM is committed to providing our global team of more than 41,150 EPAMers with inspiring careers from day one. EPAMers think creatively and lead with passion and honesty. Our people are the source of our success. We value collaboration, work in partnership with our customers, and strive for the highest standards of excellence. In today’s market conditions, we’re supporting operations for hundreds of clients around the world remotely. No matter where you are located, you’ll join a dedicated, diverse community that will help you discover your fullest potential.\n\nDESCRIPTION\nWe are looking for an experienced Senior Software Engineer / Software Engineer (Java with Angular / ReactJS) in Singapore to make the team stronger.\n\nWeb-based applications development in the business domain of a financial services client.\n\nFull-cycle web application development using Agile approach:\n1. Idea generation and high-level vision creation;\n2. Solution design and documenting, proposal;\n3. Development... testing, and Production launch.\nResponsibilities\n• Be a member of a cross-functional team that experiment with new technology and proactively searches for the best solutions and ideas in the marketplace\n• Coordinate your work with other developers to deliver first-class technology solutions in a positive, fun, yet challenging and deadline driven environment\n• Work closely with other Product and Technology teams, internal and external, to bring technology solutions and perspectives to the product development process\n• Provide input on, follow and evangelize code quality guidelines and standards\n• Participate in code reviews to highlight best of breed solutions\n• Identify/troubleshoot application code-related issues, and review and provide feedback to any required final user documentation\nRequirements\n• Degree in Computer Science or equivalent\n• At least 7+ years of experience in Java/J2EE development\n• Hands-on project experience in Angular/ReactJS is a must\n• Experience in application and system design with OOA/OOD, UML Modeling\n• Project / hands-on experience with J2EE standard\n• Good programming experience with Java (EJB, Servlets, JSP, JDBC, ect, WebSphere Application Server on Unix and Windows platforms for 4-5 years\n• Experience in Hibernate, Spring frameworks a must. Experience of Struts will be a plus\n• Knowledge of database design, familiarity with Oracle SQL and PL/SQL a must\n• Sound knowledge of application security issues such as authentication, authorization and auditing\n• Experience with internet/intranet infrastructure/integration projects preferred\n• Strong communication skills and good command of English. Excellent technical writing skills\nWe offer\n• Friendly team and enjoyable working environment\n• Work-life balance and flexible schedule\n• Online training library, mentoring, career development and potential partial grant of certification\n• Unlimited access to LinkedIn learning solutions\n• Referral bonuses\n• Compensation for sick leave and paid time off\n• Opportunities for self-realization", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgRW5naW5lZXIgLyBTb2Z0d2FyZSBFbmdpbmVlciAoSmF2YSB3aXRoIEFuZ3VsYXIgLyBSZWFjdEpTKSIsImNvbXBhbnlfbmFtZSI6IkVQQU0gU3lzdGVtcyIsImNvbXBhbnlfbWlkIjoiL20vMGRsbnJjIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiMTFWZkUzalFqUXByMGdyS0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXQ4QkNxSUJRVTVWWDA1eFZGQk9lbXhQWDJKV1dUVnJaamg0Y1dVM1kyc3hOM0U0VDBkWVFVSnBWWFJwVUVGUWMyaDNSWGhsVEc5M2FsUklSSEJVTnpkcGMwTjRVSEk0V1hjMGVuTjNRVmczZFdKR1JYa3dSeTA0WkdGdkxWbE1WRlpuYkZOUWFXMTJVREl6VVVzM1JrNXNjMHBCUzNWZk5tOXFjeTA1WVVOT09FTjRTMGhtWVZKWVZua3hUVzF0V0dFM1dGZFpNR3AwUldOYWNWZHdkR2c1VG1zM1pISjNFaFIzU0RaRFdVNXhiVWhKVEZkMFFXRmFlR0prYnhvaVFVOU5XVkozUkROaU5XVlJUM2hYV0ZWelQyNXlXVWR0ZDJGWlQwUjNSbDlKUVEiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY183MCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCYXl0LmNvbSIsImxpbmsiOiJodHRwczovL3d3dy5iYXl0LmNvbS9lbi9zaW5nYXBvcmUvam9icy9zZW5pb3Itc29mdHdhcmUtZW5naW5lZXItc29mdHdhcmUtZW5naW5lZXItamF2YS13aXRoLWFuZ3VsYXItcmVhY3Rqcy01NzQyNTg1Mi8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}], "chips": [{"type": "Title", "param": "job_family_1", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:Google Sans,arial,sans-serif}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Software engineer", "value": "software engineer"}, {"text": "Programmer", "value": "programmer"}, {"text": "Programmer analyst", "value": "programmer analyst"}, {"text": "Senior", "value": "senior"}, {"text": "Cnc programmer", "value": "cnc programmer"}, {"text": "Engineer", "value": "engineer"}, {"text": "Analyst programmer", "value": "analyst programmer"}, {"text": "Science", "value": "science"}, {"text": "Software programmer", "value": "software programmer"}, {"text": "Assistant", "value": "assistant"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Electrical engineer", "value": "electrical engineer"}, {"text": "Executive", "value": "executive"}, {"text": "Java engineer", "value": "java engineer"}, {"text": "Java programmer", "value": "java programmer"}, {"text": "Lecturer", "value": "lecturer"}, {"text": "Manager", "value": "manager"}, {"text": "Operator", "value": "operator"}, {"text": "Project officer", "value": "project officer"}, {"text": "Senior programmer", "value": "senior programmer"}, {"text": "Senior system", "value": "senior system"}, {"text": "Senior technical", "value": "senior technical"}, {"text": "Sr. programmer", "value": "sr. programmer"}, {"text": "Systems programmer", "value": "systems programmer"}, {"text": "Technical", "value": "technical"}, {"text": "Trainee", "value": "trainee"}, {"text": "Trainer", "value": "trainer"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Mining", "value": "/business/naics2007/21"}, {"text": "Rental", "value": "/business/naics2007/532"}, {"text": "Wholesale", "value": "/business/naics2007/42"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "EPAM", "value": "/m/0dlnrc"}, {"text": "VISA", "value": "/m/01kqjn"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "Citi bank", "value": "/m/01dfb6"}, {"text": "TikTok", "value": "/g/11fy265933"}, {"text": "Ubisoft", "value": "/m/02qdyj"}, {"text": "Cognizant", "value": "/m/03bf9h"}, {"text": "HCL SINGAPORE PTE. LTD.", "value": "/g/11fy25ngsv"}, {"text": "Oracle", "value": "/m/05njw"}, {"text": "Credit Agricole Group", "value": "/m/028vbm"}, {"text": "Mindteck (India) Limited", "value": "/m/0cqj8w1"}, {"text": "Nanyang Technological University", "value": "/m/0l49k"}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Zühlke Group", "value": "/g/1hh_rg216"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Avensys Consulting Pte Ltd", "value": "/g/11g7022gjf"}, {"text": "Avnet", "value": "/m/0c8xmc"}, {"text": "GlobalTix Pte Ltd", "value": "/g/11dxpqdhrf"}, {"text": "Government Technology Agency", "value": "/g/11gh0528nq"}, {"text": "J.P.Morgan", "value": "/m/01hlwv"}, {"text": "Optimum Solutions (Singapore) Pte Ltd", "value": "/g/11g70hkrbx"}, {"text": "Razer Inc.", "value": "/m/075hc0"}, {"text": "Realtek Malaysia", "value": "/m/05wrm7"}, {"text": "Realtek Singapore Private Limited", "value": "/g/11g9n26trs"}, {"text": "Success Human Resource Centre Pte Ltd", "value": "/g/11g709_209"}, {"text": "TECHNOPALS PTE. LTD.", "value": "/g/11dxpvkynp"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "UST", "value": "/m/08kb8g"}, {"text": "Adecco GS", "value": "/m/08gz46"}, {"text": "Alphanova Pte. Ltd.", "value": "/g/11f8h_czps"}, {"text": "BioMind", "value": "/g/11dymfr2l6"}, {"text": "Biqmind", "value": "/g/11g21fzhrb"}, {"text": "BitTitan", "value": "/g/11dxpksv89"}]}]}