{"search_metadata": {"id": "6082798d1e803f37a1bff754", "status": "Success", "json_endpoint": "https://serpapi.com/searches/b1a86165a6f57dd4/6082798d1e803f37a1bff754.json", "created_at": "2021-04-23 07:38:53 UTC", "processed_at": "2021-04-23 07:38:53 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28product+manager%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=60", "raw_html_file": "https://serpapi.com/searches/b1a86165a6f57dd4/6082798d1e803f37a1bff754.html", "total_time_taken": 2.76}, "search_parameters": {"q": "(product manager) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "60"}, "jobs_results": [{"title": "Sr. Manager - Product Management (Unified Communication)", "company_name": "Tata Communications", "location": "Singapore", "via": "via Jobs", "description": "Job Family Descriptor Position Summary Responsible for entire product life cycle management - development and management of products as per new product/service requirement and enhancement of existing products and features. Also responsible for augmentation of network capacity to meet growing customer needs, new technology introduction, or increasing operational efficiencies, with the objective of ensuring increase in product and service profitability, revenue and market competitiveness; and developing and delivering effective multi product solutions to meet customer requirements. Drive P & L management through product strategy development and manage a group of products within a technology area across multiple regions. Works with the sales team on market strategy, pricing and positioning of the product. Engage and partner with technology providers to recruit new features or new product. Assess performance of product/service portfolio against annual operating plan and discuss... achievement of targets with Sales. Broad outline of the Role Drive P & L management for product portfolio through product development and management, sales support and enablement discussions with Sales, Customers, Engineering, Operations Technology and Service Development. Tactical role which provides a marked contribution to defining the product strategy, direction of new products, processes, standards or operational plans based upon business strategy, with a significant midterm impact on business unit overall results. Identifies problems and suggests inputs to product development and engineering team to significantly improve process or fulfil service realisation and operationalise product/service and associated costs individual contributor in regions Involved in planning and strategizing of new and existing products. Impact of decisions made is mid-term in nature. Typically has small to medium profit and loss responsibility for a product portfolio May lead regional projects for a specific product portfolio Purpose - Broad objective of the role Operating Network - Key External Operating Network - Key Internal Size and Scope of Role - Financial Size and Scope of Role - No. of direct reports Size and Scope of Role - Total team size Size and Scope of Role - Other size parameters Minimum qualification & experience Bachelor’s degree in Engineering majoring in technology and/or telecommunications with strong working experience involving telecommunications and IT services operations At least 10 years' in telecommunications industry in techno-commercial assignments and other related ICT experience Strong working knowledge and ideally with Microsoft 365 Certified Teams Administration certification , MCSE, MCP or Skype for Business and other related certifications for business collaboration Understanding of systems polycoms and video collaboration (MS Team systems) Problem solving and resourcefulness in conditions of ambiguity, defining approaches and processes where none exist. Professional attitude, with excellent interpersonal skills able to present and influence internal to the company, and with external partners and customer. Possesses good communication skills (oral and written) Other knowledge/skills Key Responsibilities Technical Competencies Knowledge / Skills Communication Skills", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTci4gTWFuYWdlciAtIFByb2R1Y3QgTWFuYWdlbWVudCAoVW5pZmllZCBDb21tdW5pY2F0aW9uKSIsImNvbXBhbnlfbmFtZSI6IlRhdGEgQ29tbXVuaWNhdGlvbnMiLCJjb21wYW55X21pZCI6Ii9tLzA0MzM4ayIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Ik1neWZTNno5RmJVUll0VHdBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2WUJDcmNCUVU1VlgwNXhVVXRXVGtoNFVTMTJkVFJxVDNGc1YxZ3libEZxU213eFRtNXZhVU51Um5WVlNHSmhlRlkyWDBneE5YWlJReTFxWVVSUWRFaFJhakpxUjNKaFJEaDJTWHAwWDB4VVJscEJhbXRqTUdsdldFZHZWamRKTjBoVFduRlJXbUZSY0d4VFVreFFia1pRWms5Zk4wNTBURmgxVW01b05VOU9RMFZ6YmxwQ1NsQnBVbVJqWlZwaFpGRTJUWEF4TldWdE9IUTJjekJKWjFGMU4xcG9MVUpvVUZWbGRGTmpNblowWVc5UFkxUmFVek5mWjFkdkVoWnFNMjFEV1U1TGVFTTRVRkYwVVdFeGVFbGlXVVJuR2lKQlQwMVpVbmREYlZSQkxVaEVSRXg1VTJWVmJFaHRTRlJPUzIxUFVXaGZZVWgzIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIiwibGluayI6Imh0dHBzOi8vc2cuZmlkYW50by5jb20vam9icy9qb2Itb3BlbmluZy9tYW5hZ2Vycy1hbGwtb3RoZXIvc3ItbWFuYWdlci1wcm9kdWN0LW1hbmFnZW1lbnQtdW5pZmllZC1jb21tdW5pY2F0aW9uLTI3Nzg1MjEyNj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Principal Product Manager", "company_name": "PropertyGuru Group", "location": "Singapore", "via": "via LinkedIn", "description": "Make A Real Difference At PropertyGuru.\n\nReal Aspirations. Real People. Real impact.\n\nAt PropertyGuru Group, we believe that every person – no matter what their circumstance – should have a place to call home. That’s why we’ve been on a mission to transform how people find, finance, and own home across Southeast Asia over the last 13 years.\n\nVoted by property seekers as “Asia’s Most Influential Brand for Online Property Search”, and recognized as one of Human Resources Director Asia's 2020 Employer of Choice, PropertyGuru enables real-world aspirations through digital transformation and constant innovation. Every day, the work that we do has a real and positive impact on thousands of lives.\n\nWe’re looking for a Principal Product Manager for the Agent Monetization team to join our Product team in Singapore. As part of this role, you will be a critical leader on our Agent side of the business. As part of this role, you will be working on creating a new line of products & services... connecting our agents and consumers. You will also work on managing and optimizing current value-added products. This role will entail partnering closely with other engineering teams, product and program managers, sales managers, user experience designers, marketing managers, finance, and customer service leaders as well as internal product stakeholders across the company for driving the business. You will also shape the vision of PropertyGuru in becoming a trusted advisor to every person seeking property.\n\nWhat You Get to Do:\n\n• Lead the definition, execution, and roll-out of features – both, customer-facing as well as those that facilitate the business operation or improve development efficiency.\n\n• Drive speed on ideation, planning, design, and development of new products and features across the team\n\n• Partner with functions, including engineering, program management, trade marketing, and sales to produce the best quality products & services as a team.\n\n• Collaborate with and learn from partners and vendors who may have cutting edge solutions and/or content\n\n• Learn from customer feedback, behavioral measurements, A/B tests, and other data sources to build better experiences and ensure we are building on the right things over time.\n\n• Articulate findings and conclusions to key stakeholders and executive-level leadership.\n\n• Provide mentorship and best practices to the broader Product Management organization.\n\nWho You Are:\n\n• 7+ years crafting and delivering world-class products in a product management role\n\n• Strong analytical and quantitative skills with the ability to use data and metrics(A/B testing and experimentation, user testing, data analysis) to back up assumptions, recommendations and drive actions\n\n• Experience in working with Pricing Models and Dynamic Pricing Optimization systems\n\n• Ability to strategize, provide structure and divide it into steps goals to achieve them; break down complex problems into actionable steps\n\n• Outstanding track record with engineers, designers, and cross-functional partners: people love to work with you!\n\n• Display good empathy, judgment, and leadership, focus.\n\n• Ability to prioritize requirements across conflicting priorities; bias-to-action, willing to do whatever it takes to get quality products and features to market on time\n\nOVERSEAS candidates are welcome to apply, and we will apply Employment Pass for the right talent", "extensions": ["21 days ago", "Full–time"], "detected_extensions": {"posted_at": "21 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcmluY2lwYWwgUHJvZHVjdCBNYW5hZ2VyIiwiY29tcGFueV9uYW1lIjoiUHJvcGVydHlHdXJ1IEdyb3VwIiwiY29tcGFueV9taWQiOiIvbS8weDE0anZyIiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiZTM2NkZwT25VNW1EaVV1MkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZZQkNyY0JRVTVWWDA1eFVWUTJXWEpMZDBneVVYbFlOV3czUVdaT1NFWjBUVVl6T1dWbVpWWkdhVGxsWld0NFpFUmFVWHBFWW1SMU5sWnRaalJxYVdKdldXMXplblpGUkU4NFduWmFSR1o0WTBSNFVISTJibkZhVHpFNFRuQjNhWG95VUVGRWVVdFZiRk5WY1ZCc1dWOXBaVlYyZEVOdVRqZGxTVWhRV25NNE9HdHNUV2RSTWxOVWJHRmtlamRPVEhRNU4zQTRRMFZXU1VoMlQwOVJZUzAxV0ZCV1FUaFZSbEpPYkdGR1JWWlpWblZpUmxGRFJFVTFSMnd3RWhacU0yMURXVTVMZUVNNFVGRjBVV0V4ZUVsaVdVUm5HaUpCVDAxWlVuZENTWGt6VVdkMmIyWmxVVjgyWTFsVk5XVm5VWFZCTmpSQlVqZEIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18xNCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL3NnLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvcHJpbmNpcGFsLXByb2R1Y3QtbWFuYWdlci1hdC1wcm9wZXJ0eWd1cnUtZ3JvdXAtMjQ3NDQ0MjI5Nz9yZWZJZD05NDU2NTQzZi0wYzMxLTQxMjctOWY2OS1iNzc5MzdiZjY1NDVcdTAwMjZ0cmFja2luZ0lkPVU4dHBuNUQ0U3d3dUVhVkNLMW1XZUElM0QlM0RcdTAwMjZ1dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Product Manager (enterprise)", "company_name": "ALLEGIANCE MARKETING (GOURMET PLUS) PTE. LTD.", "location": " (+1 other)", "via": "via MNC Jobs Singapore | MNC Jobs In Singapore", "description": "We’re looking for a Product Manager to work on an established global restaurant SaaS product.\n\nIdeal candidates will have experience working on digital restaurant or hospitality-facing digital software solutions, including reservation management, electronic point of sale, & order management.\n• Develop & maintain digital product roadmap\n• Work with product, marketing & technology teams to develop detailed technical requirements for new product features & enhancements\n• Work closely with the development team to build, maintain & improve the digital product\n• Create test materials & perform user testing (interviews, surveys, research) to validate product concepts\n• Manage the implementation of third-party tools to support & enhance the day-to-day performance of any digital products\n• Create & manage the implementation of new features & enhancements to the digital product\n• Recommend new services, technologies & standards as part of the product development process\n• Create & maintain... documentation via wiki\n• Perform user acceptance testing & quality assurance\n• Create & present reporting & insights on the performance of the product\n• Work with the rest of the product team to create & maintain the development backlog\n• Attend & contribute to development scrums, planning & prioritisation sessions, and showcases, and retroactives\n\nExperience Required\n• Minimum of 2 years in a similar product management role\n• Experience managing the development of a SaaS Product, preferably in the hospitality space\n• Extensive Experience in Product management of software & applications\n• Experience in user-facing product development\n• Extensive Experience in developing mobile applications & responsive websites\n• Experience in the implementation & management of analytics tools & systems\n• Experience in the implementation & management of Personalisation services\n• Experience deploying & managing applications across multiple regions\n• Experience working in Scrum (Certification Preferred)\n• Good knowledge of project management software (Trello, Jira)\n• Experience working with both local & remote development teams", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9kdWN0IE1hbmFnZXIgKGVudGVycHJpc2UpIiwiY29tcGFueV9uYW1lIjoiQUxMRUdJQU5DRSBNQVJLRVRJTkcgKEdPVVJNRVQgUExVUykgUFRFLiBMVEQuIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJHS0tOZEcxbVFleFlNbTFkQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1OQyBKb2JzIFNpbmdhcG9yZSB8IE1OQyBKb2JzIEluIFNpbmdhcG9yZSIsImxpbmsiOiJodHRwczovL3NnLm1uY2pvYnouY29tL2pvYnMvcHJvZHVjdC1tYW5hZ2VyLWVudGVycHJpc2UtdGFuam9uZy1wYWdhci0yNzE5ODc/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Staff Product Manager", "company_name": "Twilio Singapore Pte. Ltd.", "location": "Singapore", "via": "via Monster Singapore", "description": "Twilio is growing rapidly and is looking for a talented, passionate and curious Product Manager to be a key leader in extending Twilio’s platform to International customers. This person will be the voice of the customer across R&D, influencing roadmaps, building key measures, and working cross-functionally to make International customers successful. This position is critical in supporting Twilio’s international expansion and will work alongside other product managers, engineering counterparts and customers.\n\nWho?\n\nTwilio is looking for a Product Manager in the International Products team, who lives the Twilio Magic and has a demonstrated track record of creating useful products. They also have:\n• 5+ years in product management\n• Experience building and shipping products to customers outside of North America\n• Experience talking to customers, understanding their problems and synthesizing the findings to inform product strategy.\n• Ability to influence product teams that are from... different business units and geographically distributed. Drive product design and requirements across multiple product roadmaps and scrum teams.\n• Curiosity and drive to challenge status quo and assumptions.\n• Strong analytical skills and preference for making data driven decisions.\n• Excel/Sheets and some SQL expertise. The best product managers make data driven decisions by synthesizing multiple data sources, making judgement calls on reliability and drawing signals from noise.\n• Have a bias for action & a willingness to experiment with different approaches.\n• Great communication skills. You are equally comfortable in working level conversations with technical folks; and presenting in front of management or non-technical audiences.\n• Technically savvy and experience with the cloud, APIs, communications, enterprise software, devices, and mobility is a plus.\n\nWhat?\n\nAs a Product Manager for International Products, you will live the values:\n• BE AN OWNER: Own the roadmap for localising Twilio’s products for International markets across the portfolio. Be able to communicate both the business and technical rationale behind your product decisions.\n• WRITE IT DOWN: Create the international personas for the product team, understand the customer journeys, and identify opportunities to level up customer satisfaction.\n• EMPOWER OTHERS: Work with globally distributed teams in sales, marketing, product, support, and business intelligence. Make sure we are hearing from a diverse set of stakeholders and customers.\n• WEAR THE CUSTOMER’S SHOES: Interview and engage directly with international customers and international sales opportunities\n• Create the reports and presentations that can effectively communicate customer requirements and opportunities at all levels of the organization", "extensions": ["10 days ago", "Full–time"], "detected_extensions": {"posted_at": "10 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTdGFmZiBQcm9kdWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJUd2lsaW8gU2luZ2Fwb3JlIFB0ZS4gTHRkLiIsImNvbXBhbnlfbWlkIjoiL2cvMTFienQ3M2hjYyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IlROd2VPelRGV1o2WUg5YW1BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVvc0NDc3dCUVU1VlgwNXhVbm96TFhSSU1qRlRXRTEzYTJaMWVGQktVMFV6Y3pGWWVtZGpha1ZrUm5WelZ6ZzFXVGRDZFV0VWNVcHFNak5tY1RsRU9UUklTazVITkVWQ09GQmpabDkxWDBSdVkzSklOR1JuYjFkcE4zbDZWSFozVUZwV1FraDBVMmRLWjB0T1ozUnlReTAwU2xBMWJHRk1jSGRxVkhwaWVVMXlSbWxDVUdwUU1qRmZZVVl5ZUVsNFZVbFFTM0JxTVZWMlQxWk9lbkV4TkRGdFlWSkpUR2RNVkZOS1dFbFlNRXBGU21oVldrOTZZelp3Y0VRMmFqRkNkM2g1VTBrNWVEaHNWbEo2U0VKcWVuVlZFaFpxTTIxRFdVNUxlRU00VUZGMFVXRXhlRWxpV1VSbkdpSkJUMDFaVW5kRVV6ZHdXWEpDTTFVM1kwc3dhMHhQUmxKc1kxQnJTamxwTmpCbiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzI1IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1vbnN0ZXIgU2luZ2Fwb3JlIiwibGluayI6Imh0dHBzOi8vd3d3Lm1vbnN0ZXIuY29tLnNnL2FtcC9qb2ItdmFjYW5jeS1zdGFmZi1wcm9kdWN0LW1hbmFnZXItdHdpbGlvLXNpbmdhcG9yZS1wdGUtbHRkLXNpbmdhcG9yZS0yNzY5MTM0MS5odG1sP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Product Manager - Cobrand and Strategic Partnerships (Cards and Personal Loans)", "company_name": "Citi bank", "location": "Singapore", "via": "via Bayt.com", "description": "You will be the responsible for the P&L of a Cobrand product portfolio, continuously seeking to improve key performance metrics through enhancing the core value proposition, creating customer value and campaigns to drive acquisition and card utilization. You will also be the lead for a strategic partnership, responsible for maintaining a strong, collaborative relationship with the partner, and jointly working on shared business objectives toward mutual benefits.\n\nResponsibilities\n• Evaluate/enhance product core value proposition to remain competitive yet maximize profitability\n• Translate cards business acumen and product insights into customer programs that result in desired behavioral shifts and incremental card spend\n• Collaborate with Sales channels by communicating value and unique selling point of the card products; provide training and develop sales tools to facilitate the selling process of cobrand card\n• Establish and maintain frequency of contact with key personnel within... each partnership, including business meetings and casual engagements\n• Work with Regional and Country counterparts to leverage digital/data analytics capabilities to better understand, manage and enhance performance of the portfolio\n• Identify growth opportunities to connect with customers in a forward compatible manner, engaging them through channel(s) they are transacting/constantly active in while maintaining the bank’s human touch and accessibility\n• Review, develop, manage all communication channels, materials and collaterals which includes management of inventory for card plastics, welcome packs, card member agreements, statement messages, product page etc\n• Plan, execute and manage through-the-line marketing initiatives end-to-end\n• Execute changes in CVP upon refresh (customer communications, platform training, etc.) or administer adhoc parameter enhancements when required with controls in place\n• Prepare monthly/quarterly business reviews and ensure audit readiness at all times\n\nQualifications and Skill-set Requirements\n• Sound knowledge and understanding of Cards and unsecured lending landscape. A good grasp of portfolio management fundamentals and product/system functionality will be a plus\n• Min 3-4 yrs of experience in Financial Service, Business Development or similar role in related industry\n• Strategic business/financial acumen with ability to identify opportunities and improve performance\n• Analytical skills to interpret business reports, identify gaps or opportunities and develop appropriate actions for product enhancement/portfolio growth.\n• Experience in business development & customer issue resolution with excellent presentation & communication (verbal and written) skills\n• Demonstrate ability to negotiate & influence change/progress and collaborate well with stakeholder\n• Strong partnership and relationship management skills, with proven ability to overcome challenges and meet business objectives to achieve win-win outcomes\n• Self-driven & highly motivated team player who can multi-task & deliver results under pressure\n• Keen learner ready for challenges and stretch responsibilities\n\n-------------------------------------------------\n\nJob Family Group:\n\nProduct Management and Development\n\n-------------------------------------------------\n\nJob Family:\n\nProduct Management\n\n------------------------------------------------------\n\nTime Type:\n\n------------------------------------------------------\n\nCiti is an equal opportunity and affirmative action employer.\n\nQualified applicants will receive consideration without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.\n\nCitigroup Inc. and its subsidiaries (\"Citi”) invite all qualified interested applicants to apply for career opportunities. If you are a person with a disability and need a reasonable accommodation to use our search tools and/or apply for a career opportunity review Accessibility at Citi.\n\nView the \"EEO is the Law\" poster. View the EEO is the Law Supplement.\n\nView the EEO Policy Statement.\n\nView the Pay Transparency Posting", "extensions": ["7 days ago", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9kdWN0IE1hbmFnZXIgLSBDb2JyYW5kIGFuZCBTdHJhdGVnaWMgUGFydG5lcnNoaXBzIChDYXJkcyBhbmQgUGVyc29uYWwgTG9hbnMpIiwiY29tcGFueV9uYW1lIjoiQ2l0aSBiYW5rIiwiY29tcGFueV9taWQiOiIvbS8wMWhsem0iLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJWQkRScHhxVi1SWjBsVzh2QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VkdveFNFZENlRkJhVVY5S2EwSTNZWE42UzBwNlgyOUVVMUF5Y21WT1lqZzBiMVJoT0hKSFFuSjBRVlIyVVRoelFuZFFhR2h0UVZKS2VGUkxRVTUwZWxadVoyVklObVZZV0RoU2VsbHNVRTluYW1oVFdIcDNXV1I2ZW5CdFpEWXlVamczTVRRMUxXeExWbmh3Vm5kdU9HTlNWbUp4YTE4eE1rUkZZa3hGTm5SUlNrWnJjMkprWTBneWRXeDBVV0ZMWDNFeVpHUlFZWFJUVFRaUkVoWnFNMjFEV1U1TGVFTTRVRkYwVVdFeGVFbGlXVVJuR2lKQlQwMVpVbmREUWt4ck5XYzROVWxDT0dsemIwRnJRMDlQYUVsTWMzZFdZbTVCIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMzEiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQmF5dC5jb20iLCJsaW5rIjoiaHR0cHM6Ly93d3cuYmF5dC5jb20vZW4vc2luZ2Fwb3JlL2pvYnMvcHJvZHVjdC1tYW5hZ2VyLWNvYnJhbmQtYW5kLXN0cmF0ZWdpYy1wYXJ0bmVyc2hpcHMtY2FyZHMtYW5kLXBlcnNvbmFsLWxvYW5zLTU5NTAyMTQwLz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "IT Product Manager", "company_name": "Volt Asia", "location": "Singapore", "via": "via Laimoon.com", "description": "The ideal fit is an experienced Product Manager with Blockchain / Cryptocurrency as a core focus. Familiar with IT Product roadmap and strategy, and experienced in building data products or is heavily focused in data analytics.\n\nBacked with a strong know-how in Open-Source technology and is able to demonstrate deep knowledge in containerization. As you will be building up a product, it is important to possess knowledge and experience in the usage of tools for product management and techniques.\n\nAbove all, the role requires you to gain a deep understanding of customer experience, to identify and fill product gaps to gain market share, improving customer experience and drive growth. A clear product vision to attract buy-in, working alongside external partners in translate strategies into prototypes. Drive launches in collaboration across different teams involved.\n\nThis is a client-facing position, you will be visiting customers in soliciting their feedback on product and experience... services provided to them. Therefore work on improvements, driving all aspects of the product, working closely with business and technical partners to align the overall roadmap of the product.\nTechnology", "extensions": ["15 days ago", "Full–time"], "detected_extensions": {"posted_at": "15 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJJVCBQcm9kdWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJWb2x0IEFzaWEiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Im1FNHlrM24wY1I2Qk9OYlhBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGFpbW9vbi5jb20iLCJsaW5rIjoiaHR0cHM6Ly9qb2JzLmxhaW1vb24uY29tL2pvYnMvZXh0ZXJuYWx2aWV3LzI1NzYxNDE2P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Information Technology - Technical Product Manager (SAP)", "company_name": "Singapore Airlines", "location": "Singapore", "via": "via LinkedIn", "description": "Information Technology - Technical Product Manager (SAP)\n\nJob Description\n\nWe’re looking for a Technical Product Manager (SAP) who will take a key role in our team. The successful candidate will join the Information Technology Division, Cloud & Platforms department and will be responsible for the following:\n• Set the technology roadmap and standards for our SAP platform and applications.\n• Responsible for setting and maintaining operational procedures, processes and controls and working with SAP Basis support.\n• Responsible for security, configuration, patching, review of SAP GRC SOD/SAT rules and violations and working with security/audit teams (both internal and external).\n• Managing licence audits with SAP audit team.\n• Managing inventory and re-certification of servers, software versions, system IDs, etc.\n• Managing admin user access/reviews, planning complex system changes.\n• Review system architecture design changes and new implementation.\n• Managing server resource utilization... and costs and system performance optimization.\n• Run and manage various upgrade projects to the core SAP platform and support business users with application changes/migrations.\n• This role is an individual contributor role.\n\nRequirements\n• University degree in an IT related discipline.\n• More than five years of experience working with SAP BASIS in multiple roles, such as team lead or manager.\n• Good general IT knowledge covering servers, storage, networks, browsers, printers, basic UNIX admin tasks, basic Windows OS admin tasks, etc.\n• Ability to manage vendors, project teams and users to ensure standards & timely delivery.\n• Ability to engage and lead multiple support teams to resolve incidents or issues.\n• Good communication and interpersonal skills, and ability to resolve conflicts", "extensions": ["28 days ago", "Full–time"], "detected_extensions": {"posted_at": "28 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJJbmZvcm1hdGlvbiBUZWNobm9sb2d5IC0gVGVjaG5pY2FsIFByb2R1Y3QgTWFuYWdlciAoU0FQKSIsImNvbXBhbnlfbmFtZSI6IlNpbmdhcG9yZSBBaXJsaW5lcyIsImNvbXBhbnlfbWlkIjoiL20vMDE1ZjJ4IiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoibjc0ejRwTGZUZkhvOXlwX0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZZQkNyY0JRVTVWWDA1eFVYaDFNMVJCV0cxWWFFcGhZMU5CZDJWNWFYQmhlRVpqY21SdGR6RkNXVFJDT0hsTk1rUlpNMlZuYjBOaFUyMTVjRkZ2VEY5YVZWRlNlR1ZsY3pSdFVUVk9lSFJTV0dwVVRreHlTWEJEWmxSdE5tcFNRV2x6VEhRMlYwVk1jR2QyTVMxb1JWTlJabkEzUzJaT1ZrODFMV3RJY1RadE1rVmlRM0ZKUldwbFMyRXRlRnBKZFhkNVkybDNhbWwxYjNkMFdWQlBXRkV4YkRWVldESjBOblJVVW1Ob1RrczRWVVppWVVsSGNGZHBSVVpuRWhacU0yMURXVTVMZUVNNFVGRjBVV0V4ZUVsaVdVUm5HaUpCVDAxWlVuZERUbUpKTnpOek1uUnJZakIyVkVZMVYyRkRjRzlxZW5wUmEyMW4iLCJmY3YiOiIzIiwiZmNfaWQiOiJmY180MiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL3NnLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvaW5mb3JtYXRpb24tdGVjaG5vbG9neS10ZWNobmljYWwtcHJvZHVjdC1tYW5hZ2VyLXNhcC1hdC1zaW5nYXBvcmUtYWlybGluZXMtMjQ5MzEzODA0OD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Product Manager", "company_name": "None", "location": "Singapore", "via": "via Jobs | Fidanto", "description": "We are looking for a Product Manager who will be managing clients in Singapore. The selected candidate will be responsible for the implementation of Tracesafe product and support the customer after the implementation.Duties and Responsibilities · Managing Tracesafe team at client's place, making sure that the team follows the customer implementation process and maintain safe work environment of the team· Prepare a project plan, dependency register, risk register and implement the project / CR within the committed timeline and with the provided resources· Monitoring the progress of the project and escalate to the Project Steering Committee on time for any slippage of the project· Keeping track of project milestone and working closely with Tracesafe finance team for billing· Making sure that all the requirements are met within the SOW· Managing a change control process, submit and track the CR for any additional scope in project identified· Work closely with Tracesafe team for every new... releases and bug fixes· Responsible for managing Incidents, which includes, support tickets, assign the ticket to the team, monitor the ticket status and close the ticket within SLA· Prepare and submit incident report for any severity 1 issue with proper activity sequence, workaround provided, follow-up action, etc.· Participate in client meetings and provide updates to outstanding incidents, product roadmap and manage escalations· Prepare and submit a weekly status report for a new project implementation and monthly status report for a maintenance project with the defect details with the status to customerRequirements Technical· Solid technical background with understanding of mobile / web application technologies in software development will be good fit for this position· Working experience in Java / J2ee will definitely a plusEducational· Bachelor degree or diploma in Computer Science or related field· Certification in ITIL V3 Foundation is preferred· Certification in PMP will be an added advantageWorking Experience· Minimum of 5 years of total working experience and 2-3 years worked as a Product Manager· Maintained good working relationship with customer technical and development team· Would be an added advantage to maintain a team size from 3 to 5 either in onsite or offsite with good motivation skills· Excellent client facing, written / verbal communication and problem solving skills.· Working knowledge in Jira will be an advantage", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9kdWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJOb25lIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJoQWFZWG1QWDJvTG5OMWhrQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnMgfCBGaWRhbnRvIiwibGluayI6Imh0dHBzOi8vc2cuZmlkYW50by5jb20vam9icy9qb2Itb3BlbmluZy9maXJzdGxpbmUtc3VwZXJ2aXNvcnMtb2YtcHJvZHVjdGlvbi1hbmQtb3BlcmF0aW5nLXdvcmtlcnMvcHJvZHVjdC1tYW5hZ2VyLTI3NTQzMDE3Nz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Organon - Product Quality Manager - Organon API - Sr-Specialist", "company_name": "MSD", "location": "Singapore", "via": "via Monster Singapore", "description": "Job Description\nEXTERNAL QUALITY ASSURANCE -PRODUCT QUALITY MANAGER : P3-Senior Specialist\nOverview\nThe Product Quality Manager is responsible for ensuring that all our company products managed by External Quality Assurance (EQA) are manufactured, packaged, analyzed, released, stored, and distributed in accordance with our company expectations and all applicable regulatory requirements. Role has primary batch release responsibility and ensures that effective and robust Quality systems are in place to comply with required regulations, policies and guidelines governing the EP/ExP's manufacture and release of () by means of risk-based quality oversight and on-site supervision, as appropriate.\nPQM will support partner relationships with activities of increasing complexity, scope, and volume which can be influenced by one or more of the following: number of products manufactured, number of partners supported, production volumes, number and complexity of in-markets, historical performance... (production and compliance), new product or market launches, historical relationship between our company and the partner, manufacturing process complexity.\nPrimary Activities may include, but are not limited to the following:\n• Evaluate and/or release products to other sites and/or to the market with the assurance that the goods were produced in conformance to all applicable policies/procedures of our company and compliance with all governing regulations; review and approve changes to master batch records\n• Manage routine and complex deviations and complaints, and assist in the coordination of significant investigations including Fact Findings; assist in the coordination of any product recall involving the external manufacturer\n• Provide support for audits of EP/ExP by our company and regulatory agencies; review audit outcomes pertaining to external manufacturers and ensure appropriate and timely corrective actions are warranted\n• Oversee repackaging activities in the ExP/EP\n• Conduct routine and solves complex analytical change requests and support process modification change controls\n• Stability Program management, including review of stability reports, and Annual Product Review assembly\n• Provide on-site guidance in the preparation of metrics, procedures, and guidelines; provide proactive support in training and coaching to initiate quality improvements\n• Track and monitor operational and quality performance of the external manufacturer/partner an can work with supplier to develop CAPA plans\n• Assist the maintenance of retention samples, ship reagents and samples to support licensure and foreign registration; responsible for shipment under quarantine\n• Support routine process validation; review and approve validation reports/tech transfer\n• Prepare pre-PAI assessments; support document requests for regulatory filings and post approval changes\n• Regular site visits to build relationships and monitor efforts to improve the external manufacturer's quality and reliability through ongoing oversight and formal communication programs and forums\n\nBackground:\n• Degree in Science, Engineering or any relevant technical discipline (BS Biology, Microbiology, Pharmacy, Chemistry, Chemical Engineering, or equivalent preferred).\n• Previous experience in the pharmaceutical industry with thorough knowledge of Quality Systems, Quality Assurance, and Quality Control including global GMP Quality Systems and regulatory requirements preferred\n\nRequired Skills:\n• Solves complex problems; takes a new perspective using existing solutions\n• Works independently, receives minimal guidance\n• Acts as a resource for colleagues with less experience within own discipline; can provide minimal guidance on issue resolution and act as SME\n• May act as a team or project lead and lead work of others as required; promotes teamwork and open discussion of issues, coaches and guides others\n• Explains difficult issues and works to build alignment around a complex situation\n• Accountable for a medium project with minimal resource requirements, risk and/or complexity\n• Ability to work across boundaries; demonstrated interpersonal, relationship building and leadership skills\n• Communicates easily in English both verbally and in writing\n• Strong knowledge of External Manufacturing management, supply chain, and operations\n• Lean Six Sigma / our company Product ion Systems training\n\nTravel:\n• Ability to travel up to 25% of the time\n\n#newco\nCurrent Employees apply\nCurrent Contingent Workers apply\nSearch Firm Representatives Please Read Carefully\nMerck & Co., Inc., Kenilworth, NJ, USA, also known as Merck Sharp & Dohme Corp., Kenilworth, NJ, USA, does not accept unsolicited assistance from search firms for employment opportunities. All CVs / resumes submitted by search firms to any employee at our company without a valid written search agreement in place for this position will be deemed the sole property of our company. No fee will be paid in the event a candidate is hired by our company as a result of an agency referral where no pre-existing agreement is in place. Where agency agreements are in place, introductions are position specific. Please, no phone calls or emails", "extensions": ["5 days ago", "Full–time"], "detected_extensions": {"posted_at": "5 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJPcmdhbm9uIC0gUHJvZHVjdCBRdWFsaXR5IE1hbmFnZXIgLSBPcmdhbm9uIEFQSSAtIFNyLVNwZWNpYWxpc3QiLCJjb21wYW55X25hbWUiOiJNU0QiLCJjb21wYW55X21pZCI6Ii9tLzA0ZjB4cSIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IlBlVG1TSWtvLVNBZlNLc3NBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVzc0JDb3dCUVU1VlgwNXhVV0ZFYjIxMFltWnlkRTVIYVRSd2NEQlBTakJFVDE5Q2J6VnVOWEZoTWpWb1JYbHlhM1poZUdKMlRqSXhlRjlyVkRFeFFuaGFiVTFSYVRCRE5XWlhYMlZrYkVOdUxVSkhia2xtVDFSVlNXTXliMGxmT1haVlVtcGFlQzFFVDBKaVNqaEZiMDF5U21SVVUxSmZRa1ZaZEhWUlJ6WnRUakl3Y2pOclJVNHpVVTVtUmpCQ09Vd1NGbW96YlVOWlRrdDRRemhRVVhSUllURjRTV0paUkdjYUlrRlBUVmxTZDBNNE5uUlVjamt0YzFsbGJsZHdRbU53WmpGWlRrSlllVGRHZG1jIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNTMiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTW9uc3RlciBTaW5nYXBvcmUiLCJsaW5rIjoiaHR0cHM6Ly93d3cubW9uc3Rlci5jb20uc2cvYW1wL2pvYi12YWNhbmN5LW9yZ2Fub24tcHJvZHVjdC1xdWFsaXR5LW1hbmFnZXItb3JnYW5vbi1hcGktc3Itc3BlY2lhbGlzdC1tc2Qtc2luZ2Fwb3JlLTI3NzYzMjk5Lmh0bWw/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Transactional FX (TBFX) Product Manager-2100009215", "company_name": "Standard Chartered", "location": "Singapore", "via": "via Bayt.com", "description": "Transactional FX (TBFX) Product Manager - (2100009215)\n\nJob: Institutional Banking\nPrimary Location: Asia-Singapore-Singapore\n\nSchedule: Full-time\nEmployee Status: Permanent\nPosting Date: 15/Apr/2021, 4:57:08 AM\nUnposting Date: 16/May/2021, 10:59:00 PM\n\nAbout Standard Chartered\nWe are a leading international bank focused on helping people and companies prosper across Asia, Africa and the Middle East.\n\nTo us, good performance is about much more than turning a profit. It's about showing how you embody our valued behaviours - do the right thing, better together and never settle - as well as our brand promise, Here for good.\n\nWe're committed to promoting equality in the workplace and creating an inclusive and flexible culture - one where everyone can realise their full potential and make a positive contribution to our organisation. This in turn helps us to provide better support to our broad client base.\n\nThe Role Responsibilities\n• Directly responsible for accelerating growth of the TBFX... P&L global revenue\n• Develop and execute strategy for growth of the TBFX business globally\n• Lead for commercialising TBFX solutions together with sales and relationship managers\n• Ensure appropriate positioning of TBFX products internally and externally\n• Prospecting of clients who currently do not use TBFX solutions with the Bank\n• Hunting for new business development opportunities on the TBFX product set\n• Plan and drive new product launches, strategies, and sales to ensure that TBFX products exceed planned revenue & volume targets and to grow market share.\n• Identify opportunities, threats, and responses to maximize profitability, market share and growth of TBFX products.\n• Translate market opportunities into new enhanced profitable products and services. This includes the production of clear business cases defining product and service features and functionality, target market, profitability projections and any changes required to internal processes and service delivery.\n• To provide training and ongoing support to Sales and Relationship Managers. To provide technical assistance to facilitate the close of large/complex deals related to TBFX solutions\n• Develop compelling segment and regional value propositions to accelerate progress of TBFX products\n• Work with various stakeholders (other TB product managers, Financial market product managers, coverage and sales partners) to co-create and develop unique TBFX related solutions\n\nOur Ideal Candidate\n• 1", "extensions": ["8 days ago", "Full–time"], "detected_extensions": {"posted_at": "8 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJUcmFuc2FjdGlvbmFsIEZYIChUQkZYKSBQcm9kdWN0IE1hbmFnZXItMjEwMDAwOTIxNSIsImNvbXBhbnlfbmFtZSI6IlN0YW5kYXJkIENoYXJ0ZXJlZCIsImNvbXBhbnlfbWlkIjoiL20vMDJoc3prIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoidzRrSzlmVVJBamZfLUoxQUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZZQkNyY0JRVTVWWDA1eFZHczNlSEZMVG1NMVdFSTVkMDFuYTJJMVFscE9ZVmRCVUZWdFJrbEVhblI2UW0xNFZIcDVkMkZHVFhOMGJWZDFOVm8zUzBWSVVtTjZURko0UlZvMFRuaHJaV3MzVm1SQ2JETXlkV05rZEc5aWNrWmlVRXRqWjBoaVMyMXRkVm81WVdwbldsaHZkbVJqZVhSRk9UWnlXVjlQZHpodVNVWlhSWEZsWlRjNGJqVTJTMDE0YWxKV2R5MTNVekUxVGpObFNIWjZOV0ZsYzNWWmVqSk1TVTFDY1Zkc2FFY3lXV2hQYmpnME1FWlpOa3BCRWhacU0yMURXVTVMZUVNNFVGRjBVV0V4ZUVsaVdVUm5HaUpCVDAxWlVuZEJXRkpuVGpoUldXeEplRzV6VFhKRFowcGFValJuT1RZeU4zZDMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY182MSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCYXl0LmNvbSIsImxpbmsiOiJodHRwczovL3d3dy5iYXl0LmNvbS9lbi9zaW5nYXBvcmUvam9icy90cmFuc2FjdGlvbmFsLWZ4LXRiZngtcHJvZHVjdC1tYW5hZ2VyLTIxMDAwMDkyMTUtNTk0NzI5MDIvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Management", "value": "GC18"}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Business Operations", "value": "GC06"}, {"text": "Advertising and Marketing", "value": "GC03"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Accounting and Finance", "value": "GC01"}, {"text": "Legal", "value": "GC17"}, {"text": "Farming and Outdoors", "value": "GC13"}, {"text": "Human Resources", "value": "GC15"}, {"text": "Sales and Retail", "value": "GC26"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "Product manager", "value": "product manager"}, {"text": "Manager", "value": "manager"}, {"text": "Project manager", "value": "project manager"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Development manager", "value": "development manager"}, {"text": "Director", "value": "director"}, {"text": "Manufacturing manager", "value": "manufacturing manager"}, {"text": "Marketing manager", "value": "marketing manager"}, {"text": "Plant manager", "value": "plant manager"}, {"text": "Production manager", "value": "production manager"}, {"text": "Program manager", "value": "program manager"}, {"text": "Regional", "value": "regional"}, {"text": "Senior", "value": "senior"}, {"text": "Sr. manager", "value": "sr. manager"}, {"text": "Account manager", "value": "account manager"}, {"text": "Admin manager", "value": "admin manager"}, {"text": "Affairs manager", "value": "affairs manager"}, {"text": "Assistant", "value": "assistant"}, {"text": "Brand manager", "value": "brand manager"}, {"text": "Commodity manager", "value": "commodity manager"}, {"text": "Communication", "value": "communication"}, {"text": "Customer", "value": "customer"}, {"text": "Dealer", "value": "dealer"}, {"text": "Devops engineer", "value": "devops engineer"}, {"text": "Engineering", "value": "engineering"}, {"text": "Executive", "value": "executive"}, {"text": "Product specialist", "value": "product specialist"}, {"text": "Production supervisor", "value": "production supervisor"}, {"text": "Risk manager", "value": "risk manager"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Transactional", "value": "transactional"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Internship", "value": "INTERN"}, {"text": "Part-time", "value": "PARTTIME"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Toiletries", "value": "/business/naics2007/3256"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Foods & Beverages", "value": "/business/naics2007/311"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Management", "value": "/business/naics2007/55"}, {"text": "Research", "value": "/business/naics2007/5417"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "Citi", "value": "/m/01dfb6"}, {"text": "Binance", "value": "/g/11hcz1r4wl"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "Amazon", "value": "/m/0mgkg"}, {"text": "Standard Chartered", "value": "/m/02hszk"}, {"text": "United Overseas Bank", "value": "/m/04gjd1"}, {"text": "Apple", "value": "/m/0k8z"}, {"text": "Tata Communications", "value": "/m/04338k"}, {"text": "Workato", "value": "/g/11dxpy_3xd"}, {"text": "BNY  Mellon", "value": "/m/02vps5x"}, {"text": "DBS Bank", "value": "/m/01q7n5"}, {"text": "EPAM Systems", "value": "/m/0dlnrc"}, {"text": "GVT Government Technology Agency (GovTech)", "value": "/g/11gh0528nq"}, {"text": "Grab", "value": "/m/0134c_p9"}, {"text": "Paypal", "value": "/g/122s91_5"}, {"text": "PeopleSearch Pte Ltd", "value": "/g/11c73ngn0w"}, {"text": "Randstad", "value": "/m/08pt1z"}, {"text": "Singapore Airlines", "value": "/m/015f2x"}, {"text": "TEKsystems (Allegis Group Singapore Pte Ltd)", "value": "/g/11b6g4bkv0"}, {"text": "ABBOTT LABORATORIES (SINGAPORE ) PRIVATE LIMITED", "value": "/m/09m57z3"}, {"text": "ADVANCE INTELLIGENCE PTE. LTD.", "value": "/g/11dymfkxss"}, {"text": "AXA", "value": "/m/04mn99"}, {"text": "Adecco Personnel Pte Ltd", "value": "/m/08gz46"}, {"text": "Adidas Group", "value": "/m/01jtml"}, {"text": "Aetna, a CVS Health Company", "value": "/m/0kg8x"}, {"text": "Agency for Science, Technology and Research", "value": "/m/0gmjcg"}, {"text": "Alibaba", "value": "/m/07s6ctl"}, {"text": "Argyll Scott", "value": "/g/11dxpk2374"}, {"text": "Autodesk", "value": "/m/018nm3"}, {"text": "Barry Callebaut", "value": "/m/03clky2"}, {"text": "BioMind", "value": "/g/11dymfr2l6"}, {"text": "CHUBB ASIA PACIFIC PTE. LTD.", "value": "/m/09m8xyh"}, {"text": "Cargobase", "value": "/g/11dxppfsjn"}, {"text": "Cargobase Pte Ltd", "value": "/g/11fy240nxm"}, {"text": "DKSH", "value": "/m/0dj2nh"}, {"text": "Dathena", "value": "/g/11dxprdn6y"}, {"text": "Dyson", "value": "/m/05cskg"}, {"text": "Enggsol Pte Ltd", "value": "/g/11g9mnfmm1"}, {"text": "Ethos BeathChapman", "value": "/g/11c73z0xm0"}, {"text": "Eu Yan Sang", "value": "/m/03cl9hn"}, {"text": "Flintex Consulting Pte. Ltd.", "value": "/g/11h1z41pzb"}, {"text": "GIVAUDAN SINGAPORE PTE LTD", "value": "/g/11f00wn519"}, {"text": "Goldman Sachs", "value": "/m/01xdn1"}, {"text": "GovTech Singapore", "value": "/g/11dxpkfs_6"}]}]}