{"search_metadata": {"id": "60827970aa6c951a42329e06", "status": "Success", "json_endpoint": "https://serpapi.com/searches/3220d346ccd8f433/60827970aa6c951a42329e06.json", "created_at": "2021-04-23 07:38:24 UTC", "processed_at": "2021-04-23 07:38:24 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28programmer%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=50", "raw_html_file": "https://serpapi.com/searches/3220d346ccd8f433/60827970aa6c951a42329e06.html", "total_time_taken": 2.47}, "search_parameters": {"q": "(programmer) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "50"}, "jobs_results": [{"title": "Analyst Programmer - Java", "company_name": "SCIENTE INTERNATIONAL PTE. LTD.", "location": "Singapore (+1 other)", "via": "via GrabJobs", "description": "Job Summary\n\nWe are looking for an experienced Java Developer to be involved in large-scale projects to design, build and maintain enterprise and web applications.\n\nMandatory Skill-set\n• Bachelor's Degree in Computer Science, Information Technology or equivalent;\n• At least 3 years of experience in application design, development and maintenance;\n• Strong technical experience in Java / J2EE technologies and frameworks i.e. JSP, Servlets, JSF, JSTL, Spring, Hibernate, Struts;\n• Proficient in using SQL - MySQL, MS SQL and Oracle;\n• Strong analytical skills and problem solving aptitude;\n• Strong interpersonal, communication and written skill;\n• Independent and good team player.\n\nDesired Skill-set\n• Experience in Agile processes.\n\nResponsibilities\n• Involved in designing, developing and supporting critical systems for the organization;\n• Assist in gathering and analysis of business requirements and perform development on the various modules of the system;\n• Involved system integration and... testing from System Integration (SIT) and User Acceptance Testing (UAT);\n• Maintain, support and ensure necessary changes are implemented and documented;\n• Provide user and system support during and post-implementation;\n• Keep abreast of the latest technological trends and assess the feasibility of adopting new technologies.\n\nShould you be interested in this career opportunity, please send in your updated resume to apply@sciente.com at the earliest.\n\nWhen you apply, you voluntarily consent to the disclosure, collection and use of your personal data for employment/recruitment and related purposes in accordance with the SCIENTE Group Privacy Policy, a copy of which is published at SCIENTE’s website (https://www.sciente.com/privacy-policy).\n\nConfidentiality is assured, and only shortlisted candidates will be notified for interviews.\n\nEA Licence No. 07C5639", "extensions": ["12 days ago", "$4.5K–$6K a month", "Part-time"], "detected_extensions": {"posted_at": "12 days ago", "schedule_type": "Part-time", "salary": "$4.5K–$6K a month"}, "job_id": "eyJqb2JfdGl0bGUiOiJBbmFseXN0IFByb2dyYW1tZXIgLSBKYXZhIiwiY29tcGFueV9uYW1lIjoiU0NJRU5URSBJTlRFUk5BVElPTkFMIFBURS4gTFRELiIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiOVNiUXFhY2g5T2J3dkV3OEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBHcmFiSm9icyIsImxpbmsiOiJodHRwczovL2dyYWJqb2JzLmNvL3NpbmdhcG9yZS9qb2IvcGFydC10aW1lL3RlY2hub2xvZ3kvYW5hbHlzdC1wcm9ncmFtbWVyLWphdmEtMjE5NjQ2Mz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Assistant / Analyst Software Programmer - Accounting Firm", "company_name": "3E Accounting Pte Ltd", "location": "Singapore (+1 other)", "via": "via 3E Accounting", "description": "3E Accounting Singapore is currently looking to appoint an Assistant / Analyst Software Programmer to join their company digital R&D team in Singapore office.\n\n3E Accounting Pte Ltd aims to be the leading corporate service provider and top accounting firm in Singapore providing One-Stop Solution services for our clients.\n\n3E Accounting Pte Ltd, Singapore is the global headquarters of 3E Accounting International, an International Accounting network with a global presence in more than 80 countries worldwide.\n\nOur Mission\nTo offer the Three Es: efficiency, effectiveness and economy, all part of our One-Stop Solution services for our clients.\n\nOur Vision\nThe World’s leading corporate service provider, offering services beyond excellence.\n\nRemuneration is commensurate with qualifications and work experience. Qualified and interested candidates should email their resume to info@3ecpa.com.sg\n\nPlease state your current and expected salary.\n\nJob Responsibilities:\n\n• Assist in all major... in-house application systems development and operational enhancement and system upgrade\n• Participant in all stages of system development life cycle\n• Design, develop and implement feasible systems to improve operation and automation to further business objective and processes\n• Produce detailed programming specifications, coding of programmes, system testing, documentation and implementation of in-house developed system.\n• Work with internal business users to define user requirements\n• Discuss with management to determine IT objectives that will improve business outcome and processes\n• Prepare, develop, plan coordinate and administrate User Acceptance Testing (UAT) and pilot runs application software.\n• Provide assistance and support to all IT related systems.\n• Any other ad-hoc duties as required or assigned\n\nRequirements:\n\n• Degree in Computer Science, Information Technology or related degrees\n• Prior experience in software application development is preferred\n• Self-motivated with the ability to prioritise, meet deadlines and manage changing priorities", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBc3Npc3RhbnQgLyBBbmFseXN0IFNvZnR3YXJlIFByb2dyYW1tZXIgLSBBY2NvdW50aW5nIEZpcm0iLCJjb21wYW55X25hbWUiOiIzRSBBY2NvdW50aW5nIFB0ZSBMdGQiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IkEyOEVFdHVIX2dHR25yODBBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gM0UgQWNjb3VudGluZyIsImxpbmsiOiJodHRwczovL3d3dy4zZWNwYS5jb20uc2cvY2FyZWVycy9hc3Npc3RhbnQtYW5hbHlzdC1zb2Z0d2FyZS1wcm9ncmFtbWVyLz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Programmer Analyst", "company_name": "AVENSYS CONSULTING PTE. LTD.", "location": "Singapore (+1 other)", "via": "via LinkedIn", "description": "Avensys is a reputed global IT professional services company headquartered in Singapore. Our service spectrum includes enterprise solution consulting, business intelligence, business process automation and managed services. Given our decade of success we have evolved to become one of the top trusted providers in Singapore and service a client base across banking and financial services, insurance, information technology, healthcare, retail and supply chain.\n\nWe are currently looking to hire Technical Architect (Window 10) who has proven track record in IT Industry. This is an exciting opportunity to expand your skill set, achieve job satisfaction and work-life balance. More details as below.\n\nResponsibilities\n• Translate application requirements and use cases into functional applications\n• Design, build, and maintain efficient, reusable, and reliable Java code\n• Ensure the best possible performance, quality, and responsiveness of the applications\n• Identify bottlenecks and bugs, and... devise solutions to these problems\n• Help maintain code quality, organization, and automatization\n\nSkillset\n• 3 years demonstrated advanced proficiency in development methodologies.\n• Proficiency in J2EE, J2SE, EJB, Java Servlets, Java Beans, JMS, JNDI, ANT and Apache Maven.\n• Proficient with Core Java concepts such as OOP concepts\n• In-depth knowledge of HTML, JavaScript including frameworks such as JSON , JQuery, and CSS.\n• Experience with setup and management of large scale application servers.\n• Experience in implementing WOGAA and IM8 Standards\n• Experience with databases such as Oracle Database PL/SQL, Microsoft SQL Server, DB2Self-management and strong organization skills.\n• Experience in Amazon Web Service (AWS) environment. Having AWS certification would be advantage.\n• Experience in CI/CD process. Having knowledge about Bitbucket, Bamboo, Maven and JUnit would be advantage.\n• Proven track record to work to strict client deadlines.\n• Excellent presentation and communication skills (to both technical and non-technical audiences, written and verbal)\n\nWhat’s On Offer\n\nYou will be remunerated with an excellent base salary and entitled to attractive company benefits. Additionally, you will get the opportunity to enjoy a fun and collaborative work environment, alongside a strong career progression\n\nTo submit your application, please apply online or email your UPDATED CV in Microsoft Word format to ******** Your interest will be treated with strict confidentiality.\n\nConsultant Details\n\nConsultant Name : Shilpa Benkin\n\nAvensys Consulting Pte Ltd\nEA Licence 12C5759\n\nPrivacy Statement: Data collected will be used for recruitment purposes only. Personal data provided will be used strictly in accordance with the relevant data protection law and Avensys' privacy policy.\n\nJob originally posted on GrabJobs. If you need to report this job please contact GrabJobs", "extensions": ["2 days ago", "Internship"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Internship"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9ncmFtbWVyIEFuYWx5c3QiLCJjb21wYW55X25hbWUiOiJBVkVOU1lTIENPTlNVTFRJTkcgUFRFLiBMVEQuIiwiY29tcGFueV9taWQiOiIvZy8xMWc3MDIyZ2pmIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoia0RhX1RYZ0hoVk1ybE9vZ0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRW9zQ0Nzd0JRVTVWWDA1eFVXaFRhaTFxYUd4bllpMW5kV1l3ZWpaR04zbDZhWFYwUlZGbE1tb3lNRWxHWkd4eVRYZEJiSEZmU2s5Wk9XRXpSRk5UTURsdVRtdHhRMjlzT0ZrNGNuaGFOMjl4ZEdWSk9FVTVaakpxTkRaTmFUZ3ljbFUyVldsWGNGaHhZMFp0UjBOVVFuTXpkekZvWkhaVVVWa3RlVlZtTnpabE9IRXhXVEJyTWpCamNHUm5NbGQyYVVaRmRXTTFYMTl1ZFRNMmNWSTRhR3B2ZFhaSWEzSTJha0ZXYzI4Mk1HRnFkMmcxUTFFNFRFWmZVMlJLYjIwMVVEWjFWVXhGUTJObGIxQnBSRmhyWjBwRkVoWmpXRzFEV1VwUE1VOWhla05zZDFSSk4ySlBVVUYzR2lKQlQwMVpVbmRFVkRGM01uTlFObWRTYzBOdFdtRm1SVWs0VWxsclFWTXRaREozIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMTciLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGlua2VkSW4iLCJsaW5rIjoiaHR0cHM6Ly9zZy5saW5rZWRpbi5jb20vam9icy92aWV3L3Byb2dyYW1tZXItYW5hbHlzdC1hdC1hdmVuc3lzLWNvbnN1bHRpbmctcHRlLWx0ZC0yNTE0NDYxMzUyP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Software Engineer (Web, Frontend, Backend, Full-Stack)", "company_name": "Surer", "location": "Singapore", "via": "via Glints", "description": "Get a more meaningful career with us 🚀\n\nSurer is an InsurTech startup that will revolutionise the way the General Insurance industry manages their entire workflow, from an agent advising their clients (the end policyholder) to how the Insurer distributes their products.\n\nAnd as a Software Engineer, you get to be a part of the revolution! We are building delightful experiences for insurance intermediaries and some of the biggest insurers out there, and this role at Surer only means you design, build, and ship for them! At Surer, you can take on big responsibilities to solve some of today's greatest problems in the Insurance industry.\n\nIt does not matter if you're stronger in frontend, backend, or both; as long as you're passionate about and skilled at building web products, there's a place for you!\n\nResponsibilities\n\nWe are looking for a talented and self-driven Software Engineer who has the nous to think out-of-the-box and make use of the great flexibility we provide to our team - to... make a big difference for the Insurance industry and empower the parties within this ecosystem.\n\nYour day to day task will be focused on working directly with our CTO and the founding team and be on the leading front to develop new features, suggest better processes, re-engineering and testing of functionalities.\n\nIn summary, you will:\n• Design, develop, test, deploy, maintain and improve our full-stack web software\n• Coding: consistently write production-ready code that is testable, easily understood by other developers, and accounts for edge cases and errors, with scalability and performance in mind.\n• Testing: write unit tests as well as higher-level tests in accordance with it.\n• Debugging: proficient at debugging systematically to diagnose all issues located to a single service\n• Collaborate closely with our product designer, product owner, and other engineers based on Agile principles and work with tool sets such as JIRA (or similar issues management systems) while keeping an eye out for emerging technology trends and developments.\n• Technical documentation\n\nExperience and Skill Sets\n\nMust have:\n• Bachelor’s Degree in Information Technology, Computer Science or equivalent\n• Preferably at least 1 year of experience in software development, working on business applications, however fresh grads will be considered as well\n• Knowledge or experience in full stack web application development with a variety of languages including but not limited to .Net Core, Javascript, HTML and CSS\n• Knowledge or experience in the concept of web development such as HTTP, HTTPS protocols, backend code integration with frontend code via RESTful APIs\n• Experience in dealing with Git repo\n• Value high quality code and you want to satisfy your thirst for knowledge of the latest technologies every day\n• Strong understanding of good software engineering practices (version control, code reviews, testing, refactoring etc.)\n• Able to understand and communicate ideas clearly with team members\n\nNice to Have:\n• Knowledge or experience in DevOps and in using the surrounding ecosystem of tools\n• Knowledge or experience in working in an agile development environment and familiar with being in a SCRUM team\n• Good grasp of security principles, and develops with a security-first mindset\n• CI/CD practices\n• Familiar with frameworks such as jQuery, Bootstrap\n• Able to work independently as well as in a team\n• Able to multitask in a demanding, fast paced environment and work with minimal supervision to meet deadlines\n• Knowledge or experience in TDD (Test Driven Development) and/or BDD (Behaviour Driven Development)\n• Knowledge or experience in building Microservices\n• Knowledge or experience in Domain Driven Design (DDD)\n\nWhat you can get out of us\n• Exposure to a fast-paced, yet fun, startup culture\n• Work directly with the founding team and have autonomy to make certain decisions\n• Opportunity to develop industry-changing products\n• Gain knowledge and experience in the InsurTech and FinTech industry\n• Flat team structure with no office politics\n• You will be engaged in conversations about the business to have a broader perspective of the value of your work as an engineer\n• We are a young startup and so have many interns in the team - they will look to you for guidance, which is an opportunity to hone your leadership skills\n\n---\n\nAbout Surer\n\nSurer is a cloud-based, web platform with a market-first technology in the region, that helps all parties in the General Insurance industry automate processes and drive network collaborations, enabling them to provide better service and support to their clients. Launched in August 2020 in Singapore, Surer was founded by a group of professionals with years of experience in the Insurance industry who are passionate about solving inefficiencies within the General Insurance industry as it was a problem they had faced as well. Surer is certified by the Singapore FinTech Association as an InsurTech service provider and is one of the portfolio companies funded by Antler, a global early-stage venture capital firm that invests in the defining technology companies of tomorrow. Visit https://surer.sg/ for more information or read about us in the media at https://surer.sg/category/in-the-news/.\n\nAbout the founders\n\nFounded by Gordon, Derren and Renfred, we have held positions to grow the business in highly successful startups like PropertyGuru and Carousell, successfully founded and exit-ed from a VendTech startup, ShakeSalad, while also having careers in major insurance companies like AIG, MSIG and QBE. One of us is even an Asian Games Gold Medalist", "extensions": ["10 days ago", "$3.5K–$5K a month", "Full–time"], "detected_extensions": {"posted_at": "10 days ago", "schedule_type": "Full–time", "salary": "$3.5K–$5K a month"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciAoV2ViLCBGcm9udGVuZCwgQmFja2VuZCwgRnVsbC1TdGFjaykiLCJjb21wYW55X25hbWUiOiJTdXJlciIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoidUltZGJnN0tWMGp6U19GN0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBHbGludHMiLCJsaW5rIjoiaHR0cHM6Ly9nbGludHMuY29tL3R3L29wcG9ydHVuaXRpZXMvam9icy9zb2Z0d2FyZS1lbmdpbmVlci13ZWItZnJvbnRlbmQtYmFja2VuZC1mdWxsLXN0YWNrLzJiOWUyNzM3LTgyYTAtNDE1ZC1iYTFhLTU0MTUzNzg5ZTJlZj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Software Engineer/ Associate Consultant/ Lead Engineer/ Senior Software Engineer/ Consultant", "company_name": "HCL SINGAPORE", "location": "Singapore (+1 other)", "via": "via MNC Jobs Singapore | MNC Jobs In Singapore", "description": "More than 3+ years’ experience in Merck SDLC development and GATE support Program.\n\nMust be able to develop a dashboard or analytics reports using CRM OD.\n\nExperience required in Oracle CRM On Demand Integration.\n\nAnalyze/troubleshoot the SSIS jobs used for ETL.\n\nGood to have understanding of VEEVA architecture, data model and security model\n\nAble to translate business requirements into technical specifications\n\nGood to have experience in ITIL Process like Incident, Knowledge, Change and Release management\n\nLead life sciences customers in the rapid configuration ,implementation and project Management of the Vault Regulatory software suite (Vault Registrations, Vault Submissions, Vault Submissions Archive, Vault Publishing)\n\nArchitect multi-phased implementation programs to deploy Vault RIM across an organization globally\n\nDigital Marketing & Channels – Pharmaceutical Consent Hub data process flow experience (must)\n\nManage/lead the project for Vault PromoMats Setup and administer Veeva... development, deployment and CRM/ PromoMats integration\n\nExperience working with Zinc\n\nVeeva Sample management process expertise\n\nExpertise in managing the Project related Veeva campaign Management, remote interaction.\n\nPrimary customer liaison managing relationships and communication between the project team, customer and internal stakeholders\n\nProgram and project management including resource planning, leading and motivating a cross-functional team, and project tracking and forecasting\n\nCollate and share life sciences industry best practices with our customers around commercial excellence. Evangelize Multichannel customer relationship management in the life sciences industry.\n\nMandate Skills\n\nCertified Project Management Professional from PMI\n\nCertified in Veeva CRM\n\nExperience in Veeva Vault\n\nMust delivered program budget ranging USD 10 Mil\n\nWell Versed with multiple module program Integration\n\nGood Experience in working in Pharma domain\n\nWell versed with GxP Guidelines\nMSPS, IVE, MSP\n\nGxP Guidelines, LOMA Nomenclarure, SOX guidelines.\n\nVeeva Vault\n\nOracle CRM OD certification\n\nVeeva CRM\nOracle, MYSQL\nSituation Intelliegence tool\n\nGOOD to HAVE\n\nOracle CRM OD certification\n\nVeeva Vault\n\nTechnical / Professional Skills\n\nIoT, Blockchain, Enterprise Architect\n\nNon-Technical / Soft Skills\n\nExcellent Communication skills & a team leader.\n\nProven ability to work with people from different cultures\n\nA high level of intelligence; ability to operate not only on the basis of important past experiences, but in the light of the approaches and developments that occur in the market.\n\nNatural problem solving inclination\n\nHigh level presentation and interpersonal skills\n\nExperience decomposing complex problems into component parts for effective problem solving", "extensions": ["28 days ago", "Full–time"], "detected_extensions": {"posted_at": "28 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlci8gQXNzb2NpYXRlIENvbnN1bHRhbnQvIExlYWQgRW5naW5lZXIvIFNlbmlvciBTb2Z0d2FyZSBFbmdpbmVlci8gQ29uc3VsdGFudCIsImNvbXBhbnlfbmFtZSI6IkhDTCBTSU5HQVBPUkUiLCJjb21wYW55X21pZCI6Ii9tLzA2OThndiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjIyR1ZDdzY2UE8wak1RQUdBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhWRTlCYTBSc2JtbGtkMDlPWjBoMFkySlFiVmRJUkhablNqUm5lbFZKTkhJM2NFc3hZMmxIY1dRNFVGcDBhMmRJYTNOSkxVZEJMWEJLUkcxU2VuZFdNM015U3pONVUyNVJRWHBwZWtVeVVUTlpSbXhmZGxGdVJUVjJWelJ5UTE5eU9Xb3RaV0ZaVFZKSGRFVTVlWFY2VHpoWlNGTTNkVmxTZVd0U1YyaFRUMUZWVlVodVJqbEVVRWc0UmpCTWIzSkxRV2xPWVdkWWNXNUVZVXRSRWhaaldHMURXVXBQTVU5aGVrTnNkMVJKTjJKUFVVRjNHaUpCVDAxWlVuZENUVVJPVGpKSVprZGtZa290TkhFemRGSlZiVXRKTlZwbFdtOVIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18zMSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNTkMgSm9icyBTaW5nYXBvcmUgfCBNTkMgSm9icyBJbiBTaW5nYXBvcmUiLCJsaW5rIjoiaHR0cHM6Ly9zZy5tbmNqb2J6LmNvbS9qb2JzL3NvZnR3YXJlLWVuZ2luZWVyLWFzc29jaWF0ZS1jb25zdWx0YW50LWxlYWQtZW5naW5lZXItc2VuaW9yLXNvZnR3YXJlLWVuZ2luZWVyLWNvbnN1bHRhbnQtb3V0cmFtLTM1Mzk3Nz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Software Applications Developer (.Net) #SGUnitedJobs at PetroChina", "company_name": "PetroChina", "location": "Singapore", "via": "via BizLINKS Resources Pte Ltd", "description": "Software Applications Developer (.Net) #SGUnitedJobs at PetroChina\n\nEmployer Referral\n\nJob Description\n\nResponsibilities Performs requirements gathering, alternative analysis and applies modelling & systems design techniques, develops test cases and plans, executes system testing & validation of results leading to the development of “fit-for-purpose” solutions that address the business needs. Assists in requirements study, documentation and analysis of end-users needs required in the capturing/identification/conception of business problem and use cases. Develop alternatives and drive the selection analysis of a fit-for-purpose solution to address the users' requirements. Create detailed systems designs, apply .NET or suitable programing languages in the development of the components, modules and interfaces leading to the system/application that meets the functional specifications that fulfil the users' requirements. Applies information protection standards, defines & develops test... cases and plans, executes system testing & validation of results, in the acceptance of the developed system/application by the users. Performs error logging and maintenance of systems with correction of reported bugs and other works required in the upkeep of the system/applications in production. Other relevant software development tasks or duties assigned as part of PCSG IT Application Team and contract staff of PCSG. Requirements Diploma/Degree in Computer Science or Information Technology or related studies. At least 2 - 5 years of software and application development & support experience as a coder and s/w designer with substantial know-how and hands-on experience in areas of work such as: - Software Application programming using .NET languages (C#, VB .NET) with knowledge of SQL and working with databases, API and other systems interfaces in the implementation of web, desktop or mobile applications. Microsoft Certified Professional Developer (MCPD) or other professional software qualifications relevant in software/application development is a plus. Working knowledge of RESTful web services, MVC architecture, Data Visualization tools such as PowerBI & low code development technologies such as Microsoft Power Platform of Applications. Experience on the following is a definite advantage: Entity Framework, WCF, MVC, WPF, AngularJS, Bootstrap. Participated in project and change management of IT systems using Agile and Scrum principles and processes. Full stack, frontend/backend software development Please write in with a full resume, present and expected salary, contact telephone number(s) and any other relevant information to: Email: This email address is being protected from spambots. You need JavaScript enabled to view it. document.getElementById('cloakeb53433fd7030fc23b5137856252ebd9').innerHTML = ''; var prefix = 'ma' + 'il' + 'to'; var path = 'hr' + 'ef' + '='; var addyeb53433fd7030fc23b5137856252ebd9 = 'hr' + '@'; addyeb53433fd7030fc23b5137856252ebd9 = addyeb53433fd7030fc23b5137856252ebd9 + 'petrochina' + '.' + 'com' + '.' + 'sg'; var addy_texteb53433fd7030fc23b5137856252ebd9 = 'hr' + '@' + 'petrochina' + '.' + 'com' + '.' + 'sg';document.getElementById('cloakeb53433fd7030fc23b5137856252ebd9').innerHTML += ''+addy_texteb53433fd7030fc23b5137856252ebd9+''; Only shortlisted candidates will be notified. Personal Data Protection In submitting your personal data and/or resume, you shall be deemed to consent to us collecting, using and disclosing your personal data for the purpose of assessing your job application. Information collected may also be disclosed to the PetroChina Group of Companies (which includes PetroChina International (Singapore) Pte. Ltd., Singapore Petroleum Company Limited, Chinaoil (Singapore) Pte. Ltd.) for this purpose. Show more\n\nOriginal Joblink : https://sg.linkedin.com/jobs/view/software-applications-developer-net-%23sgunitedjobs-at-petrochina-2202440408", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBBcHBsaWNhdGlvbnMgRGV2ZWxvcGVyICguTmV0KSAjU0dVbml0ZWRKb2JzIGF0IFBldHJvQ2hpbmEiLCJjb21wYW55X25hbWUiOiJQZXRyb0NoaW5hIiwiY29tcGFueV9taWQiOiIvbS8wNHF4aHYiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJMZWhiRWRXdUFRMTZGRS10QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VVZweWNXRmxMVUpoUkRSQ1VISkpYelpUWjB0WWQydEVTemhtV1RKSWRuSnRXbVphWjI1RWVVaG5SelY2WldkV2JWOTNSelpPVWt0UVR6ZFFUWGRTYjNwYVdHSXdRMjFoTkc0elRFWXhOR0ZvZUdac2NFaGlhMW8xVW5acmFuQkJSMlpqVWpCRVJrVjBhbUZWYUdGRllrOXJVa1JaZWtkeGVYSnJPVWhvVUU1dFExRXdhMDFrYjB0VU0xVk9TMWxZVXpsNU5IY3dOSGxDWlZCbkVoWmpXRzFEV1VwUE1VOWhla05zZDFSSk4ySlBVVUYzR2lKQlQwMVpVbmRDVW5jMGNYTTFlbVJ2WmtsM1ZsTXhjRGRJV0VGdE9IWkVSR1ZCIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMzgiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQml6TElOS1MgUmVzb3VyY2VzIFB0ZSBMdGQiLCJsaW5rIjoiaHR0cHM6Ly93d3cuYml6bGlua3NyZXNvdXJjZXMuY29tLnNnL2luZGV4LnBocC9qb2ItbGlzdGluZ3MtcHVibGljLzkyLXNvZnR3YXJlLWVuZ2luZWVycy8zOTcxLXNvZnR3YXJlLWFwcGxpY2F0aW9ucy1kZXZlbG9wZXItbmV0LXNndW5pdGVkam9icy1hdC1wZXRyb2NoaW5hP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Software Developer 4", "company_name": "Techgig", "location": "Singapore", "via": "via Mendeley", "description": "About Job\n\nCTC Undisclosed Job Location Singapore Experience 8 - 10 yrs\n\nDescription\n\nResponsibilities:\n\nManage large global virtual infrastructure (Oracle VM and VMware), including hypervisor installation, patching, and troubleshooting.\n\nPerform hardware/software installation (including new datacenter buildouts and capacity expansions), system configuration, and upgrades of high availability Oracle VM, Linux and Windows systems.\n\nCreate and update technical documentation (server configuration, backup and recovery procedures, etc.).\n\nProvide Systems escalation support to the Operations Center.\n\nPerform Disaster Recovery and High Availability testing of Oracle VM and VMware environments and maintain related documentation.\n\nManage multiple on-going concurrent projects.\n\nFollow Change Management and generic datacenter related policies and procedures.\n\nAutomate repetitive tasks on both Windows (using PowerShell, batch, and/or VBscript) and Linux servers (using Bash, Perl, and/or... Python).\n\nAnalyze performance statistics (cpu, memory, disk I/O, network throughput/latency, etc.) and implement solutions to resolve issues should they occur.\n\nProvide mentoring and direction for junior engineers/admins.\n\nQualifications:\n\nDegree in Computer Science, Information Systems or equivalent combination of relevant experience.\n\n5 or more years of experience managing large virtual environments (Oracle VM or Vmware)\n\n8-10 years of work experience as a System Engineer in Linux and Windows environments\n\nStrong experience with Virtual Infrastructure management - Oracle VM (preferred) or VMware\n\nAbility to apply critical thinking/problem solving skills in order to resolve complex technical issues in a timely fashion\n\nExcellent verbal and written communication skills (English)\n\nCustomer focused and team oriented\n\nAbility to effectively prioritize and execute tasks in a high-pressure environment\n\nPreferred additional skills:\n\nCertification(s) in Linux administration such as LPIC, RHCSA or LFCS\n\nGood hands-on experience on Oracle/SUN, HP, Dell, IBM Hardware\n\nFamiliarity with Payment Card Industry Data Security Standard (PCI DSS) audits and remediation\n\nWillingness to learn new technologies\n\nExperience with Configuration management tools like Chef or Puppet\n\nExperience with version control environment, like SVN or Git\n\nDetailed Description and Job Requirements\n\nDesign, develop, troubleshoot and debug software programs for databases, applications, tools, networks etc.\n\nAs a member of the software engineering division, you will take an active role in the definition and evolution of standard practices and procedures. You will be responsible for defining and developing software for tasks associated with the developing, designing and debugging of software applications or operating systems.\n\nWork is non-routine and very complex, involving the application of advanced technical/business skills in area of specialization. Leading contributor individually and as a team member, providing direction and mentoring to others. BS or MS degree or equivalent experience relevant to functional area. 7 years of software engineering or related experience", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBEZXZlbG9wZXIgNCIsImNvbXBhbnlfbmFtZSI6IlRlY2hnaWciLCJjb21wYW55X21pZCI6Ii9nLzExYzczZnhnd3QiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiI3bUZMb3RTYjlsU1laSXM5QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VW1zNE0yVlpVekF3V0UxNVVHMWZXbVZhYTBaM1ZVOXJiMFpaVlZaNU9VNU1TREJGY1ZWWk5XeDNNRGxJY1Voa1JXUmFNVUpXUkhFM1YxQkRaakU1VTAxS2FXbERNbWhCUVhwWVlWQjZlVVY1ZW1GNGExVnNXRlZNYnpCQmMydGxTM0F0WlVjMGRVbFdVM0pDZURkeE1rVlFSMU5CU3pWUWR6VTBWMlJhYlU1eU5HSlJSVlEzTXpoT1lYTkhVek5oVjNCd1ZsWkxka3hOZEhSQkVoWmpXRzFEV1VwUE1VOWhla05zZDFSSk4ySlBVVUYzR2lKQlQwMVpVbmRFU2pobFlrSnlUa3hRVDJNemExUjBWVlI1TjFWUk4zTkJNbmRuIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNDYiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTWVuZGVsZXkiLCJsaW5rIjoiaHR0cHM6Ly93d3cubWVuZGVsZXkuY29tL2NhcmVlcnMvam9iL3NvZnR3YXJlLWRldmVsb3Blci00LTMwNjUzNzU/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Microsoft Engineer​/Share Point", "company_name": "D2X EXPERTISE PTE. LTD.", "location": "Singapore", "via": "via Learn4Good", "description": "Position: Microsoft Engineer (Share Point)\nRoles &\n\nResponsibilities\n\nThe Engineer will join the Infrastructure Production Services Department. He will cover the Following services :\n\nEngineer Mail services (lotus, Microsoft Exchange, outlook), Mobile device Management, DLP and other Microsoft environment (SharePoint,Skype,...)\n\nAs part of his job , he will :\n\n- Be responsible for the implementation and management of system and services in supporting client's messaging platform consisting of Lotus Notes, Lotus Domino, and SMTP.\n\n- Take in charge the Outlook migration,\n\n- Be responsible for architectural development, planning, and implementation of the overall strategic goals of systems.\n\n- Identify, evaluate, implement, and support related technologies such as but not limited to messaging web access, instant messaging, and collaboration and unified messaging.\n\n- Provide support in the areas of Lotus software products standardization, leveraging of mailboxes management and capacity... planning. This includes but is not limited to Lotus Notes/Domino, Sametime, and Quick\n\nPlace.\n\n- Respond to requests from users (as Level 2 and 3 of the escalation procedures) and assist in deploying/configuring systems so as to conform to our infrastructure standards.\n\n- Provide resolution of more complex issues escalated from the support helpdesk and provide extra frontline support capacity as directed. Candidate criteria : - Minimal education level Bachelor Degree / BSc Degree or equivalent\n\nAcademic qualification / Speciality - Microsoft certified and migration experience 5+ years' experience in Microsoft administration\n\n- Level of minimal experience 6-10 years Experience - Minimum 5 years Microsoft Exchange/outlook experience. MCSE certification is a plus.\n\n- Minimum 5 years' experience in DLP. Required skills Hard skills\n\n- Good understanding of DNS, E-Mail Routing, Email Tracking, SMTP / application Mail Relay,Backup and Restore, Disaster Recovery concepts - Single item, single mailbox, Exchange Server, Exchange Site\n\n- In-depth knowledge of various features and configurations available in Exchange 2016, Roles and Services of Exchange 2010, High availability (DAG), Public Folder Management, Messaging Policies and Compliance, Configuring Reporting and Logging, Permissions and Role Based Access Control (RBAC), Transport Rules\n\n- Good understanding and work experience of Anti-Spam and Anti-virus applications and products like various email gateways, IronPort, proof point, Exchange online protection Soft Skills\n\nAbility to understand Enterprise Architecture concept\n\n- Knowledge of ITIL framework\n\n- Excellent analytical problem solving\n\n- Proactive with strong teamwork and interpersonal skills\n\n- Excellent communication skills\n\n- Autonomy, curiosity and fast adaptation to changes\n\n- Innovative and creative thinker\n\nTechnical skills required - Mobile Device Management solutions (AirWatch.)- MS Active Directory / Domain\n\n- Knowledge of Exchange Shell, VBS and windows Power\n\nShell scripting\n\n- Knowledge on Active Directory Object Administration and Management\n\nLanguages Français and Anglais\n\nTell employers what skills you have\n\nBanking\n\nEngineering\n\nManagement\n\nMicrosoft\n\nMicrosoft Outlook\n\nMobile\n\nPrivate Banking\n\nProduction\n\nMS-Exchange\n\nLotus Software\n\nMail Services", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJNaWNyb3NvZnQgRW5naW5lZXLigIsvU2hhcmUgUG9pbnQiLCJjb21wYW55X25hbWUiOiJEMlggRVhQRVJUSVNFIFBURS4gTFRELiIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiTXFmUzc5X3k0VTc0S01aMkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMZWFybjRHb29kIiwibGluayI6Imh0dHBzOi8vd3d3LmxlYXJuNGdvb2QuY29tL2pvYnMvc2luZ2Fwb3JlL2luZm9fdGVjaG5vbG9neS8yNzEyNzk2NzAvZS8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Software Developer [Mobile Application / West]", "company_name": "Reeracoen Singapore Pte Ltd", "location": "Singapore", "via": "via Joblum Singapore", "description": "Mobile App Software Developer\n(Job Ref. 31127)\nOur client is a reserach and development company. The role of a Mobile App Software Engineer (IOS/Android) is to\ntest, debug, and improve applications (IOS/Android) for clients and often collaborate with product and design teams.【What you will be working on】\n• Develop iOS apps with Swift and Android apps with Java using Android Studio.\n• Maintain and update iOS/Android apps\n• Maintain internal and external testers and release beta apps to TestFlight.\n• Responsible to deploy the latest iOS apps and Android apps\n• Design and develop front-end and back-end mobile application.\n• Participate in brainstorming sessions with team members to develop web and mobile applications.\n【What they are offering】\n• Bonus - Individual performance bonus and company performance bonus\n• Annual Leave 10 days during the 1st year\n• Medical Leave 14 days\n• Medical Insurance\n• Medical Allowance: $600/year\n• Transportation Allowance\n• Mobile Allowance\n【What they are... looking for】\n• Minimum Diploma in IT or relevant certification\n• 2 years of experience in software development\n• Knowledge of C-Language, Java, MySQL, Database and JavaScript\n• Either IOS or Android experience\n• Knowledge of Swift, Android, Adobe Photoshop, PHP and HTML will be added advantage\n• Good interpersonal skills, strong analytical and problem-solving skills\n========================================================\nFor interested applicants, kindly indicate the following in your resume in order for us to process your application faster.\n1. Reason for leaving past and present employment(s)\n2. Expected / Last drawn salary\n3. Availability date\nInterested candidates, kindly email resume (with stated job position and Ref No.) & cover letter to: sam@reeracoen.sg.\nWe regret that only shortlisted candidates will be notified.\nRegistration No.: R1879295 (Sim Ting Feng)\nRecruitment License : 12C5051", "extensions": ["16 days ago", "Full–time"], "detected_extensions": {"posted_at": "16 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBEZXZlbG9wZXIgW01vYmlsZSBBcHBsaWNhdGlvbiAvIFdlc3RdIiwiY29tcGFueV9uYW1lIjoiUmVlcmFjb2VuIFNpbmdhcG9yZSBQdGUgTHRkIiwiY29tcGFueV9taWQiOiIvZy8xMWc3eV84d18zIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoic0ZYOXdES0d4X1pieEVta0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRW9zQ0Nzd0JRVTVWWDA1eFVVUm1kVEZGZWw5WFVXSndYMDlCVDAxeVlreHJRbFpwVkRGSlNqVk1PVEJqYlhOd1IxWmZkWHBOZEZZeFRVazBWa1JXWHpoTVkwUndXVWRMTFRFd1NYWnVWbkp4Ums5emVHMXRhR2N3UlVOc1FVbEtTMFY0TFc1MGMxbGFlakZ5ZW5veVZHbFlNSGxXTm5GVE9XdFNXRWRpUzBWUGJubG1WR1JyWTFCNFMwaGphVloxWmpoMFptRnVSMmRxVG1aRVVucFJRazh5ZWtOVE9XOHpaR0ZyWDNWRUxVUktTMVJtWkd4MGRqUnJWbFJZVUVOWFdGY3lUMEptUm5Gb1RsVXpRWFZ5YVRSakVoWmpXRzFEV1VwUE1VOWhla05zZDFSSk4ySlBVVUYzR2lKQlQwMVpVbmRCZHpac2RuTnBSV3RWWkhwRWFUQmxVSFpHT1dGWGJsVjVVVmRCIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNTgiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9ibHVtIFNpbmdhcG9yZSIsImxpbmsiOiJodHRwczovL3NnLmpvYmx1bS5jb20vam9iL3NvZnR3YXJlLWRldmVsb3Blci1tb2JpbGUtYXBwbGljYXRpb24td2VzdC82MDMyMDA/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Software Engineer", "company_name": "OneEmpower", "location": "Singapore (+1 other)", "via": "via Jobsingapore24h.com", "description": "Job Description\n\nBe a member of a team of professional Java developers providing state-of-the-art software applications to the consumer transactions industry, covering payments, stored-value applications and CRM marketing. The job provides interested individuals with a wide range of freedom to be creative, to develop applications used by millions of customers everywhere.\n\nRequirements\n• Candidate must possess at least a Diploma or Advanced/Higher/Graduate Diploma or Bachelor’s Degree in Computer Engineering, Computer Science, Information Technology or equivalent\n• Experience in developing software using J2SE and J2EE with Oracle\n• Familiar with SQL and Oracle database, PostgreSQL\n• Good understanding of Object Oriented Programming and concepts\n• Good knowledge of HTML, XML, Web Services, JSP, Servlets, JSON, Spring, Hibernate\n• Good understanding of UML, SDLC and software design concepts\n• Candidates with Java programmer/developer certification is an added advantage\n• Candidate with... mobile application development experience (Android and iOS) will have added advantage\n• Must be able to function well as a team member in a project and sourcing for technical solution independently\n• Able to self-motivate to pick up new skills and programming languages\n• Expected to perform well under tight project deadlines\n• Demonstrate good communication and analytical skills", "extensions": ["Over 1 month ago", "Contractor"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Contractor"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciIsImNvbXBhbnlfbmFtZSI6Ik9uZUVtcG93ZXIiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Ik03TmItaVItN0UzbURPOFRBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9ic2luZ2Fwb3JlMjRoLmNvbSIsImxpbmsiOiJodHRwczovL2pvYnNpbmdhcG9yZTI0aC5jb20vZnIvc29mdHdhcmUtZW5naW5lZXItam9iMTMxNjg/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}], "chips": [{"type": "Title", "param": "job_family_1", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Software engineer", "value": "software engineer"}, {"text": "Programmer", "value": "programmer"}, {"text": "Programmer analyst", "value": "programmer analyst"}, {"text": "Senior", "value": "senior"}, {"text": "Cnc programmer", "value": "cnc programmer"}, {"text": "Engineer", "value": "engineer"}, {"text": "Analyst programmer", "value": "analyst programmer"}, {"text": "Science", "value": "science"}, {"text": "Software programmer", "value": "software programmer"}, {"text": "Assistant", "value": "assistant"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Electrical engineer", "value": "electrical engineer"}, {"text": "Executive", "value": "executive"}, {"text": "Java programmer", "value": "java programmer"}, {"text": "Lecturer", "value": "lecturer"}, {"text": "Manager", "value": "manager"}, {"text": "Operator", "value": "operator"}, {"text": "Project officer", "value": "project officer"}, {"text": "Senior programmer", "value": "senior programmer"}, {"text": "Senior system", "value": "senior system"}, {"text": "Senior technical", "value": "senior technical"}, {"text": "Sr. programmer", "value": "sr. programmer"}, {"text": "Systems programmer", "value": "systems programmer"}, {"text": "Technical", "value": "technical"}, {"text": "Trainee", "value": "trainee"}, {"text": "Trainer", "value": "trainer"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Mining", "value": "/business/naics2007/21"}, {"text": "Rental", "value": "/business/naics2007/532"}, {"text": "Wholesale", "value": "/business/naics2007/42"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "EPAM", "value": "/m/0dlnrc"}, {"text": "VISA", "value": "/m/01kqjn"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "Citi bank", "value": "/m/01dfb6"}, {"text": "TikTok", "value": "/g/11fy265933"}, {"text": "Ubisoft", "value": "/m/02qdyj"}, {"text": "Cognizant", "value": "/m/03bf9h"}, {"text": "J.P.Morgan", "value": "/m/01hlwv"}, {"text": "Nanyang Technological University", "value": "/m/0l49k"}, {"text": "Credit Agricole Group", "value": "/m/028vbm"}, {"text": "Mindteck (India) Limited", "value": "/m/0cqj8w1"}, {"text": "Oracle", "value": "/m/05njw"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Avensys Consulting Pte Ltd", "value": "/g/11g7022gjf"}, {"text": "Avnet", "value": "/m/0c8xmc"}, {"text": "GlobalTix Pte Ltd", "value": "/g/11dxpqdhrf"}, {"text": "GovTech", "value": "/g/11gh0528nq"}, {"text": "NetSuite Inc", "value": "/m/05n952"}, {"text": "OakTree Consulting", "value": "/g/11g70jfhtq"}, {"text": "Optimum Solutions (Singapore) Pte Ltd", "value": "/g/11g70hkrbx"}, {"text": "Razer Inc.", "value": "/m/075hc0"}, {"text": "Realtek Malaysia", "value": "/m/05wrm7"}, {"text": "Realtek Singapore Private Limited", "value": "/g/11g9n26trs"}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Success Human Resource Centre Pte Ltd", "value": "/g/11g709_209"}, {"text": "Thales", "value": "/m/01phj4"}, {"text": "UST", "value": "/m/08kb8g"}, {"text": "Adecco GS", "value": "/m/08gz46"}, {"text": "Alphanova Pte. Ltd.", "value": "/g/11f8h_czps"}, {"text": "BioMind", "value": "/g/11dymfr2l6"}, {"text": "Biqmind", "value": "/g/11g21fzhrb"}, {"text": "BitTitan", "value": "/g/11dxpksv89"}]}]}