{"search_metadata": {"id": "608278e5e4a23d2a9c5e5363", "status": "Success", "json_endpoint": "https://serpapi.com/searches/b98fe389b386a14f/608278e5e4a23d2a9c5e5363.json", "created_at": "2021-04-23 07:36:05 UTC", "processed_at": "2021-04-23 07:36:05 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28solution+architect%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=10", "raw_html_file": "https://serpapi.com/searches/b98fe389b386a14f/608278e5e4a23d2a9c5e5363.html", "total_time_taken": 1.9}, "search_parameters": {"q": "(solution architect) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "10"}, "jobs_results": [{"title": "Cloud Solution Architect / AI Ranger", "company_name": "Microsoft", "location": "Singapore", "via": "via Microsoft Careers", "description": "Microsoft is on a mission to empower every person and every organization on the planet to achieve more. Our culture is centered on embracing a growth mindset, a theme of inspiring excellence, and encouraging teams and leaders to bring their best each day. In doing so, we create life-changing innovations that impact billions of lives around the world. You can help us to achieve our mission.​\n​\nMicrosoft aspires to help our customers achieve their own digital transformation, leveraging the power of Microsoft Cloud solutions and support offerings. To this end, Microsoft invests in a dedicated Customer Success team that will help Microsoft customers successfully realize their business outcomes. ​\n​\nAzure is the most comprehensive, innovative and flexible cloud platform today and Microsoft is hiring professionals that will drive customer cloud adoption within the most important companies in the market.​\n​\nWe are always learning. Insatiably curious. We lean into uncertainty, take risks, and... learn quickly from our mistakes. We build on each other’s ideas because we are better together. We stand in awe of what humans dare to achieve and are motivated every day to empower others to do more and achieve more through our technology and innovation. Together we make a difference.​\n​\nTo learn more about Microsoft’s mission, please visit: https://careers.microsoft.com/mission-culture  ​\n​Check out all of our products at: http://www.microsoft.com/en-us  ​", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDbG91ZCBTb2x1dGlvbiBBcmNoaXRlY3QgLyBBSSBSYW5nZXIiLCJjb21wYW55X25hbWUiOiJNaWNyb3NvZnQiLCJjb21wYW55X21pZCI6Ii9tLzA0c3Y0IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiSk1PNWhTcDNOdFo4V3JXckFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFVtbE5OMWRPV1d4TFkzVlVWRnAzWVZaRmVIcFRTR05MUW5GalRsUTFObGRHWlhrME16RjJNemc1UjNCVmFtOXlOalpaTURONGNrVndZbXR6Um1oaVZrVmZiakpVTkY4NGMyWnVOVmxGUlhwd015MW1RVmhaVEdjeFJHbHNZbE5VTURKTFl6UlJaMlJZTTFkbE1WQllTMFJqUkZobkxUbGhhbUY1VUVkTU16QjRTMkpITjA5U1YyMVNhbUppZEhsSlVFdEpUM1kzVVhZeVdVWlJFaFkxYm1sRFdVc3pRVTAxU0ZCMFVXRlVhbUoyYjBSbkdpSkJUMDFaVW5kQlJYZGFURE5TZDFodk9Va3hhRkpYV1ZoNVZqUkZkbWhVTkhWMyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzciLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTWljcm9zb2Z0IENhcmVlcnMiLCJsaW5rIjoiaHR0cHM6Ly9jYXJlZXJzLm1pY3Jvc29mdC5jb20vdXMvZW4vam9iLzk4MzgxNy9DbG91ZC1Tb2x1dGlvbi1BcmNoaXRlY3QtQUktUmFuZ2VyP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Client Solution Architect Lead", "company_name": "Tata Consultancy Services", "location": "Singapore", "via": "via LinkedIn", "description": "Responsible for the end-to-end architecture for the client’s system and ensures that the detailed design and development is aligned with the Enterprise Architecture of the client, Singapore Government’s SG Tech Stack, hosting platforms (CWP, GDC, GPC, GCC) and prevailing ICT policies, standards and guidelines.\n\nWhat To Expect\n• Provide technical expertise and contribute to establishing the directions for the IT architecture, standards, design and implementation approaches for clients’ systems.\n• Creates, evaluates, and implements plans and design proposals for IT solutions.\n• Translate business requirements, including application resiliency requirements, into application architectural specifications.\n• Evaluate and recommend the use of leading-edge technologies and methods, considering factors, such as their long-term effectiveness (service delivery and cost), practicality, technical limitations, and criticality.\n• Design the architecture blueprint of the client, information and ICT... assets, by using multiple architectural models. Use, govern, and enhance the architecture blueprint to ensure that the business and ICT are in alignment.\n• Oversee technical project delivery; Perform code reviews and make recommendations of code changes; Collaborate with client and TCS internal teams to resolve technical challenges; Help analyse and determine performance tuning and scalability improvements of code and queries.\n\nHow To Succeed\n• Degree in Computer Science, Information Technology, or a related discipline.\n• TOGAF certified\n• Solid software development experience with working knowledge of multiple platforms\n• Min 10 years of solution design/implementation/consulting experience, with minimum of 8 years hands-on experience as a tech lead for Singapore Government Agencies IT environment\n• Should have experience designing and implementing .Net and/or J2EE applications. Must possess excellent data modelling and SQL skills.\n• Solid understanding of Server-side, .Net and/or Java development, Service Oriented Architectures, web services, RESTful API and public web sites / e-services development.\n• Working knowledge of software development tools and methodologies.\n• Able to independently analyse and identify comprehensive solutions considering all functional implications while developing a workable solution\n• Team player with strong organization and people handling skills\n• Solid understanding of Singapore Government Tech Stack (SGTS), hosting platforms (Government Private Cloud, Government Commercial Cloud and so on) and prevailing ICT governance policies, standards and guidelines.\n• Strong in writing, presentation, and stakeholder management", "extensions": ["23 hours ago", "Full–time"], "detected_extensions": {"posted_at": "23 hours ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDbGllbnQgU29sdXRpb24gQXJjaGl0ZWN0IExlYWQiLCJjb21wYW55X25hbWUiOiJUYXRhIENvbnN1bHRhbmN5IFNlcnZpY2VzIiwiY29tcGFueV9taWQiOiIvbS8wMXBzeDgiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJGcnNNdEw3M3NLTElfWl9QQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFb3NDQ3N3QlFVNVZYMDV4VTJReU5YbFJkVjlzVmt0NFFWbFhVRUphYjJsMk5IVmxkV1JxTkdwclUyRmFiRVJrVlRWSVpEbEZUVlphWHpGd1owczRZVU5PU1dsNVUxWm1aWFpXVkVkTFdXTjRRVmxCZVdOaFUyRmphWGhuZDBvNE1XcDRUbWxsTVVoWU1VbFdVVEJGVmxCblRtMHpiVGREWkhaMGNVcHFXVkpvUjE5clVqVlliazlWVW1remRWUmFNM0JpU21SSGIzQjRjWEF6WlZwR1FuTlhXRGxuZG5SSlpFVnVXRFpsVldVNWJVTXlPUzFYUkZFMFMxcGxXSEJPVTFWWVUzRXdjV2h6UlU1R2NFWkZhRFZGRWhZMWJtbERXVXN6UVUwMVNGQjBVV0ZVYW1KMmIwUm5HaUpCVDAxWlVuZEJZakJYU0ZCMGEzTnZaV1o1UWsxU2VWZHFiakExVmpjM1pHbDMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18xNSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL3NnLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvY2xpZW50LXNvbHV0aW9uLWFyY2hpdGVjdC1sZWFkLWF0LXRhdGEtY29uc3VsdGFuY3ktc2VydmljZXMtMjQ5NzcxNjAzNT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Head of Public Sector Solutions Architecture", "company_name": "AMAZON WEB SERVICES SINGAPORE PRIVATE LIMITED", "location": "Singapore (+1 other)", "via": "via Learn4Good", "description": "Roles &\n\nResponsibilities\n\nAmazon Web Services (AWS) is looking for experienced and motivated customer facing pre-sales leaders to coach, grow, and partner with technically skilled, customer-facing Solutions Architects.\n\nYou will help develop the industry’s best cloud-based solutions architects by enabling and coaching them on best practices, solution selling, presentation and speaking skills, as well as how to create and present architectures of widely varying size and complexity. In collaboration with sales, you will drive revenue growth across a broad set of customers. If you think you have what it takes to lead the best in the industry, AWS is hiring Managers for our Solutions Architects.\n\nIn this role, you must enjoy learning and introducing new technology in order to help colleagues and customers embrace and adopt new technology. Furthermore, thought leadership in terms of looking beyond the technology and considering the value technology creates for our customers, and helping... to change how technology is viewed are important aspects of the role.\n\nThe Head of Solutions Architect, will be a lead technical strategist for the Singapore sales team. The role will work closely with their Amazon Web Services (AWS) Solution Architect peers and AWS Professional Services teams across the organization to develop and promote well architected cloud best-practices, including data security and regulatory compliance. The role will influence AWS product and services teams to help evolve AWS offerings for more rapid global Public Sector adoption.\n\nUnder your guidance the team will develop their best practice behaviors and skills in solution selling, presentation and speaking skills, as well as how to create and present architectures of widely varying size and complexity for Government and nonprofit customers.\n\nYou will work very closely with sales leadership to establish technical credibility and develop long-term customer relationships.\n\nYou will bring a strong understanding of large scale computing solutions.\n\nYou will likely have past experience working as a Solutions Architect and managing a highly technical team. In addition, you will have significant experience working with customers and partners, and will have worked with the most senior contacts and executives. Ideally you will have extensive experience in the public sector in the Singapore and be familiar with the challenges and opportunities that these customers bring.\n\nBasic qualifications 15+ years of experience growing and managing customer-facing, technical pre-sales and post-sales resources. Experience architecting and deploying production Cloud workload. 10+ years software/technology customer facing experience. Demonstrated experience coaching, mentoring, and developing technical professionals. Working knowledge of software development lifecycle, tools, and methodologies. Demonstrated ability to adapt to new technologies and learn quickly. Excellent oral and written communication skills with a demonstrated ability to influence technical and non-technical audiences including those at the Executive leadership level.\n\nBachelor’s Degree in Computer Science (or related field). Dynamic and creative, and willing to take on any challenge and make a big impact Enjoy developing technical talent to achieve great things.\n\nYou will have a passion for educating, training, and enabling cloud computing experts for a diverse and challenging set of Enterprise customers. Have a strong understanding of solutions innovation. The ideal candidate will have past experience working with customers or similar role and leading architecture teams. Preferred qualifications MBA or other Master’s degree. Professional experience architecting and deploying production workloads on AWS.\n\nExperience with on-premises to Cloud migrations and IT transformations. Professional exposure architecting or developing on AWS, including AWS certification. AWS Certification, eg. AWS Solutions Architect Associate & Professional Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer, and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, disability, age, or other legally protected status.\n\nTell employers what skills you have\n\nAgile Methodologies\n\nArchitecture\n\nCloud Computing\n\nIT Project Leadership\n\nSolution Sellingarchitectingbest practice\n\nStrong presentation skills\n\nMotivatedcustomer minded\n\nWebServicesnew technology", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJIZWFkIG9mIFB1YmxpYyBTZWN0b3IgU29sdXRpb25zIEFyY2hpdGVjdHVyZSIsImNvbXBhbnlfbmFtZSI6IkFNQVpPTiBXRUIgU0VSVklDRVMgU0lOR0FQT1JFIFBSSVZBVEUgTElNSVRFRCIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoidHRqdDRTYUt5OGpvdzA0a0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMZWFybjRHb29kIiwibGluayI6Imh0dHBzOi8vd3d3LmxlYXJuNGdvb2QuY29tL2pvYnMvc2luZ2Fwb3JlL2luZm9fdGVjaG5vbG9neS8yNzE0MDI5NzAvZS8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "GIT _ Senior Solution Architect (126716) (Singapore,  Singapore)", "company_name": "Singtel", "location": "Singapore", "via": "via APAC Tech Jobs", "description": "Singtel, Asia’s leading communications technology group, provides an extensive range of telecommunications and digital services to millions of consumers and businesses across Asia, Australia, Africa and the USA. With over 140 years of innovation behind us, we continue to push boundaries in our networks and services, to enrich lives and transform businesses.\n\nOur core values – Customer Focus, Challenger Spirit, Teamwork, Integrity, and Personal Excellence – shape the way we work. We are passionate about making a difference and have an open and inclusive culture where everyone is empowered to do their best. Our diverse business means you will enjoy unique opportunities and rewarding experiences to learn and grow your career in a dynamic industry.\n\nJoin us and experience what it’s like to be with an Employer of Choice*. Together, let’s create a brighter digital future for all. *Awarded at the HR Fest Awards 2020\n\nSingtel are at the leading edge of technology development to improve the... experience of our customers as they consume services across mobile, voice and data infrastructure, managed services, cloud computing, IT services and professional consulting. To support that journey, we are searching for top talent and have an exciting opportunity for a Sr Solution Architect to strengthen our team.\n\nThis is a strategic role expected to focus on Mobile Architecture for various digital channels and platforms\n\nKey Responsibilities\n\n• Understands business functions and transform requirements into architecture and blueprint for the solution being created. Need to propose new innovative solutions, updates to existing solutions, negotiate alternative options, build technical and release roadmaps\n\n• Understands the client necessities, create mobile architecture, perform product development and launching the mobility solutions. Construct scalable Mobile Architecture for various Mobile channels built around Microservices and APIs.\n\n• Work closely with the development team and get their buy-in into accepting the design to be implemented. Also, work with different stake holders, product owner, senior executives, architects, external parties like system integrators, product partners.\n\n• Provide technology perspective to business to achieve roadmap and prioritization by keeping abreast with industry trends. Where required, help business size the complexity of problem and help simplify and define MVP\n\nExperience & Qualification Required\n\n• Degree in Information Technology, Computer Science, Engineering or its equivalent\n\n• 10+ years of experience in the technology industry including 8+ years of proven experience in software architecture design, ideally in a validated environment, focusing on scalability, security and compliance\n\n• Possess strong background and experience as a successful Software engineer/Architect in building highly available Mobile and Web architecture at scale.\n\n• To design the required web and hybrid enterprise mobile applications for several mobile platforms. Good Knowledge of both environments and associated tools (iOS and Android)\n\n• Hands on experience in Native Mobile Technology (Swift, Objective-C, Java, and Kotlin). Experience in hybrid mobile technologies i.e. React Native, Flutter, Xamarin etc. Experience in Web technologies a big plus\n\n• Knowledge on cloud native architectures microservices architecture, Service mesh, container orchestration with Kubernetes/OpenShift.\n\n• Good experience in Mobile and API Security including OAuth2/OIDC, Tokens, mTLS etc.\n\n• Conduct research on the evolving trends in mobile security space and keep abreast of the latest vulnerabilities. Also, identify mobile security design gaps in existing and proposed architectures and recommend changes or enhancements\n\n• Oversee the fraud prevention and other detection mechanisms on the device and advise suitable changes in strategy and implementation\n\n• Passion for architecture and ability to pick up and learn new technological advances very quickly\n\n• Exhibits leadership in guiding engineering team members, adapts to changes in technology and business domains, has good knowledge of latest trends in the market and is well respected within the team\n\n• Solid understanding of Public Cloud Services (pref. AWS) architecture. AWS certification is a big plus\n\nWe believe in the strength of a vibrant, diverse and inclusive workforce where backgrounds, perspectives and life experiences of our people help us innovate and create strong connections with our customers. We strive to ensure all our people practices are non-discriminatory and provide a fair, performance-based work culture that is diverse, inclusive and collaborative", "extensions": ["19 hours ago", "Full–time"], "detected_extensions": {"posted_at": "19 hours ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJHSVQgXyBTZW5pb3IgU29sdXRpb24gQXJjaGl0ZWN0ICgxMjY3MTYpIChTaW5nYXBvcmUsICBTaW5nYXBvcmUpIiwiY29tcGFueV9uYW1lIjoiU2luZ3RlbCIsImNvbXBhbnlfbWlkIjoiL20vMDIwemZsIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiMHY5cEJiWUhnM05Ic1RzZEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXNzQkNvd0JRVTVWWDA1eFZEWXlhbGs1YlVSQ2JVZEhUWGxrYWtWT1MweHZVR1I1TFV0SmEwUm5jbkJvWTJRemRXdzJiVEZpY0ZKRlREWjNkMWQ1YzFSTk5IUjJWR3gxTlcwM2VIVkdjbHBHY0d0SWJVNUxYeTFMYXpacU9HeG1hSGhQVjFOWWNGcHRRbHBaTVhwQmVIYzNTVlZRYkU5Q2FrSlNjbTlSVG5SNWN6ZERRMmc1YzJ0YWFtWjVORmx1VlRNU0ZqVnVhVU5aU3pOQlRUVklVSFJSWVZScVluWnZSR2NhSWtGUFRWbFNkME5XY1hkMlZHbDNkRE5VU25vMVNYTjZWVVl3UVdScWFXOHdWRkUiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18yNyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBBUEFDIFRlY2ggSm9icyIsImxpbmsiOiJodHRwczovL2FwYWN0ZWNoam9icy5jb20vam9iLzE1NDYyL2dpdC1fLXNlbmlvci1zb2x1dGlvbi1hcmNoaXRlY3QtMTI2NzE2LXNpbmdhcG9yZS1zaW5nYXBvcmUvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Security Architect", "company_name": "Comtel Solutions Pte Ltd", "location": "Singapore (+1 other)", "via": "via Monster Singapore", "description": "Responsibilities\n• Degree holder in Electronics/Telecommunications Engineering or a related discipline with at least 10-12 years of hands-on design and architecture experience in Application security, SDLC and Software Security and testing domains and associated lifecycle and industry frameworks\n• Strong foundation and in-depth technical knowledge of API Security, Software Security Architecture and lifecycle, DevSecOps and CI/CD Security will be the added advantage\n• Preferably with (ISC)² Certified Secure Software Lifecycle Professional (CSSLP) certification, CISSP, AWS Security Specialist, AWS Solution Architect, EC-Council-CASE\nExperience\n• Candidate should have bachelor’s degree in Computer Engineering with 12-15+ years of relevant experience in Cyber Security.\n• Candidate should have good understanding and working experience in many of the cyber defense technologies.\n• Good understanding of guidelines such as MAS TRM, ISO and NIST standards or equivalent\n• Good knowledge on... Security Incident Response and run book preparation for emerging and new threats, applying safeguards where possible to minimize the threat.\n• Sound understanding on Ransomware, XSS, Injection and other similar attacks\n• Good knowledge and understanding of encryption technologies (both symmetric and asymmetric algorithms) and its applications\n• Establish and oversee a formal vulnerability and testing program.\n• Management to remediate new and outstanding issues; track security-related issues in the GRC system.\n• Participate in design activities and provide various solutions to ensure security is not compromised at various phases of the program lifecycle", "extensions": ["2 days ago", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZWN1cml0eSBBcmNoaXRlY3QiLCJjb21wYW55X25hbWUiOiJDb210ZWwgU29sdXRpb25zIFB0ZSBMdGQiLCJjb21wYW55X21pZCI6Ii9nLzExZHhwenRnbmIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJJM19GTmdQc1FyR1BVRXVKQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFb3NDQ3N3QlFVNVZYMDV4VVZKaE5FTnhPSGRqVkUxaFRFVklXVGhLUTJrNFUxTnJhRE5RTkhZMk5Yb3pjeTEyWDFwRFkyaEtjMjl1VkV0SWVqUnRYMll5UTBwck5sTk1Ta040UzIwd0xXOUlhSE5mWVZWa1dHcEhTV1phY1VaVGRWUnpVVzVHWDNSb0xYbGpOR0pVTURZdE9XNWZiRzQzTjNoTGJYcG9OelJ1VkdSWGFFWktaakJ0WW05SVMxTnRlV0pGYTAxRU5GTklWV1ZmUmw4MFJsZzRiRUZTY3pCU1FVOVBUbFZsYkZOTlEyTjVYMFZLVGxwU2VtMUlPWFo0TjA1UlQxaHZaelZmWjAxR09TMHROVFZTRWhZMWJtbERXVXN6UVUwMVNGQjBVV0ZVYW1KMmIwUm5HaUpCVDAxWlVuZERRV1J3TmxkTVdsQnhjMEV3ZWxseGVuSjJTSGhrY25OUGFHOUIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18zNCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNb25zdGVyIFNpbmdhcG9yZSIsImxpbmsiOiJodHRwczovL3d3dy5tb25zdGVyLmNvbS5zZy9qb2Ivc2VjdXJpdHktYXJjaGl0ZWN0LWNvbXRlbC1zb2x1dGlvbnMtcHRlLWx0ZC1zaW5nYXBvcmUtMzA0ODE5ND91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Marketing Cloud Solution Architect", "company_name": "Salesforce.org", "location": "Singapore", "via": "via Neuvoo", "description": "About the\n\nposition\nBeing a key member of Marketing Cloud’s Professional Services team, Marketing Cloud Solution Architects (SA) are experienced technology consultants who can understand and deliver to our customer’s strategic digital marketing vision and goals. Serving as hands-on advisors to our customers, you will lead on consultative engagements with complex enterprise customers, translating their requirements into solution designs that can be implemented and scale. With a combination of strong interpersonal skills, technical expertise and marketing domain knowledge, you will drive customer success and deliver on customer ROI in their marketing\n\ntransformation efforts. You will work hand in hand with customer stakeholders (both IT and marketing) to provide thought leadership on the art-of-possible with our marketing technology offerings, deriving requirements and designing comprehensive marketing solutions. You will collaborate closely with the strategy and technical architect... team members to assess and document on the solution options based on best practices, customer objectives and constraints. You will be presenting opinionated recommendations, guiding our customers in navigating through challenges faced in their digital marketing transformation and implementation efforts.\n\nResponsibilities\n• Lead consultative engagements with customers on the technical and business challenges related to their digital marketing initiatives.\n• Complete Solution ownership from requirements gathering to solution delivery working with variety of technical / non technical stakeholders, including business process mapping and gap analysis.\n• Document, manage and present an actionable solution designs and blueprints (eg. BRD & FSD) that aligns a customer’s business needs to Salesforce Marketing Cloud & associated products.\n• Present high-level overviews of the Salesforce Marketing Cloud architecture and integration capabilities.\n• Conduct solutions presentations and obtain customer acceptance to solution design. Guide customer through solution deployment and environment management.\n• Create architecture diagrams and flow charts on both system architecture and detailed solution levels.\n• Support client marketing technology landscape and incidents reviews, including enhancement recommendations & root-cause analysis.\n• Provide thought-leadership to our clients on digital marketing domain and modern marketing operation\n• Managing 1-3 concurrent client engagements and work with associated team members.\n• Actively participate in the community delivering reusable assets, success stories and helping the community grow.\n• Support pre-sale teams with sales opportunities by validating solutions and identifying opportunities in existing accounts.\n• Travels to client sites for onsite discovery and solutions presentations. Not expected to exceed 25%\n\nRequirements\n• Demonstrable customer-facing consulting experience of solution design & technical delivery of SAAS platforms / equivalent.\n• Experience leading customer facing discovery sessions to conceptualise and design complex business solutions.\n• Experience documenting customer problems and software solutions using BRDs\\FSDs, wireframes, diagrams, workflows and mock-ups.\n• Excellent presentation and verbal skills with technical, non-technical, end- user, and executive audiences\n• Past experience developing SQL with a RDBMS such as MySQL, Oracle, or MS SQL Server\n• Familiarity with HTML, CSS and JavaScript\n• Strong understanding of SOAP APIs, REST APIs and integration architectures.\n• Familiarity with SDLC methodologies including requirements, design, implementation, testing and maintenance\n• Understanding of sales process and methodologies preferred.\n• Experience in the interactive marketing industry preferred but not essential.\n• A positive “Yes I can” attitude and self-driven.\n• Great communication & diagramming skills\n• Experience in supporting pre-sales and project estimations\n• 5+ years working in I.T\n\nDesirable Experience / Skills\n• Solution architecture/design experience within SaaS, CRM, MAP (Marketing Automation Platform) is strongly preferred, specifically projects within the Salesforce Marketing Cloud.\n• Marketing Cloud certifications strongly preferred (Marketing Cloud Email Specialist, Marketing Cloud Consultant). Similar certifications against other MAPs a plus (IBM/Unica, SAS, Adobe, Oracle, Teradata)\n• Related experience with Salesforce CRM (Sales, Service, Community) is a plus.\n• Familiarity with Agile project delivery methodology, ceremonies and tools\n• Bachelor's degree in software engineering or computer science or relevant experience.\n• Adaptable to frequent changes and ambiguity as we evolve and grow our practice\n• Fluency in Thai language is highly preferred\n\nAbout Salesforce:\n\nSalesforce, the Customer Success Platform and world's #1 CRM, empowers companies to connect with their customers in a whole new way. The company was founded on three disruptive ideas: a new technology model in cloud computing, a pay-as-you-go business model, and a new integrated corporate philanthropy model. These founding principles have taken our company to great heights, including being named one of Forbes's \"World's Most Innovative Company\" five years in a row and one of Fortune's \"100 Best Companies to Work For\" eight years in a row. We are the fastest growing of the top 10 enterprise software companies, and this level of growth equals incredible opportunities to grow a career at Salesforce. Together, with our whole Ohana (Hawaiian for \"family\") made up of our employees, customers, partners and communities, we are working to improve the state of the world.\n•", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJNYXJrZXRpbmcgQ2xvdWQgU29sdXRpb24gQXJjaGl0ZWN0IiwiY29tcGFueV9uYW1lIjoiU2FsZXNmb3JjZS5vcmciLCJjb21wYW55X21pZCI6Ii9tLzA3YnRyNSIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IlAxalFLa0FqWlZldFdvdGhBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhWSGh4UVVabmIxRk5jRjlMYjBKdVpsSmZabWx3ZUhCalNtbzBVSFJSWmtKVk0yaFBhMEkwYmpWSE1UaHdkR2hOU21Od2JtZEpaR2x3WkZCWmJXZERlUzFZYzJOamQxSjRaRVpaTjFVMlRHRlZaRFJ1Y1ROcE1FMVJSbE5OVEZSUVRrSmtaRmw1VTFVd2JHZFFSVGh5Y0U1TmJ6SlZTVFJGTTBkMFJtazJkVTFLYjFoVlluUk9RVUpZVXpkcWVIRlhaVGd4ZGs5TU9FNWxVa3QzRWhZMWJtbERXVXN6UVUwMVNGQjBVV0ZVYW1KMmIwUm5HaUpCVDAxWlVuZERRekZCV1dselYzbG1WelIxVFdZNGEwSk5UVWMxT1dNMFpYcFIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY180MSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBOZXV2b28iLCJsaW5rIjoiaHR0cHM6Ly9zZy5uZXV2b28uY29tL3ZpZXcvP2lkPWY0MGQ0ZWRjNTY1YVx1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Presales Consultant (Solution Architect)", "company_name": "StarHub Ltd", "location": "Singapore", "via": "via Careers @ StarHub", "description": "Job Description\n\nThe primary focus is to play a leading role as a technology, solution, architecture and services Expert to drive Enterprise Infrastructure business revenue and increase profitability. This requires technical business solution domain expertise in one or more of the following ICT domains: Multi-Cloud Orchestration and Management, Cloud Native Platforms and Technologies, Data Center Platforms, Telecommunications, Networking, Security, Virtualization and Service Management. Cloud economics, TCO and ROI Scenarios to create value is highly desired.\n\nYou align the business needs of customers and prospects to a technical solution and provide high quality pre-sales technical consultation and develop cost effective, resilient, innovative and reliable ICT solutions to win proposals and bids/tenders and achieve high customer satisfaction for the services rendered. You must have demonstrated ability to engage in senior level technology decision maker discussions related to... agility, business value, and system architecture.\n\nThe key function is primarily in pre-sales, tenders and bids. You must have the ability to conceptualize business solution to customer and you actively participate in the business development lifecycle, developing accurate / optimised bill of materials, generating proposals, and supporting other sales efforts. You walk through and present to clients the various technologies and services proposed and explain technical details and value proposition of the proposed solution and act as a trusted advisor for nominated client accounts.\n\nResponsibilities\n• Provide Broad and Deep Technical Consulting support to Solution Sales team for Enterprise Infrastructure business\n• Gather in depth hardware, cloud, applications and networks requirement to architect and design a suitable highly available, secure and scalable solution to meet client requirement\n• Prepare and propose technical solution for customers, including overseeing the selection of technologies to develop the proposed solutions, developing accurate and optimised bill of materials, migration plan, proposal writing, presentation and conduct proof-of-concept to showcase its technical feasibility\n• Articulate alternatives in terms of cost, benefit and risk where multiple solutions exist\n• Highlight the positive impact of the solutions and it how it can achieve customer’s business goals\n• Manage customer relationship by communicating architecture standards and frameworks; answering questions; resolving concerns and issues\n\nQualifications\n• Diploma / Degree holder\n• Min 10 years of Solution Architect presales experience with software and / or cloud development background in the Telecommunications or IT Industry\n• Practical experience in implementing Azure / AWS projects preferred.\n• Practical experience in infrastructure sizing and cloud architecture preferred.\n• CISSP certification is preferred\n• Minimally done 3 Datacenter modernization projects of size 40VMs and above.\n• Good knowledge of Enterprise Infrastructure & Storage Equipment\n• Additional technical qualifications including hands-on experience in several of the following products or technologies: F5 / Palo Alto / CheckPoint / Cisco / etc\n• Experience leading large group meetings / information gathering sessions with senior-level executives\n• Strong business acumen with strong interests in keeping up-to-date with current technologies.\n• Must be able to work independently with minimum supervision.\n• Strong command of English, with excellent interpersonal, communication and presentation skills\n• Good team player and proactive attitude.\n• Good knowledge with Microsoft Word, PowerPoint & Visio\n• We regret that only shortlisted candidates will be notified", "extensions": ["8 days ago", "Full–time"], "detected_extensions": {"posted_at": "8 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcmVzYWxlcyBDb25zdWx0YW50IChTb2x1dGlvbiBBcmNoaXRlY3QpIiwiY29tcGFueV9uYW1lIjoiU3Rhckh1YiBMdGQiLCJjb21wYW55X21pZCI6Ii9tLzA0ZnQ0NCIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImJYQkNuNVItb1ptbGlpSkZBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhVM0ZaZEVReGJuWlRSMHQ0V21wRFlrOUpiVzU1WmxkaGJFaEhSMVpmV25nNFEwaFZabVJKVUhSU1ZWaFdTMWx5WjJwYVp6VkVXbFkwTjJ4ZlRqTmZSbXBwYVVGSVRVTkdRbXcxUXpFd2FEWjVUMll4VVdOSVNsRjJVak00UTFwdFUxVkhaeTF1Wm1SU0xWTk5ibk5aTWxGeVgzZGlTM3BtVlhZMVkzQXdjamRUWkRWMlVuRlpVV0V6Y0VRNVJWOXBPV0ZuU0RNMFIxaDRORVpuRWhZMWJtbERXVXN6UVUwMVNGQjBVV0ZVYW1KMmIwUm5HaUpCVDAxWlVuZEJZek5VZWpsVlowdE1TRkY1TWtKcE5FSkhRV2xyTUZCTFRsOW4iLCJmY3YiOiIzIiwiZmNfaWQiOiJmY180OSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBDYXJlZXJzIEAgU3Rhckh1YiIsImxpbmsiOiJodHRwczovL2NhcmVlcnMuc3Rhcmh1Yi5jb20vam9iL1ByZXNhbGVzLUNvbnN1bHRhbnQtJTI4U29sdXRpb24tQXJjaGl0ZWN0JTI5LzU3NjY2ODcxMC8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Presales Solutions Architect", "company_name": "JonDavidson Pte Ltd", "location": "Singapore", "via": "via LinkedIn", "description": "This role support the regional sales teams in providing IP networking solutions.\n\nRoles:\n• Analyze Customers’ system architecture and identify opportunities for growth and improvement\n• Create end-to-end high level solutions to meet overall network requirements and product specific business needs\n• Work closely within the team to understand stakeholder requirements, developing high quality, architecturally sound systems that align with business needs\n• Establishing technical standards and drive overall solution architectures, engineering practices and methodologies\n\nResponsibilities:\n• Responsible for architecting the next generation IP and data transport network architecture leveraging networking experience\n• Interpret requirements and aligning these to business and technology strategies, policies and enterprise architectures\n• Develop the infrastructure architecture considering service level, availability, continuity, suppliers, security and capacity management requirements\n•... Identify opportunities to apply technology trends and innovatively apply these trends to solve business and technical problems\n• Improved business flexibility delivered via a clear framework, defined structure, and standards. improve availability, reliability and security of mission critical services\n• Communicate complex multi-discipline technology problems and recommended solutions to a diverse audience\n• Lead or participate in the creation and evaluation of tenders, developing and presenting recommendations to stakeholders for approval\n\nRequirements:\n• Tertiary education in Computer Science, Computer Engineering, Information Technology, Software Engineering or a related field\n• 5 years’ experience in related role\n• Understanding of protocols to implement IP Networks and transport networks including BGP, MPLS and OSPF\n• Understanding of network function virtualization (NFV)\n• Understanding of software defined networking (SDN) including OpenFlow, Netconf, YANG, PCEP etc\n• Experience at identifying strengths and weaknesses of different technologies and architectures\n• Experience in architecting IP and data transport telecommunications networks\n• Understand the standardization process employed in the industry and the nature of standards bodies\n• Strong understanding of various software architectures (Web, Cloud, Integration) and methodologies\n• Experience with Enterprise Architecture best practice and goals (recognized EA certification is a plus)\n• Self-Starter with strong sense of responsibility, initiative, urgency and commitment\n• Excellent verbal communication and presentation skills are essential\n• Highly organized with exception creativity and management skills\n\nInterested professionals are to submit their applications and CVs in MS Word format stating current and expected salary packages to d.ong@jondavidsongroup.com as an expression of their interest. We regret that only short-listed candidates will be notified.\n\nJonDavidson Pte Ltd EA Reg No. 08C4705 Desmond Ong EA No. R1110282", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcmVzYWxlcyBTb2x1dGlvbnMgQXJjaGl0ZWN0IiwiY29tcGFueV9uYW1lIjoiSm9uRGF2aWRzb24gUHRlIEx0ZCIsImNvbXBhbnlfbWlkIjoiL2cvMTFkeHB2dDZtdiIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Ik5GRmZoYi0tb3dpZ2UtVExBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2WUJDcmNCUVU1VlgwNXhVbUZ4ZEhwSVEzWk5ZVXA2UW0xbVJIUlNZV1pDUlZNMVdERjNSSE01TjBNNVFrc3dWbnBFY21wcGJ6QXdSMHBWTWtkMVpEbDVNVkU1UXpKek9HTkRkVjlVVG1Kek1YSXhVbXRLYXpVMWMyd3dlSEk1UTFjeGVHbFZPVUZZVUVoMFNDMXFWMmN4UjNKR05IcHBSV2xhZVdwMGRWazFZbTVaUkUxWWRGRlpXVmhCWWxCT1oxZFFlakpzWDFnM01IWm5WM1ZrTUVGdFVsVm1iRFpuYlZoa2JsZG1VM1F0WkZWamNrMW5iemt5U3kxSkVoWTFibWxEV1VzelFVMDFTRkIwVVdGVWFtSjJiMFJuR2lKQlQwMVpVbmRDUWtaUVpVdE5SbFIxV1ZFNWJWWnRhRTR6Tldsb1ZqQndWVUZuIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNTciLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGlua2VkSW4iLCJsaW5rIjoiaHR0cHM6Ly9zZy5saW5rZWRpbi5jb20vam9icy92aWV3L3ByZXNhbGVzLXNvbHV0aW9ucy1hcmNoaXRlY3QtYXQtam9uZGF2aWRzb24tcHRlLWx0ZC0yNDk2Njc2MzcxP3JlZklkPTc1N2M0NDlhLTA3ZTMtNDJlZC05N2RlLTMxMWIyMTM3MjBiNlx1MDAyNnRyYWNraW5nSWQ9MEwzcDdLWHNHN09LZUlsZkxNc0FoQSUzRCUzRFx1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Cisco Certified Network Architect", "company_name": "A-Speed Infotech Pte Ltd", "location": "Singapore", "via": "via Joblum Singapore", "description": "Responsibilities:\n• Assessing business and applications requirements for corporate data and voice networks\n• Planning, designing and upgrading network installation projects\n• Establishing and maintaining backup, version-control and viral defense systems\n• Troubleshooting network architecture and making recommendations for system findings and enhancements\n• Making recommendations for leveraging network installations and reducing operational costs\n\nRequirements:\n• A must to have in-depth experience in architecture design, managing and support the following applications/systems – Cisco & Aruba networking solutions, 802.1x NAC/NAP technologies, MPLS/IPSec/SDN WAN/Internet.\n• Cloud Computing Platforms exposure preferred (Office365, Azure, AWS,etc)\n• Good knowledge in administrating the following technologies will be a plus – Microsoft Lync/Skype for Business, Linux based Operating Systems, Public & Private Certificates management & monitoring solution such as WhatsUp Gold or SolarWinds.\n•... Certifications such as Cisco CCNA/CCNP/CCDP/CCIE, Aruba, VMware, PMP/ PRINCE2, ITIL V3, AWS Certified Solutions Architect/ Azure Solutions Architect will be an added advantage", "extensions": ["7 days ago", "$5K–$7K a month", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time", "salary": "$5K–$7K a month"}, "job_id": "eyJqb2JfdGl0bGUiOiJDaXNjbyBDZXJ0aWZpZWQgTmV0d29yayBBcmNoaXRlY3QiLCJjb21wYW55X25hbWUiOiJBLVNwZWVkIEluZm90ZWNoIFB0ZSBMdGQiLCJjb21wYW55X21pZCI6Ii9nLzExZzlteHN3bDQiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJGcUw4MWRZNjc1eUlnVFlNQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFb3NDQ3N3QlFVNVZYMDV4VVROWGRsSlhZbGQxVjFWeU5uTXRkME5MTFhsSmVVdHhNR3BEWVU5b1RHVXhNalpEV1dGRVpEaGllSEZKTVc5cExVdERkRXRFV0ZGSlQwbHpZbFIyYlVNeGIxQklOM1ZCYVhSSU5sRjFjM0YyTUhGNE0wYzVOME5JZVc5blRVNXNURFpWU21kbVZWRlZVbE0yVmtwVFNqSnZTV1JVTVhWWVoxVk1TMTlsYTJOdGNsUjNkemhDUmpKMU1IaEVPWGRHYTNkeldXaFFOMjgxUVRkZk4wRlBSMUZTYm1KT1JtWjBYM2hsVURnek9FdEpXV054ZW5RdGRVSkNNWFIwY1ZKd2JVZGFhelJsRWhZMWJtbERXVXN6UVUwMVNGQjBVV0ZVYW1KMmIwUm5HaUpCVDAxWlVuZENNbEp0UTJsR1VYbFFhMUo0ZVdsU2MzZ3dlblpWT1ZwaWEycDMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY182NSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JsdW0gU2luZ2Fwb3JlIiwibGluayI6Imh0dHBzOi8vc2cuam9ibHVtLmNvbS9qb2IvY2lzY28tY2VydGlmaWVkLW5ldHdvcmstYXJjaGl0ZWN0LzYyMTg0OD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Client Solutions Architect", "company_name": "DELL", "location": "Singapore", "via": "via Dell Careers", "description": "VMware Professional Services (PS) Organization drives and influences the success of each VMware implementation. The PS team is dedicated to the success of our customers and their digital strategies. The PS team ensures that VMware customers are successfully implementing and delivering against their business plans from adoption all the way to a fully functioning solution that meets their defined business outcomes.\n\nAs a Client Solutions Architect (CSA), you will be responsible for the PS design and scoping of services of complex transformational solutions for our customers. The role will require you to understand the products, frameworks, and design patterns used for VMware solutions. You will be asked to contribute to these frameworks, develop reusable domain solutions, and mentor internal & external stakeholders on the use of the tools. You will be working as part of a team with similar charters. To effectively build solutions to solve for complex business problems it will be... important to build a strong network among your peers and internal & external teams. You should be ready to take ownership of the pre-sales initiatives and programs to aid in delivering of our solutions.\n\nThe ideal candidate will have a good mix of Technical Skills, Business Acumen, and a strong bias for customer centricity. The ideal candidate will need to be able to understand the customers vision and to be able to translate this to desired business outcomes and the IT solutions which underpin them. You will be acting as a lead technologist and should have a broad understanding of VMware and related technologies.\n\nThe ideal candidate would have domain level understanding in one or more of the following Franchises:-\n• Multi-Cloud\n• Application Modernization\n• Digital Workspace\n• Virtual Cloud Networking\n• Intrinsic Security\n\nVMware PS is committed to offering a collaborative and supportive working environment with a full enablement plan and the opportunity to develop in the latest Software-Defined Datacenter or Digital Workspace technologies and solutions. We promote an inclusive atmosphere where your voice will be heard, and where you will be part of a dynamic team working in partnership with each other and with our customers.\n\nWe are looking for conscientious and responsible individuals who can build on our successful track record and come with us on the next stage of our journey. We will sponsor your enablement and certification for VMware technical skills and potentially non-VMware specific but associated certifications and soft skills via our ‘Take1’ initiatives.\n\nKEY RESPONSIBILITIES:\n\nThe Client Solutions Architect (CSA) is primarily responsible to lead the technical pre-sales engagement with customers through the following activities:-\n• Working in close partnership with the core sales, services sales and delivery teams to understand desired customer outcomes, technical objectives, and services requirements\n• Design high level solutions to meet the business outcomes and IT objectives\n• Development of Vision for the Solution, Strategy and Services Roadmaps\n• Ability to think past individual products and create end to end solutions to meet the business outcomes\n• Effectively communicate the proposed services architecture to the customer, partners and project teams to demonstrate its tangible value\n• Ensure that proposals, services solution designs and Statements Of Work are technically sound, deliverable, competitive and representative of market leadership in the application of technology to addressing business outcomes\n• Assist with the completion and response of customer issues RFI’s, RFQ’s and RFP’s\n• Ownership of the technical components of the Statement of Work including pre-requisites, responsibilities, technical scaling factors, out of scope items etc.\n• Accurately define role based Level Of Effort required to deliver the solution in line with VMware best practice and support guidelines\n• Facilitate accurate, timely and efficient handover of projects from the sales phase to delivery\n• Author blogs, technical articles and white papers based on experiences\n• Speak at events such as VMworld, Sales Kick-Offs, Technical Summits etc.\n• Provide lessons learned feedback to Services Sales, Delivery Management and Engineering based on customer feedback\n• Creates artefacts and manages collaboration with PS Engineering\n• Adhere to VMware PS sales process and methodologies on all opportunity pursuits\n• Mastery of necessary tooling including PS Solution Builder\n• Maintain proficiency in VMware service offerings, value propositions, and representative case studies\n• Support Field enablement of Client Solution Executives (PS Client Sales Execs), CSAs, inside Client Sales Execs and iCSAs based on domain expertise\n• Mentoring of peers and more junior CSAs as appropriate\n• Lead internal enablement and community discussions around emerging technologies\n• Obtain continuous feedback from the field, including customers, bringing IP back to corporate teams and making recommendations on future service offerings\n• Working with PS Client Sales Execs help to scrub franchise specific forecasts to provide the best possible view for the business\n• Confidently gather use case requirements and solution designs while functioning as an advocate for “Best Practices” and driving adoption of VMware solutions\n• Ensure the solution being delivered is fit for purpose, referencing the initial business goals and objectives of the project through strong governance\n• Maintain up to date high-level technical knowledge of the VMware product line and future product direction and expert level knowledge of your specialist domains\n\nYOU ARE:\n• A seasoned technical architect with a deep understanding of the Government, Enterprise, and/or Commercial environments, and embraces solution selling with the ability to solve customer’s business needs through the innovative application of cloud-based business solutions.\n• Self-motivated, results-oriented, proactive and upbeat, you work as a member of a team and independently, developing long-term strategic and technical relationships.\n• A clear thinker as well as an effective presenter and communicator, you effectively lead the architectural discussions and technical development of customer environments.\n• Broad industry knowledge with a solid understanding of technology platforms and how to design solutions based on VMware’s portfolio. Proven experience in driving complex solution sales in a competitive environment with knowledge of AWS, Microsoft, RedHat, and other industry leading cloud-based vendors.\n• Must have proven experiences and confidence in driving complex competitive solution sales scenarios, working in a matrix environment, and leading opportunities to closure.\n\nYOUR KNOWLEDGE AND EXPERIENCES:-\n• You adopt a solutions sales/ consultative selling approach to sell business and IT outcomes, calling on your understanding of the VMware product range and services offerings in an industry context.\n• You have a broad range of product knowledge, technical architectural design and hands-on experiences in VMware vSphere, NSX, Cloud management product (e.g. vRA, vCD etc.), DevOps tools, and End User Computing in medium to large environments\n• You are familiar with broadly accepted architectural frameworks (e.g. TOGAF, ITIL etc.), Project Management (e.g. PMP, Prince2), as well as working knowledge for third-parry infrastructure and/or cloud native products and solutions (e.g. Microsoft, Red Hat, Cisco, Dell)\n• You are able to generate proposals that are commercially sound, deliverable and compelling, and experiences in producing and reviewing Statements of Work for services.\n• You are empathetic, and harness the ‘one VMware team’ spirit to collaborate in a multi-competency environment (sales, presales, generalist, specialists)\n• You have developed strong relationships with regional IT decision makers in Government, Enterprise, and/or Commercial accounts, and are able to adapt internal and external communication to a target audience\n• You participate actively in VMware User Groups and/or recognized as a vExpert\n\nMINIMUM ENTRY QUALIFICATIONS AND REQUIREMENTS:-\n• 8+ years in Information Technology, preferably in the areas of Pre-Sales/ Business Development/ Advisory/ Delivery, or at least 5+ years in a CSA capacity and should have supported a regional quota\n• Experience in Enterprise Architecture fundamentals, methods and concepts, IT governance, business process management, and IT implementation.\n• A Bachelor’s or advanced degree in business/computing, or equivalent\n• VMware certifications as well as certifications related to Public Cloud provider (AWS, Azure), Private Cloud, Virtual Infrastructure, Modern Applications, Digital Workspace, and/or Systems Management\n• Industry related specialized knowledge and/or additional certifications expected – Project Management, TOGAF, ITIL Foundation (or Advanced), and COBIT\n• Able to travel up to 50% when required, and to travel occasionally within Asia Pacific and to the USA\n• Technical services scoping experience in a consulting/ services environment, including time supporting sales and liaising with technical practices and delivery\n• Delivery or production experience in at least 2 of the 5 main Franchises\n• Strong presentation, C-level client management and business development skills with the ability to articulate options & ideas\n• Superior organizational and negotiation skills\n• Experience of working in a multi-dimensional and matrixed organization\n• Ability to influence external & internal decision makers and to anticipate challenges and take pro-active action to address\n• Strong documentation and technical writing skills with an ability to create high impact customer facing deliverables\n• Ability to demonstrate solid commercial acumen\n• Adaptable and progressive learner with the ability to communicate complex technical topics to both a technical and non-technical audience\n• An active listener with excellent communications and interpersonal skills, with an ability to utilizes different styles of questioning techniques and manage conflict and objection handling\n• Experience of working with a wider team to respond to RFI, RFQ or RFPs\n\nThis role will be based out of Singapore.\n\nABOUT US\n\nVMware is an equal opportunity employer committed to the principles of equal employment opportunity and affirmative action for all applicants and employees. Equal opportunity and consideration are afforded to all qualified applicants and employees in personnel actions, which include: recruiting and hiring, selection for training, promotion, rates of pay or other compensation, transfer, discipline, demotion, layoff or termination. VMware does not unlawfully discriminate on the basis of race, color, religion, sexual orientation, marital status, pregnancy, gender identity, gender expression, family medical history or genetic information, citizenship, national origin or ancestry, sex, age, physical or mental disability, medical condition, veteran status, military status, or any other basis protected by federal, state or local law, ordinance or regulation. VMware also makes reasonable accommodations for disabled employees consistent with applicable law. Further, it is the policy of VMware to maintain a working environment free of all forms of harassment.\n\nAt the core of what we do are our employees who deeply value execution, passion, integrity, customers, and community.\n\nWant to be part of a compassionate community that thrives on crafting what's next in IT? Learn more at vmware.com/careers.\n\nCategory : Sales\nSubcategory: Solutions Architect\nExperience: Business Leadership\nFull Time/ Part Time: Full Time\nPosted Date: 2021-03-25\n\nVMware Company Overview: At VMware, we believe that software has the power to unlock new opportunities for people and our planet. We look beyond the barriers of compromise to engineer new ways to make technologies work together seamlessly. Our cloud, mobility, and security software form a flexible, consistent digital foundation for securely delivering the apps, services and experiences that are transforming business innovation around the globe. At the core of what we do are our people who deeply value execution, passion, integrity, customers, and community. Shape what’s possible today at http://careers.vmware.com.\n\nEqual Employment Opportunity Statement: VMware is an Equal Opportunity Employer and Prohibits Discrimination and Harassment of Any Kind: VMware is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at VMware are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. VMware will not tolerate discrimination or harassment based on any of these characteristics. VMware encourages applicants of all ages. Vmware will provide reasonable accommodation to employees who have protected disabilities consistent with local law", "extensions": ["29 days ago", "Full–time"], "detected_extensions": {"posted_at": "29 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDbGllbnQgU29sdXRpb25zIEFyY2hpdGVjdCIsImNvbXBhbnlfbmFtZSI6IkRFTEwiLCJjb21wYW55X21pZCI6Ii9nLzExYzU0Y2gyam0iLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiI5bDR4VTVxSWhsaS1QSWhOQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFc3NCQ293QlFVNVZYMDV4VTA1dk4wMDNTVzl4VTNoS2RrWkxjRzVtZUZsYVluWjNXVkZGVjNCa04yTmtkekZRTjIxR1NIY3RXRlZUUW14VloxbDJkMjF3TTI4eFJIbDFjRGRvYkhaMFZIVm1TMDVETUU1SWRtSm1lV0pHWVZOeWJGUlpMVlJpTjFOWVgzaDZkemhWYUhVeFpHUjRNMkZmWTE5NFpVWlhPRjg1Wms5TVpHUlBNWFphUlRVNVp5MWFNMjhTRmpWdWFVTlpTek5CVFRWSVVIUlJZVlJxWW5adlJHY2FJa0ZQVFZsU2QwRmhUbXQzV2t0a1gwZHNRVm93Y1RsTGQwOUVYMHBwT0hGak5sRSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzczIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIERlbGwgQ2FyZWVycyIsImxpbmsiOiJodHRwczovL2pvYnMuZGVsbC5jb20vam9iL3NpbmdhcG9yZS9jbGllbnQtc29sdXRpb25zLWFyY2hpdGVjdC8zNzUvMTkwNzkwODA/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}], "chips": [{"type": "Title", "param": "job_family_1", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Solution architect", "value": "solution architect"}, {"text": "Solutions architect", "value": "solutions architect"}, {"text": "Architect", "value": "architect"}, {"text": "Cloud architect", "value": "cloud architect"}, {"text": "Technical architect", "value": "technical architect"}, {"text": "Enterprise architect", "value": "enterprise architect"}, {"text": "Senior", "value": "senior"}, {"text": "Consultant", "value": "consultant"}, {"text": "Financial services", "value": "financial services"}, {"text": "Infrastructure architect", "value": "infrastructure architect"}, {"text": "Manager", "value": "manager"}, {"text": "Application architect", "value": "application architect"}, {"text": "Cloud engineer", "value": "cloud engineer"}, {"text": "It architect", "value": "it architect"}, {"text": "Lead architect", "value": "lead architect"}, {"text": "Network architect", "value": "network architect"}, {"text": "Security architect", "value": "security architect"}, {"text": "Senior architect", "value": "senior architect"}, {"text": "Systems engineer", "value": "systems engineer"}, {"text": "Associate director", "value": "associate director"}, {"text": "Deputy", "value": "deputy"}, {"text": "Engineers", "value": "engineers"}, {"text": "Head", "value": "head"}, {"text": "Infrastructure", "value": "infrastructure"}, {"text": "Lab", "value": "lab"}, {"text": "Network engineer", "value": "network engineer"}, {"text": "Presales consultant", "value": "presales consultant"}, {"text": "Public sector", "value": "public sector"}, {"text": "Senior analyst", "value": "senior analyst"}, {"text": "Senior consultant", "value": "senior consultant"}, {"text": "Senior director", "value": "senior director"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Software architect", "value": "software architect"}, {"text": "Solution consultant", "value": "solution consultant"}, {"text": "System architect", "value": "system architect"}, {"text": "System engineer", "value": "system engineer"}, {"text": "Systems analyst", "value": "systems analyst"}, {"text": "Systems architect", "value": "systems architect"}, {"text": "Technical trainer", "value": "technical trainer"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Accounting", "value": "/business/naics2007/5412"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Management", "value": "/business/naics2007/55"}, {"text": "Real Estate", "value": "/business/naics2007/53"}, {"text": "Wholesale", "value": "/business/naics2007/42"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Amazon", "value": "/m/0mgkg"}, {"text": "Microsoft", "value": "/m/04sv4"}, {"text": "EPAM Systems", "value": "/m/0dlnrc"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "IBM", "value": "/m/03sc8"}, {"text": "Salesforce", "value": "/m/07btr5"}, {"text": "EY", "value": "/m/0g9jc"}, {"text": "Publicis Sapient", "value": "/m/02myjp"}, {"text": "Randstad", "value": "/m/08pt1z"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Alibaba Group Holding Limited", "value": "/m/07s6ctl"}, {"text": "Avanade", "value": "/m/094456"}, {"text": "Capgemini", "value": "/m/03vlk0"}, {"text": "Comtel Solutions Pte Ltd", "value": "/g/11dxpztgnb"}, {"text": "DELL", "value": "/g/11c54ch2jm"}, {"text": "Ericsson", "value": "/m/02kyh"}, {"text": "HTZ Resources", "value": "/g/11h21p9b4d"}, {"text": "Infinite Computer Solutions Pte Ltd", "value": "/g/11g9mj72yz"}, {"text": "Michael Page", "value": "/m/04cxldw"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "Orange Business Services", "value": "/m/08zvyz"}, {"text": "Recruitment Hub Asia Pte Ltd", "value": "/g/11dxpww_0f"}, {"text": "TEKsystems (Allegis Group Singapore Pte Ltd)", "value": "/g/11b6g4bkv0"}, {"text": "Talent Trader Group Pte Ltd", "value": "/g/11dxpmlc5b"}, {"text": "Tata Consultancy Services", "value": "/m/01psx8"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "VMware", "value": "/m/01t9k5"}, {"text": "Verizon", "value": "/m/07_dn"}, {"text": "A-Speed Infotech Pte Ltd", "value": "/g/11g9mxswl4"}, {"text": "ABeam Consulting", "value": "/g/11bc6whr_f"}, {"text": "Amazon Web Services (AWS)", "value": "/g/11dxprr2xv"}, {"text": "Amazon Web Services Singapore", "value": "/m/0rznzt1"}, {"text": "Aon", "value": "/m/0z7n"}, {"text": "Avaya", "value": "/m/01sqlk"}, {"text": "Azendian Solutions Pte Ltd", "value": "/g/11dxpvcjj2"}, {"text": "Big Cloud", "value": "/g/11c743lwsr"}]}]}