{"search_metadata": {"id": "6082799caf63046a88fa7ccb", "status": "Success", "json_endpoint": "https://serpapi.com/searches/b6c0414121ffadc6/6082799caf63046a88fa7ccb.json", "created_at": "2021-04-23 07:39:08 UTC", "processed_at": "2021-04-23 07:39:08 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28data+analyst%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=60", "raw_html_file": "https://serpapi.com/searches/b6c0414121ffadc6/6082799caf63046a88fa7ccb.html", "total_time_taken": 0.86}, "search_parameters": {"q": "(data analyst) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "60"}, "jobs_results": [{"title": "Data Analyst, Finance (SAP Lumira/BI/BWH)", "company_name": "Epson Singapore", "location": "Singapore", "via": "via LinkedIn", "description": "Company Profile\n\nAs a global technology leader, Epson creates and delivers technology solutions for businesses and consumers, from inkjet printers and digital printing systems to 3LCD projectors, smart glasses, sensing systems and industrial robots.\n\nEpson has a comprehensive infrastructure of service outlets, solution centres and manufacturing facilities supporting customers in the region. Today, the company continues to exceed customer expectations with its wide range of high precision, energy-efficient products in the region.\n\nJob Summary\n\n- Data Analyst interprets data and turns it into information which can offer ways to improve a business, thus affecting business decisions\n\n- Data Analyst gathers information from various sources and interpret patterns and trends\n\n- Data Analyst’s job focus on the analytical nature of the role. Once data has been gathered and interpreted, the Data Analyst will report back what has been found in a comprehensive study to the wider business/relevant... colleague\n\n- Data Analysts makes recommendations about the methods and ways in which a company obtains and analyses data to improve quality and the efficiency of data systems\n\nKey Accountabilities\n\n- Defining new data collection and analysis processes\n\n- Collecting and interpreting data\n\n- Analysing results\n\n- Reporting the results back to the relevant members of the business\n\n- Identifying patterns and trends in data sets\n\n- Working alongside teams within the business or the management team to establish business needs\n\nKey Job Requirements\n\nJob / Skills Competencies\n\n- Experience in data models and reporting packages\n\n- Experience in BI or BWH\n\n- Ability to analyse large datasets\n\n- Ability to write comprehensive reports\n\n- Strong verbal and written communication skills\n\n- An analytical mind and inclination for problem-solving\n\n- Attention to detail\n\n- Pursue organizational compliance consistent with sound and high standard of conduct\n\n- Being vocal, self-driven, motivated, able to work with minimal supervision, contribute to ideas and knowledge are highly desirable\n\nCritical Work Experience\n\n- At least 4 years of hands-on operation experience as data analyst\n\nQualifications\n\n- Pursuing or completed relevant professional data analytic qualification or certification\n\n- Candidate with diploma/degree in Computer Science with accounting/business reporting knowledge will be a plus factor", "extensions": ["7 days ago", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEYXRhIEFuYWx5c3QsIEZpbmFuY2UgKFNBUCBMdW1pcmEvQkkvQldIKSIsImNvbXBhbnlfbmFtZSI6IkVwc29uIFNpbmdhcG9yZSIsImNvbXBhbnlfbWlkIjoiL2cvMTFkeHBmcV90ZiIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IkNnd201SnRmY2xHR2t3R05BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2WUJDcmNCUVU1VlgwNXhVekJUUzJsSWVHc3hXbGMxVEc5SU5uUjJkRkZEYnpSWlZIcFNVemxJVWpWVlFWVlRNVGhPTkVzeVRXY3dSRmhRVVhGSlpqUmphR0ZpVDFOVU5HVlBOa1F6WVU1SVlrcGpUazlIY0dKcmFXWk9TVkJzVVhaQ1FrRnBVVVJTVTE4NVdHVnBjV0U1YXpGM2QwRlJaV0ZDZUZoc01IWnJiemwzWTBoMWNWYzRjbmd6V1hsbFNGSmpjQzFmYURSTmNEUlNOMFpWWHpkRVNYQTRhMnRGVkZwU1lYUnFaa1JNUWpseVZuVnNUa2RzY1dGakVoWnVTRzFEV1U5bWEwVkpObnAwVVdFMmMwdzNkMFJCR2lKQlQwMVpVbmRFVG1kRFV6RktMVXRZVlhWTGFUTkJSV05zVEU1eGVUQjVPREZuIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL3NnLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvZGF0YS1hbmFseXN0LWZpbmFuY2Utc2FwLWx1bWlyYS1iaS1id2gtYXQtZXBzb24tc2luZ2Fwb3JlLTI0ODc0NzQyMjE/cmVmSWQ9NDE1ZWQ2Y2MtYWY1Mi00ZmI2LTkxYjQtYTFkOWQ2NjNiNTgxXHUwMDI2dHJhY2tpbmdJZD1kbSUyQk1KOExvc1p2QUhDS0VuRzUzaWclM0QlM0RcdTAwMjZwb3NpdGlvbj0yMVx1MDAyNnBhZ2VOdW09MFx1MDAyNnRyaz1wdWJsaWNfam9ic19qb2ItcmVzdWx0LWNhcmRfcmVzdWx0LWNhcmRfZnVsbC1jbGlja1x1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Business Analyst - OSPL at OCBC Bank", "company_name": "OCBC Bank", "location": "Singapore", "via": "via BizLINKS Resources Pte Ltd", "description": "Business Analyst - OSPL at OCBC Bank\n\nJob Description\n\nDescriptionroles & Responsibilities Evaluate Business Processes, Anticipate Requirements, And Provide Compelling And Innovative Solutions Ensure Solutions Meet Business Needs And Requirements Stay Up To Date On The Latest Process And Technology To Automate And Modernize Systems Work Closely With Business, Technology And Other Stakeholders From Project Initiation, Testing To Deployment Understand Business Requirements And Translate Them Into Functional Specifications Act As A Liaison Between Business And Technology Users Requirements Job Qualifications Degree With 8 Years Of Relevant Experience Certified Scrum Master Or Certified Scrum Product Owner Experience In Agile Related Or Data Analytics Or Digital Initiatives Involving Technologies Such As Cloud, Api, Microservices, Blockchain Experience In Securities Business/ Equities Will Be Considered An Advantage Strong Analytical Skills With The Ability To Assimilate Information... Quickly And Gain Consensus From Multiple Stakeholders When Required Good Oral And Written Communication Skills, Including Documentation And Presentation Skills Comfortable Communicating Across Business Divisions And Levels Of Seniority Primary Location Singapore Job Information Technology Organization Group Operations & Technology Division Schedule Permanent Full Time Job Posting 13 Jan 2021, 1:04:36 Pm Show More\n\nOriginal Joblink : https://sg.linkedin.com/jobs/view/business-analyst-ospl-at-ocbc-bank-2330848365\n\nGoogle Company: https://www.google.com/search?q=Business%20Analyst%20-%20OSPL%20at%20OCBC%20Bank", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJCdXNpbmVzcyBBbmFseXN0IC0gT1NQTCBhdCBPQ0JDIEJhbmsiLCJjb21wYW55X25hbWUiOiJPQ0JDIEJhbmsiLCJjb21wYW55X21pZCI6Ii9tLzA1NXIyNyIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IktaUFpHY2g4UTRrdjZuVUtBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhWRlpXV0dsUk5ITmhWVzFDZHpoVlRFWm9WRFZOVlhCSE1YVkViMjV2VEVzelVXSlBUVTVwZW5GbWJuWkpiMEpJVG5ZMFVUbGxRbVV6WW5JeFMzVXROVFF3U0hkRk5VcG1ORVpUWDFneVRrZ3RPVkpsTmtVeVpFbFBXVkJ0WTFSMlpsZ3hOVmMxZG1wM2VYVkZUSEUyUjJwMmFqSlpaMUpOWkRsNWNrVnRlV1pJTURndFFUQlNWRE16ZVhsdVdrWXRhekJKT0ZaSFYweFBMVXQzRWhadVNHMURXVTltYTBWSk5ucDBVV0UyYzB3M2QwUkJHaUpCVDAxWlVuZERiVXRzV0V4dmFreGxNR2hxU0dwaFJVOUxXRTR5Y3pOV1N6aEIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18xMyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCaXpMSU5LUyBSZXNvdXJjZXMgUHRlIEx0ZCIsImxpbmsiOiJodHRwczovL3d3dy5iaXpsaW5rcy5jb20uc2cvaW5kZXgucGhwL2pvYi1saXN0aW5ncy1wdWJsaWMvOTEtYW5hbHlzdHMvNTAwMS1idXNpbmVzcy1hbmFseXN0LW9zcGwtYXQtb2NiYy1iYW5rLTUwMDE/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Bloomberg Intelligence   Fixed Income Strategy Associate", "company_name": "Bloomberg", "location": "Singapore", "via": "via MNC Jobs Singapore | MNC Jobs In Singapore", "description": "Bloomberg Intelligence (\"BI\") provides a comprehensive view of an industry and its key constituents. We give you unsurpassed depth and breadth at the sector, industry and company levels. We offer valuable written analysis, industry data and interactive charting and functions from a team of independent experts. BI research coverage also includes economics, strategy, credit, regulation, litigation, and environmental, social, and governance. Our work gives trading and investment professionals deep insight into where crucial industries and markets stand today and where they may be heading next.\n\nWhat's in it for you:\n\nBeing part of a growing global research team, responsible for supporting senior analysts in the Bloomberg Intelligence Fixed Income, Commodities and Currencies (FICC) Strategy team. The right candidate will be interested in credit and currency markets, assist analysts with generating and supporting insights with a mix of fundamental and quantitative approaches, and help with... the frequent publication of research.\n\nThe analysis will be based on the Barclays / Bloomberg Bond Indices and data sets, Bloomberg Valuation (BVAL) bond prices, Bloomberg's portfolio analysis tools including PORT, MARS, DRSK, and SRSK, Bloomberg Intelligence data and analysis, and third party data vendors where appropriate.\n\nWe'll trust you to:\n• Actively contribute to the team’s daily research activities (i.e. data, written research, idea generation)\n• Interact regularly with clients via our online messaging systems, telephone and client visits\n• Conceptualize, construct and maintain research dashboards\n• Help to identify, support and maintain critical data and functionality on the Bloomberg terminal\n• Develop and maintain relationships with internal and external constituencies\n• Review submitted research for adherence to global quality standards\n• Participate in department-wide special projects\n\nYou need to have:\n• Graduated with a Bachelor's degree, preferably with a concentration in a quantitative field\n• 2+ years of financial market research experience\n• Strong written and verbal communication skills\n• High attention to detail\n• Demonstrable research and analytical skills\n• Strong organization skills and capable of handling multiple projects\n• An ability to meet deadlines, logically tackle problems and set priorities\n\nWe'd love to see:\n• Proficient in statistical and/or econometric modeling; basics of financial engineering\n• Strong interest in learning about corporate credit and / or global rates and currency markets\n• CFA designation, or pursuit thereof\n• A high level proficiency with Microsoft Excel and/or knowledge of VBA\n• Previous work experience with the Bloomberg Terminal.\n\nIf this sounds like you:\n\nApply if you think we're a good match and we'll get in touch with you to let you know next steps. In the meantime, check out http://www.bloomberg.com/professional/bloomberg-intelligence/.\n\nWe are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJCbG9vbWJlcmcgSW50ZWxsaWdlbmNlICAgRml4ZWQgSW5jb21lIFN0cmF0ZWd5IEFzc29jaWF0ZSIsImNvbXBhbnlfbmFtZSI6IkJsb29tYmVyZyIsImNvbXBhbnlfbWlkIjoiL20vMDI3c202IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiZ21rZ0o4dzBVZW01WFgzeEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFUzaE1kV2xMWVU0eFpqa3RXbVpPWkRscFFVcFlWV2RvZG14c1JISmpRMjVvV0V3elMwMWtPVWxNWDJsWVpVeDFObWhYVEZoTk1GazFTR2hPYVZRME4yTnhWQzFEVFY4NFNrWm1jbGMzYUUxMVFXZ3dVbWR2ZDBGVFNUTkJTMFpYYjBvdE1UaE9VbmM1UVZGM1FVWlJURnBqY0RaYU0zRk9NQzEyTURnM04ydE5jbE5uTmtZNGIyOUhWR0pHVURKQ2FEZFlkREZTY0Y4NFRHeEJFaFp1U0cxRFdVOW1hMFZKTm5wMFVXRTJjMHczZDBSQkdpSkJUMDFaVW5kQ01VVTNOMTlFU1VKWmFIUjJSMjlvWVdkalpUaExhVWh2WHpGbiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzIwIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1OQyBKb2JzIFNpbmdhcG9yZSB8IE1OQyBKb2JzIEluIFNpbmdhcG9yZSIsImxpbmsiOiJodHRwczovL3NnLm1uY2pvYnouY29tL2pvYnMvYmxvb21iZXJnLWludGVsbGlnZW5jZS1maXhlZC1pbmNvbWUtc3RyYXRlZ3ktYXNzb2NpYXRlLXNpbmdhcG9yZS0xMDUzOTc/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Product Analyst, APAC", "company_name": "None", "location": "Singapore", "via": "via Jobs", "description": "Roles & Responsibilities At foodpanda we're on a mission to redefine how tech, food, people and culture are connected operating in 12 countries worldwide. Our team is working on big challenges and complex scalability problems as we grow 6X annually processing millions of orders a year. You'll be part of a highly collaborative cross-functional agile squad that always includes frontend and backend engineers, design and product owners. Our squads operate in an open and fast-paced environment with very flat structures where everyone has a say. We work on a large scale, complex systems where you can reach users on a global scale whilst enjoying a high level of autonomy and influence and a flexible working environment. Here you can learn, thrive and become a better engineer, designer and product manager. Product Analyst, APAC As a Product Analyst, APAC , you will be working closely with the Global Product Analytics team based in Berlin and the Product and Tech squads in Singapore. You will... have end-to-end ownership of data: define and implement tracking requirements, set up A/B tests, analyse large datasets to provide actionable insights, and communicate the results to relevant stakeholders. You will be a critical member in defining the product strategy and continued success of foodpanda. What's on the menu: Tracking & QA: Determine what needs to be tracked and measured. You will be responsible for tracking user interactions and clickstream data to understand customer behaviour. Product Strategy: Evaluate and define product and business KPIs and metrics along with Product Managers and Product Designers. Data Visualization: Democratize data by building customized dashboards & reports for relevant stakeholders. Analysis: Offer deep dive analysis to key stakeholders across all teams and products, in order to determine product features and UX optimization strategies. What you can bring to the table: Overall 6 years of experience with at least 4 years of experience specifically in Product Analytics, preferably in e-commerce You've completed a degree in statistics, mathematics, economics, computer science or an equivalent education or possess relevant practical experience Very good communication skills in English, both written and oral Data Analysis: Strong experience in SQL (BigQuery) and Python (alternatively R) A/B Testing: Experience designing experiments and analyzing results with a solid background in statistics Tracking Technologies: Google Analytics (Preferably IQ certified) or similar alternatives e.g. Adobe Analytics/Omniture, SnowPlow, etc. Tag Management Systems: Preferably Google Tag Manager or similar alternatives e.g. Tealium, Adobe Dynamic Tag Management, etc. Data Visualization Technologies: Preferably Google Data Studio or Tableau or similar alternatives e.g. Looker, QlikView, etc. QA Technologies: Preferably Android Studio, Charles Web Debugging Proxy, or similar alternatives Observepoint, etc. About foodpanda foodpanda (small 'f') is the world's favourite way to order food online from the comfort of your home or office. Whether it's getting your hands on your favourite pasta, kebab or pizza, we believe that no one should have to suffer from hunger attacks ever again. Our parent company, Delivery Hero, is a global leader in the food delivery industry processing over 3 million orders every day and operating in 40 markets in the world, with 18,000 employees and approximately 500,000 restaurant partners. In APAC, foodpanda operates in over 150 cities across 12 countries. Trivial problems can always become large technical challenges at scale. If you love technology, efficiency and simplicity as much as we do, there is no better place to experience this than in foodpanda. We always genuinely care about experience, efficiency and scalability. We do not just solve technical problems but build the foundations for foodpanda's operations with the best tools on hand. Roles & Responsibilities At foodpanda we're on a mission to redefine how tech, food, people and culture are connected operating in 12 countries worldwide. Our team is working on big challenges and co Skills: Analysis, Business Analysis, Collaboration, complex systems, Data Analysis, Management, Process Improvement, Processing, Product Development, Product Management, Project Management, Environment, Operating, Challenging, Agile Development Experience: 5.00-7.00 Years", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9kdWN0IEFuYWx5c3QsIEFQQUMiLCJjb21wYW55X25hbWUiOiJOb25lIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJScjVDcEIyRTJ1X2h6SVROQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnMiLCJsaW5rIjoiaHR0cHM6Ly9zZy5maWRhbnRvLmNvbS9qb2JzL2pvYi1vcGVuaW5nL2luZm9ybWF0aW9uLXRlY2hub2xvZ3ktcHJvamVjdC1tYW5hZ2Vycy9wcm9kdWN0LWFuYWx5c3QtYXBhYy0yNzU3MjM1NjQ/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Data Analyst", "company_name": "Sciente International Pte Ltd", "location": "Singapore (+1 other)", "via": "via Monster Singapore", "description": "Job Summary\n\nWe are seeking a data analyst for a well established organization in the banking industry to help with their regulatory reporting projects.\n\nMandatory Skill-set\n• Degree in Computer Science, Computer Engineering or Information Systems;\n• At least 3 years of experience in data related projects and with data visualization, dashboard creation;\n• Hands-on experience : Qlik Sense / Qlikview / Tableau;\n• Proficient in SQL based querying of database for data analysis;\n• Prior experience in banking;\n• Knowledgeable in data analytics processes;\n• Strong communication skills with an analytical mindset.\n\nDesired Skill-set\n• Prior experience in regulatory reporting, such as BCBS239 related work;\n• Proficient in Informatica IDQ, QlikSense;\n• Relevant Qliksense / Qlikview / Tableau Certification.\n\nResponsibilities\n• Understand business requirements and build BCBS239 rules;\n• Create and upload manual templates for data quality processing;\n• Conduct data quality checks;\n• Build and... improve regulatory reporting dashboards and conduct monthly reporting;\n• Manage stakeholders and provide training to business users on new reports and dashboards.\n\nShould you be interested in this career opportunity, please send in your updated resume to apply@sciente.com at the earliest.\n\nWhen you apply, you voluntarily consent to the disclosure, collection and use of your personal data for employment/recruitment and related purposes in accordance with the SCIENTE Group Privacy Policy, a copy of which is published at SCIENTEs website (https://www.sciente.com/privacy-policy).\n\nConfidentiality is assured, and only shortlisted candidates will be notified for interviews.\n\nEA Licence No. 07C5639", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEYXRhIEFuYWx5c3QiLCJjb21wYW55X25hbWUiOiJTY2llbnRlIEludGVybmF0aW9uYWwgUHRlIEx0ZCIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiWnY3R3VNTWhVY2VTN2FwbEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNb25zdGVyIFNpbmdhcG9yZSIsImxpbmsiOiJodHRwczovL3d3dy5tb25zdGVyLmNvbS5zZy9hbXAvam9iLXZhY2FuY3ktZGF0YS1hbmFseXN0LXNjaWVudGUtaW50ZXJuYXRpb25hbC1wdGUtbHRkLXNpbmdhcG9yZS0yLTcteWVhcnMtMjYxMDc3NzcuaHRtbD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Data Analyst, Compliance Transformation (Associate/Senior Associate)", "company_name": "Bank of Singapore", "location": "Singapore", "via": "via Laimoon.com", "description": "At Bank of Singapore, we are constantly on the lookout for exceptional individuals to join our team. We promote a culture of openness, teamwork and fairness. Most importantly, we invest in our people through our programmes that develop them on both professional and personal levels. Besides attractive remuneration packages, we offer non-financial benefits and opportunities to develop your potential within OCBC Group's global network of subsidiaries and offices. If you have passion, drive and the will to succeed, rise to the challenge today!\n\nBank of Singapore opens doors to new opportunities.\nStart your career with Bank of Singapore as a Data Analyst in our Compliance Transformation Teamt!!\nThe role will be the subject matter expert for the department in using data analytics and Artificial Intelligence (\"AI\")/Machine Learning.\n• Implement automated solutions such as Python to automate manual processes in data collection, data transformation and data aggregation to generate analytical... reports.\n• Implement and maintain dashboards using data visualization tools such as Power BI/Qlikview for various Compliance reporting and data analysis.\n• Drive and implement Data Analytics and Machine Learning in the digital compliance processes such as alert prioritization AI model.\n• Work with Data Hub to develop use cases for reporting, dashboard creation and data analysis\n• Collaborate with IT Project Team to integrate AI Models and analytics solution into the Compliance Front-End platform.\n• Act as Data & Analytics Power Users to provide advice to Compliance SME on using data at the core of their business decision to drive data analytics journey in Compliance.\n\nQualifications\n• 5-7 years of experience with at least 2-3 year experience in developing data analytics solution or machine learning models.\n• Experience in design, development and implementation of data analytics solution using Python and data visualization tools such as Power BI / Qlikview / Tableau.\n• Good knowledge in statistical analysis, data mining and processing, decision tree design, clustering, knowledge of SQL, Python or other analytics tools are essential.\n• Good knowledge in Artificial Intelligence based predictive algorithm, Machine Learning, Natural Language Processing (NLP), data science and data mining.\n• Ability to work with unstructured data, parallel databases and parallel query processing.\n\nCompliance/Legal", "extensions": ["5 days ago", "Full–time"], "detected_extensions": {"posted_at": "5 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEYXRhIEFuYWx5c3QsIENvbXBsaWFuY2UgVHJhbnNmb3JtYXRpb24gKEFzc29jaWF0ZS9TZW5pb3IgQXNzb2NpYXRlKSIsImNvbXBhbnlfbmFtZSI6IkJhbmsgb2YgU2luZ2Fwb3JlIiwiY29tcGFueV9taWQiOiIvbS8wcjN2Y3ptIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoib1ZKMWdsTUZyR3NJODQxa0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZZQkNyY0JRVTVWWDA1eFUzWm5WRzVEU3pGTFUxZHBkMHRDVVVkc2RqaE9NV3BoVlhCdlUzVlVXamxUVGxoUFdpMVRkRE4yUVZkNlZtRkNkVUUxYm5SbU9VRmtjV2t3WnpGeFNIZDFhemxUYVU5M1dESnlXWE5aWkdkMVZtbEdWMU5xVFdoMFp6WktZbnBXWldjdFMxVldkVkZoZEdJd2NYa3lNa1ZxV2taM1NVWXhiMk5GYWtkaVEwaFNRbVJ4WDNjM2QycEZVRWRSWm05VVFVOXdRelZ5T0VwWmVDMU5jRk4zYTJkc1FVeFRORVpwZWxCVGVXZE1ha0paRWhadVNHMURXVTltYTBWSk5ucDBVV0UyYzB3M2QwUkJHaUpCVDAxWlVuZERTMVpNVFdkcldtUjJSVWx2WDFCbFExcEJaMWhGU1VKMVJ6WkIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18zNSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMYWltb29uLmNvbSIsImxpbmsiOiJodHRwczovL2pvYnMubGFpbW9vbi5jb20vam9icy9leHRlcm5hbHZpZXcvMjYwMTM2NTE/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Reporting Data Analyst, Mobile Marketing (1 year contract)", "company_name": "Expedia Group", "location": "Singapore", "via": "via Bayt.com", "description": "Reporting Data Analyst, Mobile Marketing (1 year Contract)\n\nExpedia is one of the largest online travel companies in the world, with an extensive brand portfolio that includes some of the world’s leading online travel brands. Collectively, the Expedia group brands cover virtually every aspect of researching, planning and booking travel. The Expedia portfolio serves both leisure and business travelers across a diverse range of tastes and budgets.\n\nMobile is a key strategic area of growth for Expedia group with our native App transactions outpacing industry growth. Do you want to work with a passionate team driving Expedia's fastest growing platform? Would you like to be a key member of our team providing data insights and shaping our vision moving forward? Do you love being on the cutting edge of new technology? If so, we have an exciting opportunity to join our Mobile App Marketing and Analytics teams as a Reporting Data Analyst. Reporting to our Director of Apps Engagement and... working as part of our Analytics org, this is an impactful role working with a team of high performing Mobile experts, Analysts and Data Scientists.\n\nWhat you’ll do:\n• Actively support multiple teams across the organization, including Marketing, Finance, Product, and Data Science with data gathering, mining, and report building\n• Deliver impactful analysis regarding key market forces and apply analytics to present tangible business problems/actions (e.g. seasonality, competitor actions, customer behaviors, etc.)\n• Develop and maintain business reports using expertise in SQL, Excel and Tableau Server\n• Communicate complex analytical topics in a clean & simple way to team\n• Troubleshoot and identify root cause of operational issues (e.g. data quality, critical process degradation).\n• Automate and/or streamline repetitive processes to improve individual and team productivity\n• Work directly with business owners to design, plan, and analyze A/B and Multivariate tests\n• Use statistics, distributions and confidence intervals to support decisions based on data. Manipulate large data sets for business insights and implement solutions to improve ad performance\n• Understand and contribute to existing algorithm development and refinement\n• Collaborate with Product and Technical Teams to contribute to Mobile tools development\n\nWho are you:\n• Bachelor’s degree in a quantitative field, such as Economics, Statistics, Engineering, Applied Mathematics or related field or equivalent related professional experience\n• Strong quantitative, analytical and problem-solving skills, combined with a high level of initiative and ability to thrive in a multi-tasking, dynamic environment\n• Experience writing and working with complex queries in SQL/Hadoop\n• Foundational statistics experience (e.g. t-tests, distributions)\n• Shown success working cross-functionally\n• Good verbal and written skills\n\nAbout Expedia Group\n\nExpedia Group (NASDAQ: EXPE) powers travel for everyone, everywhere through our global platform. Driven by the core belief that travel is a force for good, we help people experience the world in new ways and build lasting connections. We provide industry-leading technology solutions to fuel partner growth and success, while facilitating memorable experiences for travelers. Expedia Group's family of brands includes: Brand Expedia®, Hotels.com®, Expedia® Partner Solutions, Vrbo®, Egencia®, trivago®, Orbitz®, Travelocity®, Hotwire®, Wotif®, ebookers®, CheapTickets®, Expedia Group™ Media Solutions, Expedia Local Expert®, CarRentals.com™, and Expedia Cruises™.\n• LI-JS1\n\nExpedia is committed to creating an inclusive work environment with a diverse workforce.All qualified applicants will receive consideration for employment without regard to race, religion, gender, sexual orientation, national origin, disability or age", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJSZXBvcnRpbmcgRGF0YSBBbmFseXN0LCBNb2JpbGUgTWFya2V0aW5nICgxIHllYXIgY29udHJhY3QpIiwiY29tcGFueV9uYW1lIjoiRXhwZWRpYSBHcm91cCIsImNvbXBhbnlfbWlkIjoiL20vMDNncTQyMCIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImJidGpuYm1sei1EZTJhNjlBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhVWEZ0VG5sRU55MXpiRE5OTjJJeVdIZDJaa1YzUkZWbVIzYzFkbGx0VlVwSmNYTXpPSFZ6V2xRMVlreHZUak5GYVhKQmExTjZjMk5NVlc1RWFUZGpPRVJRVm5SVWRtNDRjRzFSUWtaWmJGQjNTWEY2WTJ4aVJETjBaVTl2WjFkRmJXSlVUV1Z1ZDNaM1pGRklhRjlFZEc1d0xYQnlWakZGVjBkRk9GaE5NMk10WkZGbE9VTmZSVGhFUm1VMkxYbHFRbE0zZDJ0dFEzUk9kR3AzRWhadVNHMURXVTltYTBWSk5ucDBVV0UyYzB3M2QwUkJHaUpCVDAxWlVuZERUSFY2Y2sxclZWQnVSRU5hVFd0dldtUnhUMXBxVTBzeFZWZG4iLCJmY3YiOiIzIiwiZmNfaWQiOiJmY180MyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCYXl0LmNvbSIsImxpbmsiOiJodHRwczovL3d3dy5iYXl0LmNvbS9lbi9zaW5nYXBvcmUvam9icy9yZXBvcnRpbmctZGF0YS1hbmFseXN0LW1vYmlsZS1tYXJrZXRpbmctMS15ZWFyLWNvbnRyYWN0LTU4Nzk5MjIwLz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "VP/Assistant VP. SIEM Big Data Security Analytics, Group Information Security", "company_name": "United Overseas Bank", "location": "Singapore", "via": "via EFinancialCareers", "description": "VP/Assistant VP. SIEM Big Data Security Analytics, Group Information Security\n\nPosting Date: 10-Apr-2021\n\nLocation: Alexandra, Singapore, SG\n\nCompany: United Overseas Bank Limited\n\nAbout UOB\nUnited Overseas Bank Limited (UOB) is a leading bank in Asia with a global network of more than 500 branches and offices in 19 countries and territories in Asia Pacific, Europe and North America. In Asia, we operate through our head office in Singapore and banking subsidiaries in China, Indonesia, Malaysia and Thailand, as well as branches and offices.\nOur history spans more than 80 years. Over this time, we have been guided by our values - Honorable, Enterprising, United and Committed. This means we always strive to do what is right, build for the future, work as one team and pursue long-term success. It is how we work, consistently, be it towards the company, our colleagues or our customers.\n\nAbout the Department\nThe Technology and Operations function is comprised of five teams of specialists... with distinct capabilities: business partnership, technology, operations, risk governance and planning support and services. We work closely together to harness the power of technology to support our physical and digital banking services and operations. This includes developing, centralising and standardising technology systems as well as banking operations in Singapore and overseas branches.\n\nJob Responsibilities\nThe Security engineer will support the day to day Security application administration, operations and development activities of the bank security suite of products with key objective in maintain, develop and enhance the detection, prevention, response and monitoring capabilities of GSOC using SIEM & Big Data Security Analytics platform and solutions.\n\n• Provide administration and operations end to end support to SIEM & Big Data Security Analytics Platform and other security solutions related infrastructure deployed within the bank.\n• Drive upgrades and migration to ensure solutions and or related platform are maintained in tip-top working conditions with proper documentation and RCA.\n• Test and manage application functionalities, system and infrastructure changes, upgrades, enhancements, patches and troubleshooting.\n• Work within established practices and handling guidelines to triage device outages.\n• Available to respond to any requests and assist with troubleshooting activities along with proper documentation.\n• Resolve standard/routine issues with no guidance and complex/unusual issues with minimal guidance.\n• Capable of juggling variety of priorities and deliverables in an operational, interrupt driven environment with minimal guidance or supervision.\n• Onboarding new log sources, enabling new use cases and supporting all existing use cases.\n• Ability to understand of data generated by infrastructure and application across bank\n• Automation development on existing data feed and contextual data so we get different data from various log feeds to one location.\n• Develop and support case management workflow, reports and dashboards.\n• Manage and support the log management environment.\n• Understand all key product features and functionalities and implement them.\n• Be part of Advance Security Analytics initiatives\n• Implement new technology and process improvements for the bank.\n• Provide support for all Audit requests.\n• Manage and coordinate change & Incident process engagement with regards to current security solutions.\n• Communicate effectively with a variety of internal teams and external contacts including technical and executive contacts.\n• Research and define requirements for new projects, perform product evaluation and technical Proof of Concept.\n• Working on Network security tools for operational tasks on need basis Others:\n\n• Normalization/Parsing the data/logs\n• Experience with any insider threat tools\n• Follow MIRTE ATT&CK framework and NIST methodology\n• Conduct regression testing on existing use cases and future enhancement by adding more new use cases to protect the bank from sophisticated Cyber-attacks.\n\nJob Requirements\nEducation\n\n• ITC/Diploma/Degree in engineering/Computer Science / IT/Cyber Security from a recognized education institution\n• Certified in leading SIEM administrator would be plus\n• Cloudera Administration or Developer Certifications\n• Professional security related qualification (e.g. SANS GCIA, GCIH etc.) will be favorable although not mandatory Technical Skills\n\n• Overall experience 8+ years of experience.\n• 4+ years of relevant experience in the area for managing SIEM, advanced SIEM or any Big Data Security Analytics\n• Hands on experience in Advanced SIEM, Security Analytics solution, Hadoop - Big Data components, Linux and database (MySQL, Oracle/SQL)\n• Very strong troubleshooting skills.\n• Strong in providing operational support to any SIEM, Big Data Security Analytics platforms and Network security.\n• Strong understanding of SIEM and Big data architecture.\n• Strong knowledge in Syslog log management platform\n• Experience in understanding end to end data flow\n• Strong knowledge in understanding OS, Proxy, Network and other main-stream Infrastructure, Application, Access and Cloud logs.\n• Strong Knowledge in developing custom parsers (regex) required for data ingestion for any infrastructure or application based data feeds.\n• Strong knowledge to optimize performance and outages related to SIEM and Big Data components.\n• Experience in normalize and data preparation to clean the data\n• Experience in Data/Device Integration and provide the data back to other platform.\n• Strong understanding of HDFS, HIVE, SOLR, HBASE, Cloudera, Impala, Spark, Kafka, REDIS, MySQL, Apache, NGINX, any other software based load balanced and SIEM components.\n• Experience in integrating workflows with SOAR.\n• Experience in Automation using any scripting languages like Python and Shell.\n• Knowledge and hands-on experience on implementing Use Cases would be add-on.\n• Strong Understanding of Network security solutions like IDS, APT etc. Soft Skills\n\n• Good written and verbal communication skills\n• Process and procedure adherence\n• Strong analytical and problem solving skill\n• Effective time management and organizational skills.\n\nBe a part of UOB Family\nUOB is an equal opportunity employer. UOB does not discriminate on the basis of a candidate's age, race, gender, color, religion, sexual orientation, physical or mental disability, or other non-merit factors. All employment decisions at UOB are based on business needs, job requirements and qualifications. If you require any assistance or accommodations to be made for the recruitment process, please inform us when you submit your online application.\n\nApply now and make a difference", "extensions": ["3 hours ago", "Full–time"], "detected_extensions": {"posted_at": "3 hours ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJWUC9Bc3Npc3RhbnQgVlAuIFNJRU0gQmlnIERhdGEgU2VjdXJpdHkgQW5hbHl0aWNzLCBHcm91cCBJbmZvcm1hdGlvbiBTZWN1cml0eSIsImNvbXBhbnlfbmFtZSI6IlVuaXRlZCBPdmVyc2VhcyBCYW5rIiwiY29tcGFueV9taWQiOiIvbS8wNGdqZDEiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJGbTQxbTZqZmpwcGx4WW51QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdllCQ3JjQlFVNVZYMDV4VkVwTGExWlVSa2RFWkhkV1FUUnZkV04zUTNOdVkydGpWVVpUYVhKb1FYbElUV1JUTmpORlNWTktRVGM0VTBSTWRXeHJjVGxQWld4RWJ6WktMVUpEVjJOblFVMDFlRFo0V1VKT1ltSmZMVW8zV0VSUlJHRk1PV1ptVERkUlExVm5SemxHV1VGZlkybFFWblJJTWxkWGNGbzNTMDQyUXpKU01TMXJRM050VkZvMGNuRnhaM1JuUzFOM2JuQXdOVEExY1ZaQmRqZFdkR0ZHVVhod1drVjRaelJzWkV4dFZGZGtUVVpTUkVsQ2VHRk5FaFp1U0cxRFdVOW1hMFZKTm5wMFVXRTJjMHczZDBSQkdpSkJUMDFaVW5kRFRtRmtjWHB4TWtzelR6aHhYM0pSUWtSdVptNVpUVWRSVjNWQiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzUxIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEVGaW5hbmNpYWxDYXJlZXJzIiwibGluayI6Imh0dHBzOi8vd3d3LmVmaW5hbmNpYWxjYXJlZXJzLnNnL2pvYnMtU2luZ2Fwb3JlLVNpbmdhcG9yZS1WUEFzc2lzdGFudF9WUF9TSUVNX0JpZ19EYXRhX1NlY3VyaXR5X0FuYWx5dGljc19Hcm91cF9JbmZvcm1hdGlvbl9TZWN1cml0eS5pZDEwNzU0MzU0P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Data Analyst", "company_name": "Titansoft Pte Ltd", "location": "Singapore (+1 other)", "via": "via Jobs | Fidanto", "description": "Attractive compensation and benefits package Job DescriptionGame changer, armed with data. You know all about our users, through data analysis. And because you do, you can identify issues and present insights to our Product Owners, spurring them into action. Working with your team, you play a key role in enhancing our business value. After all, you're the one who ignited the spark. And no spark, no fire.What a Data Analyst does in Titansoft: Conduct data analysis to support Product Owner and Business Leaders in business decisions and requirements Develop and automate reports for analytical purposes Collaborate with other Product Development teams to understand their business needs, formulate and complete end-to-end analysis that includes data gathering, analysis, ongoing scaled deliverables and presentations Support key decision makers to improve products and services What we are looking for in a Data Analyst: Qualifications Minimum Bachelor in Mathematics, Statistics, Finance... Computer Science, Information Technology or other equivalent qualifications Experience Experience working with statistical software (e.g. R, Python, Excel, etc.) Basic statistical principles and practical applications Experience in measuring cost and production Experience in scripting with SQL Skills A/B and Multivariate testing management Data visualization (such as Tableau, Excel, etc) Ability to translate analysis results into business recommendations and insights Ability to present the insights clearly to technical and non-technical audiences Strong written, verbal communication and presentations skills What makes a (Super!) Data Analyst in Titansoft AKA the \"great to haves\": Deep interest and aptitude in data, metrics, analysis and trends, and applied knowledge of measurement, statistics and program evaluation Please apply for our position at the following link below. https://www.titansoft.com/en/career/72 What everyone gets in Titansoft (psst. We didn't get that Best Tech Company to Work for Award in 2017 for nothing!) 18 days of rest and relaxation for each year (P.S. It gets even better over the years!) Competitive salaries and bonuses bench-marked against big players in the industry (Yeap, those companies!) Flexible working hours (Sleep in a little longer after fixing that pesky bug from last night) Comprehensive insurance coverage Very well-stocked pantry (We've never heard of the term 'Hunger Games', nope) Communities of Practice and Workshops catered for your growth and learning Substantial subsidies and programs to keep that creative flow while having fun (Health promotion program, annual overseas company outing, an annual dinner that nobody will ever forget, etc.) Hardcore work and hardcore fun! Additional Information Junior Executive Qualification Bachelor's Degree, Post Graduate Diploma, Professional Degree Titansoft Pte Ltd is a software company that develops tailor-made software solutions for our global clientele, empowering them in their quest to be the industry leaders. Yes, we develop full IT solutions for our clients. Fire and forget - that’s not our style. Our approach is to always inspect and adapt, continuously learning even as we make mistakes along the way - which is totally ok! We are passionate in our work and are continuously improving not just our products, but also our processes and most importantly, ourselves! Check us out on our blog: https://blog.titansoft.com.sg Key Awards & Achievements 2019 Singapore Quality Class (People Niche) Best Company to Work for in Asia 2019 2018 Best Company to Work for in Asia 2018 2017 Certified with ISO/IEC 27001:2013 for Standard of Information Security Management System Dun & Bradstreet Business Eminence Award Best Tech Company to Work For 2017 Award Nominated as a finalist for 3 categories: 'Best Work-Life Balance ", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEYXRhIEFuYWx5c3QiLCJjb21wYW55X25hbWUiOiJUaXRhbnNvZnQgUHRlIEx0ZCIsImNvbXBhbnlfbWlkIjoiL2cvMTFnNzA1Mmo4cCIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImlIV0JxWlFkU1VKWTZQZ0ZBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2WUJDcmNCUVU1VlgwNXhVa1J0UXpOQlVWVTFkbXRGWmxoMWJUZEhSRGsxVVY4NUxVbERlVTloUkdGTVVEZGZVbEpyYkd0NVdtWnRhRVpUYWtwaVpERnlhelZMZUUxWVVuWXlRVFJqYms1c1IzSXRNa0ZvTjNwNlRERXRSRzVqTUVSQmIwa3dabmxSYjNoNGFEZGpWR05XV0VocFVubFhZM2gxWjNSdFRqRXlTWGw1ZVVWT2NHbGpXazFGUmtKRWR6QmljMWN4T1VkQlRteEhjMmg2WVhWMmF6Sk9kV000ZW5ORWVsZGZWak5vT1d4WmMyeDBUbGhLVkcxakVoWnVTRzFEV1U5bWEwVkpObnAwVVdFMmMwdzNkMFJCR2lKQlQwMVpVbmRCV25FMFNtaGtTVFJNWkRGTFpYYzJWSEJaY0cxWE0wZFZhbFJSIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNTkiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9icyB8IEZpZGFudG8iLCJsaW5rIjoiaHR0cHM6Ly9zZy5maWRhbnRvLmNvbS9qb2JzL2pvYi1vcGVuaW5nL2RhdGFiYXNlLWFkbWluaXN0cmF0b3JzL2RhdGEtYW5hbHlzdC0yNzU1MTgwOTM/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Analyst & Application Admin (1 yr contract /Finance / dashboard / up to 5k) (BB-484FB)", "company_name": "PEOPLE PROFILERS", "location": "Singapore (+1 other)", "via": "via BeBee", "description": "Job Description: √ Contract Renewable √ MNC √ Completion Bonus Responsibilities: ·In charge of administrating our Internal Audit and InternalControl tool, in close contact with worldwide Internal Auditors and InternalControllers. ·Provide efficient tool and support to the world-wide network ofInternal Control (administrator of the application with another colleague) ·Develop macros to improve the application and dashboard Visualization, data analytics, VBA, SQL and excel macros Requirements •Min Diploma / data analytics certification (example ACDA) with 2years experience in Data analytics & dashboard visualization and projectmanagement •Advanced level in office tools and analytics. •Excellent verbal and written communication skills •Ability to interact effectively with various levels of management isrequired. Outstanding verbal, presentation & facilitation skills pluseffective listening skills, high energy and engaging. •Team Player AllSuccessful candidates can expect a very... competitive remuneration package and acomprehensive range of benefits. Weregret that only shortlisted candidates will be notified. CindyChar Sin Yi EALicense Number: 02C4944 RegistrationNumber: R1765345 PeopleProfilers Pte Ltd Tel:69509736 11Collyer Quay, The Arcade, #13-01, Singapore 049317 Required Skills: Remuneration Dashboard Bonus Audit Facilitation Data Analytics Excel Resume Internal Audit Analytics Energy LTD Email SQL Project Management Finance Communication Management", "extensions": ["20 hours ago", "Contractor"], "detected_extensions": {"posted_at": "20 hours ago", "schedule_type": "Contractor"}, "job_id": "eyJqb2JfdGl0bGUiOiJBbmFseXN0IFx1MDAyNiBBcHBsaWNhdGlvbiBBZG1pbiAoMSB5ciBjb250cmFjdCAvRmluYW5jZSAvIGRhc2hib2FyZCAvIHVwIHRvIDVrKSAoQkItNDg0RkIpIiwiY29tcGFueV9uYW1lIjoiUEVPUExFIFBST0ZJTEVSUyIsImNvbXBhbnlfbWlkIjoiL2cvMTFkeHE0M25fNiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjE4UGE5NXBKOW5teldUTG1BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2WUJDcmNCUVU1VlgwNXhVME5oVG5WTGQyWkZTMlJYV1VSRVdVdFpNWEpqWWtoeWNqVTNORnBSVUhremJIUkJaVW90ZDJWT1IydFROVTF4YlVOemJFaFZSV1UwUmpCZlRrNTVPV1ZrUkVwQ2QybFZUV0prTFdoYU1GZHFVak5rUmpGTGMxQjBkMjlJWm1ZeU5XUm5Ra1ZXYmtKaFNuSjZRbk5ZTTFKNGVIaGFWRzR4YzNGelN6WXhla3hmT1ZWUlRtUnpkMU5XWTBoUGNqVjRiV3BWTlhBeVJuSTJOUzB6VEdSSWRuSjBWRWxMUW5WcFZsVlRaR05rYTBkTkVoWnVTRzFEV1U5bWEwVkpObnAwVVdFMmMwdzNkMFJCR2lKQlQwMVpVbmREVldWbVVsVlJWRWt5WjFWek1FbFVURTVsWVd4V05XaEdTVEJSIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNjYiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQmVCZWUiLCJsaW5rIjoiaHR0cHM6Ly9zZy5iZWJlZS5jb20vam9iLzIwMjEwNDIyLTI4ZWM4MjQ4ZjUzNzg5ODFkMmJjN2U2NWIyNTQ4NGZiP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Business Operations", "value": "GC06"}, {"text": "Science and Engineering", "value": "GC27"}, {"text": "Management", "value": "GC18"}, {"text": "Accounting and Finance", "value": "GC01"}, {"text": "Advertising and Marketing", "value": "GC03"}, {"text": "Admin and Office", "value": "GC02"}, {"text": "Human Resources", "value": "GC15"}, {"text": "Legal", "value": "GC17"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Sales and Retail", "value": "GC26"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "Data analyst", "value": "data analyst"}, {"text": "Business analyst", "value": "business analyst"}, {"text": "Analyst", "value": "analyst"}, {"text": "Associate", "value": "associate"}, {"text": "Senior", "value": "senior"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Data scientist", "value": "data scientist"}, {"text": "Insights analyst", "value": "insights analyst"}, {"text": "Operations analyst", "value": "operations analyst"}, {"text": "Project manager", "value": "project manager"}, {"text": "Project officer", "value": "project officer"}, {"text": "Administrators", "value": "administrators"}, {"text": "Builder", "value": "builder"}, {"text": "Business", "value": "business"}, {"text": "Cloud consultant", "value": "cloud consultant"}, {"text": "Control analyst", "value": "control analyst"}, {"text": "Data engineer", "value": "data engineer"}, {"text": "Executive", "value": "executive"}, {"text": "Intelligence analyst", "value": "intelligence analyst"}, {"text": "It analyst", "value": "it analyst"}, {"text": "Performance manager", "value": "performance manager"}, {"text": "Product analyst", "value": "product analyst"}, {"text": "Research analyst", "value": "research analyst"}, {"text": "Research assistant", "value": "research assistant"}, {"text": "Senior analyst", "value": "senior analyst"}, {"text": "Senior associate", "value": "senior associate"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Solution architect", "value": "solution architect"}, {"text": "Support analyst", "value": "support analyst"}, {"text": "Systems analyst", "value": "systems analyst"}, {"text": "Technology consulting", "value": "technology consulting"}, {"text": "Unit", "value": "unit"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Internship", "value": "INTERN"}, {"text": "Part-time", "value": "PARTTIME"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Accounting", "value": "/business/naics2007/5412"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Mining", "value": "/business/naics2007/21"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Travel", "value": "/business/naics2007/5615"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "DBS Bank", "value": "/m/01q7n5"}, {"text": "SingTel", "value": "/m/020zfl"}, {"text": "United Overseas Bank", "value": "/m/04gjd1"}, {"text": "Nanyang Technological University", "value": "/m/0l49k"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "Bank of Singapore", "value": "/m/0r3vczm"}, {"text": "Binance", "value": "/g/11hcz1r4wl"}, {"text": "Citi", "value": "/m/01dfb6"}, {"text": "Cognizant Singapore, Cognizant Technology Solutions", "value": "/m/03bf9h"}, {"text": "Dyson", "value": "/m/05cskg"}, {"text": "EPAM Systems", "value": "/m/0dlnrc"}, {"text": "Ernst & Young", "value": "/m/0g9jc"}, {"text": "Goldman Sachs Services Private Limited", "value": "/g/11g9mm5tzn"}, {"text": "GovTech Singapore", "value": "/g/11dxpkfs_6"}, {"text": "PEOPLE PROFILERS", "value": "/g/11dxq43n_6"}, {"text": "PwC Singapore", "value": "/g/11dxpz2lh8"}, {"text": "Sciente International", "value": "/g/11c73gj19n"}, {"text": "AIR LIQUIDE INDUSTRIAL SERVICES PTE LTD", "value": "/g/11hg55y1rb"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Accounting and Corporate Regulatory Authority", "value": "/m/09g7_b3"}, {"text": "Agency for Integrated Care", "value": "/g/11c73jd3yt"}, {"text": "Amazon", "value": "/m/0mgkg"}, {"text": "Amazon Web Services Singapore", "value": "/m/0rznzt1"}, {"text": "BeathChapman Pte Ltd", "value": "/g/11f01b3y2c"}, {"text": "Big Cloud", "value": "/g/11c743lwsr"}, {"text": "Bloomberg", "value": "/m/027sm6"}, {"text": "Burpple", "value": "/g/11dxps5yv5"}, {"text": "CPF Board", "value": "/m/0615qb"}, {"text": "ClearanceJobs", "value": "/g/11fy1pft9v"}, {"text": "Comfort Transportation Pte Ltd", "value": "/g/11f01gw2xt"}, {"text": "Credit Agricole Group", "value": "/m/028vbm"}, {"text": "DYSON OPERATIONS PTE. LTD.", "value": "/g/11fy29mc6g"}, {"text": "Deloitte", "value": "/m/02spfd"}, {"text": "Direct Search Asia", "value": "/g/11fy260nhz"}, {"text": "EngageRocket", "value": "/g/11c73p5x97"}, {"text": "Epson Singapore", "value": "/g/11dxpfq_tf"}, {"text": "Expedia Group", "value": "/m/03gq420"}, {"text": "GLOBALFOUNDRIES Singapore", "value": "/m/05pcrz0"}, {"text": "Goldman Sachs", "value": "/m/01xdn1"}, {"text": "Google", "value": "/m/045c7b"}, {"text": "Government Technology Agency (GovTech)", "value": "/g/11gh0528nq"}, {"text": "Ideallss", "value": "/g/11g70fpjm5"}, {"text": "IoTalents", "value": "/g/11dxq187wm"}, {"text": "JAC Recruitment", "value": "/g/121g71_s"}]}]}