{"search_metadata": {"id": "60827ab5eb690fd07d1d4768", "status": "Success", "json_endpoint": "https://serpapi.com/searches/3910bce57354c348/60827ab5eb690fd07d1d4768.json", "created_at": "2021-04-23 07:43:49 UTC", "processed_at": "2021-04-23 07:43:49 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28IT+analyst%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=140", "raw_html_file": "https://serpapi.com/searches/3910bce57354c348/60827ab5eb690fd07d1d4768.html", "total_time_taken": 2.44}, "search_parameters": {"q": "(IT analyst) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "140"}, "jobs_results": [{"title": "Business analyst wealth management (front-office)", "company_name": "Newtone consulting", "location": "Singapore (+1 other)", "via": "via LinkedIn", "description": "For a leading bank, the Business analyst will be in charge of developing Portfolio, Order and Advisory related application services to enhance and support the existing Front Office and Investment platform.\n\nJob scope:\n• Perform business analysis and/or acting as point of contact with product owners and various business representatives\n• Responsible for managing the product backlog: analysis of specifications, clarification and enrichment of specifications, validation of assumptions, preparation for the construction/sprint phase\n• Clarify and communicate with the Product owners and developments teams\n• Responsible for gathering and analyzing user requirement and impact analysis during Project preparation phase\n• Producing General/Detailed Functional Specification and communicating to project teams\n• Responsible for proper documentation of functional and non-functional specifications\n• Review test cases of SIT tester\n• Prepare and support UAT\n• Contribute to support / incident analysis... as required\n• Ensure that risks and issues are monitored and escalated when required\n\nJob requirement:\n• Bachelor’s Degree or equivalent experience required\n• 5+ years of overall experience in business analysis\n• Good knowledge of Portfolio Management, Advisory, Risk modelling and Optimization, Order Cycle\n• JIRA and Confluence knowledge\n• Detail oriented and good documentation skill\n• Proficient with SQL\n• Knowledge about REST API design standards, patterns and best-practices\n• Experienced in Waterfall and Scrum methodology\n• Ability to work in fast-paced environments\n• High level of professionalism, patience and maturity\n• Team player\n• Certified product owner or scrum master certification is a plus\n• Banking knowledge related to Wealth Management / Private banking is a plus", "extensions": ["2 days ago", "Contractor"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Contractor"}, "job_id": "eyJqb2JfdGl0bGUiOiJCdXNpbmVzcyBhbmFseXN0IHdlYWx0aCBtYW5hZ2VtZW50IChmcm9udC1vZmZpY2UpIiwiY29tcGFueV9uYW1lIjoiTmV3dG9uZSBjb25zdWx0aW5nIiwiY29tcGFueV9taWQiOiIvZy8xMWR4cTEwODR5IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiTHdoVy1sYnNFdmNrajFTYkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZZQkNyY0JRVTVWWDA1eFVuQm1VWGhwTTE4NFVYRjBWelo1WTJWck5uWkJUVFZ5WVMxNVZXdFFVRFpEWlZoc05uRkdUVGRsVFhkWU5YVnBPRm94WmkxSFFqRmtRbkZqTlRGUlVIUkhaRWxtYzA5R2RtcDFiRUpRTUdwNU1sbDVSemx2VDBoZllWUkphMXA0ZWxsT2JGUkpaRGgwVkZGaU1EbFZTbGRxU1ZSUFpIZHpTRGhvTTJsVlRHVnZUR0pRY1ZSWFh6ZFROa3BXY1hCTk1FWmlObVJQYUVwMmVHZzNWRWwzVms5MGJtSnhVMk5PTTNWWVltUm5jbEZCRWhaMGJuRkRXVkJYV1VvMFVGRjBRVmd6Tm5CeFFVUm5HaUpCVDAxWlVuZEVXVkUyU1MwMmREVnFVRlU1YzA5bll6SmlkRzR4ZFROTFMzVlIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY183IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExpbmtlZEluIiwibGluayI6Imh0dHBzOi8vc2cubGlua2VkaW4uY29tL2pvYnMvdmlldy9idXNpbmVzcy1hbmFseXN0LXdlYWx0aC1tYW5hZ2VtZW50LWZyb250LW9mZmljZS1hdC1uZXd0b25lLWNvbnN1bHRpbmctMjQ5NTAxODQyMz9yZWZJZD1iOWY3YTQ3NS0zYjc4LTQwYjYtYTkwOS01ZDg4OTg4ZWVhNDhcdTAwMjZ0cmFja2luZ0lkPVZvMk5KRWhyODM3alQzeGdENmJJSVElM0QlM0RcdTAwMjZ1dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Business Analyst - IT", "company_name": "None", "location": "Singapore", "via": "via Jobs", "description": "• Analyse the needs, scope the problem and develop business case to address the problem. • Document requirements, source and evaluate alternatives, and recommend solution that best fits the needs. • Work with vendor and app vendor on the solutions and design to seek clarification and acceptance. • Work with users to ensure smooth deployment and adoption of new solution. • Perform business analysis: a. Identify stakeholders, techniques and processes to manage, track and trace requirements. b. Refine and clarify business need, define solution scope and develop business case c. Explore, identify and document business needs. d. Assess current state, analyse stated requirements of stakeholders and elaborate to sufficient details that accurately defines business need within specified scope. • Tertiary Education in relevant fields is preferred. • Hands-on experience in related field is preferred • Hands-on experience in at least 1 full project development life cycles. • Advantageous to have... a. Consulting or Business Analysis experience b. Business Analysis certification (Certification of Competency in Business Analysis™ (CCBA®), Certified Business Analysis Professional™ (CBAP®). c. Up to date on product trends, best practices and technologies • Analyse the needs, scope the problem and develop business case to address the problem. • Document requirements, source and evaluate alternatives, and recommend solution that best fits the needs. • Skills: Business Analysis, Business Process, Financial Analysis, Integration, Process Improvement, Project Management, Requirements Analysis, Sdlc, Sql, Scope, Microsoft C Experience: 2.00-5.00 Years", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJCdXNpbmVzcyBBbmFseXN0IC0gSVQiLCJjb21wYW55X25hbWUiOiJOb25lIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJnV292SUREelB0R0xNdUNOQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnMiLCJsaW5rIjoiaHR0cHM6Ly9zZy5maWRhbnRvLmNvbS9qb2JzL2pvYi1vcGVuaW5nL2luZm9ybWF0aW9uLXRlY2hub2xvZ3ktcHJvamVjdC1tYW5hZ2Vycy9idXNpbmVzcy1hbmFseXN0LWl0LTI3NTcyODIyOD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior IT Analyst, Governance & Compliance (East/ 5 days) (BB-63121)", "company_name": "PEOPLE PROFILERS", "location": "Singapore (+1 other)", "via": "via BeBee", "description": "Job Description: Responsibilities:Oversee IT policies, procedures and guidelines to ensure daily operations and project management are aligned with the best practices and regulations. Ensure that such policies and procedures are reviewed and updated regularly.Responsible for the procedure and controls to assure compliance with company and regulatory policies and procedures as well as industry best practices.Monitor and review IT systems to ensure they follow policies and practices.Evaluate technology, identify controls, and keep records and ensure all processes and governance are executed in accordance to polices and best practices.Prepare and compile audit records into coherent report for the audit committees.Assist ICT Director and managers to analyse and identify technology gaps, especially in IT security and complianceWork with IT teams to implement appropriate changes and improvements to close those technological gapsRequirements:Degree in Computer Science or IT-related... disciplineAt least 4 years relevant working experience, in IT system development, deployment and support.Possess good experience in IT systems, design and solutioning with understanding of IT security implementations.Familiar with IT governance and auditing-related practice; certification in Risk and Information Systems (CRISC) or equivalent would be an advantage.Job ID: Y86965", "extensions": ["20 hours ago", "Full–time"], "detected_extensions": {"posted_at": "20 hours ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgSVQgQW5hbHlzdCwgR292ZXJuYW5jZSBcdTAwMjYgQ29tcGxpYW5jZSAoRWFzdC8gNSBkYXlzKSAoQkItNjMxMjEpIiwiY29tcGFueV9uYW1lIjoiUEVPUExFIFBST0ZJTEVSUyIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiMGNYWk9va0VpaFp1elp3MkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCZUJlZSIsImxpbmsiOiJodHRwczovL3NnLmJlYmVlLmNvbS9qb2IvMjAyMTA0MjItM2U2Y2M4Njk1NzM1MzY0YTk0Yjk0OTQyMzI5NjMxMjE/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Agile Business Analyst - Investment Management", "company_name": "Michael Page International Pte Ltd", "location": "Singapore", "via": "via Monster Singapore", "description": "• Wel known brand name\n• Excellent remuneration\nAbout Our Client\n\nOur Client is an industry leading brand with a strong regional presence and they are looking for an Agile Business Analyst - (Investment Management)\nJob Description\n\nAs the Agile Business Analyst - (Investment Management) , you are responsible for:* Creating business cases and defining solutions based on agile methodology\n• Developing detailed IT work plans, schedules, project estimates, resource plans by balancing between business needs and technical constraints.\n• Coordinating with regional stakeholders for project execution, manage project implementation efficiency and delivery milestones results within defined quality.\n• Setting up a framework for project governance following agile processes\n• Working with relevant stakeholders on User Acceptance Testing\n• Allocating both internal and external resources effectively to ensure successful execution of projects.\n• Translating business requirements and user needs into... functional specifications.\n• Managing the SLAs and deliveries for multiple projects, backed by detailed plans to monitor and track progress\nThe Successful Applicant\n\nAs a successful candidate you will have a Bachelor's Degree in Information Technology or equivalent with at least 8 years of IT Business analysis experience within the investment management domain\nYou will have a background in software development using agile methodologies and relevant certifications such as CSM, PMP-ACI or equivalent, coupled with working knowledge of digital workflow tools such as JIRA\nWhat's on Offer\n• Permanent role\n• Career growth opportunities", "extensions": ["29 days ago", "Full–time"], "detected_extensions": {"posted_at": "29 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBZ2lsZSBCdXNpbmVzcyBBbmFseXN0IC0gSW52ZXN0bWVudCBNYW5hZ2VtZW50IiwiY29tcGFueV9uYW1lIjoiTWljaGFlbCBQYWdlIEludGVybmF0aW9uYWwgUHRlIEx0ZCIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiY2k3eVd0UW1yd1M4RGRNNUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNb25zdGVyIFNpbmdhcG9yZSIsImxpbmsiOiJodHRwczovL3d3dy5tb25zdGVyLmNvbS5zZy9hbXAvam9iLXZhY2FuY3ktYWdpbGUtYnVzaW5lc3MtYW5hbHlzdC1pbnZlc3RtZW50LW1hbmFnZW1lbnQtbWljaGFlbC1wYWdlLWludGVybmF0aW9uYWwtcHRlLWx0ZC1zaW5nYXBvcmUtMjc0NzA4NDkuaHRtbD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior Business Systems Analyst", "company_name": "Equinix", "location": "Singapore", "via": "via Bayt.com", "description": "Senior Business Systems Analyst\n\nWho are we?\n\nEquinix is the world’s digital infrastructure company, operating 210 data centers across the globe and providing interconnections to all the key clouds and networks. Businesses need one place to simplify and bring together fragmented, complex infrastructure that spans private and public cloud environments. Our global platform allows customers to place infrastructure wherever they need it and connect it to everything they need to succeed.\n\nAt Equinix, we help the world’s digital leaders scale with agility, speed the launch of digital services, deliver world-class experiences, and transform people’s lives. Our culture is based on collaboration and the growth and development of our teams.\n\nWe hire hardworking people who thrive on solving challenging problems and give them opportunities to hone new skills, and try new approaches, as we grow our product portfolio with new software and network architecture solutions. We embrace diversity in... thought and contribution and are committed to providing an equitable work environment. that is foundational to our core values as a company and is vital to our success.\n\nWe are looking for a team member in our Corporate Applications Business Engagement team responsible for implementing, supporting and enhancing applications in Account Payables, Expenses and Travel shared service business areas. The role reporting to IT Senior Manager or equivalent position requires implementing ongoing projects and program initiatives for our shared services business teams responsible for payables, expenses and travel related functions of the company. The team member would be working on also be supporting business teams for requests and issues, support business functions during period close process and support reporting and analytics.\n\nResponsibilities\n\nBusiness Requirements Analysis\n• Partners with business stakeholders to analyze, define and document business requirements, within and across functional areas\n• Drives best practices during requirements gathering and modeling\n• Has a strong focus on gathering core requirements, beyond stated requirements and correctly places these within a broader context\n• Understands business environment and helps to connect/align relevant business stakeholders\n\nProcess Modeling and Design\n• Partners with business stakeholders to analyze, define and document business processes within and across functional areas\n• Drives best practices during requirements gathering and modeling\n• Understands business environment and helps to connect/align relevant business stakeholders\n\nStakeholder Management\n• Manages stakeholder expectations and communications within and beyond functional track\n• Knows business environment well enough to identify and proactively include the correct stakeholders\n• Interacts regularly with senior management level stakeholders, and demonstrates value from realized projects\n\nSolution Design\n• Responsible to design and document cross-functional and global solutions, drawing on functional expertise of functional and technical team members or vendors, as appropriate\n• Advises on solutions prepared by peers or supporting team, and champions good design practices\n\nDocumentation\n• Documents and reviews broader team documentation\n• Supports team in identifying and defining relevant documentation templates pertaining to solution delivery\n• Is a champion for knowledge transfer to enable/empower other team members\n\nFunctional Design\n• Develops functional designs for applications, integrations and conversions\n• Ability to work on multiple functional areas and integrations with third party products\n• Keeps up to date with industry trends and vendor capabilities to produce robust functional designs\n• Reviews functional designs and obtains sign-offs with the cross functional business and IT teams\n• Provides inputs into business processes based on design capabilities\n• Champions sustainable, forward-looking functional designs\n\nTesting & Test Design\n• Coordinates integration testing, validates test cases with stakeholders for user acceptance testing and training, and obtains sign-offs\n• Coordinates defects clarification, triage and coordinate resolution with engineering teams\n\nProject Management\n• Manages multiple application releases and projects\n• Manages stakeholder expectations\n• Designs release scope and schedule in line with business goal, prioritization and IT capacity\n\nSystem Configurations\n• Configures applications in line with business goals\n• Designs forward looking configurations by recognizing future needs aligned with the business roadmap\n• Develops configuration standards\n\nDay to Day Support (Production Support)\n• Supports and trains junior resources and oversees quality in triage and troubleshooting practices\n• Leads troubleshooting efforts on critical issues with cross functional teams through resolution\n• Identifies improvements to address repeat issues\n\nTraining and Change Management\n• Works with functional leadership teams to set expectations and conduct planning and execution of SME training activities\n• Defines, communicates, and implements support and engagement plans\n• Analyzes adoption rates and issues and assesses business case realization and proposes solutions to improve\n\nVendor Management\n• Manages/leads individual consulting resources as assigned\n• Participates in vendor advisory boards and user groups\n\nVendor & Application Technology Evaluation\n• Executes medium-scale vendor evaluations, pricing negotiations and software acquisitions\n• Prepares management communications and gets stakeholder input for recommendations\n\nQualifications\n• 10+ years’ experience implementing enterprise applications\n• Bachelor's or Master's in Engineering, Business or related field\n• Expert in Procure to Pay Process\n• Expertise in Coupa Source to Pay solution\n• Expert in Concur Expense Management\n• Expert in Oracle EBS R12 Accounts Payables\n• Expert in Oracle EBS R12 EBusiness Tax\n• Expert in designing integration with banks\n• Experience in working with country localizations for Oracle EBS R12\n• Experience with M&A projects and boundary systems integrations\n• Experience with Oracle ERP Cloud preferred", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQnVzaW5lc3MgU3lzdGVtcyBBbmFseXN0IiwiY29tcGFueV9uYW1lIjoiRXF1aW5peCIsImNvbXBhbnlfbWlkIjoiL20vMDdidG5xIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiWkpWLV91NGN2ZW1YQVU4bkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXNzQkNvd0JRVTVWWDA1eFVWVkJlRmRRVW5oNVNHWnZRMWhyTFY5NE5HTXdlR05QU1ZRMkxYZGxhWFZLWlVwRVQyUmtjSEEwY1hOV1dURm1iMjg0U1RoSU5uVndSbXhEWjBoSlNVSlBiRlptVmpaeFNrZFFWV1p3TVROb1NUWnpObXRaYzBsTFEySmpkMWRrZG1sMFIxRXpPRlJ4TFZkdlIwaDZhRTVYT0ZOamRqQkxXSFptYjBGVU9YQldOVk4yVkMwU0ZuUnVjVU5aVUZkWlNqUlFVWFJCV0RNMmNIRkJSR2NhSWtGUFRWbFNkMFJqZDI1bFYyaHdRMU5PYTFBM00wMU9jWHBpVVVWcGJXUnVZbEUiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18yOSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCYXl0LmNvbSIsImxpbmsiOiJodHRwczovL3d3dy5iYXl0LmNvbS9lbi9zaW5nYXBvcmUvam9icy9zZW5pb3ItYnVzaW5lc3Mtc3lzdGVtcy1hbmFseXN0LTU4OTM0MTY5Lz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Business Analyst (Credit Risk)", "company_name": "Sciente Inc", "location": "Singapore", "via": "via SCIENTE", "description": "We are looking for a Business Analyst to be part of the Risk Management team, to enhance and support systems related to Credit Risk activities within the bank.\n\nMandatory Skill(s)\n• Degree in Banking / Information Technology or other related fields;\n• At least 2 to 8 years of Business Analyst experience in financial institutions;\n• Possess good understanding of the life cycle of credit risk applications;\n• Strong knowledge in database management, good hands-on in using SQL query;\n• Hands on experience with Agile and project management;\n• Analytical, detail-oriented and solution-oriented;\n• Resourceful, independent and proactive team player;\n• Good communication skills, good grasp of the current state and evolution of financial markets.\n\nDesirable Skill(s)\n• FRM Certified.\n• Exposure on credit risk domain.\n\nResponsibilities\n• Gather, collate and analyse user requirements and provide clear business documents;\n• Conduct business requirement walk-through with users and key stakeholders;\n•... Perform data profiling and identify requirement gaps while performing UAT;\n• Creating and executing test cases and coordinating User Acceptance Test (UAT);\n• Perform UAT, report and track all testing issues and perform root cause analysis;\n• Provide support to queries from business users and manage production issues;\n• Ensure necessary changes/enhancements are implemented and documented", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJCdXNpbmVzcyBBbmFseXN0IChDcmVkaXQgUmlzaykiLCJjb21wYW55X25hbWUiOiJTY2llbnRlIEluYyIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiNkpsWElvNFJFWHNvN3FVeEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBTQ0lFTlRFIiwibGluayI6Imh0dHBzOi8vd3d3LnNjaWVudGUuY29tL3NjaWVudGUtaW5jL3RlY2hub2xvZ3ktam9icy82MDA1L2J1c2luZXNzLWFuYWx5c3QtKGNyZWRpdC1yaXNrKS8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Business Analyst (26068)", "company_name": "Credit Suisse", "location": "Singapore", "via": "via EFinancialCareers", "description": "Business Analyst (26068)\n\nCredit Suisse is a leading global wealth manager with strong investment banking capabilities. Headquartered in Zurich, Switzerland, we have a global reach with operations in about 50 countries and employ more than 45,000 people from over 150 different nations. Embodying entrepreneurial spirit, Credit Suisse delivers holistic financial solutions to our clients, including innovative products and specially tailored advice. Striving for quality and excellence in our work, we recognize and reward extraordinary performance among our employees, provide wide-ranging training and development opportunities, and benefit from a diverse range of perspectives to create value for our clients, shareholders and communities. We are Credit Suisse.\n\nWe Offer\nWe are looking for a business analyst to join our high-profile and successful team building the strategic payments systems for global business processes across the bank.\nAs a senior member in the team you will be responsible... for:\n• Driving requirements analysis across multiple programs.\n• Collaborating within a project team to deliver technology solutions for solving business problems.\n• Managing requirements backlog, prioritization, estimations and planning as well as User Acceptance Testing and supporting business adoption.\nYour future colleagues\nThis role is within the Group CTO, End User Services Division. End User Support Services (EUSS) is a Global organization, and we are responsible for providing a High Touch desktop support team, who provides customer focused, responsive domain expertise across all banking divisions, Executives, Board of Directors, Global Markets Investment Banking, IBCM and Wealth Management. Also providing a Site Operations team which specialize & are responsible for Hardware Support, Managed Printer Services, Desktop Cabling, Meeting room support and Mobile Voice Recording support.\nWe are a group with in Credit Suisse IT, who believe in work hard and mean time fun loving culture people. While working on the client requirements and bringing value for business, also we enrich our working experience by participating in various organizational activities like CSR initiative, fun activities, cross departmental connects etc.\nThe group has a right mix of younger talents and experienced people, which will give an opportunity learn while working, meantime open for new ideas. In total, we believe in building value while we work both to our lives as well as to customer\nThe department values Diversity and Inclusion (D&I) and is committed to realizing the firm's D&I ambition which is an integral part of our global cultural values\n\nYou Offer\n\nA successful candidate will have:\n• Strong educational background with (preferably) a degree in MBA/PGDBM/B.Tech. Relevant certification like CFA, FRM or CBAP would be an advantage\n• More than 8 years of relevant business analysis experience within banking and financial services, preferably in Credit Risk or Private Banking or wealth management area\n• Proficient in liaising with multiple partners, conducting requirement analysis workshops and translating requirements into Business Requirement Documents / user stories and Functional Specification Documents.\n• Proficient in Partner's engagement, co-ordination and management, change requests and production issue handling, Application training, test & defect management (SIT, UAT).\n• Good domain and system knowledge in Payments domain to turn customer needs into workable technology outcomes.\n• Outstanding analytical and problem solving skills. Familiar with Agile, managing & prioritizing requirement backlog\n• Strong hand in writing functional specifications and user stories with the usage of share point, Confluence, Visio etc.\n• Working knowledge of UI prototyping tools, with a good sense of user experience and user journey for any application design is desirable.\n• Has experience of independently handling end to end delivery of complex projects\n• Working across multiple time zone, Self-driven, highly motivated and detail-oriented. Has the ability to multitask while managing pressure situations.\n• Effective time management - able to work under-pressure and meet deadlines for both project related and non-project related tasks.\n• A desire to continuously learn new techniques/ technologies and bring innovative ideas into the team. Desirable:\n• Expertise in Payment Domain with exposure to SWIFT MT, MX/ISO20022 formats messages, working of various clearing systems, cross-border payments, etc.\n• Good knowledge of various aspects of International Payment Processing and SWIFT Message types 101, 103, 202, 210, 900, 910, 199, 191, 192, 196, 204, 205 etc.\n• Good knowledge of APIs, Kafka, Sanctions, Risk filter & Payment security. Understands the value of diversity in the workplace and is dedicated to fostering an inclusive culture in all aspects of working life so that people from all backgrounds receive equal treatment, realize their full potential and can bring their full, authentic selves to work\n\nCredit Suisse is an equal opportunity employer. Welcoming diversity gives us a competitive advantage in the global marketplace and drives our success", "extensions": ["2 days ago", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJCdXNpbmVzcyBBbmFseXN0ICgyNjA2OCkiLCJjb21wYW55X25hbWUiOiJDcmVkaXQgU3Vpc3NlIiwiY29tcGFueV9taWQiOiIvbS8wM2c3NzYiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJ6N0RYY3hDZ3FHNUNxRjhuQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VTFkeU9Fb3dUekpYZW1aU2J5MTJOMW96UlVrMlZuZ3diRE5tWVRWdVFuWkRSelZVVFcxeFQyUmpPR1ZrYW5CMGJqQjFXbUpPWjI1TVMySm5TVkpDZDJWb1pVbEZSVGRyVG5kb1YyWjFaR3hHZEdseVpYaGpkRXRPVVRoWlZIRkJkRVpWWW1ka1pta3pjRTlZWm0weldYVllNamg1V1RoaWVWWjVOVWcxVkMxMllrZzVXWE14WDB0TmVXRXdNVkZHZWtkRmJFMUVkM0ZVTVU5UkVoWjBibkZEV1ZCWFdVbzBVRkYwUVZnek5uQnhRVVJuR2lKQlQwMVpVbmRCV0dwdk9GaHFURXRIWXpSeVptOHlTWEEyVjBsMVdISnhTM0pSIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNDEiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gRUZpbmFuY2lhbENhcmVlcnMiLCJsaW5rIjoiaHR0cHM6Ly93d3cuZWZpbmFuY2lhbGNhcmVlcnMuc2cvam9icy1TaW5nYXBvcmUtU2luZ2Fwb3JlLUJ1c2luZXNzX0FuYWx5c3RfMjYwNjguaWQxMDc1MTQxNz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Cyber Security Analyst", "company_name": "Snaphunt Pte Ltd", "location": " (+1 other)", "via": "via JobsCentral", "description": "​​(​​​​Temporary Job)\n• Join an IT services company with a solid track record of success\n• Work alongside & learn from best in class talent\n• Opportunity to work with BFSI clients\n\nFounded by a team with over 20 years of IT experience, our client supports businesses who outsource their IT functions, with their ability in cross-application connectivity.\n\nThe Job\n\nYou will be responsible for :\n• Providing IT Security operations support.\n• Managing IT Security incidents, threats, programs and analytics.\n• Ensuring IT asset and data are protected.\n• Adhering to IT Security best practices, compliance and regulatory requirements.\n\nThe Profile\n• You have a Degree/Diploma in Computer Science, Engineering or a related field.\n• You have at least 2 years of experience in a CyberSecurity Engineer or similar role. Having an IT Security certification is advantageous\n• You have a solid knowledge of security best practices and concepts\n• You have a strong familiarity with IT Security tools\n• You... possess strong analytical and problem-solving skills\n• You pay strong attention to detail and deliver work of high standards\n• You are a strong team player and can liaise with various stakeholders.\n\nRef: 10960889", "extensions": ["5 days ago"], "detected_extensions": {"posted_at": "5 days ago"}, "job_id": "eyJqb2JfdGl0bGUiOiJDeWJlciBTZWN1cml0eSBBbmFseXN0IiwiY29tcGFueV9uYW1lIjoiU25hcGh1bnQgUHRlIEx0ZCIsImNvbXBhbnlfbWlkIjoiL2cvMTFjNzR0NjF3OCIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IkJFUHpac01LdUEwTks0c2hBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2WUJDcmNCUVU1VlgwNXhVM0JmV1VsNGJuZGhNa3RTVmxaVWJXNUtNSGhxY25GUGMwTmtOM2s0Um1wamVWSm1UR0YxU201bU1IRmhTWGhDUkRnelNXRm5Sa1ZQZDNsTWFHSmtVRU54UTA1ZlpqUTFPVmhqTUdwWWMxaHRlbDl3YlRJMVdtRkJXV3hKY214dE5sSjJSaTB0WDNGWmFIaENhMEl5Ym5kblExUkpXazVWUW01V2NsZHVkMmRuYUZwUVNrNWlWM2hJT0VVM1RFUmhWRkpDZVZFeFVtcEJkekZzZEdGaGVHWkRWRU5NVUdKTlVVNXVNREV6T0ZwckVoWjBibkZEV1ZCWFdVbzBVRkYwUVZnek5uQnhRVVJuR2lKQlQwMVpVbmRDYkRBelUweFNVR3RJV0hWdFNqWkhNRlJSWTI1WlZWSTBaVnAzIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNDkiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9ic0NlbnRyYWwiLCJsaW5rIjoiaHR0cHM6Ly9qb2JzY2VudHJhbC5jb20uc2cvam9iL2N5YmVyLXNlY3VyaXR5LWFuYWx5c3QtajN0MW5rNjJ0cDZraDhzYno0ej91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior Vulnerability Management Analyst", "company_name": "Singtel Group", "location": "Singapore", "via": "via Singtel Careers", "description": "We have a great opportunity for a talented and self-motivated Senior Vulnerability Management Analyst to join our Cyber Risk Management & Security team in NCS. At NCS, we seek to nurture talents in creating and developing innovative solutions. If you are passionate about new technologies and new ideas, NCS could be a place for you!\n\nThe NCS Cyber Risk Management & Security team is looking for a Senior Vulnerability Management Analyst to be part of a newly setup Cyber Operations function. As part of a new function you will have the opportunity to work closely with multiple teams on the development of Cyber Operations and the ability to shape and influence the security monitoring process and other cyber operations activities. You will report to the Cyber Security Operations Lead and be responsible for daily SIEM monitoring & investigation and have a part to play on application security and vulnerability management.\n\nResponsibilities:\n• Perform core cyber-security operation functions... such as security monitoring, vulnerability management and application security.\n• Monitor and perform deeper analysis, trending and root cause analysis of security events from SIEM, whilst creating process and procedures where none are already established.\n• Perform AppSec assessments for selected applications using a combination of threat modelling, vulnerability research, code scanning, application security testing and recommendation of proper remediation actions.\n• Support a continuous vulnerability scanning and reporting program encompassing a vast network of internal and public-facing IT assets across multiple platforms and architectures.\n• Experience in discovery of vulnerabilities, prioritization of data and vulnerabilities, remediation of vulnerabilities, and verification through risk-based analysis of findings.\n• Create and enhance threat detection use cases to identify suspicious cyber threats or anomaly activities.\n• Be on standby rotation for cyber operations duty.\n\nThe ideal candidate should possess:\n• Degree/Diploma or higher in Computer Science, Information Systems or equivalent.\n• At least 5 years of experience in cyber security operations or cyber security engineering.\n• Strong knowledge of various automated security control systems, encryption, message authentication, vulnerability assessment, threat intelligence intrusion detection, penetration testing and incident response.\n• Experience responding to security events, including front-line analysis and escalation, on hacktivist, cybercrime, and APT activity.\n• Good knowledge in Incident response lifecycle, different Operating Systems, TCP/IP networking and application layers.\n• Provide after-hours support on an on-demand basis.\n• Ability to work independently and with minimal supervision on assignments.\n• Strong analytical, problem solving, oral and written communications skills.\n\nBonus Points:\n• Security certification is preferred, such as GIAC Certified Incident Handler (GCIH), GIAC Penetration Tester (GPEN) or GIAC Web Application Penetration Tester (GWAPT)\n• At least 3 years of experience as a SOC senior security analyst or vulnerability management analyst", "extensions": ["20 days ago", "Full–time"], "detected_extensions": {"posted_at": "20 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgVnVsbmVyYWJpbGl0eSBNYW5hZ2VtZW50IEFuYWx5c3QiLCJjb21wYW55X25hbWUiOiJTaW5ndGVsIEdyb3VwIiwiY29tcGFueV9taWQiOiIvbS8wMjB6ZmwiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJZWjZoOGlaczVHSW9VcDFvQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VkdGNlNWWk1aVUUwY1dwcVZsRnBVakZIWWs0eWNVbGpTV3QwUWtoV1praFVha3hCYVVVdE1sOHhTRzlXY1ZCT2VqZFJZbmw1ZVRkR1NVb3lSa1pLU1ROUGExQTFTR2wxYVVKdWMwaDZVM2RaT0RrMWJqSTRUVUZHYjAxVGEweHBjM1Z0WTJKNVNsWkdZbGRsVVZsS2VVUmtRV3B0UjAxTFJHTm9OV1pPVjJKblZVNWZiRWhvTjBjeVdFazNMVk14WXpWNFQxTkhRUzExUjFSQkVoWjBibkZEV1ZCWFdVbzBVRkYwUVZnek5uQnhRVVJuR2lKQlQwMVpVbmRCY0hnNGRUYzBXVmRETjNCYWJuaFRUVGxHUVcxR2VFWmtlbWhCIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNTciLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gU2luZ3RlbCBDYXJlZXJzIiwibGluayI6Imh0dHBzOi8vZ3JvdXBjYXJlZXJzLnNpbmd0ZWwuY29tL2pvYi9TZW5pb3ItVnVsbmVyYWJpbGl0eS1NYW5hZ2VtZW50LUFuYWx5c3QtU2luZy81NzYzNTY5MTAvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Sales Operations Analyst", "company_name": "MoneyOwl", "location": "Singapore (+1 other)", "via": "via Glassdoor", "description": "About Us\n\nMoneyOwl is a financial adviser and fund management company licensed by the MAS. We aim to empower consumers to live life to the full by helping them make wise money decisions easily and confidently.\n\nWe are Singapore’s 1st Bionic Financial Adviser! To be Bionic means to have the best of both worlds – humans and technology.\n\nBoth our dedicated client advisers and technology platforms come together to journey with our customers in every stage of their life.\n\nJob Description\n• Manage sales data and provide metrics and insights to support the decision-making and strategic planning of the sales and marketing teams\n• Analyse sales data and provide important visualisation and dashboards that communicates complex data clearly\n• Manage CRM (Hubspot) to add value by increasing sales team’s productivity with leads, transactions, and time management, often in collaboration with the Technology team\n• Maintain clean and robust data in the CRM platform\n• Define and refine structured sales... processes for efficiency including improving sales conversions, shorten sales cycles, and maximize wins\n• Play a key role in sales and operations planning, including project management to align diverse functions in the organisation for key projects\n• Serve as a valued business partner to the sales leaders\n\nQualifications\n\nRequirements\n• Degree in Business Administration, Finance, Economics, Computer Science or related qualifications\n• Minimum 3- 5 years of relevant working experience\n• In-depth working and administrative experience with Hubspot is required\n• Advanced Excel knowledge working with large data-sets (utilise complex formulas and can manipulate and transform data).\n• Ability to develop new ideas and creative solutions, as well as demonstrate skill and passion for problem solving and operational excellence\n• Meticulous and committed, with strong quantitative and qualitative analytical abilities.\n• An agile team player and a good communicator\n• Experience using AWS QuickSight or similar visualization software, and an understanding of SQL to retrieve queries is a plus\n• Project management certification or experience would be an advantage", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTYWxlcyBPcGVyYXRpb25zIEFuYWx5c3QiLCJjb21wYW55X25hbWUiOiJNb25leU93bCIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiSzY0NEpVa21RNDZLdlRTWUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBHbGFzc2Rvb3IiLCJsaW5rIjoiaHR0cHM6Ly93d3cuZ2xhc3Nkb29yLnNnL2pvYi1saXN0aW5nL3NhbGVzLW9wZXJhdGlvbnMtYW5hbHlzdC1tb25leW93bC1KVl9JQzMyMzU5MjFfS08wLDI0X0tFMjUsMzMuaHRtP2psPTQwNjYwMTcwMzBcdTAwMjZ1dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Business Operations", "value": "GC06"}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Accounting and Finance", "value": "GC01"}, {"text": "Science and Engineering", "value": "GC27"}, {"text": "Advertising and Marketing", "value": "GC03"}, {"text": "Customer Service", "value": "GC10"}, {"text": "Legal", "value": "GC17"}, {"text": "Protective Services", "value": "GC23"}, {"text": "Management", "value": "GC18"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Property", "value": "GC24"}, {"text": "Sales and Retail", "value": "GC26"}, {"text": "Social Services and Non-Profit", "value": "GC28"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "Business analyst", "value": "business analyst"}, {"text": "Analyst", "value": "analyst"}, {"text": "Security analyst", "value": "security analyst"}, {"text": "Systems analyst", "value": "systems analyst"}, {"text": "It analyst", "value": "it analyst"}, {"text": "Data analyst", "value": "data analyst"}, {"text": "System analyst", "value": "system analyst"}, {"text": "Support analyst", "value": "support analyst"}, {"text": "Associate", "value": "associate"}, {"text": "Management analyst", "value": "management analyst"}, {"text": "Operations analyst", "value": "operations analyst"}, {"text": "Soc analyst", "value": "soc analyst"}, {"text": "Test analyst", "value": "test analyst"}, {"text": "Intelligence analyst", "value": "intelligence analyst"}, {"text": "Research analyst", "value": "research analyst"}, {"text": "Senior", "value": "senior"}, {"text": "Senior analyst", "value": "senior analyst"}, {"text": "Control analyst", "value": "control analyst"}, {"text": "Manager", "value": "manager"}, {"text": "Project analyst", "value": "project analyst"}, {"text": "Researcher", "value": "researcher"}, {"text": "Risk analyst", "value": "risk analyst"}, {"text": "Service analyst", "value": "service analyst"}, {"text": "Technology analyst", "value": "technology analyst"}, {"text": "Accounting analyst", "value": "accounting analyst"}, {"text": "Application analyst", "value": "application analyst"}, {"text": "Behavior analyst", "value": "behavior analyst"}, {"text": "Business", "value": "business"}, {"text": "Center analyst", "value": "center analyst"}, {"text": "Compliance analyst", "value": "compliance analyst"}, {"text": "Coordinator", "value": "coordinator"}, {"text": "Desk", "value": "desk"}, {"text": "Desk analyst", "value": "desk analyst"}, {"text": "Financial analyst", "value": "financial analyst"}, {"text": "Functional analyst", "value": "functional analyst"}, {"text": "Hr analyst", "value": "hr analyst"}, {"text": "Interns", "value": "interns"}, {"text": "Operations center", "value": "operations center"}, {"text": "Process analyst", "value": "process analyst"}, {"text": "Programmer analyst", "value": "programmer analyst"}, {"text": "Project manager", "value": "project manager"}, {"text": "Qa analyst", "value": "qa analyst"}, {"text": "Senior associate", "value": "senior associate"}, {"text": "Senior consultant", "value": "senior consultant"}, {"text": "Specialist", "value": "specialist"}, {"text": "Sr analyst", "value": "sr analyst"}, {"text": "Support executive", "value": "support executive"}, {"text": "Technical analyst", "value": "technical analyst"}, {"text": "Technical architect", "value": "technical architect"}, {"text": "Trainee", "value": "trainee"}, {"text": "Treasury analyst", "value": "treasury analyst"}, {"text": "Wealth management", "value": "wealth management"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Internship", "value": "INTERN"}, {"text": "Part-time", "value": "PARTTIME"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Research", "value": "/business/naics2007/5417"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Mining", "value": "/business/naics2007/21"}, {"text": "Real Estate", "value": "/business/naics2007/53"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Engineering Services", "value": "/business/naics2007/5413"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Utilities", "value": "/business/naics2007/22"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "SingTel", "value": "/m/020zfl"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "Trustwave", "value": "/m/0n3xjf5"}, {"text": "Government Technology Agency", "value": "/g/11gh0528nq"}, {"text": "OCBC", "value": "/m/055r27"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "Credit Agricole Group", "value": "/m/028vbm"}, {"text": "UL", "value": "/m/01q1gj"}, {"text": "VISA", "value": "/m/01kqjn"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "American Express", "value": "/m/01w6dw"}, {"text": "Avensys Consulting", "value": "/g/11g7022gjf"}, {"text": "Binance", "value": "/g/11hcz1r4wl"}, {"text": "BlueVoyant", "value": "/g/11h1y4qdlf"}, {"text": "Caterpillar", "value": "/m/0319hp"}, {"text": "Cognizant Singapore, Cognizant Technology Solutions", "value": "/m/03bf9h"}, {"text": "DBS Bank Ltd", "value": "/m/01q7n5"}, {"text": "Deloitte SEA", "value": "/g/11f_g4x9d_"}, {"text": "Dyson", "value": "/m/05cskg"}, {"text": "EPAM Systems", "value": "/m/0dlnrc"}, {"text": "Experis Singapore", "value": "/g/11dxpnwm3s"}, {"text": "HSBC", "value": "/m/096k1t"}, {"text": "JPMorgan Chase & Co.", "value": "/m/01hlwv"}, {"text": "Jobline Resources Pte Ltd", "value": "/g/11gp2647pn"}, {"text": "Marina Bay Sands Pte Ltd", "value": "/m/09mhd9q"}, {"text": "Medtronic", "value": "/m/03z4j3"}, {"text": "Mizuho Bank", "value": "/m/022103"}, {"text": "Public Service Division", "value": "/g/11g6__bv10"}, {"text": "RECRUIT EXPRESS PTE LTD", "value": "/g/11g706hzhq"}, {"text": "RHB Singapore", "value": "/g/11c73srg7f"}, {"text": "Randstad", "value": "/m/08pt1z"}, {"text": "Randstad Singapore", "value": "/g/11g70b50mr"}, {"text": "SITA", "value": "/m/06l20z"}, {"text": "Selby Jennings", "value": "/g/11fy2ds3gn"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "Xcellink Pte Ltd", "value": "/g/11c73prcqy"}, {"text": "Xilinx", "value": "/m/03dwkc"}, {"text": "103 Golden Agri International Pte Ltd", "value": "/g/11fy210tb9"}, {"text": "Activate Interactive Pte Ltd", "value": "/g/11dxq192l5"}, {"text": "Amazon", "value": "/m/0mgkg"}, {"text": "Apple", "value": "/m/0k8z"}]}]}