{"search_metadata": {"id": "608279cf29d1772a590e9a57", "status": "Success", "json_endpoint": "https://serpapi.com/searches/dc9c1a2380f6d4d5/608279cf29d1772a590e9a57.json", "created_at": "2021-04-23 07:39:59 UTC", "processed_at": "2021-04-23 07:39:59 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28system+analyst%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=80", "raw_html_file": "https://serpapi.com/searches/dc9c1a2380f6d4d5/608279cf29d1772a590e9a57.html", "total_time_taken": 2.69}, "search_parameters": {"q": "(system analyst) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "80"}, "jobs_results": [{"title": "Business Intelligence Systems Business Analyst", "company_name": "Avensys Consulting Pte. Ltd.", "location": "Singapore (+1 other)", "via": "via Monster Malaysia", "description": "Avensys is a reputed global IT professional services company headquartered in Singapore. Our service spectrum includes enterprise solution consulting, business intelligence, business process automation and managed services. Given our decade of success we have evolved to become one of the top trusted providers in Singapore and service a client base across banking and financial services, insurance, information technology, healthcare, retail and supply chain.\n\nWe are currently looking for an experienced BI Systems Business Analyst to support the delivery of a multi-million Data Mart project that will integrate various external and internal data sources and build a best-in-class data mart and data access self-service tool. This is an exciting opportunity to expand your skill set, achieve job satisfaction and work-life balance. More details as below.\n\nJOB TYPE:\n\n1-year renewable contract\n\nROLES AND RESPONSIBILITIES\n\n· Work directly with business users and stakeholders to understand the... business needs and translate business requirements into detailed requirements documentation.\n\n· Employ best practices during requirements gathering and documentation stages.\n\n· Partner with the IT project manager to manage the data mart project phases/releases from initiation to completion.\n\n· Manage stakeholder expectations and communications within and beyond functional track.\n\n· Interacts regularly with senior management level stakeholders to provide periodical project status updates, raise risks and issues encountered in the project.\n\n· Develop and communicate test strategy and test cases.\n\n· Coordinate execution and validation of test cases with stakeholders for user acceptance testing, training, and obtaining project signoffs.\n\n· Coordinate defects clarification, triage, and resolution with IT team.\n\n· Develop and actively maintain the data mart data dictionary.\n\nREQUIREMENTS\n\n• Degree in data management, analytics, statistics, mathematics, or business management\n\n• Minimum of 3 years’ experience in business analysis and requirements gathering and documentation.\n\n• Strong knowledge and experience in industry standard project management practices.\n\n• Strong knowledge of data warehouse modeling and business intelligence concepts (e.g., entity relationship diagramming, SQL querying, source to target mapping, etc.)\n\n• Excellent visualization skills using Tableau, SiSense or other relevant visualization tools preferred.\n\n• Advanced knowledge of Excel and SQL.\n\n• Good Knowledge on CRM, ERP or Financial systems preferred.\n\n• PMP certification is desirable.\n\nWHAT’S ON OFFER\n\nYou will be remunerated with an excellent base salary and entitled to attractive company benefits. Additionally, you will get the opportunity to enjoy a fun and collaborative work environment, alongside a strong career progression\n\nTo submit your application, please apply online or email your UPDATED CV in Microsoft Word format to [Confidential Information]. Your interest will be treated with strict confidentiality.\n\nCONSULTANT DETAILS\n\nConsultant Name : Prathiksha Shetty\n\nAvensys Consulting Pte Ltd\nEA Licence 12C5759\n\nPrivacy Statement: Data collected will be used for recruitment purposes only. Personal data provided will be used strictly in accordance with the relevant data protection law and Avensys personal information and privacy policy", "extensions": ["1 month ago", "Full–time"], "detected_extensions": {"posted_at": "1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJCdXNpbmVzcyBJbnRlbGxpZ2VuY2UgU3lzdGVtcyBCdXNpbmVzcyBBbmFseXN0IiwiY29tcGFueV9uYW1lIjoiQXZlbnN5cyBDb25zdWx0aW5nIFB0ZS4gTHRkLiIsImNvbXBhbnlfbWlkIjoiL2cvMTFnNzAyMmdqZiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImYzQ1BvX3I5eXluY0ZUSEpBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVvc0NDc3dCUVU1VlgwNXhVVFZrYzFSTlh6QjFkV2hXVGxGUWNtVlhUek5rY21WV1REQmphakEwTlVKcmVXdFZabnBGU1hCNlFtRlZZMlJUUTJ4bWVFd3dTRzB0YzFwZmNqTTRXVmhXTVRCelVtcHZNblJLYjJRNFFWTXRTMnBaTTI5WlJHZHFWbFU0VTJveGFVcFZNMTlJZW05c1pEQlZTazQyVGpkd1R6Wnlhek5YUzJGbVVVMXJPVjlmYUhaMGNDMW1NMWQ0YWxwS1NXVnRVMlI1UmtGVWRGRnViVXhCTnkxbGRFcFZUMjE0WkdScmMyaHVPVmh4VlZoa1pHSmtZa2RpYmtnNFNXVlRRV0ZTYkZWSk5teEpFaFl3V0cxRFdVeElhRXBKWlVSMFVXRk5lRzlwU1VObkdpSkJUMDFaVW5kQmVFaEJaSEZDYVVKWWMzZERUVmhZZURVdE5IVkpRVlk0ZHpabiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzciLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTW9uc3RlciBNYWxheXNpYSIsImxpbmsiOiJodHRwczovL3d3dy5tb25zdGVyLmNvbS5zZy9hbXAvam9iLXZhY2FuY3ktYnVzaW5lc3MtaW50ZWxsaWdlbmNlLXN5c3RlbXMtYnVzaW5lc3MtYW5hbHlzdC1hdmVuc3lzLWNvbnN1bHRpbmctcHRlLWx0ZC1zaW5nYXBvcmUtMjc0NTg1NjMuaHRtbD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "System Analyst (PEGA)", "company_name": "Dynamic Human Capital Pte Ltd", "location": "Singapore", "via": "via LinkedIn", "description": "Job Description\n\n& Requirements\n\nSpecifications\n\nMandatory\n\nAt Least 2 Years Of Working Experience In\n\nThe candidate shall have the following requirements:\n\nRelational Databases\n• DB2\n• MS SQL Server\n\nAt least 4 years’ in-depth hands on application development experience in Pega PRPC\n\nand Pega frameworks.\n\nAble to work independently in gathering requirements from users, designing,\n\nimplementing, maintaining application systems and project management\n\nPreferred\n\nWorking experience in one or more of the followings:\n• Java, JavaScript, HTML/ CSS, Web Services (REST and/or SOAP).\n• PEGA PRPC configuration, installation, external systems interface and database integration.\n• PEGA PRPC Production BAU Support.\n\nPega PRPC CSA/CSSA/CLSA certification will be an added advantage.\n\nRequirement\n\nMandatory\n• Good communication and written skills.\n\nHow To Apply\n\nWe would like to invite interested applicants to email detailed resume in MS Word format to:\n\nclick apply\n\nWe regret to inform that only... shortlisted candidates will be notified. All applications will be treated with the strictest confidence.\n\nHo Si Cong\n\nRegistration number R1982598\n\nEA License: 12C6253", "extensions": ["15 days ago", "Full–time"], "detected_extensions": {"posted_at": "15 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTeXN0ZW0gQW5hbHlzdCAoUEVHQSkiLCJjb21wYW55X25hbWUiOiJEeW5hbWljIEh1bWFuIENhcGl0YWwgUHRlIEx0ZCIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoicEtfb0xtdThhV0luNzZxcEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL3NnLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvc3lzdGVtLWFuYWx5c3QtcGVnYS1hdC1keW5hbWljLWh1bWFuLWNhcGl0YWwtcHRlLWx0ZC0yNDk1MjcxMTc2P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "#sgunitedjobs System Analyst (pega )", "company_name": "FUTUREX TECHNOLOGIES PTE. LTD.", "location": "Singapore (+1 other)", "via": "via MNC Jobs Singapore | MNC Jobs In Singapore", "description": "Roles & Responsibilities\n\nEnd Client : CPF\n\nClient : Futurex\n\nSpecifications\n\nMandatory\n\nThe candidate shall have the following requirements:\n\nAt least 2 years of working experience in:\n\nRelational Databases:\n• DB2\n• MS SQL Server\n\n(At least 4 years’ in-depth hands on application development experience in Pega PRPC\n\nand Pega frameworks.\n\nAble to work independently in gathering requirements from users, designing,\n\nimplementing, maintaining application systems and project management\n\nPreferred\n\nWorking experience in one or more of the followings:\n• Java, JavaScript, HTML/ CSS, Web Services (REST and/or SOAP).\n• PEGA PRPC configuration, installation, external systems interface and database integration.\n• PEGA PRPC Production BAU Support.\n\n(d) Pega PRPC CSA/CSSA/CLSA certification will be an added advantage.\n\nRequirement\n\nMandatory\n\nGood communication and written skills.\n[CANDIDATES WHO REQUIRE WORK PASSES NEED NOT APPLY]\n\n[CANDIDATES WHO REQUIRE WORK PASSES NEED NOT APPLY]", "extensions": ["19 days ago", "Full–time"], "detected_extensions": {"posted_at": "19 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiIjc2d1bml0ZWRqb2JzIFN5c3RlbSBBbmFseXN0IChwZWdhICkiLCJjb21wYW55X25hbWUiOiJGVVRVUkVYIFRFQ0hOT0xPR0lFUyBQVEUuIExURC4iLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Ii13RkUyTU9HRWJRVXg3VmpBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTU5DIEpvYnMgU2luZ2Fwb3JlIHwgTU5DIEpvYnMgSW4gU2luZ2Fwb3JlIiwibGluayI6Imh0dHBzOi8vc2cubW5jam9iei5jb20vam9icy9zZ3VuaXRlZGpvYnMtc3lzdGVtLWFuYWx5c3QtcGVnYS1qdXJvbmctZWFzdC0xMDYyMjc/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Information Security Analyst", "company_name": "None", "location": "Singapore", "via": "via Jobs | Fidanto", "description": "Job Responsibilities: Provide technical guidance and support to customers, partners and subcontractors (internal and external) in order to achieve the project's security goals. Analyse the high-level security requirements at the beginning of the project; derive detailed security requirements for networks and related security appliances; for threat prevention and monitoring, for log management and monitoring; for cryptography, digital certificates and public key infrastructures (PKIs), as well as operating systems (Linux, Windows), appliances and software hardening; adhering to industry standards. Propose security controls based on security technologies evaluation; Review architecture/platforms; identify possible security threats and identifying areas of weakness; prepare cost estimates. Prepare/complete security documentation during the design/development/integration/tests stages; establish security guidelines/procedures for operational systems. Support the implementation of security... solutions; creating, transmitting, and maintaining digital keys and certificates; completing documentation. Verify security controls through system security acceptance testing; manage dynamic application security testing, static code analysis, vulnerability scans, and penetration testing; analysing and validating the test reports; detailing actions for other team members. Maintain security by ensuring compliance to standards, policies, and procedures; conducting incident response analyses; developing training programs. Prepare system security reports by collecting, analysing, and summarizing data and trends. Update job knowledge by tracking and understanding emerging security practices and standards; participating in educational opportunities; reading professional publications; maintaining personal networks; participating in professional organizations. Enhances IDEMIA agency reputation by accomplishing new and different requests for other IDEMIA projects world-wide; Job Requirements: Mininum 5 years of working experience in at least of the the following domains: Network security Data security Application security Wireless/Mobile security Cloud security For this position, the G50 clearance cat 2 is mandatory. Experience in working on highly secure systems or critical information infrastructure (CII) would be an advantage. Autonomous, with good communication skills to interface and build relationships (with customers, partners and internal teams). Demonstrate a high sense of confidence to personify our security activity. Used to work in international teams (fluent English, intercultural skills). Knowledgeable in project / product development life cycle to understand the constraints of the deployed solution and the teams and in order to support them. Readiness to work under time pressure and able to adjust quickly to project demands Technical Skills: Hands-on experience in Operating System hardening, Active Directory/LDAP, Firewalls, Proxy, Data Diode, IDS/IPS, AV, IAM, PAM, and SIEM is preferred. Good knowledge of software and applications security (SDLC, OWASP, security trends, standards, best practices, concepts and solutions); static and dynamic code analysis, vulnerabilities management. Experience in risk analysis and assessment on Information Technology (IT) and Operational Technology (OT) systems ( ISO27005). Production of security documentation. Knowledge of information security systems and associated threats (secure development, architecture, anonymization, authentication, signatures, traces, network, production environment, etc.). Knowledge of Security Testing (experience in vulnerability assessment and penetration testing will be advantageous). Knowledge/experience in major Security Standards and Guidelines would be appreciated: ISO/IEC 27001, ITIL, PCI DSS, An internationally recognised professional security certifications such as: Certified Information Systems Security Professional (CISSP), Certified Information Security Manager (CISM), Certified Information Security Auditor (CISA) Advanced Level Certification from SANS' Global Information Assurance Certification (GIAC). Documented evidence to support the claims (e.g. CISSP certification number) will be required", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJJbmZvcm1hdGlvbiBTZWN1cml0eSBBbmFseXN0IiwiY29tcGFueV9uYW1lIjoiTm9uZSIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiT01CQ0JVOERiQWZTZWY4dUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIHwgRmlkYW50byIsImxpbmsiOiJodHRwczovL3NnLmZpZGFudG8uY29tL2pvYnMvam9iLW9wZW5pbmcvaW5mb3JtYXRpb24tc2VjdXJpdHktYW5hbHlzdHMvaW5mb3JtYXRpb24tc2VjdXJpdHktYW5hbHlzdC0yNzU0MjgzNDU/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "sap hybris system analyst - sap c4c - e-commerce", "company_name": "Randstad", "location": "Singapore (+1 other)", "via": "via Monster Singapore", "description": "job description\n• Opportunity to lead Business transformation\n• Engagement with senior business stakeholders\n\nAbout the company\nOur Client is a market leader within the consumer goods industry. They have a well-established presence of more than 50 years with a global footprint of more than 15 countries. With rapid expansion plan, they are now looking for a new SAP Hybris System Analyst / SAP Cloud for Customer Analyst (C4C) - e-commerce to join their team.\nAbout the job\nYour responsibility involves:\n• Engaging key business stakeholders (Sales and marketing team) which includes gathering requirements and translating them into solution design for the E-commerce platform\n• Leading SAP Hybris project transformation/ implementation which includes, milestone planning, progress reporting and external vendor management.\n• Coordinate requirements between Sales &ecommerce team and IT to improve business processes. This includes identifying new SAP Offers and proposing improvement solutions to... enhance business productivity\n• Performing the role as subject matter expert for SAP Hybris with assistance of external vendors.\n• Exploiting new and emerging technologies technology and translate them into viable IT Digital implementation to increase productivity. This is done with the aim to improve top line (revenue/sales) for the company\n\nSkills and experience required\nAs a successful applicant, you will have at least 3 years of experience in SAP Hybris or SAP C4C. At least 5 years of experience in e-commerce implementations is required for this role.\nCandidates should have led at least 1 SAP Hybris project or has led a business process change/transformation will be required for this role.\nWhats on offer\nThis is an excellent opportunity to join a leading end user environment with opportunity to engage with senior business stakeholders across Asia. You will have the opportunity to lead business transformation through e-commerce technology.\nTo apply online please use the apply function, alternatively you can reach me at https://www.linkedin.com/in/hoonteck-nologyrecruitment or 6510 3633. (EA: 94C3609/ R1219669)\nskills\nsap hybris\nqualification\nno additional qualifications required\neducational requirements\nAssociate Degree/Diploma\nshare", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJzYXAgaHlicmlzIHN5c3RlbSBhbmFseXN0IC0gc2FwIGM0YyAtIGUtY29tbWVyY2UiLCJjb21wYW55X25hbWUiOiJSYW5kc3RhZCIsImNvbXBhbnlfbWlkIjoiL20vMDhwdDF6IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiNlh5Q3BxUW91Z1B4SXNIdkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFZHUnJORkpUTVU5NFZUZExaalpzWlZscGRsUnhlRlUxUTFKZmIyUjFiVFk0YWsxdVZYTldTazh4Vlhvd1FYZFBNeTFhWDFkamQxUkJUVWgyVURCNGRtNWtVM2RtV0V4ZlRscE1WVFpwUVY5eWFVWnFWMmhVYm14RVZEUmxaM0kwU21aM1oxSmlkbkZNWm5vM2FuaG9ORm8yVTBZMVozVnBZVFJGYnpNMVlqSjRVM3BKT1ZreFVGOHlTMjFpVDFRelFUZHhOVlZDY0VKQldqSjNFaFl3V0cxRFdVeElhRXBKWlVSMFVXRk5lRzlwU1VObkdpSkJUMDFaVW5kQmJHZFRSamd5Tm1GaU1GWmZkR3M1VldsSFdWVklOSEJPU2tGUiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzI5IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1vbnN0ZXIgU2luZ2Fwb3JlIiwibGluayI6Imh0dHBzOi8vd3d3Lm1vbnN0ZXIuY29tLnNnL2pvYi9zYXAtaHlicmlzLXN5c3RlbS1hbmFseXN0LXNhcC1jNGMtZS1jb21tZXJjZS1yYW5kc3RhZC1zaW5nYXBvcmUtMjYwMTk2Mj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "System Analyst (PEGA)", "company_name": "ELITEZ PTE. LTD.", "location": "Singapore (+1 other)", "via": "via LinkedIn", "description": "Requirements\n• At least 2 years of working experience in: Relational Databases - DB2 or MS SQL Server\n• At least 4 years’ in-depth hands on application development experience in Pega PRPC and Pega frameworks\n• Able to work independently in gathering requirements from users,designing, implementing, maintaining application systems and project management\n• Working experience in one or more of the followings:\n• Java, JavaScript, HTML/ CSS, Web Services (REST and/or SOAP).\n• PEGA PRPC configuration, installation, external systems interface and database integration.\n• PEGA PRPC Production BAU Support\n• Pega PRPC CSA/CSSA/CLSA certification will be an added advantage", "extensions": ["8 days ago", "Full–time"], "detected_extensions": {"posted_at": "8 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTeXN0ZW0gQW5hbHlzdCAoUEVHQSkiLCJjb21wYW55X25hbWUiOiJFTElURVogUFRFLiBMVEQuIiwiY29tcGFueV9taWQiOiIvZy8xMWR4cHRma2NmIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoicEd0b2hjSEcwQXBnR0t0ZUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZZQkNyY0JRVTVWWDA1eFVpMWpRMHBmWlZkS1FWaFNhWGw1ZVhSNVdraFRjM3AxTTFSWE9FUk9ja1EyVTJ0Rk9IbExSM1IwWW5OV1RVbHplV1F0YVhwQmJYTnFURE5QVW5oMWRqUktRMXBMWld4TFdYVlVOMWg2YTI5Zk4wOTFlVlpoYVdkU1pUZEphMk00VVZOaVMxcHFUR2RXVm0xUVRpMW5OM0ZGY1VsamVUazJOaTF3TUZoTk9WQk9lVVpXU2pOelpHdzVZbEZWZWxSNmRtaFRhMkpDVEhoME5VeEpja0ZCYmpWRVZHSklTbk5TWW5OWU9IZDJjeTFuRWhZd1dHMURXVXhJYUVwSlpVUjBVV0ZOZUc5cFNVTm5HaUpCVDAxWlVuZERNRzB6Ylc1eU5XWnZaRzEwVlROdU1qZFpXVGRNVVZKVk9YZEIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18zNyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL3NnLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvc3lzdGVtLWFuYWx5c3QtcGVnYS1hdC1lbGl0ZXotcHRlLWx0ZC0yNTA1MzQzNjAwP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "System Analyst (sap Fin)", "company_name": "FUTUREX TECHNOLOGIES PTE. LTD.", "location": "Singapore (+1 other)", "via": "via MNC Jobs Singapore | MNC Jobs In Singapore", "description": "Roles & Responsibilities\n\nSpecifications\n\nMandatory\n\nThe candidate shall have the following requirements:\n\nAt least 3 years of working experience under the following environment:\n• SAP R/3, FI, CO and MM modules\n\nAt least 3 years of working experience in following areas:\n• FI/CO/MM Functional\n\nBasic understanding of all aspects of FI/CO/MM Business processes. Specializing in configuration of GL, AP, AR, FA, MM, Cost Centre Accounting, Cost allocation using Assessment, in-depth knowledge of SAP authorizations.\n• ABAP Programming\n\nReporting using logical database, modifying standard reports, Joins and projections, RMAC Modules, Authorization checks, Clustered data, Function modules, ABAP Query, BDC, Scripts, BAPI and Dialog programming.\n• Able to work independently in gathering requirements from users, designing, configuring, implementing and maintaining SAP FI/CO/MM system.\n\nPreferred\n• S/4HANA, Simple Finance, SAP Business Warehouse, SAP BOBJ\n• Operating Environment:\n• Red Hat Linux\n•... HANA database\n• BOBJ/BW Programming\n\nDeveloping reports and dashboards using SAP BOBJ/BW tools like Lumira,WEBI, BEX queries, CDS views, Crystal reports.\n\nExperience in Employee Portal, Fiori, Odata services, Java script, SAP Web IDE and\n\nWebdynpro programming.\n\nSAP FI/CO/MM certification.\n\nRequirement\n\nMandatory\n• Good communication skills and able to work well in a team", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTeXN0ZW0gQW5hbHlzdCAoc2FwIEZpbikiLCJjb21wYW55X25hbWUiOiJGVVRVUkVYIFRFQ0hOT0xPR0lFUyBQVEUuIExURC4iLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IktPa081dmQySFRWZlB3WU9BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTU5DIEpvYnMgU2luZ2Fwb3JlIHwgTU5DIEpvYnMgSW4gU2luZ2Fwb3JlIiwibGluayI6Imh0dHBzOi8vc2cubW5jam9iei5jb20vam9icy9zeXN0ZW0tYW5hbHlzdC1zYXBmaW4tanVyb25nLWVhc3QtNDA0MDM/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Systems Analyst (Agile DevOps) - Singapore", "company_name": "Redevelopment Authority", "location": "Singapore", "via": "via LinkedIn", "description": "The Urban Redevelopment Authority (URA) is Singapore’s planning authority. Our mission is to make Singapore a great city to live, work and play. We plan and facilitate the physical development of Singapore, in partnership with agencies and the community, to create a vibrant, sustainable and cosmopolitan city of distinction.\n\nURA has undergone a digitalization journey to harness Geospatial and Data Analytics for more data-informed planning. URA was recognized as a leading organization in Digital Transformation and was the Asia Pacific 2017 regional DX Leader in Talent Acceleration, as well as the 2019 PSD Public Sector Transformation – Business Transformation Award recipient. URA is embarking on a Digitalization 2.0 effort, to go beyond Urban Analytics to use of Artificial Intelligence (AI) in our Future Planning Processes.\n\nAbout Information Systems, Applications Department\n\nBe part of the URA Information Systems, Application Department, where we partner closely with our Groups to... plan, design, develop and deploy enterprise IT systems, e-Services, mobile apps and web portals to support work process transformation and improve service delivery for our external customers. In addition to providing IT advisory and support to continually improve our IT systems to ensure its relevance and capability to meet changing business needs, we also constantly explore new digital technologies and possibilities via collaboration with key industry players to advance strategic deployment of ICT in URA.\n\nAbout The Job\n\nYou will be a key member of the Digital Programme and Quality Office team, working closely with passionate Systems Analysts, driven and supportive Director and visionary CIO, to drive and transform IT processes and ensure quality implementation of IT Systems and digital services in an agile approach. If you have the following in your DNA, we would like to hear from you:\n• Innovate – Always looking for ways to improve IT processes and feel motivated when your contribution makes a difference to everyone’s work, with focus on ensuring quality delivery of IT Systems and digital services;\n• Agile – Lead and embrace the agile values as role of a ScrumMaster to plan, coach and operationalise processes to ensure all teams embrace agile way of application implementation; drive and manage DevOps software delivery automation.\n• Tech-savvy – Looking out for latest developments in the area of DevSecOps and explore useful tools to facilitate software quality assurance and software delivery automation.\n\nRequirements\n• Degree in Computer Science, Engineering, or related disciplines. In the alternative, candidates should at least have an additional 4 years of relevant experience\n• ScrumMaster certified, and any other agile related certification e.g. Product Owner, Agile Coach\n• Knowledge and/or at least 3 years of relevant working experience in Managing projects as a Scrum Master and leading agile initiativesDevOps processes and toolsSoftware development and quality assurance\n• Able to work well within team and willing to learn\n• Effective presentation, communication and writing skills\n\nAdded Advantage With Below Skills\n• Experience with project collaboration tools (e.g. Microsoft Sharepoint)\n• Experience with application security implementation, OWASP understanding\n\nAppointment will commensurate with experience and entry-level applicants are welcome to apply", "extensions": ["17 days ago", "Full–time"], "detected_extensions": {"posted_at": "17 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTeXN0ZW1zIEFuYWx5c3QgKEFnaWxlIERldk9wcykgLSBTaW5nYXBvcmUiLCJjb21wYW55X25hbWUiOiJSZWRldmVsb3BtZW50IEF1dGhvcml0eSIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiU01VNXE2Rnhfd1U1OS1pQkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL3NnLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvc3lzdGVtcy1hbmFseXN0LWFnaWxlLWRldm9wcy1zaW5nYXBvcmUtYXQtcmVkZXZlbG9wbWVudC1hdXRob3JpdHktMjQ5MTg0ODg5Mj9yZWZJZD00ODU1ZGIzMy0xMjE1LTQ0YTMtYTk5Yy02N2UxZGI0NTMxOWFcdTAwMjZ0cmFja2luZ0lkPVM2WEpRWkR6NmlWc1JhRm5WJTJCNmVZUSUzRCUzRFx1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "SAP MM/SD Analyst (BB-7267A)", "company_name": "Spring Professional", "location": "Singapore", "via": "via BeBee", "description": "SAP MM/SD Analyst Singapore Main Duties & ResponsibilitiesThis is a regional support role for South East Asia that provides application system support, business analysis, functional design, system implementation, user acceptance test, user training and system documentationOther Roles & ResponsibilitiesDaily support and problem solving in SAP and other business applications Support & resolve user issues on daily basis and in a timely mannerAssist with reporting requirements / exports from SAP / other systems Facilitate system changes according to Business Requirements & Change Requests Gather user's requirements & translate into functional enhancement requests (no coding needed)GAP analysis of businesses process vs requirements vs system capabilities / functionality Participate and support system implementation and enhancementProvide user training and system documentationPrepare testing and conduct user acceptance test with usersCandidate Profile Degree in Business Administration... Computer Science or related subjectsAt least 3 years experience in SAP (ECC preferred) & Application Support or ConsultingIndustry experience in Retail/ Wholesale / SportsStrong SAP experience in SD & MM & FI Modules. WM (advantageous)Strong GAP analysis and reporting reconciliationSAP Certification is an advantageData migration implementation and lifecycle experienceWhat to ExpectOur client offers the benefits of a work environment that is stimulating, challenging and balanced. You will be working in a fast paced and global organization.Interest & Apply", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTQVAgTU0vU0QgQW5hbHlzdCAoQkItNzI2N0EpIiwiY29tcGFueV9uYW1lIjoiU3ByaW5nIFByb2Zlc3Npb25hbCIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoieFJOWTBONGIwYTJuUnJJckFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCZUJlZSIsImxpbmsiOiJodHRwczovL3NnLmJlYmVlLmNvbS9qb2IvMjAyMTA0MjAtMjc2ODc0ZTM3NDc1ZTY1NTQxYzNhZmFmYmFjNzI2N2E/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "System Analyst", "company_name": "Learnship Networks GmbH", "location": "Singapore", "via": "via MNC Jobs Singapore | MNC Jobs In Singapore", "description": "As the world’s leader in digital payments technology, Visa’s mission is to connect the world through the most creative, reliable and secure payment network - enabling individuals, businesses, and economies to thrive. Our advanced global processing network, VisaNet, provides secure and reliable payments around the world, and is capable of handling more than 65,000 transaction messages a second. The company’s dedication to innovation drives the rapid growth of connected commerce on any device, and fuels the dream of a cashless future for everyone, everywhere. As the world moves from analog to digital, Visa is applying our brand, products, people, network and scale to reshape the future of commerce.\nAt Visa, your individuality fits right in. Working here gives you an opportunity to impact the world, invest in your career growth, and be part of an inclusive and diverse workplace. We are a global team of disruptors, trailblazers, innovators and risk-takers who are helping drive economic... growth in even the most remote parts of the world, creatively moving the industry forward, and doing meaningful work that brings financial literacy and digital commerce to millions of unbanked and underserved consumers.\nYou’re an Individual. We’re the team for you. Together, let’s transform the way the world pays.\n\nJob description:\n\nResponsible for production development & support (DevOPS) on payment system services handling Real time data.\n\nResponsible to debug code, give code fix, build jar and deploy in production as and when required.\n\nMonitor processing, and ensuring timely execution, delivery, and availability.\n\nResponsible for migration of application to Hadoop framework.\n\nDetect technical issues, perform root cause analysis, and identify permanent solutions to fix problems as needed.\n\nSet audits and alerts to detect problems, and facilitate maintenance activities.\n\nPlan and execute changes as per instructions, and strictly adhere to the processes and guidelines relating to change, incident, and problem management.\n\nRun problem bridges by collaborating with others from different functional and technical areas and escalating as needed to resolve problems in a timely manner.\n\nEngage in knowledge transition as well as research and analysis activities to find solutions to various business and technical problems.\n\nEvaluate alternative methods, and present recommendations and justifications to management.\n\nIdentify improvement opportunities, and build Automation as well as engaging in performance tuning of the code.\n\nProvide updates and contribute to the team’s knowledge repository.\n\nQualifications\n\nA Bachelor's Degree or higher in Computer Science or a relevant degree in engineering or science is required.\n3 to 4 years of ETL, JAVA and Hadoop experience, as well as proficiency in any one language (Java, python, Scala).\nProficient in development using Java, J2EE, JSP/Servlets, Struts, Spring and Hibernate.\nGood understanding of Hadoop framework and have work experience with Bigdata technologies.\nShould have very good knowledge in Kafka and Spark (Scala is a plus).\nGood understanding of NoSQL database / worked with MongoDB/Apache Cassandra.\nMust have worked in Unix/Linux operating systems.\nExperienced in Java development using IntelliJ or any major Java IDE.\nAbility to solve complex production problem and debug code.\nStrong interpersonal, facilitation, and effective communication skills (both written and verbal).\nStrong Team player and ability to collaborate as part of virtual team across the globe.\nIncumbent must be a quick learner to learn new technology, tools and ability to cascade the knowledge to others.\nAbility to prioritize and perform multiple tasks simultaneously and deliver on time with quality\nYou must have strong verbal and written communication Skills\nJob holder must have flexibility to work in shifts and during weekends and extended hours when needed\nYou must have strong self-motivation, sense of ownership and ability to retain focus under stress during crisis situation.\nYou must have strong business ethics, self-discipline and trustworthiness to handle sensitive confidential data in live production environment.\nJava Certification preferred.\nUnderstanding of payment services is a plus.\n\nAdditional Information\n\nWork Hours\nThis position requires the incumbent to be available during core business hours.\nJob holder must have flexibility to work in shifts and during weekends and extended hours when needed\nTravel Requirements\nThis position requires the incumbent to travel for work 0% of the time.\nMental/Physical Requirements\nThis position will be performed in an office setting. The position will require the incumbent to sit and stand at a desk, communicate in person and by telephone, frequently operate standard office equipment, such as telephones and computers, and reach with hands and arms.\nEEO Statement\nVisa is an EEO Employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status. Visa will also consider for employment qualified applicants with criminal histories in a manner consistent with EEOC guidelines and applicable local law", "extensions": ["14 days ago", "Full–time"], "detected_extensions": {"posted_at": "14 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTeXN0ZW0gQW5hbHlzdCIsImNvbXBhbnlfbmFtZSI6IkxlYXJuc2hpcCBOZXR3b3JrcyBHbWJIIiwiY29tcGFueV9taWQiOiIvZy8xMWZ5MXY4OG5jIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoibWVKU3I0WVpuMlZ5TkF1UUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRW9zQ0Nzd0JRVTVWWDA1eFZHUjFjRTE2TjFGQlltcFFjMll0Y0ZkQk5tRTRjemt0TVhrMVJIYzRTWFJ3ZVRaM1RtTkhibTh6UW1ocFVUbE5SMUJ1WHpWeVJFTXlNRWd6WVVsaWFtcGlXRE00VlRSSmIzTmpMVXhyT0hSTGFWVldOSFE1VUU1WE9VdFlaRTQwY2poM1VEY3RTV3hCTldObk1uSk9NR3hTVW0xdFdrVk1RVmwyYjB3elZUbDZhRTFNTm1aRU5WOUNabTV1YkROUVlVbHFVMlJpZFdsUGRXdHZVemw0WVd4U1NHdzJTR3RMT0hkTFkwRm1URUpDZVZwYVVtUm1ZV3RGTUdORVVVMXRPVEJKZW1VNUVoWXdXRzFEV1V4SWFFcEpaVVIwVVdGTmVHOXBTVU5uR2lKQlQwMVpVbmRDUzFGa09GUmxNRzFYWjBoeU1WUnJPVFpCVXpaNU9GTjRha2wzIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNTYiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTU5DIEpvYnMgU2luZ2Fwb3JlIHwgTU5DIEpvYnMgSW4gU2luZ2Fwb3JlIiwibGluayI6Imh0dHBzOi8vc2cubW5jam9iei5jb20vam9icy9zeXN0ZW0tYW5hbHlzdC1zaW5nYXBvcmUtMzAyNjE1P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Business Operations", "value": "GC06"}, {"text": "Accounting and Finance", "value": "GC01"}, {"text": "Customer Service", "value": "GC10"}, {"text": "Human Resources", "value": "GC15"}, {"text": "Management", "value": "GC18"}, {"text": "Education", "value": "GC11"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Protective Services", "value": "GC23"}, {"text": "Science and Engineering", "value": "GC27"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "System analyst", "value": "system analyst"}, {"text": "Systems analyst", "value": "systems analyst"}, {"text": "Business analyst", "value": "business analyst"}, {"text": "It analyst", "value": "it analyst"}, {"text": "Analyst", "value": "analyst"}, {"text": "Senior", "value": "senior"}, {"text": "Security analyst", "value": "security analyst"}, {"text": "Application analyst", "value": "application analyst"}, {"text": "Engineer", "value": "engineer"}, {"text": "Project manager", "value": "project manager"}, {"text": "Software engineer", "value": "software engineer"}, {"text": "Hris analyst", "value": "hris analyst"}, {"text": "Lecturer", "value": "lecturer"}, {"text": "Manager", "value": "manager"}, {"text": "Senior analyst", "value": "senior analyst"}, {"text": "Soc analyst", "value": "soc analyst"}, {"text": "Sr analyst", "value": "sr analyst"}, {"text": "Support analyst", "value": "support analyst"}, {"text": "Support manager", "value": "support manager"}, {"text": "System", "value": "system"}, {"text": "Systems administrator", "value": "systems administrator"}, {"text": "Technology analyst", "value": "technology analyst"}, {"text": "Test analyst", "value": "test analyst"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Internship", "value": "INTERN"}, {"text": "Part-time", "value": "PARTTIME"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Mining", "value": "/business/naics2007/21"}, {"text": "Research", "value": "/business/naics2007/5417"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Accommodation", "value": "/business/naics2007/721"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Real Estate", "value": "/business/naics2007/53"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "OCBC", "value": "/m/055r27"}, {"text": "Jobline Resources Pte Ltd", "value": "/g/11gp2647pn"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Workato", "value": "/g/11dxpy_3xd"}, {"text": "Avensys Consulting", "value": "/g/11g7022gjf"}, {"text": "Chevron", "value": "/m/01pvx3"}, {"text": "ELITEZ PTE. LTD.", "value": "/g/11dxptfkcf"}, {"text": "ILLUMINA SINGAPORE PTE. LTD", "value": "/m/09mxkxs"}, {"text": "M1 LIMITED", "value": "/m/05n486"}, {"text": "Mantu", "value": "/m/0b6mxkc"}, {"text": "Public Service Division", "value": "/g/11g6__bv10"}, {"text": "Rakuten Asia", "value": "/g/11g7072z1v"}, {"text": "Techcom Solutions", "value": "/g/11c73vztx3"}, {"text": "United Overseas Bank Limited", "value": "/m/04gjd1"}, {"text": "VISA", "value": "/m/01kqjn"}, {"text": "Venture Corporation Limited", "value": "/g/11bc61gglw"}, {"text": "Xilinx", "value": "/m/03dwkc"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "Activate Interactive Pte Ltd", "value": "/g/11dxq192l5"}, {"text": "Aramco", "value": "/m/01qjg2"}, {"text": "Avnet", "value": "/m/0c8xmc"}, {"text": "BGC Group", "value": "/g/11g0j3fjv8"}, {"text": "Bgc Group Pte. Ltd.", "value": "/g/11g9mphr4f"}, {"text": "CONNECT ENERGY SERVICES PTE. LTD.", "value": "/g/11dxptylw6"}, {"text": "Cochlear Ltd", "value": "/m/0kqqgc"}, {"text": "Crédit Agricole Corporate and Investment Bank", "value": "/m/04n1_w"}, {"text": "Ecquaria Technologies Pte Ltd", "value": "/g/11dxq26pxz"}, {"text": "Edwards Lifesciences", "value": "/m/03p20ps"}, {"text": "Equinix", "value": "/m/07btnq"}, {"text": "Experis Singapore", "value": "/g/11dxpnwm3s"}, {"text": "Flintex Consulting Pte Ltd", "value": "/g/11h1z41pzb"}, {"text": "ITCAN Pte Limited", "value": "/g/11dxpstz9t"}, {"text": "Institute of Technical Education", "value": "/m/05_02p"}]}]}