{"search_metadata": {"id": "6082792da4bb38705e2f8d02", "status": "Success", "json_endpoint": "https://serpapi.com/searches/c62d82e50ed42d4c/6082792da4bb38705e2f8d02.json", "created_at": "2021-04-23 07:37:17 UTC", "processed_at": "2021-04-23 07:37:17 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28project+manager%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=30", "raw_html_file": "https://serpapi.com/searches/c62d82e50ed42d4c/6082792da4bb38705e2f8d02.html", "total_time_taken": 1.36}, "search_parameters": {"q": "(project manager) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "30"}, "jobs_results": [{"title": "Project Manager - Regional Projects", "company_name": "Sciente Inc", "location": "Singapore", "via": "via SCIENTE", "description": "An exciting opportunity for an experience Project Manager to be involved in running regional projects.\n\nMandatory Skill(s)\n• Have a university degree and professional Project Management Certification like PMP or Prince 2;\n• At least 6 years of proven track record in successful managing projects;\n• Good experience in running projects for global, multi-cultural, multi-location, matrix environment;\n• Excellent stakeholder management and management of project team members across multiple locations;\n• Focus in meeting time lines, firm hold of project budget, ensuring that internal/external work together to achieve the objectives of the project;\n• Ability to think out of the box, proactive in anticipating issues, provide wise counsel/advice to resolve issues and leveraging on industry best practices when applicable;\n• Excellent communication skills and emotional intelligence to influence key decisions, mediate conflicts and build consensus;\n• Tenacity and the drive to work through issues... obstacles in a calm/collected manner;\n• Pre-empt any risks and mitigate any threats or problematic areas proactively;\n• Familiar with project budgeting, project financials /projections, monitoring of project costing and regular project reporting;\n• Strong personality and yet personable to build and enrich relationships with the organization.\n\nDesirable Skill(s)\n• A Keen Entrepreneurial Spirit.\n\nResponsibilities\n• Responsible to lead, drive, manage projects for the organization;\n• To lead and manage project team, sponsors and stakeholders across business and technology lines and functions across globe and ensure the successful delivery of project;\n• Develop, execute and closure of project plan including coming up with detailed work plans, project scoping and initiation document, business case and business requirements document, schedules, project estimates, resource plans, etc.;\n• Manage project financials and keep track of project costs, scope, risk, schedule and progress, performance, deliverables, issues, escalations and conflicts;\n• Work closely with vendors to manage project scope, deliverables, risks, dependencies, cost and timelines;\n• Lead the teams to ensure that projects are implemented with timelines and meeting business objectives;\n• Produce accurate and detailed project reports and presentations to update the teams project milestones and status to senior management on a timely basis;\n• Proactively suggest, adopt industry best practices to run projects more efficiently and effectively;\n• Perform post-implementation review", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIgLSBSZWdpb25hbCBQcm9qZWN0cyIsImNvbXBhbnlfbmFtZSI6IlNjaWVudGUgSW5jIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiI2aEJOZWNqcTdYeVdGd21WQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFNDSUVOVEUiLCJsaW5rIjoiaHR0cHM6Ly93d3cuc2NpZW50ZS5jb20vc2NpZW50ZS1pbmMvdGVjaG5vbG9neS1qb2JzLzU0ODEvcHJvamVjdC1tYW5hZ2VyLS0tcmVnaW9uYWwtcHJvamVjdHMvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Deputy Director – Program Manager, Healthcare sector", "company_name": "Kerry Consulting", "location": "Singapore (+1 other)", "via": "via Kerry Consulting", "description": "We are partnering a leading healthcare technology provider in Singapore and our client is embarking on an exciting journey of transformation. An opportunity to help shape the future landscape of Singapore’s healthcare platform now exists for a driven and energetic Program Manager.\nResponsibilities\nReporting to the Director, Engagement Lead, the Program Manager will act as a co-lead assigned to a particular cluster to set direction for executing cross-functional programmes from end to end. You will partner with senior stakeholders to support business initiatives, put together program teams, directs multiple projects while managing engagement with clusters leaders. You will serve as a catalyst between the team and cluster to identify technology improvements and best practices for these projects.\nRequirements\nWe are looking for a seasoned technology leader with at least 15 years’ of experience in project/program management. You should have a proven track record of leading large... technology teams in developing, implementing and managing enterprise wide software. Experience working in both end user and vendor environment will be a big plus as the position require strong engagement ability. PMP certification or equivalent is a plus.\n\nTo Apply\nTo apply, please submit your resume to Samantha Ding at sd@kerryconsulting.com, quoting the job title and reference number. We regret that only shortlisted candidates will be notified.\n\nLicense No: 16S8060 / Registration No: R1104274", "extensions": ["1 day ago", "Contractor"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Contractor"}, "job_id": "eyJqb2JfdGl0bGUiOiJEZXB1dHkgRGlyZWN0b3Ig4oCTIFByb2dyYW0gTWFuYWdlciwgSGVhbHRoY2FyZSBzZWN0b3IiLCJjb21wYW55X25hbWUiOiJLZXJyeSBDb25zdWx0aW5nIiwiY29tcGFueV9taWQiOiIvZy8xMWM3M3Z0emM4IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiLThqb04tVjZIT0lidEVuN0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZZQkNyY0JRVTVWWDA1eFZIVndVMEZ1YjJwak1qUjRaamR6TkdWR01tUlNWRzlzVURremFFZE5abll0Yld4dU1VNTZlSFpOWm01cFkwVlVjbmxSUVhkV1JUUXhaMk5KZEU1ZldWcGhhMlI0WlZSVWQydDZTbUoyT0daT01rOVdOM3BpTFRSSGVFMUxUWEpKU3pObE1IaFdZbHBFVjJKbk1WVlhjVlpsWWpkRWJUZHZSUzFMWjA1ZlgyTTBaV1pHVEd0dWIxaDBXRFo2U0V0T09HZEphVFJZWVc5Q1QxbEVVMUptYUhCa1pEQmlVVWhoYTAxNFlrZG1SUzA0RWhaTWJtMURXVTVsUWtOa1pWVjBRV0YzTFV4UFNVTlJHaUpCVDAxWlVuZERkRkpWTWs5SVprVk5VelpmVW1wNGIxWnNSa1pUUjJ0dGQyZDMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18xMSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBLZXJyeSBDb25zdWx0aW5nIiwibGluayI6Imh0dHBzOi8vd3d3LmtlcnJ5Y29uc3VsdGluZy5jb20vcG9zaXRpb24vZGVwdXR5LWRpcmVjdG9yLXByb2dyYW0tbWFuYWdlci1oZWFsdGhjYXJlLXNlY3Rvci8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Project Manager (engineering / Project Management / Business Administration)", "company_name": "NANYANG TECHNOLOGICAL UNIVERSITY", "location": "Singapore (+1 other)", "via": "via MNC Jobs Singapore | MNC Jobs In Singapore", "description": "Roles & Responsibilities\n\nEnergy Research Institute @ NTU invites applications for the position of Project Manager.\n\nKey Responsibilities:\n• Manage roject deliverables / KPI’s\n• Submission of Project Claims & preparing budget forecast to the Program Director\n• Ensure proper governance in Project procurement & human resource acquisition & deployment\n• Ensure timely & accurate Project Documentation records\n• Organizing, compiling and submitting periodic project reports to funding agency and partners\n• Organizing stakeholders meeting, taking & finalizing minutes and follow up\n\nJob Requirements:\n• At least a Bachelor’s degree in Engineering, Project Management, Business Administration or equivalent\n• PMP Certification and/or CSCPM will be advantageous\n• Proven work experience as a Project Manager, Contract Administrator, Contract Manager or relevant role with more than 7 years’ experience\n• Knowledge of legal requirements and accounting procedures\n• Strong analytical & organizational... skills\n• Excellent communication, presentation & writing skills\n• An effective team player with good communication & interpersonal skills\n• Ability to work with varying seniority levels, including staff, managers & external partners\n• Able to work under pressure and meet tight deadlines\n\nWe regret that only shortlisted candidates will be notified", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIgKGVuZ2luZWVyaW5nIC8gUHJvamVjdCBNYW5hZ2VtZW50IC8gQnVzaW5lc3MgQWRtaW5pc3RyYXRpb24pIiwiY29tcGFueV9uYW1lIjoiTkFOWUFORyBURUNITk9MT0dJQ0FMIFVOSVZFUlNJVFkiLCJjb21wYW55X21pZCI6Ii9tLzBsNDlrIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiNlJ6VkpOSUowLTV0amo3QUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXFFQ0N1SUJRVTVWWDA1eFUyOWpiMDV4ZG1GcU1YWm9SMFpSWjFWV2VWWTFUMEZzUldsWFNURnJiMTlpU0VWZlRUVTBXQzF4WkdVeGRVbElhMGhFZEhsNGRHUnJSbkZrWTNoSGFWbzVjblJMU0RKelZGTm9VM1JTYjJzNVlqaHNVekIzVDB3NU1sSjFaa1ZOYTJoU1JXVk5kRk5LTkZWWVIyOHRVV3hQTVhGbFZVNUJTSEo2TWtKSlpFcFVNbkZRV0hOaVJrZFVVRTF2UTFWdE16aHdNVFJ0TXpGRGExTjFaemh5UVZoWloxZEVXRFpxYmt0NWVFc3RSemd0TFdoMmJVeFJOVGhWY0Uxa1ZpMVRMVUl6ZVRSdFFWSkJjRzlZZHpBeVpHMURabWhyV1d4MVgxaHFVUklXVEc1dFExbE9aVUpEWkdWVmRFRmhkeTFNVDBsRFVSb2lRVTlOV1ZKM1FYQlBjREUwY0RKbU5EbExZeTFVWVRrMU0zVnZWWFZpWkdoeVFRIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMTkiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTU5DIEpvYnMgU2luZ2Fwb3JlIHwgTU5DIEpvYnMgSW4gU2luZ2Fwb3JlIiwibGluayI6Imh0dHBzOi8vc2cubW5jam9iei5jb20vam9icy9wcm9qZWN0LW1hbmFnZXItZW5naW5lZXJpbmctcHJvamVjdC1tYW5hZ2VtZW50LWJ1c2luZXNzLWFkbWluaXN0cmF0aW9uLXNpbmdhcG9yZS03ODU0MD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Project Manager", "company_name": "FUJIFILM Business Innovation Singapore", "location": "Singapore (+1 other)", "via": "via LinkedIn", "description": "1. 3-5 years of Project Management experience\n2. PMP certified. Candidate is expected to be committed to complete certification if currently nit certified.\n3. Experience in participating in RFP preparations and support.\n4. University degree in Computing, Information Technology", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJGVUpJRklMTSBCdXNpbmVzcyBJbm5vdmF0aW9uIFNpbmdhcG9yZSIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiNXJVU0dJaU5tR29XNUZXT0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL3NnLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvcHJvamVjdC1tYW5hZ2VyLWF0LWZ1amlmaWxtLWJ1c2luZXNzLWlubm92YXRpb24tc2luZ2Fwb3JlLTI0OTMxMTk5OTc/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Project Manager (Dynamic 365, PMP certified)", "company_name": "NCS Pte Ltd", "location": "Singapore (+1 other)", "via": "via Jobs Guide Hub", "description": "Project Manager (Dynamic 365, PMP certified) Jobs in North-East at NCS Pte Ltd\n\nTitle: Project Manager (Dynamic 365, PMP certified)\n\nCompany: NCS Pte Ltd\n\nLocation: North-East\n\nType: Full-Time\n\nCategory:\n\nWe have a great opportunity for a talented and self-motivated Project Manager to join our Project Management team at NCS. At NCS, we seek to nurture talents in creating and developing innovative solutions. If you are passionate about new technologies and new ideas, NCS could be a place for you!\n\nRole & Responsibilities:\n\nYou will lead, deliver & maintain projects, work closely with various internal and external stakeholders to establish project plans, risk management plans, project milestones and deliverables. You will also be involved in defining project resources, performance reviews and post implementation evaluations as well as managing the integration of various components of the project including hardware, software installation, infrastructure, testing, business process review... redesign, application development, migration and data conversion, financial and costing etc.\n\nYou will need to build and maintain strong relationships with vendors to facilitate successful negotiation at work.\n\nYou are require to work cohesively with your team members to ensure that all tasks and deliverables are completed according to schedule. You will need to manage the team performance and constantly provide coaching and guidance to them.\n\nThe ideal profile should have / be:\n\n• Degree in Engineering, Computer Science or related discipline\n\n• Minimum 6 years of project management experience, preferably in Applications (Dynamic 365) projects\n\n• Technically strong in Dynamic 365\n\n• PMP Certified\n\n• Proven track record in assuming overall responsibilities and managing large scale projects\n\n• Familiar with Software Development Life Cycle (SDLC)\n\n• Mature people management skills, budget management and experience in building teams\n\n• Strong customer-service orientation", "extensions": ["20 days ago", "Full–time"], "detected_extensions": {"posted_at": "20 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIgKER5bmFtaWMgMzY1LCBQTVAgY2VydGlmaWVkKSIsImNvbXBhbnlfbmFtZSI6Ik5DUyBQdGUgTHRkIiwiY29tcGFueV9taWQiOiIvbS8wMjgyNzQ2IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiR3NsNmxmOGRGUjhMZl9PdEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFUzRlVaV3cwY0hoSmJETnlNWFpLYURONlRXeElUV2xDTFRBeGVVUnhZekU0T0hGWVIwbEJhWGRoVTNFeldtWmxUV0pxT1haMFdFNUpWMHM0VEdvM1VIUllWMlZFYmtFemREQkJTamxSVkd4eVRIaFVZVEY0VDBwd1NucG1OVWN0U3pCYWRYZExhM0owZW5OU1dVVlpNMDQwY0hoWFRGWkJNemRCWXpWTU4yMWxTMFV4UzB0TFdWRTJiMkZDUzNWNmVUbHpkRFJUV1ZSQ2FtcFJFaFpNYm0xRFdVNWxRa05rWlZWMFFXRjNMVXhQU1VOUkdpSkJUMDFaVW5kRWJrSlVSVzk2WWpOaGNWZHRWMHhZVmw5RGVUbDVSR3R2U2pkMyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzMzIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnMgR3VpZGUgSHViIiwibGluayI6Imh0dHBzOi8vam9ic2d1aWRlaHViLmNvbS9qb2IvcHJvamVjdC1tYW5hZ2VyLWR5bmFtaWMtMzY1LXBtcC1jZXJ0aWZpZWQvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Project Director", "company_name": "Hitachi Careers", "location": "Singapore", "via": "via Hitachi - Careers", "description": "The Company\n\nHitachi Vantara, a wholly-owned subsidiary of Hitachi, Ltd., guides our customers from what's now to what's next by solving their digital challenges. Working alongside each customer, we apply our unmatched industrial and digital capabilities to their data and applications to benefit both business and society. More than 80% of the Fortune 100 trust Hitachi Vantara to help them develop new revenue streams, unlock competitive advantages, lower costs, enhance customer experiences, and deliver social and environmental value.\n\nResponsibilities\n• Perform/Lead innovative Delivery Services for Hitachi customers as defined in a Statement of Work\n• Provide task status information and completion time frame estimates to project managers, always keeping in mind the most effective and efficient way to complete the technical tasks assigned\n• Inform the Project Manager when a customer requests an activity or deliverable that may be beyond the Statement of Work\n• Ensure timely submission... of deliverables and strategic presentations as defined in the Statement of Work\n• Validate with the Project Manager that the completion expectations have been met\n• Share knowledge; autonomously aligning personal contribution to the goals and priorities of the team and business\n• Participate in strategic project review sessions to share materials or lessons-learned\n• Participate actively in client workshops where appropriate\n• Demonstrate strong commitment to personal learning and development through attending approved technical training courses, acquiring approved certifications where necessary and using the acquired knowledge to demonstrate subject matter expertise and be at the forefront of technology innovation\n• Create detailed technical designs from high level solution designs, based on customer requirements analysis\n• Coach and train associate technical consultants, whilst also providing guidance to local teams or 3rd party partners in areas of expertise\n• Provide technical subject matter expertise to troubleshoot\n• Assist with creation of new innovative delivery collateral and maintenance of existing delivery collateral\n• Build relationships with Engagement Managers, Project Managers, Practice Principals, Solutions Consultants, and Solution Architects engaged in service opportunities\n• Build positive relationship with customer stakeholders and ensure that customer technical issues get resolved on priority\n• Assist the Project Managers to provide regular communication to the Engagement Manager/Practice team/Sales about the status of Delivery Services engagements\n\nQualifications\n• E/B.Tech/M.Sc./M.C.A/M.S.\n• Certified PM with either PMP or equivalent certification\n• Have at least 15 years of progressive project management experience in large infrastructure related projects\n• Has done roles as a project director or senior project manager in directly managing or recovering difficult customer situations\n• Fast learner who can work under ambiguity\n• Demonstrated experience in managing other project managers or senior technical consultants\n• Team player who can work closely with other internal stakeholders like sales and pursuit teams, customers and service delivery with outcome in mind\n• Has demonstrated experience in managing large and complex infrastructure projects involving storage, automation, compute and network\n• Working knowledge of hybrid cloud desired\n• Team player who can work in an environment of ambiguity\n• Must have good communicate skills\n• Must be customer focused\n• Must be willing to work flexible hours\n• Experience in executing complex migrations.\n• Extensive technical consultancy and Service Delivery experience\n• Technical subject matter expertise across the practice\n• Extensive experience in Hitachi technologies or relevant competitor technologies\n• Extensive design, implementation and operational knowledge including involvement in the setup, operation and transition of operational teams and managed services\n• Appreciation of multiple technology platforms\n• Deep understanding of managed infrastructure technologies and how they can be deployed to fit client solution requirements\n• Have ability to produce crisp customer presentations and good articulation skills in English - needs to control the flow and delivery of technical content to diverse audiences at customer meetings and seminars\n\nWe are an equal opportunity employer. All applicants will be considered for employment without attention to age, race, color, religion, sex, sexual orientation, gender identity, national origin, veteran or disability status", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IERpcmVjdG9yIiwiY29tcGFueV9uYW1lIjoiSGl0YWNoaSBDYXJlZXJzIiwiY29tcGFueV9taWQiOiIvbS8wMTl0azMiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJfVndyWWJpMWgxR0lyZ2IxQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VTNGQ1RFRTRkblp3ZW1oeVJIUnJha2RWZDFsSk5IVktSVmxQUW1OSVdraGFhM0V0Y2xFd05tMDBaa05UV25SM1JFeHVVbk5JUXprNFFuVmxRbTVyY0VOZmNVeExjRTlDYTI5UWR5MXFNbU5WVldvelNFMVNYM1pVYzFwcFZuSk9NVkZGVVhCS1JFUjZabXRXT0ZsNk5VSkhSMDFGTVRkWGVWVldMVVpCUmtOa2JUbFFWRnBuVWtZd05UWkhaMnh4TkdRMVZFUk1RMHhCY0dOUkVoWk1ibTFEV1U1bFFrTmtaVlYwUVdGM0xVeFBTVU5SR2lKQlQwMVpVbmRFV2t3NVJrUTJhMloxU1hKbmRGZGpVak5IVUd4b01UQkllbFpCIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNDAiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSGl0YWNoaSAtIENhcmVlcnMiLCJsaW5rIjoiaHR0cHM6Ly9jYXJlZXJzLmhpdGFjaGkuY29tL2pvYnMvNjEzODAzNS1wcm9qZWN0LWRpcmVjdG9yP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Project Manager - Virtualization", "company_name": "Michael Page", "location": "Singapore", "via": "via Joblum Singapore", "description": "This is an excellent opportunity to join a leading IT service provider with a strong presence across the region as their Project Manager - Virtualization.Client Details\nOur client is a leading IT service provider with a strong presence across the region. They are looking to hire their Project\nManager - Virtualization.\nDescription\nAs a Project Manager - Virtualization, you will be responsible for the following:\n• Leading and managing the project delivery and the road-map for the cloud Infra team.\n• Working with internal stakeholders to align the infrastructure to meet the business requirements.\n• Reviewing the current infrastructure solutions to identify the gaps and propose enhancements.\n• Working with vendors to ensure all Sla's are being followed.\n• Managing internal and external stakeholders by communicating proper delivery status and performance reports\n\nProfile\nAs a successful candidate you will have a bachelor's degree or equivalent with at least 5 years of project management... experience working with Virtualization projects. You will experience in delivering, designing and supporting Hyper Converged Infrastructure architectures for the business along with providing technical guidance on cloud platforms such as Azure and AWS. You will also have hands on experience on AWS or Microsoft Azure. Cloud certification such as AWS Certified SYSOPS admin or Azure equivalent and VMware Certification- Cloud (VCP-Cloud) will be advantageous\nJob Offer\n• Permanent role\n• Well known brand name\nTo apply online please click the 'Apply' button below. For a confidential discussion about this role please contact Tushita Kumar on +65 6416 9819", "extensions": ["2 days ago", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIgLSBWaXJ0dWFsaXphdGlvbiIsImNvbXBhbnlfbmFtZSI6Ik1pY2hhZWwgUGFnZSIsImNvbXBhbnlfbWlkIjoiL20vMDRjeGxkdyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6InhLeVpBUHFTTmx3V3pOSTZBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhVbW8zZG1keVJYUlFOakZYYzFaNGFVUkdkRXBNUTBOWmRVd3hia3RUVFRjdGJIVmhVVzFDZWtweGFXZGhZbXRJTFZrdFNXNVVVRlZQZVVaWGVUbGhNRVpwWHpKc1kwUllWVmsxZFU1cFJURXpWRTFHTFRKWVJtcElaVlIwZEVkT01EWlZNMVpuUVhobFRHMDJkWEZXWVROa2VXUmFZMmRhYkhoRWVrTmpSRGxKVmpsUFRHZ3dkREpQUzJsUFZUUlhhMlkzVld4cmJuaE1RbFZCRWhaTWJtMURXVTVsUWtOa1pWVjBRV0YzTFV4UFNVTlJHaUpCVDAxWlVuZERaMmM1WlVSTFYyOVJjbTFGV0Vwak9GcEJaelpyYmtFelh6QjMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY180NyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JsdW0gU2luZ2Fwb3JlIiwibGluayI6Imh0dHBzOi8vc2cuam9ibHVtLmNvbS9qb2IvcHJvamVjdC1tYW5hZ2VyLXZpcnR1YWxpemF0aW9uLzYyODc5MD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Client Implementation Project Manager", "company_name": "Marsh and McLennan", "location": "Singapore", "via": "via Marsh McLennan Careers", "description": "Mercer has an exciting opportunity available and is recruiting for a Implementation Project Manager for their Health and Benefits clients business in their Singapore office.\n\nClient Implementation Project Manager - Mercer Singapore\n\nWhat can you expect?\n• Your key focus will be on building and supporting client relationships.\n• Project-manage solution implementation, migration and renewal activities.\n• Collect requirements from client to oversee the end to end of the project lifecycle to implementation stage.\n• You will be a key member of the team facing off to the client for any change features and configuration of any new changes whilst being the go to person for any support to the client in this area.\n• Handling a migration project work stream with plans for completion by 2021\n• Handle work streams of new business to involve requirement gathering from the client and delivering portal and services to client satisfaction and also ensuring renewals are completed on a yearly basis and... configuring new requirements according to the new renewal changes.\n\nWe will count on you to:\n• Articulate and implement Mercer’s portal services to clients.\n• Become a champion of Mercer best practice for project management framework\n• Ensure effectively delivery of Flex Solution to regional client\n• Ensuring that the relevant parties are appropriately briefed about client requirements on monitoring the reporting work, be it weekly, monthly or a clients need for headcount reporting.\n• Connect with clients to collect requirements, acquire input, and communicate Mercer’s plans and deliverables\n• Adhere to the Flex implementation methodology for the client delivery i.e. Initiation; Requirements; Design &Configuration; Testing & UAT; Go Live; Project closure.\n• Interface with other teams in Mercer EH&B (client management teams, System Configuration Team and offshore service center) for optimal service delivery and issue resolution\n• Manages customer expectations, resolves project conflicts, and delivers the assigned project on time.\n• Facilitates all meetings with Mercer local team and client to gather requirements and review project scope.\n• Identifies documents and manages project risks, open items, schedules, scope, and priorities\n\nWhat you need to have\n• 8 years track record as a Business Analyst in Project Implementation work\n• Insurance background ideally and this could be specific to Health and Benefits\n• Lean Six Sigma training or PMP Certified\n• Attention to detail\n• Relationship management\n• Knowledge of Insurance Operations preferred\n\nWhat makes you stand out\n• Strong executor\n• Excellent Team player\n• Being a confident communicator in developing key business relationships with clients in Asia", "extensions": ["4 days ago", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDbGllbnQgSW1wbGVtZW50YXRpb24gUHJvamVjdCBNYW5hZ2VyIiwiY29tcGFueV9uYW1lIjoiTWFyc2ggYW5kIE1jTGVubmFuIiwiY29tcGFueV9taWQiOiIvbS8wNTNydyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6InBHanBmazFyU1VIbldlZ3pBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2WUJDcmNCUVU1VlgwNXhVbVpKVUdabWNtTnlPR1Y1ZGxNeGFuVnhkR1EwU0doSFNERldjSHAyVWxBMVVEWkJjM1ZvWmtaRWVIbE1kMnN3WlVGUFNXbERSbkJGTWxkelpGTktOSGc1ZUhRMlgySlZMWGxKWlZCSWRuRm9UVXgyVEZSWFprTnljMXBKZGt0UlNqaGFNR0p6WHpCR01ETnFYME5qY0daMWJrUnhWR2swYUZCQldWVldlSFZUZVVWeFZXdzFiRXRzTTFFNUxVVkNkRWMxVW5JMWRtUlRhRTlxTWs5U2RHWklUVGN5UzNORmQwbHNMVmhEWlU1ekVoWk1ibTFEV1U1bFFrTmtaVlYwUVdGM0xVeFBTVU5SR2lKQlQwMVpVbmRCVVRKbmRtZENZMHB4VlRreWRFaDZaelJuVEV0MldqbHBTVXhSIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNTUiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTWFyc2ggTWNMZW5uYW4gQ2FyZWVycyIsImxpbmsiOiJodHRwczovL2NhcmVlcnMubW1jLmNvbS9nbG9iYWwvZW4vam9iL1JfMTIwMjM3L0NsaWVudC1JbXBsZW1lbnRhdGlvbi1Qcm9qZWN0LU1hbmFnZXI/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Project Manager at TAIGER", "company_name": "TAIGER", "location": "Singapore (+1 other)", "via": "via BizLINKS Resources Pte Ltd", "description": "Project Manager at TAIGER\n\nJob Description\n\nAbout Taiger Headquartered in Singapore, TAIGER is a visionary AI company with a mission to free the human intellect. They automate mission-critical and cognitive work using Semantic and Natural Language Technologies to empower enterprises to optimise operational inefficiencies, drive business value and unlock better ROI. TAIGER's technology is accredited by Singapore's Infocomm Media Development Authority (IMDA) and has won numerous industry awards and recognition including Gartner's Hype Cycle for Natural Language Technology and Ontology in 2020 and IDC innovator in AI in 2019. TAIGER is recognized as a Gartner Cool Vendor. Find out more about us at www.taiger.com and www.linkedin.com/company/taiger PROJECT MANAGER We are building a team passionate about cutting-edge AI technology and the potential of TAIGER. You should be motivated by growth opportunities with your responsibilities expanding in scope. You can also look forward to be part... of a dynamic start-up environment where your contribution matters. Responsibilities Manage engagement projects from proposal sign off through to final delivery. Amaze customers with top-class service, punctual and quality delivery of projects and ensure all accounts are actively engaged. Manage tight control over resource hours and budgets allocated for each project. Review, prioritize, and track progress of issues that affect product delivery, quality, and functionality. Create and ensure execution of tasks on project schedule and timeline. Maintain and service TAIGER's clients, building a strong company brand of high quality software and project delivery. Function as a technical strategist for our customers, driving use cases, solutions and value with our platform. Drive value realisation in customer accounts through deep understanding of the business and technical landscape. Participate in business and/or technical cadences to review project progressions or program status. Develop and drive tactical, repeatable project engagements to augment the value of the delivery team. Provide insights with respect to the availability and applicability of new products and features. Maintain current functional and technical knowledge of Taiger solutions. Requirements MSc, BA/BSc computer science or related discipline, or equivalent experience. Project management, customer success and technical consulting experience. PMP certification and/or PMI-ACP certification preferred. Strong experience in Agile product development methodologies. Track record of delivering quality, on-time results. History of direct or indirect impact to increased adoption, expansion and retention. Technical experience and background in software services and licensing Thrives in a multi-tasking environment and can adjust priorities on-the-fly while still having the ability to focus on details and be analytical. Good technical and problem-solving skills coupled with the ability to provide quick resolution to problems. TAIGER does not engage any recruitment agencies for recruitment of talents into our company. All job applications should be submitted directly to TAIGER. Show more\n\nOriginal Joblink : https://sg.linkedin.com/jobs/view/project-manager-at-taiger-2415713197\n\nGoogle Company: https://www.google.com/search?q=Project%20Manager%20at%20TAIGER", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIgYXQgVEFJR0VSIiwiY29tcGFueV9uYW1lIjoiVEFJR0VSIiwiY29tcGFueV9taWQiOiIvZy8xMWcwaG05bnl6IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiYjRNX1dNZm82dXNtU285TkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFUyTlRMVUZHZVhSUE0yZDNTVU5pWVhCbWNIWlBTWEF3WVd4d1dFVkJaRGx1TW5jMFdUZERWMmhaVmtOeU9UVlFOSEZwV25SWWFrOXhiRWN0YVc1aFdUSTNWa0pyY0dWVlNVRjBORlpSTmpCVGFqWldlRlZJWldOdFZGQlpMVFU1WTFoM2RGazJkMjAzVlRkbE1YbDJWVUpYTVZWdlJXTm9lVVZZYmtKMVZsVnpTM2hET0ROc1ZFNXhXbXBXU21GWE5Ib3djVVY1YzFkblNFbDNFaFpNYm0xRFdVNWxRa05rWlZWMFFXRjNMVXhQU1VOUkdpSkJUMDFaVW5kQmJETkhaVEZUZFVKdVNtSlFZVGxvWWtSWFZtcE5hbEZpY1ZwQiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzYzIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJpekxJTktTIFJlc291cmNlcyBQdGUgTHRkIiwibGluayI6Imh0dHBzOi8vd3d3LmJpemxpbmtzcmVzb3VyY2VzLmNvbS5zZy9pbmRleC5waHAvam9iLWxpc3RpbmdzLXB1YmxpYy85MC1wcm9qZWN0LW1hbmFnZXIvNTYyMy1wcm9qZWN0LW1hbmFnZXItYXQtdGFpZ2VyLTU2MjM/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "5g Npo Project Manager", "company_name": "Techgig", "location": "Singapore", "via": "via Mendeley", "description": "About Job\n\nCTC Undisclosed Job Location Singapore Experience 7 - 10 yrs\n\nDescription\n\nIn Mobile Networks our goal is to be a leader in 5G and provide the best value to our customers as they evolve their networks. We continue to develop our 5G portfolio according to the latest 3GPP specifications. With more than 2,100 patent families essential for 5G, we are proud of the number of industry firsts that we have completed on the path to 5G commercialization. Nokia is also the only end-to-end mobile network vendor working with the major operators around the world.\n\nJob Description\n\nThe Project Manager drives all activities related to an assigned project, acts as a centralized coordination point and interface to the Account Team and is responsible for the performance delivered to the customer.\n\nJob Responsibilities & Competencies\n\nManages project or sub project of low risk. Lead sub project team. Plan and monitor delivery phase of sub project.\nManages projects or sub projects independently... ensuring timely delivery and good quality.\nEnsures customer satisfaction with delivery and implementation services.\nHas overall delivery, resource management to achieve project targets.\nAccountable for delivering the customer project scope products and services - to the customer within the assigned area of responsibility.\nEnsures project management based on PMI principles and in full alignment with NSN Nokia Mode of Operations.\nPlans and manages execution of the project or sub project according to agreed project targets.\nLeads sub project team.\nManages time, quality, progress, cost, risks, and internal and external resources.\nEnsures that all project milestones are met by using global processes, tools and interfaces.\nActs as customer interface in own responsibility area.\n\nList of tasks expected from NPO PM (but may not limited to the list below):\n\nLead the NPO team to ensure the project delivery as per plan committed to customer.\nEnsure all the process followed required for the delivery.\nLead the discussions with customer including top management regarding the KPI target, cluster acceptance.\nMake decision if there is any situation that may be required to put project activities on hold due to quality or any other issue.\nPerform partner management to facilitate the project activities i.e. swap schedule.\nMaintain the delivery timeline including report submissions.\nCoordinate internal and external stakeholders regarding NPO project activities e.g. swap delivery.\nCustomer Relationship Management.\nManaging financial and non-financial Performance.\nContribution to Service Business/Solution Creation.\nProject Management Planning.\nMonitoring and Controlling Project Execution.\nUpdating the Project Management Plan.\nRisk Management.\nStakeholder Management.\nLeading the Project Team.\nClosure and handovers.\n\nQualifications\n\nEstablished skills and knowledge of theory and principles within a professional discipline. Uses functionally specific knowledge.\nAt least 7 years of NPO Project Management experience.\nBachelors degree or equivalent.\nStrong Communication and negotiation skills\nPMP certification is an advantage\nSingaporeans and Singapore PRs are encouraged to apply\n\nWorking with us, you will have a positive impact on peoples lives and help to overcome some of the worlds most pressing challenges. We act inclusively and respect the uniqueness of people. At Nokia, employment decisions are made regardless of race, color, national or ethnic origin, religion, gender, sexual orientation, gender identity or expression, age, marital status, disability, protected veteran status or other characteristics protected by law. Nokia culture welcomes people as their true selves", "extensions": ["9 days ago", "Full–time"], "detected_extensions": {"posted_at": "9 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiI1ZyBOcG8gUHJvamVjdCBNYW5hZ2VyIiwiY29tcGFueV9uYW1lIjoiVGVjaGdpZyIsImNvbXBhbnlfbWlkIjoiL2cvMTFjNzNmeGd3dCIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IktlQUNmR2FiOXp5WnZ6MlpBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhWRlpHTkdac1ozTnBVREZVVmpoU1ExWjVVSGhxUmprMloxWlpabTh0Vm1sNFZYWXdjMWc0U0VSbmJWaG1ka0pYUjNWNlEyRjBNVkJDU0VoMmVVSlBRMmN5ZWpWSGVFVTRVVWRUY0V4dmFIZGtRMDF0Um1Sa2NtRlFZMHRNZERGemFFdExjVUZpTjNNelFYWlZZMUpPY0c4Mk9UaFdWV1UxY2xsSVltMUhhbEZmUVdkTFRXZFRPVmRJWjB0bk4xbEpMVFpaVGpCc05sQnFiVnBCRWhaTWJtMURXVTVsUWtOa1pWVjBRV0YzTFV4UFNVTlJHaUpCVDAxWlVuZERabmd6TVd4WmVsVmhSV2RpU1RBellXbFZkemhxVFV4TlNGZDMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY183MSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNZW5kZWxleSIsImxpbmsiOiJodHRwczovL3d3dy5tZW5kZWxleS5jb20vY2FyZWVycy9qb2IvNWctbnBvLXByb2plY3QtbWFuYWdlci0zMTE5OTc4P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Management", "value": "GC18"}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Advertising and Marketing", "value": "GC03"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Media, Communications and Writing", "value": "GC20"}, {"text": "Transportation and Logistics", "value": "GC30"}, {"text": "Art, Fashion and Design", "value": "GC05"}, {"text": "Construction", "value": "GC09"}, {"text": "Education", "value": "GC11"}, {"text": "Human Resources", "value": "GC15"}, {"text": "Protective Services", "value": "GC23"}, {"text": "Property", "value": "GC24"}, {"text": "Science and Engineering", "value": "GC27"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "Project manager", "value": "project manager"}, {"text": "Program manager", "value": "program manager"}, {"text": "Manager", "value": "manager"}, {"text": "Delivery manager", "value": "delivery manager"}, {"text": "Project director", "value": "project director"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Senior", "value": "senior"}, {"text": "Consultant", "value": "consultant"}, {"text": "Coordinator", "value": "coordinator"}, {"text": "Deputy director", "value": "deputy director"}, {"text": "Director", "value": "director"}, {"text": "Group manager", "value": "group manager"}, {"text": "Operations", "value": "operations"}, {"text": "Scrum master", "value": "scrum master"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Services", "value": "services"}, {"text": "Vice president", "value": "vice president"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Engineering Services", "value": "/business/naics2007/5413"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Entertainment", "value": "/business/naics2007/71"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Management", "value": "/business/naics2007/55"}, {"text": "Real Estate", "value": "/business/naics2007/53"}, {"text": "Research", "value": "/business/naics2007/5417"}, {"text": "Retail", "value": "/business/naics2007/44"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": ".AB4Jjf.qPB6Vc{padding-right:11px}.qfpP8d{padding:7px 0 7px 11px}.S003Ke{flex:none}.ZoN4Lb{color:rgba(0,0,0,.54)}.nAXVG{color:#70757a}.IxQsL{color:rgba(0,0,0,.26)}.xFO1De{color:#fff}.ooFpK{color:rgba(255,255,255,.30)}.mtnwac{color:#4285f4}.WxeeKb{color:#34a853}.hIVRU{color:#f29900}.EXaTMc{color:#fbbc04}.sxn46d{color:#000}.gqMTF{color:#1a73e8}.zpn8Mb{color:#d93025}.dEUPmd{color:#1e8e3e}.PJNo1{color:#fbbc04}Actively Hiring", "value": "e"}, {"text": "Michael Page", "value": "/m/04cxldw"}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Nanyang Technological University", "value": "/m/0l49k"}, {"text": "Jobline Resources Pte Ltd", "value": "/g/11gp2647pn"}, {"text": "Randstad Singapore", "value": "/g/11g70b50mr"}, {"text": "GECO Asia", "value": "/g/11gk72_bt_"}, {"text": "Facebook", "value": "/m/0hmyfsv"}, {"text": "HP", "value": "/m/03mnk"}, {"text": "IoTalents", "value": "/g/11dxq187wm"}, {"text": "NCS Group", "value": "/m/0282746"}, {"text": "National University of Singapore", "value": "/m/01q460"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "OPTIMUM SOLUTIONS (SINGAPORE) PTE LTD", "value": "/g/11g70hkrbx"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "ACI HR Solutions Ltd", "value": "/g/11c73ryh3p"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Apple", "value": "/m/0k8z"}, {"text": "Avensys Consulting", "value": "/g/11g7022gjf"}, {"text": "BNP Paribas", "value": "/m/02qhk4"}, {"text": "Ceridian", "value": "/m/07f8h6"}, {"text": "Ensign InfoSecurity", "value": "/g/11g4jhymjr"}, {"text": "Humanica Asia Pte. Ltd", "value": "/g/11h1y98c9z"}, {"text": "Kerry Consulting", "value": "/g/11c73vtzc8"}, {"text": "Marsh and McLennan", "value": "/m/053rw"}, {"text": "NSEARCH GLOBAL", "value": "/g/11dxpksll4"}, {"text": "NTT", "value": "/m/05mybp8"}, {"text": "OakTree Consulting", "value": "/g/11g70jfhtq"}, {"text": "Salesforce", "value": "/m/07btr5"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "TEKsystems", "value": "/g/11b6g4bkv0"}, {"text": "Teradyne", "value": "/m/04bzqp"}, {"text": "Toshiba Tec Singapore Pte. Ltd", "value": "/g/11g9n9q547"}, {"text": "Trustwave", "value": "/m/0n3xjf5"}, {"text": "Wood Plc", "value": "/m/07vv9s"}, {"text": "Workiva", "value": "/m/0113m1rd"}, {"text": "A-it Software Services Pte Ltd", "value": "/g/11dxpy_gl_"}, {"text": "ABS Group", "value": "/g/11dxplj1z6"}, {"text": "AIA", "value": "/m/02r5cgx"}, {"text": "ASEAN CABLESHIP PTE. LTD.", "value": "/g/11b7dsfph2"}]}]}