{"search_metadata": {"id": "60827b0a2236e21d0ae923eb", "status": "Success", "json_endpoint": "https://serpapi.com/searches/9a2c453862e5d249/60827b0a2236e21d0ae923eb.json", "created_at": "2021-04-23 07:45:14 UTC", "processed_at": "2021-04-23 07:45:14 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28solution+architect%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=170", "raw_html_file": "https://serpapi.com/searches/9a2c453862e5d249/60827b0a2236e21d0ae923eb.html", "total_time_taken": 1.69}, "search_parameters": {"q": "(solution architect) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "170"}, "jobs_results": [{"title": "AWS Solution Architect- Data and Analytics (BB-5A893)", "company_name": "OLIVER JAMES ASSOCIATES (SINGAPORE) PTE. LTD.", "location": "Singapore", "via": "via BeBee", "description": "Roles & ResponsibilitiesKey responsibilities may include: Independently lead client design workshops and provide tradeoffs and recommendations. This includes participating in pre-sales meetings, client visits, analyzing customer Big Data and Analytics solution requirements, and converge on a proposal which may be made of off the shelf, packaged software or SaaS solutions or architecting AWS native solutions ground up. Collaborate with the account teams to help customers and partners learn and use o AWS Data Ingestion mechanisms - Kinesis Firehose, DMS, S3 Transfers, Data Sync etc., o AWS Data Analytics services - EMR, Glue, Athena, Elastic Search, Kinesis, Managed Kafka, Redshift (DWH) etc o AWS Data Visualization Services – QuickSight or third-party tools like Tableau o AWS ML services – SageMaker o AWS Cognitive Services – Rekognition, Comprehend etc o Additionally, integrate services such as Redshift Spectrum, EMRFS, Lambda/Event Bridge for event driven architectures, CloudWatch... for monitoring etc. o Data Security using AWS services such as IAM, KMS, Secrets Manager, CloudHSM etc o Must be familiar with data Ser/Deser techniques, JSON/Parquet/Avro/ORC and Apache Arrow file formats o Working knowledge of Node.JS, Python is essential Business Case development focusing on TCO over commercial Hadoop offerings, DWH offerings with positioning of EMR, RedShift, Kinesis etc. Contribute to the Accenture AWS community and knowledge assets Provide solutions to complex business problems for area(s) of responsibility where analysis of situations requires an in-depth knowledge of customer organizational objectives. Set tactical and strategic direction to establish short and long term goals for area of responsibility. Qualification Minimum of 5 years of experience with Amazon Web Services. 5-10 years of experience with any of the following technologies: Databases (SQL/NoSQL, MongoDB, Cassandra, MariaDB, PostgreSQL), Big Data open source tools (Hadoop, Spark), Big Data proprietary tools (Hortonworks, Cloudera) programing experience (Java, Python, R, Julia, SQL). Candidate must have at least 2 AWS Associate Certifications or 1 AWS Professional Certification or AWS Data Analytics Specialty certification Hands-on AWS experience with a minimum of 2 implementations (preferred in Enterprise scale environments) Preferred Qualifications Bachelor’s degree or equivalent · Large scale project implementation experience required. Experienced AWS Cloud Architect with specialization in at least one of the following areas: AWS Cloud Strategy: Business Case development, application assessment and migration planning, Cloud Operating Model design Big Data: NoSQL data model design using DynamoDB and ANSI SQL usage for Redshift query development and query tuning, Adhoc querying with Athena, S3 Select etc.Tell employers what skills you haveAmazon Web ServicesArchitectureBig DataEnterprise ArchitectureSolution ArchitectureWorkshopsdesignedarchitectinghelp customerssales meetingsSAAS solutionsConverge", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBV1MgU29sdXRpb24gQXJjaGl0ZWN0LSBEYXRhIGFuZCBBbmFseXRpY3MgKEJCLTVBODkzKSIsImNvbXBhbnlfbmFtZSI6Ik9MSVZFUiBKQU1FUyBBU1NPQ0lBVEVTIChTSU5HQVBPUkUpIFBURS4gTFRELiIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiM1FPTWd1TU9jejBfMC1zeEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCZUJlZSIsImxpbmsiOiJodHRwczovL3NnLmJlYmVlLmNvbS9qb2IvMjAyMTA0MTctZjViMGZiNTI0OGZkZDkxNjFjM2Y3MWYwZWJkNWE4OTM/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Professional Services DevOps Architect", "company_name": "Orange", "location": "Singapore", "via": "via Jobs | Fidanto", "description": "JOB DESCRIPTION about the role To be successful as a DevOps Architect, you should demonstrate a leadership mindset, solid operational experience, and the ability to problem-solve. Ultimately, a top-notch DevOps Architect should have exceptional communication skills, be knowledgeable about the latest industry trends, and highly innovative. cloud infrastructure services and multiple cloud server instances. Cloud Systems Administrator will work closely as part of the team to develop, plan and support PS operations team. He or she will provide technical assistance on Linux, Windows and cloud based systems, and be expected to solve operational problems. The individual in this position must have strong technical knowledge of IaaS and PaaS. Our ideal candidate is a professional with experience in automating deployments with modern configuration and deployment management systems. He/She requires a broad knowledge of systems, servers, load balancers, storages, security, networking and some... background in programming. We are using cloud infrastructure, containerization, CI and CD process. The DevOps Architect will be responsible for all solution and technical aspects of the pre-sales process. The ideal candidate should possess strong knowledge of IaaS market, cloud computing and virtualization technologies. The DevOps Architect is responsible for identifying issues that may affect customer satisfaction and proactively working with the customer to solve the issues. Developing and maintaining relationships with key individuals within the customer accounts and becoming a trusted adviser to these individuals is a key skill required for success. Missions and main activities The main missions are: Automate builds, deployments and other aspects of release lifecycle Maintain and improve cloud platform infrastructure and configure auto-scaling Architecture and develop Docker-based infrastructure Find solutions to problems that disrupt availability, performance and stability of our systems Work in conjunction with development and operations team to understand requirements for functionality, performance and security of applications Explore and maintain understanding of the internal architecture and client requirements to our applications Manage the processes of deployments using blue-green deployment pattern whenever possible Implement the tools and processes for monitoring servers and services Ensure proper backup and restore when failure occurs Suggest ways to improve and reduce operational costs with adaptive performance tuning Investigate and develop skills in new technologies, collaborate across the company DevOps architect should automate the process with proper tools. Evaluating, implementing and streamlining DevOps practices. Establishing a continuous build environment to accelerate software deployment and development processes. about you Education and certifications: Bachelor's degree, Software Engineering or equivalent work experience Professional Cloud Certifications ( Amazon, Azure, Google) AWS Certified DevOps Engineer Professional preferred Azure DevOps Solution Certification preferred Docket/Kubernetes certification preferred Domain Experience: Minimum 4 years' experience in managing operations of virtualized platform Minimum of 4 years of Public Cloud (Azure, AWS, Google) deployment and management experience 10 yrs of application Integration and deployment experience with minimum 4 years of good hand-on experience with cloud services related to compute, network, storage, content delivery, security, deployment, and automation. Demonstrable experience of large scale DevOps Deployments within the last 1 year for production workload in a multi-cloud environment Demonstrable experience in cost savings in a multi-cloud environment using Cloud Optimization solutions (Eg: Cloud Health, Cloud Checker) for production workloads. Solid understanding on the pricing model of multi-cloud services(AWS, Azure, GCP) and its impact on solution architecture Minimum of 5 years of success in consultative/complex technical pre-sales and deployment projects, architecture, design, implementation, and/or support of highly distributed applications. Extensive knowledge on various Cloud services at the SDK Level Expertise in Infra capacity sizing, costing of Cloud services to drive optimized solution architecture, leading to optimal cloud infra investment vs performance and scale. Understand existing architecture and develop plans to support the growth in the cloud adoption. Good experience in automating the manual activities using scripting language. Expert level experience in writing infrastructure as code using CloudFormation Experience in Cloud Native DevOps CI/CD components Prior experience of programming language (Preferred NodeJS) Hands on experience using version control systems like GIT Good knowledge in Docker, Kubernetes Services, and Micro services design Provide hands on technical support for business applications and processes. Balance of strategic and tactical skills and the ability to work on cross-functional teams. Must understand networking, security, design principles and best practices in cloud Excellent time management and organizational skills Experience hosting an application on Public Cloud using Cloud services with IAAS offerings. Deep knowledge and experience in complex and large scale projects Technical skills: Must possess excellent automation skills and the ability to drive initiatives to automate processes. Excellent knowledge of software development and software testing methodologies along with configuration management practices in Unix and Linux-based environment. Extensive hands-on experience using Cloud services: Networking, Windows/Linux virtual machines, Container, Storage, ELB, Auto Scaling, Serverless Architecture, ARM Templates, SQL DB/DW, Data Factory, Analytics Service. Must possess excellent knowledge of infrastructure automation tools (Terraform, Cloud-Formation, Ansible, Jenkins, Chef, Puppet, Jira). Must have strong expertise in operating Linux/Unix environments and scripting languages like Python, Perl, and Shell. Ability to review deployment and delivery pipelines i.e., implement initiatives to minimize chances of failure, identify bottlenecks and troubleshoot issues. Experience in designing and building solutions to move data and process it. Deep understanding of cloud computing and data technologies, business drivers, emerging computing trends, and deployment options (Microsoft Azure, AWS or GCP) Knowledge in defining, designing and developing distributed and scalable products and services, including reusable domain-specific microservices on multi-platform /hybrid clouds (such as Microsoft Azure, AWS, Google Cloud Rackspace, VMware, or OpenStack) Deep understanding of Application, Infrastructure and security architecture and non-functional aspects like Performance, Scalability, Reliability, Availability etc Experience with software and product development lifecycle (incl. coding, coding standards and reviews, source control, testing, debugging, build, deployment and operations) Strong understanding of one or more development platform DotNet technologies (C#), Java / JavaScript REST / Webservices (with high performance, multi-tenancy, global, scalable elements) SQL, XML, JSON, Linux, ELK stack, Splunk, Solr, GIT, Ant/Maven, Jenkins Familiarity with Data Ingestion, Analytics, AI technologies Knowledge of integration techniques (System & network configuration) Good command on tools like Jenkins, GitlabCI, JFrog Artifactory, Docker, Kubernetes, Openshift etc Knowledge in Databases (Mysql, MongoDB) would be a plus. Consulting & Pre-Sales Assist the sales, pre-sales team in prospecting with relevant technical pitch and market OBS specific data Conduct detailed technical workshops with customers to define the \"to-be\" architecture and plan the migration roadmap together with Professional Services PreSales - responsible for the specification, design, cost and proposal of cloud solutions to meet formal client requirements. Support and organize technical responses to RFP / RFI's Assist sales teams in responses to RFPs and technical requirements documents Strong executive speaking and presentation skills - Formal presentations, white boarding, large and small group presentations Soft skills: Demonstrate strong analytical and technical problem-solving skills by leveraging the latest trends in technologies such as cloud, AI, and big data Handle ambiguity and able to move forward with imperfect information and get things done in a rapidly changing environment Must be comfortable working in an environment where ideas are challenged; Should possess good product instinct and excellent project management skills to push projects over the finish line with sound planning and persistent execution Astute in aligning effort & resources to achieve desired results department Orange Cloud for Business JOB DESCRIPTION about the role To be successful as a DevOps Architect, you should demonstrate a leadership mindset, solid operational experience, and the ability to problem-solve. Ultimately, a top-notch DevOps Architect should have exceptional co Experience: 10.00-13.00 Years", "extensions": ["4 days ago", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9mZXNzaW9uYWwgU2VydmljZXMgRGV2T3BzIEFyY2hpdGVjdCIsImNvbXBhbnlfbmFtZSI6Ik9yYW5nZSIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiN3l5RGtaQk84d2poY1FOakFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIHwgRmlkYW50byIsImxpbmsiOiJodHRwczovL3NnLmZpZGFudG8uY29tL2pvYnMvam9iLW9wZW5pbmcvaW5mb3JtYXRpb24tdGVjaG5vbG9neS1wcm9qZWN0LW1hbmFnZXJzL3Byb2Zlc3Npb25hbC1zZXJ2aWNlcy1kZXZvcHMtYXJjaGl0ZWN0LTI3Njk0NDY3OD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Azure Cloud Architect - Permanent -", "company_name": "EPS Consultants Pte Ltd", "location": "Singapore", "via": "via Monster", "description": "Role and Responsibilities\n• Perform Cloud cost-business benefit analysis.\n• Design and architect Cloud architecture models with a hybrid emphasis.\n• Implement the Cloud architecture using infrastructure as code templates.\n• Configure the security groups and network security requirements.\n• Work with application/solution teams to fine tune the Cloud architecture to ensure resilience and performance.\n• Define Cloud operational or governance standards, tools, and other related best practices.\n• Lead architecture reviews with project stakeholders.\n• Hands-on design, configuration, installation, performance tuning, and POCs.\nExperience and Personality Ideals\n• At least 8 years experience in IT projects.\n• At least 3 years of Cloud experience, ideally with MS Azure, both on the public cloud as well as Azure Stack.\n• Strong understanding of infrastructure applications/development, quality assurance and integration methodologies, concepts and facilities in a cloud environment.\n• Good... understanding of security considerations on Cloud.\n• Strong Enterprise architecture skills and experience in order to lead the architecture design and review any changes with application development teams.\n• Strong analysis, decision-making, and problem solving skills.\n• Demonstrates logical abstract thinking and assimilating/adhering to project goals and deadlines.\n• Ability to establish and maintain effective working relationships with employees, clients, vendors etc.\n• Resourceful and able to manage your own work with minimal supervision.\n• Ability to communicate effectively verbally and in writing.\n• Able to work well under pressure and as part of a team.\n• Good interpersonal skills.\n• Pays attention to detail.\n• Know how to have fun in challenging situations.\n\nQualifications and Education Requirements\n• •Bachelor’s degree in Infocomm Technology/Data Science would be advantageous.\n• Certified Microsoft Azure Architect Technologies (AZ300) required.\n• Certified TOGAF would be advantageous.\n• Other technical certifications would be advantageous.\n• Fluent in English, written and spoken required", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBenVyZSBDbG91ZCBBcmNoaXRlY3QgLSBQZXJtYW5lbnQgLSIsImNvbXBhbnlfbmFtZSI6IkVQUyBDb25zdWx0YW50cyBQdGUgTHRkIiwiY29tcGFueV9taWQiOiIvZy8xMWdieGdzY3Z5IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiMzNEN1VCQkdsbmpFTGxPUUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRW9zQ0Nzd0JRVTVWWDA1eFUyeDNTRkE0ZWpac2RrNWlZMHRHYWtkT2NrMDRSMEp0U2xCdVEyNVhZa1JHVW1rM016ZHlSRGcwVDBsb09GOWtXRmhEWlVGWFNYZHFjMjFxYkVjeVgzcHZiakZtTUV4QlNYaGZjbWR2VVcwM01WVkNTM0ZtVUVKeFVFMTRURmwzVTFsT1RrWlRSbU50VFRSUk1uaERUbXRDU1c5MGNFODRURE16UXpsaVJWOUJURzVNYW1OdlJtNUxOMlpIYUdWc1NrSjFSV0oxTkZRMFNqTTVTbTFmTlVSVVkyZEVjMjlRV2xaU1NXTnpWMmgyWVZsZmQyZE5WV3RMWlZkdmEwTkZjV3RpZUdnd0VoWkRiblZEV1ZCWE9VOVFTMnRuWjJWRk5rbDVRVVJuR2lKQlQwMVpVbmRCTjFRek1VTTBZMHQyV0V4VGRFSTNVblo0YmtWcFF6TlJURjlCIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMTQiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTW9uc3RlciIsImxpbmsiOiJodHRwczovL3d3dy5tb25zdGVyLmNvbS5zZy9qb2IvYXp1cmUtY2xvdWQtYXJjaGl0ZWN0LXBlcm1hbmVudC1lcHMtY29uc3VsdGFudHMtcHRlLWx0ZC1zaW5nYXBvcmUtMjA1MzY3NT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Salesforce Solution Architect", "company_name": "Volt - International", "location": "Singapore", "via": "via LinkedIn", "description": "Salesforce Solution Architect - Singapore\n\nAs part of the new technology center, our client is looking for a Salesforce expert to define the technical architecture of CRM using Salesforce.\n\nThe Key Responsibilities Are\n• Be involved in designing and developing of Salesforce solution components and implementation is align to the design\n• Lead technical requirements gathering and oversee the creation of application and system documentations, managing integration process and efforts\n• Develop specifications with IT partners for Salesforce and ensure integration of local and regional systems globally\n• Provide insights and expertise for various technical product offerings for application and infrastructure\n• Work closely extensively with various teams and other headquarters to ensure the fulfillment of business requirements\n\nThe Ideal Fit\n• Hands-on experience on Salesforce and relevant technologies\n• Collaborate with multiple stakeholders and team members to evaluate solutions and set a... right tone on technical direction\n• Good knowledge on middleware technologies\n• Good understanding of best practices on salesforce platform\n• Strong experience with service-oriented and event-driven system architecture\n• Salesforce architect certified\n\nPlease send your resume in WORD format by clicking the apply button below or contact Rosette Chong at +65 6701 1513 for a confidential discussion. Please note that only short-listed candidates will be contacted. CEI Reg. Number R1658433 (Chong Xinmei).\n\nApply now", "extensions": ["25 days ago", "Contractor"], "detected_extensions": {"posted_at": "25 days ago", "schedule_type": "Contractor"}, "job_id": "eyJqb2JfdGl0bGUiOiJTYWxlc2ZvcmNlIFNvbHV0aW9uIEFyY2hpdGVjdCIsImNvbXBhbnlfbmFtZSI6IlZvbHQgLSBJbnRlcm5hdGlvbmFsIiwiY29tcGFueV9taWQiOiIvbS8wOW0yM2R5IiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoidTUxZ1NiR2syUWtXUEdpREFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZZQkNyY0JRVTVWWDA1eFVWOUdTblpJUTBwUldEaFJZMDVSTmpSellYWlNZVkU0YVhCQkxUUm9aMGRtUjI5VlJGaFhla1F0Vlc1MVRWSnpiV3h4WmpCRkxUUlVNWEZrTlhscFFtWnRYMjVwZG10dWFIVmZNa3RmYkdjd1JFRlpSWGxaYzBkaGVpMVplREV3VDFoa1ptZHRVVWROY0UxSWRtNTVOVGRLWldFemNrbExWbGxMVkMweFMyaE5NREF6VEhSU0xYSnRVbnBVYlVSSFlYaGFOVGM0UlRacmQwOWZUMjlIVDFkV1JHdG5RbVY0VjNaVVVWOTNRMlJORWhaRGJuVkRXVkJYT1U5UVMydG5aMlZGTmtsNVFVUm5HaUpCVDAxWlVuZEJlbFEzVW5SU1IwUkhPRnBEZVVST2JqUldiMnBOTkVkNWF6QlIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18yMSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL3NnLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvc2FsZXNmb3JjZS1zb2x1dGlvbi1hcmNoaXRlY3QtYXQtdm9sdC1pbnRlcm5hdGlvbmFsLTI0NjgwNTM5NzM/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Enterprise Architect - Telco", "company_name": "Singtel Group", "location": "Singapore", "via": "via Singtel Careers", "description": "We have a great opportunity for a talented and self-motivated Enterprise Architect to join our Client Service Unit team in NCS. At NCS, we seek to nurture talents in creating and developing innovative solutions. If you are passionate about new technologies and new ideas, NCS could be a place for you!\n\nRole & Responsibilities:\n\nTheis role is an integral part of the Client Servicing Unit (CSU) and will play a key role in crafting fit-for-purpose and innovative solutions to solve clients’ issues. He/ She will also be someone who is passionate about technology and how it can be used to solve every day issues. He/She is an expert in architecture solution, performance engineering and enterprise architect practices spanning application, data and technology architectures.\n\nReporting to the Client Service Lead, Telco, he/she has a deep understanding of the client’s technology landscape and is able to build deep and trusted business relationships with the client and advise the clients on... innovative use of technology. He/she also act as trusted client advisor, working with sales to design and create the most appropriate architecture and day-to-day technical leadership in complex project(s).\n\nHe/she will work closely with different teams across NCS such as the Client Service Units, Lines of Businesses (LOBs), NEXT Services. He/she will work with the teams to define the solution offerings & value propositions to maximise NCS’ win probability in each and every opportunity. He/She will also need to help client with digital transformation through technology refresh contribute to the development and implementation of the long-term technology roadmap in the key clients business domains.\n\nBeside pre-sales, he/she may be involved in multiple projects with the delivery team to ensure we deliver to the client’s expectation. He/she will be viewed as an expert and will work with Delivery Lead to provide technology leadership and guidance to the team, as required.\n\nThe ideal profile should have / be:\n• University Degree in Engineering, Computer Science, Computer Engineering or equivalent\n• Certifications in TOGAF certification, Cloud certification (e.g. AWS Certified Cloud Practitioner) would be advantageous\n• More than 10 yrs of experience either as pre-sales architect or as solution/enterprise architect in an end user environment\n• Experience in enterprise architecture, Service Oriented Architecture, microservices, containerization, API and modern integration methodologies (e.g. Kafka)\n• Experience in Digital capabilities, Data Architecture and Cloud-based Architecture\n• Experienced in delivering highly integrated and multi-platform solutions\n• Experience with the full software development life-cycle using traditional and agile methodologies\n• Working knowledge of DevSecOps, CI/CD technologies\n• Good interpersonal and communication skills – ability to explain technology from a customer perspective\n• Highly analytical and able to manage complex solutions\n• Naturally inquisitive – asks questions to ensure understanding\n• Ability to influence and negotiate\n• Confident decision maker\n• Strong presentation Skills\n• Team player – demonstrated ability to work with multiple stakeholders to deliver a common goal\n\nif you would like to be part of the winning team that does great work, apply today!\n\n#NCSlife", "extensions": ["16 days ago", "Full–time"], "detected_extensions": {"posted_at": "16 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJFbnRlcnByaXNlIEFyY2hpdGVjdCAtIFRlbGNvIiwiY29tcGFueV9uYW1lIjoiU2luZ3RlbCBHcm91cCIsImNvbXBhbnlfbWlkIjoiL20vMDIwemZsIiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoia1c1Zmk5UHEtZDVCS2k1MkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFVWWnhVRlJxWTI5NVNYWlBUWGhST0c4NWVqVnFiekIzTWtvNWRUaG9lbEZPTFVsTE0zaElTMEl5WlVWd2VXbDRUV2t4Tmt0SU1VVkhkbEY0UmpseFlsSlJaMGM0Vm1GTmEyRnRORlZOTjBGUFp6TjRZeTE1YTNwSWJEVnBiSFJuT0VkSldrSlBRVnBqVDNwMVZFMU1SVzFRU25SeU9WOURNV2RCVEZkSVdYazJkbko1Tm1aNFNqTk1XamhOTTFONmNETlRRa281TlV0VmJFUm5FaFpEYm5WRFdWQlhPVTlRUzJ0bloyVkZOa2w1UVVSbkdpSkJUMDFaVW5kQkxUbE9kMmR6U1V4cFVGWmFVVnB3U1VnelEybFNhbmhRYzB0UiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzI5IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFNpbmd0ZWwgQ2FyZWVycyIsImxpbmsiOiJodHRwczovL2dyb3VwY2FyZWVycy5zaW5ndGVsLmNvbS9qb2IvRW50ZXJwcmlzZS1BcmNoaXRlY3QtVGVsY28tU2luZy81NzIwMTU3MTAvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Cloud Engineer (BB-C0971)", "company_name": "Snaphunt", "location": "Singapore", "via": "via BeBee", "description": "The JobIn this role, you will design, transform and build our core infrastructure and IT services into a secure, efficient and cost-effective platform.You will be responsible for : Providing full architecting, engineering and administration of Cloud solution in the infrastructure (IaaS) and Platform (PaaS) space.Collaborating across business units and project teams to understand their business requirement, project and operation must-have, deriving solution to address all requirements considerations.Collaborating, building and operating the DevOps infrastructure with the Application Developer team, including the development, operation and administrative of the continuous integration/delivery environment.Working with the integral unit in the Infrastructure team to support the system operation between cloud and on-premises IT network infrastructure.Deriving a continuous improvement program to review all internal and external cloud operation, validate industry best practices to automate... operational and security tasks, implement enterprise-grade, cloud management and governance tools.Administering and operationally supporting the operations of all products and services deploy into on AWS platform.Automating the proactive monitoring and statistic reporting capabilities to support operational response and maintenance.Conducting capacity planning to forecast resource acquisition, maintain infrastructure availability and ensure sustainable cost.Engaging in all project planning, management and development of cloud related tasks, include supporting all integration requirements with the company on-premises IT network infrastructures.The ProfileYou have a Diploma/Degree in Engineering or Computer Science.You have at least 5 years of working experience in cyber security and risks in cloud ecosystems like AWS.You possess at least 3 years of practical experience in architect, design, provision and administration of workload on public Cloud in AWS, Azure or Google.You are well-versed in both English and Mandarin to liaise with Chinese speaking associates.You have experience working on AWS cloud services such as multi-account strategy, landing zone setup operation, strategise compute and network services, integrated-tiered security, role-based identity, data and storage management, encryption technology and compliance services.You possess knowledge with practical hands-on experience in deploying and optimising the use of management and governance tools within AWS Cloud Platform.You have experience in deploying and optimising the use of Cloud Formation or equivalent automation tools in AWS operation.Having knowledge and experience of deploying and administration of MySQL and PostgreSQL databases in AWS EC2 and RDS will be an advantage.Having a good certification in AWS platform will be an advantage Eg. AWS Certified Solution Architect Associate, AWS Certified SysOps Administrator and others.Being familiar with Linux OS, Java, Docker, Kubernetes and others is a plus.You are self-motivated and result-oriented with good analytical, problem-solving, presentation and communication skillsYou are a team player who is able to communicate and collaborate with others, enjoy hands-on technical work and technical documentation", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDbG91ZCBFbmdpbmVlciAoQkItQzA5NzEpIiwiY29tcGFueV9uYW1lIjoiU25hcGh1bnQiLCJjb21wYW55X21pZCI6Ii9nLzExYzc0dDYxdzgiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJOeGNTZ3NDYjhMWlhLbFA5QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VTBNNWVVSldXV1pWZGtwSWF5MURRV1pNVTBjMWFYTnBaazh4YVRORVdYbDBkbTh5WkUxSk1qUnFYMDV1YWpOV05HMURlSFJxWVRWbVdXdHhlbXR1TkZkM1RYazBZbFJ2Ym5acmNHeHpXbk5IVlUxS01HMW1Sa1JZY3pWQ1VGYzBkRFZsTVVSUlIxODBZMkZ3ZVRKcFFUVkRhR0ZDYW5kcWFuUnFkV05zVVVFeE9GQlljbEZEUm5GbmFXbzJWRVZZV1hORk1YQlBkbGQ2VUZObkVoWkRiblZEV1ZCWE9VOVFTMnRuWjJWRk5rbDVRVVJuR2lKQlQwMVpVbmRCUmsxTmRta3hNMjgxYkVSTFRtbGpaRXRFZWpGMVkwVldTVzVSIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMzciLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQmVCZWUiLCJsaW5rIjoiaHR0cHM6Ly9zZy5iZWJlZS5jb20vam9iLzIwMjEwNDE3LWM3NWU2Y2Q3MThmNjZmZGQ1YWY0Mjk1NjliNWMwOTcxP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Cloud Solution Architect", "company_name": "Capitaland Business Services Pte. Ltd.", "location": "Singapore", "via": "via Monster Singapore", "description": "Responsibilities\n• Design and deploy overall solution architecture to meet current and future business and product requirements\n• Create overall architecture blueprints and design patterns to guide development\n• Conduct technical product evaluation and selection\n• Align technical architecture and roadmap with product design\n• Define the principles, guidelines, standards and solution patterns to ensure solution decisions are aligned with the enterprise's future-state architecture vision.\n• Set technical standards and monitor compliance to same\n• Evangelize standardization and architecture practices\n• Conduct technical sessions to establish agreement on development approach\n• Partner with key stakeholders and proactively consult on projects regarding Architecture concerns and direction.\n• Support design of application architecture components, by defining architecture and design, and documentation of architecture relevant system or software changes or enhancements to all assigned... systems.\n• Monitor the current-state solution portfolio to identify deficiencies through aging of the technologies used by the application, or misalignment with business requirements.\n• Leads analysis of complex production support issues that are related to Architecture.\n• You will assess new technologies and develop solutions appropriate to business requirements for Architecture, and that leverage architecture standards.\n\nRequirements\n• Degree in Business and IT with professional certification in IT project management and enterprise architecture\n• 5 to 7 years of design/implementation/consulting experience with distributed applications with at least 3 years hands-on experience as a technical lead and system architect role\n• Working knowledge of DevOps software development tools / methodologies and a solid software development background\n• Hospitality domain knowledge preferred\n• Experience with cloud architecture on Azure (preferred) / AWS\n• Solid understanding of Server-side, .Net and/or Java development, Service Oriented Architectures (SOA), web services, microservices and digital services development\n• Experience in designing, developing and deploying large, scalable production applications on cloud/PaaS platforms and Containers, such as AWS, Azure and OpenShift\n• Exposure to middleware and different messaging / API management technologies\n• Able to independently analyze and identify comprehensive solutions considering all functional implications while developing a workable solution\n• Results and customer oriented\n• Team player with strong organization and interpersonal skills\n• Strong written, presentation and stakeholder management skills\n• Preference for candidate with deep domain knowledge in retail, commercial or hospitality sectors\n• Experience with managing teams with prior people development experience\n\nOffice Location: 615 Toa Payoh Lorong 4, #07-00 StorHub, Singapore 319516\n\nAt CapitaLand, we advocate fair employment practices, and recruit talents based on merit and fit with our Corporate values. We provide equal opportunity for all qualified persons and build an inclusive workplace regardless of race, gender, age, religious belief, or nationality.\n\nOnly shortlisted candidates will be notified", "extensions": ["25 days ago", "Full–time"], "detected_extensions": {"posted_at": "25 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDbG91ZCBTb2x1dGlvbiBBcmNoaXRlY3QiLCJjb21wYW55X25hbWUiOiJDYXBpdGFsYW5kIEJ1c2luZXNzIFNlcnZpY2VzIFB0ZS4gTHRkLiIsImNvbXBhbnlfbWlkIjoiL2cvMTFmeTF4bDNfayIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImZGZnpQemQ1dHdHLVM1VnZBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVyWUNDdmNCUVU1VlgwNXhVMHhHVTE4MVZ6Tm9hV2RETm5wMmF6TmtkekJvZEZkeFJGY3lWSFJaY0ZCcWJUTjFTMmg0Umt3d2FIaEZkV1ZxU21FMFVuZFZia1F4U2xGTVEyMXpjV0YyZERKbVpqSlRWVzF3TTJKVVZHdDFkVlpPZVVKZmVIRmFNM1V4YlhGZmFHRXdhVzVMYm1ZNGVsTlhaelpDUjE4M1gyY3pSMDUwUmxwYWRuWldUSEZ4U0VoclpWRkdlRVJzV2xwaGNVRmtZMjVEYkZCMlFreERWRXR2WTJGMlJuaHBWMm8wVEhGTmNuVkdRVmhZWnpOc1YybDBRWGs0ZGtvMFN5MVFkbXhEUTNNeFZqUXdMVkE1ZEdKemVGb3Rja2xLVVhaaFIzTmFTVjh6VDI4M2FFeFBMVFZETm1kWFNXbFFlamx5TFdSTU5CSVdRMjUxUTFsUVZ6bFBVRXRyWjJkbFJUWkplVUZFWnhvaVFVOU5XVkozUVVKS1FWUkpWMVZoWVZwVU1tSXdhR0ZVTmpSSmEwNU1aMXBPZHciLCJmY3YiOiIzIiwiZmNfaWQiOiJmY180NCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNb25zdGVyIFNpbmdhcG9yZSIsImxpbmsiOiJodHRwczovL3d3dy5tb25zdGVyLmNvbS5zZy9hbXAvam9iLXZhY2FuY3ktY2xvdWQtc29sdXRpb24tYXJjaGl0ZWN0LWNhcGl0YWxhbmQtYnVzaW5lc3Mtc2VydmljZXMtcHRlLWx0ZC1zaW5nYXBvcmUtMjc1MDY4NTcuaHRtbD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Solution Architect", "company_name": "EY", "location": "Singapore", "via": "via Jobs", "description": "At EY, our Global Managed Services is increasing focus on technology enabled platform Services. As Solutions Architect, you will be expected to support workstreams as part of a complex pursuit and run workstreams in Core pursuits. The role will focus on qualified client pursuits and include the design of business and technical solutions, transition and transformation plans and any ongoing development requirements. You will report to the Global Managed Services Area Solution Architect Leader and work closely with the other significant regional stakeholders as well as global delivery and enablement teams. Your key responsibilities: Apply the existing Solution Architecture Framework and approach Support solution workstreams within the pursuit covering all aspects of people, process and technology Apply assets in support of the design of target client solution (resourcing, location, technology, integration), transition and transformation program, based upon repeatable IP You will be... required to work on complex pursuits with the Lead Solution Architect, peer workstream leaders and Service Line Subject Matter Resource You will also be required to work on core pursuits, partner with pursuit leader and team You will be required to own core architectural assets and maintain them through the pursuit lifecycle Provide input towards the design of a specific priority managed services offering over the development lifecycle with particular focus on delivery components necessary to deploy a viable solution for our clients Support the Managed Services Delivery Team with the transition and establishment of the managed services Support training programs for potential managed services solution architect and offering leads Capture knowledge to support pursuits Support the recruitment and development of solution talent into the Managed Services team To qualify for the role, you must have: Experience in developing integrated managed services solutions Demonstrated experience building client solutions that leverage and reuse existing assets and capabilities including alliances. Developed client value propositions Some experience across Managed Services life cycle Experience in problem solving skill, costing, technology-based solution with deals and offerings 3 to 5 years of industry experience Relevant degree: Engineering, Computer science, Business development Ideally you will have: Experience supporting commercial negotiation, business development and delivery Client facing experience in terms of solution iteration and presentation skills Experience of managing complex client requirements that you will be able to turn into comprehensible and simplified solution You may have certification in architecture degree such as TOGAF Proficiency in Design Thinking and Agile Methodology The location of this position is flexible within the given Area. What We Look For We’re interested in self-motivated individuals who can easily function in a high demand, performance-driven environment. In addition, we’re looking for people who recognize the accomplishments of the team before the individual and are sought after as people developers. If you’re passionate about problem-solving and helping our clients with some of their most complex issues, this role is for you. What Working At EY Offers We offer a competitive compensation package where you’ll be rewarded based on your performance and recognized for the value you bring to our business. In addition, we offer a range of programs and benefits designed to support your physical, financial and social well-being. Plus, we offer A collaborative environment where everyone works together to create a better working world Excellent training and development prospects, both through established programs and on-the-job training An excellent team of senior colleagues, dedicated to managing and varying your workload", "extensions": ["25 days ago", "Full–time"], "detected_extensions": {"posted_at": "25 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2x1dGlvbiBBcmNoaXRlY3QiLCJjb21wYW55X25hbWUiOiJFWSIsImNvbXBhbnlfbWlkIjoiL20vMGc5amMiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJmbm9DMWlqdVM3NG4tLTc0QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFc3NCQ293QlFVNVZYMDV4VTNjMFJVSTVZa0ZmZW5BMldVVlJVVk5mYWxsdGJIWkdNbFp1TWtSbWNrSjVUSEpZWmxWeU9IRm1RVU5yVFhWSk1USkdTVWQ0VlMxRlUwNDFMVmxXVlV0b1QyMHhSMk5pYjAxdGFGUkZRMTltVFZSemVuSmtWRmhsYmsxNmFDMTVjelZQWTFBeFIzTndkbUpYU1hKTWFIUnJRWHBqZUV0NWJETkNVbFZyY0hKTVpXaHFhSFFTRmtOdWRVTlpVRmM1VDFCTGEyZG5aVVUyU1hsQlJHY2FJa0ZQVFZsU2QwRlRNRGhTV1hGZlUwOHlaRGhOTWtGT2MycERaM0ZDWjNKM2EzYyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzUxIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnMiLCJsaW5rIjoiaHR0cHM6Ly9zZy5maWRhbnRvLmNvbS9qb2JzL2pvYi1vcGVuaW5nL2FyY2hpdGVjdHMtZXhjZXB0LWxhbmRzY2FwZS1hbmQtbmF2YWwvc29sdXRpb24tYXJjaGl0ZWN0LTI2MTM3NjczND91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Head of Solution Architecture", "company_name": "eWave", "location": "Singapore", "via": "via Glassdoor", "description": "Company Description\n\nSpecialists in industry disruption, eWave is an independent digital transformation agency with commerce at its core. Using service design thinking, we have an unwavering commitment to delivering experience-driven digital reinvention that inspires deeper relationships between brands and their customers.\n\nPartnering with brands such as Nike, Canon, Coca-Cola Amatil, and Nestle, we work on some of the most exciting and innovative digital projects in the APAC market.\n\nOur team is our strongest asset, and together, we’re reimagining consumer needs using methods that bring our clients closer to their customers than ever before. We’re thinkers, we’re creatives, we’re technologists, and we’re looking for people to join us on our journey.\n\nJob Description\n\nAs the Head of Architecture at eWave, you will manage the architectural demand of eWave and our partners in line with global Client Solution Delivery processes. You will be tasked with building the Solution Architecture... practice from the ground up and leading a high performing team of technical and solution design professionals. This role will be part of the Global Leadership Team.\n\nKey Responsibilities:\n• Build Solution Architecture practice from the ground up - you will be tasked with establishing the Architecture practice from scratch.\n• Build and lead a high performing team of technical and solution design professionals\n• Cross-Functional role - will work with Presales, Delivery and other areas of the business when required\n• Act as trusted a complex solution consultant to the CTO, the wider eWave Delivery and Management team\n• Define and lead the strategic vision across globally for the solution architecture practice (Client Solutions)\n• Establish and maintain effective E2E design principles, governance & ways of working\n• Maintain alignment with enterprise principles on architectural and application roadmap strategies\n• Manage architectural supply in line with global resourcing processes\n• Create and maintain an architectural knowledge base for the global Client Solution application landscape\n• Produce the ‘as-is’ and ‘to-be’ architectural states for application services projects and programs\n• Provide technical insight for portfolio shaping, feature development and reduction of technical debt\n• Identify, manage and mitigate risk from design decisions across the global application landscape\n• Responsible across all technology stacks including both Salesforce and Adobe\n\nQualifications\n• Minimum 8-10 years of combined hands-on experience with software development, system integration and solution architecture.\n• 4-5 years’ experience leading a Solution Architecture practice (bonus points if you have built a practice from scratch)\n• Must have Salesforce Commerce Cloud & Magento experience\n• Demonstrable experience in the fields of: Enterprise Commerce Applications, Integrations and Microservices\n• Strong knowledge of enterprise level application ecosystems (ERP, OMS, CRM, WMS, etc.)\n• Solid understanding of design patterns and application levels\n• Ability to oversee and steer large scale implementations\n• Ability to instruct and guide development on a multi-client & multi-team basis\n• Ability to operate in complex, multi (C-level) stakeholder environments\n• Strong communication skills, both oral as written in English\n• Strong business understanding and ability to communicate technical recommendations in business terms\n• Strong understanding of Commerce Business Models and Processes (B2B and B2C)\n\nAdditional Information\n• Remote Work Opportunities with an ultra flexible working culture\n• Professional Mentoring Program with Semi-Annual Performance Review, 360 Feedback and Individual Growth Roadmap\n• Multiple learning opportunities and professional certification programs\n• Working as a part of a Global team in a Multicultural Environment\n• Unlimited Paid Annual Leave (after first 12 months of employment)\n• Gifted Birthday Leave\n• Rewarding Compensation Package\n\nDare to be different", "extensions": ["7 days ago", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJIZWFkIG9mIFNvbHV0aW9uIEFyY2hpdGVjdHVyZSIsImNvbXBhbnlfbmFtZSI6ImVXYXZlIiwiY29tcGFueV9taWQiOiIvZy8xMWM3M3c4Y25mIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoidHhDRjRER2ZSNElJdlNxRkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXNzQkNvd0JRVTVWWDA1eFVUaGhlbXBOUm1oUE1VcExNelZCWlhoMU9GVjJWbXBuT1d4eGFteEtRbXg2UkUweVNWTm5kMWczZEVsWGNtdEVUMUJOY0ZKeGVHUlhkVTVYVGpCWGN6bEdVMjAxWWxSUVRGaHBlRk5QWVZaWVNtOWFWME5DWlRCZmF6aFlXRVV6TTBSd1Z6ZzNkMWhhYWxkYVp5MU9NWHBCT0doaWJEaGxTR2RrUkhSalFuZFpNemwxWXpZU0ZrTnVkVU5aVUZjNVQxQkxhMmRuWlVVMlNYbEJSR2NhSWtGUFRWbFNkMEZrVGxKRU9GODRiVjlKTUZkNlZXNU1ZMlZVZUdRemFWRnJhMUUiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY181OSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBHbGFzc2Rvb3IiLCJsaW5rIjoiaHR0cHM6Ly93d3cuZ2xhc3Nkb29yLnNnL2pvYi1saXN0aW5nL2hlYWQtb2Ytc29sdXRpb24tYXJjaGl0ZWN0dXJlLWV3YXZlLUpWX0lDMzIzNTkyMV9LTzAsMjlfS0UzMCwzNS5odG0/amw9MzgwNDEwNjg1M1x1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Solution Architect - SAP SuccessFactors", "company_name": "HR PATH APAC SINGAPORE PTE. LTD.", "location": "Singapore", "via": "via LinkedIn", "description": "Job Description\n\n& Requirements\n\nLocation\n\nSingapore (SEA)\n\nExperience\n\n5+ years\n\nSalary/Package: On application\n\nEligibility: Singapore Citizen or Singapore Permanent Resident\n\nLanguage: English, Mandarin (preferred but not required)\n\nWork Area: SAP SuccessFactors Implementation and Consulting Delivery\n\nExpected Travel: 10 -30%\n\nCareer Status: Manager/Executive\n\nEmployment Type: Permanent - Full Time\n\nAbout Us\n\nHR Path Company is the Human Resource Solutions Specialist. As a partner of the leading vendors of the market, it carries out HRIS implementation projects and payroll outsourcing for large accounts as well as for SMEs. HR Path supports you in all your HR strategies, in France and internationally.\n• ADVISE: We advise and support companies in the definition of a method for aligning their HR processes with the company’s overall vision and strategy. The creation of synergies by HR is thus a source of added value for the company and its employees\n• IMPLEMENT: According to the... stakes, HR Path in the technical and functional setting up of all HR solutions, Oracle, SAP SuccessFactors, Talentsoft and Workday\n• RUN: We operate the HR solution that supports the digital transformation of your company\n\nThe group, established in 2001, has over 1000 employees, supports more than 1,300 clients and generates over $125M revenue. Headquartered in Paris, HR Path also has international subsidiaries in 18 different countries.\n\nWe Are The Most Experienced SuccessFactors Partner In APAC\n\nFor more information, visit\n\nWhat will you be accomplishing?\n\nWe are currently looking for an experienced Solution Architect with passion for technology and HR to help our clients unlock the potential of their employees and build world class HR processes and practices through the deployment of SAP SuccessFactors software. Not old school, on premise systems, that take years to implement, but fast, fluid, dynamic cloud-based systems that are engaging, easily adopted and drive real personal and organisational productivity.\n\nYou will bring your proven SAP SuccessFactors experience and HR knowledge to actively lead projects and guide clients through requirements gathering and contribute to business process improvement, stakeholder engagement, change management, quality assurance, risk management and user enablement. Though collaboration and effective project delivery you will ensure clients extract the full value from the Workday solution.\n\nThis is a rapidly changing environment, so we are looking for a team that want to embrace the evolution of HR as we develop dynamic technology to support Business and HR best practices.\n\nScope & Responsibilities\n• Work closely with senior stakeholders to understand their business requirements and contribute to the design and implementation of solutions\n• Deliver advisory services and leading practices in support of technology enabled business change integrator selection, vendor selection, application studies, solution architecture, or program diagnostics\n• Create innovative offerings, staying relevant and in sync with market changes and innovations\n• Responsible for the functional and technical part of a specific domain, as well as the capitalization of the new solutions\n• Delivers documentation aimed at making the consultants more operational (sharing of reference documents, provision of training support, etc.)\n• Provides support to the consultants as part of their requests by email, phone or via the forum\n• Ensures a technical overview on the new solutions\n• Writes setting guides on the new solutions proposed by the editor\n• Participates in internal projects to improve our offers (implementation accelerators, industrialization, tools, etc.)\n• Provides internal or external training in his or her area of expertise\n• Participates in tendering or pre-sales answers on the field of specialty (technical feasibility, costing, demo, etc.)\n• Support internal projects within the area of expertise\n\nWhat else do you need to know?\n• This is an exciting and fast-paced work environment\n• We love working with people who are passionate in their area of expertise, strong technical ability, creative, great interpersonal skills, innovative mindset, well-organised, attention to detail and great sense of humour\n• We are an advocate of work-life balance with a positive and healthy work culture\n• The team is very supportive and works cohesively to continue improving the implementation of Workday in the years to come\n• If you are looking for new challenges and can work independently but effectively in a non-traditional corporate environment, this is the place to be!\n\nRequirements\n• At least a university degree in HR or IT or any other related discipline\n• Must have a minimum of 5-8 years on SuccessFactors implementation\n• Minimum of 5 end to end SuccessFactors implementation, including hands on design and configuration\n• Must be certified in SuccessFactors modules such as Employee Central particularly in Core HR\n• SuccessFactors certification in Learning Management System, Recruiting, Onboarding is a plus\n• Advanced understanding of HR processes, organisational structures and business functions\n• Advanced knowledge of the architecture, functionality and relation to business processes of the ERP software and knowledge of at least one sub-module of SuccessFactors solution, preferably on Employee Central, Recruiting, Onboarding and basic knowledge of other modules\n• Fluent in English language\n• Excellent presentation and communication skills\n• Demonstrate willingness to learn and challenge business practices\n• You have a forward-thinking and agile mindset\n\nIn Addition, The Following Will Also Be Essential\n• Successfully combine strong leadership skills with sound technical knowledge and ability to clearly communicate key recommendations to clients\n• Track record of creating enduring client relationships based on trust, successful business development and credible program execution\n• Develop relationships of mutual trust with people inside and outside of their organisation based on respect, integrity, positive regard and an appreciation of the uniqueness of the individual\n\nPerks & Benefits\n• Competitive compensation package\n• Health and medical benefits\n• Excellent work-life balance\n• Diverse and inclusive work environment\n• Dynamic, exciting and vibrant team culture\n• Comprehensive training programs\n• Opportunities to develop new skills and career progress for our talents", "extensions": ["8 days ago", "Full–time"], "detected_extensions": {"posted_at": "8 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2x1dGlvbiBBcmNoaXRlY3QgLSBTQVAgU3VjY2Vzc0ZhY3RvcnMiLCJjb21wYW55X25hbWUiOiJIUiBQQVRIIEFQQUMgU0lOR0FQT1JFIFBURS4gTFRELiIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiUFZaU0dwUno0TmsxeklWTUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL3NnLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvc29sdXRpb24tYXJjaGl0ZWN0LXNhcC1zdWNjZXNzZmFjdG9ycy1hdC1oci1wYXRoLWFwYWMtc2luZ2Fwb3JlLXB0ZS1sdGQtMjUwNTI2MjU3Nz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}], "chips": [{"type": "Title", "param": "job_family_1", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Solution architect", "value": "solution architect"}, {"text": "Solutions architect", "value": "solutions architect"}, {"text": "Architect", "value": "architect"}, {"text": "Cloud architect", "value": "cloud architect"}, {"text": "Technical architect", "value": "technical architect"}, {"text": "Enterprise architect", "value": "enterprise architect"}, {"text": "Senior", "value": "senior"}, {"text": "Consultant", "value": "consultant"}, {"text": "Financial services", "value": "financial services"}, {"text": "Infrastructure architect", "value": "infrastructure architect"}, {"text": "Manager", "value": "manager"}, {"text": "Application architect", "value": "application architect"}, {"text": "Cloud engineer", "value": "cloud engineer"}, {"text": "It architect", "value": "it architect"}, {"text": "Lead architect", "value": "lead architect"}, {"text": "Network architect", "value": "network architect"}, {"text": "Security architect", "value": "security architect"}, {"text": "Senior architect", "value": "senior architect"}, {"text": "Systems engineer", "value": "systems engineer"}, {"text": "Associate director", "value": "associate director"}, {"text": "Deputy", "value": "deputy"}, {"text": "Engineers", "value": "engineers"}, {"text": "Head", "value": "head"}, {"text": "Infrastructure", "value": "infrastructure"}, {"text": "Lab", "value": "lab"}, {"text": "Network engineer", "value": "network engineer"}, {"text": "Presales consultant", "value": "presales consultant"}, {"text": "Public sector", "value": "public sector"}, {"text": "Senior analyst", "value": "senior analyst"}, {"text": "Senior consultant", "value": "senior consultant"}, {"text": "Senior director", "value": "senior director"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Software architect", "value": "software architect"}, {"text": "Solution consultant", "value": "solution consultant"}, {"text": "System architect", "value": "system architect"}, {"text": "System engineer", "value": "system engineer"}, {"text": "Systems analyst", "value": "systems analyst"}, {"text": "Systems architect", "value": "systems architect"}, {"text": "Technical trainer", "value": "technical trainer"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Accounting", "value": "/business/naics2007/5412"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Management", "value": "/business/naics2007/55"}, {"text": "Real Estate", "value": "/business/naics2007/53"}, {"text": "Wholesale", "value": "/business/naics2007/42"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Amazon", "value": "/m/0mgkg"}, {"text": "Microsoft", "value": "/m/04sv4"}, {"text": "EPAM Systems", "value": "/m/0dlnrc"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "IBM", "value": "/m/03sc8"}, {"text": "Salesforce", "value": "/m/07btr5"}, {"text": "EY", "value": "/m/0g9jc"}, {"text": "Publicis Sapient", "value": "/m/02myjp"}, {"text": "Randstad", "value": "/m/08pt1z"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Alibaba Group Holding Limited", "value": "/m/07s6ctl"}, {"text": "Avanade", "value": "/m/094456"}, {"text": "Capgemini", "value": "/m/03vlk0"}, {"text": "Comtel Solutions Pte Ltd", "value": "/g/11dxpztgnb"}, {"text": "DELL", "value": "/g/11c54ch2jm"}, {"text": "Ericsson", "value": "/m/02kyh"}, {"text": "HTZ Resources", "value": "/g/11h21p9b4d"}, {"text": "Infinite Computer Solutions Pte Ltd", "value": "/g/11g9mj72yz"}, {"text": "Michael Page", "value": "/m/04cxldw"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "Orange Business Services", "value": "/m/08zvyz"}, {"text": "Recruitment Hub Asia Pte Ltd", "value": "/g/11dxpww_0f"}, {"text": "TEKsystems (Allegis Group Singapore Pte Ltd)", "value": "/g/11b6g4bkv0"}, {"text": "Talent Trader Group Pte Ltd", "value": "/g/11dxpmlc5b"}, {"text": "Tata Consultancy Services", "value": "/m/01psx8"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "VMware", "value": "/m/01t9k5"}, {"text": "Verizon", "value": "/m/07_dn"}, {"text": "A-Speed Infotech Pte Ltd", "value": "/g/11g9mxswl4"}, {"text": "ABeam Consulting", "value": "/g/11bc6whr_f"}, {"text": "Amazon Web Services (AWS)", "value": "/g/11dxprr2xv"}, {"text": "Amazon Web Services Singapore", "value": "/m/0rznzt1"}, {"text": "Aon", "value": "/m/0z7n"}, {"text": "Avaya", "value": "/m/01sqlk"}, {"text": "Azendian Solutions Pte Ltd", "value": "/g/11dxpvcjj2"}, {"text": "Big Cloud", "value": "/g/11c743lwsr"}]}]}