{"search_metadata": {"id": "60827978033e946023b583ac", "status": "Success", "json_endpoint": "https://serpapi.com/searches/ecc1f579c634afaf/60827978033e946023b583ac.json", "created_at": "2021-04-23 07:38:32 UTC", "processed_at": "2021-04-23 07:38:32 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28data+scientist%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=50", "raw_html_file": "https://serpapi.com/searches/ecc1f579c634afaf/60827978033e946023b583ac.html", "total_time_taken": 6.94}, "search_parameters": {"q": "(data scientist) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "50"}, "jobs_results": [{"title": "Head of Data Science and Analytics - Leading Financial Services Company", "company_name": "NLS", "location": "Singapore", "via": "via Laimoon.com", "description": "About the Company Culture:\n• Multicultural, digitally savvy with a focus on Agile\n\nResponsibilities:\n• Responsible for setting enterprise-wide AI strategy, roadmap, process and tools to achieve AI Everywhere along customer journey and insurance value chain\n• Drive the implementation of smart insurance strategic across 10 markets to achieve incremental APE, increase STU and STP, and improve customer experience and distribution productivity.\n• Build Group Office high performance Data Science & Analytics team.\n• Provide thought leadership, subject matter expert's coach to country head of data or analytics.\n• Enable country data science team by strategy design, best practice sharing, necessary training and coach.\n• Requirements:\n• Master or PhD in Statistics, Maths, MBA, or equivalent trade-off in related professional work experience.\n• ~8+ years strong experiences with Customer Analytics, Machine Learning, Data Mining, and Business Intelligence program development and implementation.\n•... ~5 years team management experience.\n• Familiar SAS, SPSS, R, Python, Spark, pylearn2, SQL and MLOps in Azure\n• Excellent communication skills and ability to work closely with business leaders to align with strategic goals.\nTechnology", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJIZWFkIG9mIERhdGEgU2NpZW5jZSBhbmQgQW5hbHl0aWNzIC0gTGVhZGluZyBGaW5hbmNpYWwgU2VydmljZXMgQ29tcGFueSIsImNvbXBhbnlfbmFtZSI6Ik5MUyIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiYlBmX2xMbG9Xcm91S0plaUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMYWltb29uLmNvbSIsImxpbmsiOiJodHRwczovL2pvYnMubGFpbW9vbi5jb20vam9icy9leHRlcm5hbHZpZXcvMjU5ODU4ODM/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Scientist Histology / Histopathology", "company_name": "Covance by Labcorp", "location": "Singapore (+1 other)", "via": "via Jobilize", "description": "Job Overview:\n\n♦ Performs complex troubleshooting and assists in leading initiatives to solve challenging scientific problems with assays or instrumentation.\n♦ Applies and interprets scientific theories, concepts, techniques and regulatory requirements in clinical studies and accepts leadership role in developing scientific approaches.\n♦ Provides consultation to scientific and operational staff on technical issues.\n♦ Responds to unscheduled deadlines, client needs, crises, etc. without neglecting other duties.\n♦ Assists with regular monitoring and evaluation of clinical assays to ensure effective scientific performance.\n♦ May provide technical training for operational staff.\n♦ Provides technical/scientific consultation to departments outside the lab (i.e., Project Management) as requested.\n♦ Contributes to long-term planning and technical policies of the department.\n♦ Assists in managing scientific vendor relationships to troubleshoot issues and improve capabilities.\n♦ Participates in... client visits.\n♦ Regularly reads literature related to scientific area of expertise to remain current in knowledge.\n♦ Presentations to clients and professional groups.\n♦ Attend meetings, conferences, symposia, and seminars to promote CLS’s capabilities within dedicated scientific area.\nEducation/Qualifications:\n\nPh.D. in scientific area of expertise.\nPreferred:\nBoard certification in scientific area of expertise.\nExperience:\n\n♦ 1-2 years post-doctoral experience relevant to cancer research based on tissue samples. Or 1 ~ 2 years work experience in research in the department of anatomic pathology. Additional relevant experience may be substituted for education requirements above.\n♦ Highly skilled in conducting research, data interpretation, and writing reports.\n♦ Proven track record of method development in molecular histology (immunohistochemistry and In Situ hybridiation)\n♦ Experience performing scientific presentations and preparing scientific publications.\n♦ Knowledge of clinical laboratory automation, system software, Microsoft applications and laboratory statistics.\n♦ Effective communication skills with technical staff, business development staff, peers and clients in both English and Chinese.\n♦ Attention to detail and interpretation of scientific data.\n♦ Demonstrated problem prevention, detection and resolution", "extensions": ["4 days ago", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTY2llbnRpc3QgSGlzdG9sb2d5IC8gSGlzdG9wYXRob2xvZ3kiLCJjb21wYW55X25hbWUiOiJDb3ZhbmNlIGJ5IExhYmNvcnAiLCJjb21wYW55X21pZCI6Ii9tLzAzbGw1OSIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjNEbE5pOEdrWHpkYTRkZjBBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2UUJDcmNCUVU1VlgwNXhWRTFtTFc0MmRtNWlTamR5WVUxalZsOVNTekZVTFVkYVNHRnpWM0U1VWxGMk5VOVJNVVpGUVUxemRVMHpTamRzTFUxQk9FSjVXSEoyUTJ3NVMxbHhUbEUwVG1KaVRFZE5OMVpOUVV4eGRDMVNVMDFqZDJaSWNqTlJNME56VG1sM1RYbHNTMnBOUzFrNGVESk9TVFpTTW1sbFkyeEJMVGhOYmpOaVZtMXJSbVp6U1RSR1NUSlZSakowV0RSc2VUQkhYMnBOU0c5T05WUkVjamN4U1VvMU1EQm1VRVpTVm5jd1FURlhVRmRmVFZGbkVoUm1NMjFEV1VsVmQydHljVEZDY2pkSGJXTm5UQm9pUVU5TldWSjNRME10WW1aRWFtczJlRmgzVEVsc1MyRkljSEo1UzA1WFh6UndadyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzExIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYmlsaXplIiwibGluayI6Imh0dHBzOi8vd3d3LmpvYmlsaXplLmNvbS9hbXAvam9iL3NjaWVudGlzdC1oaXN0b2xvZ3ktaGlzdG9wYXRob2xvZ3ktc2luZ2Fwb3JlLWNvdmFuY2UtYnktbGFiY29ycC1oaXJpbmc/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Senior/ Forensic Scientist, DNA Profiling Laboratory", "company_name": "Health Sciences Authority", "location": "Singapore (+1 other)", "via": "via Neuvoo", "description": "At the Health Sciences Authority (HSA), we recognise the enormous challenge posed today by the biomedical sciences and the blurring of boundaries between healthcare products resulting from increasing convergence in the application of medical technology. It is right here in HSA, where we are uniquely equipped to meet this challenge. A statutory board formed on 1 April 2001, we play a vital role in supporting healthcare services and regulation, serving the administration of justice and enhancing safety in our community. We are responsible for the quality, safety and efficacy of medicines, medical devices, blood and its products and all health-related products available in Singapore. We provide a comprehensive regulatory service for the evaluation and marketing approval of all therapeutic products. We also provide scientific, investigative and analytical support for vital governmental functions such as forensic expertise for the courts, drug and criminal investigations and the regulation... of food safety and industrial and environmental health.\n\nJob Description\n• Conduct and supervise DNA analysis of crime samples.\n• Interpretation of forensic DNA results.\n• Preparation of reports and provision of expert Court testimony.\n• Conduct statistical analysis and development of new forensic DNA technologies.\n• Assist the Laboratory Director in general laboratory administrative matters and technical staff training.\n\nJob Requirements\n• Minimum Bachelor’s degree in Life Sciences, with coursework modules in Mendelian Genetics, Biochemistry, and Molecular Biology, or related fields.\n• Higher degree (Master/PhD) in Life Sciences preferred.\n• Sound life sciences knowledge with proven expertise in molecular biology/genetics as evidenced by publications in international peer-reviewed journals.\n• Excellent verbal and written communication skills.\n• Some experience with statistical software (e.g. R, SPSS, SAS) in life sciences setting will be preferable.\n• Familiarity with barcoding metagenomics/WGC on MPS/Nanopore platforms will be an advantage.\n• Please note that only shortlisted applicants will be notified", "extensions": ["9 days ago", "Full–time"], "detected_extensions": {"posted_at": "9 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IvIEZvcmVuc2ljIFNjaWVudGlzdCwgRE5BIFByb2ZpbGluZyBMYWJvcmF0b3J5IiwiY29tcGFueV9uYW1lIjoiSGVhbHRoIFNjaWVuY2VzIEF1dGhvcml0eSIsImNvbXBhbnlfbWlkIjoiL20vMGg3ZmhoIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiRVp1d2RyQ2otWUlWcV85VUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRW9rQ0Nzd0JRVTVWWDA1eFVVd3dlbXRPUkhoVVNWODVXWG81V0dsamFtZDVlblJrY0U5d2IzWkJiVEJVZVdjNFJVcHNXRXN5U2pWSVoyVmpkVzgyTjJoMlYyMUtTMEZ1TTNJMVdFUXlVekI2WkZrME4yVnlXRFpET0hwd1VUUm1aV3hIVmpCb1Vra3lhRlJNYzNGeVRuVlNhR3QyTTNCd1pGUnlNamxSWVdSWlYybEROa3RXZFRSWmVGWlNWVXRUVEVoV2JURllTakkzWDJobWJXTk5TMTkyT1Y5b1VGSTRiVEpxTUhoWVJWTjZYMGhFWkhGVWFXNHliV2Q2VWxSNExWVXhlRmhJVDI5c2JHVklhazFZYldkdkVoUm1NMjFEV1VsVmQydHljVEZDY2pkSGJXTm5UQm9pUVU5TldWSjNRWE5ETkcweVZXeHJSREJTWWt0R1ZqZEJiSFF0WTNGVVdVZzVadyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzE4IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE5ldXZvbyIsImxpbmsiOiJodHRwczovL3NnLm5ldXZvby5jb20vdmlldy8/aWQ9NjVlNDdkM2FkODE3XHUwMDI2dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "VP, Data Scientist, Personal Financial Services", "company_name": "United Overseas Bank", "location": "Singapore", "via": "via Laimoon.com", "description": "Posting Date: 14-Apr-2021\n\nLocation: SG\n\nCompany: United Overseas Bank Limited\n\nAbout UOB\nUnited Overseas Bank Limited (UOB) is a leading bank in Asia with a global network of more than 500 branches and offices in 19 countries and territories in Asia Pacific, Europe and North America. In Asia, we operate through our head office in Singapore and banking subsidiaries in China, Indonesia, Malaysia and Thailand, as well as branches and offices.\nOur history spans more than 80 years. Over this time, we have been guided by our values - Honorable, Enterprising, United and Committed. This means we always strive to do what is right, build for the future, work as one team and pursue long-term success. It is how we work, consistently, be it towards the company, our colleagues or our customers.\n\nAbout the Department\nThe Retail function provides Personal and Business Banking customers with financial solutions tailored to their needs. We help them manage their money wisely and meet their financial... goals through an extensive range of products and services. These include deposit, insurance, secured and unsecured loans, investment and wealth advisory services.\n\nPersonal Financial Services\nWe design and provide products and services that empower our customers to enjoy greater banking convenience while they extract more value from their money. In particular, we are focused on promoting and developing healthy saving and investment practices across generations.\n\nJob Responsibilities\n• Understand business requirements and design analytical solutions to solve identified business problems\n• Develop advanced analytics workflows for exploratory analysis, feature engineering, model development, resultvalidation and insight visualization\n• Create analytical assets and capabilities to support various analytics projects\n• Collaborate with business stakeholders and analytics/platform teams to operationalize models and drivemeasurable business impact\n• Perform regular audits and improvements on models to ensure consistency and relevancy\n\nJob Requirements\n• Advanced degree in Statistics, Mathematics, Engineering, Computer Science or other related field\n• Relevant working or internship experience in banking / financial services / consulting industry\n• Familiarity with analytical frameworks and languages such as SQL, R, Python and SAS\n• Practical experience in solving complex problems using scientific methods and modelling approach usingexperimental, statistical, machine learning and visualization techniques\n• Ability to work independently and collaboratively\n• Excellent written and verbal communication skills\n• A drive to learn and master new technologies and techniques\n\nBe a part of UOB Family\nUOB is an equal opportunity employer. UOB does not discriminate on the basis of a candidate's age, race, gender, color, religion, sexual orientation, physical or mental disability, or other non-merit factors. All employment decisions at UOB are based on business needs, job requirements and qualifications. If you require any assistance or accommodations to be made for the recruitment process, please inform us when you submit your online application.\n\nApply now and make a difference.\n\nretail banking", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJWUCwgRGF0YSBTY2llbnRpc3QsIFBlcnNvbmFsIEZpbmFuY2lhbCBTZXJ2aWNlcyIsImNvbXBhbnlfbmFtZSI6IlVuaXRlZCBPdmVyc2VhcyBCYW5rIiwiY29tcGFueV9taWQiOiIvbS8wNGdqZDEiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJpaHNyNGEyelJEOF9zTkpJQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdlFCQ3JjQlFVNVZYMDV4VWtOb2NrSmFUVTh4TVRRdGRWQndPVmN5YW1wSFNWOXRVek5UU1hReU5uWlZkbXRvZG1oVVRFMDViSEEwZG1SVVlVMVNSRGRPUkV0cWMySTRNVFZpWVRaV1prMWFibEZMUjNWMFgwRk5SVGxHTldGR00yMTRlbXRQUW14d2F6ZDFaVW94Wms4MlJETldSVGRoU1RZM1kyd3lRa001WTB0elFXTkdhbUZzWVdSb1RqTnFjV1JCUnpsV1MxVmpURkF6UjI1TlkyOVdTbWhFTFMxVWQybFdUV3BJYlROaGRrVmlhWFpJZERJd1gyOXJFaFJtTTIxRFdVbFZkMnR5Y1RGQ2NqZEhiV05uVEJvaVFVOU5XVkozUWpkMFZ6WnFNMU4wYUZwT1ZrVnNXa1JhT1VKeVlrNDRPSGRoUVEiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18yNiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMYWltb29uLmNvbSIsImxpbmsiOiJodHRwczovL2pvYnMubGFpbW9vbi5jb20vam9icy9leHRlcm5hbHZpZXcvMjU5ODU4MTI/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Senior Data Engineer cum Scientist", "company_name": "Infinite Computer Solutions Pte Ltd", "location": "Singapore", "via": "via Monster", "description": "Key Responsibilities:\n• Work together with product owners and solution architects to translate and formulate business requirement into technical specifications of data platform.\n• Lead and manage a team of data engineers to implement robust, scalable, and efficient data refinery related solutions using the appropriate data engineering or big data engineering techniques and frameworks.\n• Data ETL and data analysis for structured/unstructured and streaming data.\n• Work together with AI scientists to integrate data pipeline with ML pipeline.\n• Support technical director with resource planning and budgeting for data refinery and AI projects.\nRequirements:\n• MEng/PhD with a minimum 5-7 years’ work experience in data engineering or data science field.\n• Working experience on big data frameworks & tools such as Hive, Hadoop MapReduce, Spark, Flink, Elastic Stack, Kafka and databases (Cassandra, MongoDB, and Neo4J) is preferred.\n• Demonstrated leadership to solve complicated data engineering... or data science related technical problems.\n• Familiar with Cloud Computing platforms & its ML Cloud Services, such as AWS SageMaker, Google ML Engine, and MS Azure Machine Learning Studio.\n• Excellent communication skills. Able to explain complicated technical concepts using simple and understandable language to audience who do not have strong technical background.\n\nEA License No. - 14C6941", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgRGF0YSBFbmdpbmVlciBjdW0gU2NpZW50aXN0IiwiY29tcGFueV9uYW1lIjoiSW5maW5pdGUgQ29tcHV0ZXIgU29sdXRpb25zIFB0ZSBMdGQiLCJjb21wYW55X21pZCI6Ii9nLzExZzltajcyeXoiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJsS1B1Vi1BNlNGZDduWFk3QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFcDhDQ3VJQlFVNVZYMDV4VTBGcWEwRnRXVzlaV1ZSeWN6Wk5SMnBmUjJaTk1GTmFSMFo0YUhWUmVHbElPVlo2WWt0alMySkZPR2hHVjBJMmIyNDNPRVl5UkVaNVpUTXdhRGhWYkhCb1UyczFVMVZDWTJsdVkwNXVOMkptTlZZd1RISnlhVzgxV0hORlRFaDVia2hNWTBoQlpFSlZOVGxMWnkxV1ExQkJabWRJV2tsM1R6WkxNbXBwU0ZWRWNsa3RZMDFzZGtaUlJtdHpYMWhJYzBsMFlYUmpTalJWTkhGNVR6a3hNRGRxY1V4Q09HMTJhR2xuUm10R05VMXpSR2hMTkRONGRuUkhTRWhhTnkxYU1Xa3hNbnB1WWxwSk5HcHNUMlpWYjNrNFNYQjFZamx6VjBaWWR4SVVaak50UTFsSlZYZHJjbkV4UW5JM1IyMWpaMHdhSWtGUFRWbFNkME5yTWxsWGNYVkJRMkZuYTFkVWJIQlhPREpHTlVoMGJIQXdXR2MiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18zMyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNb25zdGVyIiwibGluayI6Imh0dHBzOi8vd3d3Lm1vbnN0ZXIuY29tLnNnL2pvYi9zZW5pb3ItZGF0YS1lbmdpbmVlci1jdW0tc2NpZW50aXN0LWluZmluaXRlLWNvbXB1dGVyLXNvbHV0aW9ucy1wdGUtbHRkLXNpbmdhcG9yZS0yNzY5NzIxP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Machine Learning Engineer Intern (Recommendation)-2021", "company_name": "TikTok", "location": "Singapore", "via": "via Bayt.com", "description": "About Recommendation Team\nWith one of the fastest growing apps in the world with rich, diverse content and users, our Recommendation team is always striving to help our users discover new videos that they enjoy as well as to empower content creators through recommendation algorithms. We work cross-functionally with product teams to build exciting new features and tackle challenges that have never been solved before. In the meantime, however, we can also propose and realize our own idea in a self-driven manner. In our team, the opportunity to innovate and drive impact through algorithms is limitless. Furthermore, we care for team members' personal growth. As a new grad, you will be guided to think and work systematically. You will be intensively immersed in algorithms and business on the basis of the cutting-edge of technology in AI Infrastructure and state-of-the-art recommendation systems at our team. We are looking for talented individuals to join us - people who want to inspire... creativity and co-create the future with us. Successful candidates must be able to commit to the following internship cycle below: -\n1. Off-cycle Internship - 02 Aug to 17 Dec (20 weeks)\nPlease state your availability clearly in the comments section (Start date, End date). Responsibilities\n1. Build industry leading recommendation system; develop highly scalable classifiers and tools leveraging machine learning;\n2. Understand product objectives and machine learning techniques; improve model and recommendation strategy;\n3. Understand user behavior and apply ML algorithms to optimize content consumption and production experience;\n4. Understand content security strategy and apply ML algorithms to improve content audit process;\n5. Work with cross functional teams to grow ByteDance product in important regional markets.\n1. Undergraduate or Postgraduate with a background in Computer Science, Computer Engineering, Information Systems or a related technical discipline from a university;\n2. Solid experience with data structures or algorithms;\n3. Software development experience through hands on coding in a general purpose programming language;\n4. Experience in one or more of the following areas: machine learning, recommendation systems, data mining or other related areas;\n5. Strong communication and teamwork skills;\n6. Passion about technologies and solving challenging problems. Application deadline: 15 April 2021\n1. Applications will be reviewed on a rolling basis and we encourage you to apply early;\n2. Interview starts from February 2021", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJNYWNoaW5lIExlYXJuaW5nIEVuZ2luZWVyIEludGVybiAoUmVjb21tZW5kYXRpb24pLTIwMjEiLCJjb21wYW55X25hbWUiOiJUaWtUb2siLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IktMazZHVHF3RzVidndFUHpBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQmF5dC5jb20iLCJsaW5rIjoiaHR0cHM6Ly93d3cuYmF5dC5jb20vZW4vc2luZ2Fwb3JlL2pvYnMvbWFjaGluZS1sZWFybmluZy1lbmdpbmVlci1pbnRlcm4tcmVjb21tZW5kYXRpb24tMjAyMS01ODEwMzA0MC8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "IBOR Data Analytics", "company_name": "Standard Chartered Bank Ltd", "location": "Singapore", "via": "via Learn4Good", "description": "We are a leading international bank focused on helping people and companies prosper across Asia, Africa and the Middle East. To us, good performance is about much more than turning a profit. It's about showing how you embody our valued behaviours - do the right thing, better together and never settle - as well as our brand promise, Here for good.\n\nWe're committed to promoting equality in the workplace and creating an inclusive and flexible culture - one where everyone can realise their full potential and make a positive contribution to our organisation. This in turn helps us to provide better support to our broad client base. The Role\n\nResponsibilities Business Informed The IBOR transition is a key strategic project Bank wide, out team the - Analytic and Business Insight team, ensure the production and delivery of quality IBOR transition data for Senior management for key decision making prioritisation and risk management. As well our team delivers regulatory reporting to the PRA and... local regulators worldwide. The role in question will support the team delivery.\n\nProcesses Share Responsibility The Role holder will partly engage key stakeholders across divisions on MI requests around the IBOR transition project, and as part of our overall process will apply data cleansing strategies to enrich the source data for a better analytics and insight for the business and client outreach. As part of the Data quality Assessment and Remediation process Identify critical data quality issues that would impact downstream reporting by Perform data/ database reconciliations and committee presentations generation, provide in-depth analysis, and succinct explanations of results obtained to key business stakeholders Collaborate and provide day-to-day support to all relevant business units, Group Finance, Treasury, Operation Engage stakeholders to raise the bar on quality delivery, collaboration and innovation.\n\nRisk Management Informed Keep track of emerging regulatory expectations in terms of IBOR transition and evaluate the present state of infrastructure and processes of the organization against this. Data Strategy, Architecture and Transformation to derive the data strategy roadmap Defines data requirements and performs data inventory analysis to qualify risk issues in data sources and attributes Training and communications efforts by the IBOR Central Team.\n\nGovernance Share responsibility Coordinate with Business and Functional leads and update the programme central team on any key issues and Risk Ensure information is correctly communicated and where necessary issue are escalated to management in a timely manner Share ideas and best practice information with colleagues. Thinks beyond current boundaries of the role and contributes ideas. Regulatory & Business Conduct Display exemplary conduct and live by the Groups Values and Code of Conduct.\n\nTake personal responsibility for embedding the highest standards of ethics, including regulatory and business conduct, across Standard Chartered Bank. This includes understanding and ensuring compliance with, in letter and spirit, all applicable laws, regulations, guidelines and the Group Code of Conduct. Lead to achieve the outcomes set out in the Banks Conduct Principles Fair Outcomes for Clients;\n\nEffective Financial Markets;\n\nFinancial Crime Compliance;\n\nThe Right Environment. Effectively and collaboratively identify, escalate, mitigate and resolve risk, conduct and compliance matters. Key Stakeholders GB/CB/Lending/CF/Loan Syndication/Agency Business/FM Stream Leads Group and Country Business Heads, COOs and their representatives IBOR Project Managers supporting the workstreams Functions stakeholders Legal, Compliance, Operational Risk. Finance, IMO, GLS etc The broader IBOR Programme team. Other\n\nResponsibilities Leverage the opportunity provided by Corporate Social Responsibility to enhance the Groups internal and external reputation and indirectly influence the bottom line. Promote the Groups brand and Here for good with clients and regulators. Perform other responsibilities assigned under Group, Country, Business or Functional policies and procedures. Maintain effective communication with key stakeholders and staff. Our Ideal Candidate The candidate must be a self-motivated, proactive and resourceful with an excellent network with ability to work in a fast-paced environment against an uncertain regulatory back-drop.\n\nAdditional qualifications Data analytics, Interested Rate Products. Banking domain involving one or more of the following Product Control, Market Risk, Middle Office, Data Good knowledge of Rate products Experience in implementation of projects ideally through multi-country operations teams Experience as the key liaison with stakeholders to define and execute processes BAU and Change Experience in software design and development CFA, FRM or CQF certification will be consider a plus stakeholder management skills, able to converse in appropriate levels of detail with Business Heads, COOs/CIOs, Frontline, Middle Office/Operations Risk, Legal & Compliance (L&C), etc.\n\nDesirable Experience in any of the following SAS, SQL, Python, R, VBA, Tableau and MSTR. R Exp & Python Exp is Preferred Bank Exp in Risk/Product Control Preferred Min 3 yrs overall exp preferred. Intrinsic traits Attention to detail Curiosity High degree of responsibility Self-motivated, and works well in teams Very structured and very disciplined Good written and verbal communication skills\n\nAble to challenge/ question Apply now to join the Bank for those with big career ambitions. To view information on our benefits including our flexible working please visit our career pages. We welcome conversations on flexible working", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJJQk9SIERhdGEgQW5hbHl0aWNzIiwiY29tcGFueV9uYW1lIjoiU3RhbmRhcmQgQ2hhcnRlcmVkIEJhbmsgTHRkIiwiY29tcGFueV9taWQiOiIvbS8wMmhzemsiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJEcXVvZ0VabkNyMkhZQW9aQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFb2tDQ3N3QlFVNVZYMDV4VVRadlkyaGphMFY2ZEZkS1pFVnRiRUl0TWpGWGNuRTFaMkpZVDI5NVF6VmxVM0pVTlMxT09YWnpkMWxsV0dWM1pWTkVURFpGVERWd05rWTFSR1U0VVhFdFprZzNWR2szWWtzeGJYa3dhV2xSYkRFdE5XSktiVloyY25aUWJ6UXhiVTloY1hweE9Vb3hSRGR3WHpoNlEwNUphWEZLVW05RlNGcGZjbXh0YTJwV1YxWk1OemRzTnpCeWVqbFpkMVJhVG5NdFExbEVlVkYzVTFoV2FqSnhRVFJuZWpsalFWWlJlbUprZG1OWWNEUXdZbkEwU25SUk5FVXhVV1ozT0RRNGJUaExkbUZvRWhSbU0yMURXVWxWZDJ0eWNURkNjamRIYldOblRCb2lRVTlOV1ZKM1EzVm9iSEpaZGxwUlpGUjJRbEpPYW5WMllVSnlXbWN5WTI0MFFRIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNDQiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGVhcm40R29vZCIsImxpbmsiOiJodHRwczovL3d3dy5sZWFybjRnb29kLmNvbS9qb2JzL3NpbmdhcG9yZS9iYW5raW5nLzI3MTI4NTAwNS9lLz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior Machine Learning Engineer (KL / SG / Shanghai)", "company_name": "Air Liquide", "location": "Singapore", "via": "via LinkedIn", "description": "We are looking for a Senior Machine Learning Engineer who will support our business with insights gained from analyzing company data. The ideal candidate is adept at using large data sets to find opportunities for business optimization and using models to test the effectiveness of different courses of action. They must have strong experience using a variety of data mining/data analysis methods, using a variety of data tools, building and implementing models, using/creating algorithms and creating/running simulations. They must have a proven ability to drive business results with their data-based insights. They must be comfortable working with a wide range of stakeholders and functional teams. The right candidate will have a passion for discovering solutions hidden in large data sets and working with stakeholders to improve business outcomes\n\nMissions and Responsibilities\n• To lead AI /Machine learning projects for the APAC digital team.\n• Designing and developing machine learning and... deep learning systems\n• Running machine learning tests and experiments Implementing appropriate ML algorithms\n• Study and transform data science prototypes\n• Able to support chatbot deployment in countries with software engineer experiences\n• Design machine learning systems\n• Research and implement appropriate ML algorithms and tools\n• Develop machine learning applications according to requirements\n• Select appropriate datasets and data representation methods\n• Run machine learning tests and experiments\n• Perform statistical analysis and fine-tuning using test results\n• Train and retrain systems when necessary\n• Extend existing ML libraries and frameworks\n• Keep abreast of developments in the field\n\nCompetencies and Profile\n• MSc or BSc graduate in Statistics, Mathematics or Computer Science\n• 5 - 7 years of relevant work experience in data science field\n• Proven experience as a Machine Learning Engineer or similar role\n• Understanding of data structures, data modeling and software architecture,Experience using statistical computer languages (R, Python, SLQ, etc.) to manipulate data and draw insights from large data sets.\n• Deep knowledge of math, probability, statistics and algorithms\n• Knowledge of a variety of machine learning techniques (clustering, decision tree learning, artificial neural networks, etc.) ,including Linear Regression, Decision Trees, Random Forest, Deep Learning, etc.\n• Familiarity with machine learning frameworks (like Keras or PyTorch) and libraries (like scikit-learn)\n• Excellent written and verbal communication skills for coordinating across teams.\n• A drive to learn and master new technologies and techniques.\n• Experience visualizing/presenting data for stakeholders\n• Ability to work as part of a distributed team.\n• Ability to utilize and lead interns on projects.\n• Specific Training or Certification; Data Science, R or Python", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgTWFjaGluZSBMZWFybmluZyBFbmdpbmVlciAoS0wgLyBTRyAvIFNoYW5naGFpKSIsImNvbXBhbnlfbmFtZSI6IkFpciBMaXF1aWRlIiwiY29tcGFueV9taWQiOiIvZy8xMWR4OWdrZGhxIiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoicWxsZ282azN0LTVEY3pSNEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXQ4QkNxSUJRVTVWWDA1eFZGcEpaWFZQWkdaYU9GQmhUVWhxUkUxRk5WTXRSbGd4ZERSNlpEaG1hREU1U0VOdk5YaHphMHRDTjFKelRFVklOMHRIV0ROWk1WRllhMHBWZDBGU1lVUmtZMFEzVjFsTmNteEhaR2sxVUVRNFpFOTJPV2RSVEVaT2FrTnNiMUZXZUd0blVuRnlOMVJ1Y2kxYVJWRXhielZvVmpWSFYxVkVTSEIzYlhscWNYQm9PVU40VWtSbFFpMXNlV1JZY0ZFMGJrOTNWbWxGYlcxMGVtNUJFaFJtTTIxRFdVbFZkMnR5Y1RGQ2NqZEhiV05uVEJvaVFVOU5XVkozUVVWbk1WbEhMVEJUWVVWWFJVbGpaRGN0Vmt0Zk5rRjRRWGRDZHciLCJmY3YiOiIzIiwiZmNfaWQiOiJmY181MSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL3NnLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvc2VuaW9yLW1hY2hpbmUtbGVhcm5pbmctZW5naW5lZXIta2wtc2ctc2hhbmdoYWktYXQtYWlyLWxpcXVpZGUtMjMxOTMxMjM0OD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Operations Engineer (Data Science and AI Division) SG united", "company_name": "None", "location": "Singapore", "via": "via Singapore", "description": "What to Expect: - Manage day-to-day operational activities in the GDC as well as GCC, to ensure optimum system performance and work out databased strategy for continuous improvement. - Work with the data engineering team, operations manager and project manager to implement improvement plans. - Monitor and ensure that ATFM and Service Desk operations are functional, assist in L1 and L2 activities to users where necessary. - Administer, monitor and maintain Linux & Windows servers, storages, NAS servers, Big data clusters. - Set up, install, configure and deploy new servers, and perform hardening based on established guidelines and best practices. - Perform data and server backup, and system security operations (e.g. user authorization, firewalls). - Liaise with vendors and engineers for installations/replacements, upgrades and configuration of hardware, software and patches based on establish guidelines and best practices. - Manage application/platform and security incidents, work with... various internal teams and vendors to resolve issues on a timely basis to meet SLA, escalating to higher management if necessary. - Perform hardware and software assets and inventory management as well as tracking. - Ensure that operation processes are documented and complies with audit requirements. As an Operations Engineer, you need to bring to the team: - Degree or Diploma in Computer Science/Engineering, Information Technology, or in relevant disciplines. - At least 3 years of working experience in IT operations. In-depth hands-on experience on: - Familiar with change management and incident management workflows, using ITSM tools to manage workflows. - Familiarity with security and access control measures to control privileged access to test and production environment. - Familiarity with Privileged Access Management (PAM) tools e.g. CyberArk will be preferred. - Experience in networking technologies such as WAN, LAN, Network Security, Firewall rules, Load Balancers, VPNs and DNS - Knowledge of container technologies such as Docker, LXC - Knowledge of disaster recovery, system backup and restore - Experience in one or more virtualization technologies (KVM, Xen, VMware, Hyper-V) - Knowledge in Linux and Windows server hardening - Security knowledge of Linux (Ubuntu & Red Hat), Apache, Nginx, Java, IIS and Windows - Experienced with management cloud infrastructure and services / certification with GPC, GCC (i.e. AWS, Azure, Google Cloud) or equivalent cloud platforms will be preferred. What to Expect: - Manage day-to-day operational activities in the GDC as well as GCC, to ensure optimum system performance and work out databased strategy for continuous improvement. - Work with the Skills: Big Data, Data, Incident Management, Linux, Operating Systems, Software Installation, Technical Support, Windows, Service Oriented, Windows Servers, system performance Experience: 2.00-5.00 Years", "extensions": ["11 days ago", "Full–time"], "detected_extensions": {"posted_at": "11 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJPcGVyYXRpb25zIEVuZ2luZWVyIChEYXRhIFNjaWVuY2UgYW5kIEFJIERpdmlzaW9uKSBTRyB1bml0ZWQiLCJjb21wYW55X25hbWUiOiJOb25lIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiIxSndYb1BmdnZ2YnhEUmxIQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFNpbmdhcG9yZSIsImxpbmsiOiJodHRwczovL3NnLmZpZGFudG8uY29tL2pvYnMvam9iLW9wZW5pbmcvYWNjb3VudGFudHMvb3BlcmF0aW9ucy1lbmdpbmVlci1kYXRhLXNjaWVuY2UtYW5kLWFpLWRpdmlzaW9uLXNnLXVuaXRlZC0yNzIwMjc2NjY/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Data Scientist - KYC", "company_name": "Shopee", "location": "Singapore (+1 other)", "via": "via Karkidi", "description": "The Data Science KYC team is committed to build fully fledged inhouse e-KYC (Know-Your-Customer) solutions for marketplace and financial products in Shopee and SeaMoney.\n\nJob Description:\n• Design, develop and deploy computer vision models to facilitate the KYC process by providing capabilities in\n• Optical Character Recognition (OCR) for ID cards and other documents\n• Face recognition\n• Liveness Check\n• Forensics-level photo quality and authenticity assessment\n• Design and develop systems to manage eKYC models’ life cycle from the following aspects:\n• Data collection and labelling\n• High performance RESTful APIs for serving eKYC models\n• High performance and secure on-device inference engine\n• Performance tracking and dashboard\n• Work cross-functionally with business, product, operation, and engineering teams during the whole life-cycle of eKYC products, from problem formulation, to solution design, implementation, maintenance and improvement.\n\nRequirements:\n• Minimum Bachelor’s... degree from computer science or related disciplines.\n• At least one of the following\n• At least one year of experience in prototyping and/or productionizing eKYC models such as OCR, face recognition, selfie anti-spoofing and liveness check, etc.\n• At least one year of experience in developing machine learning related web backend services, systems, or platforms\n• Proficient in writing production-level codes in Python, C++ or Java\n• Familiar with modern deep learning framework like TensorFlow, PyTorch and MXNet\n• Experience in building high performance web backend services is a plus\n• Experience in model compression, quantization and protection for on-device inference of machine learning models is a plus\n• Experience in native Android/iOS App development is a plus\n• Self-motivated, independent and fast learner. Teamplayer who loves to share with and learn from others", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEYXRhIFNjaWVudGlzdCAtIEtZQyIsImNvbXBhbnlfbmFtZSI6IlNob3BlZSIsImNvbXBhbnlfbWlkIjoiL2cvMTFnaDNmazM0ciIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IkNyUU9nQUlOcEVCeGtHRmRBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV0OEJDcUlCUVU1VlgwNXhVVzVQWjNOa2FsWlVRVWR6Y0ZsT1NqWnNTMGRVYjJObGMzUnRXWEV4UVV0bFl6Tk1kbXR6Tm1KYU9HdFhTMWh6VkdaWWFqQk5ZV3RRU2paMlltMTJlVWRQUVc0NFNqTkxjM053ZDFOSVVFZDNlaTFhTXpnMFEwVnBlSGxTVVhCT1VqWXpibkpRV1dselYwUmpSMHBuTmtsMFRVcHdkMjloVmpsMVZUQnJOazg0WDBOV1RFNXBZMDVVWmpCaFNrMURZbU5mYzNOTFUwazJPV0ozRWhSbU0yMURXVWxWZDJ0eWNURkNjamRIYldOblRCb2lRVTlOV1ZKM1JHWlNabTFrWlVoYVgyTk5kWFkxZUc5SmJXVmhSR2RpV0ZGdVp3IiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNjMiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gS2Fya2lkaSIsImxpbmsiOiJodHRwczovL3d3dy5rYXJraWRpLmNvbS9qb2ItZGV0YWlscy8xMTUzP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}], "chips": [{"type": "Title", "param": "job_family_1", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Data scientist", "value": "data scientist"}, {"text": "Learning engineer", "value": "learning engineer"}, {"text": "Research associate", "value": "research associate"}, {"text": "Data science", "value": "data science"}, {"text": "Data engineer", "value": "data engineer"}, {"text": "Scientist", "value": "scientist"}, {"text": "Trainer", "value": "trainer"}, {"text": "Associate", "value": "associate"}, {"text": "Data analyst", "value": "data analyst"}, {"text": "Engineer", "value": "engineer"}, {"text": "Officer", "value": "officer"}, {"text": "Project manager", "value": "project manager"}, {"text": "Project officer", "value": "project officer"}, {"text": "Senior", "value": "senior"}, {"text": "Audit", "value": "audit"}, {"text": "Consultant", "value": "consultant"}, {"text": "Consulting", "value": "consulting"}, {"text": "Customer", "value": "customer"}, {"text": "Deputy director", "value": "deputy director"}, {"text": "Lecturer", "value": "lecturer"}, {"text": "Operations engineer", "value": "operations engineer"}, {"text": "Owner", "value": "owner"}, {"text": "Research engineer", "value": "research engineer"}, {"text": "Research scientist", "value": "research scientist"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Specialist", "value": "specialist"}, {"text": "Technical architect", "value": "technical architect"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Internship", "value": "INTERN"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Mining", "value": "/business/naics2007/21"}, {"text": "Research", "value": "/business/naics2007/5417"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Staffing", "value": "/business/naics2007/5613"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "Nanyang Technological University", "value": "/m/0l49k"}, {"text": "Shopee", "value": "/g/11gh3fk34r"}, {"text": "DBS Bank Ltd", "value": "/m/01q7n5"}, {"text": "Michael Page", "value": "/m/04cxldw"}, {"text": "Micron", "value": "/m/02gdqy"}, {"text": "Air Liquide", "value": "/g/11dx9gkdhq"}, {"text": "Apple", "value": "/m/0k8z"}, {"text": "ByteDance", "value": "/g/11ghnfr0sv"}, {"text": "CTES Consulting Pte Ltd", "value": "/g/11jrn4m1xc"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "SEPPIC", "value": "/m/0g558ww"}, {"text": "Standard Chartered", "value": "/m/02hszk"}, {"text": "United Overseas Bank", "value": "/m/04gjd1"}, {"text": "AIR LIQUIDE INDUSTRIAL SERVICES PTE LTD", "value": "/g/11hg55y1rb"}, {"text": "Acronis", "value": "/m/04pjlt"}, {"text": "BIGTAPP PTE. LTD.", "value": "/g/11dxpsg5nn"}, {"text": "Burpple", "value": "/g/11dxps5yv5"}, {"text": "Covance by Labcorp", "value": "/m/03ll59"}, {"text": "DHL", "value": "/m/021086"}, {"text": "DUN & BRADSTREET (SINGAPORE) PTE. LTD.", "value": "/g/11g9mpp2ph"}, {"text": "Dathena Science", "value": "/g/11dxprdn6y"}, {"text": "EasyMile", "value": "/g/11bwh58jhs"}, {"text": "Engine Biosciences Pte. Ltd.", "value": "/g/11gxm8pr96"}, {"text": "Experis Singapore", "value": "/g/11dxpnwm3s"}, {"text": "FieldBox.ai", "value": "/g/1ptyw89vr"}, {"text": "GIC Private Limited", "value": "/g/11mpj15pxw"}, {"text": "Government Technology Agency", "value": "/g/11gh0528nq"}, {"text": "Health Sciences Authority", "value": "/m/0h7fhh"}, {"text": "Hewlett Packard Enterprise (HPE)", "value": "/g/11b804x9ty"}, {"text": "Infineon Technologies", "value": "/m/02jzkj"}, {"text": "Infinite Computer Solutions Pte Ltd", "value": "/g/11g9mj72yz"}, {"text": "Institute Of Technical Education (ITE)", "value": "/m/05_02p"}, {"text": "KPMG Singapore", "value": "/g/11dxpsb9nr"}, {"text": "Lazada", "value": "/g/1q5bfkdqp"}, {"text": "Ministry of Defence Singapore", "value": "/m/0566dt"}, {"text": "Ngee Ann Polytechnic", "value": "/m/05451y"}, {"text": "Republic Polytechnic", "value": "/m/06jgzw"}]}]}