{"search_metadata": {"id": "60827eb9a5ad6d91f0956528", "status": "Success", "json_endpoint": "https://serpapi.com/searches/2e0f34ff2edb043a/60827eb9a5ad6d91f0956528.json", "created_at": "2021-04-23 08:00:57 UTC", "processed_at": "2021-04-23 08:00:57 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28solution+architect%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=220", "raw_html_file": "https://serpapi.com/searches/2e0f34ff2edb043a/60827eb9a5ad6d91f0956528.html", "total_time_taken": 2.15}, "search_parameters": {"q": "(solution architect) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "220"}, "jobs_results": [{"title": "Security Cloud Solution Architect", "company_name": "Microsoft", "location": "Singapore", "via": "via Glassdoor", "description": "Microsoft is on a mission to empower every person and every organization on the planet to achieve more, and security, data protection, and privacy are vital pillars in our mission. Our culture is centered on embracing a growth mindset, a theme of inspiring excellence, and encouraging teams and leaders to bring their best each day. In doing so, we create life-changing innovations that impact billions of lives around the world. You can help us to achieve our mission.\n\nMicrosoft aspires to help our customers achieve their secure digital transformation, leveraging the power of Microsoft Cloud security solutions and support offerings. Azure is the most comprehensive, innovative, flexible, and Secure cloud platform today. Microsoft is hiring security professionals to drive customer cloud security adoption for customers around the world.\n\nMicrosoft continues to invest over $1B per year in cybersecurity and research, to provide its customers with solutions that integrate across the ecosystem... by connecting all of your identities, endpoints, apps, emails, docs and clouds to help you close critical gaps in coverage, reduce risk, and save costs with a streamlined security portfolio.\n\nResponsibilities\n\nResponsibilities include:\n• Land an end-to-end value prop for Security (e.g.. Zero Trust) which spans the breadth of Microsoft Security offerings\n• Empower customers in their Azure Security adoption journey, helping them to define a Secure strategy, Architecture, and implementation of necessary security controls aligned with Azure Security Services including Threat Protection, Monitoring, Cloud Security, and Identity and Access Management\n• Perform hands-on activities, supporting the customer in evaluating native security solutions in areas such as Azure Defender, Network Security, Sentinel, and AAD, among others.\n• Accelerate Business Value of overall Azure adoption by improving security posture\n• Apply technical knowledge to architect security solutions that meet business, IT,\n• Regulation and Compliance needs, infusing key security technologies where appropriate.\n• Ensure that the solution exhibits “Secure by Design” or “Well-Architected” framework, such as high-performance levels, security, scalability, maintainability, appropriate reusability, and reliability upon deployment.\n• Be a Voice of Customer to share insights and best practices, connect with Global Security teams at Microsoft, Engineering and Product teams to remove blockers and influence the roadmap.\n• Trouble shoot technical issues to prove value of implementation of Azure technologies\n• Collaborate with other Cloud Solution Architects and MS stakeholders in developing complex end-to-end Enterprise solutions on the Microsoft Azure platform.\n• Orchestrate technical people and resources that may be required to deliver business outcomes.\n\nQualifications\n\nKey Skills\n• Relationship Building. Proven track record of building deep technical relationships with senior security executives in large or highly strategic accounts. Experience in managing various stakeholder relationships to get consensus on security solutions/projects.\n• Problem Solving. Ability to solve customer security, compliance, and data protection problems through cloud technologies\n• Collaboration and Communication. Acknowledged for driving decisions collaboratively, resolving conflicts and ensuring follow through with exceptional verbal and written communication skills. Presentation skills with a high degree of comfort with both large and small audiences (Senior Executives, Security teams, Security admins, DevSecOps, Cloud Security architect teams).\n• Customer Focus. Customer obsessed leader with an “if I don’t know how to get it done,\nI’ll find someone who does” approach to solving customer challenges\n• Value Realization. Ability to understand customer business objectives and outcomes and ability to quickly leverage tech solutions to accomplish those outcomes\n• Trusted Technical Advisor. Ability to build strong relationships with senior security stakeholders and quickly build credibility and be viewed as a trusted advisor\n\nTechnical\n• Enterprise-scale technical experience with Azure Security\n• The technical aptitude and experience to learn new cloud security technologies and understand relevant cloud security market trends.\n• Competitive Landscape: Knowledge of cloud security platforms.\n• Partners: Understanding of partner ecosystems and the ability to leverage partner\nsolutions to solve customer needs.\n• Breadth of technical security experience and knowledge, with depth / Subject Matter Expertise in two or more of the following Azure Security Solutions\n• Cloud workload protection\n• Threat protection\n• WAF (Web Application Firewall)\n• Stateful firewall. (NG Firewall)\n• Data encryption and protection key services.\n• SIEM, and Cloud Security Analytics\n• Security Orchestration, Automation, and Response (SOAR)\n• Security Operation Center\n• Identity and Access Management\n\nEducation\n\nBachelor's degree in Computer Science, Information Technology, Engineering or related field experience preferred.\nCertification in one or more of the following technologies preferred: Microsoft Azure Security Technologies, Cloud Security, OCSP, GIAC Certifications, CCSP Network Security, Incident Response.\n\nExperience\n\n5+ years of success in consultative/complex technical security sales and deployment projects, architecture, design, implementation, and/or support of highly distributed applications.\n5+ years of experience in solution delivery experience in Security specialized solution providers.\n\n#customersuccess\n\nMicrosoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form.\n\nBenefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZWN1cml0eSBDbG91ZCBTb2x1dGlvbiBBcmNoaXRlY3QiLCJjb21wYW55X25hbWUiOiJNaWNyb3NvZnQiLCJjb21wYW55X21pZCI6Ii9tLzA0c3Y0IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoic0JaUGRfcVZxZVBJVU1oREFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFVqSmxTV0p3VjFwZmJHOTNlSEpQWlZaMVEwTlZka3hMUm5sMFUxbEtWRE50T1VwTWVWUTVTVXRQUlVodFJXUjJjamQwZHpOeVdYWmpOa0poTmxGc1JXRk9TMVkyT1dkTWVYQTBkRGxIVXpGUVZWWm5ZVVZRZUdWRE9GazBUekZZZEZaMFRFUkZZMnd0UW5BeGVHRlRaV0Z0YVc5cVNVVTBaMnhhUnpCUlVrTnlTbFpKTmxOWk1YQmFZVTFmZDNkRlYxOUJhRGhDTkZjMFdHZFJFaFoxYmpaRFdVeDFWa1ZaUzFBNVVIZFFhVTFQT1dOQkdpSkJUMDFaVW5kRWNrWmZRalJWZDFkSWNVWTBNMlJqZVdveGRYTnBjV2RaWkVaUiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzciLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gR2xhc3Nkb29yIiwibGluayI6Imh0dHBzOi8vd3d3LmdsYXNzZG9vci5zZy9qb2ItbGlzdGluZy9zZWN1cml0eS1jbG91ZC1zb2x1dGlvbi1hcmNoaXRlY3QtbWljcm9zb2Z0LUpWX0lDMzIzNTkyMV9LTzAsMzNfS0UzNCw0My5odG0/amw9MzgwNzQwNzcxNVx1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Solution Architect-IT Cyber Security Cloud Computing IT Security", "company_name": "Infinite Computer Solutions Pte Ltd", "location": "Singapore", "via": "via LinkedIn", "description": "Responsibilities\n• Plan, manage and operate cloud-based testing sandbox environment\n• Manage cloud infrastructure services, and multiple instances of the cloud servers via management console\n• Provide technical assistance on cloud-based systems to resolve operational problems, including system troubleshooting, network security configurations, patching, and help to maintain system security procedures\n• Maintain multi-user computing environment and optimise usage of cloud resources, identify opportunities for efficiency, e.g. Infrastructures as code\n• Perform backup and recovery of virtual cloud instances, data, etc\n• Support and facilitate POC for companies and potential customers to promote technology adoption within Government and Enterprises\n• Facilitate POC requirement discussion for potential government/enterprise buyers with accredited & spark companies and set realistic customer expectation\n• Assist in POC deployment including install, setup and configurations of Web, App... Database servers on Windows and Linux\n• Plan, manage and execute technical evaluation of innovative tech products as part of quality assurance and risk management process to Government and Enterprise stakeholders\n• Identify product key unique value propositions from technology perspective and perform deep-dive understanding of the product architecture\n• Design testing strategy in collaboration with company tech leaders, and develop test scenarios / test cases to evaluate the product\n• Conduct testing and compliance assessments – in the areas of functional, performance, security, usability, compatibility/portability – with reference to open industry and government standards\n• Experience in Cloud Infrastructure and Cybersecurity will be an advantage\n\nRequirements\n• Academic\n• Degree in Computer Science, Computer or Electronics Engineering or Information Technology, or related field preferred\n• Experience\n• Minimally 6-8 years of ICT/ICM experience in Product Quality & Solution Architect; and at least 3 years of cloud and cybersecurity experience\n• Good knowledge of Active Directory, Exchange, Azure, AWS and GCP.\n• Strong technical knowledge of Infrastructure as Service (IaaS), Platform as Service (PaaS) and Software as Service (SaaS).\n• Experience with hybrid cloud, microservices and on-premise infrastructure, as well as architecture and technology governance aligned to government and enterprise standard.\n• Professional exposure to container platform tools such as Docker and Kubernetes.\n• Professional exposure to Dev Ops release and build management, automation scripts experience with tolls like Git, Bash scripting, PowerShell, AWS Cloud Formation, Puppet, Ansible or Chef.\n• Experience with analysing scanned results of both Static and Dynamic Application Security Testing from assessment software, such as HP Fortify, WebInspect, Performance Center, Parasoft, etc.\n• Knowledge of ISO standards e.g. ISO 17025 / 25010 / 27001 and OWASP – ASVS, etc.\n• Knowledge of security technologies in both IT & OT, etc.\n• Knowledge and experience in information technologies, particularly in Enterprise Software, Cloud Technology, IoT, Robotics, Computer Vision, Future Comms, Big Data and Data Analytics, Artificial Intelligence, Energy Management, Enterprise IT, Cyber Security, etc.\n• Certification in Solution Architect is a plus\n\nEA License No. - 14C6941\n• Minimally 6-8 years of ICT/ICM experience in Product Quality & Solution Architect; and at least 3 years of cloud and cybersecurity experience\n• Good knowledge of Active Directory, Exchange, Azure, AWS and GCP.\n• Strong technical knowledge of Infra\nSkills: Active Directory, Exchange, Azure, Aws, Cloud, Cyber Security, Cloud Computing, Iaas, Paas, Devops, It Security\n\nExperience: 6.00-15.00 Years\n\nEducation: Bachelors/ Degree", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2x1dGlvbiBBcmNoaXRlY3QtSVQgQ3liZXIgU2VjdXJpdHkgQ2xvdWQgQ29tcHV0aW5nIElUIFNlY3VyaXR5IiwiY29tcGFueV9uYW1lIjoiSW5maW5pdGUgQ29tcHV0ZXIgU29sdXRpb25zIFB0ZSBMdGQiLCJjb21wYW55X21pZCI6Ii9nLzExZzltajcyeXoiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiItUTBtNm40enNGQUxDM3FGQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFcUVDQ3VJQlFVNVZYMDV4VWxaM01VZzVZMUp6VURGeE5WbDFaelJFTTJGWmRXaGZZME5XVUVaeGFWQlpha2hmY25wNFdDMUJNSGhxZVVFdFVDMUlaMk40YTBWQk5URXpabEZQU2tWeWRXVnBVbkZ2ZGpORGJpMVlkVUpTVURCT1MxUlliMmxhYWtkSFlrOUhOVVZ2WkRkT09UTnRSVGxZV2kxNmVGVm5UMFJ5U1MxWWJrVkJZM1JsYlRGM2VVZGZVM2RuZVZSc1JXaDROMUJhVGpkRmNYbFJPRzlIUjNkWVRVOWhVa2xOZVdRMU4zVk9jbDh3TFZsUWRtaEVja1Z3ZDBKaVpqWTVOVVF3WjFSblprMWljWGgxYzA5S2EwNVlha3R2VFRabVdEQTVjbFZJYzJONVVSSVdkVzQyUTFsTWRWWkZXVXRRT1ZCM1VHbE5UemxqUVJvaVFVOU5XVkozUW1sQ04xVnRVV3R0TTJkR1lreE1NVGt3TFdWQ2NqaHhRWEJLZHciLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18xNCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL3NnLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvc29sdXRpb24tYXJjaGl0ZWN0LWl0LWN5YmVyLXNlY3VyaXR5LWNsb3VkLWNvbXB1dGluZy1pdC1zZWN1cml0eS1hdC1pbmZpbml0ZS1jb21wdXRlci1zb2x1dGlvbnMtcHRlLWx0ZC0yNDU5MTQxODkyP3JlZklkPTE3MDMzNGU1LTkyMjAtNDBhMy1hMDcxLWM1NjhkZTk3MjZhNFx1MDAyNnRyYWNraW5nSWQ9cnBiS1cyUjM4MW5JeG9Jem90OElNZyUzRCUzRFx1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "M&E Specialist Solutions Architect", "company_name": "Amazon", "location": "Singapore", "via": "via Jobs", "description": "Job Description : Do you like helping customers implement challenging video workflows? Would you like to do this using the latest encoding and cloud computing technologies? Do you have the consultative and leadership skills to help customers succeed with their cloud adoption initiatives? AWS Elemental builds cloud-based and on-premises video encoding, origin, packaging, and management solutions for Live and Video-On-Demand workflows for customers worldwide. These solutions are integrated into larger AWS or other workflows. The AWS Elemental Specialised Solutions Architect is an expert in building architectures to support video processing and delivery workflows. In this role the Solutions Architect is expected to assist customers, partners, and AWS account teams with optimizing these workflows to best fit the application and use case. The AWS Elemental Specialist SA will work closely with customers as well as our internal development teams on creating new blueprints and best practices... for helping customers transition to AWS cloud services. Building next generation architectures requires both a depth and breadth of understanding of the technical, operational and business challenges each Media & Entertainment (M&E) customer is facing. We are looking for a Solutions Architect to guide customers through this disruptive shift to cloud based video processing and delivery, utilizing best of breed AWS services as well as partner solutions. Here are some other qualities we are looking for: At AWS, we have a credo of \"Work hard. Have fun. Make history.\" In this role, you will love what you do, be a great teammate and instinctively know how to make work fun. You will be dynamic and creative, and willing to take on any challenge and make a big impact. You need to have a passion for educating, training, designing, and building new cloud solutions for video workflows for a variety of different markets. You should be ready to embrace the challenge and have fun doing it. Responsibilities Include: · Ensure customer success in building architectures to support video processing and delivery workflows · Act as the primary technical interface for customer evaluations and provide responsive and knowledgeable pre-sales support · Work with to design and integrate our products and services into both new and legacy video workflows for our customers · Conduct one-to-few and one-to-many training sessions to transfer knowledge to customers, partners and system integrators on best practices · Capture and share best-practice knowledge amongst the AWS solutions architect community · Author or otherwise contribute to AWS customer-facing publications such as whitepapers · Communicate customer feedback to Product Management and the Services team (feature requests, market trends, etc.) · Work closely with the Software Engineering team to verify technical requirements for customer-requested features and defect fixes Basic Qualifications : · A BS in computer science, electrical engineering or other related field · Strong communication skills · Experience working with Broadcast or OTT workflows · Experience with video compression and packaging, especially H.264, HEVC, HLS and MPEG DASH · 3-5 years' experience with Linux operating systems · Occasional international travel required (2-3 per year). · Demonstrated proficiency in written and spoken English Preferred Qualifications : · 3-4 years' experience using at least one Linux-based scripting language (e.g. Perl, Ruby, Bash, Python) · Experience with cloud-based services (S3, EC2, Cloudfront, etc.) or AWS SA Professional certification strongly preferred · Experience working with broadcast, distribution, or content creation customers and demonstrated in-depth knowledge of their requirements and workflows Job Description : Do you like helping customers implement challenging video workflows? Would you like to do this using the latest encoding and cloud computing technologies? Do you have the consultative and leadership skills to help customers succeed Experience: 3.00-5.00 Years", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJNXHUwMDI2RSBTcGVjaWFsaXN0IFNvbHV0aW9ucyBBcmNoaXRlY3QiLCJjb21wYW55X25hbWUiOiJBbWF6b24iLCJjb21wYW55X21pZCI6Ii9tLzBtZ2tnIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiVE9rSmgtblA3aG5MaGJMVEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXNzQkNvd0JRVTVWWDA1eFVTMVZSMUpQUnpkblptWjZjWEZmTTA1aldIQXphbFZOUWpsbVRtRjROMU5XT1ZGaWMyeENVME5vYkMxRFJtcGpWamd5T1ZNNGNVRTRMUzFxYXpZMFVWQXRWSFkyYUhCSlluZ3pkRTVJVFdac2MyZFBXRlJMYzJkeE1IbGtaREpQWWxjeU0xTnVZMDFZVmxkYVpWbFBZVjlMVWpRMFFsUkxlRTFwZEVaQlNFaFVPV0UwUzFZU0ZuVnVOa05aVEhWV1JWbExVRGxRZDFCcFRVODVZMEVhSWtGUFRWbFNkMEpVTWpCd1JHMTVhVjlCVm5KdlptNVlZVUU0WDBaa09XcFlNRkUiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18yMSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIiwibGluayI6Imh0dHBzOi8vc2cuZmlkYW50by5jb20vam9icy9qb2Itb3BlbmluZy9pbmZvcm1hdGlvbi10ZWNobm9sb2d5LXByb2plY3QtbWFuYWdlcnMvbWUtc3BlY2lhbGlzdC1zb2x1dGlvbnMtYXJjaGl0ZWN0LTI3ODUwMjQwMD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "SAP SuccessFactors Solution Architect", "company_name": "ABeam Consulting", "location": "Singapore (+1 other)", "via": "via LinkedIn", "description": "Job Title: SAP SuccessFactors Solution Architect\n\nJob Description: This is an SAP project delivery-focused leading role, managing complex SAP SuccessFactors Projects implementation & configuration.\n\nPre-requisites:\n• Open to SAP project delivery that will be the main job scope\n• Taking care of SAP SuccessFactors projects and the SME of this area\n• From time to time, you will need to take care of the tickets issue from several clients to support their queries (not priority).\n• The consultant must be able to travel frequently locally.\n\nResponsibilities:\n• As ABSG Senior SAP SuccessFactors leading consultant, you will be working with our clients together with cross-functional teams, IT development team and business users at consulting level using Activate methodology - preferable.\n\nRequirements:\n• Must have more than 8 years of SAP SuccessFactors Consultant\n• At least 4 years experience as a project leading role with a minimum of 2 SuccessFactors projects who had managed on project... plans/charter\n• Extreme strong knowledge on SuccessFactors project management documentation and Singapore HR regulations\n• Be expert with a minimum of three (3) talent modules Recruitment, Onboarding 2.0, Performance Management, Succession, Learning Management. Any one of the modules with Professional certification preferred.\n• Expert in handling PMO matters, SCOM, weekly status update, negotiations, project plans & risk register etc.\n• Manage scope, timeline and project planning and execution.\n• Manage the day to day interaction and communications with the client and work closely with Customer Engagement Executive to address any escalations or issues\n• Implementation of experience of for Singapore clients for SuccessFactors\n• Presales experience can be an added advantage.\n• Please note that salary is determined on related experience and skill\n\nPersonal Attributes:\n• You must have an excellent analytical, presentation and soft skills including communication on how to handle existing clients and be client-oriented with excellent problem-solving skills\n• You must possess a personal attribute such as creativity, positive thinking, quick learning, imagination, leadership, judgment and maturity, curiosity, strong interpersonal skills, professional integrity and initiative\n• Confident in communicating and presenting at a business level to MNC clients.\n\nTake this opportunity to join an international team of professionals, implement and develop software and consulting solutions in international projects and gain cultural experience, to set a serious foundation for future career steps.\n\nFor this position, interested applicants can apply directly by clicking \"Apply Now\"\n\nABeam Consulting (S) Pte Ltd\n\n18 Cross Street #10-05/09 China Square Central Singapore 048423\n\nTel: +65 6922 5270\n\nWebsite: www.abeam.com\n\nWe regret to inform you that only shortlisted candidates will be notified.\n\nAdditional note to applicants\n• Only candidates with profiles and CV’s matching job requirements will be considered and contacted for interviews. In case you do not receive any response from us within four weeks of your application it means that your application was not considered. Due to the high number of applications we receive, we cannot entertain each individual follow-up.\n• Processing of applications will start approximately two weeks after the job posting date. The selection process is expected to take another two to four weeks.\n\nPlease note that this is for direct hiring only, NOT open to recruiters", "extensions": ["4 days ago", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTQVAgU3VjY2Vzc0ZhY3RvcnMgU29sdXRpb24gQXJjaGl0ZWN0IiwiY29tcGFueV9uYW1lIjoiQUJlYW0gQ29uc3VsdGluZyIsImNvbXBhbnlfbWlkIjoiL2cvMTFiYzZ3aHJfZiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjBRMS1MaXhpV2hsRWFOOV9BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2WUJDcmNCUVU1VlgwNXhVVWhxUkVwZloxYzFTazVvTm1GeGRYQnJaRlpGYmxCSmRGWjVOMEl0UlVaQmFqUk9hekJmWmxwVGIzbHhXa3AzZW5aQldFNHpNMUZpUzJ4dlkybHdNa3MyU25KalQxRmhSa2xXZGxOb2REVnljMVpwUlRseGNETnNNa1JZWVhSQmRsaEpURWxHYVZnMmJISndhakJWVWs5UWIyWlhOekJyVlhFeGFUQjNZeTFPYzFocUxVOW5iRFJOTmpaUGNGbEpiamhHVDNSMldGcGhNMlpuVG1Sd1dXVTFhRzEwVVVkUE5UbFhTRWR6V2xnMEVoWjFialpEV1V4MVZrVlpTMUE1VUhkUWFVMVBPV05CR2lKQlQwMVpVbmRDU1ZwaVRreEJNRW8zTmpoVlExVkpiMlEwVmtkcFRITlBiWEYzIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMjkiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGlua2VkSW4iLCJsaW5rIjoiaHR0cHM6Ly9zZy5saW5rZWRpbi5jb20vam9icy92aWV3L3NhcC1zdWNjZXNzZmFjdG9ycy1zb2x1dGlvbi1hcmNoaXRlY3QtYXQtYWJlYW0tY29uc3VsdGluZy0yMzc4ODI1ODk1P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Lead IT Architect - Cloud", "company_name": "SingTel", "location": "Singapore", "via": "via Monster", "description": "Job Description :\nThe Lead IT Architect is responsible for the Design, implementation, testing and optimisation of the IT applications technology across on-premise, cloud and hybrid platforms. He/She performs activities pertaining to IT applications deployment and performance to ensure delivery of applications solutions in alignment with service standards. He/she oversees major maintenance and troubleshooting issues, and is responsible for executing upgrades to technology systems.\nHe/she is familiar with various types of technology systems and platforms, including bespokes application developments, middleware integrations, Database, Security integration and DevSecOps technology.\nThe Lead IT Architect takes a critical and methodical approach towards implementing technology projects performance monitoring. He also maintains high standards of quality and collaborates with team members to resolve complex issues.\nLead in the design and implementation of technology solutions across... on-premise and cloud infrastructure that adhere to current architecture standards\n• Evaluate the feasibility of integrating or adopting emerging cloud and infrastructure technologies\n• Lead the testing of implemented technology solutions to ensure requirements are met\n• Oversees the development documentation on administration, installation, configuration and troubleshooting\n• Manage the integration of third-party technologies into cloud infrastructure\n• Oversees the development of system and service deployment scripts\n• Conduct technical analysis of complex software, hardware and technology equipment\n• Oversee adherence to security requirements for technology operations\n• Monitor metrics for performance, reliability, availability, security and billing of systems to proactively right- technology load\n• Analyse and present findings on infrastructure technology capabilities and limitations\n• Tune cloud systems to ensure optimal performance\n• Conduct technical analysis to determine the extent to which solutions perform as required to ensure that future solutions meet anticipated demand\n• Support initiatives to improve the infrastructure technology systems and service delivery through automation and virtualisation\n• Develop reports on performance, reliability and availability of infrastructure technology systems by review of service uptime, utilisation and throughput\n• Resolve escalated or major issues relating to technology operations\n• Simulate user problems to perform end-to-end diagnosis for technology incidents\n\nThe ideal candidate should possess:\n• Diploma/Bachelor degree in Computer Information Systems or related field\n• Minimum 8-10 years experiences in infrastructure management and cloud operations\n• Experience with various virtualization technologies and multi-tenant, private and hybrid cloud environments.\n• Able to work under pressure and to lead a team to deliver\n• SME in cloud services: SaaS, PaaS, and IaaS\n• It will be advantageous to possess these certifications:\n• AWS Certified Solutions Architect – Associate/Professional\n• AWS Certified Developer - Associate\n• Microsoft Certified: Azure Administrator\n• VMware Certification– Cloud (VCP-Cloud)\n• ITIL v3 or v4 Foundation Certification", "extensions": ["5 days ago", "Full–time"], "detected_extensions": {"posted_at": "5 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJMZWFkIElUIEFyY2hpdGVjdCAtIENsb3VkIiwiY29tcGFueV9uYW1lIjoiU2luZ1RlbCIsImNvbXBhbnlfbWlkIjoiL20vMDIwemZsIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiakhpaGctNWFHYy1mTWMydEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXNzQkNvd0JRVTVWWDA1eFV6SkRWMHRUY0ZOTE0wVnRjM2N5YUhOSGFGQm9WM0YzTlV4c1NqQnJkVVZDY2xOb2JUaENVWFZNVldwWGNXRlZkbkpoTFhSMFpqTklXRWxuYVd0bWVVbFBjM0J0Y1dOTE5uRm9lVzloWjBZNE5IWkpXVVZYWm1wNmIwWmtXbmhCWkVsTGFsSjVWM053TjNCM2RscG5la3BHWnprd1dXRkVWRE56V0hGd1pURk1YMHRMV0dnU0ZuVnVOa05aVEhWV1JWbExVRGxRZDFCcFRVODVZMEVhSWtGUFRWbFNkMEZuYkZjd2RDMU9jbE5sTmpsTmJIVjFjRzQ1Wm1OV2VtOXZNbWMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18zNyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNb25zdGVyIiwibGluayI6Imh0dHBzOi8vd3d3Lm1vbnN0ZXIuY29tLnNnL2FtcC9qb2ItdmFjYW5jeS1sZWFkLWl0LWFyY2hpdGVjdC1jbG91ZC1zaW5ndGVsLXNpbmdhcG9yZS0yNzc2ODkxMy5odG1sP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Cloud Architect", "company_name": "IBM", "location": "Singapore", "via": "via Jobs", "description": "Introduction\n\nAs an IBM Application Architect, you directly help clients transform their business and solve complex problems. You will define the scope and vision for projects that deliver customized solutions using your knowledge of IBM platforms. You are a technical leader, serving as a liaison among business partners, technical resources, and project stakeholders.\n\nYour Role and Responsibilities\n\nIBM is the largest technology and consulting employer in the world, serving clients in 170 countries. In this new era of Cognitive Business, IBM is helping to reshape industries by bringing together our expertise in Cloud, Analytics, Security, Mobile, and the Internet of Things. We are changing how we create. How we collaborate. How we analyse. How we engage. IBM is a leader in this global transformation.\n\nIBM Global Business Services (GBS) is a team of business, strategy and technology consultants enabling enterprises to make smarter decisions and providing unparalleled client and... consumer experiences in cognitive, data analytics, cloud technology and mobile app development. With global reach, outcome-focused methodologies and deep industry expertise, IBM GBS empowers clients to digitally reinvent their business and get the competitive edge. We outthink ordinary. Discover what you can do at IBM. We are hiring.\n\nAs Cloud Solution Architect you will be the Senior Technical leader and subject matter expert engaged in the solutioning and delivery of our Cloud-related projects . Working in partnership with the wider project team, you will be responsible for the overall technology strategy and architecture/design for Cloud solutions for your clients. You will also be responsible for the direction of technical resources on the project to implement solutions for your clients.\n\nYou will also work on optimising resources to meet project constraints taking into account such concerns as Client budget, skills availability, and complexity of the project/solution. From a client perspective you will deal with teams focused on designing, migrating, building, managing, transforming and expanding their services on Cloud. Your role will also be to build trusted and ongoing relationships with key buyers and influencers including cloud developers, CIO's/CTO's and technology procurement.\n\nKey Skills and Experience required:\n\nExpert level skills in Cloud to guide technical client side architects on Cloud strategy and solution best practices. This will aid clients to identify high value Cloud entry points (e.g. new applications, transforming existing applications or simply starting a Cloud sandbox that IBM helps them operationalize.)\n\nExpert level skills in guiding IBM project technical resources to design and implement Cloud solutions\n\nExpert level skill in Cloud technology, including hybrid Cloud solutions\n\nDeep understanding of Public Cloud as a PaaS offering including automation of deployment and containers.\n\nDeep understanding of the current state of the art for infrastructure automation, continuous integration/deployment, SQL/NoSQL/NewSQL, networking, and cloud-based delivery models.\n\nDeep experience in designing and implementing highly available and scalable Cloud solutions\n\nExperienced skill level with contemporary engagement methods, including Proof of Concepts.\n\nExperienced level skills with Design Thinking, Agile and DevOps methods.\n\nBusiness case modelling skills (i.e. Cloud total cost of Ownership vs Business as Usual purchases)\n\nAbility to position Cloud technology against industry solution requirements.\n\nSignificant experience within any of the major Industries or Government\n\nExcellent verbal, written and presentation skills;\n\nSelf-driven, detail-orientation\n\nAbility to work collaboratively and productively with globally dispersed teams\n\nAbility to manage ambiguity, yet producing tangible results\n\nAbility to effectively manage challenging situations without loss of focus when under pressure\n\nDesired:\n\nAt least 3+ year experience architecting and solutioning leveraging a major Cloud platform.\n\n10+ years of experience in infrastructure / development consulting\n\nCloud Certification\n\nCloud native solutions\n\nTOGAF or equivalent architecture certification\n\nProficiency in programming languages such as: Shell, Java, C, Ruby, Python\n\nKnowledge of networking systems and architectures (DNS, TCP, UDP etc)\n\nLead first of a kind and complex solution development\n\nProvide end-to-end solution approach guidance and coaching.\n\nCreate and use intellectual capital to solve diverse client issues in an innovative way\n\nProvide training to technical solutioners and sales teams\n\nProficiency in Infrastructure as Code implementation\n\nExperience in Network and Infrastructure migration to Cloud\n\nRequired Technical and Professional Expertise\n\nAs above\n\nPreferred Technical and Professional Expertise\n\nAs above\n\n-\n\nAbout Business UnitIBM Services is a team of business, strategy and technology consultants that design, build, and run foundational systems and services that is the backbone of the world's economy. IBM Services partners with the world's leading companies in over 170 countries to build smarter businesses by reimagining and reinventing through technology, with its outcome-focused methodologies, industry-leading portfolio and world class research and operations expertise leading to results-driven innovation and enduring excellence.\n\nYour Life @ IBMWhat matters to you when you're looking for your next career challenge?\n\nMaybe you want to get involved in work that really changes the world? What about somewhere with incredible and diverse career and development opportunities - where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust - where everyone has a voice? What about all of these? If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible.\n\nImpact. Inclusion. Infinite Experiences. Do your best work ever.\n\nAbout IBMIBM's greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries.\n\nLocation StatementFor additional information about location requirements, please discuss with the recruiter following submission of your application.\n\nBeing You @ IBMIBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, pregnancy, disability, age, veteran status, or other characteristics. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status", "extensions": ["27 days ago", "Full–time"], "detected_extensions": {"posted_at": "27 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDbG91ZCBBcmNoaXRlY3QiLCJjb21wYW55X25hbWUiOiJJQk0iLCJjb21wYW55X21pZCI6Ii9tLzAzc2M4IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiV1Jsa1JQMVRlWUhRNTFrTEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXNzQkNvd0JRVTVWWDA1eFVuTjVXbFJaZWpkTGIycFVlRFpKVEZWSVFrNVRNVXh3U1ZSdlIyTllURk5QY25SR2FHNVZaR1UxZEhaSVNFcFZWR052VVY5UmJEVktWRXMyTWpGdlRrSXdXRVpOUlZwbVdrOW9PRXM0UW1NelRUWXhaREIzUlROSGVFTXlZMmRZUjJWMVNYcEpXR0p1VjJGNVRsQjBVWEZpUm1GS2FsZGFkbXhHVWpCRll6aHhTblpHUkhBU0ZuVnVOa05aVEhWV1JWbExVRGxRZDFCcFRVODVZMEVhSWtGUFRWbFNkME5HUWpSd1lscE5NR3h3WDA1RlZXWlRSMlpsY0RsQlJYSm1TVkUiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY180NSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIiwibGluayI6Imh0dHBzOi8vc2cuZmlkYW50by5jb20vam9icy9qb2Itb3BlbmluZy9jb21wdXRlci1zeXN0ZW1zLWVuZ2luZWVyc2FyY2hpdGVjdHMvY2xvdWQtYXJjaGl0ZWN0LTI2MDY4MDk2Mj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Solution Architect", "company_name": "EY", "location": "Singapore", "via": "via Jobrapido.com", "description": "At EY, our Global Managed Services is increasing focus on technology enabled platform Services.As Solutions Architect, you will be expected to support workstreams as part of a complex pursuit and run workstreams in Core pursuits\n\nThe role will focus on qualified client pursuits and include the design of business and technical solutions, transition and transformation plans and any ongoing development requirements\n\nYou will report to the Global Managed Services Area Solution Architect Leader and work closely with the other significant regional stakeholders as well as global delivery and enablement teams\n\nYour key responsibilities: Apply the existing Solution Architecture Framework and approach Support solution workstreams within the pursuit covering all aspects of people, process and technology Apply assets in support of the design of target client solution (resourcing, location, technology, integration), transition and transformation program, based upon repeatable IP You will be... required to work on complex pursuits with the Lead Solution Architect, peer workstream leaders and Service Line Subject Matter Resource You will also be required to work on core pursuits, partner with pursuit leader and team You will be required to own core architectural assets and maintain them through the pursuit lifecycle Provide input towards the design of a specific priority managed services offering over the development lifecycle with particular focus on delivery components necessary to deploy a viable solution for our clients Support the Managed Services Delivery Team with the transition and establishment of the managed services Support training programs for potential managed services solution architect and offering leads Capture knowledge to support pursuits Support the recruitment and development of solution talent into the Managed Services team To qualify for the role, you must have: Experience in developing integrated managed services solutions Demonstrated experience building client solutions that leverage and reuse existing assets and capabilities including alliances\n\nDeveloped client value propositions Some experience across Managed Services life cycle Experience in problem solving skill, costing, technology-based solution with deals and offerings 3 to 5 years of industry experience Relevant degree: Engineering, Computer science, Business development Ideally you will have: Experience supporting commercial negotiation, business development and delivery Client facing experience in terms of solution iteration and presentation skills Experience of managing complex client requirements that you will be able to turn into comprehensible and simplified solution You may have certification in architecture degree such as TOGAF Proficiency in Design Thinking and Agile Methodology The location of this position is flexible within the given Area\n\nWhat We Look For We’re interested in self-motivated individuals who can easily function in a high demand, performance-driven environment\n\nIn addition, we’re looking for people who recognize the accomplishments of the team before the individual and are sought after as people developers\n\nIf you’re passionate about problem-solving and helping our clients with some of their most complex issues, this role is for you\n\nWhat Working At EY Offers We offer a competitive compensation package where you’ll be rewarded based on your performance and recognized for the value you bring to our business\n\nIn addition, we offer a range of programs and benefits designed to support your physical, financial and social well-being\n\nPlus, we offer A collaborative environment where everyone works together to create a better working world Excellent training and development prospects, both through established programs and on-the-job training An excellent team of senior colleagues, dedicated to managing and varying your workload", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2x1dGlvbiBBcmNoaXRlY3QiLCJjb21wYW55X25hbWUiOiJFWSIsImNvbXBhbnlfbWlkIjoiL20vMGc5amMiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJJLWZZb3k1S0VZWVRVQ2FJQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFc3NCQ293QlFVNVZYMDV4VkRKMVFXUXhaVkpWV1hveFpGZERhVGRDTm1GRmEwWkNZWGROUTBsVk1WVkVlVWRPYlhkVFNYRk5iMGRRU0hCbU1qTkVkams0YUhGUmVVcFVUVlpOVW1kb0xUaERVMk01VUhBd1dXNWlVMVZrWVd4TlpIbENiVGRXWTFKSFIzVlhWVVowY0U1dkxVUXRPVmh3VEdWbVYzb3ROalJMU1dzNGVVdG9Na2xoT1hGQlRHNWlXbWtTRm5WdU5rTlpUSFZXUlZsTFVEbFFkMUJwVFU4NVkwRWFJa0ZQVFZsU2QwTnFVa3czVmpCek5rSlNTVEZmWmpjdGMyOVFkbUV3U0hwbGFGRSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzUzIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnJhcGlkby5jb20iLCJsaW5rIjoiaHR0cHM6Ly9zZy5qb2JyYXBpZG8uY29tL2pvYnByZXZpZXcvMjI5MzM0MTc/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Cloud Solution Architect / Purview", "company_name": "MICROSOFT", "location": "Singapore", "via": "via LinkedIn", "description": "Job Description\n\nMicrosoft envisions a world where passionate innovators come to collaborate, envisioning what can be and taking their careers places they simply couldn't anywhere else. This isa worldof morepossibility, more innovation, more openness, and sky's-the-limit thinking – a cloud-enabled world.\nOur mission is to empower every person and every organization on the planet to achieve more.This mission is ambitious and at the core of what our customers and employees care deeply about. We haveuniquecapability in harmonizing the needs of both individuals and organizations. We deeply care about taking our ideals and vision global and making a difference in lives and organizations in all corners of the planet.\nWe are always learning. Insatiably curious. We lean into uncertainty, take risks, and learn quickly from our mistakes. We build on each other'sideas, becausewe are better together. We stand in awe of what humans dare to achieve and are motivated every day to empower others to... do more and achieve more through our technology and innovation. Together we make a difference.\n\nCheck Outall Ofour Products At\n\nTo learn more about Microsoft's mission, please visit:\n\nMicrosoft aspires to help our customers achieve their own digital transformation, leveraging the power of Microsoft Cloud solutions and services. To this end, Microsoft is investing in a dedicated Customer Success team that will help Microsoft customers successfully adopt Microsoft Cloud solution and services.\nIn this decade of data, as data is becoming morepersuasiveand omnipresent, more and more enterprises are relying on data to drive their businesses and gain thedifferentiators thatwill give them competitiveadvantage.Data is a first-class citizen in the 4th Industrial Revolution. Given its strategic importance, it is becoming the most sacred asset and therefore its governance is becoming the needofan hour.Enterprise Data Governancedrives alignment accountability, innovation, scalability, and trust across the company.We are looking for a highly motivated and passionate Data Governance Cloud Solution Architect toaccelerate customers' digital transformation and data journey by influencing and supporting enterprise-wide Data Governance program, including enterprise data policies and standards and compliance.\nThis is a customer facing role, owning overalldata governance thought leadership andcustomerjourney on behalf ofMicrosoftin yourregion\nTheideal candidate will have experience in customer-facing roles and success leading deep technicaldata governancediscussions with senior customerexecutivesasCxOsandIT Management toinfluence data governance practice.\nKey responsibilities include:Understand customers'overall data estate, IT and business priorities and successmeasuresDevelop deep relationships with key customer datastakeholdersas CDO who drive long-term datacentricand data driven culture adoption within their company to enable them to be cloudadvocatesConsult with CDO to helpdesigndata governanceprogramtotoenable the right data, at the right time and with the right controls throughbest in classData Management, while also ensuring data is high quality, discoverable andavailableMaintain and advance deep technical skills and knowledge, keeping up to date with market trends and competitive insights, andsharewithin the technicalcommunityBe a Voice of Customer to share insights and best practices, connect with Engineering team to remove keyblockersBe an Azure Platform evangelist with customers, partners and externalcommunitiesAssess the Customers' knowledge ofdata governance, Azure platform andoverall cloud readiness to support customers through a structured learning plan and ensure its delivery throughpartners\nexperiences required: education, key experiences, knowledge and skills:\ntechnical required 5+ years of expert-level skills in leading data maturityassessment ,data management practices discussion and data governance toolsimplementation(any major data governance vendor) .required proven technical knowledge of deployment of both cloud andon-premisesoftware solutions and architectures (data warehousing, data integration, dataquality ,datalineage ,mdmetc.). must have participated in minimum 3 deployments asanlead developer/architect role on data governance engagements.required deep understanding of data complianceregulations ,minimum 2 (gdpr, ccpa, pcidss ,hipaa,fisma, ferpa etc.) and remediationtechniques(anonymization, tokenization etc.)\ncommunication proven track record of building deep technical relationships with senior it executives and growing data services in large or highly strategicaccountsability to leadconversationwith cdo/cio/cso personas.track record of successful managing customers with complex data management needs and formulation of data governance adoption and accelerationstrategiesproven track record of driving decisions collaboratively, resolving conflicts and ensuring follow through with exceptional verbal and written communicationskills\npreferred experience sexperience with aws/azure/gcp cloud ecosystem would be preferable.prior work experience in a consulting/architecture position within a software and/or services company such as amazon, google,salesforce, vmware, google, ibm, avanade, t-systems, wipro, csc, hp, infosys, servicenow, dell, tcs\neducation: technical degree: min ofbachelors in computer scienceor adjacent fieldscertifications :datagovernance and stewardship professional (dgsp) ordama certified data management professionalcertification would be preferred\ntravel required: 0-25%\n#customersuccess", "extensions": ["2 days ago", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDbG91ZCBTb2x1dGlvbiBBcmNoaXRlY3QgLyBQdXJ2aWV3IiwiY29tcGFueV9uYW1lIjoiTUlDUk9TT0ZUIiwiY29tcGFueV9taWQiOiIvbS8wNHN2NCIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6InYyZm9zN0M4ZmNER2kxQ19BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhVbTQyVEZsaWNrcFlabGRRV204NVdrNW5hM0pIUWxJMGRqTmxTbWR1WlZOd1drOXNVM2xwZVVoUlRrSmtWWE16VGt3eU5HZGpSVkZTYUVFeFZrMW1SbTFKYWxwcE4xTkpiMlIxTTA1alMwRkdaMTk2YzNWM1EyWnlWUzFSU3pCWFZEVktiVkF6YkRkbFEzZHFlREZDUlVreVVHMUVVbUowVm5oUWJEZDJiVVZIV0d4Q1NYWkdNekZWWVU1WFJVUldTVlZTYjNSdlNrNTZNV0ZuRWhaMWJqWkRXVXgxVmtWWlMxQTVVSGRRYVUxUE9XTkJHaUpCVDAxWlVuZEJVVnBxUlZWUVQxSjJNRVZTWW05R2NUSnljMnRwTFZCSFRrcDMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY182MSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL3NnLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvY2xvdWQtc29sdXRpb24tYXJjaGl0ZWN0LXB1cnZpZXctYXQtbWljcm9zb2Z0LTI1MTI0OTA1MDY/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Cloud Solutions Architect", "company_name": "TEKsystems (Allegis Group Singapore Pte Ltd)", "location": "Singapore", "via": "via Jobrapido.com", "description": "An exciting Cloud SA role with a public cloud management consultancy focused on total cloud consultancy and managed services\n\nThe company partners with popular public clouds such as Google Cloud Platform, Amazon Web Services, Microsoft Azure and offers the architecture and platform best suited to their clients' needs The Position: Understand clients' business and functional needs and create customized managed Cloud enabled solutions\n\nCreate and deliver proposals/presentations/pitch documents to address client requirements\n\nWork closely with the Sales team in client engagements\n\nDeliver product demonstrations to prospective clients and engage in functional level discussions on product aspects, features and benefits\n\nPlay a pivotal role in anchoring client RFPs, ensure superior quality and content of RFP responses\n\nDesign and re-architect Public or Hybrid cloud infrastructure (AWS, GCP and Microsoft Azure) to ensure maximum uptime and scalability to meet clients' constantly evolving... business needs\n\nSupport the service delivery team to initiate pilot projects, demonstrations, Proof of-concepts (POC), evaluations, managed services projects and consulting projects\n\nDesign and implement Disaster Recovery as a Service (DRaaS) based on Public/Hybrid Cloud model\n\nDesign solutions to migrate from No-Virtualization environment to a Virtualization or Cloud environment\n\nExhibit strong understanding of the managed cloud hosting business concepts (AWS, GCP and Microsoft Azure), market practices and trends, customer needs, existing products and IT solutions, key global and regional players, business dynamics etc\n\nShould be conversant with making architectural decisions based on the cloud recommended architectural principles and best practices\n\nExtensive experience in 'Lift and shift' of an existing on-premises application to one of the cloud partners\n\nExperience in setting up, maintenance of Data Centre & Managed Cloud Services\n\nExtensive experience of creating Managed Cloud Solutions (Public, Hybrid) that is consistent of enterprise application and security standards and policies\n\nExperience in designing solutions for Disaster Recovery hosting on Cloud, Managed Services, on premise or hosted solutions, Virtualization techniques and High Availability solutions\n\nConsult & communicate with customers to prepare Various Technical solutions to enable the client organization to upscale their infrastructure without any downtime on Cloud platform\n\nCommunicating expertise with Alliance partners, Application developers and OEMs like AWS, Google, Microsoft, etc\n\nThe Candidate: Knowledge of modern DevOps tooling (Jenkins, Ansible, Ansible, Chef, Puppet, Spinnaker, Terraform, etc.) Experience migrating & deploying application of containers and managing applications with container management platforms (ECS, Kubernetes, Docker Swarm) Knowledge in a CI/CD environment AWS/ GCP or Azure Passionate about IT and great communicator Good presentation and documentation skills Good interpersonal and analytical skills Good stakeholder management, risk & issue management skills Good to have 'AWS Certified Solutions Architect - Associate' Certification 'Google Certified Professional - Solutions Architect' Certification Microsoft Azure certifications", "extensions": ["4 days ago", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDbG91ZCBTb2x1dGlvbnMgQXJjaGl0ZWN0IiwiY29tcGFueV9uYW1lIjoiVEVLc3lzdGVtcyAoQWxsZWdpcyBHcm91cCBTaW5nYXBvcmUgUHRlIEx0ZCkiLCJjb21wYW55X21pZCI6Ii9nLzExYjZnNGJrdjAiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJMMzZVUkNVWGhmbmo2RGp6QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFc3NDQ293Q1FVNVZYMDV4VkRNek1YSnlSbll6VEVadmJtZHZaMHhLZFdKeloyc3lRVWwxYzBZME1XWXhOVzFxYTJsbFdVMVBkSFJMUzJoaE5tdGxUV05mZG5oTVFWWlRaelp6ZDA5SVEyVkhZblUzTlhoc09VbHVWWGxxVDBSaFJFUmFPVFo0ZFhRelp6UlNURzlvUlhkVlUxOUhPSGh6ZUZKek0yczRSMHB4Vm00dGVYWTVWVkZPT1VoVFIweGxWRGhDTkd0UGVYSmxOa0pvU2xkcU1VdzJZbUpLVlV4Q2NXMW9hVTF1Tm5WNFVtWkVaVmRXY2xsNGRqZHpabk0wZVhGR2FuRjVaRVpsZVc5RmVUTlBiV3BGWkhVdE9GZzRiV3RxV0RkcFRrMXNYMDlhT0dkelJEZGxjV0V3TjJGdFVqUTNWR1kzVUc1UU5IbGpXbVZDT0hkUU1WWnVlVE5KYm01a1puWTVYM0IwUXhJV2RXNDJRMWxNZFZaRldVdFFPVkIzVUdsTlR6bGpRUm9pUVU5TldWSjNRbGxRU2pCTFRqZE5kMU5KZFRnMWQwOUVNM3BNWW1nd2FHbE9adyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzY5IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnJhcGlkby5jb20iLCJsaW5rIjoiaHR0cHM6Ly9zZy5qb2JyYXBpZG8uY29tL2pvYnByZXZpZXcvMjI5MjM1NDk/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Senior Partner Solutions Architect", "company_name": "Amazon", "location": "Singapore", "via": "via Jobs", "description": "Job Description : In this role, you will be responsible for evangelizing the AWS platform to the key Business Consulting & Advisory Partners (BCAP) across the ASEAN area so they can advise our joint customers on the right approach to adopt cloud. Working with these important partners is a team effort that will require cooperation and coordination with many stakeholders. You should be just as comfortable talking to technical teams as well as consultants who regularly influence the board and C-level executives of our Enterprise clients. The right candidate will have experience in leading global IT transformation and technology strategy with enterprise companies, demonstrated experience in developing strategic technical initiatives, a proven track record of leading and driving multiple complex customer engagements, and excellent communication skills. If you are a problem solver with broad technical skills, and have the ability to drive technical initiatives with our strategic partners... you will enjoy this role. In this role you will develop and execute workshops with partner consultants and executives, lead white boarding sessions, author white papers and blog posts, and respond to technical inquiries. As a Solution Architect focused on our strategic business partners within Amazon Web Services (AWS), you will have the opportunity to help shape and take initiative to produce results on a strategy to build mind share and broad use of the AWS platform across our partner community. Roles & Responsibilities: • Technical leader and trusted adviser in the area of cloud computing for the community of BCAP partners • Able to create business architecture models demonstrating how products, operations and systems inter operate within the organization • Ensure solutions developed across organization are aligned to enterprise architecture standards and principles, leverage common solutions and services, and meet financial targets (cost and benefits) • Assist our partners by enabling them on AWS services by delivering workshops, lead white boarding sessions & being the key technical advisor to them on AWS services. • Guide and mentor our strategic partner consultants by connecting them with our other teams and initiatives around Mass Migrations, SAP, Digital Innovation in order to drive common outcomes to our joint customers. You will be comfortable with both business and technical aspects of these initiatives. • Work with the digital and engineering groups within the BCAP partners to build up their AWS competencies and develop joint solutions. • Demonstrate a bias for action and deep technical skills by authoring joint technical white-papers, technical case studies, or blog posts with our partners • Understand diverse perspectives of technical vision, creativity, technical acumen, and deep AWS technical skills by jointly designing and developing industry and vertical solutions Basic Qualifications : · Passion for technology with some hands on experience within the last three years · Able to deliver technical presentations to a wide and senior audience · Past experience leading white boarding sessions and delivering workshops to architects, operations staff, developers, and cloud technologists · Demonstrated ability to think strategically, and act tactically, about business, product, and technical challenges · Technology Breadth: Demonstrate architectural best practices applied across a breadth of technologies to solve organizational problems, articulate views/roadmaps for future development, and understand the interaction between infrastructure, operations, and development · Technology Depth: Demonstrate detailed knowledge of concepts, implementation, patterns, and issues of at least a couple of technology areas such as Machine Learning, IoT, Mobile & Analytics. · Exhibit the attributes of learn and be curious by demonstrating the ability to collaborate effectively with a talented team in order to incorporate information about new technologies and business models · 10 years of IT experience · Cloud experience with at least one of the major public cloud providers (AWS, Azure, GCP) Preferred Qualifications : · Demonstrated ownership and involvement in a recent large Enterprise IT project or software development effort · Experience writing technical content, white papers, technical articles, or blog posts · 15 years of IT experience · Consulting experience · AWS Certifications: AWS Certified Solutions Architect - Associate Level, AWS Certified Developer - Associate Level, AWS Certified SysOps Administrator - Associate Level; and AWS Certified Solutions Architect – Professional, AWS Certified Devops Engineer - Professional Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer, and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, disability, age, or other legally protected status. Job Description : In this role, you will be responsible for evangelizing the AWS platform to the key Business Consulting & Advisory Partners (BCAP) across the ASEAN area so they can advise our joint customers on the right approach to adopt cloud. W Skills: Senior Partner Solutions Architect Experience: 10.00-13.00 Years", "extensions": ["14 days ago", "Full–time"], "detected_extensions": {"posted_at": "14 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgUGFydG5lciBTb2x1dGlvbnMgQXJjaGl0ZWN0IiwiY29tcGFueV9uYW1lIjoiQW1hem9uIiwiY29tcGFueV9taWQiOiIvbS8wbWdrZyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Ik00SktpUm53WHFHUTU5UmdBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVzc0JDb3dCUVU1VlgwNXhVVXRPWkZkWGFuaG9aMmh2UW5vM1JXZ3dTbFJqTFRSR1dGbFdNMVp2UmpJNU1WbFdTRk5EZERSR1kzRm5WSFpPYzFKR05saE9NbmRHUjBZMGRUVmxZbFUxUkcwNWRIQjJWWEppYkhJeExWZEtjRk5aTW1OaVJYUkNUVzV5WkVGd1pHbFdhbGR6VDJWNE5IQnpTVGhXTTJkbU56a3dkbGh0VjNkSVVWVmhSbEZFWjFkdlZuRVNGblZ1TmtOWlRIVldSVmxMVURsUWQxQnBUVTg1WTBFYUlrRlBUVmxTZDBOV1pFUTVNMmN5YUd4SFNFSlBkMmhVWmpoa1NXZEpla3BhUjNjIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNzciLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9icyIsImxpbmsiOiJodHRwczovL3NnLmZpZGFudG8uY29tL2pvYnMvam9iLW9wZW5pbmcvaW5mb3JtYXRpb24tdGVjaG5vbG9neS1wcm9qZWN0LW1hbmFnZXJzL3Nlbmlvci1wYXJ0bmVyLXNvbHV0aW9ucy1hcmNoaXRlY3QtMjcwNzQyNzMwP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}], "chips": [{"type": "Title", "param": "job_family_1", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Solution architect", "value": "solution architect"}, {"text": "Solutions architect", "value": "solutions architect"}, {"text": "Architect", "value": "architect"}, {"text": "Cloud architect", "value": "cloud architect"}, {"text": "Technical architect", "value": "technical architect"}, {"text": "Enterprise architect", "value": "enterprise architect"}, {"text": "Manager", "value": "manager"}, {"text": "Senior", "value": "senior"}, {"text": "Consultant", "value": "consultant"}, {"text": "Financial services", "value": "financial services"}, {"text": "Infrastructure architect", "value": "infrastructure architect"}, {"text": "Application architect", "value": "application architect"}, {"text": "Cloud engineer", "value": "cloud engineer"}, {"text": "It architect", "value": "it architect"}, {"text": "Lead architect", "value": "lead architect"}, {"text": "Network architect", "value": "network architect"}, {"text": "Security architect", "value": "security architect"}, {"text": "Senior architect", "value": "senior architect"}, {"text": "Systems engineer", "value": "systems engineer"}, {"text": "Associate director", "value": "associate director"}, {"text": "Deputy", "value": "deputy"}, {"text": "Engineers", "value": "engineers"}, {"text": "Head", "value": "head"}, {"text": "Infrastructure", "value": "infrastructure"}, {"text": "Lab", "value": "lab"}, {"text": "Network engineer", "value": "network engineer"}, {"text": "Presales consultant", "value": "presales consultant"}, {"text": "Public sector", "value": "public sector"}, {"text": "Senior analyst", "value": "senior analyst"}, {"text": "Senior consultant", "value": "senior consultant"}, {"text": "Senior director", "value": "senior director"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Software architect", "value": "software architect"}, {"text": "Solution consultant", "value": "solution consultant"}, {"text": "System administrator", "value": "system administrator"}, {"text": "System architect", "value": "system architect"}, {"text": "System engineer", "value": "system engineer"}, {"text": "Systems analyst", "value": "systems analyst"}, {"text": "Systems architect", "value": "systems architect"}, {"text": "Technical trainer", "value": "technical trainer"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Accounting", "value": "/business/naics2007/5412"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Management", "value": "/business/naics2007/55"}, {"text": "Real Estate", "value": "/business/naics2007/53"}, {"text": "Wholesale", "value": "/business/naics2007/42"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Amazon", "value": "/m/0mgkg"}, {"text": "Microsoft", "value": "/m/04sv4"}, {"text": "EPAM Systems", "value": "/m/0dlnrc"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "IBM", "value": "/m/03sc8"}, {"text": "Salesforce", "value": "/m/07btr5"}, {"text": "EY", "value": "/m/0g9jc"}, {"text": "Publicis Sapient", "value": "/m/02myjp"}, {"text": "Randstad", "value": "/m/08pt1z"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Alibaba Group Holding Limited", "value": "/m/07s6ctl"}, {"text": "Avanade", "value": "/m/094456"}, {"text": "Capgemini", "value": "/m/03vlk0"}, {"text": "Comtel Solutions Pte Ltd", "value": "/g/11dxpztgnb"}, {"text": "DELL", "value": "/g/11c54ch2jm"}, {"text": "Ericsson", "value": "/m/02kyh"}, {"text": "HTZ Resources", "value": "/g/11h21p9b4d"}, {"text": "Infinite Computer Solutions Pte Ltd", "value": "/g/11g9mj72yz"}, {"text": "Michael Page", "value": "/m/04cxldw"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "Orange Business Services", "value": "/m/08zvyz"}, {"text": "Recruitment Hub Asia Pte Ltd", "value": "/g/11dxpww_0f"}, {"text": "TEKsystems (Allegis Group Singapore Pte Ltd)", "value": "/g/11b6g4bkv0"}, {"text": "Talent Trader Group Pte Ltd", "value": "/g/11dxpmlc5b"}, {"text": "Tata Consultancy Services", "value": "/m/01psx8"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "Verizon", "value": "/m/07_dn"}, {"text": "A-Speed Infotech Pte Ltd", "value": "/g/11g9mxswl4"}, {"text": "ABeam Consulting", "value": "/g/11bc6whr_f"}, {"text": "Amazon Web Services (AWS)", "value": "/g/11dxprr2xv"}, {"text": "Amazon Web Services Singapore", "value": "/m/0rznzt1"}, {"text": "Aon", "value": "/m/0z7n"}, {"text": "Avaya", "value": "/m/01sqlk"}, {"text": "Azendian Solutions Pte Ltd", "value": "/g/11dxpvcjj2"}, {"text": "Big Cloud", "value": "/g/11c743lwsr"}]}]}