{"search_metadata": {"id": "60827ee7a4be1014833c4459", "status": "Success", "json_endpoint": "https://serpapi.com/searches/b3c2781bdf3bee54/60827ee7a4be1014833c4459.json", "created_at": "2021-04-23 08:01:43 UTC", "processed_at": "2021-04-23 08:01:43 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28solution+architect%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=240", "raw_html_file": "https://serpapi.com/searches/b3c2781bdf3bee54/60827ee7a4be1014833c4459.html", "total_time_taken": 0.79}, "search_parameters": {"q": "(solution architect) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "240"}, "jobs_results": [{"title": "Cloud Solution Architect Manager", "company_name": "Microsoft", "location": "Singapore", "via": "via LinkedIn", "description": "Microsoft is on a mission to empower every person and every organization on the planet to achieve more. Our culture is centered on embracing a growth mindset, a theme of inspiring excellence, and encouraging teams and leaders to bring their best each day. In doing so, we create life-changing innovations that impact billions of lives around the world. You can help us to achieve our mission.\n\nMicrosoft aspires to help our customers achieve their own digital transformation, leveraging the power of Microsoft Cloud solutions and support offerings. To this end, Microsoft invests in a dedicated Customer Success team that will help Microsoft customers successfully realize their business outcomes.\n\nAzure is the most comprehensive, innovative and flexible cloud platform today and Microsoft is hiring professionals that will drive customer cloud adoption within the most important companies in the market.\n\nWe are always learning. Insatiably curious. We lean into uncertainty, take risks, and learn... quickly from our mistakes. We build on each other’s ideas because we are better together. We stand in awe of what humans dare to achieve and are motivated every day to empower others to do more and achieve more through our technology and innovation. Together we make a difference.\n\nTo learn more about Microsoft’s mission, please visit: https://careers.microsoft.com/mission-culture\n\nCheck out all of our products at: http://www.microsoft.com/en-us\n\nWe are looking for a talented individual to lead a team of deeply technical Apps & Infra/Data and AI Cloud Solution Architects (CSA) to drive growth of Azure Services for a set of Enterprise accounts across different industries. Key responsibilities include: This CSA Manager role will directly manage a team of full-time employee Apps & Infra/Data and AI CSA that will cover Enterprise customers in their respective territory. This is an exciting role that will help fuel Azure Customer success through customer retention and growth.\n\nResponsibilities\n\nKey responsibilities include:\n• Hire, on-board, develop, coach, mentor and evaluate CSA. Set a clear bar for excellence. Build a high performing team that will be diverse and inclusive\n• Must possess exceptional cross-team collaboration and communication. Partner with all required Microsoft stakeholders in the subsidiary to drive CSA role clarity, account coverage, project assignment and effective cross-team collaboration\n• Coach and enable your team to accelerate Azure projects to production, including guidance on architectural design, technical recommendations, blocker escalations and technical resource orchestration\n• Ensure your team delivers high quality production deployments that are resilient and successful\n• Drive operational excellence, including timely consumption opportunity management and high-quality reporting and insights\n\nQualifications\n\nExperiences Required - Education, Key Experiences, Knowledge and Skills:\n\nProfessional\n• Experience. 10+ years of experience in technical sales, engineering or consultative delivery required\n• Management. 10+ years of experience in people management required\n• Change. 7+ years of experience driving change management or technical adoption required\n• Collaboration. Ability to generate trust, build alliances, and orchestrate interdisciplinary teams to the benefit of customers required\n• Communication. Thought leader with executive presence, including the ability to hold CxO and BDM level discussions, exceptional interpersonal, verbal, written and presentation skills required\n\nTechnical\n• Proven ability to map the customer’s needs to technical solutions required\n• Strong technical understanding of Applications & Infrastructure/Data and AI Enterprise cloud workloads required\n• Ability to stay up to date on new/improved Azure scenarios and workloads required\n• Empathy, curiosity, and desire to constantly improve, acquire new skills and drive for results required\n• Demonstrated Technical leadership through prior technical coaching/leadership roles required\n• Ability to act on Customer Escalation n needs, Unblock the customer through orchestration of right resources at the right time - required\n\nEducation\n• Bachelor's degree in Computer Science, Information Technology, Engineering or related field preferred\n• Apps n Infra CSA Manager: Certification in the following technologies preferred: Cloud, mobile, web application development, cloud-native application architecture (i.e. containers, microservices, API management), modern software development techniques like DevOps and CI/CD tool chains (i.e. Jenkins, Spinnaker, Azure developer services, GitHub) and container orchestration systems (i.e. Docker, Kubernetes, Cloud Foundry, Azure Kubernetes Service, GitHub).\n• Data and AI Managers: Certification in one or more of the following technologies preferred: Cloud, mobile, Database, Big Data, BI, Data Science, Machine Learning, Artificial Intelligence\n\nExperiences\n• Prior work experience in other software and/or services companies such as Amazon, VMware, Google, IBM, Oracle desired\n\nMicrosoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form.\n\nBenefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work.\n\n#customersuccess", "extensions": ["10 days ago", "Full–time"], "detected_extensions": {"posted_at": "10 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDbG91ZCBTb2x1dGlvbiBBcmNoaXRlY3QgTWFuYWdlciIsImNvbXBhbnlfbmFtZSI6Ik1pY3Jvc29mdCIsImNvbXBhbnlfbWlkIjoiL20vMDRzdjQiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiI1SlN4MU9ZX3RDSEhoV05QQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VTFoVGRIQmtTR2x0YkdOa1UzaHdWVmhIYms4d1pFTkhjamQzVlRsMVVESXhWR3Q0TWtWeGNVaHhZalp0UnpoQmFsQTJaVTQwVkdOUlFtNHpWbTQ0TFMxT1JFUnJWMDh5ZDFWNFUzbFhOV0ZTYTFOTFVVWk5iMng1TjBjNVRIVm5SMGRLV0RSWFptWlhhM0Y2Tm1SdGJtUnBhbWRPUjJoUk0zWjNiMnBsUlRCbWJWTlFkR1pUWkVSYWJWcGxWR3hVVERCNVdVUnRNek5MY0daUkVoWTFNelpEV1U1TVFrdHdWeTEwUVdGNWJrbFlaMEZSR2lKQlQwMVpVbmRDY25CT1ltUnhabGxHVjFoU1UyNTFhMlZSWmtWNU5IQnJkRkJuIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL3NnLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvY2xvdWQtc29sdXRpb24tYXJjaGl0ZWN0LW1hbmFnZXItYXQtbWljcm9zb2Z0LTI0ODYyMTk1NDc/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Sr. Partner Solutions Architect, Red Hat", "company_name": "Amazon", "location": "Singapore", "via": "via LinkedIn", "description": "Job Description\n\nRed Hat and AWS have long-standing relationships supporting customers running Red Hat mission critical applications on AWS.\n\nAWS is looking for a Sr. Partner Solutions Architect in North America who will work closely with Red Hat Solutions Architects, sales, and senior executives of SI Partners in the AWS ecosystem to help our customers with Red Hat container and application workloads such as OpenShift, RHEL, JBoss etc.\n\nAs a Sr. Partner Solutions Architect you will be primarily responsible for architecting technical solutions with the Red Hat field teams and enabling the AWS SI ecosystem to do the same at scale. Candidate will have existing experience with Red Hat software including RHEL, JBoss, and OpenShift, on public clouds. You will lead in developing and executing annual strategic plans, building executive relationships, running monthly and quarterly pipeline reviews with Red Hat fields and key SI Partners and ensure that the IBM AWS partnership is proceeding to... its respective goals in an effective timely fashion.\n\nYou will also have the opportunity to write blogs, whitepapers, reference architectures, deliver webinars, and speak at events to demonstrate technical thought leadership and accelerate joint sales. You will get the opportunity to work directly with senior engineers with customers, partners, and AWS service teams.\n\nExperience working directly with customers and account teams is required. Up to 30% domestic travel is required.\n\nLocations: Singapore\n\nBasic Qualifications\n• 5+ years customer-facing experience interfacing with senior technical roles at large companies managing workloads on Red Hat based systems and middleware in a distributed environment\n• Hands-on experience administering and using Red Hat OpenShift and Red Hat CoreOS\n• Deep understanding of Kubernetes and familiarity with container orchestration ecosystem\n• Experience architecting 12 factor apps and modern micro-service based applications running on public and hybrid cloud\n• Red Hat packaging and container build experience\n• Public facing examples of technical writing\n\nPreferred Qualifications\n• 7+ years of sales experience at a global technology company and experience working with large SIs and Red hat SI ecosystem\n• Demonstrated experience working and communicating with multiple stakeholders and cross- functional teams including direct and channel marketing, business development teams, product management and account management teams.\n• Experience with AWS cloud architecture and AWS Certified Solution Architect\n• Knowledge of Chef, Puppet, Ansible, SaltStack, CloudFormation, or Terraform for configuration management\n• Strong practical Linux, storage, middle-ware, and container systems administration skills in the cloud\n• Knowledge of IP networking at scale, firewall and VPN architectures, DNS, and service delivery through load balancing techniques\n• Troubleshooting skills in multiple popular languages, e.g. Python, Bash, Golang, C, and Java\n\nJob Description : Red Hat and AWS have long-standing relationships supporting customers running Red Hat mission critical applications on AWS. AWS is looking for a Sr. Partner Solutions Architect in North America who will work closely with Red Hat So\n\nExperience: 5.00-8.00 Years", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTci4gUGFydG5lciBTb2x1dGlvbnMgQXJjaGl0ZWN0LCBSZWQgSGF0IiwiY29tcGFueV9uYW1lIjoiQW1hem9uIiwiY29tcGFueV9taWQiOiIvbS8wbWdrZyIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjUzczhyVldMVGoyVmdNZWZBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVzc0JDb3dCUVU1VlgwNXhVMWRKV1VjMVNuazNTR1J2T1d0ZlZEbGxaMlpzYkdKb2VuTTVUMlpMVDFwZlpsZDRSRE40TkcxWloybDBRa05sT1V4VlMzTXllakJLTW5sRVRGUlFNM1IwVkdGT1RIVkpXRnBYWjFaSlZIcFdlbkZXVEZSd2EwcHhXbmREU2tOR1FUTm1hRXRDWmpCbFRraENWMlZXWWxaS1ZrVnRjMmt4TlVWdFlrdEJhbEY2VjJSWlZHRVNGalV6TmtOWlRreENTM0JYTFhSQllYbHVTVmhuUVZFYUlrRlBUVmxTZDBOUWVrcDNSRWhGTWpKWGJYZFRZVFpIUzBkd1p5MWpkREJvY2xFIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMTUiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGlua2VkSW4iLCJsaW5rIjoiaHR0cHM6Ly9zZy5saW5rZWRpbi5jb20vam9icy92aWV3L3NyLXBhcnRuZXItc29sdXRpb25zLWFyY2hpdGVjdC1yZWQtaGF0LWF0LWFtYXpvbi0yNDU5MTU2MjEwP3JlZklkPTQxZTY3ZDBjLTljOWQtNGQ0Yy1hMWViLWE4M2ZiMjViMTJmZlx1MDAyNnRyYWNraW5nSWQ9T0M0UHl5aW15ZEgyYUFXbFFrVXg5QSUzRCUzRFx1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Database Partner Solutions Architect", "company_name": "Amazon", "location": "Singapore", "via": "via LinkedIn", "description": "Job Description\n\nAre you passionate about databases and helping businesses transform using the cloud? We're looking for a technical advisor to support Software Vendors and Consulting Partners in ASEAN/India.\n\nAbout Amazon Web Services\n\nAt Amazon, our vision is to be earth's most customer-centric company. In 2006, we launched Amazon Web Services, giving customers access to the same cloud technology we built to serve millions of shoppers on Amazon.com. Amazon Web Services (AWS) is a secure cloud services platform, offering computing power, database storage, content delivery, and other functionality to help businesses scale and grow.\n\nRoles and Responsibilities\n\nAs a Partner Solutions Architect you'll help build an ecosystem of consulting partners for our database services. This involves engaging with top tier technology companies to integrate AWS database services into their solutions. In this hands on, technical position for you'll dive deep into a variety of complex problems. As a... crafter of scalable architectures, you'll help customers build optimized solutions that can scale to deliver outcomes for multiple customers.\n\nDay to day you'll help companies understand and build complex database architectures. This involves working closely with our Partner Management teams to help partners build in AWS and chose AWS as their preferred platform. Shaping and delivering a strategy to accelerate use of AWS database solutions is a key part of the role.\n\nYou will own the technical engagement with partners and their ultimate success. This includes implementation projects, developing a deep expertise in the AWS technologies. Additionally, you'll develop a broad know-how around how our services are constructed. As a trusted advisor, you'll represent Amazon and partner capability within a customer's environment and drive discussions with executives and technology leaders.\n• Ensure success in building and migrating applications, software and services on the AWS platform\n• Educate customers/partners of all s on the value proposition of AWS\n• Participate in deep architectural discussions to ensure solutions are designed for successful deployment in the cloud.\n• Conduct one-to-few and one-to-many training sessions to transfer knowledge to customers considering or already using AWS.\n• Capture and share best-practice knowledge amongst the AWS solutions architect community.\n• Author or otherwise contribute to AWS customer-facing publications such as whitepapers, blogs.\n• Nurture relationships with within partners, enabling them to become cloud advocates.\n• Act as a technical liaison between service engineering team, support team and our partners\n\nCulture\n\nAt Amazon Web Services we don't mind being called \"peculiar.\" We have our own way of doing things. We're obsessed with customers, we see beauty in simplifying the complex, and we're comfortable being misunderstood. That might sound unorthodox, but our unusual approach and our culture - focused on removing obstacles so builders can build - are part of why our people enjoy working in AWS.\n\nYou will be supported in your career development here at AWS. This includes building your technical consulting and leadership skills. We're passionate about supporting the needs of our people and their family. Benefits include Medical Cover, Employee Assistance Programs and Global Mobility opportunities. This also includes access to mentorship opportunities.\n\nBasic Qualifications\n• Experience in a similar role as a Solutions Architect, Cloud Architect, Technical Consultant, Technical Lead, Software Architect, Engineering Lead, Sales Engineer, Database Administrator (DBA) etc.\n• Experience working with relational database solutions with architecture level knowledge\n• Knowledge of with one or more of following: - Amazon Aurora, RDS Oracle DB, MS SQL Server, MySQL, or PostgreSQL.\n• Experience building solutions that run in virtualized environments.\n• Demonstrated ability to influence CxO level executives\n• Experience with large application migration or modernisation projects\n\nPreferred Qualifications\n• Experience with non-relational databases, such as columnar data stores, NoSQL, and graph databases\n• AWS implementation or consulting experience\n• AWS Professional Certification\n\nJob Description : Are you passionate about databases and helping businesses transform using the cloud? We're looking for a technical advisor to support Software Vendors and Consulting Partners in ASEAN/India. About Amazon Web Services At Amazon, ou\n\nExperience: 0.00-50.00 Years", "extensions": ["13 days ago", "Full–time"], "detected_extensions": {"posted_at": "13 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEYXRhYmFzZSBQYXJ0bmVyIFNvbHV0aW9ucyBBcmNoaXRlY3QiLCJjb21wYW55X25hbWUiOiJBbWF6b24iLCJjb21wYW55X21pZCI6Ii9tLzBtZ2tnIiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoia0YzX1V3X0Z1NUZoMGdpTEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXNzQkNvd0JRVTVWWDA1eFVYVXhXVlpaTFZoYU9WUmlYMkZwUVhkWVJIRm9SRFoxYUhwamVrVm1RVFJRUjFvNGRFdFpNVzgxVkV4eE9YaEZSMkYxWVdRd01GVk5XVUp1VUdZNFdVdGFUakZDZUdWWmEyZFJZbVpGUVhka2FsaERablV0ZVRjNFNWOW1URlJXZVhNd2IxVnhYMkpaTkZGNFlXTkpka3hsU0VKSWFGWnliRlpCUkRCVVZUVlZTbWRhYTJzU0ZqVXpOa05aVGt4Q1MzQlhMWFJCWVhsdVNWaG5RVkVhSWtGUFRWbFNkMFI0TFdobGVFY3dRMU16U1VOdVdsVlBXR05pTm5SVk1VZHBSa0UiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18yMyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL3NnLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvZGF0YWJhc2UtcGFydG5lci1zb2x1dGlvbnMtYXJjaGl0ZWN0LWF0LWFtYXpvbi0yNDk3MTU5ODA2P3JlZklkPWRjZmQ0MjdmLTU1NzAtNGJiNi1iOGI1LTI2OGQ3NzdkMjU2ZFx1MDAyNnRyYWNraW5nSWQ9OUE1NkdXYVVFQU9QeUtQZHlIRTJLUSUzRCUzRFx1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Lead Architect, Solution Management", "company_name": "SingTel", "location": "Singapore", "via": "via LinkedIn", "description": "Job Description\n\nThe Sales Solution Architect analyses, designs and develops roadmaps and implementation plans based on a current versus future state solutions architecture. He/she leads and facilitates the solution architecture governance processes based on the governance structure and manages exceptions to architectural standards at a solutions level. He/she assesses near-term needs to establish business priorities, analyses and develop solutions architectural requirements, and ensures alignment of architectural requirements with the IT strategy. He/she analyses the current architecture to identify weaknesses and identifies opportunities for improvement and performs ongoing architecture quality review activities.\nHe/she works in a dynamic and evolving business environment. He/she is expected to be familiar with a range of industry architectural methodologies and frameworks, architecture modelling tools, as well as product development methodologies. He/she ought to be passionate in... keeping abreast with the latest technological developments.\nHe/she collaborates with other departments on architecting solutions design and integrating diverse needs and perspectives to develop fresh ideas and solutions. He/she possesses strong leadership and communication abilities, is creative and innovative in nature, and is able to influence key stakeholders.\n\nKey Responsibilities\n• Render presales technical support to client service teams\n• Analyse tender / client specifications or requirements and manage the plan for multiple solution workstreams\n• Drive and maintain conceptual integrity of the solution design that addresses client's business objectives and needs in order to create differentiated value propositions\n• Coordinate and prepare solution deliverables (e.g., costs, risk and proposal) that are subject to internal solution governance and review processes\n• Ensure the architecture and design is agreed with both internal stakeholders and external customers, while collaborating deeply with the practices to develop solutions that are on the mark and viable\n• Maintain a clear, independent and objective point of view in order to exercise thought leadership and advise senior leaders on technical value and solution guidance for client, organization and community\n• Ensure all the appropriate standards and quality expectation are adhered to\n• Develop and refine solution patterns for common and recurring problems\n• Be the expert resource to support interventions on projects where solution quality or progress has become an issue\n\nThe ideal profile for Application / Cloud Specialist should have / be:\n• University Degree in Engineering, Computer Science, Computer Engineering or equivalent\n• Minimum 10 yrs of experience either as pre-sales architect or as solution/enterprise architect in a System Integration (SI) environment\n• Certifications in ITIL, TOGAF and Cloud (e.g., AWS Certified Cloud Practitioner) would be advantageous\n• Experience in enterprise architecture, Service Oriented Architecture, microservices, containerization, API and modern integration methodologies (e.g. Kafka)\n• Experience in Digital capabilities, Data Architecture and Cloud-based Architecture\n• Experienced in delivering highly integrated and multi-platform solutions\n• Experience with the full software development life-cycle using traditional and agile methodologies\n• Working knowledge of DevSecOps, CI/CD and automation technologies\n• Excellent interpersonal and communication skills – ability to explain technology from a customer perspective\n• Highly analytical and able to manage complex solutions\n• Naturally inquisitive – asks questions to ensure understanding\n• Ability to influence and negotiate\n• Confident decision maker\n• Strong presentation Skills\n• Highly resilient and team player – demonstrated ability to work with multiple stakeholders to deliver a common goal\nApply today if you would like to be part of the winning team that does great work!\n#NCSlife\nJob Description : The Sales Solution Architect analyses, designs and develops roadmaps and implementation plans based on a current versus future state solutions architecture. He/she leads and facilitates the solution architecture governance process\n\nSkills: Lead Architect, Solution Management\n\nExperience: 10.00-13.00 Years", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJMZWFkIEFyY2hpdGVjdCwgU29sdXRpb24gTWFuYWdlbWVudCIsImNvbXBhbnlfbmFtZSI6IlNpbmdUZWwiLCJjb21wYW55X21pZCI6Ii9tLzAyMHpmbCIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6InpXMXIwcldtNmRZMk5Ma2lBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVzc0JDb3dCUVU1VlgwNXhVa3RDZEVSbFZYWk5UakoxZW5GbVRUSkJkRTl2Vm0wM01tTkRZa3N3UlVKME5FTklOV3gyYldOSVdYaEVNemh1VTNwSVZHRTVUWGx2T1dWcldITmhhRW94WkRsa2NGODRZVXRaUjFsbWRqWkhOR2xoVmtkV1VtSlNWRWd4WmxCWVlWOU1lRk5RWWxsek9GWnRPWE5UYjJob00yNVhWVGRyUVZCUlpFWmtiMWRzY0daRmJHRVNGalV6TmtOWlRreENTM0JYTFhSQllYbHVTVmhuUVZFYUlrRlBUVmxTZDBGeVgyNXFTRUp5VW1GR1YzYzBUVjlUWVZkaVlVRmZRV3RoVlVFIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMzEiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGlua2VkSW4iLCJsaW5rIjoiaHR0cHM6Ly9zZy5saW5rZWRpbi5jb20vam9icy92aWV3L2xlYWQtYXJjaGl0ZWN0LXNvbHV0aW9uLW1hbmFnZW1lbnQtYXQtc2luZ3RlbC0yNDc3MTg5NTM3P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}], "chips": [{"type": "Title", "param": "job_family_1", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Solution architect", "value": "solution architect"}, {"text": "Solutions architect", "value": "solutions architect"}, {"text": "Architect", "value": "architect"}, {"text": "Cloud architect", "value": "cloud architect"}, {"text": "Technical architect", "value": "technical architect"}, {"text": "Enterprise architect", "value": "enterprise architect"}, {"text": "Manager", "value": "manager"}, {"text": "Senior", "value": "senior"}, {"text": "Consultant", "value": "consultant"}, {"text": "Financial services", "value": "financial services"}, {"text": "Infrastructure architect", "value": "infrastructure architect"}, {"text": "Application architect", "value": "application architect"}, {"text": "Cloud engineer", "value": "cloud engineer"}, {"text": "It architect", "value": "it architect"}, {"text": "Lead architect", "value": "lead architect"}, {"text": "Network architect", "value": "network architect"}, {"text": "Security architect", "value": "security architect"}, {"text": "Senior architect", "value": "senior architect"}, {"text": "Systems engineer", "value": "systems engineer"}, {"text": "Associate director", "value": "associate director"}, {"text": "Deputy", "value": "deputy"}, {"text": "Engineers", "value": "engineers"}, {"text": "Head", "value": "head"}, {"text": "Infrastructure", "value": "infrastructure"}, {"text": "Lab", "value": "lab"}, {"text": "Network engineer", "value": "network engineer"}, {"text": "Presales consultant", "value": "presales consultant"}, {"text": "Public sector", "value": "public sector"}, {"text": "Senior analyst", "value": "senior analyst"}, {"text": "Senior consultant", "value": "senior consultant"}, {"text": "Senior director", "value": "senior director"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Software architect", "value": "software architect"}, {"text": "Solution consultant", "value": "solution consultant"}, {"text": "System administrator", "value": "system administrator"}, {"text": "System architect", "value": "system architect"}, {"text": "System engineer", "value": "system engineer"}, {"text": "Systems analyst", "value": "systems analyst"}, {"text": "Systems architect", "value": "systems architect"}, {"text": "Technical trainer", "value": "technical trainer"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Accounting", "value": "/business/naics2007/5412"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Management", "value": "/business/naics2007/55"}, {"text": "Real Estate", "value": "/business/naics2007/53"}, {"text": "Wholesale", "value": "/business/naics2007/42"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Amazon", "value": "/m/0mgkg"}, {"text": "Microsoft", "value": "/m/04sv4"}, {"text": "EPAM Systems", "value": "/m/0dlnrc"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "IBM", "value": "/m/03sc8"}, {"text": "Salesforce", "value": "/m/07btr5"}, {"text": "EY", "value": "/m/0g9jc"}, {"text": "Publicis Sapient", "value": "/m/02myjp"}, {"text": "Randstad", "value": "/m/08pt1z"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Alibaba Group Holding Limited", "value": "/m/07s6ctl"}, {"text": "Avanade", "value": "/m/094456"}, {"text": "Capgemini", "value": "/m/03vlk0"}, {"text": "Comtel Solutions Pte Ltd", "value": "/g/11dxpztgnb"}, {"text": "DELL", "value": "/g/11c54ch2jm"}, {"text": "Ericsson", "value": "/m/02kyh"}, {"text": "HTZ Resources", "value": "/g/11h21p9b4d"}, {"text": "Infinite Computer Solutions Pte Ltd", "value": "/g/11g9mj72yz"}, {"text": "Michael Page", "value": "/m/04cxldw"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "Orange Business Services", "value": "/m/08zvyz"}, {"text": "Recruitment Hub Asia Pte Ltd", "value": "/g/11dxpww_0f"}, {"text": "TEKsystems (Allegis Group Singapore Pte Ltd)", "value": "/g/11b6g4bkv0"}, {"text": "Talent Trader Group Pte Ltd", "value": "/g/11dxpmlc5b"}, {"text": "Tata Consultancy Services", "value": "/m/01psx8"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "Verizon", "value": "/m/07_dn"}, {"text": "A-Speed Infotech Pte Ltd", "value": "/g/11g9mxswl4"}, {"text": "ABeam Consulting", "value": "/g/11bc6whr_f"}, {"text": "Amazon Web Services (AWS)", "value": "/g/11dxprr2xv"}, {"text": "Amazon Web Services Singapore", "value": "/m/0rznzt1"}, {"text": "Aon", "value": "/m/0z7n"}, {"text": "Avaya", "value": "/m/01sqlk"}, {"text": "Azendian Solutions Pte Ltd", "value": "/g/11dxpvcjj2"}, {"text": "Big Cloud", "value": "/g/11c743lwsr"}]}]}