{"search_metadata": {"id": "60827a0d3d69193099e48772", "status": "Success", "json_endpoint": "https://serpapi.com/searches/abb8062a7fba6984/60827a0d3d69193099e48772.json", "created_at": "2021-04-23 07:41:01 UTC", "processed_at": "2021-04-23 07:41:01 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28data+analyst%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=90", "raw_html_file": "https://serpapi.com/searches/abb8062a7fba6984/60827a0d3d69193099e48772.html", "total_time_taken": 1.67}, "search_parameters": {"q": "(data analyst) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "90"}, "jobs_results": [{"title": "Data Analytic, BA&I IBOR Transition Team", "company_name": "ClearanceJobs", "location": "Singapore", "via": "via LinkedIn", "description": "About Standard Chartered\n\nWe are a leading international bank focused on helping people and companies prosper across Asia, Africa and the Middle East.\n\nTo us, good performance is about much more than turning a profit. It's about showing how you embody our valued behaviours - do the right thing, better together and never settle - as well as our brand promise, Here for good.\n\nWe're committed to promoting equality in the workplace and creating an inclusive and flexible culture - one where everyone can realise their full potential and make a positive contribution to our organisation. This in turn helps us to provide better support to our broad client base.\n\nThe Role Responsibilities\n\nBusiness\n• The IBOR transition is a key strategic project Bank wide, out team the - Analytic and Business Insight team, ensure the production and delivery of quality IBOR transition data for Senior management for key decision making prioritisation and risk management. As well our team delivers regulatory... reporting to the PRA and local regulators worldwide. The role in question will support the team delivery.\nProcesses\nShare Responsibility\n• The Role holder will partly engage key stakeholders across divisions on MI requests around the IBOR transition project, and as part of our overall process will apply data cleansing strategies to enrich the source data for a better analytics and insight for the business and client outreach.\n• As part of the Data quality Assessment and Remediation process Identify critical data quality issues that would impact downstream reporting by:\n• Perform data/ database reconciliations and committee presentations generation, provide in-depth analysis, and succinct explanations of results obtained to key business stakeholders\n• Collaborate and provide day-to-day support to all relevant business units, Group Finance, Treasury, Operation\n• Engage stakeholders to raise the bar on quality delivery, collaboration and innovation.\nRisk Management\n• Keep track of emerging regulatory expectations in terms of IBOR transition and evaluate the present state of infrastructure and processes of the organization against this. Data Strategy, Architecture and Transformation to derive the data strategy roadmap\n• Defines data requirements and performs data inventory analysis to qualify risk issues in data sources and attributes\n• Training and communications efforts by the IBOR Central Team.\nGovernance\nCoordinate with Business and Functional leads and update the programme central team on any key issues and Risk\n• Ensure information is correctly communicated and where necessary issue are escalated to management in a timely manner\n• Share ideas and best practice information with colleagues. Thinks beyond current boundaries of the role and contributes ideas.\nRegulatory & Business Conduct\n• Display exemplary conduct and live by the Group's Values and Code of Conduct.\n• Take personal responsibility for embedding the highest standards of ethics, including regulatory and business conduct, across Standard Chartered Bank. This includes understanding and ensuring compliance with, in letter and spirit, all applicable laws, regulations, guidelines and the Group Code of Conduct.\n• Lead to achieve the outcomes set out in the Bank's Conduct Principles: Fair Outcomes for Clients; Effective Financial Markets; Financial Crime Compliance; The Right Environment.\n• Effectively and collaboratively identify, escalate, mitigate and resolve risk, conduct and compliance matters.\nKey Stakeholders\nGB/CB/Lending/CF/Loan Syndication/Agency Business/FM Stream Leads\n• Group and Country Business Heads, COOs and their representatives\n• IBOR Project Managers supporting the workstreams\n• Functions stakeholders - Legal, Compliance, Operational Risk. Finance, IMO, GLS etc\n• The broader IBOR Programme team.\nOther Responsibilities\n• Leverage the opportunity provided by Corporate Social Responsibility to enhance the Group's internal and external reputation and indirectly influence the bottom line.\n• Promote the Group's brand and Here for good with clients and regulators.\n• Perform other responsibilities assigned under Group, Country, Business or Functional policies and procedures.\n• Maintain effective communication with key stakeholders and staff.\nOur Ideal Candidate\n\nAdditional Qualifications\n\nThe candidate must be a self-motivated, proactive and resourceful with an excellent network with ability to work in a fast-paced environment against an uncertain regulatory back-drop.\n• Data analytics, Interested Rate Products.\n• Banking domain involving one or more of the following: Product Control, Market Risk, Middle Office, Data\n• Good knowledge of Rate products\n• Experience in implementation of projects ideally through multi-country operations teams\n• Experience as the key liaison with stakeholders to define and execute processes - BAU and Change\n• Experience in software design and development\n• CFA, FRM or CQF certification will be consider a plus\n• stakeholder management skills, able to converse in appropriate levels of detail with Business Heads, COOs/CIOs, Frontline, Middle Office/Operations Risk, Legal & Compliance (L&C), etc.\n• Desirable Experience in any of the following : SAS, SQL, Python, R, VBA, Tableau and MSTR.\n• R Exp & Python Exp is Preferred\n• Bank Exp in Risk/Product Control Preferred\n• Min 3 yrs overall exp preferred.\nI ntrinsic traits\n• Attention to detail\n• Curiosity\n• High degree of responsibility\n• Self-motivated, and works well in teams\n• Very structured and very disciplined\n• Good written and verbal communication skills\n• Able to challenge/ question\n\nApply now to join the Bank for those with big career ambitions.\n\nTo view information on our benefits including our flexible working please visit our career pages . We welcome conversations on flexible working", "extensions": ["7 days ago", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEYXRhIEFuYWx5dGljLCBCQVx1MDAyNkkgSUJPUiBUcmFuc2l0aW9uIFRlYW0iLCJjb21wYW55X25hbWUiOiJDbGVhcmFuY2VKb2JzIiwiY29tcGFueV9taWQiOiIvZy8xMWZ5MXBmdDl2IiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiTlE3aFlEelNwOW5KWnpxM0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVJQkNxSUJRVTVWWDA1eFZHdHZUVEZZZVZsdlNYaFVjMmRaVWs0MGEydGpkekp3WkZKSmVtWlpWMXB0WXpsNFNVUm5aVTVXTWpjdGNFOHhNemhwVFU1RWRXdzNXWEpxZW5WalNXUnVMVzlMUWxwWlJYQlBhRmxGUW14S1JGUjZZVjlwYVhGV1NGZzJlRFp3Y1U5cU1IQXdaemg2Y1hvek5tRmhVRTVWTFRFNU1qZ3RVRWhzVWxKaVEyNURVbVV4UzBWbVRsQjBNRVF6VG5ONGNWODFiaTFhU0U5aU4wRlJFaGRFYm5GRFdVOUVMVUkyYlZBNVVIZFFOVGRITTNOQmF4b2lRVTlOV1ZKM1F6Wm5iRVZKWkMxcU5uUnpPWFZVWVRsc1dHbHZiM1Z5VWsxVFVRIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL3NnLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvZGF0YS1hbmFseXRpYy1iYS1pLWlib3ItdHJhbnNpdGlvbi10ZWFtLWF0LWNsZWFyYW5jZWpvYnMtMjUwNzExMzc3MT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Data Analyst - Up to - 6000 - VBA - SQL Scripting is a MUST - Healthcare Industry", "company_name": "BeathChapman Pte Ltd", "location": "Singapore", "via": "via Monster", "description": "Job Details\n• Up to $6000, Permanent Role with AWS and Variable Bonus\n• Healthcare Industry\n• West near MRT stations\n• Strong Experiences in SQL Scripting and Excel Visual Basic Programming\n• Experiences in BI tools and Data Visualization Tool eg Tableau is added advantages\n\nResponsibilities\n• Respond to data requests from internal and external stakeholders\n• Work closely with the relevant stakeholders to understand and agree the reporting specification format required from the business\n• Design and develop interactive dashboards or Pivot reports if needed\n• Ensure automation for regularly-tracked reports and dashboards\n• Assist researchers in identifying feasible data analytics solutions (data availability, relevancy etc.)\n• Provide data support for the research project.\n• Evaluate data management, data quality and data gaps and provide recommendations for improvement\nRequirements:\n• Experiences in writing SQL Script\n• Good understanding related to data structure\n• Strong knowledge... on principles of data analysis and data profilling\n• Strong analytical and communication skills\n• Experiences in use of BI tools (Oracle OBIEE) is added advantages\n• Experiences in data visualisation tools eg Tabeau is added advantages\n• Only SIngaporean may apply\nInterested candidates can forward their CVs in MS Word format to [Confidential Information]\nReg No. R1983718\nEBC Connect Pte Ltd\nLicence no. 17C8975", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEYXRhIEFuYWx5c3QgLSBVcCB0byAtIDYwMDAgLSBWQkEgLSBTUUwgU2NyaXB0aW5nIGlzIGEgTVVTVCAtIEhlYWx0aGNhcmUgSW5kdXN0cnkiLCJjb21wYW55X25hbWUiOiJCZWF0aENoYXBtYW4gUHRlIEx0ZCIsImNvbXBhbnlfbWlkIjoiL2cvMTFmMDFiM3kyYyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Ik00V00zQ0pRMEx0cVJtZF9BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2Y0JDcmNCUVU1VlgwNXhVVEI0TkdGRFltY3hla05uYkZCb1JtVkZhR2c0WTNaZmQybzVWM1JXU1doSlluaEtSVkpqUm1GWFNFczBObXRaVjJ3MGFrbzRZMHRwUTI1RlRqUXRUMVpQVTFCSU5tMXRRM1l5U0VOcFZFNUhWVFJ0YTNaQ1oxOVdjRE50T1dwZlZVVXpNbVIyZFRoblVHTldOVFI2T1dsaWNuUnpVbXh4ZURkcE5sRlJZV3MyUW5WNVNsUm1TR3hEU1hCTWExUlBjbGgwWDBSYUxXMTNNVkZKVlZsTFR6bFhia1ZJVjFwQlNHbzNlRjlWY214WkVoZEVibkZEV1U5RUxVSTJiVkE1VUhkUU5UZEhNM05CYXhvaVFVOU5XVkozUWxCWE1VNDVUMjV0VEVsbWRHWTFXR3gwU21scVJWTkpaRWRZZHciLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18xNCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNb25zdGVyIiwibGluayI6Imh0dHBzOi8vd3d3Lm1vbnN0ZXIuY29tLnNnL2FtcC9qb2ItdmFjYW5jeS1kYXRhLWFuYWx5c3QtdXAtdG8tNjAwMC12YmEtc3FsLXNjcmlwdGluZy1pcy1hLW11c3QtaGVhbHRoY2FyZS1pbmR1c3RyeS1iZWF0aGNoYXBtYW4tcHRlLWx0ZC1zaW5nYXBvcmUtMjcwNzA5NTkuaHRtbD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Associate, Data Analyst, Credit Portfolio Management, Consumer Banking, RIsk Management Group", "company_name": "DBS Bank Limited", "location": "Singapore", "via": "via Laimoon.com", "description": "Business Function\n\nRisk Management Group works closely with our business partners to manage the bank's risk exposure by balancing its objective to maximise returns against an acceptable risk profile. We partner with origination teams to provide financing, investments and hedging opportunities to our customers. To manage risk effectively and run a successful business, we invest significantly in our people and infrastructure.\n\nJob Purpose\n• Design & manage MIS & data analytics to manage portfolio quality through the credit cycle\n• Cultivate & maintain a consistent consumer credit culture in the Bank to ensure compliance with internal controls and regulatory standards\n\nKey Accountabilities\n• Manage portfolio quality and credit risk through use in-depth portfolio analysis of consumer lending products to assess risk & opportunities and validate and refine various credit policies/processes through use of analytics.\n• Support new business initiatives through use of data analytics to develop... and propose credit risk strategies for consumer credit portfolios to optimize growth and profitability within risk appetite.\n• Keep abreast on latest technology changes such as data analytics and artificial intelligence that can be applied to credit risk management.\n• Collaborate widely with other stakeholders in the Bank in key digital initiatives.\n\nJob Duties & responsibilities\n• Work in close collaboration with the Credit Policy team to:\n• Support new Business initiatives & proposals for incorporation into product programs\n• Engage Business partners in regular asset quality reviews with provision of analytics insights to identify risks/ opportunities and recommend relevant actions\n• Support review of credit policies and program risk acceptance criteria regularly, with analytical insights of portfolio trends & performance\n• Drive portfolio management initiatives through the credit cycle management framework by jointly working in partnership with product managers, credit approval team, credit operations team and collection team\n• Monitor key portfolio performance trends to ensure strong portfolio credit quality with a good balance of risk and reward to optimize Business opportunities and in line with business strategy and risk appetite.\n• Assist in establishing key portfolio performance measurements to monitor portfolio performance, test programs evaluations; and uncover insights and areas for improvements.\n• Support scorecard monitoring and analysis; involve in the scorecard development as well as validation of the score cut-off.\n• Participate in digital initiatives and drive continuous improvements in analytics capabilities using both traditional and non-traditional data as well as enhancements in the use of risk analytics tools.\n• Identify opportunities for continuous improvements and digitization of credit processes.\n• Support platform conversion initiative; involve in code translation from SAS to Python.\n\nRequirements\n• Bachelor Degree holder with at least 5 - 6 years of exposure in consumer credit & lending, preferably covering both secured and unsecured lending with strong data analytics skill and ability.\n• Possess strong portfolio and analytical skills with demonstrated ability to conceptualize and clearly communicate the analytical findings, both in writing and verbally.\n• Decisive and solution focused. Possess strong analytical skills with the ability to collect, organize and analyze significant amount of information with attention to detail and accuracy.\n• Competent in the use of SAS and Python as well as MS Office tools (Word, Excel, Powerpoint, Access).\n• Experience in dashboarding tools like Power BI, Tableau or Qlikview preferred.\n• Able to analyse risk-reward dynamics of consumer products with use of data-driven analytics\n• Good understanding of the mechanics and usage of statistical models/ scorecards for consumer products\n• Good grasp of credit fundamentals in consumer lending\n• Able to engage cross-functional team to work on tasks\n• Maintain close collaborative relationship across teams with sharing of ideas and joint initiatives.\n• Work closely with Business and Credit Policy team to develop competitive product features to acquire business by taking appropriate risk to maximise returns.\n• Work closely with all key stakeholders in the credit cycle to ensure smooth end to end process.\n• Demonstrated ability to synergise, prioritise and drive results with a sense of urgency\n• Team-player and good interpersonal skills\n• Self-motivated with a strong inquisitive mindset and quest for learning\n\nApply Now\n\nWe offer a competitive salary and benefits package and the professional advantages of a dynamic environment that supports your development and recognises your achievements. Risk Management", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBc3NvY2lhdGUsIERhdGEgQW5hbHlzdCwgQ3JlZGl0IFBvcnRmb2xpbyBNYW5hZ2VtZW50LCBDb25zdW1lciBCYW5raW5nLCBSSXNrIE1hbmFnZW1lbnQgR3JvdXAiLCJjb21wYW55X25hbWUiOiJEQlMgQmFuayBMaW1pdGVkIiwiY29tcGFueV9taWQiOiIvbS8wMXE3bjUiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiIwTUhnbTd4TzNqeXRWYXg4QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdmNCQ3JjQlFVNVZYMDV4VkdSdVYwZFBYMVYzWVVkd09GSjZUSGxUUjFNMkxYUkpiazVpTlZCcE0yeHdWVXRuU21WRlpWVmljMk4xYjE5eVJ6TlJZazg0WkVaaGVVcDFUbEpIV0daS01FRnRhMVpMT1ZWQ1YzVXpla3gxWkZKUVVqUTVObmhqWHpSTGNYcHhkRVp5UldsbFVIQTBXamRTU0hCd04yVlpkWEZYTVVsTmFqUjBkbGRxWldGUVVFZFVhMFp5UzBrMVJrVmFNM3B5TWtGUVdUTnFNM1JEYmpZeVZHUkpNMDlhUTBneVFVYzNlV0psYjNweFNqbEZFaGRFYm5GRFdVOUVMVUkyYlZBNVVIZFFOVGRITTNOQmF4b2lRVTlOV1ZKM1FUUnFjSGMyVWtOdmFHdDBWMjFYZVUxQ1kybzRRazlHY1ZkYVp3IiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMjEiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGFpbW9vbi5jb20iLCJsaW5rIjoiaHR0cHM6Ly9qb2JzLmxhaW1vb24uY29tL2pvYnMvZXh0ZXJuYWx2aWV3LzI1OTg1ODc5P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Business Intelligence Business Analyst", "company_name": "None", "location": "Singapore", "via": "via Jobs", "description": "Job Scope: We are currently looking for an experienced BI Systems Business Analyst to support the delivery of a multi-million Data Mart project that will integrate various external and internal data sources and build a best-in-class data mart and data access self-service tool. Work directly with business users and stakeholders to understand the business needs and translate business requirements into detailed requirements documentation. Employ best practices during requirements gathering and documentation stages. Partner with the IT project manager to manage the data mart project phases/releases from initiation to completion. Manage stakeholder expectations and communications within and beyond functional track. Interacts regularly with senior management level stakeholders to provide periodical project status updates, raise risks and issues encountered in the project. Develop and communicate test strategy and test cases. Coordinate execution and validation of test cases with... stakeholders for user acceptance testing, training, and obtaining project signoffs. Coordinate defects clarification, triage, and resolution with IT team. Develop and actively maintain the data mart data dictionary. Job Requirements: Degree in data management, analytics, statistics, mathematics, or business management. Minimum of 3 years' experience in business analysis and requirements gathering and documentation. Strong knowledge and experience in industry standard project management practices. Strong knowledge of data warehouse modeling and business intelligence concepts (e.g., entity relationship diagramming, SQL querying, source to target mapping, etc.). Excellent visualization skills using Tableau, SiSense or other relevant visualization tools preferred. Advanced knowledge of Excel and SQL. Good Knowledge on CRM, ERP or Financial systems preferred. PMP certification is desirable", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJCdXNpbmVzcyBJbnRlbGxpZ2VuY2UgQnVzaW5lc3MgQW5hbHlzdCIsImNvbXBhbnlfbmFtZSI6Ik5vbmUiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6InBybjhsRmtORjZmbVo1NlNBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9icyIsImxpbmsiOiJodHRwczovL3NnLmZpZGFudG8uY29tL2pvYnMvam9iLW9wZW5pbmcvYnVzaW5lc3MtaW50ZWxsaWdlbmNlLWFuYWx5c3RzL2J1c2luZXNzLWludGVsbGlnZW5jZS1idXNpbmVzcy1hbmFseXN0LWNlbnRyYWwtc2luZ2Fwb3JlLTI3NTQzNzE0ND91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Data Analyst (#TeSA)", "company_name": "Singtel", "location": "Singapore", "via": "via LinkedIn", "description": "Job Description\n\nSingtel, Asia's leading communications technology group, provides an extensive range of telecommunications and digital services to millions of consumers and businesses across Asia, Australia, Africa and the USA. With over 140 years of innovation behind us, we continue to push boundaries in our networks and services, to enrich lives and transform businesses.\nOur core values – Customer Focus, Challenger Spirit, Teamwork, Integrity, and Personal Excellence – shape the way we work. We are passionate about making a difference and have an open and inclusive culture where everyone is empowered to do their best. Our diverse business means you will enjoy unique opportunities and rewarding experiences to learn and grow your career in a dynamic industry.\nJoin us and experience what it's like to be with an Employer of Choice*. Together, let's create a brighter digital future for all. *Awarded at the HR Fest Awards 2020\nThe role will have to work on the large volume of datasets... with the technical skill on Big Data Platform in data engineering, analytics and using programming or/and tools. The role will have to process the data and work on models to resolve complex business problems. Support business request in data preparation, ad-hoc data query, insight, building data engineering pipeline through system integration, as well as routine Business-As-Usual (BAU) support. He/she possesses a combination of data engineering, data analytical skills as well as experience with algorithms and coding. He/she gets to work with rich and diverse datasets,cutting edge technology, and you get to see the impact of your results in realbusiness and government decisions, which in turn provide positive socialbenefit for consumers at a large scale\nResponsibilities: Develop data flow, data transformation from data resource system into Big Data platform (Hadoop) Support continuous discovery, data transformation and refactoring towards algorithm build, focused demos and refinement Implement data processing application for data cleansing, mapping, transformation, logging Develop Data Integration workflows and load processes. Design, implement proof-of-concept solutions, create and deploy business intelligence using BI tool. Perform data analysis with the large volume of data for reporting and insights Work on Apache Airflow data pipeline and Apache NiFi Data flow management tool. Collaborate with different stakeholders from business, technical, project management and operation to design and implement the solution. Being a team play to work with different team members and co-operate with other cross functional teams. Ability to lead troubleshooting efforts for complex design and eliminate application issue. Contribute to and help define team best practices around report development, testing, access management, and dashboard refresh scheduling. Ensure best practices, frameworks and re-useable components are employed in the development project Understand Information Security standards, methodologies and practices. Trouble-shoot technical problems faced by the project and operation team.\nThe Ideal Candidate should have/be: Bachelor degree in Computer Science, Math, Data Analytics or related field with at least 2 years of hands-on development experience Certification in Data Engineering or Business Analytics Hands-on experience in Programming language including Java, Python, SQL, prefer to have experience in Big Data application and Linux shell scripting Experience in ETL, Big Data Management, Metadata Management and Data Cataloguing. Experience in data visualisation including effective communication, appropriate chart types, and best practices. Knowledge of Tableau suite or other visualisation/self-service BI tool to create thoughtful visualisation & visual analytics. Knowledge in Big Data Platform such as Hadoop, Cloudera, Hortonworks, etc Experience in Open Source like Apache Airflow, Apache NiFi, Zeppelin Notebook for Data Exploratory Analysis, etc Basic knowledge in Microsoft software e.g. Excel, Word and Power Points. Comfortable to work with technical and non-technical staff to explain concept and algorithms Good knowledge of the ICT trends, data communication and info-communication technology development Be independent and creative in problem solving Willing to work non-office hours and on 24 x 7 hours standby alert for ad-hoc faults on an occasional basis. Good communication skills Must be self-driven, energetic, highly conceptual and analytical coupled with proven business acumen to engage the businesses (internal) and customers (external) to deliver best results solutions for the businesses. Good writing skills in documentation\nWe believe in the strength of a vibrant, diverse and inclusive workforce where backgrounds, perspectives and life experiences of our people help us innovate and create strong connections with our customers. We strive to ensure all our people practices are non-discriminatory and provide a fair, performance-based work culture that is diverse, inclusive and collaborative", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEYXRhIEFuYWx5c3QgKCNUZVNBKSIsImNvbXBhbnlfbmFtZSI6IlNpbmd0ZWwiLCJjb21wYW55X21pZCI6Ii9tLzAyMHpmbCIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImhxS2V6YVd4T2YyOUJ1SHBBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVzd0JDb3dCUVU1VlgwNXhVbWsxZEZsUVYyOXNZemt6YzA5T1RsRXhOMjlEYUdGTVFXZFZVMU5VY1RkWWNsQjJkRWRNZEZWR01VeDNaM28yUW5wRE5VbHpZbXBYVEhac1l5MVdSMlpIYW5kcFlqVmFSbHBLU2xsWlJHRmZWRmRQYVc1VldUQTNTMGczV25sWWVrZGFXbFZuYldFelJERlBMWFEwTlhWbWIyNUNabGMwVTBwU1VHdFlOMkZFVVhrNFMzTVNGMFJ1Y1VOWlQwUXRRalp0VURsUWQxQTFOMGN6YzBGckdpSkJUMDFaVW5kQlppMVlXbXhUYTI1NlFucElNVVpJY21OTFRqQkhaSGt3TmtGUiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzMyIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExpbmtlZEluIiwibGluayI6Imh0dHBzOi8vc2cubGlua2VkaW4uY29tL2pvYnMvdmlldy9kYXRhLWFuYWx5c3QtJTIzdGVzYS1hdC1zaW5ndGVsLTI1MDcyOTU0NDA/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Senior Manager - HR Analytics", "company_name": "Sciente International Pte Ltd", "location": "Singapore (+1 other)", "via": "via Monster Singapore", "description": "Job Summary\nOur client is seeking for a meticulous Senior Manager with Human Resource - HR data analytics experience to work collaboratively with and through all levels to support and develop Human Resource - HR data products in the organisation.\nMandatory Skill-set\n• Degree in Information Technology, Computer Science or Engineering, or Business Analytics;\n• At least 9 years of experience in project managing and developing analytics systems with large enterprises;\n• Experience in data analytics projects related in Human Resource - HR Analytics or People Analytics;\n• Hands on experience in the execution of projects using data analytics and visualization software like Tableau;\n• Demonstrate good, in-depth knowledge in data infrastructure, data engineering, data operations and data governance;\n• Experience in building, leading and guiding data operations and data engineering teams;\n• Experience in production operations, leading teams performing systems automation and integration;\n•... Possess strong analytical skills and keen in process enhancement and operational efficiency;\n• Ability to work independently, manage stress and multi-task in a fast-paced environment;\n• Strong analytical, good eye for details, problem solving, writing and communication skills.\nDesired Skill-set\n• PMP / Agile Certifications;\n• Certification in data analytics / business intelligence tools.\nResponsibilities\n• Responsible for managing a team to develop enterprise grade data products to support Human Resource (HR) policy and operations;\n• Provide assistance to teams on the final products and operationalizing the policies;\n• In charge of implementing data infrastructure including data warehouse, analytics and visualisation platform;\n• Review the current existing solutions, do gap analysis, recommend suitable solutions and convince the senior stakeholders on the adoption;\n• Work with key partners to operationalise the data products to continuously improve the delivery processes;\n• Champion the data product adoption across the various business units and functional areas for the purpose of HR analytics strategy;\n• Develop and implement IT solutions to further organization-wide Human Resource (HR) sensemaking and analytics capabilities.\nShould you be interested in this career opportunity, please send in your updated resume to [Confidential Information] at the earliest.\nWhen you apply, you voluntarily consent to the disclosure, collection and use of your personal data for employment/recruitment and related purposes in accordance with the SCIENTE Group Privacy Policy, a copy of which is published at SCIENTE’s website (https://www.sciente.com/privacy-policy).\nConfidentiality is assured, and only shortlisted candidates will be notified for interviews.\nEA Licence No. 07C5639", "extensions": ["Over 1 month ago", "Contractor"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Contractor"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgTWFuYWdlciAtIEhSIEFuYWx5dGljcyIsImNvbXBhbnlfbmFtZSI6IlNjaWVudGUgSW50ZXJuYXRpb25hbCBQdGUgTHRkIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJtOXA4cWdJTXdGMHFoZWZhQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1vbnN0ZXIgU2luZ2Fwb3JlIiwibGluayI6Imh0dHBzOi8vd3d3Lm1vbnN0ZXIuY29tLnNnL2pvYi9zZW5pb3ItbWFuYWdlci1oci1hbmFseXRpY3Mtc2NpZW50ZS1pbnRlcm5hdGlvbmFsLXB0ZS1sdGQtc2luZ2Fwb3JlLTE2NzM3NzU/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Senior Business Systems Analyst", "company_name": "Xilinx Asia Pacific Pte. Ltd", "location": "Singapore (+1 other)", "via": "via Jobs", "description": "The Finance BI & Reporting Analyst will provide both functional support (business process and systems analysis, testing, user support and training) and light technical support (report and dashboard development, maintenance of Tableau views and hierarchies) to the Finance organization from Business Intelligence & Data Analytics perspective. As a key member of our Finance Infrastructure Team the Finance BI & Reporting Analyst will be a first point of contact for Finance BI report troubleshooting and development in our new Snowflake DW solution. Primary responsibilities The Finance BI & Reporting Analyst will work closely with key stakeholders across Finance and IT to deliver reporting and analytics capabilities that support our efforts to increase process efficiencies. Responsibilities include business analysis, requirements gathering, output and format evaluation, report creation and automation. In addition to helping to build new reports and automating existing manual and/or duplicate... reports, the Finance BI & Reporting Analyst will provide ongoing user support to the Finance organization, including reporting tools training and troubleshooting of BI reporting issues. Individuals will also be responsible for analyzing complex data models and building reports to generate business insights and satisfy evolving management requirements. Qualifications Desired skills and experience 3-5 years experience applying analytical techniques to solve real business problems Advanced Tableau skills are a must (preferably with Tableau certification) experience working with Snowflake or other cloud-based data sources is very desirable Ability to retrieve, manipulate, and analyze large datasets Strong interpersonal skills; must be able to effectively work with Finance and IT users and be able to drive projects and reporting improvements Excellent presentation, communication and social skills, with solid attention to detail Ability to comprehensively understand data elements, sources and relationships in business and technical terms Bachelor’s degree preferably in a quantitative field (finance/accounting/statistics/engineering). Additional Information Senior Executive Qualification Bachelor's Degree, Post Graduate Diploma, Professional Degree Xilinx (NASDAQ: XLNX) is the world’s leading provider of All Programmable FPGAs, SoCs, MPSoCs and 3D ICs, enabling the next generation of smarter, connected, and differentiated systems and networks. With over 3,500 patents and 60 industry firsts, Xilinx is known for its historic achievements including the introduction of the first FPGA and the inception of the fabless model. Recent innovations have transformed Xilinx from its programmable logic heritage to an ‘All Programmable’ company, including Vivado HLS C based synthesis, three SDx software defined development environments, new Zynq heterogeneous multi-processing SoCs (MPSoCs) and new UltraScale ASIC-class FPGAs and 3D ICs. Smarter Systems require more decision-making intelligence. Our customers use our products to bring Smarter Systems to life. Everything from automotive infotainment and driver safety systems, ultrasound imaging, robotically-assisted surgical systems, advanced wired networks, LTE wireless base stations, 3D TVs, next-generation displays and cameras, factory automation, low-power data centers, surveillance systems, and even sophisticated space vehicles like the Mars Rover for exploring the outer reaches of the universe. Xilinx takes pride in supporting its community; both externally and internally. Xilinx has a history of developing programs for its employees and surrounding communities that provide a social impact through outreach, volunteerism, teambuilding and philanthropy. Areas of focus include education, health, arts and social services. Xilinx culture is represented by a pride in leadership, a passion for excellence, and personal growth. Additional Company Information Registration No. 200312557M Company Size 501 - 1000 Employees Average Processing Time 24 days Semiconductor/Wafer Fabrication Benefits & Others Dental, Education support, Medical, Parking, Regular hours, Mondays - Fridays, Business (e.g. Shirts", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQnVzaW5lc3MgU3lzdGVtcyBBbmFseXN0IiwiY29tcGFueV9uYW1lIjoiWGlsaW54IEFzaWEgUGFjaWZpYyBQdGUuIEx0ZCIsImNvbXBhbnlfbWlkIjoiL20vMDluN3hncyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Im5ZRFJicWl6cVZ1YXEtZ0JBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVvd0NDc3dCUVU1VlgwNXhVMlJVTjFCRmNWbFdhak5pUjBSSVlpMVdMWGsxYmtNeVgwRjJaRk5XUVZKd2F6WlpNRWhWYVZaUVFtcGZNa3hrYlhsNFQya3diSGd4UjBGUE0yRjZkM1pXZEcxWGFXcG1RaTF1YmpGSk5sQkdTRXg2YW1rMlRsUlhlbUV5WmpadFdVTkhhamhmTmpSTFJGWnNOMHhYVWtSS2QyaFNRalpmYzJkQmMwdFliVFpOVGw5RWVtSmxWemhSU25GTFdqSmlXa3hRTjJKRWFEWlRVbk4yVWpaNGRrTXRVR3RpY3pWMU1EbDJRVUUyUnpSc1REaDVabmxtY0VkalJEbERMVVl3TUZscVVsaHNFaGRFYm5GRFdVOUVMVUkyYlZBNVVIZFFOVGRITTNOQmF4b2lRVTlOV1ZKM1JGaFVhME5MT1ZWV2JYVjVWRmR3Y2xwcmRGcHNXVmN3VVdnNGR3IiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNDMiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9icyIsImxpbmsiOiJodHRwczovL3NnLmZpZGFudG8uY29tL2pvYnMvam9iLW9wZW5pbmcvYnVzaW5lc3Mtb3BlcmF0aW9ucy1zcGVjaWFsaXN0cy1hbGwtb3RoZXIvc2VuaW9yLWJ1c2luZXNzLXN5c3RlbXMtYW5hbHlzdC0yNzU1MTU4OTE/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Data Analyst (Adobe), Group Customer Analytics & Decisioning", "company_name": "OCBC Bank", "location": "Singapore", "via": "via Laimoon.com", "description": "Overall Job Purpose:\n• Support digital marketing strategy and take the lead in implementing Adobe Analytics effectively, integrating with CDP, data lake and recommendation engine.\n• Work closely with Marketing to create, execute and track digital campaigns\n• Partner with specific client stakeholders within OCBC to understand their business challenges & use your data expertise to proactively identify areas where data from adobe can create value.\n• Support strategic build projects to continuously enhance the capability of OCBC's analytical processes and big data platforms\nRoles & Responsibilities:\nGenerate Actionable Customer Insight To Improve Key Business Outcomes\nSupport the deployment of Adobe Analytics capabilities and practices to improve marketing effectiveness and efficiency of OCBC Bank. This includes:\n• * Lead the Adobe Analytics practice and drive the management of data collection, integration with data lake, CDP and recommendation engine\n• Work closely with Marketing to... implement accurate analytics tracking, validating parameters and scoping requirements for new data sources\n• Manage and identify opportunities for online journeys and work with relevant stakeholders to improve them\n• Develop range of campaigns to re-target customers who have interacted with OCBC online\n• Track campaign effectiveness using a range of attribution models and work with stakeholders to improve them continuously\n• Regular interaction with product and segment managers to understand their business objectives. Proactive recommendation on how you think analytics could help them achieve their goals.\n• Manage Adobe admin functions\n• Define standards for Digital tagging on OCBC channels\n• Work with Data Engineering team to define the key pipelines of data required to support Business\n• Guide and train other analysts in Adobe Analytics\n\nQualifications\nRequirements (Knowledge, Skills & Competencies):\nGeneral Knowledge & Experience:\n• * Understanding of banking, insurance or financial services preferred\n• Exposure to data management and analysis functions\n\nProgramming & Data:\n• * Solid hands-on experience working with the Adobe suite of products (Adobe Analytics, Target, Audience Manager)\n• Experience in developing digital analytics strategy & implementation guidelines\n• Track record of creating digital campaigns with measurable uplift\n• Ability to analyse, identify, visualize and describe key trends within large datasets\n• Ideally has prior experience of Campaign Management (Unica / SAS /Adobe) and Direct Marketing experiment design concepts\n• Some prior exposure to analytical software tools of leading analytical software tools (such as Python / SAS / R); leading database environments ( Teradata / Cloudera Hadoop / SQL); reporting tools (Qlikview / Tableau / Power BI) and/or contact management platforms (Pega / SalesForce).\n\nCommunication & Soft Skills:\n• * Curiosity & a real passion for understanding \"why?\"\n• Creativity to see possibilities within the data & translate into compelling stories, decisions and actions for non-technical business users.\n• Strong communication skills and ability to influence the business to take action from the data.\n• LI-JT\nResearch", "extensions": ["11 days ago", "Full–time"], "detected_extensions": {"posted_at": "11 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEYXRhIEFuYWx5c3QgKEFkb2JlKSwgR3JvdXAgQ3VzdG9tZXIgQW5hbHl0aWNzIFx1MDAyNiBEZWNpc2lvbmluZyIsImNvbXBhbnlfbmFtZSI6Ik9DQkMgQmFuayIsImNvbXBhbnlfbWlkIjoiL20vMDU1cjI3IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiVmJQSnhscDdRd0Z0NW5nS0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVJQkNxSUJRVTVWWDA1eFV6bEdhemh3ZWtOaGQzZDJjWFEwZDJOc2FFSTJVRVpXUzBoNGQzQlRaazFDZEhGUlEyNHpTRUZJTlVGMFgxQTBSbHB4VGsxMVJqaHZNWEJ4WnpOaU1tZHpNWEpaVm1sc1VGOVVNa05EWkZOemQzRldSM0ZCVEdKbGFtY3hiMXBVZVZsd2VXazJUVUozUTNnek16Sk9jUzFCTUU5MVRqUTJUMXBZTmxGdmQwaE9ZbVJuVUZSbVFsbGhOWGhRUmxsd1IxQkZiVWxMVWt4cFRYVkJFaGRFYm5GRFdVOUVMVUkyYlZBNVVIZFFOVGRITTNOQmF4b2lRVTlOV1ZKM1FucFZXa051TFZsUVExWkpabEJxZEZWT2MxWlNhWEF6Um5wblp3IiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNTAiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGFpbW9vbi5jb20iLCJsaW5rIjoiaHR0cHM6Ly9qb2JzLmxhaW1vb24uY29tL2pvYnMvZXh0ZXJuYWx2aWV3LzI1ODU4NjY2P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Technical Business Analyst", "company_name": "Daulfin Grey HR Pte Ltd", "location": "Singapore", "via": "via Glassdoor", "description": "We are looking for an Technical Business Analyst with Wealth Management experience.\n\nResponsibilities\n• Handle all aspects of business analysis, user stories, requirements gathering, BRD, technical analysis and testing.\n• Liaise closely with various business representatives, business users and development teams.\n• Write technical specifications\n• Participate in defect fixes, change requests and/or project work\n• Handle implementation of Avaloq wealth suite\n\nRequirements\n• IT diploma or degree\n• Knowledge in wealth management or financial products\n• Able to work independently as well as in a team\n• Able to drive discussions independently\n• Self-driven and results focused\n• Effective communication skills\n• Avaloq experience or certification preferred", "extensions": ["18 days ago", "Full–time"], "detected_extensions": {"posted_at": "18 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJUZWNobmljYWwgQnVzaW5lc3MgQW5hbHlzdCIsImNvbXBhbnlfbmFtZSI6IkRhdWxmaW4gR3JleSBIUiBQdGUgTHRkIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJFaG5jelVIS0twa01NVFBrQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEdsYXNzZG9vciIsImxpbmsiOiJodHRwczovL3d3dy5nbGFzc2Rvb3Iuc2cvam9iLWxpc3RpbmcvdGVjaG5pY2FsLWJ1c2luZXNzLWFuYWx5c3QtZGF1bGZpbi1ncmV5LWhyLXB0ZS1KVl9JQzMyMzU5MjFfS08wLDI2X0tFMjcsNDYuaHRtP2psPTQwMjQ3MTk0MzJcdTAwMjZ1dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Assistant Manager - Data Analytics", "company_name": "Nanyang Technological University", "location": "Singapore (+1 other)", "via": "via Monster", "description": "Job Description :\nSummarized JD:\n• The Data Analyst role is important to the sustained progression of Student Data Management project, which helps to build the foundation for the implementation of Student Management System (SMS) and our vision of operational optimization and data-driven decision-making.\n• He/she will be responsible for\n• develop and manage student data marts in preparation for reporting and data analytics projects\n• lead, develop and manage data analytics projects to provide enhanced insights from student data (e.g. Admission Analytics Projects to compare student academic performance)\n• design and develop student administration management dashboards to support decision-making\n• train selected SASD officers in data-related framework, concepts and competency in data analytics\n• support business data users in student data migration activities (incl. profiling, cleansing, mapping of data,) during SMS project implementation\n\n[The role is expected to lead and facilitate, in... addition to execution.]\nRequirements:\n• a recognised Bachelor degree in data sciences / computer science / mathematics;\n• possesses technical expertise in data models, database design & development, data mining & segmentation techniques\n• good knowledge of and experience with data visualisation tools (e.g. Qlik Sense), and programming languages including SQL and Python/R.\n• experience in planning and developing data analytic projects to support business needs\n• able to communicate effectively with business users on data-related requirements and outcomes\nHiring Institution: NTU", "extensions": ["25 days ago", "Full–time"], "detected_extensions": {"posted_at": "25 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBc3Npc3RhbnQgTWFuYWdlciAtIERhdGEgQW5hbHl0aWNzIiwiY29tcGFueV9uYW1lIjoiTmFueWFuZyBUZWNobm9sb2dpY2FsIFVuaXZlcnNpdHkiLCJjb21wYW55X21pZCI6Ii9tLzBsNDlrIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiQWdmbTdUN21CR211c0g5bkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXFJQ0N1SUJRVTVWWDA1eFVXOURUVWh6VFdaT2JYVndibG8yZFhkbVdrMUJVMUkxWWxCaGNtTkNUSEp1YkZwWFNrTlpVWEZhU0dWQlVuRlROazFCY2xCaFNFVlBTMVZKZDBZMVFWVjFMVnBvVkdvMlQzaHBVMjVWVW1KbExWRjVWV0ZEV25CVFgyMTJSRkpUWVRWWFFXVnlabkV4ZUZOMVdIRnBZekJpVXpoTmIwUTRla0ZGUTNWM2RtRTJVV2RaWVRrd2FraFdaMUJVZWkxMk5YSk1helZLYnpONVJXeEpPR0p0TVZKYVVGSm1SRnBHUkdSUFNVZFpVa0pTUWtWb1JIZGxlbXd5UTNCQ1FuSkRMVEl3T1VFdE9VUnVUREE0ZWtremJWaFNiSG95WjNkWFYxcDFVUklYUkc1eFExbFBSQzFDTm0xUU9WQjNVRFUzUnpOelFXc2FJa0ZQVFZsU2QwRlVRM1l6UW5GVFdrSm5MWEZDZW5aaVIwSlFaWHBJVkhGTVRFRSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzYzIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1vbnN0ZXIiLCJsaW5rIjoiaHR0cHM6Ly93d3cubW9uc3Rlci5jb20uc2cvYW1wL2pvYi12YWNhbmN5LWFzc2lzdGFudC1tYW5hZ2VyLWRhdGEtYW5hbHl0aWNzLW5hbnlhbmctdGVjaG5vbG9naWNhbC11bml2ZXJzaXR5LXNpbmdhcG9yZS0yNjcyNzcyMy5odG1sP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Business Operations", "value": "GC06"}, {"text": "Science and Engineering", "value": "GC27"}, {"text": "Management", "value": "GC18"}, {"text": "Accounting and Finance", "value": "GC01"}, {"text": "Advertising and Marketing", "value": "GC03"}, {"text": "Admin and Office", "value": "GC02"}, {"text": "Human Resources", "value": "GC15"}, {"text": "Legal", "value": "GC17"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Sales and Retail", "value": "GC26"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "Data analyst", "value": "data analyst"}, {"text": "Business analyst", "value": "business analyst"}, {"text": "Analyst", "value": "analyst"}, {"text": "Associate", "value": "associate"}, {"text": "Senior", "value": "senior"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Data scientist", "value": "data scientist"}, {"text": "Insights analyst", "value": "insights analyst"}, {"text": "Operations analyst", "value": "operations analyst"}, {"text": "Project manager", "value": "project manager"}, {"text": "Project officer", "value": "project officer"}, {"text": "Administrators", "value": "administrators"}, {"text": "Builder", "value": "builder"}, {"text": "Business", "value": "business"}, {"text": "Cloud consultant", "value": "cloud consultant"}, {"text": "Control analyst", "value": "control analyst"}, {"text": "Data engineer", "value": "data engineer"}, {"text": "Executive", "value": "executive"}, {"text": "Intelligence analyst", "value": "intelligence analyst"}, {"text": "It analyst", "value": "it analyst"}, {"text": "Performance manager", "value": "performance manager"}, {"text": "Product analyst", "value": "product analyst"}, {"text": "Research analyst", "value": "research analyst"}, {"text": "Research assistant", "value": "research assistant"}, {"text": "Senior analyst", "value": "senior analyst"}, {"text": "Senior associate", "value": "senior associate"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Solution architect", "value": "solution architect"}, {"text": "Support analyst", "value": "support analyst"}, {"text": "Systems analyst", "value": "systems analyst"}, {"text": "Technology consulting", "value": "technology consulting"}, {"text": "Unit", "value": "unit"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Internship", "value": "INTERN"}, {"text": "Part-time", "value": "PARTTIME"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Accounting", "value": "/business/naics2007/5412"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Mining", "value": "/business/naics2007/21"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Travel", "value": "/business/naics2007/5615"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "DBS Bank", "value": "/m/01q7n5"}, {"text": "SingTel", "value": "/m/020zfl"}, {"text": "United Overseas Bank", "value": "/m/04gjd1"}, {"text": "Nanyang Technological University", "value": "/m/0l49k"}, {"text": "GovTech Singapore", "value": "/g/11gh0528nq"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "Bank of Singapore", "value": "/m/0r3vczm"}, {"text": "Binance", "value": "/g/11hcz1r4wl"}, {"text": "Citi", "value": "/m/01dfb6"}, {"text": "Cognizant Singapore, Cognizant Technology Solutions", "value": "/m/03bf9h"}, {"text": "Dyson", "value": "/m/05cskg"}, {"text": "EPAM Systems", "value": "/m/0dlnrc"}, {"text": "Ernst & Young", "value": "/m/0g9jc"}, {"text": "Goldman Sachs Services Private Limited", "value": "/g/11g9mm5tzn"}, {"text": "PEOPLE PROFILERS", "value": "/g/11dxq43n_6"}, {"text": "PwC Singapore", "value": "/g/11dxpz2lh8"}, {"text": "Sciente International", "value": "/g/11c73gj19n"}, {"text": "AIR LIQUIDE INDUSTRIAL SERVICES PTE LTD", "value": "/g/11hg55y1rb"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Accounting and Corporate Regulatory Authority", "value": "/m/09g7_b3"}, {"text": "Agency for Integrated Care", "value": "/g/11c73jd3yt"}, {"text": "Amazon", "value": "/m/0mgkg"}, {"text": "Amazon Web Services Singapore", "value": "/m/0rznzt1"}, {"text": "BeathChapman Pte Ltd", "value": "/g/11f01b3y2c"}, {"text": "Big Cloud", "value": "/g/11c743lwsr"}, {"text": "Bloomberg", "value": "/m/027sm6"}, {"text": "Burpple", "value": "/g/11dxps5yv5"}, {"text": "CPF Board", "value": "/m/0615qb"}, {"text": "ClearanceJobs", "value": "/g/11fy1pft9v"}, {"text": "Comfort Transportation Pte Ltd", "value": "/g/11f01gw2xt"}, {"text": "Credit Agricole Group", "value": "/m/028vbm"}, {"text": "DYSON OPERATIONS PTE. LTD.", "value": "/g/11fy29mc6g"}, {"text": "Deloitte", "value": "/m/02spfd"}, {"text": "Direct Search Asia", "value": "/g/11fy260nhz"}, {"text": "EngageRocket", "value": "/g/11c73p5x97"}, {"text": "Epson Singapore", "value": "/g/11dxpfq_tf"}, {"text": "Expedia Group", "value": "/m/03gq420"}, {"text": "GLOBALFOUNDRIES Singapore", "value": "/m/05pcrz0"}, {"text": "Goldman Sachs", "value": "/m/01xdn1"}, {"text": "Google", "value": "/m/045c7b"}, {"text": "Ideallss", "value": "/g/11g70fpjm5"}, {"text": "IoTalents", "value": "/g/11dxq187wm"}, {"text": "JAC Recruitment", "value": "/g/121g71_s"}]}]}