{"search_metadata": {"id": "6082790124e88e37967d3bbf", "status": "Success", "json_endpoint": "https://serpapi.com/searches/385b5663455f973a/6082790124e88e37967d3bbf.json", "created_at": "2021-04-23 07:36:33 UTC", "processed_at": "2021-04-23 07:36:33 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28IT+analyst%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=20", "raw_html_file": "https://serpapi.com/searches/385b5663455f973a/6082790124e88e37967d3bbf.html", "total_time_taken": 3.34}, "search_parameters": {"q": "(IT analyst) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "20"}, "jobs_results": [{"title": "Senior IT Business Systems Analyst", "company_name": "Medtronic", "location": "Singapore", "via": "via Bayt.com", "description": "Careers That Change Lives\n\nMedtronic Singapore Operations was among the first international medical technology firms to set up manufacturing operations in Singapore. We are one of the most advanced medical device manufacturing sites and the first manufacturing facility of its kind in the region to make implantable cardiac leads, pacemakers and monitors.\n\nOur Purpose\n\nFounded in 1949, our Mission continues to serve as our ethical framework and inspirational goal for our employees around the world. It guides our day-to-day work and reminds us that our efforts are transforming the lives of millions of people each year. If you have a passion for medical device manufacturing, this opportunity could be for you!\n\nA Day in the Life\n\nAs a Senior IT Business Systems Analyst, you are responsible to supports manufacturing applications and related interfaces, such as FactoryWorks, SPACE, StARS, Loftware, Transform, etc.\n\nResponsibilities may include the following and other duties may be... assigned.\n• Consults with business stakeholders to understand and evaluate current business processes and identify complex business problems and needs turning those needs into system requirements.\n• Provides technical expertise for system functional specifications and deploys new and current systems, processes and procedures in a cost-effective manner.\n• May configure system settings and options; plan and execute unit, system, and integration testing to meet business requirements.\n• May lead cross-functional linked teams to address business or systems issues.\n• Support existing applications and interfaces by diagnosing and fixing problems using general skills and a knowledge of standard Medtronic configurations.\n• Provide application technical support to MES, developers, infrastructure and project leaders.\n• Provide solutions to a variety of technical problems of moderate scope and complexity.\n• Provides training to production floor personnel in the proper operation of the MES.\n• Provides leadership and assistance in MES upgrades which includes system testing, documentation changes, and hyper-care support of new MES releases.\n• Collaborates with operators, engineers, and IT personnel in troubleshooting issues between the MES and ERP systems\n• Install, test and document new software products and recommends their adoption as standards.\n• Build the knowledge bank of support documents for each application and related interfaces.\n• Provides technical assistance in identifying, evaluating, and developing systems and procedures, which are cost effective and meet user requirements.\n• Configures system settings and options; plans and executes unit, integration, and acceptance testing; and creates specifications for systems to meet business requirements.\n• Develop solutions to routine problems of limited scope and complexity following established policies and procedures.\n• Work with department leaders in the designs of automated systems.\n• Ensure proper validation documentation is created for all projects (i.e. Medtronic System Validation Methodology (MSCM).\n• Ensure that Medtronic's systems and the information on them are protected in accordance with Medtronic's Information Protection Policies and Standards, as well as best Information Protection practices\n• Perform other related duties as assigned, to ensure workload coverage within IT department and to fulfill business objective. Follow any other job-related instructions and to perform any other job-related duties requested by respective superior\n• Provide 24x7 support to MSO manufacturing operation\n\nMust Have: Minimum Requirements\n• Minimum of 4 years of relevant experience, or advanced degree with a minimum of 2 years relevant experience\n• BSc in Information Management, Computer Sciences, or equivalent with working experience in a manufacturing environment. A previous experience in the medtech / pharma industry is a plus\n\nNice to Have\n• >5 years of progressive experience as a Business/System Analyst or similar role\n• Knowledge of manufacturing process and related applications\n• Able to mentor junior Business/System Analyst on manufacturing solutions\n• Experience to drive mid-scale projects\n• Good understanding of compliance requirements and experience validating electronic systems in an FDA-regulated environment\n•", "extensions": ["4 days ago", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgSVQgQnVzaW5lc3MgU3lzdGVtcyBBbmFseXN0IiwiY29tcGFueV9uYW1lIjoiTWVkdHJvbmljIiwiY29tcGFueV9taWQiOiIvbS8wM3o0ajMiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJKYUNLaXpJaXFQRjZwTWRqQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUlCQ3FJQlFVNVZYMDV4VkV4R1ptdHdYMmRzYVRabExUSXpkbEJ3YXpoTFJHTjJja3g2V1Zsb2RqYzVOMFowVEVWSk0xZEJhRkoxVjNRNE9WWTBaREpHWkRKaGJURlBiR3RrTFdSWmJYbFJaSFZTV1ROSVZtOXZaelExTTBreVZIQnRVbEpJYTNOck9FbHFjMEV3VkRoUE9VTjBYMGh4YVhKQlIyaE1jVFJaWnpCRVRVeFlZbnBWYVdGdk1FNU1lbE5XYWkxMGJHdHpVRlpWYzFwNWFHZE5lRkp5ZFY5QkVoZENTRzFEV1VwVU1FSmhSMFk1VUhkUWNVdDVWbkZCYnhvaVFVOU5XVkozUVRjeFdrSk5ibVk1UVVWNE1rbG1XVGd6ZFRoWGVtZGlUV0pQZHciLCJmY3YiOiIzIiwiZmNfaWQiOiJmY183IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJheXQuY29tIiwibGluayI6Imh0dHBzOi8vd3d3LmJheXQuY29tL2VuL3NpbmdhcG9yZS9qb2JzL3Nlbmlvci1pdC1idXNpbmVzcy1zeXN0ZW1zLWFuYWx5c3QtNTk1MzY1ODgvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Senior IT Analyst", "company_name": "Asia Innovatory Management School", "location": "Singapore", "via": "via Glints", "description": "Job Responsibilities:\n• Manage assigned projects to deliver services in accordance with established objectives\n• Analyse the proposed solutions to identify any enhancement opportunities to resolve any performance gaps\n• Assist in problem resolution and bug fixes\n• Provide root cause analysis and system resolution\n• Assess the impact of new requirements and enhance the system\n• Developing new applications based on user’s requirement\n• Evaluate existing system & business requirement for improvement and efficiency\n• Conduct training and workshop with business users\n\nJob Requirements\n• The Candidate shall possess at least a bachelor’s degree in Information Technology (IT), Computer Engineering, Computer Science, or equivalent.\n• The Candidate shall have a minimum of FIVE (5) years working experience in the IT industry, with exposure to end-to-end software development lifecycle (SDLC), system analysis and design, application development, and operational support and maintenance.\n• Certified... in Amazon Web Services like AWS Certified Cloud Practitioner or better. Please provide verifiable evidence, like YourAcclaim.com, or equivalent.\n• Preferred to be certified in Microsoft Azure platform. Please provide verifiable evidence, like YourAcclaim.com, or equivalent.\n• Preferred to have experience or certification in Google Cloud services. Please provide verifiable evidence, like YourAcclaim.com, or equivalent.\n• Preferred to have working experience with container technology like Docker, Docker Swarm, or Kubernetes.\n• Proficient in C# (NET), or equivalent C-based programming language like PHP, PERL, C++, and C.\n• Proficient in front-end technologies, like HTML5, jQuery, JavaScript, and CSS.\n• Preferred to be experienced with front-end framework like Angular, AngularJS, REACT, or equivalent.\n• Preferred to have working experience with NodeJS.\n• Proficient in SQL technology like MSSQL, MySQL, PostgreSQL, MariaDB, or equivalent and be proficient in writing optimized SQL queries or stored procedures.\n• Preferred to have working experience with NoSQL like MongoDB, CouchDB, DynamoDB, or equivalent.\n• Working experience in Service Oriented Architecture (SOA) by having integrating application using SOAP or REST services before.\n• Preferred to have working experience with chatbot technology like Dialogflow, Google Action, LUIS. WIT.AI, AWS Lex, or equivalent.\n• Preferred to have working experience in continuous integration and continuous delivery like Jenkin, Spinnaker, Bamboo, CodePipeline, or equivalent.\n• Preferred to have working experience with Content Search technology like Alfresco Content Management System, EBSCOHOST Discovery Services, Google Enterprise Search, CloudSearch, Apache Solr/Lucene, or equivalent.\n• Preferred to have working experience with EZProxy access and authentication software.\n• Preferred to have working experience in agile projects using SCRUM, or equivalent", "extensions": ["10 days ago", "Full–time"], "detected_extensions": {"posted_at": "10 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgSVQgQW5hbHlzdCIsImNvbXBhbnlfbmFtZSI6IkFzaWEgSW5ub3ZhdG9yeSBNYW5hZ2VtZW50IFNjaG9vbCIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiLVJyS1NlRUNYSFVOaUs1bEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBHbGludHMiLCJsaW5rIjoiaHR0cHM6Ly9nbGludHMuY29tL3R3L29wcG9ydHVuaXRpZXMvam9icy9zZW5pb3ItaXQtYW5hbHlzdC9lMTcyMGYxNy1iMDM3LTRiNDMtOTdmZC0wNjJiMGQ0N2Q1ODM/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Analyst, Network Technical Ops", "company_name": "American Express", "location": "Singapore", "via": "via Neuvoo", "description": "Job Description\n\nNetwork Solutions and Operations (NSO) is a critical organisation within American Express as it runs the Network used by our Global Partners (Acquirers and Issuers) to process card transactions. NSO also provides the platforms, defines the policies and creates exciting new products consumed by our Global Partners.\n\nThis job opportunity will reside within Network Certification & Servicing (NCS), which is an arm of NSO dedicated to certify and onboard new customers and products. This entails securely connecting our Proprietary Merchants, Processors and Network Partners to the American Express Network and certifying the authorisation and clearing messages developed by them before they are enabled in production. NCS also supports and certifies existing customers when deploying new and existing products such as EMV Chip Processing, Safekey, Quick Response Code, Mobile Wallets and Secure Remote Commerce, to name a few.\n\nGeographically, NCS operates and functions as a global... organization with hubs in locations such as Phoenix, UK, Gurgaon, Tokyo, Sydney and Singapore.\n\nWithin the above context, a Certification Analyst opportunity has arisen, to be based in Singapore, to manage certification projects requested by Amex customers, as well as managing internal initiatives that impact the certification processes.\n\nResponsibilities\n• Manage assigned projects related to the certification of link connectivity, financial settlement and authorisation messages that support new and existing payment products such as EMV Chip Processing, Safekey, Quick Response Code, Mobile Wallets and Secure Remote Commerce.\n• Manage the setup of file transfers between Amex customers and Amex.\n• Provide testing support and technical consultancy to internal and external customers pertaining to Amex technical specifications and certification processes.\n• Develop and document certification processes and procedures for new initiatives.\n• Work with various American Express Technology groups to support the installation of network connectivity and implementation of authorisation and settlement solutions.\n• Lead and drive regional or global internal projects, specifically ensuring that NCS test tools, test plans and certification processes are updated or enhanced.\n• Participate in calls that can be held outside of office hours in order to support regional or global projects that span different time zones.\n• Support all project types – simple or complex to help the team manage project volumes throughout the year.\n• Participate or lead employee related activities within the local campus.\n\nMinimum Qualifications\n• Knowledge of Payments industry including but not limited to EMV, Express Pay, SafeKey, mobile wallets, POS products, is essential.\n• Can readily understand technical specifications, decipher the technical contents and use that knowledge to validate test results. Can independently identify root causes that can arise during certification & resolve them.\n• Knowledge of telecommunication and networking components such as TCP/IP & SFTP, Router capabilities, VPN and Web Services, are pluses.\n• Demonstrates strong relationship management skills used to influence without authority both internally and externally, across multiple international territories with different cultural considerations.\n• Must be able to communicate effectively both orally and in written form, with internal and external customers at both a technical and business level.\n• Highly self-motivated, growth mindset and results driven with the ability to work without supervision in a matrix organization and demonstrating strong teamwork.\n• Ability to work flexibly in an ever-changing environment, demonstrating adaptability & a keen interest to learn.\n• Proven business analysis and project planning experience including strong problem solving and analytical skills.\n• Proven ability to support multiple projects simultaneously in a fast paced, multi-time zone environment.\n• Must be willing to work outside office hours whenever the project calls for it.\n• A minimum of 3 years of experience working in the payment industry with hands on payment product certification experience being essential.\n• Ability to speak Mandarin, Japanese or both, are pluses.\n\nOffer of employment with American Express is conditioned upon the successful completion of a background verification check, subject to applicable laws and regulations.\n\nAmerican Express has been awarded Aon Hewitt Best Employer Singapore six times. Join us and you’ll soon see why.\n\nAs an employee, you can expect challenging work, with purpose. Be more than just your job. Be the voice of inspiration and transform the way the world does business for a living. By joining American Express, you are choosing to become a part of the dynamic team that is recognized as Singapore's \"Best Employer 2018\".\n\nWhy American Express?\nThere’s a difference between having a job and making a difference.\n\nAmerican Express has been making a difference in people’s lives for over 160 years, backing them in moments big and small, granting access, tools, and resources to take on their biggest challenges and reap the greatest rewards.\n\nWe’ve also made a difference in the lives of our people, providing a culture of learning and collaboration, and helping them with what they need to succeed and thrive. We have their backs as they grow their skills, conquer new challenges, or even take time to spend with their family or community. And when they’re ready to take on a new career path, we’re right there with them, giving them the guidance and momentum into the best future they envision.\n\nBecause we believe that the best way to back our customers is to back our people.\n\nThe powerful backing of American Express.\nDon’t make a difference without it.\nDon’t live life without it", "extensions": ["8 days ago", "Full–time"], "detected_extensions": {"posted_at": "8 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBbmFseXN0LCBOZXR3b3JrIFRlY2huaWNhbCBPcHMiLCJjb21wYW55X25hbWUiOiJBbWVyaWNhbiBFeHByZXNzIiwiY29tcGFueV9taWQiOiIvbS8wMXc2ZHciLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJxUWZUdUdpaFFWVEdZVVh4QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdmNCQ3JjQlFVNVZYMDV4VXpGdVJHWlZaRGRaUlVkUllrZFZXbUV3V25wTloyaHFVVlJOYkU5bVdDMXJWM2swZFRBemREZE1SVzB6U0UxdGIzZzFlVzFIUkhWVlkwOVdVMHQ2ZGpNd2RXUkphSHA0WDBadFVuVXhNVzlrTWxZMFpWWnZkelZ6TXpWR01GZzJZVmd3TVZsWFlUQk5aelI0ZG1kU1ZreDFSVFJzVDJSU1pXOXpUMnhOU2s1T1IyWnhXa2RRUWtGMFltRmFVVjloU0RSSlgwcHZaMVJWTkZsSE1WSkJRVWxOVWxneFIzQmZhM2RaZDNCSGVtZEpFaGRDU0cxRFdVcFVNRUpoUjBZNVVIZFFjVXQ1Vm5GQmJ4b2lRVTlOV1ZKM1EzWTJSRkpCVTNaYVEzbzFZM1V0YTNCWFFuWk9RV3BJYlZGSWR3IiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMjAiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTmV1dm9vIiwibGluayI6Imh0dHBzOi8vc2cubmV1dm9vLmNvbS92aWV3Lz9pZD01MTZjZTFkZDc4Y2ZcdTAwMjZ1dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Go-to-Market Strategy and Operations Analyst, Google for Education", "company_name": "Google", "location": "Singapore", "via": "via Google Careers", "description": "The Business Strategy & Operations organization provides business critical insights using analytics, ensures cross functional alignment of goals and execution, and helps teams drive strategic partnerships and new initiatives forward. We stay focused on aligning the highest-level company priorities with effective day-to-day operations, and help evolve early stage ideas into future-growth initiatives.\n\nOur team's mission is to act as thought partner to Education International Go-to-Market (GTM) leadership to promote adoption of Google for Education solutions. We provide deep data analytics to craft the GTM strategy, as well as actionable insights and operational leverage to ensure their success. We work cross-functionally with sales/channel, marketing, product management, and finance to ensure the success of the businesses globally.\n\nThe Go-to-Market Operations (GtM) team ensures Google's complex and ever-evolving Ads business runs smoothly. We are instrumental in setting go-to-market... strategy, and ensuring flawless execution and operations against the strategy. We have teams embedded in each of the major Ads business areas as well as global teams that work across the business areas. Team members are analytical and strategic, with a pragmatic sense of how to get things done", "extensions": ["4 days ago", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJHby10by1NYXJrZXQgU3RyYXRlZ3kgYW5kIE9wZXJhdGlvbnMgQW5hbHlzdCwgR29vZ2xlIGZvciBFZHVjYXRpb24iLCJjb21wYW55X25hbWUiOiJHb29nbGUiLCJjb21wYW55X21pZCI6Ii9tLzA0NWM3YiIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjI3UEFIdVJCV0NWUmU0OWVBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVzd0JDb3dCUVU1VlgwNXhWR2hsUVRkeldFdDJVVTlIYVhOaExXaEVYM1o0WVVaeFdGSnFSR2cxWVZocVdrTmxWREJDVWtGdFoyaFNNSEEzV1Y5c1RYVjZjRVZyT0VSU2JXTTNUSE50V0RSSlZtcERSSEJDYnpJM2RWaHpNbWRUWTJkdlNEVkRZMlJpUTBaS1JrUlJaVEZxZFVkRFFVcDBhMlJCUVZsME9FSk1PVEp4UzNJeFMyNUdTRkZ6WjNaZllqWVNGMEpJYlVOWlNsUXdRbUZIUmpsUWQxQnhTM2xXY1VGdkdpSkJUMDFaVW5kQlpFSXlTMnh5YUZaM2RXNVZPVVZQUmpWV05VUkJVVEJKZGw5UiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzI4IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEdvb2dsZSBDYXJlZXJzIiwibGluayI6Imh0dHBzOi8vY2FyZWVycy5nb29nbGUuY29tL2pvYnMvcmVzdWx0cy8xMTYyMDg3NTQyNDE3NDE1MTAtZ28tdG8tbWFya2V0LXN0cmF0ZWd5LWFuZC1vcGVyYXRpb25zLWFuYWx5c3QtZ29vZ2xlLWZvci1lZHVjYXRpb24vP2ppZD0yMzYyMzUwMDFcdTAwMjZ1dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "AML Analyst / Senior Analyst", "company_name": "Marina Bay Sands Pte Ltd", "location": "Singapore (+1 other)", "via": "via Jobs Guide Hub", "description": "AML Analyst / Senior Analyst Jobs in Singapore at Marina Bay Sands Pte Ltd\n\nTitle: AML Analyst / Senior Analyst\n\nCompany: Marina Bay Sands Pte Ltd\n\nLocation: Singapore\n\nType:\n\nCategory:\n\nJOB RESPONSIBILITIES:\n\nInvestigate and assess alerts generated by AML systems for appropriate clearance or for further escalation\n\nContribute to the ongoing fine-tuning of thresholds and parameters within the AML systems, as well as perform testing for roll-out of AML systems patches/ change requests\n\nConduct in-depth analysis and investigation of patron accounts to detect patterns, trends, relationships, and other information for potential money laundering and terrorism financing risks\n\nParticipate in the comprehensive review and update of the Prevention of Money Laundering and Terrorism Financing (PMLTF) Framework, Suspicious Transaction Reporting Framework, Higher Risk and Other Risk Patron programs for effectiveness, standardization, maximum information value, and robust implementation and... compliance.\n\nDirectly support and participate in all Compliance Department responsibilities, to include but not limited to governmental or regulatory filings, responding to queries from regulators, internal and external complaints and follow-up investigation.\n\nManage compliance related matters separately assigned by the Chief Compliance Officer or Executive Director and to work with relevant departments with regard to various compliance issues and advise appropriate course of action and preventative or remedial measures as necessary.\n\nJOB REQUIREMENTS:\n\nPreferably a Certified Money Laundering Specialists (ACAMS) certification or a Diploma in AML with the International Compliance Association\n\nMinimum 1-3 years of working experience; minimum 3 years of relevant experience\n\nExperience in a casino, banking, law enforcement, intelligence/analysis, or regulatory environment is preferred.\n\nMust be well-organized, have the ability to work under tight deadlines, make decisions, work well as part of a team and independently, and take proactive actions\n\nMust possess excellent English communication skills, with an emphasis on exceptional writing and composition skills.\n\nExcellent skill in using Microsoft suite of applications\n\nCandidate with more relevant years of experience may be consider for a Senior Analyst role.\n\nYou agree that it is a condition of employment that you adhere to and abide by all rules, regulations, policies and procedures including without limitation the rules of conduct of the Company", "extensions": ["20 hours ago", "Full–time"], "detected_extensions": {"posted_at": "20 hours ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBTUwgQW5hbHlzdCAvIFNlbmlvciBBbmFseXN0IiwiY29tcGFueV9uYW1lIjoiTWFyaW5hIEJheSBTYW5kcyBQdGUgTHRkIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJzdmRUdU9SQnNLc0tnczJ0QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnMgR3VpZGUgSHViIiwibGluayI6Imh0dHBzOi8vam9ic2d1aWRlaHViLmNvbS9qb2IvYW1sLWFuYWx5c3Qtc2VuaW9yLWFuYWx5c3QtMi8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Senior Systems Analyst (SG08082)", "company_name": "Parkway Pantai Limited", "location": "Singapore", "via": "via Joblum Singapore", "description": "The Role\n\nImplementation of Projects and day to day operational support of IT systems. Execution of projects, change requests and operation of IT systems.\nKey accountabilities\n• Collaboration with stakeholders to develop, implement and support the delivery of required functionality. Investigate processes to assure system capabilities and process requirements are aligned and plays a critical role in clinical system requirement, solutioning, design, development, testing, implementation and support activities.\n• Work closely with the AVP or Senior Manager in the approval, acquisition and implementation of Clinical projects that include the acquisition, management, and use of information technology (IT) resources, capital planning and investment analyses, the IT operating plan and budget, as well as IT acquisition strategy and performance measures.\n• Resolve project issues with vendors and key stakeholders and ensure the smooth implementation of the clinical projects.\n• Project... evaluation\n• Project Integration\n• Scope management\n• Time management\n• Managing project cost\n• Quality management\n• Human resource management\n• Project communication management\n• Project risk management\n• Project procurement\n• Organisation management\n• Building client relationship\n• Ensure optimum resource allocation and utilization and financial effectiveness for the conduct of the IT activities\n• Oversee the planning, directing, supervising and coordinating of department operations which include the provision of appropriate supporting infrastructure for running the operational systems and in the dissemination of information; assign work activities, projects and programs; monitor work flow; review and evaluate work methods and procedures. Prepare a variety of correspondence including general and special reports.\n• Oversee the preparation and monitoring of IT capital project budgets for approval, IT operating budgets and control of expenditure.\n• Ensure that the Lab Information System and other Lab related IT systems are performing optimally and meets the requirements of Parkway Labs. Establish and develop SLAs with Parkway Labs and ensure that the projects are able to meet these SLAs. Work with Parkway Labs to set and prioritize short and long-term IT goals. Ensure that IT goals are properly executed with proper staffing and budget. Knowledge and experience with Cerner would be an added advantage.\n• Lead and support the IT team and ensure that team members are properly assigned. Develop, coach and grow team members’ capabilities. Maintain team moral and good team relationships. Able to ensure IT team is able to work with other members across the organization.\n\nQualifications:\n• Bachelor Degree or Diploma in Computer Science / Information Technology or equivalent.\n• Experience with Cerner lab systems and solutions preferred.\n• Clinical operations experience to support, implement, configure and extend the capabilities of the Lab IT systems preferred.\n• PMP (Project Management Professional) or CITPM (Certified IT Project Management) preferred.\n• Healthcare experience preferred.\n• Minimum 3 to 5 years’ experience in leading medium to large scale application projects.\nSkills & Knowledge:\nGeneral\n• Hands on SLDC management for medium to major projects.\n• Good interpersonal and negotiation skills.\n• Excellent communication and leadership skills with strong initiative.\n• Able to think analytically and solve problems effectively.\n• Excellent command of spoken and written English.\n• Positive work attitude and ability to work under pressure.\n• Ability to learn and pick up new technical skills.\n• Strong problem solving and analytical skills.\n• Work effectively in a team environment.\n• Using initiative and independent judgment within established guidelines and procedures.\n• Organizing work, setting priorities and meeting critical time deadlines and communicating effectively with co-workers and superiors.\n\nClinical / Ancillary\n• Experience in design, development, testing, implementation and support of clinical systems\n• Clinical awareness, and implementing medical devices integration with lab information systems (ideally Cerner, Siemens, Konica Minolta, Roche)\n• Good background in data mapping and clinical data analysis\n• Strong background in developing test scenarios, test case, and leading system testing activities with users.\n• Working with Lab and Rad users to determine business and clinical requirements, and translating them to system and technical requirements for the systems analysts\n• Background in service design, process optimisation and process automation\n• Experience in clinical systems, healthcare standards such as HL7 Messaging, ICD10, DICOM, DRG and Snomed CT, and LOINC.\n• Experience in Cerner lab systems and solutions is an advantage.\n• Good knowledge of clinical and ancillary applications and workflow.\n• Experience in software development and testing experience using Visual Basic, .NET applications using Oracle database, and background in scripting.\n• Experience in working with or collaborating with Singapore government health agencies.\n• Experience in a healthcare environment or healthcare vendor is an advantage", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU3lzdGVtcyBBbmFseXN0IChTRzA4MDgyKSIsImNvbXBhbnlfbmFtZSI6IlBhcmt3YXkgUGFudGFpIExpbWl0ZWQiLCJjb21wYW55X21pZCI6Ii9tLzA3eDkyZCIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6InZmUUp0R2hIN3FkaF9vM0hBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2Y0JDcmNCUVU1VlgwNXhVekZsZDJGVlpVTmtjSE14U0dGcmEwbzVZMWMwUTFCb2NuYzJUbVJXYTBOVWNESlRWMmhSYUZnNVZUTXlPR290U0Vod016RkdabUZvVUVoeU1tbzFOM1ZGVmtORFUxZHhiRkJtVHpKaWFHOXNjbGxXVkRBdFRrUkJia2haU1RGTlZIcG5Na1V3WTBwelQzQlJiVzh6ZVMxQlFuRlBaVkZUYWpWTlZVNVlkRFJwWTNOalpYcGlYMjF2Y0V4S2NUQkxNVE00WnpORk5XcHZSRmQxYnpscFFXTkhYMGgyVURSWldtdFJha0ZGVEdSakVoZENTRzFEV1VwVU1FSmhSMFk1VUhkUWNVdDVWbkZCYnhvaVFVOU5XVkozUVVodlZsYzRNRmRETUY5dFF5MTBZbVF0V2psaFNWRk1hWGh1UVEiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY180MCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JsdW0gU2luZ2Fwb3JlIiwibGluayI6Imh0dHBzOi8vc2cuam9ibHVtLmNvbS9qb2Ivc2VuaW9yLXN5c3RlbXMtYW5hbHlzdC1zZzA4MDgyLzYyNTgxMT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Threat and Intel Analyst", "company_name": "Trustwave", "location": "Singapore", "via": "via Learn4Good", "description": "Description Position at Trustwave About Trustwave\n\nTrustwave is a leading cybersecurity and managed security services provider focused on threat detection and response. Offering a comprehensive portfolio of managed security services, consulting and professional services, and data protection technology, Trustwave helps businesses embrace digital transformation securely. Trustwave is a Singtel company and the global security arm of Singtel, Optus and NCS, with customers in 96 countries. For more information about Trustwave, visit .\n\nThe responsibilities shall include, but not limited to the following tasks:\n\nPerforming detailed system analysis and correlation to identify pattern of intrusion\n\nCreating use cases for detecting similar intrusion\n\nIdentifying new or useful Indicator of Compromise\n\nConducting researches and evaluating trends in remediation approaches\n\nCreating and maintaining procedures for utilising the EDR and NDR tools\n\nRequirements/Qualifications:\n\nAt least FOUR (4... years of experience working in a Security Operation Center with security monitoring and escalation of threats responsibilities\n\nRelevant training on the proposed products, and has obtained professional certification such as GIAC Information Assurance Certified Intrusion Analyst (GCIA), GIAC Information Assurance Certified Incident Handler (GCIH), or equivalent\n\nThe necessary soft skills. The Incident Investigation Analyst shall be continually assessed on his/her interpersonal skills and strong communication skills\n\nEducation:\n\nWe prefer college-educated applicants, but at minimum, high school diploma or equivalent is required for employment.\n\nTrustwave is an Equal Opportunity Employer of Minorities, Females, Protected Veterans, and Individuals with Disabilities.\n\nTo All Agencies:\n\nPlease, no phone calls or emails to any employee of Trustwave outside of the Talent Acquisition team. Trustwave’s policy is to only accept resumes from agencies via the Trustwave Agency Portal. Agencies must have a valid fee agreement in place and they must have been assigned the specific requisition to which they submit resumes, by the Talent Acquisition team. Any resume submitted outside of this process will be deemed the sole property of Trustwave and in the event a candidate is submitted outside of this policy is hired, no fee or payment of any kind will be paid", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJUaHJlYXQgYW5kIEludGVsIEFuYWx5c3QiLCJjb21wYW55X25hbWUiOiJUcnVzdHdhdmUiLCJjb21wYW55X21pZCI6Ii9tLzBuM3hqZjUiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiIwb1h4bE5wYXFXVE5IMzFYQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUlCQ3FJQlFVNVZYMDV4VkVKNGFuRnhOblV4ZDA1Wlprb3pVblI2YWw5dFREaFRhMUJPWm1wa2FUUndXRXRITFhGS1dWOXJSRFkxZFZsc1JrdGFZMDFvZEhwS1VGbDZNemt6WWxaTGREUlliemhpWDBwMVMxaGhTRjlNZVdOWFNEQXdSak5OTlRoVlVTMTBObFJDZDNCcFptbFZjV3BZUVZKbE1qQmxORmd5UkhOd1pWcDRlRkJCY0dRdFNpMXVNR2RTVTJsUWJHRlFTa0ZMVGpSWlUxcFJabDlFVUZCUkVoZENTRzFEV1VwVU1FSmhSMFk1VUhkUWNVdDVWbkZCYnhvaVFVOU5XVkozUVhCbVNrNWpVVVUwWjBzd09TMVVTM0pQUzJGb2QyUnhRV0ZYZHciLCJmY3YiOiIzIiwiZmNfaWQiOiJmY180OCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMZWFybjRHb29kIiwibGluayI6Imh0dHBzOi8vd3d3LmxlYXJuNGdvb2QuY29tL2pvYnMvc2luZ2Fwb3JlL3NlY3VyaXR5LzI3MTI3ODY5Ni9lLz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Business Analyst", "company_name": "Techgig", "location": "Singapore", "via": "via Mendeley", "description": "About Job\n\nCTC Undisclosed Job Location Singapore Experience 5 - 8 yrs\n\nDescription\n\nRequired Skills: Our client is a leading business service provider in Singapore. The company is looking for an experienced and full-time Business Analyst for onsite role in Singapore.\n\nKey Job Responsibilities:\n\n- Elicit, scope and manage the Agencys business requirements\n\n- Develop the business case and Tender Specifications\n\n- Evaluate and recommend ICT solutions that best address the needs\n\n- Prioritise product backlog through rigorous information gathering and\n\n- Analysis with stakeholders, and contribute to the development of the Functional/ Design specifications\n\n- Review testing and data conversion documents to verify that specifications are met\n\n- Drive smooth deployment, adoption and operations of the solution analyse impact of requested changes (Operations & Maintenance phase)\n\n- Work with developers to understand and troubleshoot technical problems, as needed (Operations & Maintenance... phase)\n\nKey Skills/Qualifications:\n\n- Degree or Diploma in Computer Science, Information Systems, Information/Infocomm Technology, Computer or Electronics Engineering or related discipline\n\n- Minimum 3 years of working experience for Consultant and 5 years of working experience for Senior Consultant\n\n- Participated in full software or product development cycles, preferably using Agile Methodology with past development experience\n\n- Proven experience in IT business analysis, application solutioning and design, and testing\n\n- Strong analytical, conceptualisation and problem solving skills\n\n- Excellent communication skills, both oral and written, with the ability to pitch ideas and influence stakeholders\n\n- Advantageous to have\n\n- Consulting or Business Analysis experience\n\n- Business Analysis certification (Certification of Competency in Business Analysis (CCBA), Certified Business Analysis Professional (CBAP)).\n\n- Knowledge of, or experience in implementing projects in at least one of the following areas (Data Analytics, Agile Methodologies, Internet and Mobile Technologies, Customer Relationship Management, Knowledge Management, Service Design, Cloud Solutioning", "extensions": ["9 days ago", "Full–time"], "detected_extensions": {"posted_at": "9 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJCdXNpbmVzcyBBbmFseXN0IiwiY29tcGFueV9uYW1lIjoiVGVjaGdpZyIsImNvbXBhbnlfbWlkIjoiL2cvMTFjNzNmeGd3dCIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjhhZnl2bEhoUHVETlYxU2ZBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1SUJDcUlCUVU1VlgwNXhVM0oxUmkwek5UbG9WbEYwVlVvd1pFOU5aa0ZTUlVKeVdWSjVRWGxTYVdORk1UbEhjV0prYjBwSGVFeEVjMDR6U21aQloxSmlTR3Q1YzBWQ1pYQlRkbWRGVkRZMFQzcElOekpYTkZKTFJGRnVSVUpIZFU1UUxVSlVXbGc0TFVGTFdWbHBaV1paWldoNlUwOTZURXRpV1ZaaFFXTllVVGRHY25nelJEZFlkaTFMTVVzNFIyeGpZbTB6Y0hBM05EZDVaR0pxYkhWbFRtdzBZazUzRWhkQ1NHMURXVXBVTUVKaFIwWTVVSGRRY1V0NVZuRkJieG9pUVU5TldWSjNRMFpVVFZZdFJXeFFYelJzWkVaa1lYQjVTR0pGZGxKdFFXZFdadyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzU1IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1lbmRlbGV5IiwibGluayI6Imh0dHBzOi8vd3d3Lm1lbmRlbGV5LmNvbS9jYXJlZXJzL2pvYi9idXNpbmVzcy1hbmFseXN0LTEyNTk5ODc/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "HR Analyst, Shared Services", "company_name": "Robert Walters", "location": "Singapore (+1 other)", "via": "via Robert Walters Singapore", "description": "An exciting HR Analyst, Shared Services job has become available at a renowned banking and financial services company. Reporting to the Senior Manager, this role provides an opportunity for a HR professional seeking to progress in their career.\n\nAbout the HR Analyst, Shared Services Role:\nThe HR Analyst, Shared Services, plays a key role within the shared services team and will work closely with internal HR team members to deliver to the line managers smooth administration of onboarding to offboarding core processes.\n\nKey Responsibilities:\n• Oversee transactions related to onboarding of new employees, status changes for existing employees and termination of employees\n• Enhance and update existing standard operating process on HR related transactions\n• Provide advice and guidance on the interpretation of HR policies and procedures as they relate to individuals and the company objectives\n• Respond to unemployment claim inquiries and background check adjudication requests\n• Prepare ad... hoc request for certification and visa letters\n• Manage renewal of contracts and relevant employment pass\n• Assist with maintenance of record management\n• Act as a liaison between external service provides on employment pass matters\n• Develop reports and procedures needed for internal HR departments\n\nTo succeed in this role, you must have two years of HR-related experience (preferably in HR shared services/operation) in an MNC environment or environment with a matrix set-up.\n\nKey Requirements:\n• Degree holder\n• At least two years of HR operations and administration experience, preferably in the financial services sector\n• Excellent verbal and written communication skills\n• Articulate and good analytical skills\n• Independent worker as well as a good team player\n\nAs the leading financial services company in Singapore, they offer a range of products and services including personal and commercial banking, wealth management, corporate and investment banking.\n\nIf you are a talented and a focused HR professional seeking the right opportunity to take your career forward, this HR Analyst, Shared Services role is for you. You will be a part of a forward-thinking company that values innovation and a progressive mindset.\n\nApply now for this exciting opportunity.\n\nDo note that we will only be in touch if your application is shortlisted.\n\nRobert Walters (Singapore) Pte Ltd\n\nROC No.: 199706961E | EA Licence No.: 03C5451\n\nEA Registration No.: R1552021 Deanna Lim", "extensions": ["5 days ago", "$45K–$54K a year", "Full–time"], "detected_extensions": {"posted_at": "5 days ago", "schedule_type": "Full–time", "salary": "$45K–$54K a year"}, "job_id": "eyJqb2JfdGl0bGUiOiJIUiBBbmFseXN0LCBTaGFyZWQgU2VydmljZXMiLCJjb21wYW55X25hbWUiOiJSb2JlcnQgV2FsdGVycyIsImNvbXBhbnlfbWlkIjoiL20vMDY0a3BrcCIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImhuMkdRRFhTTlhvTjdpNDhBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1SUJDcUlCUVU1VlgwNXhVbTFhU0dKcWFtVTRRV05PWTBWTk9GaFpNVEpoVTNOVmNuUnVTbkZ5U0ZsRlpraFRTV3AyTkhwb1dFeHVORWxMTUdWdlpFSXhiMVYwT1RObGRWWnJkMEk0Y2xNNE5EVlpjRTFHWldjdFpGZEZhWFZHVDBWa1RqVnZla3hoWVhwTFRqTkRTVlY0ZVc1dk5DMUdkRmROVjNCcFIyVnlPWHB0ZFdoQlRWcHpUV1I2UTNkU1dISk9kVzVJZURKcFoyczVVbGRyWTNsTllXbG9VMVozRWhkQ1NHMURXVXBVTUVKaFIwWTVVSGRRY1V0NVZuRkJieG9pUVU5TldWSjNRazExWW0xWlZIWjRSbTFOYUY5ZmFFZzVUSFJyTVVwQ1psZG9kdyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzYzIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFJvYmVydCBXYWx0ZXJzIFNpbmdhcG9yZSIsImxpbmsiOiJodHRwczovL3d3dy5yb2JlcnR3YWx0ZXJzLmNvbS5zZy9odW1hbnJlc291cmNlcy9qb2JzL2hyYWRtaW5pc3RyYXRpb24vMTQzNzY3OS1oci1hbmFseXN0LXNoYXJlZC1zZXJ2aWNlcy5odG1sP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Senior Treasury Analyst", "company_name": "VISA", "location": "Singapore", "via": "via Bayt.com", "description": "Job Description and Responsibilities\n\nQualifications", "extensions": ["2 days ago", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgVHJlYXN1cnkgQW5hbHlzdCIsImNvbXBhbnlfbmFtZSI6IlZJU0EiLCJjb21wYW55X21pZCI6Ii9tLzAxa3FqbiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjlVU1BMM2ZFQUlYTWZCWUhBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVzd0JDb3dCUVU1VlgwNXhVWGhJVUdGT0xXRnVaMjFEYzJodGJUWnZNek5IY0ZGdWFERkViRWd0U2pBMVEySjZja3BXWm5oNk5pMDVkbXM1VUdWa1oxWkJRMEZmVjNOMlEzaE1aRXBmWTNVNGNHdGlOamQwVlRSZlR6bExaMFppTlc1aFpIWjNPRzVPZDFNdGJGRlBiVEpHT1Zsb016bHVhMDF5ZVdGR2RrcG1PVFIzTVdrNVpWaHVYM1pLY0c5aGVtY1NGMEpJYlVOWlNsUXdRbUZIUmpsUWQxQnhTM2xXY1VGdkdpSkJUMDFaVW5kQ1VEVlZTa2N5TlZKTFpXdERkbFZUZWt0S0xVeGpWelp3Ykd0MyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzcxIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJheXQuY29tIiwibGluayI6Imh0dHBzOi8vd3d3LmJheXQuY29tL2VuL3NpbmdhcG9yZS9qb2JzL3Nlbmlvci10cmVhc3VyeS1hbmFseXN0LTU5NTc0NDg5Lz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Business Operations", "value": "GC06"}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Accounting and Finance", "value": "GC01"}, {"text": "Science and Engineering", "value": "GC27"}, {"text": "Advertising and Marketing", "value": "GC03"}, {"text": "Customer Service", "value": "GC10"}, {"text": "Legal", "value": "GC17"}, {"text": "Protective Services", "value": "GC23"}, {"text": "Management", "value": "GC18"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Property", "value": "GC24"}, {"text": "Sales and Retail", "value": "GC26"}, {"text": "Social Services and Non-Profit", "value": "GC28"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "Business analyst", "value": "business analyst"}, {"text": "Analyst", "value": "analyst"}, {"text": "Security analyst", "value": "security analyst"}, {"text": "Systems analyst", "value": "systems analyst"}, {"text": "It analyst", "value": "it analyst"}, {"text": "Data analyst", "value": "data analyst"}, {"text": "System analyst", "value": "system analyst"}, {"text": "Support analyst", "value": "support analyst"}, {"text": "Associate", "value": "associate"}, {"text": "Management analyst", "value": "management analyst"}, {"text": "Operations analyst", "value": "operations analyst"}, {"text": "Soc analyst", "value": "soc analyst"}, {"text": "Test analyst", "value": "test analyst"}, {"text": "Intelligence analyst", "value": "intelligence analyst"}, {"text": "Research analyst", "value": "research analyst"}, {"text": "Senior", "value": "senior"}, {"text": "Senior analyst", "value": "senior analyst"}, {"text": "Control analyst", "value": "control analyst"}, {"text": "Manager", "value": "manager"}, {"text": "Project analyst", "value": "project analyst"}, {"text": "Researcher", "value": "researcher"}, {"text": "Risk analyst", "value": "risk analyst"}, {"text": "Service analyst", "value": "service analyst"}, {"text": "Technology analyst", "value": "technology analyst"}, {"text": "Accounting analyst", "value": "accounting analyst"}, {"text": "Application analyst", "value": "application analyst"}, {"text": "Behavior analyst", "value": "behavior analyst"}, {"text": "Business", "value": "business"}, {"text": "Center analyst", "value": "center analyst"}, {"text": "Compliance analyst", "value": "compliance analyst"}, {"text": "Coordinator", "value": "coordinator"}, {"text": "Desk", "value": "desk"}, {"text": "Desk analyst", "value": "desk analyst"}, {"text": "Financial analyst", "value": "financial analyst"}, {"text": "Functional analyst", "value": "functional analyst"}, {"text": "Hr analyst", "value": "hr analyst"}, {"text": "Interns", "value": "interns"}, {"text": "Operations center", "value": "operations center"}, {"text": "Process analyst", "value": "process analyst"}, {"text": "Programmer analyst", "value": "programmer analyst"}, {"text": "Project manager", "value": "project manager"}, {"text": "Qa analyst", "value": "qa analyst"}, {"text": "Senior associate", "value": "senior associate"}, {"text": "Senior consultant", "value": "senior consultant"}, {"text": "Specialist", "value": "specialist"}, {"text": "Sr analyst", "value": "sr analyst"}, {"text": "Support executive", "value": "support executive"}, {"text": "Technical analyst", "value": "technical analyst"}, {"text": "Technical architect", "value": "technical architect"}, {"text": "Trainee", "value": "trainee"}, {"text": "Treasury analyst", "value": "treasury analyst"}, {"text": "Wealth management", "value": "wealth management"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Internship", "value": "INTERN"}, {"text": "Part-time", "value": "PARTTIME"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Research", "value": "/business/naics2007/5417"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Mining", "value": "/business/naics2007/21"}, {"text": "Real Estate", "value": "/business/naics2007/53"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Engineering Services", "value": "/business/naics2007/5413"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Utilities", "value": "/business/naics2007/22"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "SingTel", "value": "/m/020zfl"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "Trustwave", "value": "/m/0n3xjf5"}, {"text": "Government Technology Agency", "value": "/g/11gh0528nq"}, {"text": "OCBC", "value": "/m/055r27"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "Credit Agricole Group", "value": "/m/028vbm"}, {"text": "UL", "value": "/m/01q1gj"}, {"text": "VISA", "value": "/m/01kqjn"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "American Express", "value": "/m/01w6dw"}, {"text": "Avensys Consulting", "value": "/g/11g7022gjf"}, {"text": "Binance", "value": "/g/11hcz1r4wl"}, {"text": "BlueVoyant", "value": "/g/11h1y4qdlf"}, {"text": "Caterpillar", "value": "/m/0319hp"}, {"text": "Cognizant Singapore, Cognizant Technology Solutions", "value": "/m/03bf9h"}, {"text": "DBS Bank Ltd", "value": "/m/01q7n5"}, {"text": "Deloitte SEA", "value": "/g/11f_g4x9d_"}, {"text": "Dyson", "value": "/m/05cskg"}, {"text": "EPAM Systems", "value": "/m/0dlnrc"}, {"text": "Experis Singapore", "value": "/g/11dxpnwm3s"}, {"text": "HSBC", "value": "/m/096k1t"}, {"text": "JPMorgan Chase & Co.", "value": "/m/01hlwv"}, {"text": "Jobline Resources Pte Ltd", "value": "/g/11gp2647pn"}, {"text": "Marina Bay Sands Pte Ltd", "value": "/m/09mhd9q"}, {"text": "Medtronic", "value": "/m/03z4j3"}, {"text": "Mizuho Bank", "value": "/m/022103"}, {"text": "Public Service Division", "value": "/g/11g6__bv10"}, {"text": "RECRUIT EXPRESS PTE LTD", "value": "/g/11g706hzhq"}, {"text": "RHB Singapore", "value": "/g/11c73srg7f"}, {"text": "Randstad", "value": "/m/08pt1z"}, {"text": "Randstad Singapore", "value": "/g/11g70b50mr"}, {"text": "SITA", "value": "/m/06l20z"}, {"text": "Selby Jennings", "value": "/g/11fy2ds3gn"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "Xcellink Pte Ltd", "value": "/g/11c73prcqy"}, {"text": "Xilinx", "value": "/m/03dwkc"}, {"text": "103 Golden Agri International Pte Ltd", "value": "/g/11fy210tb9"}, {"text": "Activate Interactive Pte Ltd", "value": "/g/11dxq192l5"}, {"text": "Amazon", "value": "/m/0mgkg"}, {"text": "Apple", "value": "/m/0k8z"}, {"text": "Aramco", "value": "/m/01qjg2"}]}]}