{"search_metadata": {"id": "60827a090ead41dedfe0dc80", "status": "Success", "json_endpoint": "https://serpapi.com/searches/5bc28cdebdd71c16/60827a090ead41dedfe0dc80.json", "created_at": "2021-04-23 07:40:57 UTC", "processed_at": "2021-04-23 07:40:57 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28consultant%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=90", "raw_html_file": "https://serpapi.com/searches/5bc28cdebdd71c16/60827a090ead41dedfe0dc80.html", "total_time_taken": 3.3}, "search_parameters": {"q": "(consultant) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "90"}, "jobs_results": [{"title": "Consultant", "company_name": "None", "location": "Singapore", "via": "via Jobs", "description": "We are looking for a Consultant to work on Automation in BPM Pega systems using Tricentis ToscaRequirements: Tricentis Tosca 3 years of Hand on experience in testing and automation using TOSCA 3 5 years of functional test automation for desktop and or web applications preferably banking solutions Strong experience of understanding functional requirements and developing automated test scenarios test cases scripts test data Minimum of AS1 AS2 TDS1 and TDS2 certified AE1 and AE2 preferred Experience in using TCD is a must Experience in using externalized test data in TOSCA is a must Experience in TOSCA BI is an added advantage Experience in developing automated test scripts for testing for Web Based React JS HTML5 Certified in either Perfecto or SeeTest for Mobile Automation Experience in developing and enhancing automation frameworks Experience Certification in Tricentis qTest is an added advantage Nice-to-Have Skills: BI is an added advantage Experience in developing automated test... scripts for testing for Web Based React JS HTML5 Certified in either Perfecto or SeeTest for Mobile Automation Experience in developing and enhancing automation frameworks Experience Certification in Tricentis qTest is an added advantage", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDb25zdWx0YW50IiwiY29tcGFueV9uYW1lIjoiTm9uZSIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoid1FkRFlmN0VUX3ZIdFEzX0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIiwibGluayI6Imh0dHBzOi8vc2cuZmlkYW50by5jb20vam9icy9qb2Itb3BlbmluZy9jb3Vuc2Vsb3JzLWFsbC1vdGhlci9jb25zdWx0YW50LTI3NTQyMTI5Mz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Financial Services Consultant", "company_name": "Crown Organisation", "location": "Singapore", "via": "via Glints", "description": "If you are fresh-Graduates or Undergraduates in your 3rd or last year of studies or looking for a part time work. We have a program customised according to your schedules so you do not need to worry about affecting your studies or other commitments!\n\nIf this is what you are looking for, look no more! Through our program we will help you to maximise your exposures to finance industry and earn the income you want while you have other commitment!\n\nRemuneration Package and Benefits:\n• Structured Training and ongoing training programs\n• 1-1 Mentorships\n• Work-life balance; flexible working hours\n• Career opportunites for Management Position\n• Industry and company recognition\n• Sponsorship of CFMAS papers, M5, M9, M9A\n• Salary up to $6,000* exclude incentive+ Bonus + Commission*\n\nJob Requirements:\n• Singaporean and/or Singapore Permanent Resident (PR)\n• At least 21 years old (based on MAS requirements)\n• Min Diploma in Singapore polytechnic or equivalent OR GCE “A” level certification\n•... Willingness to learn", "extensions": ["10 days ago", "$2K–$6K a month", "Part-time"], "detected_extensions": {"posted_at": "10 days ago", "schedule_type": "Part-time", "salary": "$2K–$6K a month"}, "job_id": "eyJqb2JfdGl0bGUiOiJGaW5hbmNpYWwgU2VydmljZXMgQ29uc3VsdGFudCIsImNvbXBhbnlfbmFtZSI6IkNyb3duIE9yZ2FuaXNhdGlvbiIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiY2liRXpVcThta2x1TXo5akFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBHbGludHMiLCJsaW5rIjoiaHR0cHM6Ly9nbGludHMuY29tL3NnL29wcG9ydHVuaXRpZXMvam9icy9maW5hbmNpYWwtc2VydmljZXMtY29uc3VsdGFudC9kNDk0ODFmMC0wZTIyLTQ2ODAtODE2NS1lMmE2YjFhNGQzNDI/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "SharePoint Consultant", "company_name": "Espire Infolabs (Singapore) Pte Ltd", "location": "Singapore", "via": "via Joblum Singapore", "description": "We at Espire Infolabs (a CMMi-5) Global IT services organization is looking forward to hire SP resources as per the undermentioned JD.\n\nExperience- 3+ years into SharePoint\n\nJob Description(JD) below\n• Should have experience in SharePoint 2016/2013/2010 Development - Master Pages, Layouts, Web Parts, OTB Features and Custom Solution.\n• Should have experience in Workflows, Timer jobs, Event Handlers and Content Types.\n• Should have experience/exposure in O365, SharePoint Online, PowerApps, MS Flows/Power Automate and SharePoint Framework(SPFx).\n• Should have good Knowledge of Responsive Design and its integration with SharePoint.\n• Should have experience in building Custom Web Service and SharePoint Security Models.\n• Should have good knowledge of SharePoint Object Model.\n• Should have experience/exposure in SharePoint migration.\n• Should have experience in handling/working with international clients.\n• SharePoint certification will be an added advantage.\n\nShould have good written and... verbal communication", "extensions": ["3 days ago", "$7K–$10K a month", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time", "salary": "$7K–$10K a month"}, "job_id": "eyJqb2JfdGl0bGUiOiJTaGFyZVBvaW50IENvbnN1bHRhbnQiLCJjb21wYW55X25hbWUiOiJFc3BpcmUgSW5mb2xhYnMgKFNpbmdhcG9yZSkgUHRlIEx0ZCIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiRU9mVHNJTFNFQmx6ZjVCN0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JsdW0gU2luZ2Fwb3JlIiwibGluayI6Imh0dHBzOi8vc2cuam9ibHVtLmNvbS9qb2Ivc2hhcmVwb2ludC1jb25zdWx0YW50LzYyNjYyMT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "RISK Principal Consultant", "company_name": "VERIZON COMMUNICATIONS SINGAPORE PTE. LTD.", "location": "Singapore", "via": "via GrabJobs", "description": "RISK Principal Consultant for Network Security role is a strong consulting lead role and has the responsibility to work directly with a team of senior consultants and consultants in order to successfully deliver/lead consulting projects in Verizon RISK Team portfolio for Verizon Enterprise Solutions.\n\nAs a Principal Consultant, the role requires sound consulting, technical, documentation and pre-sales skills in the Information Security and IT solutions. Oftentimes this staff would be required to orchestrate between multiple departments to ensure a right solution is brought to a customer.\n\nAs a Principal Consultant, the role requires minor supervision and is required to take a lead role to drive new revenue business on behalf of Verizon’s RISK team.\n• Utilizes knowledge of Incident Response and Computer Forensics fundamentals.\n• Utilizes excellent senior level relationships in the Industry (especially BFSI, ITES/BPO, Manufacturing, Retail) through excellent delivery of consulting... solutions and projects.\n• Ensures that the established revenue targets on a quarterly / annual basis for all established targets are met or exceeded.\n• Ensures correct and timely delivery of consulting projects for Verizon’s customers in India.\n• Works on proposal development and effort estimations for new opportunities. Develops customer ready presentations and proposals.\n• Shows continued self-improvement in the product discipline to further understand industry, and products.\n• Effectively manages communication and administrative activities through the delivery of high quality and informative content on any requested report or any deal specific updates requested by management.\n• Engages at executive levels within each account.\n• Creates Partnerships: Provides a trusted partnership for our clients which will create increased customer satisfaction and a streamlined way of doing business with Verizon.\n\nYou’ll need to have:\n• Bachelor’s degree or four or more years of work experience.\n• Eight or more years of relevant work experience in Incident Response and Computer/Digital Forensics domain.\n• Experience in consulting solutions and dealing complex projects within the large enterprise industry/sector (especially BFSI, ITES/BPO, Manufacturing, Retail is a plus)\n• Ability to coach, mentor and train others within Verizon and ability to educate the customer on the benefits of a proposed solution.\n• CISSP/CISM/CISA certification.\n• CHFI/GCFA/PCI QSA certification.\n• ISO 27001 LA/LI certification.\n• Ability to lead cross-functional teams and ensure cohesive efforts toward a shared goal.\n• Knowledge of customer's environments and ability to intelligently and strategically discuss Verizon IT solutions/service delivery capabilities as they relate to our security services and client needs.\n• Ability to prioritize from multiple projects and the ability to clearly communicate project requirements/timelines.\n• Strong written and oral skills and ability to work in complex sales environments, utilizing resources across multiple organizations to achieve sales results.\n• Sales acumen, sales opportunity management and helping sales teams to meet or exceed team sales targets.\n• Willingness to travel up to approximately 25% of the time", "extensions": ["28 days ago", "$12.5K–$20.5K a month", "Full–time"], "detected_extensions": {"posted_at": "28 days ago", "schedule_type": "Full–time", "salary": "$12.5K–$20.5K a month"}, "job_id": "eyJqb2JfdGl0bGUiOiJSSVNLIFByaW5jaXBhbCBDb25zdWx0YW50IiwiY29tcGFueV9uYW1lIjoiVkVSSVpPTiBDT01NVU5JQ0FUSU9OUyBTSU5HQVBPUkUgUFRFLiBMVEQuIiwiY29tcGFueV9taWQiOiIvZy8xMWYwMWZoNjJ3IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiUHh1VnNLV2RZTzZCQ3Vvd0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXJZQ0N2Y0JRVTVWWDA1eFZIZE5VRUZwWTJGcldYUlVkMTlRYjFCdGNTMXpSeTFwTUZWdVVYRTVURkZmU0ROSFkyTklkM0ZEVlU5V1UwbHlPRkEyU3pCQ1lUWkpVMEZ2VkRGcVR6aGhOV0l6TWxscGQyOVhNRVpHT0d4NWVsWm9lVWd3TkRkUFkxUmtYM0JFVkVGVmVuUTFWMk5tY210dmNrOXBZelYxWWsweldsODVjVFZVT1VJMGNreHJZa0k1VFVjeFRURXRkSFp6WmpCTWNrVlRRbTl3WW5OME0wTXdOVVZ2UldweVdqQkZjRmxHUVRCSFdqUkRjblJ3UVZwUU5tMHdORTVaUWtWVU0wSTFVVmcwZGpad1VUSkVVVVZKYlRJMVVsQlhiVXhvWTJsWlJXeENUbnBGZUZaQ1MzWlNObWd3WVVoQmNuWmZhbmxGU1JJV1F6TnhRMWxOY2twSlpHWXdkRUZpT0hnMGFsRkNVUm9pUVU5TldWSjNRME5zVUhRM1YzTkZUMmxQZURKQ1QwRktXRTlVZW1STlgwcHpadyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzIxIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEdyYWJKb2JzIiwibGluayI6Imh0dHBzOi8vZ3JhYmpvYnMuY28vc2luZ2Fwb3JlL2pvYi9mdWxsLXRpbWUvb3RoZXJzL3Jpc2stcHJpbmNpcGFsLWNvbnN1bHRhbnQtMTkwNjA4OT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior Consultant", "company_name": "INFOSYS LIMITED SINGAPORE BRANCH", "location": "Singapore", "via": "via MNC Jobs Singapore | MNC Jobs In Singapore", "description": ":\nWe need candidate with SFDC Marketing Cloud + PARDOT + Communities\n1. Roles and Responsibilities:\n• Be expert in the Digital & Telecom Marketing domain and have deep understanding of the Salesforce Marketing Cloud solutions.\n• Responsible for business requirements, functional design, process design (including scenario design, flow mapping, customer journeys), prototyping, configuration, testing, training, defining support procedures.\n• Lead on the design, implementation of technology and creative business solutions\n• Develop/test Pardot and CRM (Salesforce) implementations/integrations and ensure that they are working in cohesion.\n• Set up complex drip campaigns, automation rules, notifications and alerts.\n• Build testing frameworks (split testing, deliverability, and tracking).\n• Create and maintain metrics reports and dashboards on marketing activities to measure campaign effectiveness and ROI.\n• Analyze data to identify prospect, partner and customer trends in consumption of... content and content type (e.g. datasheet vs. webinar vs video, etc.)\n• Maintain and document marketing automation best practices including optimization, date quality, and troubleshooting.\n• Experience in leveraging Salesforce Marketing Cloud for both B2C and B2B use cases\n• Familiarity with complex content creation and management platforms, and related business processes to support high volume, personalized interactions across marketing channels.\n• Utilize technical capabilities to create digital marketing and data management solutions\n• Work with and build complex data structures that integrate Digital Marketing and CRM platforms\n• Train clients on use of software and best practices\n• Communicate on a daily basis with senior management and other internal departments\n• Work closely with team or independently on projects with minimal supervision\n\n2. Skills /Competencies: Salesforce CRM, Marketing cloud, Pardot certified\nEssential:\n• Salesforce Certified Marketing Cloud Consultant.\n• Expert in UI & and all front-end web technologies. Can design some creative websites and html emails.\n• Email Marketing through Salesforce Marketing Cloud ; building and maintaining emails using content tools and Dreamweaver; managing dashboards and leveraging analytics to optimize campaign results using ExactTarget reporting and Google Analytics in conjunction with further analysis in Excel\n• Integrate SFDC with Exact Target App using Rest API to trigger email alerts on real time data change and products of Exact Target such as Journey Builder , Contact Builder etc.\n• Excellent Knowledge of SQL fundamentals and other database technologies.\n• Work with A/B Testing in determine the winner and publishing emails based on the result.\n• Created Microsites using ExactTarget and auto publish them.\n• Configure Exact Target Microsite Activity and archived the Microsite Interaction.\n• Develop Exact Target Dynamic Content and proficient in Ampscript and Programmatic Content Development.\n• Work with marketing cloud Data Model Data Extensions , Profile management and subscriber DE .\n• Experience in migrating the projects from jQuery to Angular JS\n• Writing controllers , services , directives and providers in angular at the web application level\n• Experience in responsive Web design .\n• Exposure to Interaction Studio, Datorama and Advertising Studio.\n• Knowledgeable of web services and especially communicating with the restful end points\n• Experience in writing web application programs covering front-end / UI JQuery for building rich user friendly, high performance web applications.\n• Work on Exact Target tool for email creation, Automation studio, and mobile push.\n• Experience in developing scalable front-end user interfaces using HTML, CSS, and JavaScript , JQuery , and Angular JS .\n• Experience designing and testing compatibility for cross - browser and cross - platform Web application\n• Ability to translate business issues into technical solutions including technical leadership and coordination, and ensuring customer needs are met\n• Ability to work hands on to write and debug code, configuration in salesforce and troubleshoot issues, willing to collaborate with teams across technologies\n• Collaborate with Product owner/Business analysts to understand the requirements/user stories, and translating these to a set of deliverables\n• Guide developers, offshore team members with technical expertise\n• Communicate and collaborate with other internal and external technical resources and stakeholders regarding status, technical issues and creative solutions\n• Ability to work across business and IT stakeholders in providing solutions\n• Should have delivery experience working with the Global delivery model\n• Experience working in Agile programs/methodology (preferred experience on SAFE Agile framework)\n• Leadership abilities, Sound problem solving, communication, organizational, and time management skills\n• Pardot trained and experience on one or two implementations.\n\nCertification requirements -\n• Salesforce Marketing Cloud Email Specialist\n• Salesforce Marketing Cloud Consultant\n• Salesforce Marketing Cloud Developer\n• Pardot consultant\n\nPreferred:\n• Bachelor’s degree or foreign equivalent required. Will also consider one year of relevant work experience in lieu of every year of education\n• At least 10+ years of experience in implementing Marketing Automation solutions with a minimum of 4 years Salesforce Marketing cloud (formerly ExactTarget) implementations.\n\nAdditional Skills:\n• Excellent customer interfacing skills.\n• Excellent written and verbal communication skills.\n• Strong attention to detail and outstanding analytical and Problem-solving skills.\n\nminimumYearsExperience : 10\n\n[CANDIDATES WHO REQUIRE WORK PASSES NEED NOT APPLY", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQ29uc3VsdGFudCIsImNvbXBhbnlfbmFtZSI6IklORk9TWVMgTElNSVRFRCBTSU5HQVBPUkUgQlJBTkNIIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJ4cjdlbDdqbzNLR1RQTW1uQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1OQyBKb2JzIFNpbmdhcG9yZSB8IE1OQyBKb2JzIEluIFNpbmdhcG9yZSIsImxpbmsiOiJodHRwczovL3NnLm1uY2pvYnouY29tL2pvYnMvc2VuaW9yLWNvbnN1bHRhbnQtc2luZ2Fwb3JlLTE0ODQ3Nz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Recruitment Consultant / Lead (Engineering & Supply Chain)", "company_name": "Randstad Singapore", "location": "Singapore (+1 other)", "via": "via Randstad Singapore", "description": "about the company\n\nRandstad was founded in 1960 by Frits Goldschmeding in the Netherlands. Since then, we have expanded operations to 39 markets, representing more than 90 per cent of the global HR services market.\n\nabout the job\n• Drawing up and negotiation of contracts as well as other quotations\n• Creating long last customer relationship with clients\n• Handle job placement, placing suitable candidates to the job position requested by client\n• Liaise and coordinate with clients relating to recruitment requirements\n• Sourcing of candidates through placement of advertisement, interview, selection and offering of employment\n• Arrange and coordinate interview for candidates\n• Client relationship building\n• BD / Cold Call for potential sales lead\n• Evaluate weekly and monthly sales report so as to achieve month/quarterly sales target\n\nskills & experience required\n• Degree / Diploma in Engineering / Business / Marketing / IT / Supply Chain or equivalent\n• Experience in business... development / cold calling / 360 role as recruitment consultant will be a big plus\n• Managed a team of 2/3 recruitment consultant previously can be consider for team lead position\n• Keen to explore sales recruitment in the either of the sector : Manufacturing / Supply Chain / Engineering / M&E\n• CEI certified will be a plus\n• Hunger for sucess, monetary & progression within the organisation\n• Result & sales driven\n• Positive attitude and willing to learn new skills\n• Training provided for candidates with no experience but keen to do consulting sales job\n\nIf you are interested in the position , kindly send your CVs to yitwei.kwan(@)randstad.com.sg\n\nPlease include your availability, expected salary and reason for leaving current job.\n\nWe regret that only shortlisted candidates will be contacted\n\nEA: 94C3609 / Reg: R1325913\n\nskills\nrecruitment\n\nqualification\ndegree\n\nexperience\n1 year\n\nworking hours\nFull-Time\n\neducational requirements\nAssociate Degree/Diploma", "extensions": ["8 days ago", "$3.3K–$6.5K a month", "Full–time"], "detected_extensions": {"posted_at": "8 days ago", "schedule_type": "Full–time", "salary": "$3.3K–$6.5K a month"}, "job_id": "eyJqb2JfdGl0bGUiOiJSZWNydWl0bWVudCBDb25zdWx0YW50IC8gTGVhZCAoRW5naW5lZXJpbmcgXHUwMDI2IFN1cHBseSBDaGFpbikiLCJjb21wYW55X25hbWUiOiJSYW5kc3RhZCBTaW5nYXBvcmUiLCJjb21wYW55X21pZCI6Ii9nLzExZzcwYjUwbXIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJzMlhzeTY3d1lkYm9TbmlWQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdllCQ3JjQlFVNVZYMDV4VVhJMGJGcDRTVkZWTUVWc2JVdDJjVVpwY1U5dGJqTTRhREp3VnpBMWRFeEplWHBUYkhvMVUxSnhRMUUxTW5aMVFWZDNXSGR3UmtGWlFUaHFVekZZWmpJdGRrVnNjbm90VEZwZlVtNDBkVTVRVjNkNmFqaHNUR1ZHY2swelVWcE1iRTVuTWpRdFh6UTVWVGxKVURKSE1WTTBhWFZLVldVNGJ5MTJNVTUwUjA5b1QzbFdiMjh3ZWxZd05uZG5jVkE1WWt0TGFtWmtNeTFqVTJWRFIwdzFSSFJ3ZFZwMk1HdFhXak5DVUhVeU9GRlJFaFpETTNGRFdVMXlTa2xrWmpCMFFXSTRlRFJxVVVKUkdpSkJUMDFaVW5kQ1FWcFBNMUZyZEdWclFWWjFOelZ2YW01RFVuWTRWR2h2U1VWbiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzMzIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFJhbmRzdGFkIFNpbmdhcG9yZSIsImxpbmsiOiJodHRwczovL3d3dy5yYW5kc3RhZC5jb20uc2cvam9icy9yZWNydWl0bWVudC1jb25zdWx0YW50LWxlYWQtZW5naW5lZXJpbmctc3VwcGx5LWNoYWluX3NpbmdhcG9yZV8zNjcwMDA3MS8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Senior Recruitment Consultant", "company_name": "Timeo-Performance", "location": "Singapore (+1 other)", "via": "via SmartRecruiters Jobs", "description": "Company Description\n\nTimeo-Performance provides recruitment, learning & development, and HR consulting services to companies in Asia-Pacific. The company was founded in 2008 and has offices in Singapore, Kuala Lumpur, and Hong Kong. Timeo-Performance provides intercultural training as a joint-venture with the category leading provider Akteos.\n\nWe were founded with a vision to improve the world of work for everyone. We believe that engagement, empowerment and togetherness in our diversity is essential to lasting corporate integrity, innovation and outstanding business results. It is the purpose of each leader and the responsibility of everyone. People make the difference. We help our clients make this difference.\n\nWe strive to provide the highest quality of delivery in a stimulating environment. Proximity, pragmatism, energy, deeply defines how we work with our clients.\n\nDue to continuing success and rapid growth, we are looking for Senior Recruitment Consultant to join our team in... Singapore !\n\nJob Description\n\nPassionate and resilient professionals who can share Timeo-Performance's values: integrity, quality, solidarity and optimism.\n\nWe enable our talents to grow and create their own space for expansion and we are looking for motivated persons willing to learn, progress and contribute.\n\nYou will be given the opportunity to build up your own portfolio and your own team. This is an amazing opportunity for a Senior or Lead Recruiter to take the next step in their career and run a service line in an already successful recruitment business.\n\nYour main missions:\n• Build and expand your clients portfolio - starting with your existing clients\n• Manage the recruitment process from interview to offering stage and beyond. Which includes sourcing and qualifying candidates, conducting the offer negotiation, manage and nurture the relationship with your clients\n• Propose new ideas, way of doing thing better, faster and at an always higher level of quality for our clients.\n\nOur commitment:\n• Support from a strong and experienced management team\n• Learning and development\n• Opportunity to grow your own team, your own business\n• A Corporate Culture which focuses on engagement, responsibility and passion for a job well done!\n\nQualifications\n• You have a strong and successful track record as a recruiter in a Recruitment Company and you want to build your own activity, within the space of a strong and recognised Organisation.\n• You are creative and bold, pro-active in a problem-solving environment\n• You are resilient with a go-get-it attitude\n• You must be flexible, strongly customer oriented and service minded with excellent interpersonal skills\n• You possess strong team spirit with a respect for individuals\n• Prior working sales position is advantageous.\n• CEI certification is required.\n\nAdditional Information\n\nPlease note that only shortlisted candidates will be notified.\n\nThank you for your understanding", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgUmVjcnVpdG1lbnQgQ29uc3VsdGFudCIsImNvbXBhbnlfbmFtZSI6IlRpbWVvLVBlcmZvcm1hbmNlIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJNSE0yVHhWZHlSclc0Nk93QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFNtYXJ0UmVjcnVpdGVycyBKb2JzIiwibGluayI6Imh0dHBzOi8vam9icy5zbWFydHJlY3J1aXRlcnMuY29tL3RpbWVvLXBlcmZvcm1hbmNlLzEwNjc4NTU1MS1zZW5pb3ItcmVjcnVpdG1lbnQtY29uc3VsdGFudD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "SAS Consultant", "company_name": "Azendian Solutions Pte Ltd", "location": "Singapore (+1 other)", "via": "via Monster", "description": "Job Responsibilities:\nDelivers technical architecture related information, leads technical\ndiscovery sessions, responds to architecture and infrastructure questions\nwhen necessary.\nProduce detailed solution architectures to be implemented in our\nclients hosting locations.\nCommunicate recommendations regarding hardware specifications,\nnetworking requirements, and storage sizing to business stakeholders.\nInteract with principal software Technical Support to verify and\ndiscuss issues around specific architectures at client sites.\nAbility to create and assess project artifacts including Visio\ndiagrams, non-functional requirements, and detailed solution\narchitecture.\nProvide architectural and big-picture oversight for development of\nclient implementations.\nProvide assessments and recommendations on the design of data and\nanalytics systems, while integrating components built by developers and\nensuring architectural integrity of the system\nPrepare the Test Plans and conduct Software... Test.\nStay up to date with industry standards and technological\nadvancements that will improve the quality of the data products.\nBe part of highly skilled team, working on high-impact government\nprojects.\n\nRequirements:\nBachelors Degree in Computer Science or related fields.\nAt least 3 to 5 years of relevant technical experience, particularly\nwith SAS.\nUse and administration of the SAS platform. SAS Programming skills\nare desirable.\nHands on experience with SAS Viya architecture solutions.\nDemonstrable expertise in creating SAS Viya visualizations and\ndashboards.\nExperience in installation, configuration and deployment of SAS 9.4\nsolutions, specifically SAS Visual Analytics and SAS Contextual Analysis.\nExperienced in SAS Products SAS EG, SAS Data integration (DI),\nand SAS Visual Analytics (VA) will have added advantage.\nAble to administer the SAS Visual Analytics and SAS Business\nIntelligence environment via SAS Management Console.\nBe customer focused; and have good oral and written communication\nskills", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTQVMgQ29uc3VsdGFudCIsImNvbXBhbnlfbmFtZSI6IkF6ZW5kaWFuIFNvbHV0aW9ucyBQdGUgTHRkIiwiY29tcGFueV9taWQiOiIvZy8xMWR4cHZjamoyIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiaTlqdVB2TERpTUtLT3prRkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRW9zQ0Nzd0JRVTVWWDA1eFZGQnFYMVp3ZUc0M09GRTBVVkV3YkRCM2EyWmhSblJ6TmxWcVRrbGllR1JSVW5WTlFYaDRSRVpGTlhkbE1FZDJaM0ZzVVhOS05teEdaemd5VkU5SWFISkJkWFl6YmkwMFkxZzJVSGx0U25SZldVYzJiVGR0YTBWNlRYQjVObkl0UkZoRU9WTmZZWFZmZDFsaGJtRTNjSEV6WnpCV1ZHOUpYMjF3Y2pkMmVETXdNVlpLWVRsTVdVY3pMVGc0UWxaM2FXNDBZVzl4U0hSNk1uQjFjVVphTjJGWmEzcFJVREUwVlhwd1YwVjFOMkZHZUd4eGR6bGhlVEZPV1ZCS2RIcG5OVEJPVmpWRUVoWkRNM0ZEV1UxeVNrbGtaakIwUVdJNGVEUnFVVUpSR2lKQlQwMVpVbmREWlVOM2FrVXRVMWxYV0VoUmNUUmFkalpmUldOVlNYUTBOV2RuIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNDUiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTW9uc3RlciIsImxpbmsiOiJodHRwczovL3d3dy5tb25zdGVyLmNvbS5zZy9hbXAvam9iLXZhY2FuY3ktc2FzLWNvbnN1bHRhbnQtYXplbmRpYW4tc29sdXRpb25zLXB0ZS1sdGQtc2luZ2Fwb3JlLTI2ODgyNzQzLmh0bWw/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Associate Consultant / Consultant (Red, Offensive Security)", "company_name": "Privasec", "location": "Singapore (+1 other)", "via": "via NodeFlair", "description": "Our Red Team, Offensive Security Consultants work with organisations and technical teams to perform a variety of assessments and provide practical advice to keep them secure. Red team are generally familiar with and apply themselves to most aspects of cybersecurity but specialize in web application security, code reviews, architecture design, network security, attack simulations or even specialist fields such as mainframe or SCADA systems. They help to ensure cybersecurity issues and identified along with their associated risks, and guide organisations to manage this risk in a practical manner.\n\nYou will be:\n· Conducting various security assessments for various technology types\n· Developing security test plans around larger complex projects\n· Coordinate with clients and other specialist consultants in different fields, as required in projects\n· Drive and develop capabilities in specific security areas, (Eg. Secure system architecture design in the cloud)\n· Plan and participate in... areas of security operations to ensure that processes meet defined information security policies and standards, and evolving security threats\n\nA suitable candidate would have some or most of the following attributes:\n· Min. 2 years of experience for Consultant position\n. Demonstrate understanding of penetration-testing methodologies, techniques, and remediation\n· Stimulate real-time cyber-attacks using red-team exercises, perform red-teaming security measures for our client’s IT assets.\n· Vulnerability identification and execution, up to CREST CCT levels preferred\n· Red team experience and certifications such as CREST STAR is a bonus\n· Strong command of penetration testing tooling, in line with the OWASP testing methodology\n· Be able to identify vulnerabilities in web apps/web APIs, and pick up issues in code through manual source code reviews/static code analysis.\n· Understand threats in AWS and other cloud environments. Perform review of hardening controls for such systems.\n· Understand various OS such as Windows, Kali, Linux, and other platforms, to identify vulnerabilities and assist in continuously enhancing penetration testing methodologies.\n\nWhat's in it for you?\n· Work in a dynamic and modern company with a great culture and great people\n· Increased responsibilities in a client-facing role to boost your career. We will support you but not hide you behind a Managing or Principal Consultant\n· Get exposure to a wide range of businesses across all industries\n· Grow your skillset across the entire engagement lifecycle\n· Flexible work arrangements when practical\n· Training and certification opportunities\n· Support for your charitable or technical causes you may lead outside or work.\n· Opportunities to travel - if that motivates you", "extensions": ["28 days ago", "Full–time"], "detected_extensions": {"posted_at": "28 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBc3NvY2lhdGUgQ29uc3VsdGFudCAvIENvbnN1bHRhbnQgKFJlZCwgT2ZmZW5zaXZlIFNlY3VyaXR5KSIsImNvbXBhbnlfbmFtZSI6IlByaXZhc2VjIiwiY29tcGFueV9taWQiOiIvZy8xMWc3MGRia2p6IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoia0VVZ0NmSkpCdEtHRi1Ba0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFZIVkpXamR2TjAxbVMwUnNPVEkxVlhkTlZqaFZZWHBwUzNsV2R6WjJObWRxZFY5M1FXbzJPR1V3WlVOQlExVlJRVEpRZFUxdGIyeHlYM0ZDV1hSWU5XbFFTVUU1TlVKdE5XWlJWbmRtWlRVeU5rUnViazlzWlhRM1R6UXlMVlZZWDFaT1JXdHBWR3hGVEVaUFF6Z3dlRTVLZVVKUlVrbFBlbWMyWDBOd1FteFdabGxpY1haNE1GOWhRVU0xT0hGamRsZzNZbEpZUWxOVlpuZG5FaFpETTNGRFdVMXlTa2xrWmpCMFFXSTRlRFJxVVVKUkdpSkJUMDFaVW5kRU9VUTJTWFZ6VVVwUFUzWmZia2gxYzNWVWREVjNkbFZPZVc5UiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzUyIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE5vZGVGbGFpciIsImxpbmsiOiJodHRwczovL3d3dy5ub2RlZmxhaXIuY29tL2pvYnMvbGlzdGluZ3MvMTAyMDE/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Cyber Security Academy - Cyber Security Consultant", "company_name": "Avanade", "location": "Singapore", "via": "via Avanade Jobs", "description": "Cyber Security Institute Academy\n\nCybersecurity is a must-have topic in all businesses. The question is no longer whether they will be attacked but, when will they? Avanade launches the Cybersecurity Institute, in collaboration with Microsoft, to offer security enthusiasts or those who want to become one to expand their skills on Microsoft's security products to meet market needs.\n• **You will join at Consultant to Senior Consultant level. ***\n\nNote: We are not able to accept applications from those requiring Visa/Work permit sponsorship. Applicants must already be eligible to live and work in UK.\n\nCybersecurity Institute is ...\n\nA full-time certifying training cycle delivered in English lasting 2 months integrating theoretical modules and practical work modules, supervised by cybersecurity experts from Avanade and Microsoft. You will work on the latest technologies in data security, identity, cloud security, endpoint security and alert management while acquiring the latest Microsoft... certifications.\n\nThis program is ideal if you have:\n\n· A solid experience in infrastructure / cloud and that you want to enrich your security skills\n\n· The desire to train on the Microsoft Azure Cloud and its security\n\n· The desire to challenge yourself in a new business\n\nYou are part of the adventure if ...\n\n· You have more than 5 years of experience on one or more of the following subjects:\n\n· Microsoft infrastructures (Active Directory, Windows Server, Workstation)\n\n· Cloud (Azure, GCP, AWS)\n\n· Network topology\n\n· Knowledge of security products (EDR, identities, Cloud security, Data, SOC, etc.)\n\n· You are ready to discover and master new technologies\n\n· You have a very good level of written and spoken English\n\n· It's a plus if you already have:\n\n· A security certification (CISSP, SISM, CISA)\n\n· Experience on IS security products\n\n·\n\nYou are…\n\n· Passionate about new technologies and security\n\n· Interested in corporate cybersecurity issues\n\n· Curious, pragmatic, autonomous, versatile.\n\n· Intelligent and insightful\n\nWhat will be your role in the cybersecurity team after the training?\n\nAs a security consultant, you will be required to:\n\n· Advise / define security architectures for our clients\n\n· Implement infrastructures around security\n\n· Write architectural, operational and other documents related to the projects carried out\n\n· Lead technical workshops\n\n· Work with partner editors\n\n· Participate in pre-sales activities\n\nWhy would you choose Avanade?\n\n· You will become part of an active and growing Security community!\n\n· Your future colleagues will help you with questions and challenges. Moreover, there is a pleasant, informal working atmosphere.\n\n· Knowledge development is our focus, and we ensure this both by offering formal training opportunities as well as informal evenings where peers share their knowledge;\n\n· With your passion, you can use the latest Microsoft technology to make a daily difference for our customers in the Enterprise market;\n\n· We have a strong focus on the career and development opportunities of all our people. Everyone has a career advisor who will work with you to create a plan and guide you in choosing from the many training opportunities we offer;\n\n·\n\nBenefits for you:\n\nPrivate Medical Cover, Income Protection Policy, Extended benefits, Bonus, 80 hours per annum studying towards Microsoft Certifications, generous pension, car allowance, and much more.\n\nAbout Avanade\n\nAvanade leads in providing innovative digital services, business solutions and design-led experiences for its clients, delivered through the power of people and the Microsoft ecosystem. Our professionals combine technology, business and industry expertise to build and deploy solutions to realize results for clients and their customers. Avanade has 39,000 digitally connected people across 25 countries, bringing clients the best thinking through a collaborative culture that honors diversity and reflects the communities in which we operate. Majority owned by Accenture, Avanade was founded in 2000 by Accenture LLP and Microsoft Corporation. Learn more at http://www.avanade.com/\n\nAvanade® is an Equal Opportunity Employer. We evaluate applicants without regard to race, colour, age, religion, sex, national origin, gender identity or expression, sexual orientation, disability, veteran, military or marital status, genetic information or any other protected status.\n\nWe will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation", "extensions": ["29 days ago", "Full–time"], "detected_extensions": {"posted_at": "29 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDeWJlciBTZWN1cml0eSBBY2FkZW15IC0gQ3liZXIgU2VjdXJpdHkgQ29uc3VsdGFudCIsImNvbXBhbnlfbmFtZSI6IkF2YW5hZGUiLCJjb21wYW55X21pZCI6Ii9tLzA5NDQ1NiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Im5qNVZPUWJCclEzZE1jVFVBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVzc0JDb3dCUVU1VlgwNXhVM1psT1dzNGJTMTFWMGg0VGt0Sk5XcGlWelF0YldaeE5qUk5YMmQxV25seVRYaEdhVTVaZW5CeVFrODRZekpLTld0M2EzaDVlbmxuYVdsTlJHWXdMWGRWYldad05qZHRkSFJhYzFkWmFUSXpXV05VV1ZablVHNWFRM0ZaVjJKRFlrdFNVVGRyTldKV1ZYUkJaVEEwVEZGcGJHbHVVM3BGTm5CR09USklMVGszUzJObFVtNFNGa016Y1VOWlRYSktTV1JtTUhSQllqaDROR3BSUWxFYUlrRlBUVmxTZDBGSmFEQmpiaTA1Y1d0VGNrOHpSWGhmYVhBNVYwc3dNa2RMYkZFIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNTkiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQXZhbmFkZSBKb2JzIiwibGluayI6Imh0dHBzOi8vY2FyZWVycy5hdmFuYWRlLmNvbS9qb2JzemhzZy9Kb2JEZXRhaWwvQ3liZXItU2VjdXJpdHktQWNhZGVteS1DeWJlci1TZWN1cml0eS1Db25zdWx0YW50LzI3NTUyP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Business Operations", "value": "GC06"}, {"text": "Human Resources", "value": "GC15"}, {"text": "Accounting and Finance", "value": "GC01"}, {"text": "Sales and Retail", "value": "GC26"}, {"text": "Protective Services", "value": "GC23"}, {"text": "Science and Engineering", "value": "GC27"}, {"text": "Management", "value": "GC18"}, {"text": "Advertising and Marketing", "value": "GC03"}, {"text": "Legal", "value": "GC17"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Customer Service", "value": "GC10"}, {"text": "Social Services and Non-Profit", "value": "GC28"}, {"text": "Art, Fashion and Design", "value": "GC05"}, {"text": "Healthcare", "value": "GC14"}, {"text": "Energy and Mining", "value": "GC21"}, {"text": "Sports Fitness and Recreation", "value": "GC29"}, {"text": "Education", "value": "GC11"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "Consultant", "value": "consultant"}, {"text": "Senior consultant", "value": "senior consultant"}, {"text": "Security consultant", "value": "security consultant"}, {"text": "Recruitment consultant", "value": "recruitment consultant"}, {"text": "Lead consultant", "value": "lead consultant"}, {"text": "Associate consultant", "value": "associate consultant"}, {"text": "Principal consultant", "value": "principal consultant"}, {"text": "Associate", "value": "associate"}, {"text": "Financial consultant", "value": "financial consultant"}, {"text": "Functional consultant", "value": "functional consultant"}, {"text": "Presales consultant", "value": "presales consultant"}, {"text": "Technical consultant", "value": "technical consultant"}, {"text": "Application consultant", "value": "application consultant"}, {"text": "Devops consultant", "value": "devops consultant"}, {"text": "Pre-sales consultant", "value": "pre-sales consultant"}, {"text": "Consultants", "value": "consultants"}, {"text": "Development consultant", "value": "development consultant"}, {"text": "Engineer", "value": "engineer"}, {"text": "Hr consultant", "value": "hr consultant"}, {"text": "It consultant", "value": "it consultant"}, {"text": "Senior", "value": "senior"}, {"text": "Services consultant", "value": "services consultant"}, {"text": "Solution consultant", "value": "solution consultant"}, {"text": "Solutions consultant", "value": "solutions consultant"}, {"text": "Business", "value": "business"}, {"text": "Business consulting", "value": "business consulting"}, {"text": "Consulting", "value": "consulting"}, {"text": "Director", "value": "director"}, {"text": "Education consultant", "value": "education consultant"}, {"text": "Hcm consultant", "value": "hcm consultant"}, {"text": "Infrastructure", "value": "infrastructure"}, {"text": "Investment consultant", "value": "investment consultant"}, {"text": "Manager", "value": "manager"}, {"text": "Project manager", "value": "project manager"}, {"text": "Recruitment consultants", "value": "recruitment consultants"}, {"text": "Sap consultant", "value": "sap consultant"}, {"text": "Software engineer", "value": "software engineer"}, {"text": "Specialist", "value": "specialist"}, {"text": "Support consultant", "value": "support consultant"}, {"text": "Systems consultant", "value": "systems consultant"}, {"text": "Systems engineer", "value": "systems engineer"}, {"text": "Technology consulting", "value": "technology consulting"}, {"text": "Academy", "value": "academy"}, {"text": "Accountant", "value": "accountant"}, {"text": "Architect", "value": "architect"}, {"text": "Cloud consultant", "value": "cloud consultant"}, {"text": "Consultancy", "value": "consultancy"}, {"text": "Data engineer", "value": "data engineer"}, {"text": "Deputy director", "value": "deputy director"}, {"text": "Electrical engineer", "value": "electrical engineer"}, {"text": "Employee", "value": "employee"}, {"text": "Finance consultant", "value": "finance consultant"}, {"text": "Financial services", "value": "financial services"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Internship", "value": "INTERN"}, {"text": "Part-time", "value": "PARTTIME"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Accounting", "value": "/business/naics2007/5412"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Engineering Services", "value": "/business/naics2007/5413"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Real Estate", "value": "/business/naics2007/53"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Wholesale", "value": "/business/naics2007/42"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "SingTel", "value": "/m/020zfl"}, {"text": "EY", "value": "/m/0g9jc"}, {"text": "Infosys", "value": "/m/01k8x6"}, {"text": "SearchAsia Consulting Pte Ltd", "value": "/g/11fy260nhz"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "Deloitte SEA", "value": "/g/11f_g4x9d_"}, {"text": "Geco Asia", "value": "/g/11gk72_bt_"}, {"text": "OAKTREE CONSULTING", "value": "/g/11g70jfhtq"}, {"text": "Central Provident Fund Board", "value": "/m/0615qb"}, {"text": "NCS", "value": "/m/0282746"}, {"text": "Trustwave", "value": "/m/0n3xjf5"}, {"text": "Ensign InfoSecurity", "value": "/g/11g4jhymjr"}, {"text": "HCL SINGAPORE PTE. LTD.", "value": "/g/11fy25ngsv"}, {"text": "Horangi", "value": "/g/11fm41wdh3"}, {"text": "LINKBYNET", "value": "/g/11f00s44gb"}, {"text": "NTT", "value": "/m/05mybp8"}, {"text": "RECRUIT EXPRESS PTE LTD", "value": "/g/11g706hzhq"}, {"text": "Randstad", "value": "/m/08pt1z"}, {"text": "Randstad Singapore", "value": "/g/11g70b50mr"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "UBS", "value": "/m/031rxp"}, {"text": "Xcellink Pte Ltd", "value": "/g/11c73prcqy"}, {"text": "Alight", "value": "/g/11fj9r012s"}, {"text": "Avanade", "value": "/m/094456"}, {"text": "Avensys Consulting", "value": "/g/11g7022gjf"}, {"text": "CBRE", "value": "/m/090r7m"}, {"text": "Golder", "value": "/m/02qx9bq"}, {"text": "Hitachi Solutions", "value": "/g/121lyvj9"}, {"text": "IBM", "value": "/m/03sc8"}, {"text": "Marsh & McLennan", "value": "/m/053rw"}, {"text": "Mott MacDonald", "value": "/m/043l4j"}, {"text": "NTT Ltd.", "value": "/m/01c3fq"}, {"text": "Qualtrics", "value": "/m/080nnft"}, {"text": "SAP", "value": "/m/01pf4l"}, {"text": "Techcom Solutions Pte Ltd", "value": "/g/11c73vztx3"}, {"text": "Turner & Townsend", "value": "/m/0cfy6xp"}, {"text": "Thatz", "value": "/g/11dxpx4g1l"}]}]}