{"search_metadata": {"id": "6082793b18ca868bc4cd8351", "status": "Success", "json_endpoint": "https://serpapi.com/searches/eb32b79f628f1cf4/6082793b18ca868bc4cd8351.json", "created_at": "2021-04-23 07:37:31 UTC", "processed_at": "2021-04-23 07:37:31 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28software+developer%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=40", "raw_html_file": "https://serpapi.com/searches/eb32b79f628f1cf4/6082793b18ca868bc4cd8351.html", "total_time_taken": 1.2}, "search_parameters": {"q": "(software developer) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "40"}, "jobs_results": [{"title": "Junior Software Engineer (JavaScript) - Singapore", "company_name": "EPAM", "location": "Singapore", "via": "via JobWiz", "description": "Our APAC cross-border Emerging Engineers Academy (EEA) is a specially designed program that aims to identify, groom and catapult junior technologists into digital architects of the future through a comprehensive and structured methodology that focuses on innovation, collaboration and leveraging new technologies to deliver engineering excellence. Check out this blog article for what our previous batch of graduates from Singapore had to say about the program.\n\nThis is a golden opportunity for recent grads majoring in IT/Computing/Comp Sci/Engineering etc. or those with a basic interest, certification or knowledge of frontend technologies to join us and benefit from the latest and most up-to-date training by our master trainers before embarking on a rewarding career journey with EPAM!\n\nAs an EEA participant, you will undergo a paid 3 month intensive program that blends theory with practice, before graduating as a Junior Software Engineer specializing in JavaScript and other skillsets, to... be deployed immediately into one of our exciting local or global projects upon graduation.\n\nDue to current pandemic situation, please note that this position is open only to Singaporeans (Citizens/PRs), and applicants must be able to start full-time with us in early May 2021.\n\nResponsibilities\n• Participate in full-time EEA (JavaScript) training course for the first three months\n• Play a junior developer role after the training course, with accelerated path to senior or lead roles based on performance\n• Write high quality and testable code following clean code principles\n• Implement functionality by following defined software development process with supervision\n• Read and understand project and requirement documentation\n• Create documentation describing his/her code\n• Participate in Agile Scrum activities: daily standup, demo session, retrospective, planning, etc\n\nRequirements\n• Professional Certification or Bachelor's degree in Computer Science, Software Engineering or related majors\n• Have Object Oriented Programming experience from diploma/degree studies\n• Knowledgeable in Databases and SQL Language\n• Enthusiasm and desire to learn, able to learn technology quickly\n• Good problem solving and analytical skills\n• Good communication skills\n\nWe offer\n• Friendly team and enjoyable working environment\n• Work-life balance and flexible schedule\n• Online training library, mentoring, career development and potential partial grant of certification\n• Unlimited access to LinkedIn learning solutions\n• Referral bonuses\n• Compensation for sick leave and paid time off\n• Opportunities for self-realization", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJKdW5pb3IgU29mdHdhcmUgRW5naW5lZXIgKEphdmFTY3JpcHQpIC0gU2luZ2Fwb3JlIiwiY29tcGFueV9uYW1lIjoiRVBBTSIsImNvbXBhbnlfbWlkIjoiL20vMGRsbnJjIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiei1lVEFzMG00R1I4cVRQdUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXNzQkNvd0JRVTVWWDA1eFZHMHRNMFJTVHpadU5uWk1RVmR1V1hSMldUTTJXSEZEVjIxUVYwTkxRa1l0U1Mxb1UzVXpTRUppYlhCME1XVmZRbGsxVERWMFZtMHRTRFZhVjFaRVJ6bGpjSFY1YW5kNFQyMVJTMnRMZW14VVVtdElMVXBhYTBsWVdqSnJaVUV0T1hRM1RVVkdWbGhxYWw5Nk1scHRabU0zUlZkSlMzUldNMjVZTVhkbE5FRXpXbWhWUjFrU0ZrOHpiVU5aVFZOTVRFMWZSWE5CV0Y5c1REZDNSR2NhSWtGUFRWbFNkMEUyVEY4MmEyOVdOa1o2VkdobFVFczJTVFl5VEVNek5taFNVSGMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY183IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYldpeiIsImxpbmsiOiJodHRwczovL3d3dy5qb2J3aXouc2cvam9iL0NSLTIyMDUxNDc0MTE/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "SERVICENOW SENIOR PORTAL DEVELOPER", "company_name": "None", "location": "Singapore", "via": "via Jobs", "description": "JOB DESCRIPTION: • As a key member of the Global Technology Services (GTS) team you will be responsible for defining best practices for designing, developing solutions, extending and supporting various modules and components of Enterprise applications. You will be involved in the development lifecycle from analysis, design, build, test and release with a focus on delivering solutions against business goals, technical requirements and platform engineering standards and best practices. JOB DETAILS: • Ability to handle Global Operations • Out of the Box thinker and brining best practices for process improvements • Prototype and analysis of Complex Solutions. • Interact with team and guide in technical analysis, designing & performance tuning • Design and code reviews to ensure standards and quality level for the build • Manage in-house & vendor deliverables very optimally to meet time, scope & budget commitments. • Work with globally distributed teams & build excellent working... relationships with other teams inside and outside of Global Software Engineering. • Prepare and report project performance metrics and KPIs EXPERIENCE AND SKILL SETS: • Must have BS Compute Science or equivalent with minimum 5 years or more experience in core Service-now implementation, support • ITIL v3 Foundation Certification preferred. • Strong Experience in ServiceNow Customer Service Management implementation, ITSM workflows • Strong Experience (MUST HAVE] in Service Portal • Extensive hands-on experience of working with script-based ServiceNow components such as business rules, script includes, client scripts, UI pages etc . • Good knowledge of ServiceNow development best practices. • Good knowledge of ServiceNow platform administration. • Experience in creating ServiceNow costume applications. • Customizing ServiceNow applications. • Good knowledge on service portal with experience coding in AngularJS. • Architectural and hands-on Integrations experience with Enterprise suite applications. • Experience with integrations to other systems using the MID server and direct/Scripted web services. • Knowledge and experience with JavaScript, PowerShell, JSON, REST and SOAP. • Monitor health, environment upgrade/clone, usage and overall compliance of the application. • Good functional knowledge on ITSM,ITOM,CSM and other ServiceNow functions. • Desired ServiceNow Trainings/Certifications: ServiceNow System Administration, ServiceNow Advanced System Administration, Scripting in ServiceNow, ServiceNow Orchestration, Application Development in ServiceNow, ServiceNow Customer Service Management • Strong engineering leadership skills with a proven track record of success on large/highly complex projects preferably in the area of Enterprise Apps and Integration. Must have the ability to communicate technical issues and observations. JOB DESCRIPTION: • As a key member of the Global Technology Services (GTS) team you will be responsible for defining best practices for designing, developing solutions, extending and supporting vari Skills: Angularjs, Certified Scrum Master Csm, Designing, global operations, Javascript, Json, Powershell, Rest, Script, Soap Experience: 5.00-7.00 Years", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTRVJWSUNFTk9XIFNFTklPUiBQT1JUQUwgREVWRUxPUEVSIiwiY29tcGFueV9uYW1lIjoiTm9uZSIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiUDMtajNnMnFuWXBqWEwyaEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIiwibGluayI6Imh0dHBzOi8vc2cuZmlkYW50by5jb20vam9icy9qb2Itb3BlbmluZy9pbmZvcm1hdGlvbi10ZWNobm9sb2d5LXByb2plY3QtbWFuYWdlcnMvc2VydmljZW5vdy1zZW5pb3ItcG9ydGFsLWRldmVsb3Blci0yNzg1MDcxOTY/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Software Engineer at Avnet", "company_name": "Avnet", "location": "Singapore", "via": "via BizLINKS Resources Pte Ltd", "description": "Employer Referral\n\nSoftware Engineer at Avnet\n\nJob Summary: Assist in the design and development of IoT software in MCU-based platform Principal Responsibilities: Embedded system software development with good software engineering practices IoT related protocol, sensor and software development performed with sound design considerations Architects, codes, synthesizes, simulates, tests and debugs electronic systems. Provides estimates for completion of tasks and activities. Understands customer's business and technical objectives to determine the optimum tools, devices, and methods the company can offer to assist in the achievement of those objectives. Evaluates, recommends, specifies, installs and maintains design tools. Develops and documents customer proposals, designs, methodologies and user procedures. Writes application notes. Serves as the company's technical representative to clients and suppliers. Other duties as assigned. Job Level Specifications: Foundational knowledge of... specialized disciplines, industry practices and standards, acquired via academic instruction and/or relevant work experience of substantially the same level. Develops solutions to defined tasks, typical assignments and projects. May be solved by the application of specialized foundational knowledge, using existing approaches and solutions. Work is usually performed independently and requires the exercise of judgment and discretion. Receives initial direction although work may be reviewed for accuracy and quality. Collaborates with immediate management and team members within the department or function. Actions typically affect own work assignments and department. Erroneous decisions or failure to accomplish work may require some assistance or resources to remedy. Work Experience: Min 2 years of relevant experience in embedded IoT software development using C/C++ Education and Certification(s): Bachelor or Master Degree in EE/Communication/Computer Engineering Proficiency in C/C++ programming in embedded software environment with driver development experience Experience in lower power IoT connectivity such as NB-IOT, Cat-M1, LoRaWan and Sigfox Experience in at least one IoT protocol such as MQTT, HTTPS, CoAP, and LwM2M and LoRaWAN Hands-on experience using RTOS running on ARM cortex MCU is an advantage Show more\n\nOriginal Joblink: https://sg.linkedin.com/jobs/view/software-engineer-at-avnet-2001288471 ", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciBhdCBBdm5ldCIsImNvbXBhbnlfbmFtZSI6IkF2bmV0IiwiY29tcGFueV9taWQiOiIvbS8wYzh4bWMiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiI1TG5Ud2pvb2dSZWhTeW1oQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFc3NCQ293QlFVNVZYMDV4VVRGS1ZXWXhlVFl5V1U4NWQwUTFjMWQwZFhoa2RVUkZkM1l3Y1ZVMlVITllVbTQwTFRoT05DMDNZMFp0UkRJMVNFb3lSVEphVm01MmVrWjFhV3RIUVhVd09YcEdkMGxsVlRCck4yMTFPSFpHT0hOV2NreFNNRjgyU21KMU4xOTFVekJwTm5kbU0xUkNaelpqUTBJek9FZGpTRkoxTnpJM1pHZGtXREZFYlY4MkxYa3hlR1VTRms4emJVTlpUVk5NVEUxZlJYTkJXRjlzVERkM1JHY2FJa0ZQVFZsU2QwUnhkMFJuWkhSS2VYTlVSVXB1WkVOTlZrZDRRV2RrWmpVeVUzYyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzE5IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJpekxJTktTIFJlc291cmNlcyBQdGUgTHRkIiwibGluayI6Imh0dHBzOi8vd3d3LmJpemxpbmtzLmNvbS5zZy9pbmRleC5waHAvam9iLWxpc3RpbmdzLXB1YmxpYy85Mi1zb2Z0d2FyZS1lbmdpbmVlcnMvMjc5NS1zb2Z0d2FyZS1lbmdpbmVlci0yNzk1P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Software Developer (Backend / Java / J2EE)", "company_name": "Trust Recruit Pte Ltd", "location": "Singapore (+1 other)", "via": "via Shortlisted Jobs | Singapore", "description": "J2EE / Linux Golang Responsibilities: Visualize, design and develop program modules for projects. Involved in full development cycle of the project Troubleshoot the system and detects for error. Involved in monitoring and repair Research and explore new technologies to better improve existing and new products Provide technical support for product maintenance Work closely with the... read more on Shortlisted Jobs | Singapore", "extensions": ["4 days ago", "$3,750–$5,000 a month", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time", "salary": "$3,750–$5,000 a month"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBEZXZlbG9wZXIgKEJhY2tlbmQgLyBKYXZhIC8gSjJFRSkiLCJjb21wYW55X25hbWUiOiJUcnVzdCBSZWNydWl0IFB0ZSBMdGQiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImpfSUM1TGplemVjYkIwQlNBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gU2hvcnRsaXN0ZWQgSm9icyB8IFNpbmdhcG9yZSIsImxpbmsiOiJodHRwczovL3NnLnNob3J0bGlzdGVkam9icy5jb20vam9icy90cnVzdC1yZWNydWl0LXB0ZS1sdGQtc29mdHdhcmUtZGV2ZWxvcGVyLWJhY2tlbmQtamF2YS1qMmVlLTczNzg5Lz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Infrastructure Cloud Engineer (renewable one-year contract)", "company_name": "Robert Walters", "location": "Singapore (+1 other)", "via": "via Robert Walters Singapore", "description": "A great Infrastructure Cloud Engineer (renewable one-year contract) job opportunity has become available at a multinational company.\n\nAbout the Infrastructure Cloud Engineer (renewable one-year contract) Role:\nYou will be responsible for planning, designing and deployment of cloud workloads for Azure and AWS.\n\nKey Responsibilities:\n• Operations and incident management support for workload running on cloud\n• Work with the project team, stakeholders and vendors to ensure cloud deployment is performed as per requirements\n• Evaluate and suggest the most optimised method and cloud SKU\n• Work with various teams to evaluate the suitability and feasibility of application deployment to cloud\n• Keep track of cloud expenses in terms of commitment to various stakeholders\n• Generate various reports related to cloud footprint and present to management\n• Perform periodic reviews and suggest various improvements possible to the existing cloud deployment\n• Plan, design and deploy cloud workloads for... Azure and AWS\n\nTo succeed in this Infrastructure Cloud Engineer (renewable one-year contract) role, you must have experience in Azure and AWS.\n\nKey Requirements:\n• Trained and certified in cloud:\n• Microsoft Azure/AWS/Google environments and operations\n• Cloud systems configuration management\n• Hands-on experience in designing, creating and supporting Azure/AWS environment for a large enterprise\n• Hands-on experience in setting up and on boarding Azure/AWS environment for a large enterprise\n• Experience in troubleshooting common issues related to Azure/AWS\n• Knowledge and experience in various Azure/AWS security features\n• Strong batch and/or PowerShell scripting on Windows\n• Monitoring and management tools on Azure/AWS\n• Expertise in one or more of the following technical domains: Windows, Linux, Database, Storage, Networks, Scripting, Security\n• Ability to learn and adapt to new frameworks/technologies and quickly integrate with them for automation service delivery\n• Ability to find effective workarounds to product limitations/constraints\n• Knowledge experience with DevOps/Automation tools is a plus\n\nThis company offers great opportunities to work with new technologies and has a leading market position.\n\nIf you are willing to join a multinational company, this Infrastructure Cloud Engineer (renewable one-year contract) role would be a great opportunity for you.\n\nApply today or contact me to discuss this role.\n\nDo note that we will only be in touch if your application is shortlisted.\n\nRobert Walters (Singapore) Pte Ltd\n\nROC No.: 199706961E | EA Licence No.: 03C5451\n\nEA Registration No.: R1660884 Irina Kotenko", "extensions": ["24 days ago", "$5K–$7K a month", "Contractor"], "detected_extensions": {"posted_at": "24 days ago", "schedule_type": "Contractor", "salary": "$5K–$7K a month"}, "job_id": "eyJqb2JfdGl0bGUiOiJJbmZyYXN0cnVjdHVyZSBDbG91ZCBFbmdpbmVlciAocmVuZXdhYmxlIG9uZS15ZWFyIGNvbnRyYWN0KSIsImNvbXBhbnlfbmFtZSI6IlJvYmVydCBXYWx0ZXJzIiwiY29tcGFueV9taWQiOiIvbS8wNjRrcGtwIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiQ185TG4tSzJhQWstbUE1SkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFUzRjBTRjh4WTA5R1pWZzRRWGRTWkVjd2FVSkhUMmh0VTBVMlZVbE9SelJ3ZVRRMU5USjJRMGN5WTB0RlJYWnhTM05xVFZoRmFYcHBSbk0wTjBsTU1WbElUWGhWU0hGemMySkhPRzB5VVdobldWUnZPVUl0T0RWNlUwNWxORjgyZW5GQk1YQkdSVkUzVkZCa1dISlZVRXgxYlZwNVNpMTZabEJhZUVSamRtbE9ZbFZHU0dNNExVUnJNRkZVVEdaT2VXZFplRmhvVmkxYVNsZG5FaFpQTTIxRFdVMVRURXhOWDBWelFWaGZiRXczZDBSbkdpSkJUMDFaVW5kQlRFMUZZV2R5VkRsYVR6TjBXWGxsYjBkWWJFdHBUVk5MVVRCMyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzMyIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFJvYmVydCBXYWx0ZXJzIFNpbmdhcG9yZSIsImxpbmsiOiJodHRwczovL3d3dy5yb2JlcnR3YWx0ZXJzLmNvbS5zZy90ZWNodHJhbnNmb3JtYXRpb24vam9icy9pbmZyYXN0cnVjdHVyZS8xNDMzNjcxLWluZnJhc3RydWN0dXJlLWNsb3VkLWVuZ2luZWVyLXJlbmV3YWJsZS1vbmUteWVhci1jb250cmFjdC5odG1sP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Senior Software Developer (Full Stack) - Remote Job in Home based | Jooble", "company_name": "Respondus, Inc.", "location": "Singapore", "via": "via Jooble", "description": "About Respondus, Inc:\nRespondus is a leading developer of assessment applications for higher education, K-12 and skills certification. Thousands of universities, K-12 districts, publishers, and testing centers use our applications to deliver 100 million assessments annually.\n\nWhy join us? Our work matters – assessments help educators know what students are learning. It’s at the beginning, middle, and end of the education process.\n\nRespondus has been a leader in the education industry for 20 years and is a growing, profitable business that is laser-focused on customers. Nearly all our revenue is recurrent (which means institutions pay us an annual fee to use it) and we have no debt or outside investors. This lets us concentrate on long-term growth that is customer-focused.\n\nAbout the position:\nThis is a full-time, full-telecommute position for a full-stack Senior Software developer. You will work with a small, dynamic team of incredibly talented developers who use the latest... technologies to create products used by tens of millions of students and educators.\n\nThis is a soup to nuts position. You must have the mindset that no project is too big or too small. Over time you may own certain products or features, but you needn’t worry you’ll get stuck in a particular role. There are plenty of new projects and challenges to keep your skills honed.\n\nWe are a tight-knit company and each person’s role is highly-valued. Little weight is put on titles (a few of us have them, but they aren’t used much). Everyone works as a team and focuses on creating awesome products that solve real needs in education and learning.\n\nRequired Skills and experience:\n• 7+ years designing and developing large-scale, production-quality code in a professional software developer role\n• 7+ experience with server side Java technologies and frameworks (Spring, Hibernate, JSP)\n• 5+ experience front-end development (HTML, Javascript, JQuery, CSS)\n• Experience with cloud architectures and Amazon Web Services, including EC2, Autoscaling, RDS, DynamoDB and SQS\n• Proficiency with relational databases (MySQL)\n• Proficiency working with Linux-based development/deployment environments\n• Deep understanding of computer science, object-oriented analysis, and software design principles\n• Bachelors or higher degree in Computer Science, Engineering, or related field\n• Demonstrated experience on all parts of the development process, from design to implementation and maintenance on\n• Large-scale development projects, including ownership of significant portions of the code base.\n• Able to work on small, agile teams and multiple concurrent projects.\n\nAdditional Skills:\n• AWS Solution Architect Certification is a plus\n• Mobile development experience (iOS, Android)\n• Experience working with remote/virtual teams\n• Self-starter, team player\n\nMore Information\n• This is full-telecommute position-can reside in AZ, CO, MA, WA\n• Compensation is competitive and will be commensurate with experience.\n\nPlease send a cover letter and resume, plus any additional information that will help us better know you, to View email address on jobs.github.com", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgRGV2ZWxvcGVyIChGdWxsIFN0YWNrKSAtIFJlbW90ZSBKb2IgaW4gSG9tZSBiYXNlZCB8IEpvb2JsZSIsImNvbXBhbnlfbmFtZSI6IlJlc3BvbmR1cywgSW5jLiIsImNvbXBhbnlfbWlkIjoiL2cvMTFkeHBqZHZrMCIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImxCZHdaTE9jZzFlZ1VCQXRBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2WUJDcmNCUVU1VlgwNXhVbXRpTURGak9WOUhSMHBaVEMxNlpXOUhjM2R6VjBKd0xUSndNaTFaTm05aVoySnFUM0JzY1MxZlRYWnlSWEpET0ZCTVdEQTVVSEEzTTFkTWFIaGpUSEpqTUZFeGNGVjNZMk55YnpFdFpFTkNORmhSZGtGblZFY3RXVzVUU0ZkalFsQndVRjh5TTNNd1ZHMXhjWGhKZVhSaVUwNWtaRVJuVUcxSVRWTjVNMUpEVFV4UWVFcEtRVU5WWjNKR2FHTnpaVlJMWVd0clVIbEZNMFpoT0d0M1pEVnVZWGhZUzBOMlp6bFZNbkJ1U1V4M0VoWlBNMjFEV1UxVFRFeE5YMFZ6UVZoZmJFdzNkMFJuR2lKQlQwMVpVbmREZEhOYVYzZFliV3M1YWpKbmVHWnNNMnd0WTBkVFJYcHVlRXgzIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNDAiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9vYmxlIiwibGluayI6Imh0dHBzOi8vc2cuam9vYmxlLm9yZy9qZHAvNTM1NTc4NTEwMzY4OTYwMzk4L1Nlbmlvci1Tb2Z0d2FyZS1EZXZlbG9wZXItKEZ1bGwtU3RhY2spLSstUmVtb3RlLUhvbWUtYmFzZWQ/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Senior Software Engineer", "company_name": "Ninja Van", "location": "Singapore", "via": "via AngelList", "description": "Ninja Van is a late-stage logtech startup that is disrupting a massive industry with innovation and cutting edge technology. Launched 2014 in Singapore, we have grown rapidly to become one of Southeast Asia's largest and fastest-growing express logistics companies. Since our inception, we’ve delivered to 100 million different customers across the region with added predictability, flexibility and convenience. Join us in our mission to connect shippers and shoppers across Southeast Asia to a world of new possibilities.\n\nMore about us:\n• We process 250 million API requests and 3TB of data every day.\n• We deliver more than 1.5 million parcels every day.\n• 100% network coverage with 1000+ hubs and stations in 6 SEA markets (Singapore, Malaysia, Indonesia, Thailand, Vietnam and Philippines), reaching 500 million consumers.\n• 600,000 active shippers in all e-commerce segments, from the largest marketplaces to the individual social commerce sellers.\n• Raised US$400 million over four... rounds.\n\nWe are looking for world-class talent to join our crack team of engineers, product managers and designers. We want people who are passionate about creating software that makes a difference to the world. We like people who are brimming with ideas and who take initiative rather than wait to be told what to do. We prize team-first mentality, personal responsibility and tenacity to solve hard problems and meet deadlines. As part of a small and lean team, you will have a very direct impact on the success of the company.\n\nRole & Responsibilities\n• Design, develop and maintain software that powers Ninja Van's complex logistics operations.\n• Help design the architecture, own development of major initiatives and modules.\n• Work in cross functional teams with product managers, UX designers and QA engineers to ship software on-quality and on-time.\n• Help level up the team; share knowledge, conduct code and design review; drive code quality and process improvement initiatives.\n• Write code that you are proud of, with extensibility, scalability and performance in mind.\n\nRequirements\n• Solid Computer Science fundamentals, excellent problem-solving skills.\n• 3-6 years of backend or frontend development in a product company, with a proven track record of shipping successful software products.\n• Deep experience in most of our tech stack or similar technologies.\n• Bachelor’s or Master’s degree in Computer Science or related field from a top university.\n\nTech stack:\n• Data storage: MySQL, TiDB, Elasticsearch\n• Cache: Hazelcast, Redis\n• Real-time data pipeline: Apache Kafka\n• Backend: Play (Java 8), GoLang, Node.js\n• Frontend: React, AngularJS\n• Mobile: Android SDK, Dart (Flutter), React Native\n• Orchestrator: Kubernetes\n• Containerization: Docker, Containerd\n• Cloud Provider: GCP, AWS\n• Architecture: Micro Services (Frontend and Backend)\n\nSubmit a job application\n\nBy applying to the job, you acknowledge that you have read, understood and agreed to our Privacy Policy Notice (the “Notice”) and consent to the collection, use and/or disclosure of your personal data by Ninja Logistics Pte Ltd (the “Company”) for the purposes set out in the Notice. In the event that your job application or personal data was received from any third party pursuant to the purposes set out in the Notice, you warrant that such third party has been duly authorised by you to disclose your personal data to us for the purposes set out in the the Notice.\n\nNinja Van focuses on Enterprise Software, E-Commerce, Transportation, Logistics, and Content Delivery. Their company has offices in Singapore and Special Capital Region of Jakarta. They have a large team that's between 501-1000 employees. To date, Ninja Van has raised $32.5M of funding; their latest round was closed on April 2016.\n\nYou can view their website at https://www.ninjavan.co/ or find them on Twitter, Facebook, and LinkedIn", "extensions": ["Over 1 month ago", "$55K–$80K a year", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time", "salary": "$55K–$80K a year"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgRW5naW5lZXIiLCJjb21wYW55X25hbWUiOiJOaW5qYSBWYW4iLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjVLb2tHekFGNW9YY3AtZUlBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQW5nZWxMaXN0IiwibGluayI6Imh0dHBzOi8vYW5nZWwuY28vY29tcGFueS9uaW5qYS12YW4vam9icy85Mjc2OC1zZW5pb3Itc29mdHdhcmUtZW5naW5lZXI/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Software Engineer (Nucleus) #BAS2020", "company_name": "Singtel Group", "location": "Singapore", "via": "via Singtel Careers", "description": "About NCS\n\nNCS is a member of the Singtel Group and the leading information, communications and technology (ICT) service provider with presence in the Asia Pacific region.\n\nWe deliver end-to-end ICT solutions to help governments and enterprises realise business value through digital transformation and the innovative use of technology. Over the years, NCS has played a critical role in the Singapore government’s efforts to computerise the civil service sector and integrate IT into its public services\n\nSoftware Engineer (Nucleus)\n\nNucleus is an NCS programme that equips software engineers with professional training, technical expertise and industry experience. We help you develop your ICT skills and accelerate your career as you work on technology projects that make a difference in the lives of people.\n\nWe have designed Nucleus to help build your foundation, develop your technical skillsets and deepen your specialisation experience. You will be immersed in challenging projects and attain... NUS-ISS accredited graduate certification programmes. Through this, you will be on your way to attain a Master of Technology.\n\nNCS is looking for talents with strong interest in application development and maintenance to join our Nucleus programme. Join us as we make a difference and impact to the lives of people to champion digital transformation for the future.\n\nKey Responsibilities\n• Participate in discussions with stakeholders to understand business and system requirements\n• Perform technical tasks to develop/enhance software applications according to Functional and Technical specifications\n• Maintain and improve software applications\n• Execute unit, integration, system and user acceptance testing\n• Using configuration management, integration and build automation tools to deploy applications\n• Identify opportunities and suggest recommendations for system improvement\n\nThe ideal candidate should have/be:\n• Degree in Computer Science or related engineering fields\n• Fresh graduates or with less than two years equivalent practical work experience\n• Proficiency in one or more frontend framework (HTML5/Angular/React JS)\n• Proficiency in one or more backend languages (Java/.NET/Python/PHP)\n• Proficiency in database will be added advantage\n• Experience in frontend and backend web application development will be added advantage", "extensions": ["2 days ago", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciAoTnVjbGV1cykgI0JBUzIwMjAiLCJjb21wYW55X25hbWUiOiJTaW5ndGVsIEdyb3VwIiwiY29tcGFueV9taWQiOiIvbS8wMjB6ZmwiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJCZDR2djA1UEJaRDJkR2VDQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VTFGVU5reFNOVGRZYjFsSmFrZzNVV3hGZDNod05raEVkVFJyWkZWRFpEUk5OMDVRYkRoc1YyWnBPRFJRUTJKc2FVUlJSR1F5UTJkclkweHpUVkZvU0ZSc1MzRTVhamhhWkhoR1JuWlRka3BPU214M1oxOURSMlIyTFVSemNHMU9MV2xDU1hKNk1XeEJWblJxUVhSbFFuWlFjRXR6TTB0c09FRnFUVEkwVTJJMWJYbzBWRlptVTIxYWRsaFVlbGRzVEcxWU56WTJZMVp5VkdWQkVoWlBNMjFEV1UxVFRFeE5YMFZ6UVZoZmJFdzNkMFJuR2lKQlQwMVpVbmRFWTNCSFQzTnpUemwyT0ZWMVdsbGxNeTFVVG1kaFMwdFlkVWxuIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNTMiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gU2luZ3RlbCBDYXJlZXJzIiwibGluayI6Imh0dHBzOi8vZ3JvdXBjYXJlZXJzLnNpbmd0ZWwuY29tL2pvYi9Tb2Z0d2FyZS1FbmdpbmVlci0lMjhOdWNsZXVzJTI5LUJBUzIwMjAtU2luZy81ODA1OTQ5MTAvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Senior Software Developer", "company_name": "Credit Agricole Group", "location": "Singapore", "via": "via Bayt.com", "description": "Summary of the position:\n\nThe position requires a sound technical knowledge to ensure that the delivered solution answers the business’ needs – enhancements, maintenance tasks and bug fixes intended for the cash management system serving Corporate Clients.\n\nMain responsibilities:\n• Provide architecture design and develop solutions for Loan applications\n• Join and lead workshops to prepare detailed estimates\n• Join and lead grooming sessions to prepare technical design\n• Develop solutions following defined standards and high quality\n• Ensure Code quality, delivery and maintenance\n• Perform Technical Lead activities\n• Perform Unitary test and Code/Peer Reviews\n• Support Production – L3\n• Handle Technical test activities (including Integration and UAT) and automation\n\nMain duties details:\n\nTechnical Analysis, Development and Testing\n• Convert Functional Specifications to Technical Specifications\n• Convert User Stories to Technical Stories\n• Assist Functional team members in all... development related activities\n• Perform non-functional testing\n• Conduct integration testing before handing over product for UAT\n• Provide technical support during UAT\n• Assist Technical Leader\n\nMaintenance and support\n• Provide L3 technical support for applications under responsibility\n• Analyse and resolve tickets raised by end-users in production environment\n• Analyse enhancement requests as prioritized by business for live applications under responsibility and provide IT inputs\n• Build and repository management\n• Release Deployment management\n• Assist L1/L2 support to improve support quality over time\n\nTechnical Documentation\n• Prepare and maintain technical documents (PAD, GAD, Code Checklist and other standard documents)\n\nCo-ordination and communication\n• Coordinate with other developers and business analysts as needed to deliver solutions on time and with good quality\n• Coordinate with Information Security, Infrastructure and IT Ops teams\n• Organize meetings on any technical topics under control as needed\nProvide consultancy to managers, developers and other team members\n\nLegal and Regulatory Responsibilities\n• Comply with all applicable legal, regulatory and internal Compliance requirements, including, but not limited to, the Singapore Compliance manual and Compliance policies and procedures as issued from time to time; Financial Security requirements, including, but not limited to, the prevention of Financial Crime and Fraud including reporting obligations to the Money Laundering Reporting Officer.\n• Maintain appropriate knowledge to ensure to be fully qualified to undertake the role. Complete all mandatory training as required to attain and maintain competence.\n\nSecondary duties:\n• Serving as backup person for absent team member, when required.\n• Other duties may be assigned", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgRGV2ZWxvcGVyIiwiY29tcGFueV9uYW1lIjoiQ3JlZGl0IEFncmljb2xlIEdyb3VwIiwiY29tcGFueV9taWQiOiIvbS8wMjh2Ym0iLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJZRjJVVzUtWnkybzNaSlZEQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdllCQ3JjQlFVNVZYMDV4VkU5TGIyYzNTbEEwUVd4MmNtWm1jWFpQUVhWSk9VWm5lR05HVUhaWFFrTllaRmcxZERWdlJsbE9SM0JmYld3MlVXRnZXSFJpWlV4NFZHZE5jMFpSVXpJNFNHdFZaM0YxTkdwSlJUWTFWRmRtY0ZGQ1UwVTBhVmhUUW5ZMFgyVklMVUZOYTNjeWFFOTNaR0pEWkRSUVgxRlpTRzFCWjI5clQyaG9WM3B1Wkc4dFIwMXpOVFJQVW0wMFdFNXRaakJaWW1kM2RXZzNPRk5VTlVScFJ6SlJkMFkzV21vMlRqYzJZemRIVUhaRVJGWTBFaFpQTTIxRFdVMVRURXhOWDBWelFWaGZiRXczZDBSbkdpSkJUMDFaVW5kQlNGZE5ablZoTjJoR1MzaGlNRkYwU0V0WExVSm5PRXd5VDBwbiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzYxIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJheXQuY29tIiwibGluayI6Imh0dHBzOi8vd3d3LmJheXQuY29tL2VuL3NpbmdhcG9yZS9qb2JzL3Nlbmlvci1zb2Z0d2FyZS1kZXZlbG9wZXItNTkwMjA1NzcvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "SOFTWARE ENGINEER (DevOps)", "company_name": "Recruit Expert Pte Ltd", "location": "Singapore (+1 other)", "via": "via Recruit Expert", "description": "Responsibilities:\n• Analysing, designing, coding and maintenance of payment applications.\n• Resolving customer issues.\n• Maintaining and enhancing the existing software for performance improvement\n• Diagnosing software and system failures\n• Performing activities related to test cases.\n\nRequirements:\n• Diploma in Computer Science or Computer Engineering\n• At least 2 years experience in credit card terminal software development.\n• C++ and C#\n• Knowledge in ARM compilers, Eclipse IDE.\n• Knowledge in standards like ISO8583, PCI-DSS\n• Well versed with data cryptography (DUKPT, Master Key)\n• Familiar with EMV certification process in both contact and contactless\n\nSalary: up to $5,000\n\nIf you are keen to apply for the position, kindly email your detailed resume in MS Word to careers@recruit-expert.com\n\nPlease note that only shortlisted candidates will be notified.\n\nRef: 0083718\n\nEA Licence: 19C9701\n\nRegistration: R2197355", "extensions": ["28 days ago", "Full–time"], "detected_extensions": {"posted_at": "28 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTT0ZUV0FSRSBFTkdJTkVFUiAoRGV2T3BzKSIsImNvbXBhbnlfbmFtZSI6IlJlY3J1aXQgRXhwZXJ0IFB0ZSBMdGQiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6InhvUzNJX3VBZWhNMkdGUmtBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gUmVjcnVpdCBFeHBlcnQiLCJsaW5rIjoiaHR0cHM6Ly93d3cucmVjcnVpdC1leHBlcnQuY29tL2pvYi9tY2YtMjAyMS0wMDgzNzE4LTMtc29mdHdhcmUtZW5naW5lZXItZGV2b3BzLz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}], "chips": [{"type": "Title", "param": "job_family_1", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Software engineer", "value": "software engineer"}, {"text": "Senior", "value": "senior"}, {"text": "Test engineer", "value": "test engineer"}, {"text": "Cloud engineer", "value": "cloud engineer"}, {"text": "Engineer", "value": "engineer"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Assurance engineer", "value": "assurance engineer"}, {"text": "Programmer", "value": "programmer"}, {"text": "Coach", "value": "coach"}, {"text": "Qa engineer", "value": "qa engineer"}, {"text": "Devops engineer", "value": "devops engineer"}, {"text": "Frontend engineer", "value": "frontend engineer"}, {"text": "Java engineer", "value": "java engineer"}, {"text": "Solutions engineer", "value": "solutions engineer"}, {"text": "Testing engineer", "value": "testing engineer"}, {"text": "Analyst", "value": "analyst"}, {"text": "Data engineer", "value": "data engineer"}, {"text": "Design engineer", "value": "design engineer"}, {"text": "Development manager", "value": "development manager"}, {"text": "Devops consultant", "value": "devops consultant"}, {"text": "Firmware engineer", "value": "firmware engineer"}, {"text": "Lead engineer", "value": "lead engineer"}, {"text": "Lecturer", "value": "lecturer"}, {"text": "Manager", "value": "manager"}, {"text": "Network systems", "value": "network systems"}, {"text": "Principal", "value": "principal"}, {"text": "Principal engineer", "value": "principal engineer"}, {"text": "Quality engineer", "value": "quality engineer"}, {"text": "Science", "value": "science"}, {"text": "Scrum master", "value": "scrum master"}, {"text": "Security architect", "value": "security architect"}, {"text": "Security engineer", "value": "security engineer"}, {"text": "Senior engineer", "value": "senior engineer"}, {"text": "Senior lecturer", "value": "senior lecturer"}, {"text": "Senior system", "value": "senior system"}, {"text": "Senior technical", "value": "senior technical"}, {"text": "Software architect", "value": "software architect"}, {"text": "Specialist", "value": "specialist"}, {"text": "Stack engineer", "value": "stack engineer"}, {"text": "System engineer", "value": "system engineer"}, {"text": "Technical", "value": "technical"}, {"text": "Trainee", "value": "trainee"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Wholesale", "value": "/business/naics2007/42"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Mining", "value": "/business/naics2007/21"}, {"text": "Rental", "value": "/business/naics2007/532"}, {"text": "Retail", "value": "/business/naics2007/44"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": ".AB4Jjf.qPB6Vc{padding-right:11px}.qfpP8d{padding:7px 0 7px 11px}.S003Ke{flex:none}.ZoN4Lb{color:rgba(0,0,0,.54)}.nAXVG{color:#70757a}.IxQsL{color:rgba(0,0,0,.26)}.xFO1De{color:#fff}.ooFpK{color:rgba(255,255,255,.30)}.mtnwac{color:#4285f4}.WxeeKb{color:#34a853}.hIVRU{color:#f29900}.EXaTMc{color:#fbbc04}.sxn46d{color:#000}.gqMTF{color:#1a73e8}.zpn8Mb{color:#d93025}.dEUPmd{color:#1e8e3e}.PJNo1{color:#fbbc04}Actively Hiring", "value": "e"}, {"text": "EPAM", "value": "/m/0dlnrc"}, {"text": "VISA", "value": "/m/01kqjn"}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Zühlke", "value": "/g/1hh_rg216"}, {"text": "Cardinal Health", "value": "/m/040vzx"}, {"text": "Credit Agricole Group", "value": "/m/028vbm"}, {"text": "GlobalTix Pte Ltd", "value": "/g/11dxpqdhrf"}, {"text": "HCL SINGAPORE PTE. LTD.", "value": "/g/11fy25ngsv"}, {"text": "Jobline Resources Pte Ltd", "value": "/g/11gp2647pn"}, {"text": "Mediacorp", "value": "/m/03qtz1"}, {"text": "Realtek", "value": "/m/05wrm7"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "TECHNOPALS PTE. LTD.", "value": "/g/11dxpvkynp"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "Thales", "value": "/m/01phj4"}, {"text": "UST", "value": "/m/08kb8g"}, {"text": "UrbanFox", "value": "/g/11ghs7y0w6"}, {"text": "Activate Interactive", "value": "/g/11dxq192l5"}, {"text": "Cognizant", "value": "/m/03bf9h"}, {"text": "DELL", "value": "/m/0py9b"}, {"text": "HCL Technologies", "value": "/m/0698gv"}, {"text": "ORACLE", "value": "/m/05njw"}, {"text": "Singapore Press Holdings Limited", "value": "/m/0d7mwh"}, {"text": "Temasek Polytechnic", "value": "/m/098s73"}, {"text": "TikTok", "value": "/g/11fy265933"}, {"text": "Zendesk", "value": "/m/0wkm4pl"}, {"text": "A-it Software Services Pte Ltd", "value": "/g/11dxpy_gl_"}, {"text": "ACCENTURE PTE LTD", "value": "/m/09n8w94"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "Adecco GS", "value": "/m/08gz46"}, {"text": "Atidan Technologies", "value": "/g/11c74f0b8_"}, {"text": "Autodesk", "value": "/m/018nm3"}, {"text": "Avnet", "value": "/m/0c8xmc"}]}]}