{"search_metadata": {"id": "60827b100b50628bc1853684", "status": "Success", "json_endpoint": "https://serpapi.com/searches/04915ad026862860/60827b100b50628bc1853684.json", "created_at": "2021-04-23 07:45:20 UTC", "processed_at": "2021-04-23 07:45:20 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28product+manager%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=170", "raw_html_file": "https://serpapi.com/searches/04915ad026862860/60827b100b50628bc1853684.html", "total_time_taken": 4.96}, "search_parameters": {"q": "(product manager) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "170"}, "jobs_results": [{"title": "Product Manager, Senior (Big Data)", "company_name": "Binance", "location": "Singapore", "via": "via Bayt.com", "description": "Binance is the global blockchain company behind the world’s largest digital asset exchange by trading volume and users, serving a greater mission to accelerate cryptocurrency adoption and increase the freedom of money.\n\nAre you looking to be a part of the most influential company in the blockchain industry and contribute to the crypto-currency revolution that is changing the world?\n\nResponsibilities:\n• Responsible for Binance internal product design and planning, draft PRD requirements and interactive documents, and design product Roadmap.\n• Actively provide industry insights, promote innovation in products and services, and continuously improve efficiency and rationality in product functions.\n• Responsible for cross-functional and cross-department communication and coordination to ensure product quality and progress, and complete related product goals.\n• Support related business needs and achieves business goals with internal and external partners.\n• Transform business... requirements/plans into feasible product requirements/priorities.\n• Work closely with the Dev and QA teams to ensure the smooth delivery of the solution.\n• Analyze product performance data and collect user feedback to optimize user experience.\n\nRequirements:\n• More than 5 years of working experience in Internet products, and has experience with independently product design and implementation of complicated business logic;\n• Full-time enrolment of bachelor degree or above, working experience in mainstream Internet companies is preferred; Logical thinking is clear\n• Systematic front-end product workers are preferred, with deep sensitivity to data\n• Has good product design methodology, good at finding entry points in complex or new businesses, and provide clear ,high-quality product prototypes, flowcharts, wireframes or other related solutions;\n• Have industry vision, good logical ability, clear thinking, good collaboration and communication ability, strong learning ability and stress resistance ability.\n• Due to the business nature, ability to communicate in Mandarin and experience in financial payment industry would be a plus", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9kdWN0IE1hbmFnZXIsIFNlbmlvciAoQmlnIERhdGEpIiwiY29tcGFueV9uYW1lIjoiQmluYW5jZSIsImNvbXBhbnlfbWlkIjoiL2cvMTFoY3oxcjR3bCIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Ik9jaFZJMFVtd3JMTXpYZEVBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1SUJDcUlCUVU1VlgwNXhVMFp0ZDFwdGJ5MXROMlJuZVcxd1prRnBVVEJXU1RKRGVFNW1OelpyYVY5SU5YSTJORXN4VkhkSE5uQmZUVFJzV0VRMllqZGFWbFZqWHpkbmJWWnphSEZWVkVGaGJWazRVakJXUzFKWWRVVXdPVzQwVURaT2FHcGlVa3RQWHpsR1YzbENlREJVTVRGbWMyeExSRVZ0WkhORmVXdE5SM0JJZDJaT1VEaFNSV280UkZONFVuVlZjRUl4T0RkbVZDMW5OVmd6ZEVGQmVrdzRVSFZCRWhkR1NIVkRXVkF5VGtsalIwODVVSGRRYTB0RGNqWkJieG9pUVU5TldWSjNRVkpyYURORU9ITjFaMWRtU25Wc2NtaHZSbTFrV1ZSalN6ZG9RUSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzciLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQmF5dC5jb20iLCJsaW5rIjoiaHR0cHM6Ly93d3cuYmF5dC5jb20vZW4vc2luZ2Fwb3JlL2pvYnMvcHJvZHVjdC1tYW5hZ2VyLXNlbmlvci1iaWctZGF0YS01OTE5ODE0NS8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Wealth Management Hub Product Manager ( IPB Singapore)", "company_name": "Citi bank", "location": "Singapore", "via": "via Bayt.com", "description": "Key Responsibilities\n\nIPB Partnership with Citi UAE and Bahrain ( Project Oasis )\n\n-Help to meet the Plan for Oasis especially on EBR Lines - Investments and FX\n\n-Take ownership for the resolution of issues arising in any function, that are related to Oasis in a timely and comprehensive manner\n\n-Run a Robust engagement rhythm covering daily/weekly/monthly activities including market commentaries, new ideas, focus products, trainings\n\n-Identify specific opportunities to increase Investments and FX in close partnership with the Product Managers/ TSOs at IPB and working with the Market Managers in UAE/Bahrain to drive these opportunities\n\n-Own the Monthly Dashboard of Metrics / Newletters/ Regular Updates to Business Stakeholders and Seniors to monitor and track progress against agreed goals.\n\n-Establish detailed Analytics to drive RM and MM level Productivity and Penetration in Investments and FX and drive the same with the Oasis frontline to drive targeted and time bound... progress\n\n-Take ownership for completion of all activities related to quarterly MCA including submission of all inputs in a timely manner and discussing gaps and findings with the relevant teams in Citi UAE/Bahrain\n\n-Responsible for managing all aspects of the Outsourcing arrangement in relation to Oasis including TPM engagement , Quarterly Heatmaps, ADD, MAS Register etc\n\nFuture IPB Partnerships\n\n-Be a core member of the Project Team and help drive a successful launch\n\n-Handhold the Frontline and other stakeholders Post Launch. Be the point person to resolve teething issues arising in the initial launch phase and post that when the partnership falls into a regular rhythm.\n\n-Establish an efficient rhythm of engagement between the businesses to track progress versus all key milestones\n\n-Coordinate the Post Launch Management Oversight activities including engagement with business seniors, regional stakeholders to ensure all issues are escalated in a timely manner and resolved comprehensively\n\n-Run an efficient project management center ensuring no gaps in documentation, approvals , storage and audit trails\n\n-Responsible for managing all aspects of the Outsourcing arrangement including TPM engagement , Quarterly Heatmaps, ADD, MAS Register etc\n\n-Take ownership for completion of all activities related to quarterly MCA including submission of all inputs in a timely manner and discussing gaps and findings with the relevant teams in Citi\n\nStrategic Initiatives undertaken by IPB\n\n-Part of the Core Team responsible for driving these initiatives. Key responsibilities will include monitoring and tracking all critical deliverables, coordinating between the different work-streams , reporting progress to the oversight forums established for each initiative and helping the business deliver the initiative in a timely and comprehensive manner\n\n-Drive engagement with established Citi Forums reviewing and approving different initiatives including CPAC, DPAC and other relevant\n\nProduct Management Activities on Loans and Deposits\n\n-Be responsible for specific deliverables as part of the Product Team managing Loans and Deposits. This could involve supporting the product managers in their day to day activities and/or in specific initiatives that the team is working on.\n\nQualifications:\n\n5-10 years Experience\n\n•Subject matter expertise in one or more of the following is preferred: Wealth Management, Project Management, Strategy\n\n•Demonstrates consistent track record of having worked as a Program or Program Manager or working in large, strategic cross-functional projects\n\n•Subject matter expertise regarding transformation management and a good understanding of the products and services Citi offers\n\n•General understanding of relevant banking regulation and supervisory expectations for large complex financial institutions\n\n•Track record of managing internal relationships and demonstrated experience in leading sustained change and change management efforts\n\n•Demonstrated ability to think strategically, analytically, and creatively problem solve\n\n•Ability to plan and develop, lead initiatives\n\n•Well-developed listening skills and a strong ability to engage at the senior management level\n\n•Articulate and effective communicator, both orally and in writing\n\n•Strong interpersonal skills, with evidence of working in collaboration across large organizations, including a proactive and ‘no surprises’ approach in communicating issues/requests\n\n-------------------------------------------------\n\nJob Family Group:\n\nProduct Management and Development\n\n-------------------------------------------------\n\nJob Family:\n\nProduct Management\n\n------------------------------------------------------\n\nTime Type:\n\nFull time\n\n------------------------------------------------------\n\nCiti is an equal opportunity and affirmative action employer.\n\nQualified applicants will receive consideration without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.\n\nCitigroup Inc. and its subsidiaries (\"Citi”) invite all qualified interested applicants to apply for career opportunities. If you are a person with a disability and need a reasonable accommodation to use our search tools and/or apply for a career opportunity review Accessibility at Citi.\n\nView the \"EEO is the Law\" poster. View the EEO is the Law Supplement.\n\nView the EEO Policy Statement.\n\nView the Pay Transparency Posting", "extensions": ["9 days ago", "Full–time"], "detected_extensions": {"posted_at": "9 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJXZWFsdGggTWFuYWdlbWVudCBIdWIgUHJvZHVjdCBNYW5hZ2VyICggSVBCIFNpbmdhcG9yZSkiLCJjb21wYW55X25hbWUiOiJDaXRpIGJhbmsiLCJjb21wYW55X21pZCI6Ii9tLzAxZGZiNiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjZBTlNUS0d4QTMxVXF4c29BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1SUJDcUlCUVU1VlgwNXhWRk5LWVVodWNrNDBSM2hsTFRrMmJXczJTMWgzT1hKelZtVkxWSE5CU0ZkQ2RsQnpYMmx1TTBKaWJrWkJja3R3V1cxc1dYcENhbTFYUlVRelkzZEViazlyT1dsck0yMWFiVkZTWlRFMFZXZEhZVzlpUkMxV1dXMDNURzlJVlZkNGVXWlplazgzZFhSRFVtSktZWGw0UjFoSVgxSnJhalZLYzNBM1dEZ3paRGgxY1VwUFRYTXlOMjVCVFRObFFrSmFObTV1YUdwR1QzaENOelZSRWhkR1NIVkRXVkF5VGtsalIwODVVSGRRYTB0RGNqWkJieG9pUVU5TldWSjNRVTlRTVhSaFZGWmtPWEpHWDJGSGNXZHNZMlZWYlcxdmRuQlNVUSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzE1IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJheXQuY29tIiwibGluayI6Imh0dHBzOi8vd3d3LmJheXQuY29tL2VuL3NpbmdhcG9yZS9qb2JzL3dlYWx0aC1tYW5hZ2VtZW50LWh1Yi1wcm9kdWN0LW1hbmFnZXItaXBiLXNpbmdhcG9yZS01OTQ2NTYyMi8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Product Manager, FM Digital Assets-2100008145", "company_name": "Standard Chartered", "location": "Singapore", "via": "via Bayt.com", "description": "Product Manager, FM Digital Assets - (2100008145)\n\nJob: Institutional Banking\nPrimary Location: Asia-Singapore-Singapore\n\nSchedule: Full-time\nEmployee Status: Permanent\nPosting Date: 09/Apr/2021, 2:50:47 AM\nUnposting Date: 12/May/2021, 10:59:00 PM\n\nAbout Standard Chartered\nWe are a leading international bank focused on helping people and companies prosper across Asia, Africa and the Middle East.\n\nTo us, good performance is about much more than turning a profit. It's about showing how you embody our valued behaviours - do the right thing, better together and never settle - as well as our brand promise, Here for good.\n\nWe're committed to promoting equality in the workplace and creating an inclusive and flexible culture - one where everyone can realise their full potential and make a positive contribution to our organisation. This in turn helps us to provide better support to our broad client base.\n\nThe Role Responsibilities\n\nStrategy\n\nThe role is a front office role responsible for... product development, as well as the successful delivery and implementation of new digital asset products across Financial Markets. The role will drive FM’s digital asset strategy, and will work closely with Trading, Sales and Structuring to ensure effective commercialisation of new digital asset products including engagement with external stakeholders such as clients, regulators and industry associations. The role will also collaborate closely with infrastructure and support functions to onboard digital asset products in a robust and sustainable manner.\n\nProduct Innovation and Strategy:\n• The Product Manager must have an in-depth knowledge of digital assets, market structure and understand how these can fit into the broader strategy of the Bank.\n• The Product Manager will work closely with Trading, Sales and Structuring to develop new products that are appropriate and relevant to the Bank’s client base.\n• The Product Manager should also understand current industry developments, the risks associated with digital assets and be able to represent the FM digital asset strategy to external stakeholders including clients, regulator and industry associations.\n• The Product Manager will work closely with Banking and Sales to critically assess opportunities, areas of growth and potential risks, with the aim to drive sustainable growth in digital asset revenues.\n\nTechnology:\n• The Product Manager will work with Technology to design and implement an ecosystem that supports digital assets for Financial Markets.\n• The Product Manager will guide the support and control functions as the Bank launches new products and will ensu", "extensions": ["13 days ago", "Full–time"], "detected_extensions": {"posted_at": "13 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9kdWN0IE1hbmFnZXIsIEZNIERpZ2l0YWwgQXNzZXRzLTIxMDAwMDgxNDUiLCJjb21wYW55X25hbWUiOiJTdGFuZGFyZCBDaGFydGVyZWQiLCJjb21wYW55X21pZCI6Ii9tLzAyaHN6ayIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6InpOSVdlVXpSQV8tUm96SkhBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2Y0JDcmNCUVU1VlgwNXhVa3RvZGpaU1EwNUJhRFZVYW5KSE0ya3hYMEl6TlhadlZEZDJSREE1ZVMxTlJEa3hXa2xXZVd0ME9IaFBRMFZPYmpOc2FsbDBMVTUxWkhWNU1GQnFlSGhUYm10cFRVOVNiRmxDUTB4aVZFVjZhVzFmVUMxWlZHeHZOSEZ5UW0xUVVsOWpZMWh3ZEd4cFpqZGtlVGxuTFRaa1VtVnJTRXBOYWs5U2JHaFNXak5pUmtsaVpIZG9WREV3T0dJeU1sZFdTV2hNYjJkU1UySmZNVWwwVFRoTFNVczNiRXRWZG1SdlIwVk5lbWxpT1VaSkVoZEdTSFZEV1ZBeVRrbGpSMDg1VUhkUWEwdERjalpCYnhvaVFVOU5XVkozUVhkVWVpMVZkMU0wWW1Wb05HTjVSR2RuWWtwaWVETnhla3g1UVEiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18yMyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCYXl0LmNvbSIsImxpbmsiOiJodHRwczovL3d3dy5iYXl0LmNvbS9lbi9zaW5nYXBvcmUvam9icy9wcm9kdWN0LW1hbmFnZXItZm0tZGlnaXRhbC1hc3NldHMtMjEwMDAwODE0NS01OTQwNzYyNS8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "TTS Singapore Pricing Product Manager - VP / AVP", "company_name": "Citi bank", "location": "Singapore", "via": "via Bayt.com", "description": "Key/Selected Responsibilities\n• Ongoing maintenance of the Global Billing System in conjunction with country and regional partners\n• Responsible for the management of pricing strategy for Singapore\n• Strong working partnership with the data team; ensuring a good understanding of the existing product / account / charge codes to form the basis of client pricing\n• Establishing a governance process for new price points to be introduced in Singapore\n• Execution of fee re-pricing across different client tiers and forming a strong working partnership with stakeholders from different parts of the bank\n• Focused on strategic bundle pricing and other forward looking pricing strategy for Singapore along with Workstream 2 (WS2)\n• Build and facilitate “price for value” pricing proposals for Price to Value (P2V) deals working with Workstream 3 (WS3).\n• Evaluating the change impact and organizational readiness to limit potential risk.\n• Supporting training and communication as part of change... management. Activities may include designing or delivering specialized training resources to appropriate userbase.\n• Evaluating the risk of change and providing actionable guidelines on reducing the impact.\n• Evaluating resistance in adopting the change at the user, process, technology and culture level.\n\nDelivers Results\n• Drives fee origination across all products to achieve agreed growth targets, including: Cash Management, Cards, Trade and Cross Currency\n• Maintenance of pricing across products and management of pricing strategy in Singapore with alignment with regional partners\n• Execution of the bundled packages to new and existing clients of the bank\n\nExperience required\n• A highly motivated and experienced professional prepared to lead and manage a complex yet important pricing strategy in Singapore\n• Good handle of TTS Product Suite, including the broad spectrum of Cash Management, Liquidity Management and Trade Finance solutions.\n• Developed communication skills, strong executive presence\n• Leadership by Influence to work across the product and sales/coverage teams in Singapore\n\nCompetencies\n• Forward looking strategic thinker with good understanding of TTS products\n• Creative, innovative, high energy with strong initiative\n• Strong execution and project management skills: thorough follow-through & attention to detail\n• Strong analytical and problem solving skills; familiarity with data analytics a plus\n• Excellent interpersonal skills and ability to work with partners\n\nQualifications\n• Bachelor’s Degree\n• Fluency in English / local language based on location\n\n-------------------------------------------------\n\nJob Family Group:\n\nProduct Management and Development\n\n-------------------------------------------------\n\nJob Family:\n\nProduct Development\n\n------------------------------------------------------\n\nTime Type:\n\nFull time\n\n------------------------------------------------------\n\nCiti is an equal opportunity and affirmative action employer.\n\nQualified applicants will receive consideration without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.\n\nCitigroup Inc. and its subsidiaries (\"Citi”) invite all qualified interested applicants to apply for career opportunities. If you are a person with a disability and need a reasonable accommodation to use our search tools and/or apply for a career opportunity review Accessibility at Citi.\n\nView the \"EEO is the Law\" poster. View the EEO is the Law Supplement.\n\nView the EEO Policy Statement.\n\nView the Pay Transparency Posting", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJUVFMgU2luZ2Fwb3JlIFByaWNpbmcgUHJvZHVjdCBNYW5hZ2VyIC0gVlAgLyBBVlAiLCJjb21wYW55X25hbWUiOiJDaXRpIGJhbmsiLCJjb21wYW55X21pZCI6Ii9tLzAxZGZiNiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Ik01NE1mdlR5UXh6VVVLaFRBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1SUJDcUlCUVU1VlgwNXhValJFTkhOS016Qm9SWEZwU1U0MU5UbG5URTl6UlRJMVpqZHlTSEZEVVc1WWEwMDVUbWhyYURCRWVHUk1NRGhZUW1KSE1qbHBZbTVETFd4eVRHMHpPWEZrT0U1YU5IcFNRbmxyWlVKb1dFMXZMVmM1ZWpWQlJFcHVVSEp1WTFOclNDMUhNbmxNYkRORFRVcHhVbG94TVhSZmJIcFlURk4wVDBWUVNWcGtVMUpGUTJWZmFrWTVXbFJHUjNJd2RqSnJZMmhIZUVOQmJVOTBUbHAzRWhkR1NIVkRXVkF5VGtsalIwODVVSGRRYTB0RGNqWkJieG9pUVU5TldWSjNRbkJPU21sMU0yUlBOekkyYURGRlVXSkRkRGs0WkVsb1RsRlRRUSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzMwIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJheXQuY29tIiwibGluayI6Imh0dHBzOi8vd3d3LmJheXQuY29tL2VuL3NpbmdhcG9yZS9qb2JzL3R0cy1zaW5nYXBvcmUtcHJpY2luZy1wcm9kdWN0LW1hbmFnZXItdnAtYXZwLTU4ODYxNTUyLz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior Product Manager (Front-End)", "company_name": "Binance", "location": "Singapore", "via": "via Bayt.com", "description": "Binance is the global blockchain company behind the world’s largest digital asset exchange by trading volume and users, serving a greater mission to accelerate cryptocurrency adoption and increase the freedom of money.\n\nAre you looking to be a part of the most influential company in the blockchain industry and contribute to the crypto-currency revolution that is changing the world?\n\nResponsibilities:\n• Define, lead, and execute holistic strategy to work towards strategic business goals; collaborate across regions, product areas, and functions.\n• Launch new products and features, test their performance, and iterate constantly and quickly. Identify opportunities and define product vision and strategy.\n• Engage closely with Engineering teams to determine the best technical implementation methods as well as a reasonable execution schedule.\n• Synthesize and drive product strategy from interactions with customers, business stakeholders, Legal, and Policy teams; build and manage an... actionable product roadmap.\n• Launch solutions that solve customer challenges.\n\nRequirements:\n• Bachelor's degree in Computer Science, related technical field, or equivalent practical experience.\n• 5+ years' experience in product design or product management, with experience managing a front end product and developing internet or media products and technologies.\n• End-to-end product management experience with software/web technologies (e.g. on mobile).\n• Experience in software development.\n\nPerfer to Have:\n• Knowledge of the internet, search engines, and online advertising spaces.\n• Knowledge of multiple functional areas, such as Product Management, Engineering, UX/UI, Sales, Customer Support, Finance, or Marketing.\n• Understanding of user experience (UX) and business/commercial challenges.\n• Understanding of go-to-market commerce enablers (e.g. payments, subscriptions, etc", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgUHJvZHVjdCBNYW5hZ2VyIChGcm9udC1FbmQpIiwiY29tcGFueV9uYW1lIjoiQmluYW5jZSIsImNvbXBhbnlfbWlkIjoiL2cvMTFoY3oxcjR3bCIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IkVWSjBCcnlMZ2lEUkc2NGNBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1SUJDcUlCUVU1VlgwNXhVazV1ZGtkMFJtSTNiR1I2T1U5RVJqVjZVVTk0TURCVGMwdzRjMjlsU3pGdWFrTlZhMTlMYld4cFUyeHZiMkZGTmpaQ2NVOXNWRFp1UmtGdWRrMVFSVmh5TFZSc1JUbE9YMTg1VjJRdE1UaFRTRkJCVjNoUVgzWkhiMmQ0TlU4dE1rRkJWSFpoT0RsNGQwaHNTMUpqWlhkelp6Um1lWFIwTW05aExXMXJOMHcwUlRkSVQzaGpaVTVLTkhWNE5ISktkVkoxZFMwdFMwaFBRMnBCRWhkR1NIVkRXVkF5VGtsalIwODVVSGRRYTB0RGNqWkJieG9pUVU5TldWSjNRVmh6T1Y4MlFWZDFNblZMWWtSV2JGTmtVemxNWVdrNGNXcEVkdyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzM4IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJheXQuY29tIiwibGluayI6Imh0dHBzOi8vd3d3LmJheXQuY29tL2VuL3NpbmdhcG9yZS9qb2JzL3Nlbmlvci1wcm9kdWN0LW1hbmFnZXItZnJvbnQtZW5kLTU5MTk4MDM1Lz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "TTS - Commercial Cards Product Manager, Asia Pacific - Vice President", "company_name": "Citi bank", "location": "Singapore", "via": "via Bayt.com", "description": "Key Responsibilities\n• Business:\n• Execution plan to grow regional Commercial Cards B2B portfolio, with key focus on growing non-travel spend, in alignment and close partnership with country, regional and global stakeholders.\n• Closely tracking competitor offerings, conducting market research and reviewing B2B sub product drivers to take appropriate product actions and drive sustainable growth.\n• Structure and deliver innovative B2B solutions meeting evolving market demands and client requirements.\n• Equip Sales and coverage teams with B2B value propositions and differentiators. Drive campaign and initiatives to deliver B2B product drivers and P&L targets. Support and lead client engagement on key B2B deals and relationships.\n• Create comprehensive communication plans to ensure internal teams and clients are updated on new/existing B2B capabilities, including development of client facing product collateral, internal training for stakeholders, online information outlets and webinars... for clients.\n• Partnership development and management for B2B product suite, including 3rd party fintechs, e.g. to deliver smooth client integration solutions.\n• Working with functional partners across service, ops, implementation, tech, legal, compliance, control functions and risk teams for end-to-end management of B2B product.\n• Roll out of various B2B platforms and capabilities through a structured commercialization process with relevant supporting material to facilitate go to market strategy.\n• Vendor management of key B2B partnerships\n• Ability to research, qualify and partner with vendors that complement cards B2B offering to enhance client value proposition.\n• Evaluate and test available solutions for viability including assessing new capabilities and its relevance to the business growth strategy.\n• Commercialize partner solutions and launch services within Asia cards business in partnership with country product managers.\n• Ongoing management of partnerships through constant engagement and evaluating their ongoing contribution to the business.\n• Risk and control\n• Ensure all custom solution go through all Citi defined risk and control processes.\n• Management of discussions with control functions to ensure the feedback is collected and actioned appropriately.\n• Ensure all agreements relating to B2B has the proper sign off from regional and in country legal teams.\n• Managing the credit and operational risk of the B2B portfolio in partnership with risk team.\n• Management of supplier enablement program\n• Collaboration with various acquiring service provider across Asia to enhance supplier enablement experience.\n• Help engagement of key suppliers to facilitate ramp on client B2B programs.\n• Negotiate with partners across the flow ecosystems to define and track specific pricing rates that provide suppliers and clients with the right financial business case to enhance acceptance.\n• Conduct trainings and ensure operability of the supplier matching teams to ensure high quality supplier match information.\n\nKEY COMPETENCIES / SKILLS\n• An understanding of the Commercial Cards ecosystem, clients working capital cycle and procurement B2B practices, track record of partnership and a understanding of vendor management will be an important asset.\n• The successful candidate must be both a leader and a team player, working with regional Product teams, Product Sales and Account Management, and functional teams globally.\n• Business/Industry knowledge/competencies\n• Good understanding of TTS products and services, preferably cards.\n• Sound knowledge of the card associations and banking platforms.\n• Track record of product or client management disciplines.\n• Up-to-date understanding of competitor offering.\n• Personal Attributes/Interpersonal skills\n• Excellent presentation, communication and analytical skills.\n• Strong interpersonal and stakeholder management skills.\n• Well versed in formal Mandarin speaking and writing (Cantonese as an additional skill set is advantageous).\n• Drive for outcome and focus on execution.\n• Strong work ethic, positive attitude and strive for continuous self-improvement.\n• Ability to prioritise and work under pressure\n• Organisation savvy and professionalism; Collaborative\n\nQUALIFICATIONS / EXPERIENCE REQUIRED\n• Undergraduate / Post graduate degree in Business, Finance or Economics or other commercial disciplines.\n• 8-10 years of work experience in the financial services industry, preferably with experience in Transaction Banking and Cards ecosystem.\n• TTS product knowledge and country/regional product management experience.\n• Proven track record of successful product management.\n• Influencing/Collaboration skills.\n\nKEY BUSINESS RELATIONSHIPS\n• Internal\n• Regional/Country/Global TTS teams – Sales, Product, Services, Implementation and Operations\n• Functional partners: Relationship Managers, Legal, Compliance, Operations, Technology\n• External\n• Clients\n• Partners like but not limited to Visa, MasterCard, Gemalto, Sykes, Hexaware\n\nSUMMARY\n\nThis is an excellent opportunity for a highly motivated and capable individual to join a fast growing and exciting business.\n\n-------------------------------------------------\n\nJob Family Group:\n\nProject and Program Management\n\n-------------------------------------------------\n\nJob Family:\n\nProject Management\n\n------------------------------------------------------\n\nTime Type:\n\n------------------------------------------------------\n\nCiti is an equal opportunity and affirmative action employer.\n\nQualified applicants will receive consideration without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.\n\nCitigroup Inc. and its subsidiaries (\"Citi”) invite all qualified interested applicants to apply for career opportunities. If you are a person with a disability and need a reasonable accommodation to use our search tools and/or apply for a career opportunity review Accessibility at Citi.\n\nView the \"EEO is the Law\" poster. View the EEO is the Law Supplement.\n\nView the EEO Policy Statement.\n\nView the Pay Transparency Posting", "extensions": ["10 days ago", "Full–time"], "detected_extensions": {"posted_at": "10 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJUVFMgLSBDb21tZXJjaWFsIENhcmRzIFByb2R1Y3QgTWFuYWdlciwgQXNpYSBQYWNpZmljIC0gVmljZSBQcmVzaWRlbnQiLCJjb21wYW55X25hbWUiOiJDaXRpIGJhbmsiLCJjb21wYW55X21pZCI6Ii9tLzAxZGZiNiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImZkVW5UR2g3X0d3elZDcWNBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1SUJDcUlCUVU1VlgwNXhVVlEwZFhGUlpVZDVZVWRWUlRoVU5UbHZRbTFVUm5BNFIyb3lNSHBTTWpoQ2NXVnRNa3BNU1VOaFdXaGxkWHB6TTBrdGFWUldkREZzTlU0MUxVdEVRbEppYWtkSGQydG9hM294UldSdFUzSmtkRUo0T0VkVmJsOW1NMEp4ZUc5RFQyNVBjbXBsTjB0WmVGVkxabDkxT0cxbmRuQXlTRTQwWW1oaGRFMW5jekU1U0ZFMFMycGtkVW8xWDNwYU1rdHpPVWR5WjFOUGFWVnRORmgzRWhkR1NIVkRXVkF5VGtsalIwODVVSGRRYTB0RGNqWkJieG9pUVU5TldWSjNRM0l5TW5GcWVVaHJhRzQwYVhKa2JsRndiVXRTYUVKNFl6Z3RkdyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzQ2IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJheXQuY29tIiwibGluayI6Imh0dHBzOi8vd3d3LmJheXQuY29tL2VuL3NpbmdhcG9yZS9qb2JzL3R0cy1jb21tZXJjaWFsLWNhcmRzLXByb2R1Y3QtbWFuYWdlci1hc2lhLXBhY2lmaWMtdmljZS1wcmVzaWRlbnQtNTk0NTAwMzIvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Digital Channels & Client Experience - Product Manager (AVP)", "company_name": "Citi bank", "location": "Singapore", "via": "via Bayt.com", "description": "The Digital Exp Analyst is a seasoned professional role. Applies in-depth disciplinary knowledge, contributing to the development of new techniques and the improvement of processes and work-flow for the area or function. Integrates subject matter and industry expertise within a defined area. Requires in-depth understanding of how areas collectively integrate within the sub-function as well as coordinate and contribute to the objectives of the function and overall business. Regularly assumes informal/formal leadership role within teams. Involved in coaching and training of new recruits.\n\nResponsibilities:\n• Would be responsible for managing one or more Digital product verticals within the team\n• Plays a key role in developing and managing the implementation of features within this vertical (Citibank Online and Citi Mobile App) for existing customers across businesses\n• Manages key projects/digital initiatives and delivers positive outcomes in line with business deadlines. Works with... the Business product teams to deliver priority features to customer facing platforms\n• Performs Product Management on medium to large scale projects from inception through to delivery\n• Suggest innovative ideas and improvements in the customer journey to improve responses and design, and work as problem solver for key initiatives\n• Build the capability to monitor the mobile app performance for the new features\n• Work with the other Digital Product Managers to share the best practices across the team\n• Leverage local and regional relationships to ensure delivery of key projects and initiatives\n• Manages key projects/digital initiatives and delivers positive outcomes in line with business deadlines\n• Meet Key Performance Indicators; meet Customer Satisfaction and Net Promotor Score goals\n• Support monthly releases and perform business sanity testing\n• Adhere to the product governance and ensure sufficient approvals are obtained prior to the launch of every digital feature\n• Appropriately assess risk when business decisions are made, demonstrating particular consideration for the firm's reputation and safeguarding Citigroup, its clients and assets, by driving compliance with applicable laws, rules and regulations, adhering to Policy, applying sound ethical judgment regarding personal behavior, conduct and business practices, and escalating, managing and reporting control issues with transparency.\n\nQualifications:\n• 5 to 8 years of experience\n• Experience working within a Product and/or Project Management role within a large institution\n• Strongly client-obsessed with a focus on delivering solutions that work for end customers rather than delivering projects\n• Excellent numerical/analytical capability\n• Consistently demonstrates clear and concise written and verbal communication\n• Ability to think strategically and then execute upon that design\n• Proven ability to plan and coordinate multiple streams of work to effectively deliver high-quality, sustainable results as required by the business\n• Ability to handle multiple tasks and prioritize workload\n• Lateral thinker who demonstrates drive and commitment to delivering innovative solutions\n• Customer-centric\n• Adaptable and resilient\n\nEducation:\n• Bachelor’s/University degree or equivalent experience\n\n-------------------------------------------------\n\nJob Family Group:\n\nProduct Management and Development\n\n-------------------------------------------------\n\nJob Family:\n\nDigital Product Management\n\n------------------------------------------------------\n\nTime Type:\n\nFull time\n\n------------------------------------------------------\n\nCiti is an equal opportunity and affirmative action employer.\n\nQualified applicants will receive consideration without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.\n\nCitigroup Inc. and its subsidiaries (\"Citi”) invite all qualified interested applicants to apply for career opportunities. If you are a person with a disability and need a reasonable accommodation to use our search tools and/or apply for a career opportunity review Accessibility at Citi.\n\nView the \"EEO is the Law\" poster. View the EEO is the Law Supplement.\n\nView the EEO Policy Statement.\n\nView the Pay Transparency Posting", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEaWdpdGFsIENoYW5uZWxzIFx1MDAyNiBDbGllbnQgRXhwZXJpZW5jZSAtIFByb2R1Y3QgTWFuYWdlciAoQVZQKSIsImNvbXBhbnlfbmFtZSI6IkNpdGkgYmFuayIsImNvbXBhbnlfbWlkIjoiL20vMDFkZmI2IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiT3JxdWJHTjBPOEF3MjhEZUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVJQkNxSUJRVTVWWDA1eFVWQTVUVzAzTTI1b2VHTjJhbUZtYlU1T1p6UjJNMFl0UlZWRFRsQklOMll0UjI1dGNqY3laMUpxVjBZMVJ6SjVWVkp0VTFCVWEzVmpTV1ZmVkdaMVlsbFVWSGhUZW01dFFsRlFXWGhPVW5wV056QlVUbXgxUzNJMU9HbHJPRTlsV1RsUmIxVk5XRU0xVVhsQlIzbGFTa053TlRSNVRUa3lUblJoYTNwbGJURnhkRzVQYjNvd1lYcFZNbVJHYm5ac1FVb3llbWd5TUhwT1drWm5FaGRHU0hWRFdWQXlUa2xqUjA4NVVIZFFhMHREY2paQmJ4b2lRVTlOV1ZKM1JEWTJMVlJ5YldzNUxWSkxWSGhPVkZSdFVscEtXV1EyY2t4bWR3IiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNTQiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQmF5dC5jb20iLCJsaW5rIjoiaHR0cHM6Ly93d3cuYmF5dC5jb20vZW4vc2luZ2Fwb3JlL2pvYnMvZGlnaXRhbC1jaGFubmVscy1jbGllbnQtZXhwZXJpZW5jZS1wcm9kdWN0LW1hbmFnZXItYXZwLTU5MDQyNDExLz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Management", "value": "GC18"}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Business Operations", "value": "GC06"}, {"text": "Advertising and Marketing", "value": "GC03"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Accounting and Finance", "value": "GC01"}, {"text": "Legal", "value": "GC17"}, {"text": "Farming and Outdoors", "value": "GC13"}, {"text": "Human Resources", "value": "GC15"}, {"text": "Sales and Retail", "value": "GC26"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "Product manager", "value": "product manager"}, {"text": "Manager", "value": "manager"}, {"text": "Project manager", "value": "project manager"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Development manager", "value": "development manager"}, {"text": "Director", "value": "director"}, {"text": "Manufacturing manager", "value": "manufacturing manager"}, {"text": "Marketing manager", "value": "marketing manager"}, {"text": "Plant manager", "value": "plant manager"}, {"text": "Production manager", "value": "production manager"}, {"text": "Program manager", "value": "program manager"}, {"text": "Regional", "value": "regional"}, {"text": "Senior", "value": "senior"}, {"text": "Sr. manager", "value": "sr. manager"}, {"text": "Account manager", "value": "account manager"}, {"text": "Admin manager", "value": "admin manager"}, {"text": "Affairs manager", "value": "affairs manager"}, {"text": "Assistant", "value": "assistant"}, {"text": "Brand manager", "value": "brand manager"}, {"text": "Commodity manager", "value": "commodity manager"}, {"text": "Communication", "value": "communication"}, {"text": "Customer", "value": "customer"}, {"text": "Dealer", "value": "dealer"}, {"text": "Devops engineer", "value": "devops engineer"}, {"text": "Engineering", "value": "engineering"}, {"text": "Executive", "value": "executive"}, {"text": "Product specialist", "value": "product specialist"}, {"text": "Production supervisor", "value": "production supervisor"}, {"text": "Risk manager", "value": "risk manager"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Transactional", "value": "transactional"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Internship", "value": "INTERN"}, {"text": "Part-time", "value": "PARTTIME"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Toiletries", "value": "/business/naics2007/3256"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Foods & Beverages", "value": "/business/naics2007/311"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Management", "value": "/business/naics2007/55"}, {"text": "Research", "value": "/business/naics2007/5417"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "Citi", "value": "/m/01dfb6"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "Amazon", "value": "/m/0mgkg"}, {"text": "Binance", "value": "/g/11hcz1r4wl"}, {"text": "Standard Chartered", "value": "/m/02hszk"}, {"text": "United Overseas Bank", "value": "/m/04gjd1"}, {"text": "Apple", "value": "/m/0k8z"}, {"text": "Tata Communications", "value": "/m/04338k"}, {"text": "Workato", "value": "/g/11dxpy_3xd"}, {"text": "BNY  Mellon", "value": "/m/02vps5x"}, {"text": "DBS Bank", "value": "/m/01q7n5"}, {"text": "EPAM Systems", "value": "/m/0dlnrc"}, {"text": "GVT Government Technology Agency (GovTech)", "value": "/g/11gh0528nq"}, {"text": "Grab", "value": "/m/0134c_p9"}, {"text": "Paypal", "value": "/g/122s91_5"}, {"text": "PeopleSearch Pte Ltd", "value": "/g/11c73ngn0w"}, {"text": "Randstad", "value": "/m/08pt1z"}, {"text": "Singapore Airlines", "value": "/m/015f2x"}, {"text": "TEKsystems (Allegis Group Singapore Pte Ltd)", "value": "/g/11b6g4bkv0"}, {"text": "ABBOTT LABORATORIES (SINGAPORE ) PRIVATE LIMITED", "value": "/m/09m57z3"}, {"text": "ADVANCE INTELLIGENCE PTE. LTD.", "value": "/g/11dymfkxss"}, {"text": "AXA", "value": "/m/04mn99"}, {"text": "Adecco Personnel Pte Ltd", "value": "/m/08gz46"}, {"text": "Adidas Group", "value": "/m/01jtml"}, {"text": "Aetna, a CVS Health Company", "value": "/m/0kg8x"}, {"text": "Agency for Science, Technology and Research", "value": "/m/0gmjcg"}, {"text": "Alibaba", "value": "/m/07s6ctl"}, {"text": "Argyll Scott", "value": "/g/11dxpk2374"}, {"text": "Autodesk", "value": "/m/018nm3"}, {"text": "Barry Callebaut", "value": "/m/03clky2"}, {"text": "BioMind", "value": "/g/11dymfr2l6"}, {"text": "CHUBB ASIA PACIFIC PTE. LTD.", "value": "/m/09m8xyh"}, {"text": "Cargobase", "value": "/g/11dxppfsjn"}, {"text": "Cargobase Pte Ltd", "value": "/g/11fy240nxm"}, {"text": "DKSH", "value": "/m/0dj2nh"}, {"text": "Dathena", "value": "/g/11dxprdn6y"}, {"text": "Dyson", "value": "/m/05cskg"}, {"text": "Enggsol Pte Ltd", "value": "/g/11g9mnfmm1"}, {"text": "Ethos BeathChapman", "value": "/g/11c73z0xm0"}, {"text": "Eu Yan Sang", "value": "/m/03cl9hn"}, {"text": "Flintex Consulting Pte. Ltd.", "value": "/g/11h1z41pzb"}, {"text": "GIVAUDAN SINGAPORE PTE LTD", "value": "/g/11f00wn519"}, {"text": "Goldman Sachs", "value": "/m/01xdn1"}, {"text": "GovTech Singapore", "value": "/g/11dxpkfs_6"}]}]}