{"search_metadata": {"id": "6082798b34ff9546d63aed31", "status": "Success", "json_endpoint": "https://serpapi.com/searches/c13c30b935e12f48/6082798b34ff9546d63aed31.json", "created_at": "2021-04-23 07:38:51 UTC", "processed_at": "2021-04-23 07:38:51 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28project+manager%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=60", "raw_html_file": "https://serpapi.com/searches/c13c30b935e12f48/6082798b34ff9546d63aed31.html", "total_time_taken": 0.92}, "search_parameters": {"q": "(project manager) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "60"}, "jobs_results": [{"title": "It Project Manager", "company_name": "TechBridge Market", "location": "Singapore (+1 other)", "via": "via MNC Jobs Singapore | MNC Jobs In Singapore", "description": "About Company: The company is seeking for highly motivated and passionate Project Manager (IT) to join and deliver a user-centric solution to our customers in an efficient and effective manner. He/She is to perform planning, organization, monitoring, and control of all aspects of an IT programmer and the strategic utilization of resources to achieve the objectives within the agreed timelines, costs, and performance expectations. In addition, the identification, coordination, and management of project interdependencies, ensuring alignment with and achievement of business objectives.He/She is an influential leader and who is able to communicate his ideas persuasively and engage with team members and other stakeholders. The PM (IT) will be working closely with team members of different disciplines on the project's progress and outcomes and manage the risks and stakeholders within the project scope, agreed timeframe, and budgeted resources.Lead end-to-end management of large programmers... or multiple projects concurrently, coordinating project interdependencies and ensuring alignment with strategic business priorities.Skillsets:\nThe technical skillsets required are as follows:\nProject Management Professional (PMP) (PMP) certification (Preferred)\nScrum Master (Good to have)\nExperience in web-based application development\nLogical and analytical systemic understandingResponsibilities:\nUnderstand system requirements, workflow, and functions\nDraft solution proposal and process flows\nAbility of communication - both verbally and in written form\nPerform software unit and integration testing\nDeploy software system\nMaintain resolve issues and track change requests\nAd hereto proper technical documentations\nEnsure high-quality system as a wholeRequirements:\nTertiary qualification in Computer Science, Information Systems, Computer Engineering, or related fields\nFamiliar with database technologies (SQL Server)\nExperience in cloud service\nExperience in Inventory Management System, WMS, and SAP are at an advantage\nGood knowledge of agile processes, continuous integration/continuous development and cloud technologies will be an advantage\nTechnology focused, self-motivated and proactive in problem-solving\nOrganized, Self-motivated, enthusiastic, and proven rapid learning capabilityJob Types: Full-time, PermanentSalary: $4,000.00 - $6,000.00 per monthSchedule:\n• Day shift\nExperience:\n• IT Project Manager: 3 years (Required)\nWork Remotely:\n• Temporarily due to COVID-19", "extensions": ["5 days ago", "Full–time"], "detected_extensions": {"posted_at": "5 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJJdCBQcm9qZWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJUZWNoQnJpZGdlIE1hcmtldCIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiVjBfM3ZYMkUwTUYwbTJBbEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNTkMgSm9icyBTaW5nYXBvcmUgfCBNTkMgSm9icyBJbiBTaW5nYXBvcmUiLCJsaW5rIjoiaHR0cHM6Ly9zZy5tbmNqb2J6LmNvbS9qb2JzL2l0LXByb2plY3QtbWFuYWdlci1zaW5nYXBvcmUtMzcyNzQ4P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Project Manager", "company_name": "Hg Exchange", "location": "Singapore (+1 other)", "via": "via Glints", "description": "We are looking for a Project Manager to lead, manage, and support various projects and initiatives for the exchange, which may span across related companies, as well as different departments and functions, including exchange operations, technology infrastructure, etc.\n\nRoles & Responsibilities\n• Coordinate closely with all stakeholders of the exchange: Management, Technology, Business Development, Legal/Compliance and others to identify new business opportunities, areas of improvement and to resolve open issues as they arise.\n• Prioritize, plan and manage major projects with input from Member Firms and stakeholders\n• Balance technology, user experience and revenue generation goals — innovate, make informed decisions and continuously measure processes and activities that have a significant impact on those decisions\n• Reduce entropy by managing the huge influx of ideas and data, and prioritising every task so that all stakeholders are always clear about their current goals and what's... coming up next\n• Manage exchange development and delivery closely with technology team members while consistently prioritising feature demands and backlog together with expected timelines\n• Engage and challenge stakeholders to surface problems and refine ideas, while complement that with data and research\n\nSkills & Experience Required\n• At least 5 years in the field of Project Management, preferably in a high-growth technology company\n• Experience working in financial institutions, preferably in private equities and/or stock brokerage\n• Strong understanding of project life cycles and methodologies\n• Strong understanding of a variety of digital solutions and processes\n• Able to manage multiple projects concurrently, using project management tools like JIRA\n• Agile development experience\n• Strong understanding of digital processes and tools such as UX and their impact to strategic objectives\n• Basic technical skills including PHP, HTML, CSS, JavaScript , SQL and/or SAS.\n• Participate in reviewing QA and leading UAT plans\n• Preferably certified in Project Management (PMP/Prince2/CITPM)\n• A sense of ownership and take on responsibilities and challenges, thrive on logic, accept and create changes with flexibility\n\nThe Ideal Candidate Should Be\n• Able to multitask, handle additional roles and work independently in often in a time-sensitive environment\n• Passionate about finance, trading and blockchain technology\n\nIf you are interested, please send your resume to hr@hg.exchange.\n\nOnly successful applicants will be contacted", "extensions": ["24 days ago", "Full–time"], "detected_extensions": {"posted_at": "24 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJIZyBFeGNoYW5nZSIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoic3lKeGM0UGF0UGVpZjdFS0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBHbGludHMiLCJsaW5rIjoiaHR0cHM6Ly9nbGludHMuY29tL3NnL29wcG9ydHVuaXRpZXMvam9icy9wcm9qZWN0LW1hbmFnZXIvNDg2OWVlYTAtOWVjMi00NzgwLWEwNTQtNDkxNDQ1ZWMwZTFkP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Program Manager III", "company_name": "Thermo Fisher", "location": "Singapore", "via": "via Thermo Fisher Scientific Jobs", "description": "How Will You Make an Impact?\n\nThermo Fisher Scientific Inc. is the world leader in serving science, with annual revenue exceeding $25 billion. Our Mission is to enable our customers to make the world healthier, cleaner and safer. Whether our customers are accelerating life sciences research, solving complex analytical challenges, improving patient diagnostics and therapies or increasing productivity in their laboratories, we are here to support them. Our global team of more than 75,000 colleagues delivers an unrivaled combination of innovative technologies, purchasing convenience and pharmaceutical services through our industry-leading brands, including Thermo Scientific, Applied Biosystems, Invitrogen, Fisher Scientific, Unity Lab Services and Patheon. For more information, please visit www.thermofisher.com.\n\nWhat will you do?\n\nA Program Manager’s role at Thermo Fisher Scientific:\n\nManages the product commercialization process/new product development and introduction through the... phase-gate process, managing scope, schedule, risks, issues, trade-offs, communications, and expectations.\n\nRepresent the organization in assuring the teams follow product development best practices, and in some cases adhere to specific regulatory requirements, as they lead project teams through the product commercialization process (PCP). This includes assuring design control and thereby long-term product supportability, as well as delivering the agreed upon business value.\n\nDrives the use of project management best practices, with the goal of not only delivering a product of high quality and value to the organization, but delivering within the agreed upon project contract metrics of schedule, resources, budget and scope.\n\nA Program Manager’s role at Thermo Fisher Scientific:\n• Lead, manage, coordinate, synchronize, and be accountable for the execution of programs from Customer engagement through to Product Delivery / Launch & Program Closure.\n• Act as information conduit between the Core Team and Sr. Management\n• Prepare and present formal Program Reviews (presentations) as well as overall Custom Program Pipeline updates to Sr. Leadership; initiates Exception Reviews as necessary.\n• Lead teams to define and prioritize scope, objectives, and requirements.\n• Plan resource requirements and negotiate Core Team resources with functional managers; assist Core Team Members in negotiating extended team staffing.\n• Develop accurate, actionable, and cross-functionally integrated program plans based on business goals, constraints, and risk tolerance.\n• Drive risk assessment, communication, proactive mitigation planning, and contingency response planning.\n• Regularly track, monitor, and communicate team progress against requirements and plans to all stakeholders; resolve deviations; schedule and lead core team meetings.\n• Assist Core Team Members in resolving extended team and functional issues.\n• Collaborate and coordinate across all the functional areas (R&D, Product Management, QA/QC, Regulatory, Legal, Operations, Manufacturing, Service and Support and others) necessary to insure successful program completion.\n• Lead, document, and communicate constructive lessons-learned analysis of completed programs.\n• Build effective relationships with core and extended team members, functional managers, senior management, and customers.\n• Contribute to performance evaluation of Core Team Members.\n• Other duties as assigned.\n\nHow will you get here?\n\nEducation\n• Bachelor’s degree or higher in a science discipline.\n\nExperience\n• Minimum 5 years of product development experience in Life Sciences, Biotechnology or Medical Devices; IVD experience highly preferred.\n• Minimum 2 years of program management experience.\n• Phase-gate product development process experience.\n• VOC process experience preferred.\n• PMP certification preferred.\n\nKnowledge, Skills, Abilities\n• Ability to distill, prioritize, and act on feedback from a variety of sources.\n• Ability to do the right thing under pressure and tight deadlines in a complex, matrixed environment.\n• Ability to work independently without significant direction\n• Excellent critical thinking, troubleshooting, crisis management, and decision-making skills.\n• Excellent interpersonal and relationship building skills, and the ability to work effectively with a variety of other personal styles.\n• Excellent leadership skills particularly the ability to influence stakeholders in other functions over whom the Program Manager has no direct managing authority.\n• Excellent oral and written communication skills.\n• Initiative. Self-motivated and independent thinker that routinely translates circumstances and understanding into actions that move the business forward in a measurable manner.\n• Meticulous attention to detail and a passion for driving execution at a detail level when necessary while maintaining the ability to see the big picture", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9ncmFtIE1hbmFnZXIgSUlJIiwiY29tcGFueV9uYW1lIjoiVGhlcm1vIEZpc2hlciIsImNvbXBhbnlfbWlkIjoiL20vMDJwdDA0ZiIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IlY2MmRWS0tHbHhTaXI1OHdBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhWRFZSZDBwM1pFdFhhbEZmWkhwalVsbDJPV3htYmpOMVJHZDFlWFJDUlMxbWNGcDBSSEpDYjJocmFWOWFYMkZZY25sMWVrczNWVk5zTTBvMlVWRTVUblk1VGpSYVNUQmFlbko0V1hGS2FEa3lWa1ZWUjA5NGMyMHhWMVpFVGsxVVFYRXdZbkJNTlV4bWRFNUVjR05CUkVvdGJtTlRSbTlCWkRoV1VtWmxWVFZpVGxkbFdXWTRVVFptY1VWQ2RISm1NRTloVkRFNGRuRlBkMUIzRWhacE0yMURXVTh5VUUxalZEQjBRV0pmZEV3eWQwUkJHaUpCVDAxWlVuZENlV3RDYVhGRmQzWk1XalJRVTNoaE0yNVdVMmxNYWtnMlJ6WjMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18xNSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBUaGVybW8gRmlzaGVyIFNjaWVudGlmaWMgSm9icyIsImxpbmsiOiJodHRwczovL2pvYnMudGhlcm1vZmlzaGVyLmNvbS9nbG9iYWwvZW4vam9iLzE0NDA5OUJSL1Byb2dyYW0tTWFuYWdlcj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "IT Project Manager", "company_name": "Jobster Pte Ltd EA License No: 06C5060", "location": "Singapore", "via": "via LinkedIn", "description": "Responsibilites\n• Manage the service level agreements (SLAs) as stated in the master contract (MSA) in the areas of:\n• Desktop support management\n• Server support management\n• Network support management\n• Security support management\n• Manage BAU operations and ad-hoc projects at the customer sites\n• Manage project budgets vs actuals for project revenue and cost\n• Ensure service requests raised by customers are prioritized and delivered in accordance with the agreed timeline\n• Manage the customer’s expectation in term of service offering delivery\n• To be the Single Point of Contact (SPOC) for customers for on-going operations and projects\n• Act as a further escalation point for the Team Lead\n• Provide recommendation and execute improvement plan for managed Services (Service Assurance, including Risk Management)\n• Interface with customers on a need basis for service improvement and recovery\n• Manage and ensure team operation within budget\n• Manage staffs that are stationed at the... sites\n• Participates in the development, implementation, communication and enforcement of policies, processes, procedures, standards and guidelines\n• Involve with Team Leads to strategize on duty rostering or scheduling\n• Conduct regular review with Team Leads on team performance; management direction and announcement\n• Manage managed Services resources, including hiring, staff admin and welfare, maintain skills set and staff discipline\n• Manage the development of staffs while identifying suitable trainings for them, promote talent development, and staff retention\n• Report to project director on any issue that could significantly impact the business / operation\n\nRequirements\n• Degree in Computer Science, Computer Engineering, IT or equivalent\n• Attained certified IT Program Management Professional ( PgMP ) or Certified IT Project Management ( CITPM ) or equivalent certification or possess qualifications or certifications that fulfil the certification criteria for PgMP/CITPM set by the certification body\n• Minimum 3-5 years of project management experience\n• Experienced in managing at least one (1) project of equivalent size (at least 1-3 million value) and complexity\n• Managed and successfully completed a project in at least one (1) Government related project", "extensions": ["14 hours ago", "Full–time"], "detected_extensions": {"posted_at": "14 hours ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJJVCBQcm9qZWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJKb2JzdGVyIFB0ZSBMdGQgRUEgTGljZW5zZSBObzogMDZDNTA2MCIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoib1Q4RkV0SHd6a0djcHFRZEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL3NnLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvaXQtcHJvamVjdC1tYW5hZ2VyLWF0LWpvYnN0ZXItcHRlLWx0ZC1lYS1saWNlbnNlLW5vLTA2YzUwNjAtMjUxNTcxNTI3Mz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Digital Transformation, Workday Project Manager", "company_name": "KPMG Singapore", "location": "Singapore (+1 other)", "via": "via KPMG Singapore | KPMG | SG", "description": "Our Workday Project Manager excel by leading the project team on the success implementation of the Workday Human Capital Management solution for our clients.\n\nThis role includes\n•Managing and rolling-out large HR transformation project\n•Directing, managing and controlling of the project work / tasks / activities with project team members\n•Defining project objectives and quality control throughout its lifecycle\n•Working closely with clients, demonstrating professional knowledge to ensure that the deliverables are of the highest calibre to ensure client satisfaction\n•Applying subject matter expertise to identify, develop, and implement techniques to improve engagement productivity, increase efficiencies, mitigate risks, resolve issues, and optimize cost savings and efficiencies for client\n•Works cross-functionally to solve problems and implement changes\n•Providing the status reports to the management and keeping the team abreast of the project status\n•Coaching and training junior team... members\n\nThe ideal candidate should possess:\n•At least 8 years of experience in implementing Human Capital Management solutions, with at least 3 years of experience in managing complex projects in a consulting or software environment\n•Lead 3 to 4 large Workday projects as Workday Project Manager\n•Proven track record of project management success, both in results achieved and in use of the professional methodology\n•Excellent verbal and written communication skills\n•Ability to work independently and as part of a team in a fast-paced, changing environment\n•Ability to cope under pressure and work to tight deadlines\n•Strong stakeholder management skill and client service orientation\n•Certified as Workday Engagement Manager/Project Management, Workday HCM/FIN Core would be an added advantage\n\nOnly shortlisted candidates will be contacted by KPMG Talent Acquisition team, personal data collected will be used for recruitment purposes only.\n\nAt KPMG in Singapore we are committed to creating a diverse and inclusive workplace. We believe that diversity of thought, background and experience strengthens relationships and delivers meaningful benefits to our people, our clients and communities. As an equal opportunity employer, all qualified applicants will receive consideration for employment regardless of age, race, gender identity or expression, colour, marital status, religion, sexual orientation, disability, or other non-merit factors. We celebrate the different talents that our people bring and support every staff member in their journey to achieve personal and professional growth. One of the ways we do this is through Take Charge: Flexi-work, our flexible working framework which enables agile and innovative teams to help deliver our business goals", "extensions": ["4 days ago", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEaWdpdGFsIFRyYW5zZm9ybWF0aW9uLCBXb3JrZGF5IFByb2plY3QgTWFuYWdlciIsImNvbXBhbnlfbmFtZSI6IktQTUcgU2luZ2Fwb3JlIiwiY29tcGFueV9taWQiOiIvZy8xMWR4cHNiOW5yIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiRzduT2hMNTlfUDVHckstaEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZZQkNyY0JRVTVWWDA1eFVUWklZVWhvWWtZeFpWZG5ZbHBUY2xVeVNHaFNaRzgyWlhObk5uZHRhSE5LVlRVelNrMWtRM1ZHZEVSWFNERmFUSGRJVjJGNk0wRkVPV0owVlZGTVYxQTBZek5KWkhGMGNsUkRhREU1VjBkbFRYRkVUWGt5VjE4Mk1XNDJZVFZRWjNReU1HRk9lRk10WTBkMGMwNVRTV05uVlVSbmVGSXdXV3RFYkc5Zk1TMDBNVXQxUTNFM05WTlNNSE5ZWkZoNlQzRmpRVGxXYWpZdFNFZzJlSGx3Ylc4emFsRkpaMFI1VldoS1NVbzNjWE56RWhacE0yMURXVTh5VUUxalZEQjBRV0pmZEV3eWQwUkJHaUpCVDAxWlVuZENVV0poZUcxRU9FVkRiSFpuYVhoMk9GOWxiMmd4UkZaNGFrOUIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18yNiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBLUE1HIFNpbmdhcG9yZSB8IEtQTUcgfCBTRyIsImxpbmsiOiJodHRwczovL2NhcmVlcnMua3BtZy5jb20uc2cvY3cvZW4vam9iLzUwNTA5NS93b3JrZGF5LXByb2plY3QtbWFuYWdlcj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "IT Project Manager", "company_name": "BGC Group", "location": "Singapore (+1 other)", "via": "via BGC Group", "description": "Job description:\n• Lead, plan, execute, and commission projects according to scope, schedule and within budget. This includes managing resources and coordinating the efforts of team members (onsite and offshore teams) and third-party contractors or consultants in order to deliver projects according to plan.\n• Monitor and control the project progress, budget, cost, resources, schedule and deliverables.\n• Ensure adherence to project scope and requirements.\n• Management of the project scope, Changes, deliverables and timeline & Budget.\n• Develop project control and reporting procedures and manages changes in operational plan.\n• Undertake project status review meetings among project team members and clients.\n• Coach and advise team members to accomplish project goals, to meet established schedules, and resolve technical/operational issues.\n• Accountable to the Delivery Unit Head and/or key stake holders for the delivery of project.\n• Ensure the successful handover of any projects into the... Service Delivery and Support structure with the objective of providing the customer with an effective transition.\n• Facilitate project closure and lessons learned.\n\nJob requirement:\n• Proven track record in project management in the software development and maintenance sector.\n• Minimum 5 years of working experience in delivery of multiple medium - complex projects.\n• Strong client and project management abilities coupled with excellent communication, written, analytical, organizational and problem-solving skills.\n• Proficiency in architectural and design cycles with complex IT solutions which includes application, data and technologies across multiple platforms.\n• Certification PMP, Scrum Master, PMI-ACP, or ITIL is preferred", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJJVCBQcm9qZWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJCR0MgR3JvdXAiLCJjb21wYW55X21pZCI6Ii9nLzExZzBqM2ZqdjgiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJsNnY3SVdoOVNqeGQ3TGk2QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VkRFNVRWWk1kRWhHU1hSNU5reHRlSFV0T0doWFMyVklVR1EyUm1GMk4wcFdObE5YYVZGR1JXcE5jMkpCU0hodVRWcHdPVFZMWW5aR1RYUkJUVm96UlZWaFFXRnZjSFJ6ZG5WMVkyazBjVEoyVG5SSVJ6UnNXbUpUTUZOSlFrRmxUMkU0YXpNdFptWlhSblZUWDNJMFRtWkNTa3cxWDI4d2RYUmZXRUZSTUVFNGRFZGZiWGd6YnpNdFRtbGhWMFY0UkZONFYxRjRMV0pGYXpkQkVoWnBNMjFEV1U4eVVFMWpWREIwUVdKZmRFd3lkMFJCR2lKQlQwMVpVbmREYkcwelVVZFlWekYyVWxWZlZXa3pRbGRmV25CMFNEbEhNSFpCIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMzIiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQkdDIEdyb3VwIiwibGluayI6Imh0dHBzOi8vd3d3LmJnYy1ncm91cC5jb20vam9iL2l0LXByb2plY3QtbWFuYWdlci0zP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "IT Project Manager", "company_name": "Steenbok", "location": "Singapore", "via": "via Learn4Good", "description": "Over the years, it has cultivated a niche in interconnecting applications from mobile and web frontends to the traditional ERP systems through middleware. Today, its best value to the customer is its experience and ability in cross-application connectivity.\n\nTo date, its business has remained as that of an outsourced IT arm to the industries.\n\nThe RoleResponsibilities\n\nLiaise with stakeholders and vendors on business requirements\n\nPrepare and execute project plans\n\nManage project development resources, schedules and risks\n\nEscalate and report risk and issues to stakeholders timely\n\nIdeal Profile\n\nRequirements\n\nAn IT degree\n\nMinimum 5 years of relevant experience\n\nG3/ePayment domain knowledge\n\nTrack record of business solution implementation within a formal SDLC framework\n\nPMP certification is an advantage\n\nWhat's on Offer?\n\nWork within a company with a solid track record of success\n\nWork alongside & learn from best in class talent\n\nExcellent career development opportunities", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJJVCBQcm9qZWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJTdGVlbmJvayIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiS0dpclB6enlNSHZMYm9mREFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMZWFybjRHb29kIiwibGluayI6Imh0dHBzOi8vd3d3LmxlYXJuNGdvb2QuY29tL2pvYnMvc2luZ2Fwb3JlL2luZm9fdGVjaG5vbG9neS8yNzEyNDk3MDQvZS8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Technical Program Manager, APAC Infrastructure", "company_name": "Facebook", "location": "Singapore (+1 other)", "via": "via NodeFlair", "description": "Facebook is seeking a Technical Program Manager (TPM) with large-scale network infrastructure experience. This person will be involved in evolving and enhancing the global network that supports all Facebook products and services. They will manage programs and solve some of the most challenging networking problems in the industry, drive innovative, creative and ground-breaking solutions, and utilize automation to scale. This person will partner closely with engineering and other cross-functional teams to understand the problem space and domain in depth, create roadmaps, prioritize based on impact and drive them through to completion.This person will report to the Group Technical Program Manager.\n\nResponsibilities\n• Uses project management expertise, technical expertise and company objectives to resolve complex issues in creative and effective ways.\n• Drive and manage multiple programs covering a range of areas (PoP, datacenter network & backbone networks, subsea cable networks) with a... team of cross functional partners towards predictable execution without supervision.\n• Provide hands on program management during analysis, design, development, testing, implementation, and post implementation phases. Identifies dependencies and gaps, unblocks issues and drives consensus amongst teams.\n• Builds productive working relationships, and increasing level of trust, with engineers, stakeholders, and management inside and outside program areas.\n• Continuously assess and review processes and seek to scale through better engineering & automation across multiple teams and functions.\n• Drive regional and global program strategies and initiatives.\n• Perform risk management and change management on projects.\n• Define and track key metrics and key quality and performance indicators.\n• Develop and own communication plans and to proactively communicate to stakeholders.\n• Ensure consistency across projects, regions globally and alignment with other TPMs\n• Ensure lessons learnt are captured comprehensively, acted on and communicated out for each project.\n• Ability to mentor and grow others\n\nMinimum Qualification\n• B.S. in a technical discipline or equivalent experience.\n• 8+ years in telecom and/or data network infrastructure space, focusing on engineering, design and delivery.\n• Experience managing and driving large scale programs of high complexity (related to data networks and/or telecom networks) from inception to delivery.\n• Experience operating autonomously across multiple teams, demonstrated critical thinking, and thought leadership.\n• Experience working with technical management teams to develop systems, solutions, and products.\n• Experience establishing work relationships across multi-disciplinary teams and multiple partners in different time zones.\n• Experience in managing programs related to PoP, datacenter network & backbone network or subsea cable network domains.\n\nPreferred Qualification\n• PMP Certification (PMI) and experience with project management tools would be an advantage", "extensions": ["4 days ago", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJUZWNobmljYWwgUHJvZ3JhbSBNYW5hZ2VyLCBBUEFDIEluZnJhc3RydWN0dXJlIiwiY29tcGFueV9uYW1lIjoiRmFjZWJvb2siLCJjb21wYW55X21pZCI6Ii9tLzBobXlmc3YiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJDNVZGYWtuY0k3TXoxdjNOQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VWxOTGRVUnFaRlppUldRNGRFSnBla1JPTTE5dlJYbFBibE0yVmtwS1VuaExjMjg1WVZSUmQzVTJaREV4ZVhKdFRrY3pObUpvYzBWdlV6QlRSbFZyT0RKVVIwZEVNUzFtZEU5TGVVcGlXR2xqZFZCaWIzTkVjekJyUW05WWEwOWZNMnB4Y0V4V2JEVjBVRjlrV25JdGNHSkdhV2xLWkhoeVlreFBlbFZGTW14S1EwaFNjMGRQY1VaVFMxa3RRalZ6ZDJ0b09IRndiM2RXWVZCM0VoWnBNMjFEV1U4eVVFMWpWREIwUVdKZmRFd3lkMFJCR2lKQlQwMVpVbmRCV2tKcWJVOVpXVnB4ZW05UkxXOHpMVU5YWWpWalJGZExhVmgzIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNDIiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTm9kZUZsYWlyIiwibGluayI6Imh0dHBzOi8vd3d3Lm5vZGVmbGFpci5jb20vam9icy9saXN0aW5ncy8xMjYyNj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Project Manager", "company_name": "Avensys Consulting Pte. Ltd.", "location": "Singapore (+1 other)", "via": "via Monster", "description": "Avensys is a reputed global IT professional services company\nheadquartered in Singapore. Our service spectrum includes enterprise\nsolution consulting, business intelligence, business process automation\nand managed services. Given our decade of success we have evolved to\nbecome one of the top trusted providers in Singapore and service a client\nbase across banking and financial services, insurance, information\ntechnology, healthcare, retail and supply chain.\n\nWe are currently looking to hire Project Manager. This is an exciting\nopportunity to expand your skill set, achieve job satisfaction and\nwork-life balance. More details as below.\n\nJOB TYPE\n\nContract\n\nJOB RESPONSIBILITIES\n• Define, plan, and direct the execution of a broad range of projects\nwhile balancing the competing demands of scope, time, cost, quality,\nresources and risk to produce high IT solutions.\n• Identify, acquire, and lead multifunctional, global project teams.\n• Ensure project objectives/requirements are clear and... agreed to by all\nstakeholders.\n• Manage relationships with various IT and business stakeholders to\nachieve project objectives.\n• Facilitate project management activities across the entire project\nmanagement methodology.\n• Ensure successful and timely completion of deliverables.\n• Track progress against baseline schedule\n• Plan, baseline and control costs to ensure projects are completed\nwithin approved budget.\n• Manage project priorities and ensure adherence to the agreed scope.\n• Monitor, document and gain approval for changes to schedule, cost or\nproject scope\n• Identify and apply systematic quality activities to ensure that\nprojects employ all processes needed to meet Computer System\nValidation directives\n• Conduct risk and issue management planning, identification, analysis\nand monitoring on projects.\n• Formulate risk and issue mitigation strategies; recommend and\nimplement solutions.\n• Ensure delivery of project in compliance with CSV and PMM guidelines\n• Must effectively manage the projects across global locations and\ndifferent time zones.\n\nREQUIREMENTS\n• 3-7 years of related experience. Experience working in Healthcare\nindustry is a highly desirable.\n• Prior experience implementing IT Projects across a variety of\nplatforms.\n• Experience in project organization and resource mobilization, and\nmanagement of stakeholders\n• Strong understanding of Project Management Methodology concepts,\nincluding waterfall (PMP certification preferred) and agile\npractitioner knowledge (SCRUM / SAFe preferred)\n• Strong understanding of Computer System Validation (CSV) concepts\n• Familiarity with HP ALM or other Application Lifecycle Management\ntool preferred.\n• Familiarity with global rollouts/releases preferred.\n• Experience dealing with stakeholder management issues on a global\nlevel (including multiple cultures)\n• Strong interactive and influencing skills.\n• Strong customer and service management focus\n• Excellent communication, organization and multi-tasking skills\n• Experience in leading virtual teams\n• Strong technical writing skills (project documentation/deliverables)\n• Understanding of Electronic Document Management System concepts\n• Understanding of IT Infrastructure concepts\n\nWHATS ON OFFER\n\nYou will be remunerated with an excellent base salary and entitled to\nattractive company benefits. Additionally, you will get the opportunity\nto enjoy a fun and collaborative work environment, alongside a strong\ncareer progression.\n\nTo submit your application, please apply online or email your UPDATED CV\nin Microsoft Word format to Your interest will be treated with strict\nconfidentiality.\n\nCONSULTANT DETAILS\n\nConsultant Name: Felcy Esther\n\nAvensys Consulting Pte Ltd\n\nEA License 12C5759\n\nPrivacy Statement: Data collected will be used for recruitment purposes\nonly. Personal data provided will be used strictly in accordance with the\nrelevant data protection law and Avensys' privacy policy", "extensions": ["2 days ago", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJBdmVuc3lzIENvbnN1bHRpbmcgUHRlLiBMdGQuIiwiY29tcGFueV9taWQiOiIvZy8xMWc3MDIyZ2pmIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiOXpfb2dUanlpVWszWnZuZEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRW9zQ0Nzd0JRVTVWWDA1eFUybzFSbkJpYjFsSVpYUXRZMjVOYWtKMGVITnBNVEUyTkZZMGNqZHplV00yVlhsWU1qaHRRbmhUWVRCeGEwWTVka0Y1VkU5SVZHNVdTWEpGVjIxRlJXUTVNbVpyZEhOa05rTldZVUYyWjE5NVRXNHlkazE2TWw5UVNteExSbVoyWVVaZk1HUlBRVGhLVG5oMmRtbDJWbkI2VlZoalIySnNTV2R1TVZrMFVsZFdXVWhXZFVvMVIwWktNQzFWUjFkTVRFeDFVSGx1Y1hoWVp6RjBjazVWVm0wMlRsVjVNMWMxUnpaMk9WUm5TbEZJUjFGbFNHOXZUbkV5VVdKZlgweHBPRXA2T1hWRkVoWnBNMjFEV1U4eVVFMWpWREIwUVdKZmRFd3lkMFJCR2lKQlQwMVpVbmRDUm5SYVYyeEZRVzVxTWpkRE5raEtOM05IUjFKSlZWSXRRbEYzIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNDkiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTW9uc3RlciIsImxpbmsiOiJodHRwczovL3d3dy5tb25zdGVyLmNvbS5zZy9hbXAvam9iLXZhY2FuY3ktcHJvamVjdC1tYW5hZ2VyLWF2ZW5zeXMtY29uc3VsdGluZy1wdGUtbHRkLXNpbmdhcG9yZS0yNzgxNDM1NS5odG1sP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "IT Project Manager", "company_name": "Aspial Corporation Ltd", "location": "Singapore", "via": "via Jobs.aspial.com", "description": "Responsibilities:\n• Reporting and assisting the Head of Project Office in managing various aspects of in-house and external IT projects.\n• Drives internal and external project requirements, priorities and deadlines, not just recording and managing them.\n• Drives vendors effectively to achieve project deliverables and ensure project is delivered on schedule.\n• Interacts with decision-makers by managing expectations and providing master project planning to ensure all agreed upon deliverables are met cost-effectively and according to project timeline commitments.\n• Solves problems, prioritizes deliverables, monitors project progress and manages project scope.\n• Manage small to large projects, ensuring they are completed on schedule while delivering expected functionality and satisfactory quality.\n• Executes projects using project management strategies, processes, techniques, and best practices.\n• Able to do technical design sessions with the system analyst and development teams... including the creation of class models, sequence diagrams, component models, etc., and detailed design specifications to ensuring that architecture standards are followed.\n• Mentors other junior resources within the team on project management skills.\n• Perform other duties as assigned, including hands-on in doing development work or support work if needs arise\n\nRequirements:\n• ﻿At least a Bachelor’s Degree in Information Technology\n• Agile/Scrum/PMP/CITPM certified is an added advantage\n• At least 10 years of IT project implementation experience, from managing project inception till implementation with consistent track records of driving successful IT projects\n• Experience in Retail domain is an asset\n• Strong understanding of Agile/Scrum methodologies is a MUST\n• Good knowledge of Service-Oriented Architecture (SOA), its principles, and patterns at enterprise level.\n• Have experience and/or knowledge on .NET Framework development techniques, Web/Mobile Services and OutSystems (low-code application development platform)\n• Have vast experience on IT solutioning especially on web service design particularly on RESTful on API. Strong in designing table structure and microservices as well.\n• Understanding time management skills specifically in the areas of planning, organization and project execution\n• Strong communication ability including written, verbal and presentation skills. Presentation skills should encompass the ability to structure, design and deliver effective presentations in a meeting environment\n• Proven ability to manage and develop relationships and negotiate at all levels of management in the organization\n• Creativity and ability to think outside-the-box while defining sound and practical solutions.\n• Desire to take the initiative, moving projects/ideas forward with clarity.\n• Ability to work independently with minimum guidance\n• Proactive and a good team lead, with a positive working attitude", "extensions": ["20 days ago", "Full–time"], "detected_extensions": {"posted_at": "20 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJJVCBQcm9qZWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJBc3BpYWwgQ29ycG9yYXRpb24gTHRkIiwiY29tcGFueV9taWQiOiIvbS8wZDQxNmsiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJ6ei02VjR3TngzdzZkT1ktQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdllCQ3JjQlFVNVZYMDV4VkVoelNtRkdjRGd3YmpCd2EzcDFNalZyUkhZeVZFMUhXV1ExYzJrNVUxOUtTbk42VFZGRGEySjRkMmhhTlc1V2VFcDFUbDk1Tm5kelVuTmphazB5VVdvM0xXcGpRM05UUjJkSVppMDNkRzV6YzI4d2RYUkROV1ZEUjA1SU5UVXpWakV0VFVWUGVGUmpjbFozZDFWMlZ6aGlNbXBqY1V3d2RUWlhlWGx5TlZoc2FHdzVMWEJ3VUMxdlkzZFlURzl2ZURCT2ExOW1kWGRrYTBwWmRqWk1XbmsxYkUxMlUwbEpSamhTVFZSUVYyRnJFaFpwTTIxRFdVOHlVRTFqVkRCMFFXSmZkRXd5ZDBSQkdpSkJUMDFaVW5kQk1rSjVTMHBaU3pGbE1HaG1UMGw1TFdnM1VVbFFSMjVMTTBabiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzU3IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnMuYXNwaWFsLmNvbSIsImxpbmsiOiJodHRwczovL2pvYnMuYXNwaWFsLmNvbS9qb2IvSVQtUHJvamVjdC1NYW5hZ2VyLzU3MzUxNjExMC8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Management", "value": "GC18"}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Advertising and Marketing", "value": "GC03"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Media, Communications and Writing", "value": "GC20"}, {"text": "Transportation and Logistics", "value": "GC30"}, {"text": "Art, Fashion and Design", "value": "GC05"}, {"text": "Construction", "value": "GC09"}, {"text": "Education", "value": "GC11"}, {"text": "Human Resources", "value": "GC15"}, {"text": "Protective Services", "value": "GC23"}, {"text": "Property", "value": "GC24"}, {"text": "Science and Engineering", "value": "GC27"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "Project manager", "value": "project manager"}, {"text": "Program manager", "value": "program manager"}, {"text": "Manager", "value": "manager"}, {"text": "Delivery manager", "value": "delivery manager"}, {"text": "Project director", "value": "project director"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Senior", "value": "senior"}, {"text": "Consultant", "value": "consultant"}, {"text": "Coordinator", "value": "coordinator"}, {"text": "Deputy director", "value": "deputy director"}, {"text": "Director", "value": "director"}, {"text": "Group manager", "value": "group manager"}, {"text": "Operations", "value": "operations"}, {"text": "Scrum master", "value": "scrum master"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Services", "value": "services"}, {"text": "Vice president", "value": "vice president"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Engineering Services", "value": "/business/naics2007/5413"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Entertainment", "value": "/business/naics2007/71"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Management", "value": "/business/naics2007/55"}, {"text": "Real Estate", "value": "/business/naics2007/53"}, {"text": "Research", "value": "/business/naics2007/5417"}, {"text": "Retail", "value": "/business/naics2007/44"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": ".AB4Jjf.qPB6Vc{padding-right:11px}.qfpP8d{padding:7px 0 7px 11px}.S003Ke{flex:none}.ZoN4Lb{color:rgba(0,0,0,.54)}.nAXVG{color:#70757a}.IxQsL{color:rgba(0,0,0,.26)}.xFO1De{color:#fff}.ooFpK{color:rgba(255,255,255,.30)}.mtnwac{color:#4285f4}.WxeeKb{color:#34a853}.hIVRU{color:#f29900}.EXaTMc{color:#fbbc04}.sxn46d{color:#000}.gqMTF{color:#1a73e8}.zpn8Mb{color:#d93025}.dEUPmd{color:#1e8e3e}.PJNo1{color:#fbbc04}Actively Hiring", "value": "e"}, {"text": "Michael Page", "value": "/m/04cxldw"}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Nanyang Technological University", "value": "/m/0l49k"}, {"text": "Jobline Resources Pte Ltd", "value": "/g/11gp2647pn"}, {"text": "Randstad Singapore", "value": "/g/11g70b50mr"}, {"text": "GECO Asia", "value": "/g/11gk72_bt_"}, {"text": "Facebook", "value": "/m/0hmyfsv"}, {"text": "HP", "value": "/m/03mnk"}, {"text": "IoTalents", "value": "/g/11dxq187wm"}, {"text": "NCS Group", "value": "/m/0282746"}, {"text": "National University of Singapore", "value": "/m/01q460"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "OPTIMUM SOLUTIONS (SINGAPORE) PTE LTD", "value": "/g/11g70hkrbx"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "ACI HR Solutions Ltd", "value": "/g/11c73ryh3p"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Apple", "value": "/m/0k8z"}, {"text": "Avensys Consulting", "value": "/g/11g7022gjf"}, {"text": "BNP Paribas", "value": "/m/02qhk4"}, {"text": "Ceridian", "value": "/m/07f8h6"}, {"text": "Ensign InfoSecurity", "value": "/g/11g4jhymjr"}, {"text": "Humanica Asia Pte. Ltd", "value": "/g/11h1y98c9z"}, {"text": "Kerry Consulting", "value": "/g/11c73vtzc8"}, {"text": "Marsh and McLennan", "value": "/m/053rw"}, {"text": "NSEARCH GLOBAL", "value": "/g/11dxpksll4"}, {"text": "NTT", "value": "/m/05mybp8"}, {"text": "OakTree Consulting", "value": "/g/11g70jfhtq"}, {"text": "Salesforce", "value": "/m/07btr5"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "TEKsystems", "value": "/g/11b6g4bkv0"}, {"text": "Teradyne", "value": "/m/04bzqp"}, {"text": "Toshiba Tec Singapore Pte. Ltd", "value": "/g/11g9n9q547"}, {"text": "Trustwave", "value": "/m/0n3xjf5"}, {"text": "Wood Plc", "value": "/m/07vv9s"}, {"text": "Workiva", "value": "/m/0113m1rd"}, {"text": "A-it Software Services Pte Ltd", "value": "/g/11dxpy_gl_"}, {"text": "ABS Group", "value": "/g/11dxplj1z6"}, {"text": "AIA", "value": "/m/02r5cgx"}, {"text": "ASEAN CABLESHIP PTE. LTD.", "value": "/g/11b7dsfph2"}]}]}