{"search_metadata": {"id": "60827a72af63046b31c48cb4", "status": "Success", "json_endpoint": "https://serpapi.com/searches/a6827142b46ac7b7/60827a72af63046b31c48cb4.json", "created_at": "2021-04-23 07:42:42 UTC", "processed_at": "2021-04-23 07:42:42 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28software+developer%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=120", "raw_html_file": "https://serpapi.com/searches/a6827142b46ac7b7/60827a72af63046b31c48cb4.html", "total_time_taken": 6.18}, "search_parameters": {"q": "(software developer) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "120"}, "jobs_results": [{"title": "Intermediate Software Engineer", "company_name": "Credit Agricole Group", "location": "Singapore", "via": "via Bayt.com", "description": "Position\n\nRisks and Finance department is responsible for development and maintenance of Compliance, Referentials, Counterparty/Credit Risks and Finance applications used by worldwide users, composed of the following divisions :\n• Compliance IT handles Business Compliance & Financial Security application portfolio, based on internal and regulatory models\n• Referentials IT covers Know Your Customer processes & Counterparty referential management\n• Credit Risk IT covers Front office Applications, Credit Decision Processing tool, Global Authorization Repository system and Default History Data Base\n• Counterparty Risk IT handles applications responsible for risk data collection, risk calculation and monitoring for CACIB worldwide\n• Finance IT is responsible for applications handling financial accounting and liqauidity and yied financial risks for CACIB worldwide.\n\nRisks and Finance applications are all in-house developments.\n\nMain Pre-requisites\nCore programming langages: .Net, Java... SQL\nMethodologies\nAgile and/or Iterative development lifecycles\nContinuous Integration / Continuous Delivery\nLatest technology stacks\nData Science : Machine Learning, Business Intelligence\nBatch processing : Big Data, Fast Data, ElasticSearch, Kafka\nWeb : Angular, ReactJS, JQuery, Node.Js\n\nMain responsibilities\n• Study, evaluate, analyze business requirements and functional specifications.\n• Provide detailed estimation for Software Engineering solutions\n• Implement and Test Software Engineering solutions\n• Enable and support functional and user acceptance testing\n• Support applications in production - analyze and resolve issues as they arise\n\nThe activity provided will have to comply with the CA-CIB Policy", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJJbnRlcm1lZGlhdGUgU29mdHdhcmUgRW5naW5lZXIiLCJjb21wYW55X25hbWUiOiJDcmVkaXQgQWdyaWNvbGUgR3JvdXAiLCJjb21wYW55X21pZCI6Ii9tLzAyOHZibSIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Ikl4SFBBUUJ0VUNaSkRYbzZBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2WUJDcmNCUVU1VlgwNXhWRU5HVWxKc2RVbFBjRGhFVkZCcU9USlFPWFZVU0ZaclRqRTVUVEY0Y2poNlRGRjFXVXhtYVRSQlMxaFdaV2RvUkVOVlJrNVNUbVJEUnpaTmFESkNSbUpPVFdKd05YZERlakpoZG5Wd2VHVlFOV1oxZURaSFgwaEJOVk5GVVVOU2NVdE1NbEZxVTNwWlJUQlRXVlJqWjJkcFNETjRjbVJMYkhsS1QybFlMVnB2WjBjelRrOUhjM05NWmpCck9EWnZUM0JDTkRkZmNUTk1NV3Q0YzFGc09HNHRRV3QwTUVGMU5VNVFNelUzUlRRNEVoWmxTSEZEV1V0VU0wUmtkVEowUVdFMmVrbDZiMFIzR2lKQlQwMVpVbmRDYUVKNVpFOHpYMWxaYUdsV00zY3RUelJtUTIwME5FTnVVR3BSIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCYXl0LmNvbSIsImxpbmsiOiJodHRwczovL3d3dy5iYXl0LmNvbS9lbi9zaW5nYXBvcmUvam9icy9pbnRlcm1lZGlhdGUtc29mdHdhcmUtZW5naW5lZXItNTkwMTc3ODgvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Senior Engineer - Software", "company_name": "Adecco Personnel Pte Ltd", "location": "Singapore (+1 other)", "via": "via Monster", "description": "Job Responsibilities\n\nResponsible for the core architectural designs and background developments pertaining to the field of finance, which requires the developed systems to have high throughput (10,000 TPS per second), low latency, high availability, and high reliability development of the core trading system\n\nResponsible for the development and preparation of relevant technical documents\n\nProvide other technical support when needed\n\nRequirements\n\nPossesses a Bachelor’s degree or above in a computer related major, with at least 3 years of distributed system development experience in C ++ / Golang under Unix/Linux\n\nProficient in TCP/IP, HTTP protocols, and inter-process communication programming\n\nFamiliar with common architecture design methods under Unix/Linux\n\nFamiliar with the principles of Unix/Linux operating system and skilled in using shell tools\n\nExperience in pure memory service development system is preferred\n\nExperience in the development of market systems and trading... systems such as stocks and futures which has low latency, high availability, and high reliability features is preferred", "extensions": ["4 days ago", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgRW5naW5lZXIgLSBTb2Z0d2FyZSIsImNvbXBhbnlfbmFtZSI6IkFkZWNjbyBQZXJzb25uZWwgUHRlIEx0ZCIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiQ1phcWJtVlM2elkzQ0hHYUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNb25zdGVyIiwibGluayI6Imh0dHBzOi8vd3d3Lm1vbnN0ZXIuY29tLnNnL2FtcC9qb2ItdmFjYW5jeS1zZW5pb3ItZW5naW5lZXItc29mdHdhcmUtYWRlY2NvLXBlcnNvbm5lbC1wdGUtbHRkLXNpbmdhcG9yZS0yNzc5MTA5Ny5odG1sP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Software Engineer", "company_name": "Hodlnaut", "location": "Singapore", "via": "via LinkedIn", "description": "Due to COVID-19 and the tightened travel/work visa restrictions, Hodlnaut is currently unable to extend offers to anyone who cannot work from Singapore due to lockdown visa/travel restrictions, or other restrictive measures until further notice. We will be prioritizing candidates who can start in this location by set date as expected.\n\nCompany Profile\n\nHodlnaut is the leading Crypto Borrowing and Lending Platform based in Singapore whose mission is to provide financial services to cryptocurrency users. The platform currently has over $250 Million USD of Digital Assets under Management (Bitcoin, Ethereum, DAI etc) and is growing at an average of 20% month on month.\n\nHodlnaut is a certified Fintech by the Singapore Fintech Association, an accreditation recognized by the MAS (Monetary Authority of Singapore). Hodlnaut is also currently undergoing license application under the PS Act 2019 (by the MAS) and is looking to become the first regulated entity in Singapore within the Crypto... Borrowing and Lending Space.\n\nAs Hodlnaut scales, it is looking for a Software Engineer to join the team.\n\nJob Description\n\nWe are currently looking for a Software Engineer/Developer to join our small team. Almost everything is built using JavaScript (React + Node.JS) and deployed on AWS. Our team is small; we don’t have specialists or people who are experts on algorithms but we have a team that knows how to deliver a product from code to production. We want you to be part of this ethos, be willing to learn how to do tasks outside your skillset and keep the customer and business in mind when writing code.\n\nHere are some technologies that we use: React, Redux, Material-UI, Node.JS, Express, Rest API, Websockets, Redis, Gitlab, AWS, Docker, Nginx and more.\n\nRequirements\n\n· Interest and knowledge in some of these technologies is a bonus:\n\n· Redis, Kafka, PostgresQL, Elasticache, DynamoDB\n\n· Cloud Computing (AWS, Azure)\n\n· Devops (Ansible, Gitlab, Docker, Kubernetes, Terraform)\n\n· Monitoring (Netdata, Prometheus, Grafana)\n\n· Experience/Education to demonstrate a track record in building web platforms\n\n· Knowledge and experience with micro service architecture backed and SPA frontend\n\n· Able to write JavaScript and/or Typescript codes proficiently\n\n· Consider performance, usability and security while coding\n\n· Ability to learn new technologies/skills independently through online resources\n\n· Interest and knowledge in some of these technologies in a bonus:\n\n· Message queues (Redis, RabbitMQ)\n\n· Cloud Computing (AWS)\n\n· Devops (Ansible, Gitlab, Docker, Kubernetes)\n\n· Monitoring (GrayLog, Prometheus, Grafana)\n\n· Development of Blockchain Wallets for the Hodlnaut App (hodlnaut.com)\n\n· Ability to build data analytics tools for marketing team\n\n· Passion for cryptocurrencies/finance is a plus\n\nThis position provides a large opportunity for professional growth as we scale our organization. The individual who joins our team should expect to scale with our company and be ready to take on larger responsibilities over time. The position will report directly to the CTO\n\nFresh Graduates and Final Year Students are welcome to apply.\n\nWe thank all applicants for their interest but will only contact candidates selected to advance in the hiring process", "extensions": ["7 days ago", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciIsImNvbXBhbnlfbmFtZSI6IkhvZGxuYXV0IiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJGUjYyT042LWNSMUFySnk1QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExpbmtlZEluIiwibGluayI6Imh0dHBzOi8vc2cubGlua2VkaW4uY29tL2pvYnMvdmlldy9zb2Z0d2FyZS1lbmdpbmVlci1hdC1ob2RsbmF1dC0yNDgzNjkwNTA0P3JlZklkPWUzZjRjMDVmLTQ4NmUtNGY0ZC1iYzExLTczYmRlM2E1MWNmN1x1MDAyNnRyYWNraW5nSWQ9aTJxJTJCSWNIMzliOUNueDVPbkl6T1dRJTNEJTNEXHUwMDI2dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Senior Node.js Developer", "company_name": "Publicis Sapient", "location": "Singapore (+1 other)", "via": "via NodeFlair", "description": "Publicis Sapient is looking for a Senior Developer with Node.js to join our vibrant Technology team based in Singapore. You will help deliver some of the most cutting-edge digital transformation programs for our clients across Southeast Asia. You will manage the development, design, user interface, technology integration, and site architecture management. In this hands-on consultant role, you will engage with the client to build and maintain relationships and work as a regional cross-functional agile delivery team member.\n\nThis role is an excellent opportunity for someone who wants to join an international global organization with a 'start-up' mentality. We highly value Openness, Collaboration, Learning Mindset, and partnering with our clients to drive Positive Outcome\n\nYour Impact\n• Providing technical expertise for every phase of the project lifecycle—from concept development to solution design, implementation, optimization and support\n• Working with cross-functional teams to... analyze, evaluate, and incorporate strategic systems into the architecture as appropriate\n• Development of new software solutions as well as supporting, maintaining and enhancing existing systems\n• Migration from Monolithic to pure cloud-based Micro-services\n• Supporting Kubernetes for CI/CD with AWS & Dockerized deployments\n• Algorithmic solution designing & implementatio\n• GraphQL as a query language for API\n• Frameworks & libraries: Express, NodeJS, Apollo Server, Mocha & Chai\n\nQualifications\n• 5+ years experience working with Node.js (Express), GraphQL & REST API\n• Experienced in server programming & proficient in coding with Node.js & Javascript\n• Experienced in working with databases such as PostgreSQL, MySQL, Redis or MongoDB\n• Able to demonstrate a good understanding of REST\n• Experience in deploying applications to cloud services such as AWS, GCP or Microsoft Azure\n• Experienced in optimizing server performance\n• Experience in algorithmic solution designing & implementation\n• Contribute effectively in a fast-paced, deadline-driven, and collaborative programming environment\n• Lead & contribute through the completion of all phases of application development\n• Good problem solver keeping the end goal in mind with a learning mindset\n• Agile development experience to collaborate with the delivery team regionally\n\nSet Yourself Apart\n• In-depth expertise in Docker and Kubernetes\n• Knowledge in front-end coding experience in React.js is a plus\n• Experience in Digital Banking or Financial Service industry preferred\n• Relevant developer certification is a plus\n\nAdditional Information\n• Career growth and training opportunities\n• A collaborative, agile and diverse regional team\n• Comprehensive insurance and medical benefits\n• “Plugged” into a global organization with a start-up mindset", "extensions": ["24 days ago", "Full–time"], "detected_extensions": {"posted_at": "24 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgTm9kZS5qcyBEZXZlbG9wZXIiLCJjb21wYW55X25hbWUiOiJQdWJsaWNpcyBTYXBpZW50IiwiY29tcGFueV9taWQiOiIvbS8wOW44XzJrIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoidTllUjZPSDVHUmN6ejZrV0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZZQkNyY0JRVTVWWDA1eFZEbGtTRm90WTBodFZHaHBhRzFLUmxkSVpHbGxRa0pNUVhOdU1FZHlXa05NWWpoRVNFdGZibWsxV0cxeFRXdHZkbmhwWTNoMGVsTldjRXBvVFdFM1FtdFhZbE5pVEZaeVVYTjRjSFF0YTFocVkwYzNVVjg0UkRWUlZ6WmllVk5YZVZSZmRsZGxXVUV0T0VWbU5ERndhbWRpUVhoV1ZVZGZRVE51V0dkaVJEZFJjelp0VWtwSVMxWkxNVzkyTlUxVlNtOVlVWG93V21NMVkzZDNielJuTjNWbU9EbFRPR2RzV1d0a01GRlZOMmRKRWhabFNIRkRXVXRVTTBSa2RUSjBRV0UyZWtsNmIwUjNHaUpCVDAxWlVuZEVlVGRVYjJkWlVYUTFUa3gwY2pFdFUzTTFhMjFFVjFwTExWOW4iLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18yNSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBOb2RlRmxhaXIiLCJsaW5rIjoiaHR0cHM6Ly9ub2RlZmxhaXIuY29tL2pvYnMvbGlzdGluZ3MvMTA1NDQ/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "MuleSoft Developer", "company_name": "Viseo Pte Ltd Inc", "location": "Singapore", "via": "via Jobs | Fidanto", "description": "We are looking for a Certified MuleSoft Developer with background in the IT Consulting industry, with the following responsibilities: Identify, analyze and develop interfaces and integration flows using Mule ESB Anypoint platform. Familiarization with Mule Runtime, Connectors, Design Center and API management. Responsible for programming and software development using variety of programming language and related tools Explain and understand complex technical issues to project managers, development teams, team lead and architects Able to work independently providing expertise in MuleSoft and Salesforce Integrations. Skills & Experience : Bachelor’s Degree or equivalent experience required 4+ years of Working knowledge of MuleSoft SaaS technology, and business integrations and maintenance within complex international organizations. Background in the Software development and familiar with End of End Development. Experienced in Salesforce Connectors and API. Identify, analyze and develop... interfaces and integration flows using Mule ESB Any platform including Mule Runtime, Connectors, Design Center and API Management. Deep understanding of Synchronous / Asynchronous communication patterns and problem-solving abilities with respect to Message Sequencing, Correlation and Queuing. Experienced in Mule administration, Configuration and tuning. Seeks and engages in continued learning of Agile practices and principles, ensuring that development technologies and best practices methodologies are adopted and applied by all team members. Demonstrate an understanding of software patterns, software modelling, secure programming principles, test-driven development or another unit testing methodology, and code standards compliance. Ability to work with business and technology stakeholders to translate business problems into technical designs within an Agile environment. Adept at producing fully responsive applications within a multitude of environments using modern up-to-date techniques, whilst still being able to support legacy systems and platforms. Working knowledge of MuleSoft, SaaS technology, and SaaS business integrations and maintenance within complex international organizations. Mandatory Certifications MuleSoft Certified Developer – Integration and API Associate (Mule 3) Good to Have Knowledge in on-Premise Platform integration (e.g. Informatica, Talend , TIBCO) MuleSoft Certified Developer- API Design Associate (RAML 1.0) Additional Information Senior Executive Qualification Bachelor's Degree, Post Graduate Diploma, Professional Degree With strong expertise in digital, new technologies, business processes and data strategy, VISEO assists clients in their digital transformation projects. We help to bring forward new ideas, new ways of collaboration, optimise existing business processes and initiate new business opportunities. Established in France since 1999, VISEO has a strong team of over 2500 employees working globally across six continents. VISEO Asia was subsequently founded in 2009, with its HQ in Singapore and other counterparts located in Bangkok, Hong Kong, Cebu, Manila and Sydney. As part of the 2020 Business Plan, VISEO is committed to strengthen our international presence, especially in the APAC region. VISEO Asia has the tenacity and flexibility of a start-up. Join the VISEO family as we put you at the heart of innovation. We ensure the development of your skills by having regular exchanges with peers and coaching by a technical mentor. Have fun while challenging yourself as you participate in agile projects, trainings, internal events, certifications and conferences which will contribute to the growth of your career! Additional Company Information Registration No. 200900391Z Company Size 1001 - 2000 Employees Average Processing Time 8 days Consulting (Business & Management) Benefits & Others Miscellaneous allowance, Medical, Regular hours, Mondays - Fridays, Business (e.g. Shirts", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJNdWxlU29mdCBEZXZlbG9wZXIiLCJjb21wYW55X25hbWUiOiJWaXNlbyBQdGUgTHRkIEluYyIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiZUNDbS1TdXpCaFpuZEswbkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIHwgRmlkYW50byIsImxpbmsiOiJodHRwczovL3NnLmZpZGFudG8uY29tL2pvYnMvam9iLW9wZW5pbmcvc29mdHdhcmUtZGV2ZWxvcGVycy1hcHBsaWNhdGlvbnMvbXVsZXNvZnQtZGV2ZWxvcGVyLTI3NTUyODM2OT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior Pega Developer", "company_name": "FRG Technology Consulting", "location": "Singapore (+1 other)", "via": "via Glassdoor", "description": "My client is in the global MNC that is the leader in the market. We are looking for Senior Pega Developer to join the team due to increased in project demand and expansion plan. This is a permanent role and you can look forward to involve in enterprise scale systems and a competitive package.\nResponsibilities:\n• Involve in delivery of end to end software development life cycle\n• Ensure scability of the product, backend infrastructure is ready and proper architecture design\n• Drive the delivery of global components and solutions, design and integrate them in various stages of software development life cycle\n• Delivering new features or products and help them focus to build awesome products\n• Collaborate across cross locations IT teams in delivering software components\nExperience:\n• Bachelor degree in Computer Science, Information Technology, or related\n• Hands-on server-side application development experience in Pega, or Java languages\n• Strong knowledge in webservices such as SOAP... 1.2, WSDL 2.0 and XML 1.0\n• Pega certification is ideal (SA/SSA), and exposure on Pega PRPC BPM platform\n• Working experience with Agile methodologies\n• Excellent communication skills and ability in liaising with counterpart team based across APAC region\nThis is a very stable environment and you will be focus on enterprise level system architecture. Interested candidates please send across your updated CV to my email at j.chua@frgconsulting.com to find out more!\n\nEA License Number: 11C3017EA Personnel Number: R1658550", "extensions": ["4 days ago", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgUGVnYSBEZXZlbG9wZXIiLCJjb21wYW55X25hbWUiOiJGUkcgVGVjaG5vbG9neSBDb25zdWx0aW5nIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJNc1pjWVdUODV4VHZESUpsQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEdsYXNzZG9vciIsImxpbmsiOiJodHRwczovL3d3dy5nbGFzc2Rvb3Iuc2cvam9iLWxpc3Rpbmcvc2VuaW9yLXBlZ2EtZGV2ZWxvcGVyLWZyZy10ZWNobm9sb2d5LWNvbnN1bHRpbmctSlZfSUMzMjM1OTIxX0tPMCwyMV9LRTIyLDQ3Lmh0bT9qbD00MDY0NzYxODIxXHUwMDI2dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "System Engineer", "company_name": "JOBLINE RESOURCES PTE. LTD.", "location": "Singapore (+1 other)", "via": "via Learn4Good", "description": "Position: System Engineer (Ref 24173)\nLocation: null\nRoles &\n\nResponsibilities\n\nResponsibilities:\n\n- Responsible for the system design, implementation, testing, managing and maintenance of proposed system\n\n- Work closely with Team Leader to meet system delivery milestones\n\n- Provide technical documentation support to Project & Solutions Teams, as well as hand over as-built system documentation to Maintenance support team\n\n- Engage with back-line support and/or with vendor’s support to diagnose and rectify technical problems.\n\n- Assist in day-to-day operation of the System Delivery team\n\n- Carry out other technical related duties that may be required.\n\nRequirements:\n\n- Diploma/ Degree in Information Technology, Electrical / Electronic, Information Systems or equivalent discipline.\n\n- 3 – 10 years of relevant experience in server administration.\n\n- Good analytical and problem-solving skills.\n\n- Possess initiative with positive working attitudes and customer services oriented;\n\n... Independent and goal-oriented;\n\n- Strong teamwork, communication and interpersonal skills;\n\n- Minimally three (3) years hands-on experience in administration of servers.\n\n- Microsoft Hyper-V, VMWare\n\n- Windows 2008/2012/2016 Server\n\n- Active Directory, DHCP, DNS, Group Policy\n\n- Preferably experience in Commvault/Symantec Backup Products\n\n- Preferably experience in Trendmicro/Symantec Anti-virus products\n\n- Preferably certified in Microsoft Certified Systems Engineer (MCSE), Microsoft Certified Systems Administrator (MCSA), ITIL or equivalent.\n\n- Knowledge with EMC storage\n\n- Good understanding with application tiers, IIS, Databases\n\n- Good understanding with Change Management processes\n\n- Basic Networking knowledge is a plus License No.: 12C6060\n\nTell employers what skills you have\n\nMaintenance\n\nSystem Design\n\nTechnical Documentation\n\nVMware\n\nVMware Infrastructure\n\nVMware Server\n\nWindows Server\n\nWindows System Administrationsystem\n\nMaintenance supporttechnical problemsline supportsystem delivery", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTeXN0ZW0gRW5naW5lZXIiLCJjb21wYW55X25hbWUiOiJKT0JMSU5FIFJFU09VUkNFUyBQVEUuIExURC4iLCJjb21wYW55X21pZCI6Ii9nLzExZ3AyNjQ3cG4iLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJRRlQ2V3MyTUV6OElzSnBoQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFb3NDQ3N3QlFVNVZYMDV4VVZsemVtTk5RVk5HTmtOb1RqWTRPREJtYjJacU4xOXNOVEZmVmw5aVowRkxiRXBoUTJsRlNUQmhiMXB1TWpodFh6SkNkMWh6Tm14Q1ZXRkVhbXBwU2pWRk1uUk9OR05wYlVSck1UVTROV05TTFVsS2NIRlJSVzU2TVdWVldVdE9TWE5aYlV0d1lrRTNPV1pWVEc5RFpXbFROVEJhZURkZlkzWTFVMjE1UkZGa1VGcFZXazUyYVRVd01ITlBVRkJoTWpRMVZGOTJiWEp2VldObmNYZHdjRlIwVFRGM1ZXVjVWMk0zU1VaNk5sSXlPVXAzZDBkd2Iwd3RSMjFJVmsxRE5rNXRUak5URWhabFNIRkRXVXRVTTBSa2RUSjBRV0UyZWtsNmIwUjNHaUpCVDAxWlVuZERVREpLYnpRdFQwRm5OVWc0Vlc5MFpUUmFiVkpNUzJaUE5HRlIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18zOSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMZWFybjRHb29kIiwibGluayI6Imh0dHBzOi8vd3d3LmxlYXJuNGdvb2QuY29tL2pvYnMvc2luZ2Fwb3JlL2luZm9fdGVjaG5vbG9neS8yNzEyNzgzMjAvZS8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "#sgunitedjobs Javascript (reactjs) Software Engineer", "company_name": "LUXOFT INFORMATION TECHNOLOGY (SINGAPORE) PTE. LTD.", "location": "Singapore", "via": "via MNC Jobs Singapore | MNC Jobs In Singapore", "description": "Responsibilities:\n• Develop new components and features for our frontend app(s)\n• Write, audit, and improve our test coverage\n• Document and refactor our frontend codebase\n• Profile and improve our frontend performance\n• Write about your work and contribute back to open source\n\nMandatory Skills:\n• BS/MS degree in Computer Science, Software Engineering or a related subject.\n• Overall with 5+ years’ experience in HTML, CSS and JavaScript\n• 3+ years' experience working with any JavaScript framework/library, preferably React\n• In-depth understanding of JavaScript, HTML5, CSS3 (pre-processors LESS/SASS) and relevant concepts\n• Proficiency with browser based debugging\n• Understanding of progressive web apps\n• Experience with a testing framework (Jest/Mocha)\n• Experience using Git\n\nNice-to-Have Skills:\n\nJava Certification\n\nAWS Cloud Knowledge\n\nCICD Pipeline", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiIjc2d1bml0ZWRqb2JzIEphdmFzY3JpcHQgKHJlYWN0anMpIFNvZnR3YXJlIEVuZ2luZWVyIiwiY29tcGFueV9uYW1lIjoiTFVYT0ZUIElORk9STUFUSU9OIFRFQ0hOT0xPR1kgKFNJTkdBUE9SRSkgUFRFLiBMVEQuIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiI0eXBRMm1yUmZNZkxwVXhIQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1OQyBKb2JzIFNpbmdhcG9yZSB8IE1OQyBKb2JzIEluIFNpbmdhcG9yZSIsImxpbmsiOiJodHRwczovL3NnLm1uY2pvYnouY29tL2pvYnMvc2d1bml0ZWRqb2JzLWphdmFzY3JpcHQtcmVhY3Rqcy1zb2Z0d2FyZS1lbmdpbmVlci1zaW5nYXBvcmUtMjE5NjAxP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Senior Software Engineer (Java, Spring Boot) - Singapore", "company_name": "EPAM", "location": "Singapore", "via": "via JobWiz", "description": "We are looking for an experienced Senior Software Engineer (Java) in Singapore to make the team stronger.\n\nWe Value\n\nValue the individuals – We encourage and motivate people to grow. We perceive our people as a source of our success;\n\nStrive for excellence – We strive for the highest standards of excellence and continuously learn. We take pride in our engineering and accomplishments;\n\nAct as a team – We treat one another with respect and encourage the best ideas to come from anywhere within the organization. We value our diversity;\n\nFocus on Customers – We build long term customer relationships, as we strive to always understand our customers' business and needs;\n\nAct with integrity – We operate legally, honestly and ethically. We take responsibility for our actions.\n\nResponsibilities\n• Understand user requirements, design, build and maintain reusable codes in a project setting\n• Perform unit testing and non-functional testing\n• Troubleshoot and debug application\n• Provide technical... directions and system architecture\n\nRequirements\n• Proven working experience in Java development\n• Good hands on experience on Spring, JMS, IBM MQ, unix, shell scripting, web service, Ant, Junit, subversion, Github\n• Development experience on the database is a plus\n• Experience in designing and building applications\n• Good understanding of software design and programming principles\n• Good presentation and coordination skills to work from onsite with our stakeholders and the offshore team\n• Analytical thinking and problem solving capability\n• Great attention to detail\n• Good time-management skills\n• Being able to work independently with little or no supervision\n• Able to pick up new template development work if there is a need to do template development\n• Technical Requirements:\n• 8 to 10 years in end to end SDLC - analysis ,application design & development, implementation, deployment and maintenance especially with J2EE stack technologies preferably in banking domain\n• Exposer to both waterfall and Agile methodologies (Preferably SAFe)\n• Review code changes requests to identify potential improvements and to prevent errors, before approving and releasing the code\n• Using coding standards and best practices to ensure quality\n• Good hands-on experience with JAVA 8, Spring, Spring-boot, JPA/Hibernate, Tomcat, Oracle, Unit testing\n• Developing high-quality and detailed designs documentation\n• Identifying risk and conducting mitigation action planning\n• Provide support to business users of the IT application systems\n• Assist the Project Manager to conceptualize, develop and implement IT Projects\n• Knowledge on containerization, CI/CD pipelines will be advantage\n\nNice to have\n• Experience in managing Thunderhead instances with knowledge on Admin, business content studio, business object studio, user management etc\n\nWe offer\n• Friendly team and enjoyable working environment\n• Work-life balance and flexible schedule\n• Online training library, mentoring, career development and potential partial grant of certification\n• Unlimited access to LinkedIn learning solutions\n• Referral bonuses\n• Compensation for sick leave and paid time off\n• Opportunities for self-realization", "extensions": ["22 days ago", "Full–time"], "detected_extensions": {"posted_at": "22 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgRW5naW5lZXIgKEphdmEsIFNwcmluZyBCb290KSAtIFNpbmdhcG9yZSIsImNvbXBhbnlfbmFtZSI6IkVQQU0iLCJjb21wYW55X21pZCI6Ii9tLzBkbG5yYyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IkVSbWVscDZLZ1FrbkNDVUZBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVzc0JDb3dCUVU1VlgwNXhWRWRHVEdFM1kzbElWRU5MZEZwaVJ6SlFSVWgxVldkTU1tWmFlV2RYZEdreWN6UjBZbVZVUVhWUk4xTlFhbTFOZWtsVE0yWlllSGcxVnkxalpWSmxaMUowTlZGbGVqYzRkalJKVTJVMk1ETlRlRTAzYlZVNVIxSTFaSEExVnprMWRXOTFRMmw1Wm10aVFYQlFNRVZuWWs5SFdrVkJPRlp5VTB0VllYSXRTR2gwTUdKdFpHWVNGbVZJY1VOWlMxUXpSR1IxTW5SQllUWjZTWHB2UkhjYUlrRlBUVmxTZDBONlNUbHpTVXRQVnpST2VWSm9XakI1YVdKMGFYSk5PVTVEWlVFIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNTAiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9iV2l6IiwibGluayI6Imh0dHBzOi8vam9id2l6LnNnL2pvYi9DUi0zODU4Njc5MjU1P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Senior Software Developer", "company_name": "Singtel", "location": "Singapore", "via": "via Laimoon.com", "description": "Singtel, Asia's leading communications technology group, provides an extensive range of telecommunications and digital services to millions of consumers and businesses across Asia, Australia, Africa and the USA. With over 140 years of innovation behind us, we continue to push boundaries in our networks and services, to enrich lives and transform businesses.\n\nOur core values - Customer Focus, Challenger Spirit, Teamwork, Integrity, and Personal Excellence - shape the way we work. We are passionate about making a difference and have an open and inclusive culture where everyone is empowered to do their best. Our diverse business means you will enjoy unique opportunities and rewarding experiences to learn and grow your career in a dynamic industry.\n\nJoin us and experience what it's like to be with an Employer of Choice*. Together, let's create a brighter digital future for all. *Awarded at the HR Fest Awards 2020\n\nWe are seeking for a hands-on full stack developer, who will be part of the... software development team of the Group Enterprise 5G/IOT product house, contributing on the software development for 5G business services platform and application suite. Singtel is building a unique 5G platform completely homegrown and in this position you will work with the 5G product team, to:\n• Build the 5G platform in a completely scalable fashion that can process millions of messages concurrently and can scale upto million concurrent enterprise application connections.\n• Contribute to designing and developing the platform in an infrastructure agnostic fashion so that the platform can work with any network backend in a plug and play fashion.\n• Bring in your experience in building scalable and repeatable platforms to make every component of the platform modular by design with industry grade security.\n• Design and implement RESTful APIs to expose platform features as microservices.\n• Build and deploy performant modern web applications in React, Redux, Webpack, ES6, and Flow\n• Architect efficient and scalable backend systems\n• Write unit, functional and end-to-end tests for the platform\n• Write high-quality code (Ruby on Rails, Go, Java etc) that communicates with upstream backend services via HTTP APIs\n• Identify and resolve performance and scalability issues\n• Participate in code reviews\n• In depth understanding of the whole web stack, web protocols, and web performance optimisation techniques\n• In-depth understanding of web frameworks (such as Rails, Django, Spring etc)\n• Detailed knowledge of minimum one modern JavaScript framework: React, Ember, Angular, etc\n• Proficient understanding of the HTTP protocol\n• In depth knowledge of Relational, No-SQL databases, and message queues/brokers\n• Understand at least one backend MVC framework - Java and Spring Boot are strongly preferred\n• Build micro-services and understand different patterns to approach the designs.\n• Worked on cloud platforms preferably PCF and used tools such as Docker.\n• Experience in designing and delivering APIs and security models\n• Excellent understanding of\n• Message queue systems (Kafka)\n• Monitoring and logging tools (ELK, Splunk)\n• Front-end frameworks (React, Vue JS, Bootstrap, jQuery)\n• Web app frameworks (Django, Drupal etc.)\n• Databases and storage/caching (Postgres, MongoDB, Redis)\n• Contribute to software development and associated new technology selection and adoption. Focus areas include developing API driven features on big data, machine learning, auto scaling micro-services, scalable data storage/retrieval.\n• Work on architecture and software development across platform components like customer onboarding, data management, application lifecycle etc along with development of 5G applications, collaborating with multiple teams within the SingTel Group.\n• Participate on common platform functionality, and consistent, best-practice platform and application design.\n• Adopt industry standard coding practises to develop the platform to ensure scalability, security and stability\n• Participate on the move to a full SaaS deployment and management\n• Train Pre-sales team and solution architecture team to use the Singtel 5G platform and act as SME on the platform.\n• Collaborate with Business development and partnership team to develop integration adapters for third party technology and applications.\n• Participate in technical partnership conversations and due diligence\n\nThe succcessful candidate should possess:\n• MInimum a Degree in Computer Science or equilavent\n• Knowledge of Backend Programming Language like Java (J2EE and J2SE 1.8 or higher) and Python. Additional knowledge on Scala would be preferable\n• Knoledge of Front End Programming Language like HTML, CSS, Drupal, Bootstrap, Angular, JQuery. Additional knowledge on Reactjs would be preferable.\n• Knowledge of Database Technologies like Cassandra, MongoDB and Elasticsearch (At least 2). SQL databases like Postgres, MySQL\n• Knowledge of Source code Management and Build like GIT, Maven, Ant and Scrum/Task Management with JIRA, Confluence\n• Knowlecge of Messaging using Kafka, Any Pub/Sub library\n• KNowledge of Dev Ops & Containerization like Docker, Jenkins and has done scalable deployment with Kubernetes\n• Experience with Machine Learning Libraries like MLib, DL4J, H20, Tensorflow (Atleast one)\n• Has deploy project using Big data Platforms like Spark (Core and Streaming) or Hadoop and File systems like HDFS\n• Familiar with Integration methods like REST API's, messaging, WSDL, SDK's and API Documentation lusing Swagger or similar\n• Experience developing complex, enterprise grade, configurable, scalable software products.\n• A background in systems level thinking and design. Combined with the ability to translate technical strategy and architectures into concrete, minimal viable products, with the right tradeoffs and phasing.\n• Broad and deep knowledge of relevant technologies, including messaging, relational and NoSQL databases, data modelling, analytics, IoT, and interfaces. Exposure and experience with Artificial intelligence will be a plus.\n• Deep understanding of the architectural principles for cloud based platforms that include SaaS, PaaS, multi-tenancy, infrastructure as code, and continuous availability.\n• Experience working in an agile environment\n• Strong written and verbal communication skills.\n• Ability to collaborate effectively across various cross-functional teams and groups.\n\nWe believe in the strength of a vibrant, diverse and inclusive workforce where backgrounds, perspectives and life experiences of our people help us innovate and create strong connections with our customers. We strive to ensure all our people practices are non-discriminatory and provide a fair, performance-based work culture that is diverse, inclusive and collaborative.\n\nTechnology", "extensions": ["4 days ago", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgRGV2ZWxvcGVyIiwiY29tcGFueV9uYW1lIjoiU2luZ3RlbCIsImNvbXBhbnlfbWlkIjoiL20vMDIwemZsIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiVWZSbDdyVEtad0xqeko1QkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXNzQkNvd0JRVTVWWDA1eFUwdFRWMEYyVm5KWVJWTklORFJCV0ZSZllucEZUakF6YWtsSVoyUm5SR05WYlhnd2VTMUdZbUl6UVRCdWJIaFBWelJWVldSUmVVdFhabXBNVTBwbllrcE1ieko2WWtGbFNUTlJiMXBPVTBJM05XUmpWMmxxYVRaWWFHNDRjM0pYZWtOSFJFcG5VMGhLVXpOMVdsVjFSV0pYY0d3MlNYaHliWFIxU25oTmExZHFXRXhTYzFJU0ZtVkljVU5aUzFRelJHUjFNblJCWVRaNlNYcHZSSGNhSWtGUFRWbFNkMEp6U2tJMmNrcEhkR3h4ZDNwSVRrbHdlVWxtUm1odWVrRTBhMUUiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY181OCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMYWltb29uLmNvbSIsImxpbmsiOiJodHRwczovL2pvYnMubGFpbW9vbi5jb20vam9icy9leHRlcm5hbHZpZXcvMjU3MzU2NTI/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}], "chips": [{"type": "Title", "param": "job_family_1", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:Google Sans,arial,sans-serif}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Software engineer", "value": "software engineer"}, {"text": "Senior", "value": "senior"}, {"text": "Test engineer", "value": "test engineer"}, {"text": "Cloud engineer", "value": "cloud engineer"}, {"text": "Engineer", "value": "engineer"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Assurance engineer", "value": "assurance engineer"}, {"text": "Programmer", "value": "programmer"}, {"text": "Coach", "value": "coach"}, {"text": "Qa engineer", "value": "qa engineer"}, {"text": "Devops engineer", "value": "devops engineer"}, {"text": "Frontend engineer", "value": "frontend engineer"}, {"text": "Java engineer", "value": "java engineer"}, {"text": "Solutions engineer", "value": "solutions engineer"}, {"text": "Testing engineer", "value": "testing engineer"}, {"text": "Analyst", "value": "analyst"}, {"text": "Data engineer", "value": "data engineer"}, {"text": "Design engineer", "value": "design engineer"}, {"text": "Development manager", "value": "development manager"}, {"text": "Devops consultant", "value": "devops consultant"}, {"text": "Firmware engineer", "value": "firmware engineer"}, {"text": "Lead engineer", "value": "lead engineer"}, {"text": "Lecturer", "value": "lecturer"}, {"text": "Manager", "value": "manager"}, {"text": "Network systems", "value": "network systems"}, {"text": "Principal", "value": "principal"}, {"text": "Principal engineer", "value": "principal engineer"}, {"text": "Quality engineer", "value": "quality engineer"}, {"text": "Science", "value": "science"}, {"text": "Scrum master", "value": "scrum master"}, {"text": "Security architect", "value": "security architect"}, {"text": "Security engineer", "value": "security engineer"}, {"text": "Senior engineer", "value": "senior engineer"}, {"text": "Senior lecturer", "value": "senior lecturer"}, {"text": "Senior system", "value": "senior system"}, {"text": "Senior technical", "value": "senior technical"}, {"text": "Software architect", "value": "software architect"}, {"text": "Specialist", "value": "specialist"}, {"text": "Stack engineer", "value": "stack engineer"}, {"text": "System engineer", "value": "system engineer"}, {"text": "Technical", "value": "technical"}, {"text": "Trainee", "value": "trainee"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Wholesale", "value": "/business/naics2007/42"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Mining", "value": "/business/naics2007/21"}, {"text": "Rental", "value": "/business/naics2007/532"}, {"text": "Retail", "value": "/business/naics2007/44"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": ".AB4Jjf.qPB6Vc{padding-right:11px}.qfpP8d{padding:7px 0 7px 11px}.S003Ke{flex:none}.ZoN4Lb{color:rgba(0,0,0,.54)}.nAXVG{color:#70757a}.IxQsL{color:rgba(0,0,0,.26)}.xFO1De{color:#fff}.ooFpK{color:rgba(255,255,255,.30)}.mtnwac{color:#4285f4}.WxeeKb{color:#34a853}.hIVRU{color:#f29900}.EXaTMc{color:#fbbc04}.sxn46d{color:#000}.gqMTF{color:#1a73e8}.zpn8Mb{color:#d93025}.dEUPmd{color:#1e8e3e}.PJNo1{color:#fbbc04}Actively Hiring", "value": "e"}, {"text": "EPAM", "value": "/m/0dlnrc"}, {"text": "VISA", "value": "/m/01kqjn"}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Zühlke", "value": "/g/1hh_rg216"}, {"text": "Cardinal Health", "value": "/m/040vzx"}, {"text": "Credit Agricole Group", "value": "/m/028vbm"}, {"text": "GlobalTix Pte Ltd", "value": "/g/11dxpqdhrf"}, {"text": "HCL SINGAPORE PTE. LTD.", "value": "/g/11fy25ngsv"}, {"text": "Jobline Resources Pte Ltd", "value": "/g/11gp2647pn"}, {"text": "Mediacorp", "value": "/m/03qtz1"}, {"text": "Realtek", "value": "/m/05wrm7"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "TECHNOPALS PTE. LTD.", "value": "/g/11dxpvkynp"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "Thales", "value": "/m/01phj4"}, {"text": "UST", "value": "/m/08kb8g"}, {"text": "UrbanFox", "value": "/g/11ghs7y0w6"}, {"text": "Activate Interactive", "value": "/g/11dxq192l5"}, {"text": "Cognizant", "value": "/m/03bf9h"}, {"text": "DELL", "value": "/m/0py9b"}, {"text": "HCL Technologies", "value": "/m/0698gv"}, {"text": "ORACLE", "value": "/m/05njw"}, {"text": "PUBLICIS SAPIENT", "value": "/m/09n8_2k"}, {"text": "Singapore Press Holdings Limited", "value": "/m/0d7mwh"}, {"text": "Temasek Polytechnic", "value": "/m/098s73"}, {"text": "TikTok", "value": "/g/11fy265933"}, {"text": "Zendesk", "value": "/m/0wkm4pl"}, {"text": "A-it Software Services Pte Ltd", "value": "/g/11dxpy_gl_"}, {"text": "ACCENTURE PTE LTD", "value": "/m/09n8w94"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "Adecco GS", "value": "/m/08gz46"}, {"text": "Atidan Technologies", "value": "/g/11c74f0b8_"}, {"text": "Autodesk", "value": "/m/018nm3"}, {"text": "Avnet", "value": "/m/0c8xmc"}]}]}