{"search_metadata": {"id": "608278f76073934cc14b2de4", "status": "Success", "json_endpoint": "https://serpapi.com/searches/e0dad22978901832/608278f76073934cc14b2de4.json", "created_at": "2021-04-23 07:36:23 UTC", "processed_at": "2021-04-23 07:36:23 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28data+scientist%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=10", "raw_html_file": "https://serpapi.com/searches/e0dad22978901832/608278f76073934cc14b2de4.html", "total_time_taken": 1.11}, "search_parameters": {"q": "(data scientist) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "10"}, "jobs_results": [{"title": "Trainer​/Big Data​/Data Science​/Machine Learning", "company_name": "OakTree Consulting", "location": "Singapore", "via": "via Learn4Good", "description": "Position: Trainer (Big Data/Data Science/Machine Learning)\nJob Description\n\nResponsibilities:•Conceptualize and develop new programs specifically in Big Data / Data Science/Machine\n\nLearning / IOT / Cloud Computing•Deliver training and certification programs in Big Data / Data Science / Machine Learning /IOT / Cloud Computing•Develop courseware on a periodic basis in these technologies.\n\nRequirements:•At least a Bachelor’s degree in Computer Science or IT from a reputable University (do not apply if you do not qualify) •Minimum 3 years of experience in these technologies, Big Data/Data Science, Machine Learning, Cloud Computing and IOT •Candidates should be able to train Python/ R code using frameworks such as Scikit-learn, NumPy, SciPy, R studio etc. Please submit resumes to with the following details in MS Word format:\n\n- Position applying for\n\n- Current remuneration\n\n- Expected remuneration\n\n- Notice period John Goh Meng Chye EA License No : 06C4642EA Reg No : R1102621", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJUcmFpbmVy4oCLL0JpZyBEYXRh4oCLL0RhdGEgU2NpZW5jZeKAiy9NYWNoaW5lIExlYXJuaW5nIiwiY29tcGFueV9uYW1lIjoiT2FrVHJlZSBDb25zdWx0aW5nIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiI1TGc4Ti1yT3g4d2Q0cXRIQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExlYXJuNEdvb2QiLCJsaW5rIjoiaHR0cHM6Ly93d3cubGVhcm40Z29vZC5jb20vam9icy9zaW5nYXBvcmUvc29mdHdhcmVfZGV2ZWxvcG1lbnQvMjcxMzM4MjQ0L2UvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Trainer (Big Data/Data Science/Machine Learning)", "company_name": "OakTree Consulting", "location": " (+1 other)", "via": "via Neuvoo", "description": "Job Description\n\nResponsibilities:\n•Conceptualize and develop new programs specifically in Big Data / Data Science/MachineLearning / IOT / Cloud Computing\n•Deliver training and certification programs in Big Data / Data Science / Machine Learning /IOT / Cloud Computing\n•Develop courseware on a periodic basis in these technologies.\n\nRequirements:\n•At least a Bachelor’s degree in Computer Science or IT from a reputable University (do not apply if you do not qualify)\n\n•Minimum 3 years of experience in these technologies, Big Data/Data Science, Machine Learning, Cloud Computing and IOT\n\n•Candidates should be able to train Python/ R code using frameworks such as Scikit-learn, NumPy, SciPy, R studio etc.\n\nPlease submit resumes to with the following details in MS Word format:\n\n- Position applying for\n- Current remuneration\n- Expected remuneration\n- Notice period\n\nJohn Goh Meng Chye\n\nEA License No : 06C4642\nEA Reg No : R1102621", "extensions": ["5 days ago", "Full–time"], "detected_extensions": {"posted_at": "5 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJUcmFpbmVyIChCaWcgRGF0YS9EYXRhIFNjaWVuY2UvTWFjaGluZSBMZWFybmluZykiLCJjb21wYW55X25hbWUiOiJPYWtUcmVlIENvbnN1bHRpbmciLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImRDQmZHX3pLeFRVUnNUQm1BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTmV1dm9vIiwibGluayI6Imh0dHBzOi8vc2cubmV1dm9vLmNvbS92aWV3Lz9pZD1hNTA5MGE3NTlkZDhcdTAwMjZ1dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior Data Scientist - nexus-2100009398", "company_name": "Standard Chartered", "location": "Singapore", "via": "via Bayt.com", "description": "Senior Data Scientist - nexus - (2100009398)\n\nJob: Technology\nPrimary Location: Asia-Singapore-Singapore\n\nSchedule: Full-time\nEmployee Status: Permanent\nPosting Date: 16/Apr/2021, 7:43:44 AM\nUnposting Date: 16/May/2021, 10:59:00 PM\n\nSC Ventures (“SCV”) was established in March of 2018 with the purpose of “Rewiring the DNA in Banking” by bringing three distinct areas together:\n\nThe eXellerator labs, enabling innovation at large in the Bank by supporting:\n\n Entrepreneurially-minded colleagues as “Intrapreneurs”, developing ideas to products, services or new business models.\n\n Collaboration with fintech companies, supported by the SC Ventures FintechBridge[1], Proof of Concept (“POC”) framework and POC funding.\n\n Client engagement on co-creation activities.\n\nThe Innovation Investment Fund (“Fund”), USD100m allocated to acquire minority stakes in fintech companies (“fintechs”) whose technology has been successfully validated in the Group and is progressing to production (i.e... continuing use), subject to commercial due diligence.\n\nVenture building, exploring new business models (“ventures”), with the objective of providing ‘optionality’ for the Group in the way it engages existing and new customers and markets. These adopt a start-up model, operating independently of the Group’s existing businesses, funded in a venture capital fashion, and under a different governance and risk management framework.\n\nThere are c.65 team members (excluding individual ventures), including dedicated colleagues from the Group’s support functions, based in Singapore, Hong Kong, Shanghai, Nairobi, London and San Francisco.\n\nWant to join the nexus team shaking things up in the banking world?\n\nWe’re looking for fun, hardworking, results-oriented individuals to join nexus, the team responsible for Standard Chartered’s brand new, Banking-as-a-Service solution.\n\nWe are looking for a Full-Stack Data Scientist to help build our digital venture in Singapore and analyse large amounts of raw information to find patterns that will help improve our company. We will rely on you to build data products to extract valuable business insights.\n\nIn this role, you should be highly analytical with a knack for analysis, math and statistics. Critical thinking and problem-solving skills are essential for interpreting data. We also want to see a passion for machine-learning and research. As the Data Science team is currently in its early stages, you will have the opportunity to influence and shape the Data Science strategy of the venture.\n\nKey Roles and Responsibilities\n\n• Build/ implement Data Science products with relevant stakeholders, including Data Engineers/DevOps\n\n• Create predictive models and machine-learning algorithms for campaign targeting, transaction categorization, behavioural segment analysis, propensity to buy, churn prediction, dynamic pricing etc.\n\n• Building dashboards and reports that provides insights to business owners and make data actionable\n\n• Creating automated data quality detection systems and constant tracking of its performance\n\n• Assess the effectiveness and accuracy of data sources and data gathering techniques.\n\n• Processing, cleansing, and verifying the integrity of data used for analysis\n\n• Crunch, mine and analyse data from company databases to drive optimization and improvement of product development, marketing techniques and business strategies.\n\n• Use predictive modelling to increase and optimize customer experiences, revenue generation, other business outcomes.\n\n• Develop processes and tools to monitor and analyse model performance and data accuracy\n\n• Doing ad-hoc analysis (e.g. customer 360 analysis) and presenting results to business owners in a clear manner\n\n• Analyse large amounts of information to discover trends and patterns\n\n• Present information using data visualization techniques\n\n• Propose solutions and strategies to business challenges\n\n• Selecting features, building and optimizing classifiers using machine learning techniques\n\n• Enhancing data collection procedures to include information that is relevant for building analytic systems\n\n• Present proposals and results in a clear manner backed by data and coupled with actionable conclusions\n\n• Identify valuable data sources\n\n• Extending company’s data with third party sources of information when needed\n\n• Senior member of the Data Science team and ability to", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgRGF0YSBTY2llbnRpc3QgLSBuZXh1cy0yMTAwMDA5Mzk4IiwiY29tcGFueV9uYW1lIjoiU3RhbmRhcmQgQ2hhcnRlcmVkIiwiY29tcGFueV9taWQiOiIvbS8wMmhzemsiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJiVFlUNnk4WWMxVkg1VGRVQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdllCQ3JjQlFVNVZYMDV4VVhsMFdtMHdYMUJRT0VsWFpERnhjRGRFWkdkU1JrRkpXVzVmY1VReFN6QlJVemMxVDJSU2VHNXhOVXhoT0dWdFNtVjFXbVl4ZVRoMGF6ZEJhbFJZUVVvMFh6VjRaV3N6TTBodFpWUXlTblo2U21kdVQyVk5aMVpuTmtwUVRYaDZaR2xHWW5abVMySkdiekZSWTJkbWRVNTBjbFZVWkdWdGVGVk1VemxuWjJFNGVUQTNkWEUyTm0wNGRteGxWSGRIVW5kNmJUVldPRGx0UkdGVGFtSmtTRlZ2TlZWUFRsaDFjWFY2VUdSdWNWcFpFaFk1TTJsRFdVeEhVMDEwY2xoMFFXRjFNbUo2UVVSM0dpSkJUMDFaVW5kRE1GOUtSalZqVmtwV1MySnplVkJVVldOM01USlBlSFl6TjB0QiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzE3IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJheXQuY29tIiwibGluayI6Imh0dHBzOi8vd3d3LmJheXQuY29tL2VuL3NpbmdhcG9yZS9qb2JzL3Nlbmlvci1kYXRhLXNjaWVudGlzdC1uZXh1cy0yMTAwMDA5Mzk4LTU5NTA5NDU2Lz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Machine Learning Engineer - Singapor", "company_name": "EasyMile", "location": "Singapore", "via": "via Welcome To The Jungle", "description": "We are looking for highly motivated people to build the road ahead and invent solutions to challenges never met before. Beyond excellent technical skills, we are looking for the right attitude: ambition, creativity and perseverance. Highlighting strong values such as innovation, excellence and team spirit, EasyMile’s team keeps pushing boundaries to invent the future of mobility.Position detailsPermanent full-time contract. Starting as soon as possible, depending on your availability.EasyMile has new projects and the perception team is growing!We are expanding our vehicles’ catalogue, therefore we are looking for our future colleague to help us increase our features. You will join a team of 50 R&D engineers at the cutting edge of autonomous navigation technology.Your future responsibilities Define, implement and maintain pipelines / workflows for:\nTraining, validation, and optimization of machine learning based algorithms\nData versioning\nModel Versioning\nDevelop, construct, optimize... and maintain machine learning based infrastructure(s) (e.g. databases / data lakes, training server(s))\nShape EasyMile’s data platform by ingesting, manipulating, and visualising data across data platforms\nCollaborate with cross functional agile teams of software engineers, data scientists, and others", "extensions": ["24 hours ago", "Full–time"], "detected_extensions": {"posted_at": "24 hours ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJNYWNoaW5lIExlYXJuaW5nIEVuZ2luZWVyIC0gU2luZ2Fwb3IiLCJjb21wYW55X25hbWUiOiJFYXN5TWlsZSIsImNvbXBhbnlfbWlkIjoiL2cvMTFid2g1OGpocyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjA1WXZxMDBsWXdHN3VmZDdBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhVWFl4VGw5UFNXdEROVFZyU25wcGJHWjNjazFHYTNwMU4zQkxUWEpxWW01bE1VczVjMjlsYjFodFIycFZlV1pmYTB0aU1UbHRNR2R3YVRGS1IzaHdkRTlwTjBGWWVUWnJjbVYwWkU1R1NHRjFaVFY0ZERadU9VSnVZVEZDUVhGYVVuSnBOVkIwYjNwZlMzcG9hMU5aVmw5SlQyaDZNbkJXU2s5RVFuRnlOekpTU3pGR1JuUm5WMDUwYUZWTlNVRnJRbW8wYTJwMFlrY3RTRlZuRWhZNU0ybERXVXhIVTAxMGNsaDBRV0YxTW1KNlFVUjNHaUpCVDAxWlVuZEVSMEZCTW01eFFscHhMVlZEYlVSTFEySmlNMWxyYVROdWVHNW4iLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18yNCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBXZWxjb21lIFRvIFRoZSBKdW5nbGUiLCJsaW5rIjoiaHR0cHM6Ly93d3cud2VsY29tZXRvdGhlanVuZ2xlLmNvbS9lbi9jb21wYW5pZXMvZWFzeW1pbGUvam9icy9tYWNoaW5lLWxlYXJuaW5nLWVuZ2luZWVyLXNpbmdhcG9yX3NpbmdhcG91cj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Data Scientist", "company_name": "TEKsystems (Allegis Group Singapore Pte Ltd)", "location": "Singapore", "via": "via Laimoon.com", "description": "We are looking for a high-calibre Data Scientist to join an agile and multidisciplinary team of data/AI experts. Our client has developed a product that focuses on helping large enterprises (FinTech, banks, insurance, manufacturing, healthcare, government) harness the power of AI/ML to deploy end-to-end AI solutions. If you're keen on solving complex problems through the use of machine learning, read on!\n\nThis is a Permanent opportunity.\n\nThe Position:\n• Helping companies use their data to drive key decision-making\n• Design end-to-end data science workflows and develop machine learning models to solve a variety of business problems\n• Build efficient data pipeines and collaborate with engineers to productionise the models as microservices in the cloud\n• Strong knowledge on a variety of ML methods such as classifiers, recommendation systems, time series, optimisation, etc. Also hands-on experience of frameworks like TensorFlow, Pytorch etc.\n• Strong coding skills (Python, Spark, SQL... and comfortable analyzing large complex datasets\n\nThe Candidate:\n• Our client is are growing rapidly and hiring across junior, mid to senior levels\n• Ability to adapt to a dynamic, value driven, and self-motivated team culture\nWhat's in it for you?\n• Exposure to the latest cutting-edge big data technologies\n• Rewarding work: Opportunity to have real, actual and immediate impact on the business and the industry\n• You'll work with a great team. They're exceptional at their jobs, and winning market share from their competitors every day.\n• Fun, friendly, open, non-hierarchical, start-up company culture!\n• Competitive compensation and Equity stake in the company\n\nTechnology", "extensions": ["2 days ago", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEYXRhIFNjaWVudGlzdCIsImNvbXBhbnlfbmFtZSI6IlRFS3N5c3RlbXMgKEFsbGVnaXMgR3JvdXAgU2luZ2Fwb3JlIFB0ZSBMdGQpIiwiY29tcGFueV9taWQiOiIvZy8xMWI2ZzRia3YwIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiMzcwd3NQX3hYa0Q3U0ZyY0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXNzQ0Nvd0NRVTVWWDA1eFVVOUtjMDlIUkdwVk5XNUZiVlJmT0VoQmRURllOM2R4YkVwaFZrdGpVSGhUVUdWeWRVTTJRa04zYW1ndFMzZEdlVFZQVm1aNlpHRm5RVGRwUzJsR2QwaG5NbnBFVjFKV2RGTllTR2syZWpSa1JtTlNhbFp2TkRGUVJuUjJlblF3TlRJMUxYcGhSV05UVFhOMGQyTmpNMjVTTkRkcVVUQmhXVUZHY1ZoMFZEbHVNbXR5ZUdaeVgwaE5SM2hhWW1scGNUSlphMDUyV1UxNFJHZEpUbDlOTlc5MGIxOXBRamxXYTFjeVMyTTVUVUZyYjBSUU1EZGtOamd5U3pOQlYzSnlTVUZ1UkdGRE1ubDBTSEZwU1Zrd1RVNUhkMjR3WW5WWmJFRndkbGxTTjBsTmJUSXhSbTFJTW5sWFFVbGlRVWhOTWpZdFRUVmxZV1ZUWWt0VmFtNWxhV3RWVlhkbU1CSVdPVE5wUTFsTVIxTk5kSEpZZEVGaGRUSmlla0ZFZHhvaVFVOU5XVkozUkdsMFREQlhiMlZoWDJOWk9WbGFNWHBtZEZNMGNGVTNka3hmWnciLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18zMiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMYWltb29uLmNvbSIsImxpbmsiOiJodHRwczovL2pvYnMubGFpbW9vbi5jb20vam9icy9leHRlcm5hbHZpZXcvMjYwNzc5NjI/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Lead Professional Officer, Software - Machine Learning, AI - JT - 2309", "company_name": "CTES Consulting Pte Ltd", "location": "Singapore", "via": "via Singapore Job Mela", "description": "Our client is actively searching for a Lead Professional Officer/ Senior Professional Officer - Software Engineering (Machine Learning/ Deep Learning/ Artificial Intelligence) to join their team!If you are a dynamic individual seeking a new career opportunity, read further!The Senior Professional Officer/ Lead Professional Officer acts as a first line mentor to the students on hands-on and practical activities such as labs, student projects and IWSP to enhance the students’ technical problem-solving skills and increase their preparedness for industry. The responsibilities of this role are:Work with faculty in the development, design, planning and set-up of laboratories for teaching and research activities. This may involve activities to plan, procure and manage equipment in the lab, provide training to staff and students on usage of specific laboratory or equipment as well as development of lab manuals.Mentor students during hands-on projects and laboratory activities for ICT year-1... and year-2 student to enhance their practical problem-solving skills. This may involve conduct of relevant practical activities as well as supervision of students in their projects and laboratory assignments as a part of applied learning.Guide students to navigate the industry environment during their Integrated Work Study Programme (IWSP).Support the faculty in the supervision and assessment of students for IWSP, ITP (integrative team project) and for Final Year Projects/Capstones.When innovation project opportunities arise, participate in the project/s together with faculty and students.Working in a team to manage and ensure the readiness, operations and proper maintenance of the laboratories resources.Carry out Risk Assessment, and ensure compliance with Work, Safety and Health Regulations in the laboratoriesThe ideal candidate will need to have the following qualities and experience:A good degree in Computing or Data Science from a recognized University. Major in Software Engineering or possessing a Master degree will be advantageous.Proven AI industry practitioner and working experience as a Machine Learning Software Engineer or similar role, with good knowledge of industry practices and technological applications in the field. Familiarity with machine learning frameworks and libraries (such like Caffe, Spark ML, Keras, PyTorch, TensorFlow, Scikit-Learn, CNTK etc)At least 10 years’ experience in the knowledge domainMust have a firm grasp and understanding of data structures, data modeling and software architecture using Python, R, Java and C, as well as deep knowledge of math, probability, statistics and algorithms.Keen interest to support research and academic project work, with demonstrated ability in developing software solutions to technical problems.Possess strong supervisory skills and enjoy working closely with students in an educational environment.Self-starter with hand-on knowledge to setup network and server systems, manage software development environment and configuration activities to support testing and maintenance of information system, software applications, hosted services and websites.Demonstrate proficiency to keep abreast of development in the field and pursue professional certification programs. Possess of industrial certifications in relevant areas will be an added advantage.Professional Officers appointed at senior levels may have managerial responsibilities.A committed believer in continuous learning and self-improvement, with a strong sense of confidence in managing his/her own learning process.Good communication and interpersonal skills.Passionate about training, coaching and mentoring.Able to build and maintain strong working relationships with people within and external to the university.Self-motivated team player and flexibility to work across functions/teams in a dynamic hand-on environment.Possess strong analytical and critical thinking skills.Show strong initiative and take ownership of work.An exciting career awaits the right candidate! Click Quick Apply to register your interest now.All applicants CV will be treated with the strictest confidentiality. We regret to inform that only shortlisted candidates will be contacted", "extensions": ["8 hours ago", "Full–time"], "detected_extensions": {"posted_at": "8 hours ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJMZWFkIFByb2Zlc3Npb25hbCBPZmZpY2VyLCBTb2Z0d2FyZSAtIE1hY2hpbmUgTGVhcm5pbmcsIEFJIC0gSlQgLSAyMzA5IiwiY29tcGFueV9uYW1lIjoiQ1RFUyBDb25zdWx0aW5nIFB0ZSBMdGQiLCJjb21wYW55X21pZCI6Ii9nLzExanJuNG0xeGMiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJuSVd0OUE3MzljbWctdVgyQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFb3NDQ3N3QlFVNVZYMDV4VTNJeVozaEpOVmRIVjJ4S2JVOTZiR2gwTFROT1ltVk5OMHRSYW1KU1N6RkhNVzlvZUZGUVdIRnhUREpKWmxOWVMzZ3lXaTFhVVY5cVdFeDBXWFpNUkhKcWVEZGZjVzV6Y25KUFJraExVM2RvWTBZeU5tWnJORm94WHpFelJ6ZFdYM1I0WkY4dFIwMUZTVVJIYXpKUVdXUkdUbU54VjNCYVdVUTNVRVI2ZURSV1l6aG9OR0ZoUmxsQlNsOXdjbVpmUVdGdVZqRk1jbFJDWjB0cGFTMVNiMVUwTTBKZlMwRllXbFpzV0V0TmVqQnRabUowWkMxamFFUm9TV2RMVkhsVE0xaHVkMUUyRWhZNU0ybERXVXhIVTAxMGNsaDBRV0YxTW1KNlFVUjNHaUpCVDAxWlVuZEJaVzVyWjI5UlVVWkZZemRtYUVRMGJqUndUVFpxY0VNd1ZVdG4iLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18zOSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBTaW5nYXBvcmUgSm9iIE1lbGEiLCJsaW5rIjoiaHR0cDovL3d3dy5zaW5nYXBvcmVqb2JtZWxhLmNvbS93ZXN0LWpvYnMvbGVhZC1wcm9mZXNzaW9uYWwtb2ZmaWNlci1zb2Z0d2FyZS1tYWNoaW5lLWxlYXJuaW5nLWFpLWp0LTIzMDktMTEzMjQ3P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Data Scientist - Singapore", "company_name": "TikTok", "location": "Singapore", "via": "via Bayt.com", "description": "- Design and build advanced analytical solutions and products to deliver superior business outcomes using research and performing quantitative and qualitative analysis on markets, products and competitors\n- Prove business impact of projects using methods like experimental designs, cohort matching, and causal inference\n- Understand underlying data sources and their limitations. Create innovative approaches to answer pressing questions, prepare complex data analyses and models that help solve issues, drive the scaling of automated processes and deliver significant measurable impact\n- Act as an analytics translator, communicating complex data insights through exploratory analysis and research to discover potential bottlenecks to suggest improvement and workflow of internal teams - Liaise with team members and management in understanding their data needs and providing data support.\n- 2-7 years of hands-on mathematical modeling experience in business environment\n- Proficiency in Python... packages such as pandas, seaborn, scikit-learn, dplyr or nltk - Advanced knowledge of statistical and data mining techniques (k-means clustering, regression, decision trees, clustering, neural networks, etc.)\n- Proven experience in working with large datasets and relational databases (Hive, SQL)\n- PhD in quantitative field like Computer Science, Engineering, Statistics, Mathematics or related field required. - Distinctive communications skills and ability to communicate analytical and technical content in an easy to understand way to both technical and non-technical audiences.\n- Intellectual curiosity, along with excellent problem-solving and quantitative skills, including the ability to disaggregate issues, identify root causes and recommend solutions", "extensions": ["7 days ago", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEYXRhIFNjaWVudGlzdCAtIFNpbmdhcG9yZSIsImNvbXBhbnlfbmFtZSI6IlRpa1RvayIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoid25iY1h2YURXaWpJakp1WUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCYXl0LmNvbSIsImxpbmsiOiJodHRwczovL3d3dy5iYXl0LmNvbS9lbi9zaW5nYXBvcmUvam9icy9kYXRhLXNjaWVudGlzdC1zaW5nYXBvcmUtNTk0OTQ1MTkvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Data Scientist", "company_name": "Sciente International Pte Ltd", "location": "Singapore (+1 other)", "via": "via Monster", "description": "Our client is looking for an experienced data scientist to lead a team and develop analytical solutions for multiple Artificial Intelligence (AI) projects.\n\nMandatory Skill-set\n• PhD/Bachelors in Computer Science, Computer Engineering, Statistics, Applied Mathematics, Data Science and Analytics;\n• Has around 5 years of experience in Data Engineering or Data Science field;\n• Proven to be able to lead and solve complicated technical problems in Data Engineering or Data Science areas;\n• Good hands on experience solving business problems using Data Analysis, Machine Learning, Predictive Modelling;\n• Experienced in working with large data sets (statistical analysis, data visualization, data mining, data cleansing, data transformation and machine learning);\n• Must be familiar with big data streaming and visualization tools such as Apache Nifi, Storm, Spark, Airflow, Kibana, Tableau;\n• Good knowledge in Cloud Computing platforms & Machine Learning Cloud Services, for example, AWS SageMaker... Google ML Engine, and MS Azure Machine Learning Studio.\n• Able to apply scientific thinking to solving business problems through analytics and data;\n• Possess excellent written, verbal and presentation skills.\nDesired Skill-set\n• Experience in big data tools (Hive, Hadoop, Spark, Elastic Stack, Kafka) and databases (Cassandra, MongoDB, and Neo4J).\n\nResponsibilities\n• Collaborate with product owners and solution architects to translate and formulate business requirements into technical specifications of data platform;\n• Oversee a team of data engineers to roll out a robust, scalable, and efficient data refinery related solutions using suitable data engineering or big data engineering techniques;\n• Develop data ETL and data analysis for structured/unstructured and streaming data;\n• Work closely with Artificial Intelligence scientists to integrate data pipeline with Machine Learning pipeline;\n• Assist project managers / directors with budgeting and resource planning for data refinery and Artificial Intelligence projects.\nShould you be interested in this career opportunity, please send in your updated resume to [Confidential Information] at the earliest.\nWhen you apply, you voluntarily consent to the disclosure, collection and use of your personal data for employment/recruitment and related purposes in accordance with the SCIENTE Group Privacy Policy, a copy of which is published at SCIENTE’s website (https://www.sciente.com/privacy-policy).\nConfidentiality is assured, and only shortlisted candidates will be notified for interviews.\nEA Licence No. 07C5639", "extensions": ["Over 1 month ago", "Contractor"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Contractor"}, "job_id": "eyJqb2JfdGl0bGUiOiJEYXRhIFNjaWVudGlzdCIsImNvbXBhbnlfbmFtZSI6IlNjaWVudGUgSW50ZXJuYXRpb25hbCBQdGUgTHRkIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJ1MEI1SXdPT2RZbkh6cGhvQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1vbnN0ZXIiLCJsaW5rIjoiaHR0cHM6Ly93d3cubW9uc3Rlci5jb20uc2cvam9iL2RhdGEtc2NpZW50aXN0LXNjaWVudGUtaW50ZXJuYXRpb25hbC1wdGUtbHRkLXNpbmdhcG9yZS0yNTQxODgzP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "VP Data Science", "company_name": "Michael Page", "location": "Singapore", "via": "via Michael Page", "description": "About Our Client\n\nA Unicorn Internet Company who has over the past decade, built one of the biggest internet platform that helps ease of transaction for customers, along with empowering millions of Small Medium Enterprises. Role can be based in Singapore or Jakarta.\n\nJob Description\n\nAs VP of Data Science, you are someone who comes with a strong knowledge and deep experience in applying data science and ML on a breadth of problem spaces, including but not limited to: Natural Language Processing, Computer Vision, Ads O, Recommendation, Personalization algorithms, and Fraud detection.\nThis is a multidisciplinary role where the candidate oversees all aspects of the data science lifecycle.The successful candidate will bring in a high EQ with working knowledge in the AI/ML space.\n• Design and implement our data science best practice, with focus on stronger research capability and visibility.\n• Represent our data-science-related opportunities and needs to the company as a member of our... extended leadership team.\n• Be a champion of our Data Science team, focus in coaching and building a data culture of \"Think Like a Scientist\".\n• Find new opportunities to put our i -house technology to work in service of our customers without compromising end-user privacy or security.\n\nThe Successful Applicant\n• Strong industrial data science background with knowledge of applying data science from end to end in production environments.\n• 15+ years working on data science with a university degree in Engineering, Computer Science or equivalent program; preferably in DS/ML.\n• You are well-versed in data-driven and data-informed product development.\n• You are comfortable with the nuts and bolts of data science, software engineering, data engineering, and computer science.\n• Strong technical leadership, project delivery, and global team building skills.\n• Structured thinking, a data-driven approach and a collaborative spirit to partner with business partners.\n• Ability to partner with senior business stakeholders to understand i information needs and translate into solutions.\n\nWhat's on Offer\n\nDeliver world class DS frameworks and approaches to one of the biggest internet company in Southeast Asia", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJWUCBEYXRhIFNjaWVuY2UiLCJjb21wYW55X25hbWUiOiJNaWNoYWVsIFBhZ2UiLCJjb21wYW55X21pZCI6Ii9tLzA0Y3hsZHciLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJnWW9EVzEyQVFuNXJmVm9PQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VTFwQ2NFOXVkMFpQU1hKUFRqZFdSa0pCV0d0VU9GOUpTaTA1UzNaQk5qRktOM1oxYldrMlZHUlRTbEl3TjBwU09FZHJiM05OZWtKaldXbEpjelpWWlRKVGIwWXhaRFV5UjBka1drTXRjbFpHUjFSWmVVZDJPRkk1TjFoT2VWQXpTWE16TUc4eGIySnVha1puWW5WdGRUaERjM0pXUWxsRVNrOHRhbE55VXpWMVVVMTRTMGRNUWpsUGFtVllNMDVwTFhVdE1qWnJjakpqUWtsUkVoWTVNMmxEV1V4SFUwMTBjbGgwUVdGMU1tSjZRVVIzR2lKQlQwMVpVbmRDWm1wT1FuVmpVMkp2WjBoaWEwOUJjRlZvTkVkMGJubDBWVXhSIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNTQiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTWljaGFlbCBQYWdlIiwibGluayI6Imh0dHBzOi8vd3d3Lm1pY2hhZWxwYWdlLm5sL2VuL2pvYi1kZXRhaWwvdnAtZGF0YS1zY2llbmNlL3JlZi80MTc5NTMwP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Internal Consultant - Digital Practice (Data Scientist)", "company_name": "UBS", "location": "Singapore", "via": "via Management Consultants Career Center", "description": "Your team\nYou will be working in the brand new Digital Practice unit based in Singapore. We are a dynamic and diverse team of transformation professionals with focus on emerging technology transformation. This unit is part of the broader newly created Group Internal Consulting department.\n\nOur practice teams help UBS business functions implement their digital strategy and accomplish their ambitions in the areas of emerging technologies like Artificial Intelligence (AI), Advanced Analytics , Cognitive Automation and Blockchain. The Digital Practice is at the intersection of business, technology and innovative thinking. We accompany functions across all businesses to build a sustainable transformation; combining the power of emerging technologies with a profound understanding of UBS businesses. The team works in in close collaboration with the different functions, business divisions and external parties to achieve its goals.\n\nYour expertise\n• At least 3 years of consulting experience... with a prominent or boutique consulting firm, maintaining a focus on project management in the area of digital transformation and new technologies.\n• Experience in programming skills such as Python, R, Spark and familiar with software development methodology\n• Experience in developing digital solutions by applying advanced analytics, machine learning or deep learning technologies, in areas such as customer analytics, product recommendation, text recognition, natural language processing etc.\n• Familiar with machine learning model development workflow and good understanding of data exploration, data processing, and feature engineering techniques.\n• Experience in deploying machine learning models and solutions into a cloud platform, such as Azure, AWS etc.\n• Experience in any of the following tools is a plus: Alteryx, DataIku, DataRobot, Tableau, MicroStrategy etc\n• Experience in any of these tools is a plus: Alteryx, DataIKU, Tableau, DataRobot, Workfusion, re:infer, Teneo, Amelia, Python.\n• Strong analytical background, attention to detail along with structured organization and planning skills.\n• Highly driven and motivated with a can-do attitude and eager to learn and to solve complex problems.\n• A strong written and verbal communicator, able to adapt and network across a global organization to work well with the team and to present well to stakeholders.\n• Knowledge and hands on working experience in one or more of the following areas: Artificial Intelligence, Advanced Analytics, Cognitive Automation, Blockchain.\n• Fluent in English both written and spoken, other languages a plus.\n\nAbout us\nExpert advice. Wealth management. Investment banking. Asset management. Retail banking in Switzerland. And all the support functions. That's what we do. And we do it for private and institutional clients as well as corporations around the world.\n\nWe are about 60,000 employees in all major financial centers, in more than 50 countries. Do you want to be one of us?\n\nJoin us\nWe're a truly global, collaborative and friendly group of people. Having a diverse, inclusive and respectful workplace is important to us. And we support your career development, internal mobility and work-life balance. If this sounds interesting, apply now.\n\nDisclaimer / Policy Statements\nUBS is an Equal Opportunity Employer. We respect and seek to empower each individual and support the diverse cultures, perspectives, skills and experiences within our workforce", "extensions": ["9 days ago", "Full–time"], "detected_extensions": {"posted_at": "9 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJJbnRlcm5hbCBDb25zdWx0YW50IC0gRGlnaXRhbCBQcmFjdGljZSAoRGF0YSBTY2llbnRpc3QpIiwiY29tcGFueV9uYW1lIjoiVUJTIiwiY29tcGFueV9taWQiOiIvbS8wMzFyeHAiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJHZEl0RWNTdVlIcW5pR2VhQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFc3NCQ293QlFVNVZYMDV4VWxwMWJsUmpMVXAxVW1aV1dEQlJWV1IzWDFCNWJ6ZERjbkE0WkhkVlFUZ3piR0pJYVZWRVh6WTVaaTFrU0V4NE9WVlRabTUxUTNvNVoxbHhaMngzVFhZeFoyeGxiV015Y1RGUWNrbFFhMTkxVG1KMWNtYzFOVUZNZUZKd1dGcGFhMEpMUWxndE1qQkZjbkJmT0hwSVlqYzNkVE10ZFZwVFNESTVaV1U0TVdWMFFWUTBUVmNTRmpremFVTlpURWRUVFhSeVdIUkJZWFV5WW5wQlJIY2FJa0ZQVFZsU2QwUTNibEJSVFdJeGRrdG1RMGhPWDA5WGFIVnZXVWcxY0dkNFltYyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzYyIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1hbmFnZW1lbnQgQ29uc3VsdGFudHMgQ2FyZWVyIENlbnRlciIsImxpbmsiOiJodHRwczovL2NhcmVlcnMuYnVzaW5lc3NjZXJ0aWZpY2F0aW9uLm9yZy9qb2JzLzE0NjgwODk1L2ludGVybmFsLWNvbnN1bHRhbnQtZGlnaXRhbC1wcmFjdGljZS1kYXRhLXNjaWVudGlzdD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}], "chips": [{"type": "Title", "param": "job_family_1", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Data scientist", "value": "data scientist"}, {"text": "Learning engineer", "value": "learning engineer"}, {"text": "Research associate", "value": "research associate"}, {"text": "Data science", "value": "data science"}, {"text": "Data engineer", "value": "data engineer"}, {"text": "Scientist", "value": "scientist"}, {"text": "Trainer", "value": "trainer"}, {"text": "Associate", "value": "associate"}, {"text": "Data analyst", "value": "data analyst"}, {"text": "Engineer", "value": "engineer"}, {"text": "Officer", "value": "officer"}, {"text": "Project manager", "value": "project manager"}, {"text": "Project officer", "value": "project officer"}, {"text": "Senior", "value": "senior"}, {"text": "Audit", "value": "audit"}, {"text": "Consultant", "value": "consultant"}, {"text": "Consulting", "value": "consulting"}, {"text": "Customer", "value": "customer"}, {"text": "Deputy director", "value": "deputy director"}, {"text": "Lecturer", "value": "lecturer"}, {"text": "Operations engineer", "value": "operations engineer"}, {"text": "Owner", "value": "owner"}, {"text": "Research engineer", "value": "research engineer"}, {"text": "Research scientist", "value": "research scientist"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Specialist", "value": "specialist"}, {"text": "Technical architect", "value": "technical architect"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Internship", "value": "INTERN"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Mining", "value": "/business/naics2007/21"}, {"text": "Research", "value": "/business/naics2007/5417"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Staffing", "value": "/business/naics2007/5613"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "Nanyang Technological University", "value": "/m/0l49k"}, {"text": "Shopee", "value": "/g/11gh3fk34r"}, {"text": "DBS Bank Ltd", "value": "/m/01q7n5"}, {"text": "Michael Page", "value": "/m/04cxldw"}, {"text": "Micron", "value": "/m/02gdqy"}, {"text": "Air Liquide", "value": "/m/079tgb"}, {"text": "Apple", "value": "/m/0k8z"}, {"text": "ByteDance", "value": "/g/11ghnfr0sv"}, {"text": "CTES Consulting Pte Ltd", "value": "/g/11jrn4m1xc"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "SEPPIC", "value": "/m/0g558ww"}, {"text": "Standard Chartered", "value": "/m/02hszk"}, {"text": "United Overseas Bank", "value": "/m/04gjd1"}, {"text": "AIR LIQUIDE INDUSTRIAL SERVICES PTE LTD", "value": "/g/11hg55y1rb"}, {"text": "Acronis", "value": "/m/04pjlt"}, {"text": "BIGTAPP PTE. LTD.", "value": "/g/11dxpsg5nn"}, {"text": "Burpple", "value": "/g/11dxps5yv5"}, {"text": "Covance by Labcorp", "value": "/m/03ll59"}, {"text": "DHL", "value": "/m/021086"}, {"text": "DUN & BRADSTREET (SINGAPORE) PTE. LTD.", "value": "/g/11g9mpp2ph"}, {"text": "Dathena Science", "value": "/g/11dxprdn6y"}, {"text": "EasyMile", "value": "/g/11bwh58jhs"}, {"text": "Engine Biosciences Pte. Ltd.", "value": "/g/11gxm8pr96"}, {"text": "Experis Singapore", "value": "/g/11dxpnwm3s"}, {"text": "FieldBox.ai", "value": "/g/1ptyw89vr"}, {"text": "GIC Private Limited", "value": "/g/11mpj15pxw"}, {"text": "Government Technology Agency", "value": "/g/11gh0528nq"}, {"text": "Health Sciences Authority", "value": "/m/0h7fhh"}, {"text": "Hewlett Packard Enterprise (HPE)", "value": "/g/11b804x9ty"}, {"text": "Infineon Technologies", "value": "/m/02jzkj"}, {"text": "Infinite Computer Solutions Pte Ltd", "value": "/g/11g9mj72yz"}, {"text": "Institute Of Technical Education (ITE)", "value": "/m/05_02p"}, {"text": "KPMG Singapore", "value": "/g/11dxpsb9nr"}, {"text": "Lazada", "value": "/g/1q5bfkdqp"}, {"text": "Ministry of Defence Singapore", "value": "/m/0566dt"}, {"text": "Ngee Ann Polytechnic", "value": "/m/05451y"}, {"text": "Republic Polytechnic", "value": "/m/06jgzw"}]}]}