{"search_metadata": {"id": "60827a9049ecdb4ed3c6ffb0", "status": "Success", "json_endpoint": "https://serpapi.com/searches/1a73aef2340c088d/60827a9049ecdb4ed3c6ffb0.json", "created_at": "2021-04-23 07:43:12 UTC", "processed_at": "2021-04-23 07:43:12 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28programmer%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=120", "raw_html_file": "https://serpapi.com/searches/1a73aef2340c088d/60827a9049ecdb4ed3c6ffb0.html", "total_time_taken": 4.91}, "search_parameters": {"q": "(programmer) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "120"}, "jobs_results": [{"title": "Senior Software Engineer", "company_name": "Metropolitan Wireless International Pte Ltd", "location": "Singapore", "via": "via Jobs | Fidanto", "description": "Metropolitan Wireless International Pte Ltd. Posted on 12-Mar-21 Senior Software Engineer Metropolitan Wireless International Pte Ltd. Job DescriptionResponsibilities Designing, developing and testing assigned modules – this will include module design and test documentation Code development and peer reviews Module testing and reporting Carrying out related QA activities, attending quality audits Installation and testing of application at site Carrying out user training Troubleshooting & maintenance of application. Requirements Bachelor's degree in Computer Science from a reputed Institute/University. Minimum 6 years of development work experience in Core Java multi-threaded client-server applications is mandatory (or) Oracle Java Certification with minimum 3-years’ experience. Minimum 3 Year(s) of working experience as Full Stack Developer Experience with backend framework such as Java (Spring Boot), NodeJs Experience in designing and developing APIs Working experience in the... following frameworks – Multi-thread applications using core Java - mandatory Hibernate for Database – desired Familiarity with design patterns and OOP design concepts - mandatory Familiarity with Relational SQL Database - mandatory Other protocols – RPC, JSON, CORBA, SNMP, MODBUS, etc. – any or all desired Experience in mobile app development is a plus. Familiar with project models and object-oriented software development methods. Outstanding analytical skills, strong verbal, and written communication skills Good analytical capability to troubleshoot and fix software issues. Passionate about software programming. We look forward to working and growing together with the successful candidate.Only shortlisted candidate will be notified. Thank you for applying!Additional Information Senior Executive Qualification Bachelor's Degree, Post Graduate Diploma, Professional Degree Metropolitan Wireless International is established in January 2009 and specialize in designing and developing state of the art solutions using mobile wireless communication technologies.Our solutions are general designed for the purpose of Safety and Communication. We strive in the Public Safety & Transportation sector as well as Security and Aviation industry.We are a growing IT Software Company based in Singapore and we offer the following: Responsive and Friendly team State of the art technologies to work with Being a small company means that we are always there for each other and we take great care of employees and clients alike. We are basically a family.We have done work for SMRT Corporation, Delhi Metro, MTR Corporation, SAMART Telecoms, Singapore Police Force, and Indonesia Military.As we are a Certified TETRA Partner, most of our application and software design revolves around Radio Dispatcher for the Trains & 2-way Radio Walkie Talkies. But as technology is advancing, we are no strangers to Data Applications such as Push-to-Talk over Cellular.We are actively pursuing Indoor Positioning and Internet of Things (IoT) as well.Hence, we are looking for more people to join the company and diversify the business. Most importantly, we want to grow together.Additional Company Information Registration No. 200814930Z Company Size 1 - 50 Employees Benefits & Others Miscellaneous allowance, Medical, Regular hours, Mondays - Fridays, Business (e.g. Shirts", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgRW5naW5lZXIiLCJjb21wYW55X25hbWUiOiJNZXRyb3BvbGl0YW4gV2lyZWxlc3MgSW50ZXJuYXRpb25hbCBQdGUgTHRkIiwiY29tcGFueV9taWQiOiIvZy8xMWc5bV94YmM0IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiUGpzUzVMUGRaZUF0WFA0aUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXJZQ0N2Y0JRVTVWWDA1eFZFZDZVVE53TW5NMWRETjNUemRRVG5ST1dEZGhNR2hwTWxGVVExY3pRa1YzUVc1TlVpMXhXRU5HYTB4a1JYVTBTVVpoV0d0bGFrNXRUbEJDYW05aVdFeEhabFZVTWtablIwaHRZbk5mU25GeVUzTlRTVEZEYUhBNU9XMTFNRmxCU3pScmNtdG1SbXd0T0hjMlFtbGhNV1pNYjB0MWJVbERjVXhtUkZoemIwdFROa2hTVTBwSE9URlpkbXRWVEhOMFpHaEtjMWxPYTNaMlRWbHFORnBXUnpkaFpHeDBTMHRoYmtkeFFrNXBNalpVV1VkVE5YaG1UWEZSYUZaTWNHTXlUMWt4Vm5SUU0wdG9YMFZ3YzJabVptTmtZelZGWWt0WU1GZFBjWHBxY0drMlNFSlZTblJWVDBWeGNsUllYMDR5Y3hJV2JFaHhRMWxMZFRkUVRrdEhkRkZpZHpGeVNHZEJVUm9pUVU5TldWSjNSRk5uUmt4aVRrMW9iVXRRZFUxdGFFVXdXR28zYzNCblJtVjBkdyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzYiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9icyB8IEZpZGFudG8iLCJsaW5rIjoiaHR0cHM6Ly9zZy5maWRhbnRvLmNvbS9qb2JzL2pvYi1vcGVuaW5nL3NvZnR3YXJlLWRldmVsb3BlcnMtc3lzdGVtcy1zb2Z0d2FyZS9zZW5pb3Itc29mdHdhcmUtZW5naW5lZXItMjc1MjE4MjUxP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Software Engineer - Cloud Observability Platform, VP", "company_name": "J.P.Morgan", "location": "Singapore", "via": "via Laimoon.com", "description": "﻿As an experienced member of our Software Engineering Group, we look first and foremost for people who are passionate around solving business problems through innovation and engineering practices. You'll be required to apply your depth of knowledge and expertise to all aspects of the software development lifecycle, as well as partner continuously with your many stakeholders on a daily basis to stay focused on common goals. We embrace a culture of experimentation and constantly strive for improvement and learning. You'll work in a collaborative, trusting, thought-provoking environment-one that encourages diversity of thought and creative solutions that are in the best interests of our customers globally.\n\nOur Cloud Platform Services Group is teeming with passionate innovators like you who are rapidly designing, building and deploying groundbreaking private and public cloud platforms. By putting your technological know-how to work on creating best-in-class cloud-native capabilities... your efforts will help us work faster and smarter, not to mention reinforce our position as a global leader in fintech cloud services.\n\nThis role requires a wide variety of strengths and capabilities, including:\n• BS/BA degree or equivalent experience\n• Minimum 8 years of experience designing & delivering software solutions that address complex cross-domain problems\n• Proficiency in multiple modern programming languages\n• Proficiency in application, data, and system design disciplines\n• Experience with agile software delivery processes including practices like automated testing and CI/CD\n• Ability to work in cross-functional, collaborative teams to achieve organizational goals\n• Passionate about building an innovative culture\n• Knowledge of industry-wide technology trends and best practices\n• Experience developing cloud native applications on platforms like CloudFoundry, Kubernetes, AWS, GCP, Azure, Heroku, etc. is a strong plus\n• Experience implementing effective operational patterns like SLOs, metrics, health checks, error budgets, distributed tracing, etc., using tools like Prometheus, Grafana, Jaeger, ELK, Cloudwatch, Stackdriver, etc. is a strong plus\nTechnology", "extensions": ["5 days ago", "Full–time"], "detected_extensions": {"posted_at": "5 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciAtIENsb3VkIE9ic2VydmFiaWxpdHkgUGxhdGZvcm0sIFZQIiwiY29tcGFueV9uYW1lIjoiSi5QLk1vcmdhbiIsImNvbXBhbnlfbWlkIjoiL20vMDFobHd2IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoibGxfelNIM1ZyXy1LUjVEREFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFV6RkdkemxIYzBOTWNFcERRa3h0T1hrdFZWSmlZWFZNV0VoWWFFeGZOMDlpVkVkT2NGZDVSeTFNUlhkSGRHaHVWVWx3VkRGUU1HRlZUbGRDYmxkM01XWmFWM2xaY0ZJNVJUWnNaVWxLVUMxaVpUQlhUWHBRZURoUk1HOVBkekZwZDJoVlgzUXROVUpETUc1SlgyRlpSbUZNWkZONlNFbHNWRk5KT0Y5T1FrNWpSbXA0UjI5VWFtdEJhVGRPWm5KZlRuWkxZMmhRVG14NlFVRkJFaFpzU0hGRFdVdDFOMUJPUzBkMFVXSjNNWEpJWjBGUkdpSkJUMDFaVW5kQ2RGVTVTVlZMTmtkd1NrTmhiMDkxYTNSUlYyNHpZbVZyUTFsMyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzEzIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExhaW1vb24uY29tIiwibGluayI6Imh0dHBzOi8vam9icy5sYWltb29uLmNvbS9qb2JzL2V4dGVybmFsdmlldy8yNjAxMzY1NT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Software Engineer (Enterprise SaaS)-2021 Start", "company_name": "TikTok", "location": "Singapore", "via": "via Bayt.com", "description": "About the Enterprise SaaS Team\nWe believe your work is shaped by the tools you use. We provide a suite that integrates messaging, video conferencing, schedule management, collaborative documents, cloud storage, email, and workflow applications to provide a seamless collaboration experience on all your devices. \u2028\u2028We are part of Enterprise Services team that create the next-gen suite of collaboration and productivity tools which is used by many companies internationally. We are a highly technical and skilled team that empowers one another to learn and strive. Want to build new features and improve existing features on our product? Want to solve the most challenging and complex technical problems? You can help to build the next-gen enterprise collaboration platform that will shape and transform the future of workplace collaboration. We are looking for talented individuals to join us in 2021 - people who want to inspire creativity and co-create the future with us. Responsibilities\n... Participate in the development of third-party application ecosystem and the Helpdesk feature\n- Participate in the R&D of multiple complex modules and systems, and manage the entire life cycle of related R&D work, including product discussion, feature analysis, documentation, design coding, testing and maintenance, and result tracking\n\n1. Final year or recent graduate with a background in Software Development, Computer Science, Computer Engineering, Information Systems or a related technical discipline;\n2. Experience in Software Development and coding in a general purpose programming language is a plus;\n3. Agile, quick self learner, highly self-motivated and quick problem-solving capabilities;\n4. Possess good coding skills, data structure and basic algorithm skills. Application\n1. Applications will be reviewed on a rolling basis and we encourage you to apply early;\n2. Interview starts from February 2021", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciAoRW50ZXJwcmlzZSBTYWFTKS0yMDIxIFN0YXJ0IiwiY29tcGFueV9uYW1lIjoiVGlrVG9rIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJ0MUl2Z3RRdUVGaGxLSWYtQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJheXQuY29tIiwibGluayI6Imh0dHBzOi8vd3d3LmJheXQuY29tL2VuL3NpbmdhcG9yZS9qb2JzL3NvZnR3YXJlLWVuZ2luZWVyLWVudGVycHJpc2Utc2Fhcy0yMDIxLXN0YXJ0LTU4NDM1MTg2Lz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior Software Engineer", "company_name": "ILLUMINA SINGAPORE PTE. LTD.", "location": "Singapore", "via": "via Learn4Good", "description": "Position: Senior Software Engineer - 19386-JOB\nRoles &\n\nResponsibilities\n\nResponsibilities:\n\nWork as part of Agile scrum team (geographically distributed) to design, implement, and test our bioinformatics software that enables researchers, scientists, geneticists and clinicians manage the complex workflows required to successfully sequence the genome Transform operational/customer needs into technical description and design specification for a software system Lead the requirement gathering process and perform requirement analysis and risk analysis Assume the role of a product owner in an agile scrum team Develop, manage and prioritize the team’s product backlog Act as the primary liaison to product manager, customer support and other development teams to coordinate inter-dependencies to fulfill overall product delivery Work with overall system owner and project office to align team’s delivery with overall project plan Verify team’s delivery against requirements to ensure the right... functionality Assist in troubleshooting system problems during development and sustaining of product Develop and review project artefacts defined in the software life cycle in conformance to regulatory requirements Required\n\nEducational Background:\n\nAt least a Bachelor’s degree in Computer Science, Computer Engineering, Bioengineering or engineering related area Desired Profile:\n\nAt least 4 years of working experience in Life Science industry with knowledge in DNA Sequencing or at least 4 years of experience as a Business/System Analyst. (Medical Device is preferred) Certified Scrum Master or Product Owner or working experience in regulated product development environment (SDLC and ISO 13485) Strong analytical skills, problem solving and troubleshooting Strong verbal and written communication skills A track record that includes being part of a team which completed and shipped successful products Must thrive in fast-paced, dynamic environment Experience in participating in cross-organizational or inter-company collaboration Experience in developing full stack web applications in Java is a plus Experience in working with offshore teams is a plus Experience in working with customer support is a plus\n\nExperience with Lab Information Management Systems is a plus\n\nTell employers what skills you have\n\nAgile Methodologies\n\nBioinformatics\n\nC++JavaJavaScript\n\nLinux\n\nSoftware Development\n\nSoftware Engineering\n\nXMLSCRUM-based development environmentdesigned\n\nOracle Workflowcustomer needsdesign specification\n\nSystem softwaretechnical description", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgRW5naW5lZXIiLCJjb21wYW55X25hbWUiOiJJTExVTUlOQSBTSU5HQVBPUkUgUFRFLiBMVEQuIiwiY29tcGFueV9taWQiOiIvbS8wOW14a3hzIiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiMktBZWVqS1QzZ0FrV0lFRUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRW9zQ0Nzd0JRVTVWWDA1eFVqTmFUSE0yUldwNGVtTkZTMVpzV1UxQ2RWOXZUVGczYTBWWGEwbGhUMjVqU0RWbk1tbFNaVVJaZFVNd2RuQmtaVFZrUlVOc2RIVnhlV015Y0V0eU1GSjRVR2d0U3pCZmNrSXhaV0ZWTURSWVoyVk9hUzA1VDBsbWNHdHphMHRNTVdkclkwcDFOVUU1TW01cloyVm9Xa3hRWkdaSmNEZE9hbXhFVm5wWk9HNDVRa2t4VkdGMlRrdEtNbEpIWWxKWWJIbzVlblJOVHpGeVFuQkxjakpxWlVWMGVqUjRTbXBzVG1OUVZFaGljRUowYVZCQmExOTJTR0UyVWxnM1pESm1YME5yTWs5S0VoWnNTSEZEV1V0MU4xQk9TMGQwVVdKM01YSklaMEZSR2lKQlQwMVpVbmRFZEdsdlNIUTFSRzVUVlZNemFFVndYME42WVVKTmJqbDZkSEJuIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMjQiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGVhcm40R29vZCIsImxpbmsiOiJodHRwczovL3d3dy5sZWFybjRnb29kLmNvbS9qb2JzL3NpbmdhcG9yZS9pbmZvX3RlY2hub2xvZ3kvMjcxMjg4OTk1L2UvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "CNC Programmer - Mastercam - CAD-CAM", "company_name": "Goodman Employment Agency", "location": "Singapore", "via": "via Monster", "description": "CNC Programmer (Mastercam, CAD/CAM)\n\nJob Description\n\n· Develop efficient CNC Program for Milling and Turning using Mastercam, CAD/CAM, SolidCAM.\n\n· Monitor and improve production cycle time and cost.\n\n· Design simple Tools and Fixtures to support production process.\n\n· Provide technical support to production department..\n\nRequirements\n\n· Diploma or Technical Vocation Certification or related field.\n\n· Minimum 3 years of relevant working experience in precision engineering manufacturing environment.\n\n· Candidate having lower academic qualification with more than 10 years of relevant experience will be considered.\n\n· Familiar with CAD software like Solidworks & UG is an advantage.\n\n· Ability to muti-task.\n\n· Strong team player and able to work independently.\n\nWe provide:\n\n· Clean and air-conditioned workplace\n\n· Attractive remuneration and other Incentives\n\n- 5 days work week\n\nRemark:\n\nWork location: Tuas Area (Transport Pickup at Boon Lay MRT)", "extensions": ["22 days ago", "Full–time"], "detected_extensions": {"posted_at": "22 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDTkMgUHJvZ3JhbW1lciAtIE1hc3RlcmNhbSAtIENBRC1DQU0iLCJjb21wYW55X25hbWUiOiJHb29kbWFuIEVtcGxveW1lbnQgQWdlbmN5IiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiI2OXRXb0NlZTNYVjJvZmdNQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1vbnN0ZXIiLCJsaW5rIjoiaHR0cHM6Ly93d3cubW9uc3Rlci5jb20uc2cvYW1wL2pvYi12YWNhbmN5LWNuYy1wcm9ncmFtbWVyLW1hc3RlcmNhbS1jYWQtY2FtLWdvb2RtYW4tZW1wbG95bWVudC1hZ2VuY3ktc2luZ2Fwb3JlLTI3MTQwNDU3Lmh0bWw/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Software Developer 4", "company_name": "ORACLE", "location": "Singapore", "via": "via Jobs | Fidanto", "description": "Responsibilities Manage large global virtual infrastructure (Oracle VM and VMware), including hypervisor installation, patching, and troubleshooting. Perform hardware/software installation (including new datacenter buildouts and capacity expansions), system configuration, and upgrades of high availability Oracle VM, Linux and Windows systems. Create and update technical documentation (server configuration, backup and recovery procedures, etc.). Provide Systems escalation support to the Operations Center. Perform Disaster Recovery and High Availability testing of Oracle VM and VMware environments and maintain related documentation. Manage multiple on-going concurrent projects. Follow Change Management and generic datacenter related policies and procedures. Automate repetitive tasks on both Windows (using PowerShell, batch, and/or VBscript) and Linux servers (using Bash, Perl, and/or Python). Analyze performance statistics (cpu, memory, disk I/O, network throughput/latency, etc.) and... implement solutions to resolve issues should they occur. Provide mentoring and direction for junior engineers/admins. Qualifications Degree in Computer Science, Information Systems or equivalent combination of relevant experience. 5 or more years of experience managing large virtual environments (Oracle VM or Vmware) 8-10 years of work experience as a System Engineer in Linux and Windows environments Strong experience with Virtual Infrastructure management - Oracle VM (preferred) or VMware Ability to apply critical thinking/problem solving skills in order to resolve complex technical issues in a timely fashion Excellent verbal and written communication skills (English) Customer focused and team oriented Ability to effectively prioritize and execute tasks in a high-pressure environment Preferred additional skills Certification(s) in Linux administration such as LPIC, RHCSA or LFCS Good hands-on experience on Oracle/SUN, HP, Dell, IBM Hardware Familiarity with Payment Card Industry Data Security Standard (PCI DSS) audits and remediation Willingness to learn new technologies Experience with Configuration management tools like Chef or Puppet Experience with version control environment, like SVN or Git Detailed Description and Job Requirements Design, develop, troubleshoot and debug software programs for databases, applications, tools, networks etc. As a member of the software engineering division, you will take an active role in the definition and evolution of standard practices and procedures. You will be responsible for defining and developing software for tasks associated with the developing, designing and debugging of software applications or operating systems. Work is non-routine and very complex, involving the application of advanced technical/business skills in area of specialization. Leading contributor individually and as a team member, providing direction and mentoring to others. BS or MS degree or equivalent experience relevant to functional area. 7 years of software engineering or related experience", "extensions": ["2 days ago", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBEZXZlbG9wZXIgNCIsImNvbXBhbnlfbmFtZSI6Ik9SQUNMRSIsImNvbXBhbnlfbWlkIjoiL20vMDVuanciLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJnT1U1LU1PdWJ1Znk5VXBKQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFc3NCQ293QlFVNVZYMDV4VW1wRGVGaEJXWFUyU25WUVVFd3laR010Vm1wd1pVZEtTM2t6UjB4UGNrSlhPRkJ3YWpSd1dWUm9Ua05zV1VZNFF6TTBjemxGTFVSc1JEbHhMUzB5WXpJNVh6Y3ljR3hXTURGcllUZEhUMHRDTjBoWk9VTlZZVTVMV2tOT1ExUnNkRjlSVUZaR1MwNW1WMUIwTTJwNVlrbHJZekpEUlRsbVF6Rk9TVFZOUkVKYWExVnZSVVlTRm14SWNVTlpTM1UzVUU1TFIzUlJZbmN4Y2toblFWRWFJa0ZQVFZsU2QwSm5XVFJDYUMxQlFuaFVhVzlhUTFSRGNscDBiMmQzYzBaMGJHYyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzM1IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnMgfCBGaWRhbnRvIiwibGluayI6Imh0dHBzOi8vc2cuZmlkYW50by5jb20vam9icy9qb2Itb3BlbmluZy9zb2Z0d2FyZS1kZXZlbG9wZXJzLWFwcGxpY2F0aW9ucy9zb2Z0d2FyZS1kZXZlbG9wZXItNC0yNzc0NTQxMzk/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Software Engineer IV ( Full Stack Java)", "company_name": "VISA", "location": "Singapore", "via": "via Bayt.com", "description": "Job Description and Responsibilities\n\nQualifications", "extensions": ["7 days ago", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciBJViAoIEZ1bGwgU3RhY2sgSmF2YSkiLCJjb21wYW55X25hbWUiOiJWSVNBIiwiY29tcGFueV9taWQiOiIvbS8wMWtxam4iLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJhaXJYdWNJVkdHYjNONFNPQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFc3NCQ293QlFVNVZYMDV4VTB4M2FHMUhVekl4V21OYVlraEtTR1ZMUm14Q1lUTk1ZMGt5UVV0T1pWWmpRblJLTWpoTExVOVhRbkJHWDNodmVsUjFRVmh6YjBJNVdHbzVSbWxhV21SU1pGcGpVVTV4ZHpnNExUQnhObXBhV0VScFdUTm1WV3BQVFUxQlZHSlFkREoxU0VOTU1VRTVkVEl6WVV4aFJWTm9kV1JFYVc0d1ZXdE5WbEZOTmtvelMxZHZkVk1TRm14SWNVTlpTM1UzVUU1TFIzUlJZbmN4Y2toblFWRWFJa0ZQVFZsU2QwRlRaa3hKUVZCbE0zVlBWM1ZvWDJKTmRHRk1SMGt3UjJkeGVrRSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzQzIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJheXQuY29tIiwibGluayI6Imh0dHBzOi8vd3d3LmJheXQuY29tL2VuL3NpbmdhcG9yZS9qb2JzL3NvZnR3YXJlLWVuZ2luZWVyLWl2LWZ1bGwtc3RhY2stamF2YS01OTQ5MjY1OS8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Crypto Software developer (Remote)", "company_name": "Selby Jennings", "location": "Singapore", "via": "via Laimoon.com", "description": "Crypto Software Developer\n\nOur client, a leading US proprietary trading firm is looking for remote developers in the Asian timezone. Developers have the opportunity to work on problems at all levels of the software stack, from low-level code for driving network hardware to high-performance trading infrastructure, or time-saving internal tools.\n\nThe role works very closely with traders and quants. You'll quickly see the impact of your code and how it improves people's daily work. This also means that the development team enjoys great flexibility when planning roadmaps and deciding which features to implement.\n\nDesired Skills and Requirements\n• BS in Computer Science or engineering, or other related degree\n• Expert level experience programming in C#, C/C++ Python/Java also desirable\n• Previous finance experience, or other significant hands on development.\n• Crypto experience is essential\n• Passionate in finance / machine learning / big data and / or robotics is a bonus\nasset management", "extensions": ["5 days ago", "Full–time"], "detected_extensions": {"posted_at": "5 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDcnlwdG8gU29mdHdhcmUgZGV2ZWxvcGVyIChSZW1vdGUpIiwiY29tcGFueV9uYW1lIjoiU2VsYnkgSmVubmluZ3MiLCJjb21wYW55X21pZCI6Ii9nLzExYzczc3k3ZDgiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJYa3RLUUx6QlFkcVd1NVJBQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdllCQ3JjQlFVNVZYMDV4VWtNNFkxbE5NbGhYWjJselgyRktaVWxDYW5OWU5qbE1PVXAxTm5wemVETlVPSE0xVUVsa1lXSTRaQzFvU0VFM1pIVnBUVU5VVG0xbk5WVTJYekpCTTBocmF6VjRkWHB1YlhOUlNXaEhaRGx0ZFRaRFVqTjNSVk5aTlc5RVJsbFVVMkV4TjFoTlNqRjZZVFYxWVZodmIyWnFkMk5wWmpGUFVEZHVObkpvUW5oSFNIY3dVSFZLU1RaRldHdEtaSEJLYkdjNFZFMXFSVWR5ZW01SFFtSlRSV3Q1WlhRelltYzROV05CZDJoRU1FUTBFaFpzU0hGRFdVdDFOMUJPUzBkMFVXSjNNWEpJWjBGUkdpSkJUMDFaVW5kRVQzZFBhWFJoVEMxV1NucEpTMVprYVd0M2NVSlJVM1p1Vlc5UiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzUwIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExhaW1vb24uY29tIiwibGluayI6Imh0dHBzOi8vam9icy5sYWltb29uLmNvbS9qb2JzL2V4dGVybmFsdmlldy8yNDI2MDc5MD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Software/Cloud Developer (BB-8F100)", "company_name": "STAFFHUB GROUP PTE LTD", "location": "Singapore (+1 other)", "via": "via BeBee", "description": "ALL JOBS LISTED ARE BASED IN SINGAPORE ONLY.FOR SINGAPOREAN ONLY. Job Description As a Senior Developer, you are responsible for development, support, maintenance and implementation of a complex project module. You should have good experience in application of standard software development principles. You should be able to work as an independent team member, capable of applying judgment to plan and execute your tasks. You should have in-depth knowledge of at least one development technology/ programming language. You should be able to respond to technical queries / requests from team members and customers. You should be able to coach, guide and mentor junior members in the team.Requirements Experience with programming with an object-oriented language, including Java, C++, C#, or PythonExpert knowledge of cloud infrastructure services (OpenStack, Docker, Cloud Foundry, AWS ELB)Expert knowledge of modern protocols and APIs (Protobufs/Thrift/REST/JSON/Cap'n Proto)Experience in... MySQLExperience in Complete design and development on Web applicationExperience in web hostingBS in computer science or a related fieldPreferred:Certification in Amazon Web Services", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZS9DbG91ZCBEZXZlbG9wZXIgKEJCLThGMTAwKSIsImNvbXBhbnlfbmFtZSI6IlNUQUZGSFVCIEdST1VQIFBURSBMVEQiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IlBQVjV0R1NHMDJ1eWpHcnZBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQmVCZWUiLCJsaW5rIjoiaHR0cHM6Ly9zZy5iZWJlZS5jb20vam9iLzIwMjEwNDE3LTM5ZTMyNzI2MTM2Mjg4Njg1OGMxYTFhZmU5YThmMTAwP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Software Engineer - Sys design​/Kubernets​/AKS​/MS Azure​/AWS - Jurong", "company_name": "OakTree Consulting", "location": "Singapore", "via": "via Learn4Good", "description": "Job Description\n\nResponsibilities Design, develop, test, deploy, maintain and improve backend/platform applications System-to-system Integration development using API, messaging and related technologies. Unit test development and peer review in a Scrum team Full stack developer will be an added advantage. Assist architect/team lead on application design, database schema design and integration design Assist development team on integration and security test design. And develop test drivers/simulators or stub required Assist PO/BA on user stories refinement.\n\nAssist QA/Tester on test automation and bug fixes. Assist DevOps on build and release automation. Prepare interface specifications and other design documentations.\n\nRequirements\n\nExperience with backend system design and development. Experience development using Kubernetes, AKS, Istio/Envoy, Spring, Java/JEE, RESTful API, messaging (AMQP, MQTT & related technologies), or postgresql/mysql/MSSQL/RDS/Azure\n\nDB.\n\nExperience with... development on Microsoft Azure, and/or AWS will be an advantage Minimum 3 years experience\n\nAble to express design using UML notation and derive tasks backlog in SCRUM. A fast learner, have a proactive attitude and an eye for quality works A team player - inclusive mindset to collaborate effectively in a diverse team Familiarity with developing efficient queries and designing schemas for relational databases A team player - inclusive mindset to collaborate effectively in a diverse team Plus points as added advantage for senior post or team lead:\n\nExperience with development on a public cloud, e.g. Microsoft Azure, AWS Experience in developing platform level features, such as configuration management, service discovery and routing, feature switch, A/B testing, etc.\n\nExperience with clustering, stateless/stateful, transactions and system integration designs principles\n\nExperience with ESB and API Management\n\nExperience with security hardening and understanding of security CIA and AAA\n\nExperience with LDAP/Active Directory and SSO integration Familiarity with Spring Framework\n\nExperience with Maven, Nexus or Artifactory\n\nExperience with Git or Subversion\n\nExperience with Docker\n\nExperience with CI/CD systems, such as Bamboo, Jenkins Scrum certified, and with experience in a Scrum project Office Location :\n\nJurong East, May require to station at Punggol site, if necessary Kindly submit resumes in MS Word format to with the following details:\n\n- Position applying for Current remuneration Expected remuneration Notice period Reason for Leaving Person-in-charge :\n\nQuek Hong Guek, Margaret Oaktree Consulting\n\nEA License No : 06C4642EA Reg No : R1981137 We regret that only shortlisted candidates will be notified", "extensions": ["1 day ago", "Contractor"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Contractor"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciAtIFN5cyBkZXNpZ27igIsvS3ViZXJuZXRz4oCLL0FLU+KAiy9NUyBBenVyZeKAiy9BV1MgLSBKdXJvbmciLCJjb21wYW55X25hbWUiOiJPYWtUcmVlIENvbnN1bHRpbmciLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6InBZbWdMZm5Wa3cxbWlmTWNBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGVhcm40R29vZCIsImxpbmsiOiJodHRwczovL3d3dy5sZWFybjRnb29kLmNvbS9qb2JzL3NpbmdhcG9yZS9zb2Z0d2FyZV9kZXZlbG9wbWVudC8yNzEzMTgzMzgvZS8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}], "chips": [{"type": "Title", "param": "job_family_1", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Software engineer", "value": "software engineer"}, {"text": "Programmer", "value": "programmer"}, {"text": "Programmer analyst", "value": "programmer analyst"}, {"text": "Senior", "value": "senior"}, {"text": "Cnc programmer", "value": "cnc programmer"}, {"text": "Engineer", "value": "engineer"}, {"text": "Analyst programmer", "value": "analyst programmer"}, {"text": "Science", "value": "science"}, {"text": "Software programmer", "value": "software programmer"}, {"text": "Assistant", "value": "assistant"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Electrical engineer", "value": "electrical engineer"}, {"text": "Executive", "value": "executive"}, {"text": "Java engineer", "value": "java engineer"}, {"text": "Java programmer", "value": "java programmer"}, {"text": "Lecturer", "value": "lecturer"}, {"text": "Manager", "value": "manager"}, {"text": "Operator", "value": "operator"}, {"text": "Project officer", "value": "project officer"}, {"text": "Senior programmer", "value": "senior programmer"}, {"text": "Senior system", "value": "senior system"}, {"text": "Senior technical", "value": "senior technical"}, {"text": "Sr. programmer", "value": "sr. programmer"}, {"text": "Systems programmer", "value": "systems programmer"}, {"text": "Technical", "value": "technical"}, {"text": "Trainee", "value": "trainee"}, {"text": "Trainer", "value": "trainer"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Mining", "value": "/business/naics2007/21"}, {"text": "Rental", "value": "/business/naics2007/532"}, {"text": "Wholesale", "value": "/business/naics2007/42"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "EPAM", "value": "/m/0dlnrc"}, {"text": "VISA", "value": "/m/01kqjn"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "Citi bank", "value": "/m/01dfb6"}, {"text": "TikTok", "value": "/g/11fy265933"}, {"text": "Ubisoft", "value": "/m/02qdyj"}, {"text": "Cognizant", "value": "/m/03bf9h"}, {"text": "HCL SINGAPORE PTE. LTD.", "value": "/g/11fy25ngsv"}, {"text": "Oracle", "value": "/m/05njw"}, {"text": "Credit Agricole Group", "value": "/m/028vbm"}, {"text": "Mindteck (India) Limited", "value": "/m/0cqj8w1"}, {"text": "Nanyang Technological University", "value": "/m/0l49k"}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Zühlke Group", "value": "/g/1hh_rg216"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Avensys Consulting Pte Ltd", "value": "/g/11g7022gjf"}, {"text": "Avnet", "value": "/m/0c8xmc"}, {"text": "GlobalTix Pte Ltd", "value": "/g/11dxpqdhrf"}, {"text": "Government Technology Agency", "value": "/g/11gh0528nq"}, {"text": "J.P.Morgan", "value": "/m/01hlwv"}, {"text": "Optimum Solutions (Singapore) Pte Ltd", "value": "/g/11g70hkrbx"}, {"text": "Razer Inc.", "value": "/m/075hc0"}, {"text": "Realtek Malaysia", "value": "/m/05wrm7"}, {"text": "Realtek Singapore Private Limited", "value": "/g/11g9n26trs"}, {"text": "Success Human Resource Centre Pte Ltd", "value": "/g/11g709_209"}, {"text": "TECHNOPALS PTE. LTD.", "value": "/g/11dxpvkynp"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "UST", "value": "/m/08kb8g"}, {"text": "UrbanFox", "value": "/g/11ghs7y0w6"}, {"text": "Adecco GS", "value": "/m/08gz46"}, {"text": "Alphanova Pte. Ltd.", "value": "/g/11f8h_czps"}, {"text": "BioMind", "value": "/g/11dymfr2l6"}, {"text": "Biqmind", "value": "/g/11g21fzhrb"}, {"text": "BitTitan", "value": "/g/11dxpksv89"}]}]}