{"search_metadata": {"id": "60827ee8654a8c3adaec1142", "status": "Success", "json_endpoint": "https://serpapi.com/searches/301450d83e7736e1/60827ee8654a8c3adaec1142.json", "created_at": "2021-04-23 08:01:44 UTC", "processed_at": "2021-04-23 08:01:44 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28project+manager%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=240", "raw_html_file": "https://serpapi.com/searches/301450d83e7736e1/60827ee8654a8c3adaec1142.html", "total_time_taken": 1.0}, "search_parameters": {"q": "(project manager) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "240"}, "jobs_results": [{"title": "Project Manager/Executive", "company_name": "None", "location": "Singapore", "via": "via Recruit.net", "description": "Job Responsibilities · Develop project timeline/schedule that effectively allocates the resources to the various activities · Conduct kick off meetings; organise/attend regular progress meetings · Ensure that the project deliverables are on time, within budget and at the required level of quality · Constant evaluation of project status and updating relevant stakeholders on any potential issues · Manage contractors during installation of services to ensure the installation works are completed well within stipulated timelines and comply to predetermined technical specifications Job Requirements · Degree in Computing Science/Engineering, Information Technology or equivalent with 5 - 10 years' project management experience · Knowledge in cabling infrastructure, Internet network, routers and switches · Excellent interpersonal, presentation and project management skill · Able to work independently with minimal supervision · PMP Certification would be advantageous · Job level will... commensurate with experience and qualifications Interested applicants, please email your resume to Email: CEI Reg No: R1104785 EA Licence No: 99C4599 Recruit Express Pte Ltd Job Responsibilities · Develop project timeline/schedule that effectively allocates the resources to the various activities · Conduct kick off meetings; organise/attend regular progress meetings · Skills: Compliance, internetworking, Project Delivery, Project Managment, Project Planning, Switches, Progress, Schedule, Installations, Technical Specifications Experience: 5.00-7.00 Years", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIvRXhlY3V0aXZlIiwiY29tcGFueV9uYW1lIjoiTm9uZSIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiOVNnLVBmdWZ5TU05eHJpYUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBSZWNydWl0Lm5ldCIsImxpbmsiOiJodHRwczovL3d3dy5yZWNydWl0Lm5ldC9qb2IvcHJvamVjdC1tYW5hZ2VyLWpvYnMvNTBDMTdFREZFQTI5ODU4Nz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Project Manager", "company_name": "Vikconnect Pte Ltd", "location": "Singapore (+1 other)", "via": "via Jobs | Fidanto", "description": "Contract duration: 2 yearsJob responsibilities: • Manage entire project life cycle, which includes scope, schedule, budget, issues, contractors and user expectations• Manage project funding approval, risks and acceptance tests • Contract management• Assist users in preparing Specific Operational Requirements (SOR) and translate these requirements to technical requirements and specifications• Propose technical solutions• Perform Request for Information (RFI) • Prepare procurement documentation and monthly project progress reports• Tender evaluation and prepare evaluation reports for Tender Award recommendation• Assist user in the preparation of guidelines and standard operating procedures (SOP) related to the systemsRequirements: • Degree in Computer Science or related disciplines• At least 5-7years within IT industry, with exposure to 1-2 full Software Development Lifecycle and systems support.• Possess technical knowledge of the various aspects of IT infrastructure and systems•... Singaporeans only Advantageous:• Certified IT Project Manager, Project Management Professional (PMP), Certified Information Technology Project Manager (CITPM) or equivalent practitioner Project Management experiences", "extensions": ["6 days ago"], "detected_extensions": {"posted_at": "6 days ago"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJWaWtjb25uZWN0IFB0ZSBMdGQiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjU2QmlBMjBWUDR4THRwSUpBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9icyB8IEZpZGFudG8iLCJsaW5rIjoiaHR0cHM6Ly9zZy5maWRhbnRvLmNvbS9qb2JzL2pvYi1vcGVuaW5nL2luZm9ybWF0aW9uLXRlY2hub2xvZ3ktcHJvamVjdC1tYW5hZ2Vycy9wcm9qZWN0LW1hbmFnZXItMjc1Mzg5NDc4P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "PROJECT MANAGER", "company_name": "Rockwell Automation", "location": "Singapore", "via": "via Glassdoor", "description": "Job Description\n\nPosition Summary\n\nIn accordance with sound and accepted project management principles, the project manager directs, coordinates and manages various product developments through all phases of engineering product design, testing and release for mass production and subsequent support. Provides specific personnel administration responsibilities including technical staff coordination and resource allocation, plus assistance in providing performance feedback, staff coaching and skill development planning. Project management responsibilities include scheduling/planning and implementing engineering project management across multiple functional areas, coordination outside development resources and factored product acquisitions, and providing continuation engineering for existing products. Develops systems and presents updates on progress while ensuring the meeting of commitments. Assists in the development of business and marketing strategies, optimizing the performance of new... and existing product lines to achieve established business financial objectives. Provides for in depth understanding of SBU's business practices (finance, portfolio plans, strategy, etc.).\n\nScope\n\nGeographical Coverage: Global\n\nNumber of Direct Reports: NA\n\nAnnual Business Revenue: NA\n\nOthers: Nil\n\nPrincipal Duties and Responsibilities\n\nFunctional Expertise\n• Provide project management of internal and external product developments with minimal direction, requiring planning, resourcing, scheduling, project cost forecasting/monitoring, , reporting and providing technical coordination guidance across multiple functional areas. Ability to manage multiple human resources and project finances.\n• Develops, maintain and track detailed project plans and project schedules, resulting in meeting committed Time to Market goals.\n• Defines project team's resource requirements, which support the project's goals with respect to time, budget and quality through negotiation with functional managers.\n• Provides in depth and advance knowledge in the project management discipline. Responsible for financial, applied technology, & schedule performance of assigned projects within cost limitations & established standards.\n• Develops project investigation and implementation schedules-facilitates work breakdown structures. Manages product cost estimates.\n• Identifies, manages and mitigates project risks, resulting in proactive contingency planning as required.\n• Provides clear and timely project progress assessment and updates, ensuring constant organization and stakeholder alignment, up to Senior Management levels.\n\nLeadership\n• Provide project related technical, interpersonal, motivational leadership and performance management of teams throughout all phases of the project including resource allocation, task planning, progress tracking and recognition.\n• Applies interpersonal skills required to lead, motivate and resolve conflict within a project team environment so that scheduled activities are performed in a cost effective and timely manner. Leadership skills are recognized with business unit .\n• Independently identifies, manages and mitigates project risks, resulting in proactive contingency planning as required. Demonstrates bias for action and issue resolution.\n• Takes accountability for meeting deadlines and budget requirements.\n\nInterpersonal\n• Ensure team member goals align with project objectives, facilitate team decisions within guidelines, and effectively communicate business issues/directions to team and management. Plan, schedule and organize product development projects, using the input and skills of team members.\n• Provides performance feedback assessment and coaching for team to Business/Functional managers. Holds teams accountable for deliverables.\n• Business/Functional Manager or Program Manager and occasionally senior management review progress.\n• Develops an effective working relationship within SBU and across RA on a global basis.\n\nBusiness\n• Prepare project level financial documents and project funding requirements. Maintains and reports on financial and schedule metrics throughout each phase .\n• Networks and partners with customers/vendors and coordinates efforts to resolve complex problems, responds and delivers timely and cost-effective quality solutions. Responsible for understanding and measuring customer requirements for the projects under development .\n• Knows and applies business metrics to assigned product developments and projects, tracking performance relative to business goals.\n• Ensures thorough familiarity with company policies and procedures. Appropriately applies policies and procedures in compliance with government laws. Policies and procedures include, but not limited to: Standards of Business Conduct, Intellectual Property, Control Environment, Information Protection, ISO 9000 & 14000, government regulations (e.g. health, safety, quality and environmental), and functional policies published on the Rockwell Automation Information Network.\n\nRequirements\nEducation and Experience\n• BS Degree in Engineering discipline or equivalent experience (MS and/or MBA desirable); Other P.M. professional certification preferred .\n• Typically 10+ combined year's experience in product development and project management. Proven ability to lead multiple teams, partner with management to resolve conflicts and obtain resources for projects. Effectively communicates and gives presentations (internally and externally). Proven ability to direct resources, plan project activity and balance financial budgets .\n• Has successfully led numerous product development project teams and has a clearly recognizable knowledge of detailed product development processes, either within RA or related industry .\n• Preferably has experiences in Functional Safety Product Development projects that involves IEC61508 certification and/or involve engagements with TUV Rheinland. Candidates with FS Engineer (TÜV Rheinland) certificate will have an added advantage.\n• Preferably attended training related to Secure product development lifecycle and managed one or more secure industrial automation and control systems product development projects that have attained certification related to IEC-62443-4-1/-2.\n\nThe above statements are intended to describe the general nature and level of work being performed by people assigned to the job. They are not intended to be an all-encompassing list of all responsibilities, duties and skills required of personnel so classified. Reasonable accommodation to essential functions of the job will be made if appropriate", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQUk9KRUNUIE1BTkFHRVIiLCJjb21wYW55X25hbWUiOiJSb2Nrd2VsbCBBdXRvbWF0aW9uIiwiY29tcGFueV9taWQiOiIvbS8wNDdia2QiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJ4MWNCT1RaQzZDel8weGUwQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdllCQ3JjQlFVNVZYMDV4VkVWSlMxWTFVWFJ5WVVaa01rcG9aWGhFYXpCWlNWVTFRa3BWWVhwVVVrTnNObGh3V25CV2FFRTBSSGhVTUhGUFJrSnZOa040VkhNeFJUWllSalI2WWtOWWRGcFBVMUIyVGpabFlXOXhSamRGZG5WNGQwbzFRMVJ1UXpKck9FcFdTM0F6YVdRelNXNU9YMjlxU1VSVU9HZ3RXbHBCUVZwSlduSTJXR1F4Y0dWQ1kzQjVXbmgxUkdKeVJqSlRNbEZmVjJkd1pVdHJZWEkzWm1nelJsY3dhSGR6VUd0eU0yUTBiakpvVmt4R2RFTlJFaFkyV0RaRFdWQjFORUU0WWxaMFFXRmFiMjlZVVVOM0dpSkJUMDFaVW5kQlpGaDJjVUUxVlhSZlduZzNVRWRTZEVoUExWQXpOV3M0WkVoMyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzE3IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEdsYXNzZG9vciIsImxpbmsiOiJodHRwczovL3d3dy5nbGFzc2Rvb3Iuc2cvam9iLWxpc3RpbmcvcHJvamVjdC1tYW5hZ2VyLXJvY2t3ZWxsLWF1dG9tYXRpb24tSlZfSUMzMjM1OTIxX0tPMCwxNV9LRTE2LDM1Lmh0bT9qbD00MDEzNjYwNzU0XHUwMDI2dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Principal Implementation Project Manager, Singapore", "company_name": "Ceridian", "location": "Singapore", "via": "via WhatJobs", "description": "About the Position:\n\nThe Principal Implementation Project Manager is responsible for the management of customer specific engagements to implement Ceridian HCM solutions. Leveraging Ceridian's implementation methodology the Project Manager drives the delivery of services according to the agreed upon scope, timeline and budget and ensures a high level of customer satisfaction. The Project Manager manages multiple concurrent projects, working closely with consultants in a matrix environment and interacting with Education, Product Management, Support and R&D to ensure delivery. The Project Manager builds a constructive working relationship with the customer and is accountable for deliverables, timeline, and budget, as well as coaching the project team to success. The Project Manager may also deliver Organizational Readiness consulting in support of Ceridian’s Organizational Readiness toolkit.\nResponsibilities:\nManage a Project Portfolio Manage multiple, concurrent projects ensuring... quality, on-time and on-budget implementation Plan, manage and communicate the progress of the project, achieving project milestones and maintaining momentum of the project Manage multiple, concurrent projects ensuring quality, on-time and on-budget implementations Plan, manage and communicate the progress of the project, achieving project milestones and maintaining momentum of the project Utilize a mix of global resources within a matrix environment to ensure maximum productivity Utilize Ceridian’s methodology to drive implementations to successful completion, ensuring a high level of customer satisfaction Set and manage customer expectations in regard to: project scope and timeline, Ceridian and customer responsibilities, stakeholder roles and responsibilities, project governance (communication, change control, escalation), risk management and organizational readiness Present and manage sign-off of key milestones and deliverables, such as project kick-off, Discovery workbook, Discovery Recap document, project plan, status report, steering committee report, change requests, Sandbox review, user acceptance testing, Support transition, project closure Effectively transition customers to Support Participate in project health checks and post go-live analysis on completed projects with PMO Ensure High Customer Satisfaction and Referencability Adhere to and promote highest quality standards in project delivery and contribute to PMO Motivate team to document solutions and leverage and contribute to a solutions repository Assist customer in driving the UAT process Focus on Continuing Education Contribute to enhancement of Ceridian implementation methodology and PMO; provide feedback on tools and templates and contribute to best practices Participate in Continuing Education sessions Complete new release training on a timely basis; be familiar with new and/or enhanced functionality in each product release Mentor consultants on best practice consulting re: facilitating workshops, soliciting and documenting requirements Provide Sales Support Prepare Change Requests as required to capture change in scope and/or timeline Qualifications: Bachelor’s degree or equivalent experience PMI/PMP certification preferred 2 - 5 years of experience in human capital management applications consulting and/or project management Experience developing and managing project schedules, preferably using Microsoft Project and Microsoft Visio Solid experience in business process mapping Experience in change management an asset Technical Skills Requirements Proficiency in Microsoft Office products and mastery of Microsoft Project and Visio Experience managing software implementations in a SaaS / Cloud computing environment an asset Understanding of relational databases and SQL and asset Experience implementing one or more of the following applications: SalesForce.com, SAP, PeopleSoft, JD Edwards, Kronos, Workbrain/Infor, RedPrairie/JDA, Ultimate, Oracle HR/Payroll, PeopleSoft, Ceridian HCM (preferred) Knowledge of common human capital management (HCM) business practices Working knowledge of common software implementation methodologies Functional Skills Requirements Excellent customer relationship and business acumen Ability to manage multiple projects & customers at the same time and manage competing priorities Excellent organization, communication and collaboration skills Ability to drive results through a multi-disciplinary team with matrixed reporting relationships Ability to lead and facilitate customer and internal workshops and sessions Working Environment & Physical Demands:\nAbility and willingness to travel to customer sites as needed COMPETENCIES\nProblem Solving Works on problems of diverse scope where analysis of data requires evaluation of numerous factors Demonstrates good judgment in determining the best course of action when dealing project challenges Ability to resolve complex issues within defined parameters and procedures, and escalate proactively when appropriate Demonstrated experience ensuring customer business requirements become workable business solutions either as software solutions or as business process changes Quickly assesses customer needs, and drives the development of innovative solutions to solve complex business problems Understands project management and software implementation theories, concepts, principles, and techniques to handle situations with minimal guidance Possesses a passion for helping customers optimize their implementation of Ceridian HCM to more effectively run their business Proactively analyzes for and communicates project risks and challenges, and develops mitigation plans Autonomy\nManages, tracks and communicates the progress of projects, and ensures the quality delivery of implementation services with minimal oversight Independently organizes and performs most work required within assigned areas Proactively plans the utilization of project resources to complete on-time and on-budget projects, securing customer references in the process Decision Making Receives directional guidance from Manager or Director and solicits product guidance from other project and other resources (consultants, Product Management, Education, Development) Exercises judgment in methods, techniques and evaluation criteria for obtaining results with minimal guidance Ability to define and manage scope and expectations with the customer Plans and manages all aspects of customer-specific engagements with minimal oversight, including; documentation and sign-off of business requirements, managing the execution of deliverables while controlling scope, executing change control, and ensuring timely resolution of issues and project roadblocks; makes decisions that affect the delivery of the engagement Interpersonal Skills Excellent written and verbal communication skills Excellent presentation skills; able to adjust content and presentation style to different audiences Ability to establish credibility and rapport with internal and external stakeholders at all levels of organization Ability to lead project teams and collaborate cross-departmentally Ability to communicate effectively with functional and technical resources, Product Management and Development Ability to influence customers to modify current business practices, as required Excellent client management skills and the ability to work with customers to develop and manage a project plan", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcmluY2lwYWwgSW1wbGVtZW50YXRpb24gUHJvamVjdCBNYW5hZ2VyLCBTaW5nYXBvcmUiLCJjb21wYW55X25hbWUiOiJDZXJpZGlhbiIsImNvbXBhbnlfbWlkIjoiL20vMDdmOGg2IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiRF8yY3k1R1E4eEgxRDhPd0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFVsUnpOWGRqVjI5d2FHdElORWN5Tm0xRFkyWk9VME5mT1RWTlMxQlhlRVpyWWtoclptdzJPRkJaY0hGMmFtRlphV3d6T1VodE5GaDZhV2hvTjNBMlZVZFZVa3hHUlZkNmFrRktkMlF4WHpoNFQwcDNRbTFMTFV3eWFGVldjR2sxWjBKU1FUVjFSRlJQTmt0eWVHVmFUa1p1ZVZGUVNXbHNPWEJ1VUVWdlJrTjROMGxLTFRCWU1rNUtjaTFsZERKM016Qm9aMWd3WTNsYVVFMW5FaFkyV0RaRFdWQjFORUU0WWxaMFFXRmFiMjlZVVVOM0dpSkJUMDFaVW5kQmRIbHdMVFZOU0dobk9YbzFRVlJ5YUVJM1dFaE9lVGhWUzNkMyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzI1IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFdoYXRKb2JzIiwibGluayI6Imh0dHBzOi8vZW4tc2cud2hhdGpvYnMuY29tL2pvYi1mb3ItUHJpbmNpcGFsLUltcGxlbWVudGF0aW9uLVByb2plY3QtTWFuYWdlci1TaW5nYXBvcmUtaW4tU2luZ2Fwb3JlLWNvb3AxNzU3NjkyOT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Project Manager", "company_name": "Sciente Consulting Pte. Ltd.", "location": "Singapore (+1 other)", "via": "via Monster Singapore", "description": "Job Summary\n\nWe are looking for an experienced Project Manager to lead Digital Projects within the banking industry.\n\nMandatory Skill-set\n• Degree in Computer Science, Information Technology, Engineering or other related disciplines;\n• Minimum 6-9 years of Project Management experience managing complex digital projects;\n• Strong experience in end-to-end project delivery lifecycle and software development lifecycle;\n• Excellent stakeholder engagement and interpersonal skills;\n• Proactive and independent worker who is able to work well under tight deadlines.\n\nDesired Skill-set\n• Experience in the banking industry;\n• PMP-certified.\n\nResponsibilities\n• Manage delivery of Digital Projects with a medium to high complexity as Product Delivery Lead;\n• Collaborate with business and technology stakeholders including external vendors to identify enhancements, ensure end-to-end process delivery and optimize customer journey;\n• Develop and analyze Business Requirements and translating requirements... into Business Requirements Documents/User Stories;\n• Review Functional Specifications Documents and Narratives to ensure specifications are in line with Business Requirements;\n• Lead a team of Test Analysts and Test Automation Engineers;\n• Provide post-implementation support including user training, problem management and resolving of customer issues according to Service-Level Agreements.\n\nShould you be interested in this career opportunity, please send in your updated resume to apply@sciente.com at the earliest.\n\nWhen you apply, you voluntarily consent to the disclosure, collection and use of your personal data for employment/recruitment and related purposes in accordance with the SCIENTE Group Privacy Policy, a copy of which is published at SCIENTEs website (https://www.sciente.com/privacy-policy).\n\nConfidentiality is assured, and only shortlisted candidates will be notified for interviews", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJTY2llbnRlIENvbnN1bHRpbmcgUHRlLiBMdGQuIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJiSEY0QTNYUy0zbDZKT2stQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1vbnN0ZXIgU2luZ2Fwb3JlIiwibGluayI6Imh0dHBzOi8vd3d3Lm1vbnN0ZXIuY29tLnNnL2pvYi12YWNhbmN5LXByb2plY3QtbWFuYWdlci1zY2llbnRlLWNvbnN1bHRpbmctcHRlLWx0ZC1zaW5nYXBvcmUtNi05LXllYXJzLTI1MzkxNDU5Lmh0bWw/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Project Manager (Agile)", "company_name": "GovTech Singapore", "location": "Singapore", "via": "via LinkedIn", "description": "The Government Technology Agency (GovTech) aims to transform the delivery of Government digital services by taking an \"outside-in\" view, putting citizens and businesses at the heart of everything we do. We also develop the Smart Nation infrastructure and applications, and facilitate collaboration with citizens and businesses to co-develop technologies.\n\nJoin us as we support Singapore’s vision of building a Smart Nation - a nation of possibilities empowered through info-communications technology and related engineering.\n\nThe Government Technology Agency (GovTech) seeks to transform the delivery of Government Digital Services by taking an \"outside-in\" view, putting citizens and businesses at the heart of everything we do. We also develop the Smart Nation infrastructure and applications, and facilitate collaboration with the public to co-develop technologies.\nJoin us as we support Singapore’s vision of building a Smart Nation - a nation of possibilities empowered through... info-communications technology and related engineering.\n\nJob Description\n\nThe successful candidate will run exciting digital projects throughout their life cycles with a focus on Agile capabilities, so that government agencies can successfully deliver their digital agenda. With a proactive approach to business issues, you will plan project requirements with key decision makers and domain specialists, handle project timeline, identify risks and communicate them clearly to all involved.\n\nYou will work closely with a diverse team of business analysts, solution architects and technical services consultants to ensure that business needs are met and projects are delivered in a timely manner within projected costs, yet without compromising quality.\n\nIf you are a decisive and driven individual with skills and experiences in actively engaging and handling key decision makers within a dynamic and fast-paced environment, we want you.\n\nWhat To Expect\n• Plan and coordinate the development of the business cases, ensuring that projects are executed to meet identified business needs and outcome, within agreed parameters of cost, duration and quality.\n• Handle and timely execute the procurement of digital systems.\n• Assess and apply the appropriate project management methodologies, such as Agile practices, to ensure project success.\n• Identify potential project risks and the implications to the organisation and recommend mitigating measures.\n• Actively engage and motivate various key partners to deliver and effect positive change of digital products.\n\nHow To Succeed\n• Degree or Diploma in Computer Science, Information Systems, Information/ Infocomm Technology, Computer or Electronics Engineering or related field.\n• At least 5 years of relevant working experience as a Project Manager in at least 2 full project development life cycles, with at least one using Agile methodology.\n• Strong vendor management and interpersonal ability.\n• Strong analytical, conceptualisation and problem-solving skills.\n• An adaptable and enterprising personality, with willingness to pick new knowledge and take calculated risks.\n• Be motivated by innovation to achieve tangible business outcomes.\n• Strong presentation skills, both written and verbal, to positively influence key partners.\n\nPreferred Skills\n• Experience in tender calls or presentations.\n• Experience in handling projects involving Cloud, Design Thinking, Data Analytics or Product-Centric Development.\n• Project Management-related certifications such as CITPM, COMIT or PMP.\n• Agile-related certification such as Certified Scrum Master.\n\nWe are an equal opportunity employer and value diversity at our company as we believe that diversity is critical to innovation. We do not discriminate on the basis of race, religion, color, national origin, sex, gender, gender expression, sexual orientation, age, marital status, veteran status, or disability status. We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment", "extensions": ["7 days ago", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIgKEFnaWxlKSIsImNvbXBhbnlfbmFtZSI6IkdvdlRlY2ggU2luZ2Fwb3JlIiwiY29tcGFueV9taWQiOiIvZy8xMWR4cGtmc182IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiOU4wbHFiQVJYZ3dCcFhXNUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZZQkNyY0JRVTVWWDA1eFZITkVVR05sU2xWNlpVVlBaamhaV1hNNGRHY3lUVlV3V0VwZmVWRnVhMEY2U1ZWck1pMVVSMDV3WjJ0NVIycFFaRXR5ZWpOU2MxOWFla3cyVFZkTlRqaE1hRzF5Tms1SGFDMU9OV05SVG1jd1QwaFRTR1J6ZWxGRFJqVTNWWFIxYkdsa04ySkljakF5YlVsd2MzSmxWV1pKVWxsQ2IyUnJVRkJ3YVZOeE1YcEtTa3RxUm1GSFRXUlJibTlCVVdWUlZIRjZVSFpFYld4WlVHcFFTblY2YlhjemFsTktXbEpqY2xselEzUjBjMnRGRWhZMldEWkRXVkIxTkVFNFlsWjBRV0ZhYjI5WVVVTjNHaUpCVDAxWlVuZEJkazB0ZGpGcGVtdFVibE5YWkc1dlJ6VlZZMk50Y2pkb09FbEIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18zNSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL3NnLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvcHJvamVjdC1tYW5hZ2VyLWFnaWxlLWF0LWdvdnRlY2gtc2luZ2Fwb3JlLTIzNjk2MDI1NDY/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Project Manager", "company_name": "3D NETWORKS SINGAPORE PTE. LTD", "location": "Singapore (+1 other)", "via": "via Jobs", "description": "The Project Manager is responsible for planning, overseeing and leading projects from ideation through to completion. This role requires interaction with a range of internal and external stakeholders, most often managing several moving project parts simultaneously.Duties and responsibilities: Meet with clients to take detailed ordering briefs and clarify specific requirements of each project Delegate project tasks to project team members based on individual strengths, skill sets and experience levels Track project performance, specifically to analyze the successful completion of short- and long-term goals Meet budgetary objectives and make adjustments to project constraints based on financial analysis Develop comprehensive project plans to be shared with clients as well as other team members Managing relationships with clients and stakeholders Overseeing all incoming and outgoing project documentation Conducting project review and creating detailed reports Optimising and improving... processes and the overall approach where necessary Securing growth opportunities and initiating new projects Job qualifications and requirements: 3 years’ experience in project management PMP Certification Advanced time management and analytical skills Working knowledge of Microsoft Project Experience with process improvement and inventory control 3D Networks is a leading end-to-end solutions integrator, we harness our resources and specialized skills, with our strategic partnerships and broad regional presence to offer expert integration solutions to businesses in the Asia Pacific. Our expertise in design, integration and management of communications infrastructure makes us a preferred partner for businesses spanning vertical markets such as finance, government, manufacturing, retail, hospitality and service providers. 3D Networks is part of the Singapore-based Planet One Pte Ltd. Planet One and its group of companies form a formidable information technology team to offer a broad range of IT solutions and services. We have the following positions available based in Singapore. Additional Company Information Registration No. 200613312E Company Size 51 - 200 Employees Computer / Information Technology (Software) Benefits & Others Dental, Medical, Regular hours, Mondays - Fridays, Business (e.g. Shirts", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiIzRCBORVRXT1JLUyBTSU5HQVBPUkUgUFRFLiBMVEQiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IkF2aXU4UjBFRHRDRU85M3pBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9icyIsImxpbmsiOiJodHRwczovL3NnLmZpZGFudG8uY29tL2pvYnMvam9iLW9wZW5pbmcvaW5mb3JtYXRpb24tdGVjaG5vbG9neS1wcm9qZWN0LW1hbmFnZXJzL3Byb2plY3QtbWFuYWdlci0yNzU0OTE3NjQ/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "IT Project Manager", "company_name": "Career Edge Asia Pte Ltd", "location": "Singapore", "via": "via Glassdoor", "description": "$7500+ AWS + VB + allowance\n\n5 working days, Mon – Fri , normal office hours\n\nLocation: Central\n\nResponsibilities\n• Responsible to implement processes, practices and tools for multiple paths of project delivery\n• To lead Agile projects by helping clients to understand Agile and onboard key roles and work closely with all stakeholders to assess organizational impediments and measure flows\n• To develop strategies for continuously improving and play an active role in mentoring agile teams and guide the team in project implementation\n• To lead all to adopt the new processes and improvements based on program retrospectives\n\nRequirements\n• Min. degree in IT\n• Possess Certified Scrum Master or an equivalent qualification is preferred\n• Min. 5 years of experience in managing Government Projects in an Agile environment\n• Good knowledge of the commonly used agile tools and practices\n• Possesses good oral and written communication skills\n\nCompetitive remuneration package will be offered to the... shortlisted candidate.\n\nInterested candidates, please send your updated CV in MS Words format stating your last drawn salary, expected salary, notice period and reason for leaving last / past employment(s) and email to recruit21@caed.com.sg for priority processing.\n\nTo find out more job opportunities, visit Career Edge Asia at www.caed.com.sg for all job listings.\n\nAttn: Jace Tay (Registration No.: R1331152)\n\nCAREER EDGE ASIA PTE LTD\nEA Licence Number: 13C6678\nTo find out more job opportunities, visit Career Edge Asia at www.caed.com.sg for all job listings.\nEmail: recruit@caed.com.sg", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJJVCBQcm9qZWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJDYXJlZXIgRWRnZSBBc2lhIFB0ZSBMdGQiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IkFCMGVlVUI3ZWtnV3RwNEdBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gR2xhc3Nkb29yIiwibGluayI6Imh0dHBzOi8vd3d3LmdsYXNzZG9vci5zZy9qb2ItbGlzdGluZy9pdC1wcm9qZWN0LW1hbmFnZXItY2FyZWVyLWVkZ2UtYXNpYS1wdGUtSlZfSUMzMjM1OTIxX0tPMCwxOF9LRTE5LDM5Lmh0bT9qbD0zNzAyMzQ2NzgxXHUwMDI2dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Installation Project Manager (APJ)", "company_name": "HP Inc", "location": "Singapore", "via": "via WhatJobs", "description": "HP is the world’s leading personal systems and printing company, we create technology that makes life better for everyone, everywhere. Our innovation springs from a team of individuals, each collaborating and contributing their own perspectives, knowledge, and experience to advance the way the world works and lives.\n\nWe are looking for visionaries, like you, who are ready to make a purposeful impact on the way the world works.\n\nAt HP, the future is yours to create!\n\nAs a Installation Project Manager (APJ) for PageWide Industrial, you will apply advanced subject matter knowledge to solve complex business issues and is regarded as a subject matter expert.\n\nIf you are our Installation Project Manager (APJ) for PageWide Industrial, you will have a chance to:\n\nManage customer project delivery, project financials including Profit & Loss and business development Manage high risk, high complexity legal and commercial issues in single or multiple regions Act as an expert providing direction... and guidance to process improvements and establishing policies Revenue as detailed in Impact section. Provide reliable financial forecasts to HP service management. Support early qualification and opportunity assessment for large and complex opportunities Act as opportunity manager for high risk deals while identifying and developing new opportunities with clients Manage client relationship and upper level client delivery relationships Represent the organization to external customers/clients Manage project team, internal and external resources with a team size of 40 people Provide mentoring, guidance and support to skill development of project team members Provide detail performance review input and development recommendations for team members\n\nAre you a high-performer? We are looking for an individual with:\n\nFirst Level University Degree At least 7 years’ experience in project management or in like roles/businesses Able to demonstrate an in-depth understanding of key HP Services' operational policies, processes and methodologies applicable to project management Able to speak with authority to most layers of depth related to project management methods Make use of and contribute to HP’s Project Management Professions (PMP) community PMP Certified\n\nHP is a Human Capital Partner – we commit to human capital development and adopting progressive workplace practices in Singapore.\n\n#LI-POST", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJJbnN0YWxsYXRpb24gUHJvamVjdCBNYW5hZ2VyIChBUEopIiwiY29tcGFueV9uYW1lIjoiSFAgSW5jIiwiY29tcGFueV9taWQiOiIvbS8wM21uayIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IlowQ2l6eTVtWTNyTmp6dTJBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVzc0JDb3dCUVU1VlgwNXhVMHBXWDIxYWJsSmplR1JET0ZaVVluZDNZV3RYVlUxMVRtTklhbDlDTmw4MVpGRlZiV2RrVlRkRWEyNXpWRGs0ZFUxbUxYTm5UMVJzYjJwTFR6RlBOMnBGTWtKVVMxUndibFJpVjNWV2EwVmljalJQYlc4elUwMUhTV05UU1VWU2JuVlpWVlJRUTBwUVF5MUpkRzF3VURaSmFuRkJhWFZhWW05YWJtdEhUV00wTURkb2RETVNGalpZTmtOWlVIVTBRVGhpVm5SQllWcHZiMWhSUTNjYUlrRlBUVmxTZDBSaFgzUldjSGt4VDNwSVUwMTNlVUpyU3pSWlUyVmthM1I0WVdjIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNTAiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gV2hhdEpvYnMiLCJsaW5rIjoiaHR0cHM6Ly9lbi1zZy53aGF0am9icy5jb20vam9iLWZvci1JbnN0YWxsYXRpb24tUHJvamVjdC1NYW5hZ2VyLUFQSi1pbi1TRy1jb29wMTc1NzU0OTk/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Project Manager", "company_name": "Network for Electronic Transfer (S) Pte Ltd", "location": "Singapore", "via": "via Monster", "description": "Job Responsibilities:\n- Manage internal and external stakeholders and lead both project and technical teams towards successful and completion of activities to deliver the project timely.\n- Manage and monitor project risks, issues and progress and ensure deliverables are delivered in accordance with project schedule and within the budgeted cost.\n- Ensure all assignments and engagements under the functional and technical tracks are efficiently managed and executed.\n- Support and participate in the functional discussions, walkthroughs and presentations with both internal and external stakeholders.\n- Work with the teams to recommend or provide solutions to stakeholders.\n- Ensure system software provided by vendor and/or internal team functions according to the finalized functional requirements.\n- Manage and support the internal and external acceptance testing, industry testing and live cutover.\n- Review and ensure the teams and project comply with defined project processes, standards and... methodologies.\n- Prepare and/or review project status reports, meeting minutes and risk report.\n- Prepare and/or review technical, operations documentation and training materials.\n- Perform impact analysis for new and existing requirement changes.\nJob Requirements:\n- Bachelor’s degree in Computer Science/Engineering or equivalent.\n- Minimum 10 years of working experience in IT projects management, with at least 5 years of experience in project management of large-scale projects.\n- Good understanding and experience in project management and Software Development Life Cycle (SDLC) are necessary.\n- Possess strong communications skills, both verbal and written and ability to present and pitch to stakeholders.\n- Possess leadership qualities and people management skills.\n- Strong analytical and problem solving skills.\n- Preferably with experience in financial industry/payments systems.\n- Knowledge and experience in JEE, RDBMS (e.g. Oracle, MySQL), Application Servers (e.g. WAS, WLS, JBoss) will be an advantage.\n- PMP certification is preferred", "extensions": ["23 days ago", "Contractor"], "detected_extensions": {"posted_at": "23 days ago", "schedule_type": "Contractor"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJOZXR3b3JrIGZvciBFbGVjdHJvbmljIFRyYW5zZmVyIChTKSBQdGUgTHRkIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJTNkpUb0NHNkpiM2JpNVYwQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1vbnN0ZXIiLCJsaW5rIjoiaHR0cHM6Ly93d3cubW9uc3Rlci5jb20uc2cvam9iL3Byb2plY3QtbWFuYWdlci1uZXR3b3JrLWZvci1lbGVjdHJvbmljLXRyYW5zZmVyLXMtcHRlLWx0ZC1zaW5nYXBvcmUtMjkwODQ1Mz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Management", "value": "GC18"}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Media, Communications and Writing", "value": "GC20"}, {"text": "Advertising and Marketing", "value": "GC03"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Transportation and Logistics", "value": "GC30"}, {"text": "Art, Fashion and Design", "value": "GC05"}, {"text": "Construction", "value": "GC09"}, {"text": "Education", "value": "GC11"}, {"text": "Human Resources", "value": "GC15"}, {"text": "Protective Services", "value": "GC23"}, {"text": "Property", "value": "GC24"}, {"text": "Science and Engineering", "value": "GC27"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "Project manager", "value": "project manager"}, {"text": "Program manager", "value": "program manager"}, {"text": "Manager", "value": "manager"}, {"text": "Project director", "value": "project director"}, {"text": "Delivery manager", "value": "delivery manager"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Senior", "value": "senior"}, {"text": "Consultant", "value": "consultant"}, {"text": "Coordinator", "value": "coordinator"}, {"text": "Deputy director", "value": "deputy director"}, {"text": "Director", "value": "director"}, {"text": "Group manager", "value": "group manager"}, {"text": "Operations", "value": "operations"}, {"text": "Scrum master", "value": "scrum master"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Services", "value": "services"}, {"text": "Vice president", "value": "vice president"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Engineering Services", "value": "/business/naics2007/5413"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Entertainment", "value": "/business/naics2007/71"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Management", "value": "/business/naics2007/55"}, {"text": "Real Estate", "value": "/business/naics2007/53"}, {"text": "Research", "value": "/business/naics2007/5417"}, {"text": "Retail", "value": "/business/naics2007/44"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": ".AB4Jjf.qPB6Vc{padding-right:11px}.qfpP8d{padding:7px 0 7px 11px}.S003Ke{flex:none}.ZoN4Lb{color:rgba(0,0,0,.54)}.nAXVG{color:#70757a}.IxQsL{color:rgba(0,0,0,.26)}.xFO1De{color:#fff}.ooFpK{color:rgba(255,255,255,.30)}.mtnwac{color:#4285f4}.WxeeKb{color:#34a853}.hIVRU{color:#f29900}.EXaTMc{color:#fbbc04}.sxn46d{color:#000}.gqMTF{color:#1a73e8}.zpn8Mb{color:#d93025}.dEUPmd{color:#1e8e3e}.PJNo1{color:#fbbc04}Actively Hiring", "value": "e"}, {"text": "Michael Page", "value": "/m/04cxldw"}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Nanyang Technological University", "value": "/m/0l49k"}, {"text": "Jobline Resources Pte Ltd", "value": "/g/11gp2647pn"}, {"text": "Randstad Singapore", "value": "/g/11g70b50mr"}, {"text": "GECO Asia", "value": "/g/11gk72_bt_"}, {"text": "Facebook", "value": "/m/0hmyfsv"}, {"text": "HP", "value": "/m/03mnk"}, {"text": "IoTalents", "value": "/g/11dxq187wm"}, {"text": "NCS Group", "value": "/m/0282746"}, {"text": "National University of Singapore", "value": "/m/01q460"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "OPTIMUM SOLUTIONS (SINGAPORE) PTE LTD", "value": "/g/11g70hkrbx"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Apple", "value": "/m/0k8z"}, {"text": "Avensys Consulting", "value": "/g/11g7022gjf"}, {"text": "BNP Paribas", "value": "/m/02qhk4"}, {"text": "Ceridian", "value": "/m/07f8h6"}, {"text": "Ensign InfoSecurity", "value": "/g/11g4jhymjr"}, {"text": "Humanica Asia Pte. Ltd", "value": "/g/11h1y98c9z"}, {"text": "Kerry Consulting", "value": "/g/11c73vtzc8"}, {"text": "Marsh and McLennan", "value": "/m/053rw"}, {"text": "NSEARCH GLOBAL", "value": "/g/11dxpksll4"}, {"text": "NTT", "value": "/m/05mybp8"}, {"text": "OakTree Consulting", "value": "/g/11g70jfhtq"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "TEKsystems", "value": "/g/11b6g4bkv0"}, {"text": "Teradyne", "value": "/m/04bzqp"}, {"text": "Toshiba Tec Singapore Pte. Ltd", "value": "/g/11g9n9q547"}, {"text": "Trustwave", "value": "/m/0n3xjf5"}, {"text": "Wood Plc", "value": "/m/07vv9s"}, {"text": "Workiva", "value": "/m/0113m1rd"}, {"text": "A-it Software Services Pte Ltd", "value": "/g/11dxpy_gl_"}, {"text": "ABS Group", "value": "/g/11dxplj1z6"}, {"text": "ACI HR Solutions Ltd", "value": "/g/11c73ryh3p"}, {"text": "AIA", "value": "/m/02r5cgx"}, {"text": "ASEAN CABLESHIP PTE. LTD.", "value": "/g/11b7dsfph2"}]}]}