{"search_metadata": {"id": "6082791f11c88144b9755710", "status": "Success", "json_endpoint": "https://serpapi.com/searches/d381a99ece386fb5/6082791f11c88144b9755710.json", "created_at": "2021-04-23 07:37:03 UTC", "processed_at": "2021-04-23 07:37:03 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28software+developer%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=30", "raw_html_file": "https://serpapi.com/searches/d381a99ece386fb5/6082791f11c88144b9755710.html", "total_time_taken": 4.23}, "search_parameters": {"q": "(software developer) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "30"}, "jobs_results": [{"title": "Software Developer​/Mobile apps", "company_name": "THE TALENT SHARK PTE. LTD.", "location": "Singapore", "via": "via Learn4Good", "description": "Position: Software Developer (Mobile apps)\nLocation: null\nRoles &\n\nResponsibilities\n\nJob\n\nDescription:\n\nThe role of the Software Developer will be responsible for designing, developing, and implementing business solutions for the company and its clients. The role also comprises on-site/offsite low-level requirements gathering, understanding client’s needs, and working with the architects to come up with a viable solution. Qualifications\n\nBachelors or Associate degree in IT discipline. 3-5+ years in software development or equivalent.\n\n3-5+ years work experience with the following languages and tools:\n\nGood working experience on mobile development by using IOS(Swift), Android (Kotlin), or Xamarin. Familiar with Apple and Google store App deployment Good understanding of development methodologies, testing practices, and tools and knowing when to apply each method to achieve the desired outcomes. Familiarity with architecture styles/APIs (REST, API, MVC) Client/Server scripting framework... (JavaScript, Angular.js, React JS, Node.js) Excellent troubleshooting and communication skills BSc/BA in Computer Science, Engineering or a related field Knowledge of security standards and techniques for web applications Understand browser-specific compatibility issues Expertise in the design, implementation, and deployment of user-centric software, with a focus on usability · Added advantages Understanding and practicing Agile methodologies o Certification in mobile development or equivalent Familiar with Cloud application deployment such as (azure, AWS or google cloud) Experience in Java-based mobile application Experience in Java/J2EE, .\n\nNet, and/or mobile Technologies Good knowledge of DevOps (Jenkins), automated testing would be beneficial.\n\nResponsibilities Report to Development Lead Develops software solutions by studying information needs; conferring with users; studying systems flow, data usage, and work processes; investigating problem areas; following the software development lifecycle. Determines operational feasibility by evaluating analysis, problem definition, requirements, solution development, and proposed solutions. Documents and demonstrates solutions by developing documentation, flowcharts, layouts, diagrams, charts, code comments, and clear code.\n\nPrepares and installs solutions by determining and designing system specifications, standards, and programming. Improves operations by conducting systems analysis, recommending changes in policies and procedures. Updates job knowledge by studying state-of-the-art development tools, programming techniques, and computing equipment; participating in educational opportunities; reading professional publications; maintaining personal networks; participating in professional organizations. Protects operations by keeping information confidential. Provides information by collecting, analyzing, and summarizing development and service issues.\n\nAccomplishes engineering and organization mission by completing related results as needed. Supports and develops software engineers by providing advice, coaching, and educational opportunities. Provide level 2 and 3 support to business users.\n\nTell employers what skills you have\n\nAgile\n\nAgile Application Development\n\nAmazon Cloud\n\nAndroid\n\nAndroid Development\n\nAngular JSAngular.jsAngular\n\nJSAWSiOSiOS Development\n\nJ2\n\nEEJavaScript\n\nMVCNode.jsNodeJSRESTSWIFTWindows Azure", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBEZXZlbG9wZXLigIsvTW9iaWxlIGFwcHMiLCJjb21wYW55X25hbWUiOiJUSEUgVEFMRU5UIFNIQVJLIFBURS4gTFRELiIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiSnZDY2Y3Q0NiZ2xpOWJRSEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMZWFybjRHb29kIiwibGluayI6Imh0dHBzOi8vd3d3LmxlYXJuNGdvb2QuY29tL2pvYnMvc2luZ2Fwb3JlL3NvZnR3YXJlX2RldmVsb3BtZW50LzI3MTI5OTMwNi9lLz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "PEGA Application Developer (Lead-Specialist Level)", "company_name": "Accenture", "location": "Singapore", "via": "via Accenture", "description": "About Accenture\n\nAccenture is a global professional services company with leading capabilities in digital, cloud and security. Combining unmatched experience and specialized skills across more than 40 industries, we offer Strategy and Consulting, Interactive, Technology and Operations services—all powered by the world’s largest network of Advanced Technology and Intelligent Operations centres. Our 506,000 people deliver on the promise of technology and human ingenuity every day, serving clients in more than 120 countries. We embrace the power of change to create value and shared success for our clients, people, shareholders, partners and communities. Visit us at www.accenture.com.\n\nKey responsibilities may include and are not limited to:\n• Coordinate with the Project Team in understanding client requirements and how they translate in application features\n• Collaborate with the Team to set specifications for new applications Perform troubleshooting and debugging of applications when... required\n• Evaluate existing applications to reprogram, update and add new features Work with business process owners/SMEs to assess capabilities and identify high-level user requirements\n• Work with project managers, architects and SMEs to define metrics and performance goals for the process.\n• Participate in transitioning the requirements and use cases", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQRUdBIEFwcGxpY2F0aW9uIERldmVsb3BlciAoTGVhZC1TcGVjaWFsaXN0IExldmVsKSIsImNvbXBhbnlfbmFtZSI6IkFjY2VudHVyZSIsImNvbXBhbnlfbWlkIjoiL20vMDFycDJjIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiai01WTdBSkczUExKTXpSREFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFUwcEdRM0ExZGt4ek5HSkZYMk41Tlhkc1JtZHdiRzlJZW1rNFZpMHpOMDFSTmxkRVRuSXdORkpJU25jemVsWkpkRUUxYjFwMGFFWkxXa2hyYWpsVGRsQlpUSHBmTUVzd01GSm9TSEJpU25KRGRtMDBOWEJUV2tsM2RrMVpXbFpxVFhCTmFWTm9aRVJCTW14WllrMVRUbWxDTkVWWVgzbElMVEpXV1hsQ2VucEdiREZYYTBSUVRtSjROSG8wUkY5UWF6Sk1TSFJ2TjJreVdsZG5FaFpKYm0xRFdVOVVUa3haTmxVdFoxUjNiVFpETkVGM0dpSkJUMDFaVW5kQk5HMU5SRUZ0Vm1KaVJHSkxMWGx2YVhwbVQzTnJjVFEwTkZobiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzExIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEFjY2VudHVyZSIsImxpbmsiOiJodHRwczovL3d3dy5hY2NlbnR1cmUuY29tL3NnLWVuL2NhcmVlcnMvam9iZGV0YWlscz9pZD0wMDg1NDI1MF9lblx1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Senior Software Engineer at Netflix", "company_name": "Netflix", "location": "Singapore", "via": "via BizLINKS Resources Pte Ltd", "description": "Employer Referral\n\nSenior Software Engineer at Netflix\n\nThe Company and Product Strategy Instant streaming is a core part of Netflix's strategy for the future. Our first product to support instant streaming to TVs was launched in May 2008 and has since expanded to all relevant connected screens in the home, including TV’s, streaming sticks, and operator set-top boxes. Our reach and ease-of-use is enhanced through strong partnerships with many of the world's most innovative partners such as Sony, Panasonic, J COM, and KDDI. In this role, you will help ensure we continue our strong innovation and partnership with our biggest partners in Japan. About The Role In order to help our partners add the Netflix instant streaming service quickly to their device, we work very closely with these engineering teams to quickly overcome any and all challenges. We are looking to add to our team in APAC that currently works with local partners on integration, certification and in field phases of a... product. You’ll apply your experience in software development to a wide variety of technical challenges to achieve the goal of helping our Japanese partners bring their products to market on time with the highest quality. The functionality of our platform includes streaming and playback, dynamic UI, payments, security and partner-specific adaptation for new types of devices. Willingness to travel to Netflix’s Los Gatos, CA headquarters to interface with the internal engineering teams, as well as periodic travel to Japan to develop and maintain strong ties with our partners. Our culture is a bit unique, and we tend to live by our values, so it’s worth learning more about Netflix at https //jobs.netflix.com/life-at-netflix Singapore, Singapore Product Partner Ecosystem Engineering Senior Software Engineer The Company and Product Strategy Instant streaming is a core part of Netflix's strategy for the future. Our first product to support instant streaming to TVs was launched in May 2008 and has since expanded to all relevant connected screens in the home, including TV’s, streaming sticks, and operator set-top boxes. Our reach and ease-of-use is enhanced through strong partnerships with many of the world's most innovative partners such as Sony, Panasonic, J COM, and KDDI. In this role, you will help ensure we continue our strong innovation and partnership with our biggest partners in Japan. About the role In order to help our partners add the Netflix instant streaming service quickly to their device, we work very closely with these engineering teams to quickly overcome any and all challenges. We are looking to add to our team in APAC that currently works with local partners on integration, certification and in field phases of a product. You’ll apply your experience in software development to a wide variety of technical challenges to achieve the goal of helping our Japanese partners bring their products to market on time with the highest quality. The functionality of our platform includes streaming and playback, dynamic UI, payments, security and partner-specific adaptation for new types of devices. Willingness to travel to Netflix’s Los Gatos, CA headquarters to interface with the internal engineering teams, as well as periodic travel to Japan to develop and maintain strong ties with our partners. Our culture is a bit unique, and we tend to live by our values, so it’s worth learning more about Netflix at https //jobs.netflix.com/life-at-netflix Required skills and attributes You are fluent in Japanese with excellent business reading and intermediate business writing skills. You should also have intermediate spoken and written English skills. You are an experienced and current C/C++ programmer. 5+ years of relevant experience integrating applications into complex embedded platforms. You know what's important when releasing software to partners – ideally, you have worked as a software developer producing as well as consuming an SDK (Software Development Kit). You're comfortable with proactive outward communication and technical leadership. You enjoy working side by side with partners on tough and ambiguous problems. Experience working with partners is a plus. Ideally, you have a deep background in one or more of the following embedded system development, Linux system-level programming, audio/video playback, embedded graphics, or UI programming. Experience with Android application and Android framework development is a plus. 2-3 years experience as a team leader or an engineering manager is a plus. Periodic travel to Los Gatos, California and regional offices required, as external conditions permits. Show more\n\nOriginal Joblink: https://sg.linkedin.com/jobs/view/senior-software-engineer-at-netflix-1996925994 ", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgRW5naW5lZXIgYXQgTmV0ZmxpeCIsImNvbXBhbnlfbmFtZSI6Ik5ldGZsaXgiLCJjb21wYW55X21pZCI6Ii9tLzAxN3JmXyIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImI2bzlaMnRhLW1UeTRFTFRBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVzc0JDb3dCUVU1VlgwNXhVMUJEWVhacFYzaG9Obm8yTlRjMWRFcEdSRk5QYW1VNFZHWk5RMmxXVVZwYVUwMUdTamMyZEcxVmNIbHVXbFJQT0hWUFdWSXdXRWRxVTJRemNXMXJjR2xsZEROdFVISjNkRzVOV2kxVFFXcHhWV1pxYVhGTU1XbGlVMHMxTXkxNGRVcHVaelJ0WkhkWVZXUk5VbXBuV25JMGJWQlFSVlZXTXpGd1IySmxhWEZvYzFoNlVVd1NGa2x1YlVOWlQxUk9URmsyVlMxblZIZHROa00wUVhjYUlrRlBUVmxTZDBOT2JtaFZTbEkxVXpSVGNGbDBUazUwVUVSbFR6STViR05KUTFFIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMTgiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQml6TElOS1MgUmVzb3VyY2VzIFB0ZSBMdGQiLCJsaW5rIjoiaHR0cHM6Ly93d3cuYml6bGlua3NyZXNvdXJjZXMuY29tLnNnL2luZGV4LnBocC9qb2ItbGlzdGluZ3MtcHVibGljLzkyLXNvZnR3YXJlLWVuZ2luZWVycy8yODE4LXNlbmlvci1zb2Z0d2FyZS1lbmdpbmVlci0yODE4P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Software Developer #SGUnitedTraineeships", "company_name": "3E Accounting Pte Ltd", "location": "Singapore (+1 other)", "via": "via 3E Accounting", "description": "Traineeship Description:\n\nTrainee will learn and develop the capability to make breakthroughs in design, development, testing, debugging and implementing software applications or specialised utility programs in support of end users’ needs on platform.\n\nJob Responsibilities:\n\n• Responsible in supporting the full software development of new and existing applications.\n\n• Explore and create new design/architectures (but not limited to) for better scaling and performance of services\n\n• Define and prototype feature specifications\n\n• Create prototype to explore feasibility of new solution\n\n• Optimise application for maximise speed and scalability.\n\n• Develop, construct, analyse and troubleshoot large-scale systems.\n\n• Maintaining the system, new feature, bug fixing, code refactoring and performance optimisation.\n\n• Possess the ability to translate ideas into functioning features\n\n• Deliver high quality application and system support\n\n• Any other ad-hoc duties as required or... assigned\n\nTechnical Skills and Competencies Trainee will learn:\n\n1. Trainee should be able to develop, integrate and maintain the software independently\n\n2. Trainee should be able to translate ideas into functioning features\n\n3. Trainee should be able to communication the features/functions of the developed/developing software to the other stakeholders confidently.\n\nTrainee should be able to support both front-end and back-end software development\n\nRequirements:\n\n• Singapore Citizen or Permanent Resident; and Graduated or graduating in calendar year 2019 or 2020 from universities, or other educational institutions (e.g. private universities and overseas institutions); or Graduated earlier from above institutions and completed National Service in 2019 or 2020", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBEZXZlbG9wZXIgI1NHVW5pdGVkVHJhaW5lZXNoaXBzIiwiY29tcGFueV9uYW1lIjoiM0UgQWNjb3VudGluZyBQdGUgTHRkIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiIxckY4UTMweTJuU01zODYzQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIDNFIEFjY291bnRpbmciLCJsaW5rIjoiaHR0cHM6Ly93d3cuM2VjcGEuY29tLnNnL2NhcmVlcnMvc29mdHdhcmUtZGV2ZWxvcGVyLXNndW5pdGVkdHJhaW5lZXNoaXBzLz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Software Developer [Mobile Application / West]", "company_name": "Reeracoen Singapore Pte Ltd", "location": "Singapore", "via": "via Joblum Singapore", "description": "Mobile App Software Developer\n(Job Ref. 31127)\nOur client is a reserach and development company. The role of a Mobile App Software Engineer (IOS/Android) is to\ntest, debug, and improve applications (IOS/Android) for clients and often collaborate with product and design teams.【What you will be working on】\n• Develop iOS apps with Swift and Android apps with Java using Android Studio.\n• Maintain and update iOS/Android apps\n• Maintain internal and external testers and release beta apps to TestFlight.\n• Responsible to deploy the latest iOS apps and Android apps\n• Design and develop front-end and back-end mobile application.\n• Participate in brainstorming sessions with team members to develop web and mobile applications.\n【What they are offering】\n• Bonus - Individual performance bonus and company performance bonus\n• Annual Leave 10 days during the 1st year\n• Medical Leave 14 days\n• Medical Insurance\n• Medical Allowance: $600/year\n• Transportation Allowance\n• Mobile Allowance\n【What they are... looking for】\n• Minimum Diploma in IT or relevant certification\n• 2 years of experience in software development\n• Knowledge of C-Language, Java, MySQL, Database and JavaScript\n• Either IOS or Android experience\n• Knowledge of Swift, Android, Adobe Photoshop, PHP and HTML will be added advantage\n• Good interpersonal skills, strong analytical and problem-solving skills\n========================================================\nFor interested applicants, kindly indicate the following in your resume in order for us to process your application faster.\n1. Reason for leaving past and present employment(s)\n2. Expected / Last drawn salary\n3. Availability date\nInterested candidates, kindly email resume (with stated job position and Ref No.) & cover letter to: sam@reeracoen.sg.\nWe regret that only shortlisted candidates will be notified.\nRegistration No.: R1879295 (Sim Ting Feng)\nRecruitment License : 12C5051", "extensions": ["16 days ago", "Full–time"], "detected_extensions": {"posted_at": "16 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBEZXZlbG9wZXIgW01vYmlsZSBBcHBsaWNhdGlvbiAvIFdlc3RdIiwiY29tcGFueV9uYW1lIjoiUmVlcmFjb2VuIFNpbmdhcG9yZSBQdGUgTHRkIiwiY29tcGFueV9taWQiOiIvZy8xMWc3eV84d18zIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoic0ZYOXdES0d4X1pieEVta0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRW9zQ0Nzd0JRVTVWWDA1eFVXUmFTR2RLVms5eExWcDNlV0p0ZGpkVFNFdEdURmxEVlVKelRYbHNXV3BSTFRkMFIxcG9ORGRSYlhCMVVXTmFTMUpNTm1GcUxVbExUMHRhVkZrelgwTmFZVVZ1ZUd4YWVuUXpTV3BQWm1JeFNYa3paVTlUY1hoRFRqYzVNUzAyUmpWSVRFcGtWbU5PTWpaVFdsRlFNWFpqTVd4MlFTMUlSREZOTm5CNk1DMXViekp4YWtGd2NXMU9WWFJQYmpscFYzUkJNREpLWVZaMFZrOWFTa3hoVUhnd1IxRm9VbUprT0Zob1pWUXplR0pNVEdkMlIxaE1RbnBKTTFObFYwVlJNSFZuTVhodUVoWkpibTFEV1U5VVRreFpObFV0WjFSM2JUWkRORUYzR2lKQlQwMVpVbmRCZERCRVpqWm1lVWxIZFV4a0xYUXdSalpyUW1SMlZESllZV1pCIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMzAiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9ibHVtIFNpbmdhcG9yZSIsImxpbmsiOiJodHRwczovL3NnLmpvYmx1bS5jb20vam9iL3NvZnR3YXJlLWRldmVsb3Blci1tb2JpbGUtYXBwbGljYXRpb24td2VzdC82MDMyMDA/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Senior Software Engineer, Cloud Threat Detection Product", "company_name": "Horangi", "location": "Singapore (+1 other)", "via": "via TalentTribe", "description": "At Horangi we’re building Warden, a multi-cloud solution that enables continuous cloud security, compliance monitoring and risk management for AWS and GCP. Warden deploys in minutes, delivering actionable insights to help our customers identify, prioritize and fix security threats in their multi-cloud environments.\n\nHorangi is looking for experienced senior software engineers to join our team. You will be part of an engineering team building scalable systems capable of detecting real time threats and adversarial activities within our customer’s cloud environment.\n\nYour team will build a rule-based and behavior-based analysis engine that monitors real-time events and log streams from multiple cloud providers to identify real threats faster, thereby reducing time to remediation. You will plan detection based on real-world data and well-understood scenarios, and codify threat detection rules that can be rapidly deployed.\nWhat you’ll be doing\n• You will design and develop stream... processing infrastructure and application\n• You will build a scalable system that can handle events at scale\n• You will work with AWS technologies like Amazon Kinesis, DynamoDB and EventBridge\n• You will help build a framework for our threat detection engine and a repeatable process of building rules\n• You will learn to encode security insights into automation\n• You will continuously monitor system health and optimize performance\nWhat we’re looking for\n• You have at least 5 years experience in backend engineering. Python is your lingua franca\n• You are experienced with designing and building products with AWS and serverless technologies\n• You are a strong communicator. Explaining complex technical concepts to non-technical audiences is not a problem for you\n• You possess strong computer science fundamentals: data structures distributed systems, networking and graph algorithms\n• You write high quality code, that can be safely co-authored in a fast grown organization\n• You have a good understanding of how various cloud services work across all major cloud providers. Relevant cloud certification is a strong bonus\n• You have a bachelor’s degree in Computer Science, Engineering or related field, or equivalent training, fellowship, or work experience\nBonus points if you have\n• You have experience building real-time stream processing systems\n• You have prior experience in cybersecurity or intelligence fields\n• You have knowledge of CI/CD & DevOps tools\n• Contributed to open source projects\n\nAt Horangi, we pride ourselves as Cloud Security Champions in Asia backed by a team of global cybersecurity experts and trusted by Industry Leaders such as Gojek, MoneySmart, PropertyGuru and Tiket.com.\n\nWe built our Cloud Security product using AWS technology and cloud best practices to provide the security, performance and reliability of our platform as we ship rapidly in our agile software development. We adopt an event-driven architecture and embrace serverless technologies that are backed with 100% infrastructure as code. We build our app using reliable tools and frameworks that our team knows and trusts, including Python, Docker, TypeScript, React and GraphQL.\n\nHorangi has a positive, diverse, and supportive culture, and we look for people who are curious, inventive, and work to be a little better every single day. We work in a fast-paced, dynamic and get-things-done culture. Horangi is always looking to hire collaborative, humble and highly driven individuals who want to make a difference.\n\nLevel yourself up as a cloud security expert and do the best work of your life here at Horangi", "extensions": ["Full–time"], "detected_extensions": {"schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgRW5naW5lZXIsIENsb3VkIFRocmVhdCBEZXRlY3Rpb24gUHJvZHVjdCIsImNvbXBhbnlfbmFtZSI6IkhvcmFuZ2kiLCJjb21wYW55X21pZCI6Ii9nLzExZm00MXdkaDMiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiI2YW42X0tjekhNaTUwd3BoQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VWxaQmFHRmlWVWRxVUZnMU4ya3pNMVJQVFdoWmJWazJXVXhIV2pWbFRVczJVWGxuU2s0eE9HNUVaRmszVTJwcmNVeDFjbVJFZDJ4NlFqZzNTbXA2V25oVWNHTjROMnRPVkZKTldDMVJhblZMUkhjMlVHMXVhMVpHU1hWNmEwZGxTRFJJUjFwWWJrbGlWREpKWnpObVgyYzRTbWg1TkhneFh6VlFPV1ZQYTJ0ak1tYzNZa2w2T1RaMWVqVmlWa0V5Tlc4eFZVRTRhM0pVYzNsUkVoWkpibTFEV1U5VVRreFpObFV0WjFSM2JUWkRORUYzR2lKQlQwMVpVbmRDYmkxQ1RqQXdValp1Y1RCcGNHUlRiR1Z2UzJ4M1ZVWldSVk5SIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMzgiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gVGFsZW50VHJpYmUiLCJsaW5rIjoiaHR0cHM6Ly90YWxlbnR0cmliZS5hc2lhL2pvYnMvaG9yYW5naS9zZW5pb3Itc29mdHdhcmUtZW5naW5lZXItY2xvdWQtdGhyZWF0LWRldGVjdGlvbi1wcm9kdWN0LU9xTXZwaD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Project Engineer", "company_name": "Federal Express (singapore) Pte Ltd", "location": "Singapore (+1 other)", "via": "via Monster Singapore", "description": "To manage and administer an internal enterprise software development/ deployment project across Asia Pacific.\n\nRequirements:\n• Experience leading a major IT project, preferably across multiple markets\n• Has direct experience in SAFe Agile framework used in software development\n• Certified in any of SAFe certifications (Product Engineer, Scrum Master, Practitioner, Agile Product Manager, Release Train Engineer etc)\n• Understanding of operations/project management concept from Kanban, Theory of Constraint\n• Experience in Project Management Tools (from Microsoft Project to more advance tools) will be bonus point\n• Good communication skills (written and verbal)\n• Ability to prepare high quality PowerPoint decks quickly\n\nEducation: Bachelor's Degree or equivalent in Engineering, Computer Science or related disciplines", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IEVuZ2luZWVyIiwiY29tcGFueV9uYW1lIjoiRmVkZXJhbCBFeHByZXNzIChzaW5nYXBvcmUpIFB0ZSBMdGQiLCJjb21wYW55X21pZCI6Ii9nLzExZnkyYmNyNzkiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJhMTB1NERxbjVSamt0aFZiQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFcUVDQ3VJQlFVNVZYMDV4VTFreGNubFZkSEV6UkdOT1FqaGZNR1JoZURScmIzTkNOalZ5ZEROa2RHZHNkM0ZpVGkxRFUwbzRRekpCY0V4VmMwZzVNVzkyZWxOTmFYZFdOSGw1TkhKU1FVUTFRVXR4VFZWV1ZFWXpia3haVm01eFptRkVTbXc1V0cxSFpsaFliRnBKWkVSQmNWVkpiVVJSVkhFNVFVZzRWRVkwWlZCSGNWOU5jRkJYZFZKTFYyUlVPWGhhTW1kWlgzWmphakZJTFhSeExUbE5iVzVrVGt4bmVXUlVXak5NZWt4YVprdzFSbkYyVG5GMk5tb3lNMGwxYmpKZmVrRnNUVGRoU0RVMVZHcHlTekphU1VkbmMzbHVXREpSZWtobWNrbEZORXg0VERKV2R4SVdTVzV0UTFsUFZFNU1XVFpWTFdkVWQyMDJRelJCZHhvaVFVOU5XVkozUTBwaFdsYzRSVkJmVTJsR1dYcDNOVGhIVm1KblNFWmhMV2xKWnciLCJmY3YiOiIzIiwiZmNfaWQiOiJmY180NSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNb25zdGVyIFNpbmdhcG9yZSIsImxpbmsiOiJodHRwczovL3d3dy5tb25zdGVyLmNvbS5zZy9hbXAvam9iLXZhY2FuY3ktcHJvamVjdC1lbmdpbmVlci1mZWRlcmFsLWV4cHJlc3Mtc2luZ2Fwb3JlLXB0ZS1sdGQtc2luZ2Fwb3JlLTI3ODAwMTY3Lmh0bWw/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Software Developer 4", "company_name": "NetSuite Inc", "location": "Singapore", "via": "via Jobs", "description": "All over the world, people's lives are better because of Oracle. Want to make a difference? Join our company of change-makers.From Oracle to culinary school and back again. Bonnie Carlson Kaypaghian uses the skills she learned to create recipes for her daughter’s Type 1 Diabetes and has written a cookbook to share with the world. #LifeatOracleSoftware Developer 4-21000DXDApplicants are required to read, write, and speak the following languages:EnglishPreferred Qualifications Responsibilities: · Manage large global virtual infrastructure (Oracle VM and VMware), including hypervisor installation, patching, and troubleshooting.· Perform hardware/software installation (including new datacenter buildouts and capacity expansions), system configuration, and upgrades of high availability Oracle VM, Linux and Windows systems.· Create and update technical documentation (server configuration, backup and recovery procedures, etc.).· Provide Systems escalation support to the Operations Center.·... Perform Disaster Recovery and High Availability testing of Oracle VM and VMware environments and maintain related documentation.· Manage multiple on-going concurrent projects.· Follow Change Management and generic datacenter related policies and procedures.· Automate repetitive tasks on both Windows (using PowerShell, batch, and/or VBscript) and Linux servers (using Bash, Perl, and/or Python).· Analyze performance statistics (cpu, memory, disk I/O, network throughput/latency, etc.) and implement solutions to resolve issues should they occur.· Provide mentoring and direction for junior engineers/admins. Qualifications: · Degree in Computer Science, Information Systems or equivalent combination of relevant experience.· 5 or more years of experience managing large virtual environments (Oracle VM or Vmware)· 8-10 years of work experience as a System Engineer in Linux and Windows environments· Strong experience with Virtual Infrastructure management - Oracle VM (preferred) or VMware· Ability to apply critical thinking/problem solving skills in order to resolve complex technical issues in a timely fashion· Excellent verbal and written communication skills (English)· Customer focused and team oriented· Ability to effectively prioritize and execute tasks in a high-pressure environment Preferred additional skills: · Certification(s) in Linux administration such as LPIC, RHCSA or LFCS· Good hands-on experience on Oracle/SUN, HP, Dell, IBM Hardware· Familiarity with Payment Card Industry Data Security Standard (PCI DSS) audits and remediation· Willingness to learn new technologies· Experience with Configuration management tools like Chef or Puppet · Experience with version control environment, like SVN or GitDetailed Description and Job Requirements Design, develop, troubleshoot and debug software programs for databases, applications, tools, networks etc.As a member of the software engineering division, you will take an active role in the definition and evolution of standard practices and procedures. You will be responsible for defining and developing software for tasks associated with the developing, designing and debugging of software applications or operating systems.Work is non-routine and very complex, involving the application of advanced technical/business skills in area of specialization. Leading contributor individually and as a team member, providing direction and mentoring to others. BS or MS degree or equivalent experience relevant to functional area. 7 years of software engineering or related experience. Job :Product Development Location :SG-Singapore Job Type :Regular Employee Hire Organization :Oracle", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBEZXZlbG9wZXIgNCIsImNvbXBhbnlfbmFtZSI6Ik5ldFN1aXRlIEluYyIsImNvbXBhbnlfbWlkIjoiL20vMDVuOTUyIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoidUlnVS14X3hCWndVRFlBQ0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFVtSjRPWE5IWm1RdFRVOWFlSGRCVVhSd1JFWXdja1IwT0djeFVqaEJjVTVvVG1KU2VpMW9hRWRFTWtWdlpFMVRSWFZSUkZGc2Iza3RibmR4Y3prMlpESjRSelp0YWxoUk0yNUpVVmx2WmtSeWFEQkphR2RCV0hwZk1XWmpiMHAxZEdoU1NFVlRYM1l5TUZCUlZqQnJZa1ZvUlRoVVZubGxlbE5GTVVabVVWZG9iamxrUWpsSVdHWTNVSFJ2WkZSWlpGSlJNbE5WVFZOVmNETkJFaFpKYm0xRFdVOVVUa3haTmxVdFoxUjNiVFpETkVGM0dpSkJUMDFaVW5kRGJVVkpVRTUzVkZjM1NrTkJkMEpEVEZVNGNrRTBRbWhPU21KUiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzUyIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnMiLCJsaW5rIjoiaHR0cHM6Ly9zZy5maWRhbnRvLmNvbS9qb2JzL2pvYi1vcGVuaW5nL3NvZnR3YXJlLWRldmVsb3BlcnMtYXBwbGljYXRpb25zL3NvZnR3YXJlLWRldmVsb3Blci00LTI3Nzg4MjM5Nj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior Backend Java Engineer - Singapore at Zuhlke Engineering Singapore (Singapore)", "company_name": "Zuhlke Engineering Singapore", "location": "Singapore (+1 other)", "via": "via Arbeitnow", "description": "Your Job.\n\nThrive in an environment where you can express your passion and enthusiasm for software development and be inspired by your colleagues’ enthusiasm. As a Senior Backend Java software engineer, you will cooperate with interdisciplinary teams in projects and experience how technology and team spirit unite to create innovative solutions.\n\nYour job will involve working closely with clients to develop, test, and ship software that meets their needs. You will efficiently and competently solve complex software challenges. Continuous further development and active knowledge exchange mean that you will be working with the latest methods and tools to stay up to date with the latest trends.\n\nOur reputation is fundamental to our business, so our culture emphasizes quality, reliability, and respect. We value learning new technologies and skills, thus, you will get a generous budget to attend conferences, participate in certified courses, and our annual technical camp is a lot of... fun.\n\nYour Talent.\n• You have a degree in computer science or an equivalent related field (bachelor's/master's).\n• You have multiple years of experience with state-of-the-art web architectures and enjoy developing modern web applications.\n• You value high quality code and you want to satisfy your thirst for knowledge of the latest technologies every day.\n• You have professional experience in Java stack for at least 5-6 years.\n• You have professional experience with either cloud technologies (AWS, GCP or Azure) or experience with containerisation technologies (Docker, Kubernetes)\n• You will benefit from experience with message passing distributed systems built around JMS, RabbitMQ, ActiveMQ or Kafka.\n• In addition to expertise with traditional SQL RDBMS you will also benefit from exposure to NoSQL databases (MongoDB, Cassandra, etc)\n• You will also benefit from familiarity with DevOps toolchains (Jenkins, SonarQube, etc)\n• You have professional experience working in an agile development environment. Ideally, you are a certified Scrum developer or master.\n• You have strong communication skills and like making decisions.\n\nAnd Zuhlke.\nAt Zuhlke Asia you get the best of both worlds. You can leverage on the benefits of working in a stable, large, highly reputable company with a long history of success while enjoying the freedom and autonomy of working in a fast-growing start-up environment. Zuhlke offers you networked innovation power and the security of a long-running, international success story. We support your personal development with specialised workshops and active knowledge sharing among experts", "extensions": ["21 days ago", "Full–time"], "detected_extensions": {"posted_at": "21 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQmFja2VuZCBKYXZhIEVuZ2luZWVyIC0gU2luZ2Fwb3JlIGF0IFp1aGxrZSBFbmdpbmVlcmluZyBTaW5nYXBvcmUgKFNpbmdhcG9yZSkiLCJjb21wYW55X25hbWUiOiJadWhsa2UgRW5naW5lZXJpbmcgU2luZ2Fwb3JlIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJIUzBSdGlrMXJXNFVET3NhQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEFyYmVpdG5vdyIsImxpbmsiOiJodHRwczovL3d3dy5hcmJlaXRub3cuY29tL3ZpZXcvc2VuaW9yLWJhY2tlbmQtamF2YS1lbmdpbmVlci1zaW5nYXBvcmUtYXQtenVobGtlLWVuZ2luZWVyaW5nLXNpbmdhcG9yZS1zaW5nYXBvcmUtenVobGtlLWVuZ2luZWVyaW5nLXNpbmdhcG9yZS0xMDA5NjU/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Junior Software Engineer (JavaScript) - Singapore", "company_name": "EPAM", "location": "Singapore", "via": "via JobWiz", "description": "Our APAC cross-border Emerging Engineers Academy (EEA) is a specially designed program that aims to identify, groom and catapult junior technologists into digital architects of the future through a comprehensive and structured methodology that focuses on innovation, collaboration and leveraging new technologies to deliver engineering excellence. Check out this blog article for what our previous batch of graduates from Singapore had to say about the program.\n\nThis is a golden opportunity for recent grads majoring in IT/Computing/Comp Sci/Engineering etc. or those with a basic interest, certification or knowledge of frontend technologies to join us and benefit from the latest and most up-to-date training by our master trainers before embarking on a rewarding career journey with EPAM!\n\nAs an EEA participant, you will undergo a paid 3 month intensive program that blends theory with practice, before graduating as a Junior Software Engineer specializing in JavaScript and other skillsets, to... be deployed immediately into one of our exciting local or global projects upon graduation.\n\nDue to current pandemic situation, please note that this position is open only to Singaporeans (Citizens/PRs), and applicants must be able to start full-time with us in early May 2021.\n\nResponsibilities\n• Participate in full-time EEA (JavaScript) training course for the first three months\n• Play a junior developer role after the training course, with accelerated path to senior or lead roles based on performance\n• Write high quality and testable code following clean code principles\n• Implement functionality by following defined software development process with supervision\n• Read and understand project and requirement documentation\n• Create documentation describing his/her code\n• Participate in Agile Scrum activities: daily standup, demo session, retrospective, planning, etc\n\nRequirements\n• Professional Certification or Bachelor's degree in Computer Science, Software Engineering or related majors\n• Have Object Oriented Programming experience from diploma/degree studies\n• Knowledgeable in Databases and SQL Language\n• Enthusiasm and desire to learn, able to learn technology quickly\n• Good problem solving and analytical skills\n• Good communication skills\n\nWe offer\n• Friendly team and enjoyable working environment\n• Work-life balance and flexible schedule\n• Online training library, mentoring, career development and potential partial grant of certification\n• Unlimited access to LinkedIn learning solutions\n• Referral bonuses\n• Compensation for sick leave and paid time off\n• Opportunities for self-realization", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJKdW5pb3IgU29mdHdhcmUgRW5naW5lZXIgKEphdmFTY3JpcHQpIC0gU2luZ2Fwb3JlIiwiY29tcGFueV9uYW1lIjoiRVBBTSIsImNvbXBhbnlfbWlkIjoiL20vMGRsbnJjIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiei1lVEFzMG00R1I4cVRQdUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXNzQkNvd0JRVTVWWDA1eFVURk1iVkJEUVRVdFQwdGZUSGw2WWxsWUxUTktOMGxzYURsWWRuRTFVRlU1UjFwdlJsUmplRE5SYVRad2QwaGFXall5VFhFeVNXZE9OSGxNY2xneFRVbEllV2N4UjA0M1JUQmxUVGhUUzBoVVdrVlJNVWRzWmxWV2FESlFibUZ5VWt0QmFFUjVNRnBDUTA1dlRUWmlWVmhGWTBOUVdtNUZUbkZzU0ZKTVExbE1aalIxUWxjU0ZrbHViVU5aVDFST1RGazJWUzFuVkhkdE5rTTBRWGNhSWtGUFRWbFNkME5pT0VaUVYySkpNa05LWkc4ek5tZGhURXRxZVV0UlMxbHNkbmMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY182NCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JXaXoiLCJsaW5rIjoiaHR0cHM6Ly93d3cuam9id2l6LnNnL2pvYi9DUi0yMjA1MTQ3NDExP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}], "chips": [{"type": "Title", "param": "job_family_1", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Software engineer", "value": "software engineer"}, {"text": "Senior", "value": "senior"}, {"text": "Test engineer", "value": "test engineer"}, {"text": "Cloud engineer", "value": "cloud engineer"}, {"text": "Assurance engineer", "value": "assurance engineer"}, {"text": "Engineer", "value": "engineer"}, {"text": "Programmer", "value": "programmer"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Coach", "value": "coach"}, {"text": "Qa engineer", "value": "qa engineer"}, {"text": "Devops consultant", "value": "devops consultant"}, {"text": "Devops engineer", "value": "devops engineer"}, {"text": "Frontend engineer", "value": "frontend engineer"}, {"text": "Java engineer", "value": "java engineer"}, {"text": "Solutions engineer", "value": "solutions engineer"}, {"text": "Specialist", "value": "specialist"}, {"text": "Testing engineer", "value": "testing engineer"}, {"text": "Analyst", "value": "analyst"}, {"text": "Data engineer", "value": "data engineer"}, {"text": "Design engineer", "value": "design engineer"}, {"text": "Development manager", "value": "development manager"}, {"text": "Firmware engineer", "value": "firmware engineer"}, {"text": "Lead engineer", "value": "lead engineer"}, {"text": "Lecturer", "value": "lecturer"}, {"text": "Manager", "value": "manager"}, {"text": "Network systems", "value": "network systems"}, {"text": "Principal", "value": "principal"}, {"text": "Principal engineer", "value": "principal engineer"}, {"text": "Project engineer", "value": "project engineer"}, {"text": "Quality engineer", "value": "quality engineer"}, {"text": "Science", "value": "science"}, {"text": "Scrum master", "value": "scrum master"}, {"text": "Security architect", "value": "security architect"}, {"text": "Security engineer", "value": "security engineer"}, {"text": "Senior engineer", "value": "senior engineer"}, {"text": "Senior lecturer", "value": "senior lecturer"}, {"text": "Senior system", "value": "senior system"}, {"text": "Senior technical", "value": "senior technical"}, {"text": "Software architect", "value": "software architect"}, {"text": "Stack engineer", "value": "stack engineer"}, {"text": "Technical", "value": "technical"}, {"text": "Trainee", "value": "trainee"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Wholesale", "value": "/business/naics2007/42"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Mining", "value": "/business/naics2007/21"}, {"text": "Rental", "value": "/business/naics2007/532"}, {"text": "Retail", "value": "/business/naics2007/44"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": ".AB4Jjf.qPB6Vc{padding-right:11px}.qfpP8d{padding:7px 0 7px 11px}.S003Ke{flex:none}.ZoN4Lb{color:rgba(0,0,0,.54)}.nAXVG{color:#70757a}.IxQsL{color:rgba(0,0,0,.26)}.xFO1De{color:#fff}.ooFpK{color:rgba(255,255,255,.30)}.mtnwac{color:#4285f4}.WxeeKb{color:#34a853}.hIVRU{color:#f29900}.EXaTMc{color:#fbbc04}.sxn46d{color:#000}.gqMTF{color:#1a73e8}.zpn8Mb{color:#d93025}.dEUPmd{color:#1e8e3e}.PJNo1{color:#fbbc04}Actively Hiring", "value": "e"}, {"text": "EPAM", "value": "/m/0dlnrc"}, {"text": "VISA", "value": "/m/01kqjn"}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Zühlke", "value": "/g/1hh_rg216"}, {"text": "Cardinal Health", "value": "/m/040vzx"}, {"text": "Credit Agricole Group", "value": "/m/028vbm"}, {"text": "GlobalTix Pte Ltd", "value": "/g/11dxpqdhrf"}, {"text": "HCL SINGAPORE PTE. LTD.", "value": "/g/11fy25ngsv"}, {"text": "Mediacorp", "value": "/m/03qtz1"}, {"text": "Realtek", "value": "/m/05wrm7"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "TECHNOPALS PTE. LTD.", "value": "/g/11dxpvkynp"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "Thales", "value": "/m/01phj4"}, {"text": "UST", "value": "/m/08kb8g"}, {"text": "UrbanFox", "value": "/g/11ghs7y0w6"}, {"text": "Activate Interactive", "value": "/g/11dxq192l5"}, {"text": "Cognizant", "value": "/m/03bf9h"}, {"text": "DELL", "value": "/m/0py9b"}, {"text": "HCL Technologies", "value": "/m/0698gv"}, {"text": "JJ Consulting Services", "value": "/g/11fktc4qqq"}, {"text": "Jobline Resources Pte Ltd", "value": "/g/11gp2647pn"}, {"text": "Oracle", "value": "/m/05njw"}, {"text": "Singapore Press Holdings Limited", "value": "/m/0d7mwh"}, {"text": "Temasek Polytechnic", "value": "/m/098s73"}, {"text": "TikTok", "value": "/g/11fy265933"}, {"text": "Zendesk", "value": "/m/0wkm4pl"}, {"text": "A-it Software Services Pte Ltd", "value": "/g/11dxpy_gl_"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "Adecco GS", "value": "/m/08gz46"}, {"text": "Atidan Technologies", "value": "/g/11c74f0b8_"}, {"text": "Autodesk", "value": "/m/018nm3"}, {"text": "Avnet", "value": "/m/0c8xmc"}, {"text": "Biqmind", "value": "/g/11g21fzhrb"}, {"text": "BitTitan", "value": "/g/11dxpksv89"}]}]}