{"search_metadata": {"id": "60827a967d171a5749171134", "status": "Success", "json_endpoint": "https://serpapi.com/searches/4492efaf6f5503db/60827a967d171a5749171134.json", "created_at": "2021-04-23 07:43:18 UTC", "processed_at": "2021-04-23 07:43:18 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28consultant%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=120", "raw_html_file": "https://serpapi.com/searches/4492efaf6f5503db/60827a967d171a5749171134.html", "total_time_taken": 1.2}, "search_parameters": {"q": "(consultant) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "120"}, "jobs_results": [{"title": "Financial Consultant", "company_name": "Confidential Company Name", "location": "Singapore", "via": "via Monster", "description": "1. Full certificate in GCE ‘A’ Level, International Baccalaureate Diploma qualification, diploma awarded by a polytechnic in Singapore or equivalent. Degree holders are preferred.\n2. Good knowledge of banking, wealth management & insurance products is an added advantage\n3. Excellent customer focused mindset\n4. Personable, sincere, strong integrity & determination\n5. At least 21 years old (regulatory requirement)\nAll Prudential Financial Consultants are required to attain CMFAS certifications M5, M9, M9A and CHI", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJGaW5hbmNpYWwgQ29uc3VsdGFudCIsImNvbXBhbnlfbmFtZSI6IkNvbmZpZGVudGlhbCBDb21wYW55IE5hbWUiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImliWFVpY3Y2RTVjbkxLdmhBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTW9uc3RlciIsImxpbmsiOiJodHRwczovL3d3dy5tb25zdGVyLmNvbS5zZy9qb2IvZmluYW5jaWFsLWNvbnN1bHRhbnQtc2luZ2Fwb3JlLTI2NDA1Mjc/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Talent Assessment and Experience, Senior Consultant - HR Consulting", "company_name": "Marsh & McLennan", "location": "Singapore", "via": "via Bayt.com", "description": "At Mercer, we believe in building brighter futures. Together, we’re redefining the world of work, reshaping retirement and investment outcomes, and unlocking real health and well-being. We do this by understanding data and applying it with a human touch across a dynamic Health, Wealth and Career business portfolio. For 75 years, our employees have been turning ideas into action to build healthier and more sustainable futures for our clients, colleagues and communities and people.\n\nTo strengthen our growing business in Singapore, we are looking for talent to join our Talent Solutions business, as an Talent Assessment and Experience Senior Consultant - HR Consulting\n\nMercer Talent Solutions business: Mercer Singapore’s Talent Solutions business helps clients navigate the Future of Work. With the strongest Workforce Products & Insights database the market, we bring Reward and Talent expertise together to improve the way work works – from organization design, to strategic workforce... planning, to identifying future work, skills needed, skill-gaps, action plans for transformation, to performance and total rewards.\n\nTalent Assessment and Experience Senior Consultant - HR COnsulting\n\nOur Culture: Entrepreneurial, Data-hungry, Curious, Energetic and Ambitious\n\nSkills we really care about: Problem-Solving, Creative Thinking, Collaboration, Adaptability\n\nWhat can you expect ?\n• Lead sales and client engagement in talent assessment, employee experience and engagement\n• Provide thought leadership by developing points-of-view and opinion papers as well as research efforts relevant to those areas.\n• Support client engagement and project delivery in other complementary areas, as needed\n\nWe will count on you to\n• Develop assessment strategies, including value differentiators, go-to-market plans and channel management plans for Mercer’s solutions in the practice area\n• Lead business development efforts including the generation of leads and engagement with prospects, build a strong and sustainable business development pipeline\n• Lead proposal shaping, solution design fit to client needs and nurture upselling/ cross-selling client opportunities\n• Lead, direct and guide consulting engagements by providing appropriate guidance to project teams to deliver client value\n• Manage projects to time, quality, budget while building team skills\n• Support team engagement and well-being, build a high performing team\n\nWhat You Need To Have\n• 8-10 years’ experience in HR consulting across various domains such as Talent Management, Assessment, Performance, OD\n• Deep expertise in Talent Assessment, Psychometrics, building upskilling plans and project management\n• Led small and large HR consulting and products sales\n\nWhat Makes You Stand Out\n• Thrive in problem-solving, shaping solutions, understanding and solving for client needs\n• Drive a positive, constructive, engaging work and high-performance culture by espousing appropriate behaviors and inspiring others in the team to do likewise\n• Take ownership in the career development needs and champion the professional development of consultants in the team\n• Champion change management efforts for strengthening Mercer’s overall business and financial performance\n\nAbout Mercer\nMercer builds brighter futures by redefining the world of work, reshaping retirement and investment outcomes, and unlocking real health and well-being. Mercer’s employees are based in 44 countries and the firm operates in over 130 countries. Mercer is a business of Marsh & McLennan (NYSE: MMC), the world’s leading professional services firm in the areas of risk, strategy and people, with 75,000 colleagues and annualized revenue approaching $17 billion. Through its market-leading businesses including Marsh, Guy Carpenter and Oliver Wyman, Marsh & McLennan helps clients navigate an increasingly dynamic and complex environment. For more information, visit www.mercer.com. Follow Mercer on Twitter @Mercer", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJUYWxlbnQgQXNzZXNzbWVudCBhbmQgRXhwZXJpZW5jZSwgU2VuaW9yIENvbnN1bHRhbnQgLSBIUiBDb25zdWx0aW5nIiwiY29tcGFueV9uYW1lIjoiTWFyc2ggXHUwMDI2IE1jTGVubmFuIiwiY29tcGFueV9taWQiOiIvbS8wNTNydyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Imk2U3hOQTRwMkZNS1R3WkhBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2WUJDcmNCUVU1VlgwNXhVelZDYnpZeVJraHhRVFkwWmxKVU5VVk9WazFuVTBZeVJuQkpMVU16ZGt0TWRFRmxVM2x6Ym1sc2VteEdlV3BoV2xSMlpDMWxUMVZrWDI5RVgxWlViMGxMVDFVMlRsQkZUVkZ1WmpSTU1XOWZNVUY1V1hKT1FuZENiRjlVVGxCUVMxZGtRbEZpVmxkU1VFWnlOek40U2pReloyWnNSRGhQUWtwdGVraE5MVll6ZEdwaFZtcFZVbEppUjNKaVUyMTBaMHRTVkVsMVVITlplV3h0Wm1SSmQzUlRVelpNY0RGQk5rMUJkbTUyVFVaWkVoWnNibkZEV1U5RVNVYzViVjkwVVdJeGVHSjVTVUpSR2lKQlQwMVpVbmRDVTBsTWFXaEVXVXB3VGpkRU4xTldkRWd3UWs5c2IxVllNMnhSIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMTEiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQmF5dC5jb20iLCJsaW5rIjoiaHR0cHM6Ly93d3cuYmF5dC5jb20vZW4vc2luZ2Fwb3JlL2pvYnMvdGFsZW50LWFzc2Vzc21lbnQtYW5kLWV4cGVyaWVuY2Utc2VuaW9yLWNvbnN1bHRhbnQtaHItY29uc3VsdGluZy01OTAxNDYwOS8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Consultant", "company_name": "VMware PSO", "location": "Singapore", "via": "via MNC Jobs Singapore | MNC Jobs In Singapore", "description": "Why work for VMware PSO?\n\nThe global VMware Professional Services Organisation (PSO) influences the success of each VMware implementation. We are dedicated to the satisfaction and success of the customer and their SDDC strategy. We ensure that VMware customers are successfully implementing their business plans from adoption all the way to a fully functioning software-defined datacenter.\nWe are committed to offering a collaborative and supportive working environment with a full enablement plan and the opportunity to develop in the latest network and security technologies and solutions. We promote an inclusive atmosphere where your voice will be heard, and where you will be part of a fun, dynamic team working in partnership with each other.\nWe are looking for conscientious and responsible individuals who can build on our successful track record and come with us on the next stage of our journey. We will sponsor your enablement and certification up to and including VCDX... certification.\nWork for the global leader in cloud infrastructure and virtualisation solutions.\nPSO Leadership team talk about the PSO work and why join our team\n\nhttps://www.youtube.com/watch?v=rCGkU0D-1Js\nThe Role:\n\nAs a Consultant (Automation), you work closely with Enterprise Customers on large scale datacenter automation and cloud projects based on VMware technology. You produce best of breed technical designs incorporating VMware and relating products to fulfill Customer requirements. You take technical leadership in the installation and configuration of VMware products with a key focus on integrating and automating the IT landscape.\nYou are an advanced level technology specialist passionate about datacenter and cloud automation. You have advanced competencies in infrastructure or network virtualisation, business critical and cloud native applications, datacenter operations, end user computing and/or public cloud.\nResponsibilities\n• You will be responsible for leading workshops and consulting engagements to critical VMware customers\n• You will conduct pre-packaged VMware consulting solutions in a timely and effective manner\n• You will take ownership of business outcomes of automation projects through requirements capture, guidance and orchestration of development resource and technical governance\n• You will craft detailed design documents and perform hands-on implementation work\n• You will work with our project managers on project budget and all aspects of efficient delivery\n• You will provide technical input and review to our projects in a pre-sales stage\n• You will advise and consult internal groups by providing accurate effort estimations\n• You can display commercial awareness by identifying future services opportunity within a project or customer\n• You actively drive practice activities such as development of standard methodologies, intellectual property capture and creation, quality assurance, and peer reviews\n• You can maintain current knowledge of the entire VMware SDDC product stack\n\nRequired Skills & Experience:\n• Hands on experience with the vRealize Suite - especially vRealize Automation & vRealize Orchestration\n• Demonstrable experience in customer-facing positions as a professional services consultant or engineer, preferably with an IT consulting company or a software vendor\n• Several years recent experience in designing and implementing cloud or datacenter automation solutions\n• Practical workflow development expertise or scripting experience in either Bash, Power Shell, Python, JavaScript, Perl or other languages\n• Practical experience in integrating with 3rd party products using APIs, esp. REST and SOAP\n• ITIL foundation certified or equivalent practical knowledge\n• Bachelors or Masters degree or equivalent technical training\n• Superb communication and interpersonal skills\n• Fluent in English language\n• Experienced in Agile Project Methods\n• VMware Certified Professional in Datacenter Virtualisation or Cloud Management & Automation\n• Openstack Experience\n• Container Technology (Docker, Kubernetes, etc) and Pivotal Cloud Foundry\n• Experience with third party configuration management tools such as Chef, Puppet, or MS System Center Configuration Manager (SCCM)\n\nEqual Opportunity Employer\n\nVMware is an Equal Opportunity Employer and Prohibits Favouritism and Annoyance of Any Kind and value diversity at our company. We do not discriminate on the basis of race, religion, colour, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.\nVMware Company Overview: VMware, we believe that software has the power to unlock new opportunities for people and our planet. We look beyond the barriers of compromise to engineer new ways to make technologies work together seamlessly. Our cloud, mobility, and security software form a flexible, consistent digital foundation for securely delivering the apps, services and experiences that are transforming business innovation around the globe. At the core of what we do are our people who deeply value execution, passion, integrity, customers, and community. Shape what's possible today at http://careers.vmware.com.\n\nEqual Employment Opportunity Statement: VMware is an Equal Opportunity Employer and Prohibits Discrimination and Harassment of Any Kind: VMware is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at VMware are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. VMware will not tolerate discrimination or harassment based on any of these characteristics. VMware encourages applicants of all ages. Vmware will provide reasonable accommodation to employees who have protected disabilities consistent with local law", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDb25zdWx0YW50IiwiY29tcGFueV9uYW1lIjoiVk13YXJlIFBTTyIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoibE44WnNSNTYtZnVQYzlyX0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNTkMgSm9icyBTaW5nYXBvcmUgfCBNTkMgSm9icyBJbiBTaW5nYXBvcmUiLCJsaW5rIjoiaHR0cHM6Ly9zZy5tbmNqb2J6LmNvbS9qb2JzL2NvbnN1bHRhbnQtY2VudHJhbC1zaW5nYXBvcmUtMTUyNjc/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Senior Security Consultant", "company_name": "NCC Group", "location": "Singapore (+1 other)", "via": "via LinkedIn", "description": "Role: Senior Security Consultant\n\nLocation: Singapore\n\nThanks for checking out our job opening; we are excited that you are interested in learning more about NCC Group.\n\nWe are on a mission to make society a safer and more secure place. Our people are the ones who make that possible; a global community of talented individuals working together towards a safer future.\n\nWe aim to create an environment where everyone can reach their full potential. We work together, we are brilliantly creative, we embrace difference and we want you to join our mission.\n\nTake a look at our website here to learn more about why we’re one of the leading global Cyber Security and Risk Mitigation businesses… https://www.nccgroup.com/au/our-services/cyber-security/\n\nThe Opportunity\n• Assist in the identification, resolution and documentation of security incidents\n• Providing technical scoping advice and assisting pre sales where necessary.\n• Conducting focused research when not engaged on client billable... projects.\n• Responsible for adhering to all internal policy and security procedures\n\nThe Challenge\n• 2-3 years’ experience in web app, infra testing (Red team)\n• Proficiency in the use and application of security technologies\n• Ability to travel to clients sites to perform security engagements as required\n• Delivering high quality technical solutions to clients\n• Developing self-skills on internal security projects.\n• Ability to lead technical teams on client engagements\n\nExperience\n• Strong networking and associated protocol knowledge and experience\n• Applied cryptography, mathematics or computer science experience\n• Mobile security knowledge and experience (OS, RF and App)\n• Applied security research\n• Application security threat modelling\n• Cloud Service testing (AWS / Azure)\n• SDLC Implementation and Testing\n• Software development or programming/scripting abilities\n• Source code review\n• Reverse engineering\n• Fuzzing\n\nEssential Skills / Certifications\n• Use of a variety of network security testing tools\n• Identify vulnerabilities and be able to recommend corrective action\n• Ability to explain the output of a penetration test to a non-technical client\n• Industry standard qualifications such as OSCP or CREST CRT\n\nWhat’s in it for you? NCC offers a lot of benefits not limited to:\n• Exposure to industry research and conferences\n• Opportunities for accelerate your career\n• Friendly, supportive environment\n• Flexibility - Working from home\n• Great Singapore location\n• Casual dress code\n\nLife @ NCC\n\nWhat matters to you when you’re looking for your next career move?\n\nWhat about somewhere with incredible and diverse career and development opportunities – where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust – where everyone has a voice? If so, then NCC could be your next career challenge.\n\nIf we have just described you, get excited! You may have just secured yourself an invitation to work within a highly certified, high caliber Cyber Security Team who will welcome your proven record of testing complex systems and critical infrastructure environments.\n\n“NCC Group is an equal opportunities employer and welcomes applications from all sections of society and does not discriminate on grounds of race, religion or belief, ethnic or national origin, disability, age, marital, domestic or civil partnership status, sexual orientation, gender identity, or any other basis as protected by applicable law.”", "extensions": ["13 hours ago", "Full–time"], "detected_extensions": {"posted_at": "13 hours ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU2VjdXJpdHkgQ29uc3VsdGFudCIsImNvbXBhbnlfbmFtZSI6Ik5DQyBHcm91cCIsImNvbXBhbnlfbWlkIjoiL20vMGNxang3MyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjNrMi1fTENDRHV2bjZRbThBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhWR2RmVG5kdFJuSnNNbXRoUkd4NVRFOVFNaTFPVlRZMlVWSkpjMGgzTjNwV1YyTTVWRFZGWjFwWFFUTlZWR2RJTnpaZmVrSkhUbGxGTFMxelNubFVkRTgwWHpSM05pMHdjMlF0VDJNNVFWUXlYM1o0YzI1MWFrUnFhRGxGZW5aemJXNVpkR1ZEZURaa2VuRjZNSFJQTXkxYWRIcE9lak5aUTNSSlUwWnZXbFZ6UVZObWMxWlpSWEJzTFVGUFRsTnlUV1ZKUVMxS1psZENWWFZCRWhac2JuRkRXVTlFU1VjNWJWOTBVV0l4ZUdKNVNVSlJHaUpCVDAxWlVuZERSWHBXVm5SR2QzazNXV3RCYUd4RldtSkJjbVowY0V0dGMxVlIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18yMiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL3NnLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvc2VuaW9yLXNlY3VyaXR5LWNvbnN1bHRhbnQtYXQtbmNjLWdyb3VwLTI1MTU3NDk1Njg/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Network Engineer | Up to 6k | EAST", "company_name": "Achieve Career Consultant Pte Ltd", "location": "Singapore (+1 other)", "via": "via Joblum Singapore", "description": "• Up to $6000\n• 1 year contract with completion bonus upon renewal (Renewable/Convertible)\nOur Client is a well-known and established company in integrated security. They are looking for Network Engineer.\nRESPONSIBILITIES:\n• Implement and Support Network LAN/WAN infrastructure and firewall\n• Review and implement complex changes and device upgrades in critical environments\n• Provide network fault investigation, troubleshooting, resolution, recovery and root cause analysis.\n• Monitors and identifies IT system abnormalities, resolves problems, or escalates to relevant parties for help\n• Provides technical support during disaster recovery, contingency test, scheduled maintenance, system change requests, software installation, network equipment problems, etc.\n• Supports delivery of data-centre services including co-location, telecommunications services, and deployment of additional services to customers\nREQUIREMENTS:\n• Clear up to Cat 2A.\n• Minimally CCNA/CCNP certified\n• Minimum 1 year... experience\n• Knowledge of F5/Palo Alto firewall/Checkpoint firewall/Alcatel switch/Nexus\nOTHER INFORMATION:\nLocation : Multiple Location\nWorking days : 5 days work week - Monday to Friday (9.00am to 6.00pm)(24/7 Standby)HOW TO APPLY:\nSimply submit your application with your updated Resume in MS Word Format to Grace Peh Chia Jin (EA Personnel Reg. No.: R1988731) grace.peh@achievegroup.asia\nPls refer and access our website at https://www.achievegroup.asia/privacy-policy/ for more information. EA License No: 05C3451 EA Personnel No: R1988731 EA Personnel Name: Grace PEH", "extensions": ["2 days ago", "$4.5K–$6K a month", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time", "salary": "$4.5K–$6K a month"}, "job_id": "eyJqb2JfdGl0bGUiOiJOZXR3b3JrIEVuZ2luZWVyIHwgVXAgdG8gNmsgfCBFQVNUIiwiY29tcGFueV9uYW1lIjoiQWNoaWV2ZSBDYXJlZXIgQ29uc3VsdGFudCBQdGUgTHRkIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJieEJXRTE4N1pMX1UwZ050QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYmx1bSBTaW5nYXBvcmUiLCJsaW5rIjoiaHR0cHM6Ly9zZy5qb2JsdW0uY29tL2pvYi9uZXR3b3JrLWVuZ2luZWVyLXVwLXRvLTZrLWVhc3QvNjI4NDI2P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Relationship Manager/Financial Consultant (Banking)", "company_name": "Morgan McKinley", "location": "Singapore (+1 other)", "via": "via Management Consultants Career Center", "description": "Job Summary\n• Singapore\n• Permanent\n• BBBH774842\n• Mar 27, 2021\n• Competitive\nJob Description\nMorgan McKinley is working in partnership with a well-established bank providing banking services and financial solutions.\n\nThe successful candidate will provide sound wealth management and financial advisory services to customers to make informed decisions to achieve their life goals.\n\nResponsibilities:\n• Advise on personal banking and financial products and services\n• Provide holistic financial planning advice to the customers.\n• Identify suitable financial solutions offered by the bank to meet customers' financial goals.\n• Adhere to the banking regulations, rules and guidelines when conducting business.\nRequirements:\n• At least diploma/degree in any discipline\n• Interest in sales or banking and wealth management or customer service\n• Excellent communication and listening skills\nBenefits:\n• Remuneration package: Basic salary + Attractive Commission\n• Excellent career growth opportunity... within the organisation\n• Training provided and covered\nInterested candidates who wish to apply for the advertised position, please click \"Apply Now\" or email an updated copy of resume to Alvin at alau@m3ssolutions.com to apply.\n\nEA Licence No: 11C5502\nEA Registration Number: R1874110", "extensions": ["13 days ago", "Full–time"], "detected_extensions": {"posted_at": "13 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJSZWxhdGlvbnNoaXAgTWFuYWdlci9GaW5hbmNpYWwgQ29uc3VsdGFudCAoQmFua2luZykiLCJjb21wYW55X25hbWUiOiJNb3JnYW4gTWNLaW5sZXkiLCJjb21wYW55X21pZCI6Ii9nLzExYzU4cmY1MHMiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJSWndYTXpxYk9qMkNDZTUtQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdllCQ3JjQlFVNVZYMDV4VTJWR1dHUkhhbFpNVVhNNU9GZHRURWh3YTBGeVRVMU9TVGc1TkhOQ1kzbENlQzFKTjJWdWVqaHpUSFl3VkZWd1VrTjVaRU5CUWxORFoyZGhTblZGUjFaMFUxVklOR2h2TkZsMU1reExhVk4yU0ZVM09XVjJXR1IxTlZaTGFIZHlWRlY1Y0hOa1pXeFJWRTl3WWxoTVJtWm5kVm96WkZSNk4xSkVTekV0TkZoek4yTTFTVVYwU2pKaVdrZzJWRXhtYWxwMVIyMHdZUzF4YVVZMlNHNTVMWFZuV1d3eGRHMVZSMEpDWlZGTmRtVlpFaFpzYm5GRFdVOUVTVWM1YlY5MFVXSXhlR0o1U1VKUkdpSkJUMDFaVW5kQmMwbFVXbmhEVmt4UlkwTlVZa2h3TVVGVVYxQXhSbmg0VDFabiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzMzIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1hbmFnZW1lbnQgQ29uc3VsdGFudHMgQ2FyZWVyIENlbnRlciIsImxpbmsiOiJodHRwczovL2NhcmVlcnMuYnVzaW5lc3NjZXJ0aWZpY2F0aW9uLm9yZy9qb2JzLzE0NjY4NzU3L3JlbGF0aW9uc2hpcC1tYW5hZ2VyLWZpbmFuY2lhbC1jb25zdWx0YW50LWJhbmtpbmc/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Principal SAP HR Consultant", "company_name": "Agensi Pekerjaan Spring Professional  Sdn Bhd", "location": "Singapore (+1 other)", "via": "via Jobs | Fidanto", "description": "Job Description : Main Duties & Responsibilities The incumbent will be working as an individual contributor to the organization, providing supporting to ensure that the system is up to date and ensuring its availability. The incumbent is also expected to working with business stakeholders on design changes and provide functional advise to the end users. Other Roles & Responsibilities To support, manage and provide technical solution to SAP Modules HR/e-HR/Payroll Perform configuration change to SAP modules according to business requirements Provide SAP Functional (HR/e-HR/Payroll) configuration to accommodate design requirements Provide functional consultancy and support to end-users requirements Assist in troubleshoot operational issues Work with infrastructure team to ensure SAP system uptime of > 99% Ensure ERP system complies with SOX security requirement Drive continuous improvement in work processes and environment to achieve assigned section/department and/or company KPI Mentor... and coach junior staff Candidate Profile A Degree qualification in a relevant discipline Certified SAP Consultant in HR/Payroll is preferred At least 8 years of relevant experiences in SAP environment and has done at least 2 full SAP implementation cycle Understand overall SAP R/3 features and functionalities Experience in Success Factor would be a PLUS Able to lead SAP implementation projects in areas such as process analysis, design, prototype/implementation, system/report interface, testing, conversion, user testing and post-production support Knowledge in Software Development Life Cycle Process Skill in developing basic ABAP programs Skill in Business Process mapping Evaluate, test and approve proposed changes to the applications in the area Knowledge in multiple SAP modules will be an added advantage What to Expect Our client offers the benefits of a work environment that is stimulating, challenging and balanced. You will be working in a fast paced and global organization. Interest & Apply Advance your career to the next level with this unique opportunity in Singapore. To further consult on this role, please reach out to Jingheng via Jingheng.SimSpringasia.com for a confidential chat. Posted By Sim Jingheng Manager – Information Technology EA License No: 09C5803 Personnel Registration Number: R1434838 Job Description : Main Duties & Responsibilities The incumbent will be working as an individual contributor to the organization, providing supporting to ensure that the system is up to date and ensuring its availability. The incumbent is also expecte Experience: 8.00-11.00 Years", "extensions": ["4 days ago", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcmluY2lwYWwgU0FQIEhSIENvbnN1bHRhbnQiLCJjb21wYW55X25hbWUiOiJBZ2Vuc2kgUGVrZXJqYWFuIFNwcmluZyBQcm9mZXNzaW9uYWwgIFNkbiBCaGQiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjdRd3RPc0U1Y3lmbUk0UFZBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9icyB8IEZpZGFudG8iLCJsaW5rIjoiaHR0cHM6Ly9zZy5maWRhbnRvLmNvbS9qb2JzL2pvYi1vcGVuaW5nL2luZm9ybWF0aW9uLXRlY2hub2xvZ3ktcHJvamVjdC1tYW5hZ2Vycy9wcmluY2lwYWwtc2FwLWhyLWNvbnN1bHRhbnQtMjc2OTYwMDQ2P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Cyber Security (Financial Services) Senior Consultant, Technology Consulting", "company_name": "Ernst & Young (EY)", "location": "Singapore (+1 other)", "via": "via NodeFlair", "description": "This is a role where no two days are the same – so you’ll find yourself taking on plenty of new responsibilities as you go. You’ll work alongside clients and colleagues, balancing your time between developing security strategies, advising stakeholders, providing workshops and supporting business development. If you’re flexible and ready to adapt to a constantly changing environment, there’s no better place to develop your skills. Since you’ll be working directly with clients, some travel will be required.\n\nResponsibilities, Qualifications, Certifications - External\nYour Key Responsibilities\n\nAs a Cyber Security Senior Consultant, you will be part of the team to assess, design, build, implement and manage security solutions for our clients and support the clients in their desire to protect the business. You will belong to an international connected team of specialists helping our clients with their most complex information security needs and contributing toward their business... resilience.\n\nSkills and Attributes for Success\n• Experience in delivering multiple security projects and solutions across one or more of the following domains: (Information Security domains: Cyber Program Management, Cyber Threat Management, Identity & Access Management, Data Protection, Privacy, Security Operations and Cyber Analytics.) This experience should include both advisory, implementation and operation experience\n• Understand security concepts and how they apply to business and technology solutions\n• Be able to articulate threats and risk to business and technology leaders\n• Understand project management concepts and how they can be applied to security related projects\n• Strong technical security skills in assessment, design, implementation, architecture, and program / project delivery and work across various delivery models, (Waterfall, Agile, DevOps)\n\nTo Qualify for the role, you must have\n• A recognized university degree in Computer Science, Computer/Electrical Engineering, Information Technology or equivalent\n• At least 3 years of relevant experience. Preferably with a year experience in business consulting role in a leading consultancy firm\n• Possess a CISSP certification preferred\n• Mandatory skills: Threat Modelling and Cloud Technical Risk Assessment knowledge\n• Strong interest in the field of information security\n• Creative, independent with good problem-solving skills\n• Excellent communicator with strong analytical, interpersonal and writing skills\n\nIdeally, you’ll also have\n• Industry related certification preferred (e.g. CISA, CISM, SABSA, PRINCE2, TOGAF, ITIL).\n• Solution Level Certifications, OSCP, CREST, GIAC would be advantageous, as well as penetration testing experience.\n• Solution design of Threat & Vulnerability Management solutions such as implementation of SIEM (e.g. ArcSight), Incident Response (e.g. Resilient) & Security Analytics (e.g. RSA Security Analytics) within the context of a Security Operating Centre framework\n• Familiar with at least one of the following IAM technologies such as SailPoint, RSA Aveksa / VIA & Oracle (OIM, OIA)\n\nWhat we look for\n\nHighly motivated individuals with excellent problem-solving skills and the ability to prioritize shifting workloads in a rapidly changing industry. An effective communicator, you’ll be a confident team player that collaborates with people from various teams while looking to develop your career in a dynamic organization.\n\nWhat we offer\n• Continuous learning: You’ll develop the mindset and skills to navigate whatever comes next.\n• Success as defined by you: We’ll provide the tools and flexibility, so you can make a meaningful impact, your way.\n• Transformative leadership: We’ll give you the insights, coaching and confidence to be the leader the world needs.\n• Diverse and inclusive culture: You’ll be embraced for who you are and empowered to use your voice to help others find theirs.\n\nIf you can demonstrate that you meet the criteria above, please contact us as soon as possible.\n\nThe exceptional EY experience. It’s yours to build.\n\nApply now", "extensions": ["22 days ago", "Full–time"], "detected_extensions": {"posted_at": "22 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDeWJlciBTZWN1cml0eSAoRmluYW5jaWFsIFNlcnZpY2VzKSBTZW5pb3IgQ29uc3VsdGFudCwgVGVjaG5vbG9neSBDb25zdWx0aW5nIiwiY29tcGFueV9uYW1lIjoiRXJuc3QgXHUwMDI2IFlvdW5nIChFWSkiLCJjb21wYW55X21pZCI6Ii9tLzBnOWpjIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiMEJHV0Q2MTNteXAxZnJha0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZZQkNyY0JRVTVWWDA1eFZFdHNNVFJIZGs1S1NpMDVaVmx6VUdkSldYVjZkWEp5UlU4MVZtZzRTSEJWYjBKMGJDMU9OMHhoTTFOR00yMURiMDkxZFRsbVVGQkJaVlEwZGtodVlVaFdaVFJEUzFGMmJHUmpXWEozT0VJNFNreFJaelV5YW05c1VITmxiRE15V2xkSVNFSmZkMHhTVFZsa01UVjJXVWhJWkROQlJrSkZUbFJqUW5sbVVFMU1SelZoYVVreGFtZDZSRUp5VERWMFNqTktaVkYyWTFWU1NqSnpTRlk0ZVRjeVltZEljamx6ZDJOa1NFb3pkMVozRWhac2JuRkRXVTlFU1VjNWJWOTBVV0l4ZUdKNVNVSlJHaUpCVDAxWlVuZERXVGhIUWpRd1RWRjZjRk5DWlhaSGNIUXRTMjA0Y0dWNk0zUkIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY180NSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBOb2RlRmxhaXIiLCJsaW5rIjoiaHR0cHM6Ly9ub2RlZmxhaXIuY29tL2pvYnMvbGlzdGluZ3MvMTA4Mzk/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "D365 Business Central ERP Functional Consultant", "company_name": "IQ Dynamics Pte Ltd", "location": "Singapore (+1 other)", "via": "via JobsCentral", "description": "The successful candidate will be responsible for the overall direction, coordination, implementation, execution, control and completion of Dynamics 365 Business Central, ensuring consistency with company strategy, commitments and goals.\n\nJob Descriptions\n• Design, Test, Train, Implement, and Support customizations in Dynamics 365 BC for new and existing customers\n• Provide support to reconcile and fix Dynamics 365 BC data, as required\n• Identify software or service opportunities including training, modules, business process consulting, and development\n• Document and communicate issues, risks, and changes within in D365 BC project management software\n• Coordinate application updates, hotfixes, and upgrades to existing customers\n• Backup role for Application Support Desk and escalated support issues\n• Assist with creating and maintenance of internal and external product training curriculums and documentation\n\nRequirements\n• Diploma or University degree in Information Technology... Computer Science, Accountancy, or related disciplines;\n• Minimum 2 to 3 years’ experience in project delivery and implementation, preferably ERP packages\n• Well experienced in working on design, configuration, training and support of Dynamics 365 Business Central and/or Dynamics NAV.\n• Knowledge about setting up NAV/D365 BC on-premise as well as on cloud environment.\n• Sharepoint and Azure LCS knowledge is a plus\n• Great communication and problem-solving skills\n• Highly self-motivated and directed, keen attention to detail\n• Ability to work in fast-paced environment running multiple tasks under tight deadlines\n• Exceptional customer service orientation\n• Extensive experience working in a team-oriented, collaborative environment", "extensions": ["2 days ago", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEMzY1IEJ1c2luZXNzIENlbnRyYWwgRVJQIEZ1bmN0aW9uYWwgQ29uc3VsdGFudCIsImNvbXBhbnlfbmFtZSI6IklRIER5bmFtaWNzIFB0ZSBMdGQiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6InJsQ05kY2hwWERVcWdIdFVBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9ic0NlbnRyYWwiLCJsaW5rIjoiaHR0cHM6Ly9qb2JzY2VudHJhbC5jb20uc2cvam9iL2QzNjUtYnVzaW5lc3MtY2VudHJhbC1lcnAtZnVuY3Rpb25hbC1jb25zdWx0YW50LWozczV0dDZudjQzNnY3MmI2d3Y/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Systems Consultant (Infrastructure and Database Department) [NIE]", "company_name": "National Institute Of Education", "location": "Singapore (+1 other)", "via": "via Glints", "description": "The Academic Computing and Information Services (ACIS) at the National Institute of Education (NIE) invites suitable candidates to serve as a Systems Consultant in the Infrastructure and Database Department. This is a contract position and will expire by 31 Mar 2023.\n\nJob Description\n• Manage and support the delivery of in-house and outsourced IT projects and services to meet IT initiatives of academic and research users.\n• Manage and support the in-house research operations and management system and provide awareness and training to the academic and research community.\n• Provide technical advice and consultancy to the academic and research community on IT policy, proposal, procurement and all IT-related matters.\n• Plan, design, implement, manage and maintain the server, storage and virtualised infrastructure deployed in the data centre.\n• Manage system availability, capacity, incident, problem resolution and asset lifecycle management.\n• Develop and review research-related policies... procedures and documentation for research operations and management, and server, storage and virtualisation platform.\n• Evaluate, recommend and acquire systems and products for the Institute.\n• Provide IT support for research conferences and standby technical support outside office hours.\n• Participate in developing and implementing business continuity and disaster recovery plans.\n• Work on weekend occasionally for preventive maintenance and project related activities, provide on-call rotational support coverage and 24-hour response for emergencies.\n\nRequirements\n• A Degree in Computer/Electrical/Electronics Engineering or its equivalent.\n• At least 2 years of project management and business process management experience in a research environment.\n• 2 to 3 years’ working experience in server, storage administration and virtualisation management.\n• Working knowledge in the administration of CMS (WordPress, Joomla, Moodle, Drupal), research tools (EndNote, SAS, SPSS, NVivo), Microsoft products (Active Directory, SharePoint, SQL) and VMware products (vSphere, vCenter).\n• Working knowledge of Server and Storage technologies, Virtualization, SAN, NAS, zoning, LUN masking, NFS, CIFS and replication technologies.\n• Experience in ISO 22301 Business Continuity Management System and ISO 27001 Information Security Management System are preferred.\n• Certifications such as CITPM, PMP, VCP, ITIL and CCNA are preferred.\n• Self-motivated team player with positive attitude and ability to work independently.\n• Strong analytical and problem solving skills.\n• Good communication, interpersonal and presentation skills.\n• Experience working in a research environment and knowledge of research processes will be an advantage.\n\nInterested candidates, please click here to apply", "extensions": ["23 days ago", "Full–time"], "detected_extensions": {"posted_at": "23 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTeXN0ZW1zIENvbnN1bHRhbnQgKEluZnJhc3RydWN0dXJlIGFuZCBEYXRhYmFzZSBEZXBhcnRtZW50KSBbTklFXSIsImNvbXBhbnlfbmFtZSI6Ik5hdGlvbmFsIEluc3RpdHV0ZSBPZiBFZHVjYXRpb24iLCJjb21wYW55X21pZCI6Ii9tLzA5dGRqYyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IlZpc3ljZmRPMVE4V1JfQndBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVvc0NDc3dCUVU1VlgwNXhWR1pyU0hsTk0yTnpOVXROU3kwM00xRk1WR2hMVkhwdlN6aEljWHBoWVdNMFgwRTJTVnB4WXpCVVFscEVTMUkxV0V3dGVtcE9UMngxWVVGVWRtNXNkWEpsUkZvM0xUSm1VR2hQZFZSeVMzSmxlbTFEVDJORVZEaDVVVzVLU20xTFltZHRhMjlYYzBselNIcGlXVFJHUzFBNE9HWk9jV3hYV0hGaldrMWZlRFpmTkdRd2F5MHdPR2RIVGxSRVJqUllWRzlyZUc1WUxVMW5SR1JsVjI0M1JrdzVUVVZtVG1SQmFuQkVla0ZUZGpGVFpYZFpObk01UTI0d2IyUkdSVWMyWW5ocWRGOU9FaFpzYm5GRFdVOUVTVWM1YlY5MFVXSXhlR0o1U1VKUkdpSkJUMDFaVW5kQ01rSlVPVTVOZWtwbU5EZDRNbms1Um5GWWQzbzFUbUY1UVV4biIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzU5IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEdsaW50cyIsImxpbmsiOiJodHRwczovL2dsaW50cy5jb20vb3Bwb3J0dW5pdGllcy9qb2JzL3N5c3RlbXMtY29uc3VsdGFudC1pbmZyYXN0cnVjdHVyZS1hbmQtZGF0YWJhc2UtZGVwYXJ0bWVudC1uaWUvYjc0ZTM3ZjctOWJiNC00MjczLTk0NzctYjVhM2RkNWRjNzNiP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Business Operations", "value": "GC06"}, {"text": "Human Resources", "value": "GC15"}, {"text": "Accounting and Finance", "value": "GC01"}, {"text": "Sales and Retail", "value": "GC26"}, {"text": "Protective Services", "value": "GC23"}, {"text": "Science and Engineering", "value": "GC27"}, {"text": "Management", "value": "GC18"}, {"text": "Advertising and Marketing", "value": "GC03"}, {"text": "Legal", "value": "GC17"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Customer Service", "value": "GC10"}, {"text": "Social Services and Non-Profit", "value": "GC28"}, {"text": "Art, Fashion and Design", "value": "GC05"}, {"text": "Healthcare", "value": "GC14"}, {"text": "Energy and Mining", "value": "GC21"}, {"text": "Sports Fitness and Recreation", "value": "GC29"}, {"text": "Education", "value": "GC11"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "Consultant", "value": "consultant"}, {"text": "Senior consultant", "value": "senior consultant"}, {"text": "Security consultant", "value": "security consultant"}, {"text": "Recruitment consultant", "value": "recruitment consultant"}, {"text": "Lead consultant", "value": "lead consultant"}, {"text": "Associate consultant", "value": "associate consultant"}, {"text": "Principal consultant", "value": "principal consultant"}, {"text": "Associate", "value": "associate"}, {"text": "Financial consultant", "value": "financial consultant"}, {"text": "Functional consultant", "value": "functional consultant"}, {"text": "Presales consultant", "value": "presales consultant"}, {"text": "Technical consultant", "value": "technical consultant"}, {"text": "Application consultant", "value": "application consultant"}, {"text": "Devops consultant", "value": "devops consultant"}, {"text": "Pre-sales consultant", "value": "pre-sales consultant"}, {"text": "Consultants", "value": "consultants"}, {"text": "Development consultant", "value": "development consultant"}, {"text": "Engineer", "value": "engineer"}, {"text": "Hr consultant", "value": "hr consultant"}, {"text": "It consultant", "value": "it consultant"}, {"text": "Senior", "value": "senior"}, {"text": "Services consultant", "value": "services consultant"}, {"text": "Solution consultant", "value": "solution consultant"}, {"text": "Solutions consultant", "value": "solutions consultant"}, {"text": "Business", "value": "business"}, {"text": "Business consulting", "value": "business consulting"}, {"text": "Consulting", "value": "consulting"}, {"text": "Director", "value": "director"}, {"text": "Education consultant", "value": "education consultant"}, {"text": "Hcm consultant", "value": "hcm consultant"}, {"text": "Infrastructure", "value": "infrastructure"}, {"text": "Investment consultant", "value": "investment consultant"}, {"text": "Manager", "value": "manager"}, {"text": "Project manager", "value": "project manager"}, {"text": "Recruitment consultants", "value": "recruitment consultants"}, {"text": "Sap consultant", "value": "sap consultant"}, {"text": "Software engineer", "value": "software engineer"}, {"text": "Specialist", "value": "specialist"}, {"text": "Support consultant", "value": "support consultant"}, {"text": "Systems consultant", "value": "systems consultant"}, {"text": "Systems engineer", "value": "systems engineer"}, {"text": "Technology consulting", "value": "technology consulting"}, {"text": "Academy", "value": "academy"}, {"text": "Accountant", "value": "accountant"}, {"text": "Architect", "value": "architect"}, {"text": "Cloud consultant", "value": "cloud consultant"}, {"text": "Consultancy", "value": "consultancy"}, {"text": "Data engineer", "value": "data engineer"}, {"text": "Deputy director", "value": "deputy director"}, {"text": "Electrical engineer", "value": "electrical engineer"}, {"text": "Employee", "value": "employee"}, {"text": "Finance consultant", "value": "finance consultant"}, {"text": "Financial services", "value": "financial services"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Internship", "value": "INTERN"}, {"text": "Part-time", "value": "PARTTIME"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Accounting", "value": "/business/naics2007/5412"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Engineering Services", "value": "/business/naics2007/5413"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Real Estate", "value": "/business/naics2007/53"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Wholesale", "value": "/business/naics2007/42"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "SingTel", "value": "/m/020zfl"}, {"text": "EY", "value": "/m/0g9jc"}, {"text": "Infosys", "value": "/m/01k8x6"}, {"text": "SearchAsia Consulting Pte Ltd", "value": "/g/11fy260nhz"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "Deloitte SEA", "value": "/g/11f_g4x9d_"}, {"text": "Geco Asia", "value": "/g/11gk72_bt_"}, {"text": "OAKTREE CONSULTING", "value": "/g/11g70jfhtq"}, {"text": "Central Provident Fund Board", "value": "/m/0615qb"}, {"text": "NCS", "value": "/m/0282746"}, {"text": "Trustwave", "value": "/m/0n3xjf5"}, {"text": "Ensign InfoSecurity", "value": "/g/11g4jhymjr"}, {"text": "HCL SINGAPORE PTE. LTD.", "value": "/g/11fy25ngsv"}, {"text": "Horangi", "value": "/g/11fm41wdh3"}, {"text": "LINKBYNET", "value": "/g/11f00s44gb"}, {"text": "NTT", "value": "/m/05mybp8"}, {"text": "RECRUIT EXPRESS PTE LTD", "value": "/g/11g706hzhq"}, {"text": "Randstad", "value": "/m/08pt1z"}, {"text": "Randstad Singapore", "value": "/g/11g70b50mr"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "UBS", "value": "/m/031rxp"}, {"text": "Xcellink Pte Ltd", "value": "/g/11c73prcqy"}, {"text": "Alight", "value": "/g/11fj9r012s"}, {"text": "Avanade", "value": "/m/094456"}, {"text": "Avensys Consulting", "value": "/g/11g7022gjf"}, {"text": "CBRE", "value": "/m/090r7m"}, {"text": "Golder", "value": "/m/02qx9bq"}, {"text": "Hitachi Solutions", "value": "/g/121lyvj9"}, {"text": "IBM", "value": "/m/03sc8"}, {"text": "Marsh & McLennan", "value": "/m/053rw"}, {"text": "Mott MacDonald", "value": "/m/043l4j"}, {"text": "NTT Ltd.", "value": "/m/01c3fq"}, {"text": "Qualtrics", "value": "/m/080nnft"}, {"text": "SAP", "value": "/m/01pf4l"}, {"text": "Techcom Solutions Pte Ltd", "value": "/g/11c73vztx3"}, {"text": "Turner & Townsend", "value": "/m/0cfy6xp"}, {"text": "Thatz", "value": "/g/11dxpx4g1l"}]}]}