{"search_metadata": {"id": "608279f6a4bb38705e2f8d06", "status": "Success", "json_endpoint": "https://serpapi.com/searches/42da31a72a113414/608279f6a4bb38705e2f8d06.json", "created_at": "2021-04-23 07:40:38 UTC", "processed_at": "2021-04-23 07:40:38 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28solution+architect%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=90", "raw_html_file": "https://serpapi.com/searches/42da31a72a113414/608279f6a4bb38705e2f8d06.html", "total_time_taken": 1.16}, "search_parameters": {"q": "(solution architect) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "90"}, "jobs_results": [{"title": "Unicorn Cloud Solution Architect - Data & AI", "company_name": "Microsoft", "location": "Singapore", "via": "via Microsoft Careers", "description": "Microsoft is on a mission to empower every person and every organization on the planet to achieve more. Our culture is centred on embracing a growth mindset, a theme of inspiring excellence, and encouraging teams and leaders to bring their best each day. Growth mindset encourages each of us to lean in and learn what matters most to our customers, to create the foundational knowledge that enables us to make customer-first decisions in everything we do. In doing so, we create life-changing innovations that impact billions of lives around the world. You can help us achieve our mission.\n\nAzure is the most comprehensive, innovative, and flexible cloud platform today and Microsoft is hiring professionals that will drive customer cloud adoption within the most important companies in the market. We are always learning. Insatiably curious. We lean into uncertainty, take risks, and learn quickly from our mistakes. We build on each other’s ideas because we are better together. We stand in awe of... what humans dare to achieve and are motivated every day to empower others to do more and achieve more through our technology and innovation. Together we make a difference.\n\nTo learn more about Microsoft’s mission, please visit: https://careers.microsoft.com/mission-culture\n\nCheck out all of our products at: http://www.microsoft.com/en-us\n\nAbout the Team\n\nThe GSMO Digital Transformation Partnership organization is embarking on an effort to identify and engage with late stage start-ups and Unicorns to secure long lasting partnerships with such organizations and get them to utilize the benefits of our platforms and leverage the advantages of our business model. This effort will involve close alignment with the WW Business development and ISV organizations and deep collaboration with the subsidiary and area teams.\n\nIn this context, we are establishing two teams, a business development team formed primarily of Business Development Manager, Account Technology Strategists, and a technical team formed primarily of Cloud Solution Architects. The teams will be distributed into regional PODs in Europe, Israel, and Singapore.\n\nThe collective responsibility of the Unicorn team is:\n• Leading and shaping the future of high potential late stage startups and unicorns based on globally set selection criteria.\n• Assessing external data identifying those unicorns and late stage, qualifying them based on status, scores, cost of complexity and acquisition as well as internal Microsoft relationship and relevance (any upcoming ISV that can scale and go big)\n• Engaging with this segment to prioritize the right alignment for increasing Unicorn customer velocity.\n• Building strategic partnerships at the right time, with those unicorns to accelerate their growth and build new solutions.\n• Onboarding the selected ones on Azure platform, designing and helping to migrate and increase consumption while striking the right goals for unicorns.\n• Envisioning new industry scenarios and business models with the unicorns\n\nAbout the Role\n\nWe are looking for a highly motivated and passionate Data Platform & Advanced Analytics/Artificial Intelligence Cloud Solution Architect to drive high priority customer initiatives on the Microsoft Azure Platform in collaboration with customers and the Microsoft field for the Unicorn and Late-stage customers across APAC.\n\nThis is a customer facing role, owning overall technical relationship between customer and Microsoft Data, Advanced Analytics and Artificial Intelligence Platform. You will own the Data Platform & Advanced Analytics technical customer engagements including\n\narchitectural design sessions, specific implementation projects and/or pilots. In this role, you will serve as the trusted advisor technically to our most strategic late-stage startups and unicorns.\n\nThe ideal candidate will have experience in customer-facing roles and success leading deep technical architecture discussions with senior customer executives, Data Architects, Data Science teams and Developers to drive Data Platform and Advanced Analytics solutions to production", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJVbmljb3JuIENsb3VkIFNvbHV0aW9uIEFyY2hpdGVjdCAtIERhdGEgXHUwMDI2IEFJIiwiY29tcGFueV9uYW1lIjoiTWljcm9zb2Z0IiwiY29tcGFueV9taWQiOiIvbS8wNHN2NCIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IncyTmhTc0psMkZhWXJUUVZBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhWSEpyVUZCWFl6aExORjlWVjB4UllUUjZTQzFxVW5kNU4xQmFTUzFZWldwTFpVeFFSRzk2ZDJaMVVGRTFPSFpRT1ZwYWVYaHFObGhOYmw5TE0yRkdUMWRzUWxVek0wRjVORkpaYUVWd1RUWTVabmh6UWsxTU5VNVpiV0ZETFhOUk0wOVdZMXBXY2xoZlpFTnNTMTl0U1U4Mk5WaGFWbXBFWkVkMFZUZHhOSHByWWpoUmJGTjFSVlZsUjBSd1VGbFFVVTFUUVVSUlZWaElTSGRCRWhZNWJtMURXVTFFZGtsdlQzaDBRV0ZKTkdGTVdVUm5HaUpCVDAxWlVuZEVUbU00V1dGTFFuaGFZM1JVVUV0aE4yeFNNbWhKY0VwalZEZG4iLCJmY3YiOiIzIiwiZmNfaWQiOiJmY183IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1pY3Jvc29mdCBDYXJlZXJzIiwibGluayI6Imh0dHBzOi8vY2FyZWVycy5taWNyb3NvZnQuY29tL3VzL2VuL2pvYi8xMDA1OTEzL1VuaWNvcm4tQ2xvdWQtU29sdXRpb24tQXJjaGl0ZWN0LURhdGEtQUk/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Cloud Solutions Architect", "company_name": "Qurinom Solutions", "location": "Singapore", "via": "via Neuvoo", "description": "Qurinom Solutions is a global product cum service-based IT start-up empowered with Innovative Research & Development, Implementation and Rapid Delivery.\n\nWe specialise in Artificial Intelligence, IoT and Embedded Systems based Android & IOS Mobile Applications, UX/UI Modernization, Cloud Migration, Digital Transformation, Healthcare Services, Structural & Interior Design and also render services for hedge clients over cutting edge technologies, Digital Marketing Services across the cross-functional Domains.\n\nWe believe in the power of ideas and are confident to provide reliable and comprehensive solutions to the present and upcoming challenges in the IT era across the globe.\n\nThe Role\n\nYou will be responsible for :\n• Leading the development team through the software life-cycle to deliver systems and applications.\n• Ensuring the development of well-designed and testable code.\n• Providing code documentation and other inputs to technical documents.\n• Defining project scope ... specifications, estimating resources required to develop the proposed solution to meet customer requirements and developing schedules, test plans and documentation.\n• Ensuring specifications and requirements are clearly articulated to the development teams and monitoring timelines & progress.\n• Gathering requirements and specifications from clients and users in conjunction with the sales team to gain a strong understanding of client expectations.\n• Identifying potential issues between systems and client specifications and proposing new solutions.\n• Proposing the technical solution and overseeing the selection of technologies.\n• Providing clients with regular feedback and updates on projects.\n• Providing subject matter expertise and direction, guidance, and support on complex sales engagements.\n• Reviewing proposals and estimates from vendors and ensuring that external solutions work with internal development projects.\n\nIdeal Profile\n• You possess a Degree/Diploma in Computer Science, Engineering or related field.\n• You have prior experience, ideally within a Solution Architect or Software Architect role.\n• You have strong interpersonal and communication skills and are adept at working with multiple stakeholders to drive desired outcomes.\n• Expertise in Cloud Computing and Configuration Management tools (Chef, Ansible, Puppet etc.) would be highly valuable.\n• You are highly goal driven and work well in fast paced environments\n• You are a strong team player who can manage multiple stakeholders\n• You are adaptable and thrive in changing environments\n\nWhat's on Offer?\n• Work alongside & learn from best in class talent\n• Excellent career development opportunities\n• Attractive salary & benefits", "extensions": ["29 days ago", "Full–time"], "detected_extensions": {"posted_at": "29 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDbG91ZCBTb2x1dGlvbnMgQXJjaGl0ZWN0IiwiY29tcGFueV9uYW1lIjoiUXVyaW5vbSBTb2x1dGlvbnMiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6InB6ZTdrc2NyencyeHhOQjhBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTmV1dm9vIiwibGluayI6Imh0dHBzOi8vc2cubmV1dm9vLmNvbS92aWV3Lz9pZD1lYTljMDMxMzBhZDJcdTAwMjZ1dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior / Solution Architect (Android)", "company_name": "EPAM Systems", "location": "Singapore (+1 other)", "via": "via Bayt.com", "description": "EPAM is committed to providing our global team of more than 41,150 EPAMers with inspiring careers from day one. EPAMers think creatively and lead with passion and honesty. Our people are the source of our success. We value collaboration, work in partnership with our customers, and strive for the highest standards of excellence. In today’s market conditions, we’re supporting operations for hundreds of clients around the world remotely. No matter where you are located, you’ll join a dedicated, diverse community that will help you discover your fullest potential.\n\nDESCRIPTION\nWe are looking for an experienced Senior/ Solution Architect specialized in Android in Singapore to make the team stronger.\nResponsibilities\n• Design and build advanced applications for the Android platform\n• Collaborate with cross-functional teams to define, design, and ship new features\n• Work with outside data sources and API's\n• Unit-test code for robustness, including edge cases, usability, and general... reliability\n• Work on bug fixing and improving application performance\n• Continuously discover, evaluate, and implement new technologies to maximize development efficiency\n• Full-cycle web application development using Agile approach:\n• Idea generation and high-level vision creation\n• Solution design and documenting, proposal\n• Development, testing, and Production launch\n• Run customer’s demo and education sessions\n• Be a member of a cross-functional team that experiment with new technology and proactively searches for the best solutions and ideas in the marketplace\n• Coordinate your work with other developers to deliver first-class technology solutions in a positive, fun, yet challenging and deadline driven environment\n• Work closely with other Product and Technology teams, internal and external, to bring technology solutions and perspectives to the product development process\n• Provide input on, follow and evangelize code quality guidelines and standards\n• Participate in code reviews to highlight best of breed solutions\n• Identify/troubleshoot application code-related issues, and review and provide feedback on any required final user documentation\nRequirements\n• Proficient with software development for Android applications\n• Strong understanding & experience with Design patterns, Data Structures\n• Familiarity with RESTful APIs to connect mobile applications with back-end services\n• Demonstrable capability to use OS frameworks for multi-threading, data persistence, and adapting user interface across multiple screen sizes\n• Experience with developing custom UIs and animations\n• Familiarity with ad integration, push notifications\n• Experience with performance and memory usage tuning\n• Developed a culture of benchmarking and optimization\n• Comfortable working in agile product development environment, building from scratch and continuously improving it\n• Drive architecture and technology choices for the mobile products\n• Ability to lead mobile projects through the complete development lifecycle\n• Ability to lead and mentor a group of engineers\n• Passionate about delivering high quality user experience\n• Self-starter, strong sense of ownership, gets things done\n• Capable of making timely decisions while dealing with uncertainties & inadequate information\n• BS/MS degree in Computer Science, Engineering or a related subject\n• Minimum 15 years of software development experience\n• Minimum 7 years of Android development\n• Expert in Android SDK\n• Experience working with remote data via REST and JSON\n• Experience with third-party libraries and APIs\n• Working knowledge of the general mobile landscape, architectures, trends, and emerging technologies\n• Solid understanding of the full mobile development life cycle\n• Critical thinker and problem-solving skills\n• Great interpersonal and communication skills\n• Mobile banking experience is strongly preferred\n• Experience with functional reactive programming, TDD, Kotlin would be a plus\n• Banking experience is required\nWe offer\n• Friendly team and enjoyable working environment\n• Work-life balance and flexible schedule\n• Online training library, mentoring, career development and potential partial grant of certification\n• Unlimited access to LinkedIn learning solutions\n• Referral bonuses\n• Compensation for sick leave and paid time off\n• Opportunities for self-realization", "extensions": ["7 days ago", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgLyBTb2x1dGlvbiBBcmNoaXRlY3QgKEFuZHJvaWQpIiwiY29tcGFueV9uYW1lIjoiRVBBTSBTeXN0ZW1zIiwiY29tcGFueV9taWQiOiIvbS8wZGxucmMiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJuUkFFdjRQR0I2YXRXS2lGQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VTNkdWNFNDBVMlY2WW5KcFowZEdNalUwUXpkME5XRmpNWFpOWTFCRlJtTkxMVWt4VDNCYWVrTnRkRlpKVFROb2FIZEJRazQ1TUZKMVdGSXpNWGhDUmpkbFdVSlFhbXRVVm14UlRYTTBlREJhYWxWNE1VRjJRVk5YY21oWlZFWmtlSFJTVjB0SmF6ZFBUSGcwU0ZaTFJGVlhPRWd3ZVVsV1dsWlVRalZRYlRWSFdVSkVhSEJzUzI5M0xYZ3RORXBZUVRoM01WTjBVM0ZLVEU1UkVoWTVibTFEV1UxRWRrbHZUM2gwUVdGSk5HRk1XVVJuR2lKQlQwMVpVbmRFZG5wSFowY3phRzV5V21SU1pWcDBVelo1VHpKemNuVjVWa1pCIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMjEiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQmF5dC5jb20iLCJsaW5rIjoiaHR0cHM6Ly93d3cuYmF5dC5jb20vZW4vc2luZ2Fwb3JlL2pvYnMvc2VuaW9yLXNvbHV0aW9uLWFyY2hpdGVjdC1hbmRyb2lkLTU5NDk5MTE2Lz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Analytics Solutions Architect", "company_name": "Amazon", "location": "Singapore", "via": "via Learn4Good", "description": "DESCRIPTIONAre you a Data Warehousing specialist? Do you like to solve the most complex and large-scale data challenges in the world today? Do you want to have an impact in the development and use of new Analytics technologies? Come join us?\n\nAmazon Web Services (AWS) offers a comprehensive set of services to handle every step of the analytics process chain including data warehousing, business intelligence, batch processing, stream processing, machine learning, and data workflow orchestration. Amazon Redshift offers a fully managed, petabyte-scale data warehouse that integrates cleanly with existing business intelligence tools. Amazon Quick\n\nSight delivers fast, easy-to-use business analytics and visualization for customers looking to build new applications. In combination with other AWS services, these core DW tools allow customers to extract the maximum business value from their operational and transactional data.\n\nWe are looking for a POC Specialist Solutions Architect to be a... hand’s on engineer who performs Proof of Concepts (POCs) on behalf of our customers and help them to adopt AWS services towards their successes.\n\nYou will partner with other Solution Architects, Customer Account Managers, Business Development Representatives and the DW Service teams to enable customer adoption and revenue attainment.\n\nYou will develop repeatable mechanisms, POC processes, white papers, blogs, reference implementations, labs, and presentations to build efficiency into the way that customers accomplish POCs.\n\nRoles &\n\nResponsibilities:· Have fun at work. As the right candidate, you will love what you do, and instinctively know how to make work fun.\n\nYou will be dynamic, creative, entrepreneurial, and willing to take on any challenge.· Migrate customer data.\n\nYou will be hand’s on with the customer’s data and will work to load that data into AWS in order to run tests. These tests will be varied in nature and will be a combination· Performance tune. As POCs are often “speed races” you will be responsible for performance tuning the environment, including, but not limited to data distribution, sharding/partitioning, rewriting SQL, etc.·\n\nPresent results.\n\nYou will be responsible for gathering the POC results and sharing these with the customers in the way that the customer wants to receive information. This can include documentation, scoring, and live presentations of results.· Exhibit thought leadership. Obsess over simplification.\n\nYou have a passion for eliminating redundancy and establishing new practices with self-service solutions to allow customers to prove the value of AWS solutions quickly.\n\nYou will evangelize others and share best practices through forums such as AWS blogs, whitepapers, reference architectures and public speaking events such as AWS Summit and AWS re:\n\nInvent.\n\nYou will help develop and support the AWS internal community of Analytics technologists.· Build great services. Act as technical liaison between customers and the service engineering teams, providing product improvement feedback to AWS developers and accelerating the adoption of new features in customer deployments.\n\nBASIC QUALIFICATIONS· 3+ years of experience in Data Warehouse, Data Integration and Business Intelligence technologies.· Undergraduate degree or 6+ year’s work experience in technical role· 3+ years of experience in MPP platforms i.e. (Redshift, Teradata, Netezza, Greenplum, Vertica, etc.)· 2+ years in Cloud Data Warehouse platforms (Snowflake, BigQuery,Azure Synapse)\n\nPREFERRED QUALIFICATIONS· Excellent written and verbal skills· Expert knowledge of on-premises DataWarehouse solutions.· Experience managing customer Proof of Concepts and Pilots.· Operational experience working with website/web services as well as traditional IT networking, operations, management, and security experience.· AWS Solution Architecture certification or relevant cloud expertise.· Working knowledge of software development tools and methodologies.· Demonstrated ability to adapt to new technologies and learn quickly.\n\n· Ability to present with a high degree of comfort speaking with executives, IT Management, and developers·\n\nExperience with a programming or scripting language.· Company- or regional-level recognition in the Database and/or Data Warehousing field (conference presentations, Meet-Ups, etc).\n\n· Ability to understand complex application data flows and bridge the gap between technical and business app requirements.· Graduate degree in Computer Science, Technology, Engineering or Math.\n\nAmazon is committed to a diverse and inclusive workforce. Amazon is an equal opportunity employer and does not discriminate on the basis of race, ethnicity, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://(Please contact us using the \"Apply for this Job Posting\" box below", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBbmFseXRpY3MgU29sdXRpb25zIEFyY2hpdGVjdCIsImNvbXBhbnlfbmFtZSI6IkFtYXpvbiIsImNvbXBhbnlfbWlkIjoiL20vMG1na2ciLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJxSjgyMTlXQjF4ODdham1hQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFc3NCQ293QlFVNVZYMDV4VTA1dVRsWlBlVTV0YWt0YWVUQXRjelZMVERJNFdtOTFlV0l3TmxGd1owbEtURk5rZEROb1RYVldjVFJTYmkxdExWRTBkVFJCUmsxNlJVMDNSMDVoZEVzeFZUUnpiV3BZU1U1dWNGQmpZbW8zVjA5blNWSmZTV2xhVURWemNURktTRFIzUzJoaUxWSjRYM2RMY2s5V2QyNUhiRzB4ZEV0ck5rdDJha1JHU1VKd1NUSTRORXNTRmpsdWJVTlpUVVIyU1c5UGVIUkJZVWswWVV4WlJHY2FJa0ZQVFZsU2QwTnJibk4xZWpKUVZIUlJNekJLZFU1TlZqWTFka3N3YkY4MmJtYyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzI5IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExlYXJuNEdvb2QiLCJsaW5rIjoiaHR0cHM6Ly93d3cubGVhcm40Z29vZC5jb20vam9icy9zaW5nYXBvcmUvc29mdHdhcmVfZGV2ZWxvcG1lbnQvMjcxMjc5MTE5L2UvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Customer Engagement Solutions Architect (salesforce)", "company_name": "GIVAUDAN SINGAPORE PTE LTD", "location": "Singapore (+1 other)", "via": "via MNC Jobs Singapore | MNC Jobs In Singapore", "description": "Let us engage your senses\nGivaudan. Our name is an invitation to engage your senses.\nAs the world’s leading flavor and fragrances company, we unveil the tastes and scents that suit you best, and that you love most. In close collaboration with food, beverage, consumer product and fragrance partners, Givaudan develops tastes and scents that delight consumers the world over. With a passion to understand consumers’ preferences and a relentless drive to innovate, Givaudan is at the forefront of creating flavours and fragrances that ‘engage your senses’. The Company achieved sales of CHF 5.5 billion in 2018. Headquartered in Switzerland with local presence in over 145 locations, the company has almost 13,600 employees worldwide. Givaudan invites you to discover more at www.givaudan.com .\n\nAt Givaudan, you contribute to delightful taste and scent experiences that touch people’s lives.\n\nYou work within an inspiring teamwork culture – where you can thrive, collaborate and learn from other... talented and passionate people across disciplines, regions and divisions.\n\nJoin us and Impact Your World\n\nDiversity drives innovation and creates closer connections with our employees, customers and partners.\n\nGivaudan embraces diversity and is committed to building an inclusive environment where everyone impacts our world.\n\nCustomer Engagement Solution Architect (SalesForce)\nLocation: Singapore – Marsiling / Paris – Argenteuil\nReports to: Customer Engagement Platform Manager\n\nYour future position?\nAs a Customer Engagement Solution Architect based either in Marsiling (Singapore) OR Argenteuil (France) , you will provide Architecture consulting and advisory to create successful solution design and implementation for the projects affecting Customer Engagement Platform (mainly -but not limited to- Salesforce). You will report directly to Customer Engagement Platform Manager. Your areas of responsibilities are\n\nPlatform Strategy\n• Work with Applications Architects and Platform Managers on the definition and evolution of Roadmap for the Customer Engagement Platform\n• Analyze the current application architecture in Customer Engagement Platform, to identify weaknesses and develop opportunities for improvements\n• Develop migration strategies to close gaps between current and future states of the Platform application architectures\n• Maintain the Architecture map of products and Business Entity Models owned by the Customer Engagement Platform\n\nProjects delivery\n• Oversee the architecture of the Salesforce implementation program.\n• Achieve best practices and creative proposals\n• Contribute to the classification process for new demands and produce the High-level Design\n• Lead solution assessments (reuse-buy-build). Assess whether or not an existing application or module of Salesforce can meet the requirements\n• Establish or validate solution Architecture: Ensure projects comply with established EA principles and guidelines.\n• Ensure project functional and technical requirements / impacts are considered and handled by the IT (incl. Security aspects)\n• Validate solutions for advanced Salesforce platform configurations, data schema, permissions, profiles, roles, record types, reports, dashboards, and custom development.\n\nYou?\n\nAre you a Salesforce.com Certified Architect, with over 10+ years of Experience in IT and excited to create outstanding Customer Engagement Solutions?\n\nAre you someone who wants to grow and shape your world? Who needs a new challenge and brings excellent contribution to the company? Then come and join us - and impact your world.\n\nYour professional profile includes:\n• Bachelor's degree in Engineering or Computer Science\n• Salesforce Certified (Application and System Architect). TOGAF certified is a plus\n• At least 5 years of working experience in the field of Solution architecture / Technical Architecture with Salesforce.\n• Familiar with architectural, development and operational methodologies with excellent knowledge of information systems, related modelling methods and tools\n• Experience with Innovation approaches and methodologies such as Design Thinking, Lean Startup\n• Experience carrying out large projects\n• Knowledge of Enterprise Architecture with a holistic understanding of a complex system landscape\n• Excellent technical background including experience in the software development process\n\nOur Benefits:\n• Attractive package with benefits\n• Excellent opportunities for progressive learning and development\n• A creative team environment that will inspire you\n• Comprehensive healthcare plans\n• PTO and family leave", "extensions": ["26 days ago", "Full–time"], "detected_extensions": {"posted_at": "26 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDdXN0b21lciBFbmdhZ2VtZW50IFNvbHV0aW9ucyBBcmNoaXRlY3QgKHNhbGVzZm9yY2UpIiwiY29tcGFueV9uYW1lIjoiR0lWQVVEQU4gU0lOR0FQT1JFIFBURSBMVEQiLCJjb21wYW55X21pZCI6Ii9nLzExZjAwd241MTkiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJLYnY5OU5aRXdaLWZIVmJVQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFb3NDQ3N3QlFVNVZYMDV4VWxKRmR6SllTWEJOVUVsNVNVVXhUa1ZDYWxaNGRFVm5WRGQ1WVdOSFVEQjVjMFV4UW0xdGIxVk9RalJaTVZseFpGOW1SMWxwYm5sc05qUjFYM2x2ZGtGSE4xVnpRVjk2ZUcxVWF6RkVkWEJxYlc1T1VtMWZXbWRSWHpSRmNUZHZkbU51U0VGSE4zWkxOV1ZJVG5CbU0yaG9SMDlYT0VSeFV6VjZiRUZ6ZGtGQlZtOVlkbEZSVjJGVFpWWlRRVWx0UjBoelJFaDVibXhDY0VSbVIzQk1ibUpPWTJWUmNWaFVZMVpUV2xOd1dtMVNTVXA0YzFBMGJHeHlWMHhOZERBek0yZEZRM2RORWhZNWJtMURXVTFFZGtsdlQzaDBRV0ZKTkdGTVdVUm5HaUpCVDAxWlVuZERkMkZXY201SWJEZGtZblpRUWs1alRuZFViVUYyVlY5d2VUaDMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18zNiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNTkMgSm9icyBTaW5nYXBvcmUgfCBNTkMgSm9icyBJbiBTaW5nYXBvcmUiLCJsaW5rIjoiaHR0cHM6Ly9zZy5tbmNqb2J6LmNvbS9qb2JzL2N1c3RvbWVyLWVuZ2FnZW1lbnQtc29sdXRpb25zLWFyY2hpdGVjdC1zYWxlc2ZvcmNlLXNpbmdhcG9yZS0yOTgyODY/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Solution Architect", "company_name": "Comtel Solutions Pte Ltd", "location": "Singapore (+1 other)", "via": "via Laimoon.com", "description": "Responsibilities\n• Assessing the systems architecture currently in place and working with technical staff to recommend solutions to improve it.\n• Work with Enterprise Architecture Team on solution reviews\n• Collaborate with relevant application teams for cross-system integrations\n• Resolving technical problems as they arise.\n• Evaluate current and emerging technologies and identify the probable benefits and opportunities.\n• Informing various stakeholders about any problems with the current technical solutions being implemented.\n• Assessing the business impact that certain technical choices have.\n• Monitors and manages the production support to ensure incidents and problems are managed within set SLAs\n• Lead the development team (internal and external) to deliver Investment application projects and major initiatives\n• Ensure application development adhered to software development life cycle process and standards\n• Provide strong leadership, supervision and guidance to the development... teams to develop their design and software engineering capabilities, and capabilities to manage both internal and outsourced software engineering resources\n\nRequired Skills:\n• At least 10+ years of Application Development and Management experience, preferably in financial services industry and insurance in particular. Candidates with lesser experience can be considered for junior level architect role.\n• At least 5 years of Outsourcing, Vendor and Contract management experience\n• Solid understanding of software development life cycle models (both Waterfall and Agile) as well as expert\n• knowledge of in project management principles and practices\n• Domain knowledge in Investment and/or Insurance is an advantage\n• Strong interpersonal skills including mentoring, coaching, collaborating, and team building\n• Strong advocate of standards and challenge status quo with new and emerging technology to address new business challenges.\n• Excellent oral and written communications skills and experience interacting with both business and IT individuals at all levels including the executive level\n• Application knowledge on Eagle Investment System, Factset, and Bloomberg is an advantage\n• Proficient with latest J2ee, mobile, cloud, devops, react / angular js, etc\n\nInterested candidates are requested to forward their cvs to recruit@comtel-solutions.com.\n\ninformation services", "extensions": ["4 days ago", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2x1dGlvbiBBcmNoaXRlY3QiLCJjb21wYW55X25hbWUiOiJDb210ZWwgU29sdXRpb25zIFB0ZSBMdGQiLCJjb21wYW55X21pZCI6Ii9nLzExZHhwenRnbmIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJIZVBvazhJRFVUMXNKaGl0QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFb3NDQ3N3QlFVNVZYMDV4VTJSQlpYUnBNMDFXYUdsM2NVbFRiRVZIYjBZMk5HUTBkMUJrV0ZOeVRVZEVUblZXV1hWcE0wSjZOalJ3V1hGRFUwOXlRWEpYTjJSNFZFRkdia2QwU1VkTFNtODJhRmMyWlRkemNHbHRaakI0Um1SSU1tUmhiRTF3TkV0eU5sZFZOM2szVTNWSFoxcGxiSHAyYTAxak0yaHdUMVJzU2tacVIyeEdZemhZWDFacFkyOUpkMU40YzNOMk5XSTJVa0ZuTUhOUE4yRXdORlY1YURORVYwSmpWRUZJZEdwc2FIcDJOekpIUTFreU56UkpkbXRVVEMwMmFIUm9OVEozWVhKUk1teFFhVEl6RWhZNWJtMURXVTFFZGtsdlQzaDBRV0ZKTkdGTVdVUm5HaUpCVDAxWlVuZENSVWxaU1hSbWRuQmFhRGszZFZGZk4yZG5TM016YVZOMmRHbDMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY180MiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMYWltb29uLmNvbSIsImxpbmsiOiJodHRwczovL2pvYnMubGFpbW9vbi5jb20vam9icy9leHRlcm5hbHZpZXcvMjUzODI0MDQ/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Microsoft Solutions Architect", "company_name": "NTT Ltd.", "location": "Singapore", "via": "via LinkedIn", "description": "The Technical Solution Architect's role is to provide design, configuration and escalated problem management in client environments of high to very high complexity.\n\nThey define system architectures for business opportunities during the project take on phase. They design and develop integration plans and create links for multi-platform, multi-vendor business solutions. These individuals identify and develop technology related opportunities and integrate IT resources to fulfil project requirements. They are able to compile technical specifications in a clear, concise, unambiguous manner to explain the advantages and disadvantages of options leading to the final solution and are able to create alternative solutions as backup planning.\n\nGPC is looking for a technical savvy Technical Architect with strong track record in Microsoft solution. Someone who “owns” the design and is the natural individual to go to.\n\nIn this role as Microsoft Solution Architect, it is essential to be able to... make the conversion of business requirements into architecture and a design that will become the blueprint for the Microsoft Solution being created. This conversion is based largely upon the standard design patterns from Microsoft Products and Services that he/she has been involved in, within the past through reading and staying abreast of the latest techniques, or through personal experience. The blueprint is part of pre-sales activities to define a quotation and serves as the basis for the deployment. You will have typically 8 to 12 years of experience and have completely designed at least 3 significant detailed infrastructure projects. At the same time, it is essential to be able to coordinate the execution of the various implementation activities, performed by (in-house) engineers and external parties (vendors, affiliates and third-party suppliers). You keep control of all resources, maintain a structured plan for the execution and report and escalate during the deployment phase. Experiences with structured hand-over procedures to operations, including solid acceptance criteria.\n\nRole Requirements:\n\nSolid understanding of System design at component level.\n\nOS; Windows\n\nExcellent networks (LAN and WAN) understanding.\n\nServices; Microsoft Azure Cloud Service, Office 365, Windows Virtual Desktop, AWS\n\nServer components; Windows Server (AD), Microsoft System Center, Windows SQL Server\n\nHave completed a minimum of 3 significant Microsoft solution designs.\n\nGood experience in handling multiple projects, multiple clients.\n\nPossess very good communication skills as a customer facing engineer - able to write clear structured communication, craft solutions and make effective presentations / documents.\n\nQuality Assurance role, during deployment\n\nPreferred Certification: MCSA, MCSE, Azure administrator / Security engineer / Solutions Architect Expert / AWS related", "extensions": ["4 days ago", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJNaWNyb3NvZnQgU29sdXRpb25zIEFyY2hpdGVjdCIsImNvbXBhbnlfbmFtZSI6Ik5UVCBMdGQuIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJ4Z1ZCT1B5MXRqaTRlVWxnQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExpbmtlZEluIiwibGluayI6Imh0dHBzOi8vc2cubGlua2VkaW4uY29tL2pvYnMvdmlldy9taWNyb3NvZnQtc29sdXRpb25zLWFyY2hpdGVjdC1hdC1udHQtbHRkLTI0ODY1NTM3NDY/cmVmSWQ9NDUxMmY0YTMtNWNhMC00ZTgzLTg4NjktMDRiYTJlODM4ZTUzXHUwMDI2dHJhY2tpbmdJZD1WYyUyQnNHdkxVZ29HNyUyQkEzZW4yekhGQSUzRCUzRFx1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Ref: 122673 - Senior Architect, Solution - FICO (1-Year Direct Contract)", "company_name": "Singtel Group", "location": "Singapore", "via": "via Singtel Careers", "description": "Realise your full potential with Asia's leading communications group. While we take pride in our 140-year heritage, our philosophy is to always look forward and evolve. Today, we are a leader in cutting-edge ICT innovation and digital advances, powered by a vast network of offices in countries and territories across Asia Pacific, the Middle East, Europe and the USA. Come be a part of our dynamic organisation as we create the infocomms landscape of the future.\n\nThe Singtel Group is Asia's leading communications group providing a diverse range of services including fixed, mobile, data, internet, TV, infocomms technology (ICT) and digital solutions. The successful applicant will be joining Group IT as a Senior Architect, Solution based in Singapore.\n\nKey Responsibilities:\n\nChange Requests\n\nDrive the delivery and completion of change requests in the SAP FICO area. Person is expected to work together with outsourced vendors to review and approve solutions to regular change requests. For... major change requests (eg: new initiatives, products, implementation), the person is expected to provide high level solution design and then review and approve the detailed solution design proposed by the outsourced vendor.\n\nDomain Ownership\n\nTogether with the SAP solution architects, be responsible for the overall strategy of Financial Systems (SAP and non-SAP) in the SingTel group (SingTel/NCS/Optus). The candidate must possess the vision and hands on experience to formalize, standardize, govern, and evolve the architecture design, standards, and processes in SAP Finance modules with the objective to deliver best practice, relevant, timely, dependable, and cost effective solutions to the Finance business stakeholders. The SAP modules in scope are mainly SAP FICO (CO-PA, CCA, PCA, PS, AP, AR, AM, GL, RE-FX, SPL). Version 1909 environment, and RE-FX module to address IFRS16 regulations are preferred.\n\nClient Facing\n\nBe the strategic interface and global single point of contact between IT and Finance business stakeholders of the SingTel Group so that stakeholders have clear and direct access to IT. The candidate must possess the consulting skills and industry experience to work with the stakeholders to understand business requirement and recommend industry best practice solutions.\n\nOperational Excellence\n\nEnsure issues and changes in financial systems are addressed within expected SLAs. Ensure continuous improvements to the systems and processes through proactive review and optimization initiatives with the business. Recommend and implement major improvements that have significant benefit to IT or the business.\n\nThe ideal candidate should possess:\n• Tertiary qualifications in business or IT\n• Experience in S4HANA environment and SAP Fiori\n• Minimum 10 years working experience as an SAP FICO consultant in large projects (or a combination of 6 years consulting and 4 years’ end user support experience)\n• SAP FICO Certification in ECC\n• Excellent interpersonal skills, in dealing with various multi-discipline groups and teams\n• Must be decisive, action oriented, results focused and able to work independently is a must\n• Show an ability to win the trust and respect of individuals and the group\n• Possess the ability to exercise independent and effective judgment based on previous background and experience\n• Preparedness to express and share knowledge and views on a continual basis\n• Emphasise collaboration and the development of win/win partnerships – strong team player\n• Work well under pressure and to tight deadlines\n• If this description is exciting and you feel that you have the necessary skills and experience to make a difference, then please follow the link to apply. For more information on this and other opportunities please refer to our careers portal under https://groupcareers.singtel.com.\n\nLet’s shape a better world through technology. Join us to lead the change.\n\nNote to Recruitment Agencies\n\nIn sourcing for candidates for particular roles, the Singtel Group works only with a panel of selected recruitment agencies expressly engaged under written agreements. Even then, these agencies are only activated from time to time for specific recruitment exercises for particular roles under instructions expressly issued by a member of the Singtel Talent Acquisition team.\n\nExcept under such circumstances, no agency shall source or attempt to source any candidates for the Singtel Group. The Singtel Group will not pay nor be obliged or liable to pay any recruitment fees of any kind whatsoever to any agency where candidate CVs are submitted to the Singtel Group by such agency on an unsolicited or speculative basis.\n\nThe Singtel Group reserves all rights to directly contact any candidate to which such CVs relate without any obligation or liability whatsoever to the agency concerned (including without limitation any obligation or liability to pay any recruitment fees of any kind", "extensions": ["5 days ago", "Contractor"], "detected_extensions": {"posted_at": "5 days ago", "schedule_type": "Contractor"}, "job_id": "eyJqb2JfdGl0bGUiOiJSZWY6IDEyMjY3MyAtIFNlbmlvciBBcmNoaXRlY3QsIFNvbHV0aW9uIC0gRklDTyAoMS1ZZWFyIERpcmVjdCBDb250cmFjdCkiLCJjb21wYW55X25hbWUiOiJTaW5ndGVsIEdyb3VwIiwiY29tcGFueV9taWQiOiIvbS8wMjB6ZmwiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiI1WUNQNFlEWTNGbklHZDAtQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VTA5UGNrUnZTbUZvVEdsaVprbFdjbHBOTldJelNrUlViMUZtZEhSNGNGaG9kek41ZUdKaVZGY3RSV3BpTW0xUFJqTkNNbnBDUmkxMWJ5MUNjMWhzYVRCck1FbFRTM1JqVUdaVGMxUnRXV0ZaWVcxbGVXUlVlazlXTFZONlJUazJWa3BpUkZGbWFUaDRXakJKTVUxU2RXbFhUMFF6VjJzdFozVm9Oa05CTVZsRVMxbHhZbU5VUzJ4ZldqUmxNRE5WUldFNWJGTmpWVmRxYm1SbkVoWTVibTFEV1UxRWRrbHZUM2gwUVdGSk5HRk1XVVJuR2lKQlQwMVpVbmRCWkVWTmVESlNRemhOWlZaUU1GVXdlVFJGZVdsR1NtcFlja1puIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNTUiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gU2luZ3RlbCBDYXJlZXJzIiwibGluayI6Imh0dHBzOi8vZ3JvdXBjYXJlZXJzLnNpbmd0ZWwuY29tL2pvYi9SZWYtMTIyNjczLVNlbmlvci1BcmNoaXRlY3QlMkMtU29sdXRpb24tU2luZy81NzI1MzQ2MTAvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Associate Director, Solutions Architect (Health Analytics)", "company_name": "Aon", "location": "Singapore", "via": "via Jobs", "description": "Job Description We’re hiring! Aon is currently recruiting an Associate Director, Solutions Architect to join our Health Solutions team within our Center for Innovation & Analytics (ACIA) in Singapore. About ACIA Aon’s Centers for Innovation and Analytics in Dublin and Singapore are at the heart of delivering Aon’s Data & Analytic Services team’s mission to: accelerate the rate of innovation through digital solutions to help better respond to clients’ evolving needs provide foundational data and analytics capabilities in one place for 50,000 Aon colleagues and our global clients who use our risk and people solutions Established in 2012, there are over 100 colleagues in Singapore’s Centre today including actuaries, software developers, data scientists, financial analysts and accountants. We are expanding rapidly and looking for dedicated individuals who can leverage emerging technologies and collaborate across Aon’s solution lines to help clients and colleagues make better, data-driven... decisions today and tomorrow. The Innovation Center is growing rapidly, with new ideas continually forming. We are looking for dedicated individuals to brainstorm exciting and new strategic opportunities, and quickly build working prototypes to transform those ideas into reality. Responsibilities: Proposal of detailed system design, system architecture and technology stack Contribute and execute to the technology roadmap together with the technical leadership team Proposal of proof of concepts for the team to follow through and execute to modernize and improve existing applications Able to present with clarity the pros and cons of design decisions with focus on areas of scalability, performance and cost. Collaborate with teams of experienced data scientists, analysts, developers and business experts to build high-performing web applications Assist in troubleshooting and support of existing applications whenever required Requirements: AWS certified Solutions Architect – Associate/Professional Very passionate and knowledgeable on areas of scalability and performance. Understands various patterns of traditional and modern system architectures. Experienced in drawing solution architecture diagrams that details the interactions between the various components of the system. Understands security considerations of various architecture topologies Working experience using an agile development process (eg. Scrum, Kanban, Scrumban) Good hands-on experience in full stack web application development (eg. Front end, API, database) Working experience in single page web application development experience in Angular, CSS, JavaScript and Typescript Good experience in .NET Core C# and ASP.NET Core Web API Experience in Entity Framework ORM and writing SQL Knowledgeable in areas of databases and data warehouses", "extensions": ["5 days ago", "Full–time"], "detected_extensions": {"posted_at": "5 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBc3NvY2lhdGUgRGlyZWN0b3IsIFNvbHV0aW9ucyBBcmNoaXRlY3QgKEhlYWx0aCBBbmFseXRpY3MpIiwiY29tcGFueV9uYW1lIjoiQW9uIiwiY29tcGFueV9taWQiOiIvbS8wejduIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiNlpDSWNFX2pQSTNWbDZEd0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXNzQkNvd0JRVTVWWDA1eFZISkZTVXhIZG1aWVIwVTVhRkptVFdsV09VMWFXSHAxTkhGRmFrcGFiSFJ5ZFZsSllWUmlSRWhtTTBZelVtNU9TVTB3WmxSTUxXRnJSWFJ5TWt0RlUyWklNa2xuTTA5SldteDVNVFJ5Vm1GQmQzUlFkRmxYUjNac1NVRnlkWGxFYTFJMmVXNXFSMnBqZVZKV2ExOHlRVE56WjJGa2IzUnFkbkowVFdJdFUwRnRSMlZSVDNZU0ZqbHViVU5aVFVSMlNXOVBlSFJCWVVrMFlVeFpSR2NhSWtGUFRWbFNkMFJOY1ZadVlsUk9SV3BKZW5WemR6TXdSRkJ5TFZrNVJtNDNXSGMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY182MyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIiwibGluayI6Imh0dHBzOi8vc2cuZmlkYW50by5jb20vam9icy9qb2Itb3BlbmluZy9oZWFsdGhjYXJlLXN1cHBvcnQtd29ya2Vycy1hbGwtb3RoZXIvYXNzb2NpYXRlLWRpcmVjdG9yLXNvbHV0aW9ucy1hcmNoaXRlY3QtaGVhbHRoLWFuYWx5dGljcy0yNzYwMzY4ODY/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Cloud Solutions Architect", "company_name": "SnapHunt Pte Ltd", "location": " (+1 other)", "via": "via Monster", "description": "• Join an innovative IT services company\n• Opportunity to work with cutting edge technologies\n• A role that will accelerate your career\n\nOur client is an innovative IT services company that offers website designing, web development, digital marketing and IT consulting. The company leverage cutting-edge technologies such as Artificial Intelligence and IoT to provide reliable and comprehensive solutions as well as tackle upcoming challenges in the IT industry.\n\nThe Job\n\nYou will be responsible for :\n• Leading the development team through the software life-cycle to deliver systems and applications.\n• Ensuring the development of well-designed and testable code.\n• Providing code documentation and other inputs to technical documents.\n• Defining project scope & specifications, estimating resources required to develop the proposed solution to meet customer requirements and developing schedules, test plans and documentation.\n• Ensuring specifications and requirements are clearly articulated to... the development teams and monitoring timelines & progress.\n• Gathering requirements and specifications from clients and users in conjunction with the sales team to gain a strong understanding of client expectations.\n• Identifying potential issues between systems and client specifications and proposing new solutions.\n• Proposing the technical solution and overseeing the selection of technologies.\n• Providing clients with regular feedback and updates on projects.\n• Providing subject matter expertise and direction, guidance, and support on complex sales engagements.\n• Reviewing proposals and estimates from vendors and ensuring that external solutions work with internal development projects.\n\nThe Profile\n• You possess a Degree/Diploma in Computer Science, Engineering or related field.\n• You have prior experience within a Solution Architect, Software Architect or similar role.\n• You have expertise in Cloud Databases (eg. AWS, Azure), Cloud Computing and Configuration Management tools (Chef, Ansible, Puppet etc.).\n• You have strong interpersonal and communication skills and are adept at working with multiple stakeholders to drive desired outcomes.\n• You are highly goal-driven and work well in fast-paced environments\n• You are a strong team player who can manage multiple stakeholders\n• You are adaptable and thrive in changing environments\n\nRef: 84122086", "extensions": ["29 days ago", "Full–time"], "detected_extensions": {"posted_at": "29 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDbG91ZCBTb2x1dGlvbnMgQXJjaGl0ZWN0IiwiY29tcGFueV9uYW1lIjoiU25hcEh1bnQgUHRlIEx0ZCIsImNvbXBhbnlfbWlkIjoiL2cvMTFjNzR0NjF3OCIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IlpmUjI2SHIzQVZSaklMLU1BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2WUJDcmNCUVU1VlgwNXhVV0p3WVhFdE9YUmxibVJVUmxkaWIySTNlRXRUWkZsSFdFNUxPR2h2TTFOdFFWaGhjVFpDU25ReFNXZG5iMlkxVTBscWIwbHdOa1ZNUlZsc2FrcDViMmd0TlhkeE4wOXpSalpCV1ZaZmQwTlFObGhHY1RKUGJrNXNVa2hRZG1FelkxRlNkMk5XYkhabE0ybERXRTh6ZWt0amRGVlpNWHBHZDJSV2NXcG9Sbm90T1hwdVpFNU5XRGRUZGxoek1sWkVkbTE0Y1dGblZYWTFOME5rY205T1pERjZhbU53WTJaTFUwbGhUVk0xUlhSTkVoWTVibTFEV1UxRWRrbHZUM2gwUVdGSk5HRk1XVVJuR2lKQlQwMVpVbmRDUTBsdk5uVnNjWEJqTVRadVdIQlFjVk5xU1Y4d1RFeG1TMjFuIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNzEiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTW9uc3RlciIsImxpbmsiOiJodHRwczovL3d3dy5tb25zdGVyLmNvbS5zZy9qb2IvY2xvdWQtc29sdXRpb25zLWFyY2hpdGVjdC1zbmFwaHVudC1wdGUtbHRkLXNpbmdhcG9yZS0yODAwNzY1P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}], "chips": [{"type": "Title", "param": "job_family_1", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Solution architect", "value": "solution architect"}, {"text": "Solutions architect", "value": "solutions architect"}, {"text": "Architect", "value": "architect"}, {"text": "Cloud architect", "value": "cloud architect"}, {"text": "Technical architect", "value": "technical architect"}, {"text": "Enterprise architect", "value": "enterprise architect"}, {"text": "Senior", "value": "senior"}, {"text": "Consultant", "value": "consultant"}, {"text": "Financial services", "value": "financial services"}, {"text": "Infrastructure architect", "value": "infrastructure architect"}, {"text": "Manager", "value": "manager"}, {"text": "Application architect", "value": "application architect"}, {"text": "Cloud engineer", "value": "cloud engineer"}, {"text": "It architect", "value": "it architect"}, {"text": "Lead architect", "value": "lead architect"}, {"text": "Network architect", "value": "network architect"}, {"text": "Security architect", "value": "security architect"}, {"text": "Senior architect", "value": "senior architect"}, {"text": "Systems engineer", "value": "systems engineer"}, {"text": "Associate director", "value": "associate director"}, {"text": "Deputy", "value": "deputy"}, {"text": "Engineers", "value": "engineers"}, {"text": "Head", "value": "head"}, {"text": "Infrastructure", "value": "infrastructure"}, {"text": "Lab", "value": "lab"}, {"text": "Network engineer", "value": "network engineer"}, {"text": "Presales consultant", "value": "presales consultant"}, {"text": "Public sector", "value": "public sector"}, {"text": "Senior analyst", "value": "senior analyst"}, {"text": "Senior consultant", "value": "senior consultant"}, {"text": "Senior director", "value": "senior director"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Software architect", "value": "software architect"}, {"text": "Solution consultant", "value": "solution consultant"}, {"text": "System architect", "value": "system architect"}, {"text": "System engineer", "value": "system engineer"}, {"text": "Systems analyst", "value": "systems analyst"}, {"text": "Systems architect", "value": "systems architect"}, {"text": "Technical trainer", "value": "technical trainer"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Accounting", "value": "/business/naics2007/5412"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Management", "value": "/business/naics2007/55"}, {"text": "Real Estate", "value": "/business/naics2007/53"}, {"text": "Wholesale", "value": "/business/naics2007/42"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Amazon", "value": "/m/0mgkg"}, {"text": "Microsoft", "value": "/m/04sv4"}, {"text": "EPAM Systems", "value": "/m/0dlnrc"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "IBM", "value": "/m/03sc8"}, {"text": "Salesforce", "value": "/m/07btr5"}, {"text": "EY", "value": "/m/0g9jc"}, {"text": "Publicis Sapient", "value": "/m/02myjp"}, {"text": "Randstad", "value": "/m/08pt1z"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Alibaba Group Holding Limited", "value": "/m/07s6ctl"}, {"text": "Avanade", "value": "/m/094456"}, {"text": "Capgemini", "value": "/m/03vlk0"}, {"text": "Comtel Solutions Pte Ltd", "value": "/g/11dxpztgnb"}, {"text": "DELL", "value": "/g/11c54ch2jm"}, {"text": "Ericsson", "value": "/m/02kyh"}, {"text": "HTZ Resources", "value": "/g/11h21p9b4d"}, {"text": "Infinite Computer Solutions Pte Ltd", "value": "/g/11g9mj72yz"}, {"text": "Michael Page", "value": "/m/04cxldw"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "Orange Business Services", "value": "/m/08zvyz"}, {"text": "Recruitment Hub Asia Pte Ltd", "value": "/g/11dxpww_0f"}, {"text": "TEKsystems (Allegis Group Singapore Pte Ltd)", "value": "/g/11b6g4bkv0"}, {"text": "Talent Trader Group Pte Ltd", "value": "/g/11dxpmlc5b"}, {"text": "Tata Consultancy Services", "value": "/m/01psx8"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "VMware", "value": "/m/01t9k5"}, {"text": "Verizon", "value": "/m/07_dn"}, {"text": "A-Speed Infotech Pte Ltd", "value": "/g/11g9mxswl4"}, {"text": "ABeam Consulting", "value": "/g/11bc6whr_f"}, {"text": "Amazon Web Services (AWS)", "value": "/g/11dxprr2xv"}, {"text": "Amazon Web Services Singapore", "value": "/m/0rznzt1"}, {"text": "Aon", "value": "/m/0z7n"}, {"text": "Avaya", "value": "/m/01sqlk"}, {"text": "Azendian Solutions Pte Ltd", "value": "/g/11dxpvcjj2"}, {"text": "Big Cloud", "value": "/g/11c743lwsr"}]}]}