{"search_metadata": {"id": "60827a444b91eb4549fdf7cc", "status": "Success", "json_endpoint": "https://serpapi.com/searches/fc58aabffd9aa975/60827a444b91eb4549fdf7cc.json", "created_at": "2021-04-23 07:41:56 UTC", "processed_at": "2021-04-23 07:41:56 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28data+scientist%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=100", "raw_html_file": "https://serpapi.com/searches/fc58aabffd9aa975/60827a444b91eb4549fdf7cc.html", "total_time_taken": 9.3}, "search_parameters": {"q": "(data scientist) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "100"}, "jobs_results": [{"title": "Project Officer - Information Technology-Data Science-Data Management-Data Analysis-Big Data-Information Management", "company_name": "Nanyang Technological University", "location": "Singapore (+1 other)", "via": "via Monster Singapore", "description": "Job Description :\nRehabilitation Research Institute of Singapore (RRIS) invites applications for the position of Project Officer.\nKey Responsibilities:\n• Conceptualise and design relevant research resources for Principal Investigators and research staff\n• Liaising and handling final production with external service providers where required\n• Managing production schedules to meet timeline requirements\n• Assist in maintaining the RRIS website\n\nJob Requirements:\n• Bachelor’s degree in Information Technology, Data Science, Data Management, Data Analysis, Big Data, Information Management or related fields\n• Strong client-facing and internal communication skills\n• Good written and verbal communication skills\n• Excellent organizational skills, including attention to detail and multitasking skills\n• Prepared to work on short and urgent timelines where necessary\n\nWe regret that only shortlisted candidates will be notified. Hiring Institution: NTU", "extensions": ["25 days ago", "Full–time"], "detected_extensions": {"posted_at": "25 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE9mZmljZXIgLSBJbmZvcm1hdGlvbiBUZWNobm9sb2d5LURhdGEgU2NpZW5jZS1EYXRhIE1hbmFnZW1lbnQtRGF0YSBBbmFseXNpcy1CaWcgRGF0YS1JbmZvcm1hdGlvbiBNYW5hZ2VtZW50IiwiY29tcGFueV9uYW1lIjoiTmFueWFuZyBUZWNobm9sb2dpY2FsIFVuaXZlcnNpdHkiLCJjb21wYW55X21pZCI6Ii9tLzBsNDlrIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiYXpHUGc3VUMyLUh0a25UZEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXFFQ0N1SUJRVTVWWDA1eFZGZGpOM0l4VVhSMk9VMUlYMDVoY0dsQlJIY3dPVVp6ZFhac09IRkJWbk5ZTXpkTldrZGFPVmRwT1RZMlFtaHVPV3d3Tlhsb1dEVmtSeTB5VDFCWGRESm5ia2xDVDJ4MFYwdE5kRnBxU1ZGc1owOU9PVlJUWldkSGFYQXhUMjVwVW1KMVprSnVZa1JaTFhOUFExaHJjM0p6ZEhNNFZsbHlSMnRWWWw4dGRIVkdYMVpuVEUwMWRFbFFNemRMUzBwTk5rdDBlRTkyUVZRM04zaENUR2gxWld0WFRHSnlObkJRV1VReVRqSldiVW8xWjFWRlRrRk1jRmxxUjIxbmVHRmtVSFJWY1hGTFNWQnBTRk50UTBGaWRUSkRjRVprT0ZWcVJUUlhaeElXVkZoeFExbFBNbEZHT0V0bmRGRllRbXBpTW1kQlVSb2lRVTlOV1ZKM1FYRjFZVGg0T0dSV1FWUlpTelowUTFjMlFsWXpjVmxzWkhsaFp3IiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNb25zdGVyIFNpbmdhcG9yZSIsImxpbmsiOiJodHRwczovL3d3dy5tb25zdGVyLmNvbS5zZy9hbXAvam9iLXZhY2FuY3ktcHJvamVjdC1vZmZpY2VyLWluZm9ybWF0aW9uLXRlY2hub2xvZ3ktZGF0YS1zY2llbmNlLWRhdGEtbWFuYWdlbWVudC1kYXRhLWFuYWx5c2lzLWJpZy1kYXRhLWluZm9ybWF0aW9uLW1hbmFnZW1lbnQtbmFueWFuZy10ZWNobm9sb2dpY2FsLXVuaXZlcnNpdHktc2luZ2Fwb3JlLTI2NzI4NzAxLmh0bWw/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Data Scientist - Marketing Science", "company_name": "Shopee", "location": "Singapore (+1 other)", "via": "via Karkidi", "description": "The mission of marketing science team in data science department is to leverage AI and data science to promote business and mission of Shopee by producing reliable predictive business insights, maximising the effectiveness of marketing campaigns as well as providing personalised e-commerce experiences for all Shopee’s users across their user journey funnels .\n\nJob Description:\n• Work closely with data scientist team, business partners and internal stakeholders to discover marketing and growth problems, uncover insights, identify key levers and build practical solutions based on large-scale user and product data.\n• Drive innovation by proposing new experimentation methodologies as well as novel statistical solutions and working closely with product team to facilitate the marketing business decision process.\n• Build core machine learning models as well as end-to-end machine learning pipeline to understand, identify and predict users’ shopping behaviours across their entire shopping... journey in order to optimise customer acquisition, engagement, conversion, experience and brand loyalty.\n• Translate quantitative data into actionable recommendations and to translate business objectives into marketing goals and measurements.\n\nRequirements:\n• Masters or PhD in Computer Science, Engineering, Mathematics, Statistics, Biostatistics or fields related to data mining preferred.\n• 2+ years of industry experience in at least one programming language (e.g., Python, Golang, Scala) and Unix/Linux system and comfortable working with large datasets and conducting complex data analysis using SQL, Python or R.\n• Good knowledge in statistical methods, classical machine learning (classification, regression, clustering, etc), deep learning, reinforcement learning.\n• Experience in Tensorflow/Pytorch machine learning framework, distributed data processing framework (e.g., Hadoop, Spark) and conducting production environment A/B test.\n• Experience of marketing domain knowledge and concepts: marketing mix modelling, propensity modelling, customer lifecycle management, CRM, customer segmentation, membership management, cross-sell and up-sell preferred.\n• Good communication skills with demonstrated ability to deliver and explain technical content to stakeholders and teamwork mindset.\n• Ability to deliver on tight timelines and work closely with cross-functional teams.\n\nPreference will be given to candidates with the following additional requirements as below:\n• Ability to write production-level code in Python, Golang or Scala and practical development experience in deploying real-time model serving in production.\n• Practical development experience in NoSQL database like Cassandra, ScyllaDB, Redis.\n• CV/Tensorflow/Caffe machine learning framework", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEYXRhIFNjaWVudGlzdCAtIE1hcmtldGluZyBTY2llbmNlIiwiY29tcGFueV9uYW1lIjoiU2hvcGVlIiwiY29tcGFueV9taWQiOiIvZy8xMWdoM2ZrMzRyIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoicE93T3N5UUFVTVo2SWlpNUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFUyc3dSVkJpYW5SWlRqZDNjbmMwVlhGcWJsSnNNbFkzVmtoZmNrWTVlVjh3VG5CQ1ltd3pRVTV0TVVkU01FNVZYelI0TFhONk5sQmpSbFY0VTFOVE5WSkRPRzFFVjNwZmRtcEdNak5PWkcxYVkyWk5aalZyWWtrNWFVdG1XRGhQUmswemEzTjRhMlpDV0RsYWNVZGpNR001UVhSQ1VuZFZTV3BuYjJ0eWEwRXpRbUpFUWpkdlVGZHFTbDlPY1ZwWVpHMXZWMkoyZEZOSVkxQm5FaFpVV0hGRFdVOHlVVVk0UzJkMFVWaENhbUl5WjBGUkdpSkJUMDFaVW5kRWMyZExhRWhtWjFWeldFdGtXRkp3ZWs1R1kzcDVUa1kwZDBKMyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzE1IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEthcmtpZGkiLCJsaW5rIjoiaHR0cHM6Ly93d3cua2Fya2lkaS5jb20vam9iLWRldGFpbHMvMTEyMz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Machine Learning Engineer, Ads - Gaming Vertical Solution", "company_name": "ByteDance", "location": "Singapore", "via": "via Neuvoo", "description": "Responsibilities\n\nGiven the fast growing of ByteDance in the world, we are working on building next-generation system for ByteDance Ads. We are seeking machine learning engineers who can help us to build end-to-end Vertical Solutions of Gaming Ads. What You'll Do 1. Participate in the development of a large-scale Ads system for ByteDance.2. Participate in the development and iteration of Ads algorithms by using Machine Learning.3. Partner with product managers and product strategy & operation team to define product strategy and features.Qualifications1. Solid programming skills, proficient in C/C++.2. Familiar with at least one mainstream deep learning programming framework (TensorFlow/Caffe/MXNet), and its architecture and implementation mechanism.3. Familiar with deep learning algorithms (CNN/RNN/LSTM, etc.).4. Ability to solve problems independently, good sense of teamwork and communication skills.5. Has experience with open sourced deep learning framework. Preferred... Qualifications: 1. Familiar with main components for Ads system, including bidding, ranking and auction.2. Experience in resource management and task scheduling with large scale distributed software (such as Spark and TensorFlow", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJNYWNoaW5lIExlYXJuaW5nIEVuZ2luZWVyLCBBZHMgLSBHYW1pbmcgVmVydGljYWwgU29sdXRpb24iLCJjb21wYW55X25hbWUiOiJCeXRlRGFuY2UiLCJjb21wYW55X21pZCI6Ii9nLzExZ2huZnIwc3YiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJiSzFrN0hMbU9PZFB0NURmQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VVdSSmVYRmhSRWN3VlVkVmFFSndZM1pSYlhkc1EwRlpNRGh4ZURkSGQzWnpkakZSVW0xRk56bGxWMlYxZG1kM2MxQTVPSGhxTm1wRWNHOVROV3BKYzNOS1ZXSjROREZmTjJwM1JsRlJSVjlTYmsxaWRXMTBkR1pLUnpSd1EyZHRWMFV3V1ZGSVgyUTVORGMzWW5OWWJFeGxhbTlqTFZGeVpsUndOMFZKY0VsZlIwSnBaa1J1WVdsRVVXbHJaWE0xWTFsQ2NUaDFUVEI2YUZsM0VoWlVXSEZEV1U4eVVVWTRTMmQwVVZoQ2FtSXlaMEZSR2lKQlQwMVpVbmREU1dkSFpXcHJZVnBuWVhseGF6Y3hVVkpNYm1GU2RHRlVTRmQzIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMjIiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTmV1dm9vIiwibGluayI6Imh0dHBzOi8vc2cubmV1dm9vLmNvbS92aWV3Lz9pZD05YjI5OTgyZGUyODZcdTAwMjZ1dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Research Fellow - Maritime Studies-Supply Chain Management-Economics-Data Science", "company_name": "Nanyang Technological University", "location": "Singapore (+1 other)", "via": "via Monster", "description": "Job Description :\nThe School of Civil and Environmental Engineering is looking for a Research Fellow.\nThe Research Fellow will work on a project to conduct the research on development of sustainable shipping management. The roles of this position include:\n• Research on the business and policy aspects of managing sustainability in maritime firms\n• Prepare and publish research papers on top journals\n• Development of descriptive or predictive models for sustainable shipping management and business performance of maritime firms\n• Economic analysis of sustainability choices of maritime firms\n• Text mining of sustainability reports of maritime firms\n\nJob Requirements:\n• PhD in Maritime Studies, Supply Chain Management, Economics, Data Science or related field\n• Proficient in statistical modelling, econometrics, predictive analytics, simulation or data or text mining\n• Knowledge in the maritime or logistics industry is an advantage\n• Publication track record is an advantage\n• Proficiency in... English\n\nWe regret that only shortlisted candidates will be notified.Hiring Institution: NTU", "extensions": ["25 days ago", "Full–time"], "detected_extensions": {"posted_at": "25 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJSZXNlYXJjaCBGZWxsb3cgLSBNYXJpdGltZSBTdHVkaWVzLVN1cHBseSBDaGFpbiBNYW5hZ2VtZW50LUVjb25vbWljcy1EYXRhIFNjaWVuY2UiLCJjb21wYW55X25hbWUiOiJOYW55YW5nIFRlY2hub2xvZ2ljYWwgVW5pdmVyc2l0eSIsImNvbXBhbnlfbWlkIjoiL20vMGw0OWsiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJxTmRKQktIb1FPb1BocXZvQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFcUVDQ3VJQlFVNVZYMDV4VVhOdFZXa3RWM0JTY1RsMVdrVmlTbkJGUzNKR2EweGFOM3BoV1V3emRXZFBZVEV6U0ZwbFNqRTNSRnBLUTJOT01ITnFNREJNZUhGVWNXbFhRVzAxTFRWVmEwbFhVVWt3U0hsbU9IVTVNM05FTUdoa1JrTmFZMGt4YTNoSGJWZENaeko1YWtSYVNWbDBNa1ZOVlZGeVowYzJZMkpEWjFaT2J6WjBNbHA2Y2xWdmFreEhMWFo2YVdGQlZWcG5WRVp1V25wcmFUTjRjamRIWm1GaWIxWmhXWGR6YjBaMU9YcEVVRWxPWmtGTFUyMWlRbVV3UTBoTmRuaFpPR3R1VFVGYVRGZFFTMjE1UVd4aFNGRktRVkE1VVdkS2JFVjRXamxSYVhsR1VSSVdWRmh4UTFsUE1sRkdPRXRuZEZGWVFtcGlNbWRCVVJvaVFVOU5XVkozUXpGeVJGVjFkWFJsVTI1Q0xXOVZYMnBoYnpWV1ltTXhXbUZGUVEiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18zMCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNb25zdGVyIiwibGluayI6Imh0dHBzOi8vd3d3Lm1vbnN0ZXIuY29tLnNnL2FtcC9qb2ItdmFjYW5jeS1yZXNlYXJjaC1mZWxsb3ctbWFyaXRpbWUtc3R1ZGllcy1zdXBwbHktY2hhaW4tbWFuYWdlbWVudC1lY29ub21pY3MtZGF0YS1zY2llbmNlLW5hbnlhbmctdGVjaG5vbG9naWNhbC11bml2ZXJzaXR5LXNpbmdhcG9yZS0yNjcyNjU5Ny5odG1sP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "AI Chief Data Scientist", "company_name": "Nudgyt Pte. Ltd", "location": "Singapore", "via": "via WhatJobs", "description": "Show recruiters you're immediatley available for job opportunities\n\nPosted On: 5 days ago Total Views: 5 Job Id: 27677155\n\nPermanent Job\n\nJob Description\n\nJob Summary\n\nNudgyt is looking for a Chief Data Scientist to lead our data science team.\n\nNudgyt is a A.I company that is the first to combine Behavioural Science and Artificial Intelligence to create Personality specific nudges to help people understand data and drive action towards desired goals.\n\nOur Nudge engine is currently deployed to help managers improve performance and retention among their teammates by giving them personalized advice for each of their teammates. Ensuring that the Millennial Teammate gets the growth and learning he needs while that new parent in your team gets the work life balance he needs.\n\nWe have been tasked to expand the use of our Nudge engine into other product verticals such as education, finance or sales maximization.\n\nAs the Chief Data Scientist, you will be responsible for leading, building and... training our data science team into researching and deployment of Nudgyt’s Nudge engine into various product verticals and clients.\n\nYour main challenge is leading your team to understand the client’s business processes, identify the client’s critical challenges, locate key data sources and customize our data science offerings to the client to help solve the challenges the client faces.\n\nSince the startup space can get crazy, we are looking for someone who is up for all kinds of challenges and has the initiative to seek out ways to be useful. We move fast, and we expect you to keep up with the all hands on board approach!\n\nDuties and Responsibilities\n\nUnderstanding Clients Needs\n\nMeeting clients from different levels in the organization to understand the client’s business processes, identify key data sources, and customize our data science offerings to their context. Gathering client information and requirements Understanding the underlying business challenges Understand the challenges in data flow from clients Understand the data literacy among end users. Build quick model prototypes (e.g. prediction, forecasting, clustering) using both proven and experimental techniques Selecting the right algorithms / adapting different algorithms when the half life of the initial algorithm expires.\n\nClient management\n\nCommunicating recommendations to clients at various levels of their organization to develop or customize Nudgyt’s services: Allowing clients to understand how A.I can and cannot solve the business problem Allowing clients to understand the strengths and limits of humans and A.I in designing new personalized processes (as compared to conveyor belt processes)\n\nBuilding up data science team\n\nTraining and mentoring data science team in developing new products and services. Understanding the development-cost tradeoffs when developing A.I models in line with business objectives.\nSkills and Competencies\n\nMust have:\n\nMust have led a team to build and deploy Machine Learning models for paying Enterprise clients. At least 6+ years of experience in Data Science or Mathematical Statistics. C-suite leadership experience in running a cash flow positive startup. Mentored or trained interns or new developers on Machine Learning Have made hiring decisions with regards to new developers and data scientists. Worked with an international team remotely Experience in communicating directly with clients at each of the following levels:( C-suite, IT Staff, Frontline staff)\n\nNice to have\n\nHistory or background knowledge of behavioural science concepts and authors like Dan Ariely, Richard Thaler or Angela Duckworth. Understanding of Edge computing, Hidden Markov Models and Networked Learning models Clients must have actively used deployed Machine Learning product for more than 2 years. This helps us evaluate if you understand algorithm half life and how algorithms are constantly evolving and need to be updated.\n\nTechnical Skills\n\nTensorflow Experience in designing, deploying or maintaining end-to-end ML systems in production using Docker/Kubernetes Python Familiarity with cloud platforms like AWS or Azure\n\nJob Factors\n\nWilling to work on a results basis (this means pushing hard when deadlines loom but relaxing and learning when there is more time.)\n\nJob Environment The successful candidate will be responsible to establish an AI lab in Singapore, to work on research and development projects on Artificial Intelligence (AI), Machine Learning (ML) a\n• Develop new deep learning pipelines & models in our vision AI & AI for IoT suite of applications * Designing and deploying Machine Learning algorithms for industrial applications such as * C\n\nThe pioneer batch of data science hire have to take full ownership of the app's entire recommendation pipeline, focus on working with various teams (Product, Business, Engineering) to identify key met\n• Work as a technical expert on Artificial Intelligence/ Machine Learning (AI/ML) and present research findings to stakeholders internally and externally. Demonstrate thought leadership in the area\n\nWe are looking for a Data Scientist to analyze large amounts of raw information to find patterns that will help improve our company. We will rely on you to build data products to extract valuable busi\n\nJob Description: * Apply statistical and machine learning techniques to build models for user classification, fraud detection and other objectives. * Mine, analyze and visualize data from compan\n\nWe are looking for a data scientist who has a deep interest in theoretical and applied machine learning and loves working in a fast-paced environment. Candidate should have 1-3 years work experience\n\nDun & Bradstreet (S) Pte Ltd is looking for a passionate certified Data Scientist. The successful candidate will turn data into information, information into insight and insight into business decision\n\nHewlett Packard Enterprise is an industry leading technology company that enables customers to go further, faster. With the industry’s most comprehensive portfolio, spanning the cloud to the data cent\n\nResponsibilities * Feature engineering on financial market data and market trends * Research on financial market data with purpose of detecting trading behaviour anomaly and market patterns *\n\nGive your career a boost with Monster's resume services.\n\nSimple body text this will replace with orginal content\n\nToll Free No: +8001-012-339\n91-40 66116994", "extensions": ["4 days ago", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBSSBDaGllZiBEYXRhIFNjaWVudGlzdCIsImNvbXBhbnlfbmFtZSI6Ik51ZGd5dCBQdGUuIEx0ZCIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiOEZkdU1IVFRsRW1MVHZxcEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBXaGF0Sm9icyIsImxpbmsiOiJodHRwczovL2VuLXNnLndoYXRqb2JzLmNvbS9qb2ItZm9yLUFJLUNoaWVmLURhdGEtU2NpZW50aXN0LWluLXNpbmdhcG9yZS1zaW5nYXBvcmUtY29vcDE3NTE3NDczP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Data Scientist - Image Processing", "company_name": "Shopee", "location": "Singapore (+1 other)", "via": "via Karkidi", "description": "Job Description:\n\nWe are currently looking for Data Science candidates specialized in Computer Vision / Image Processing / Deep Learning / Reinforcement Learning to solve a variety of practical challenges in E-Commerce industry. You will work with a friendly and professional team of experts to build end-to-end products that bring value to our business.\n\nResponsibilities:\n\nYou will need to analyse problems, design solutions, experiment with suitable network architectures and hyperparameters, deploy solutions as inference APIs / pipelines, maintain solutions and improve models.\n\nYou will have technical discussions with teammates and tech lead to get more help with technical challenges and to share your findings with others. You will also share your project updates, timeline estimation and resource requirements with the Product Manager to ensure on-time deliverables.\n\nWe care about your growth:\n• As a new joiner, you will be assigned to a senior member as your mentor to help you with... your first 3 months.\n• Our culture is “learn and share”. We host regular technical sharing sessions so that you can learn from and share with others.\n• You have the freedom and exposure to design and build systematic solutions to solve real-world problems, from beginning to end, from theoretical models to engineering practice, with careful consideration of business requirements, manpower / resource cost, milestone breakdown and practical concerns.\n\nRequirements:\n\nEducation/Experience:\n• Bachelor, Master, or PhD in Computer Science / Computer Engineering or other relevant fields.\n• Two years working experience with a programming language such as Python, Golang.\n• At least one year working experience in image processing / computer vision related field.\n\nDomain Knowledge:\n• Traditional Computer Vision / Image Processing techniques.\n• Deep Learning models for image related tasks.\n• Reinforcement Learning and Natural Language Processing knowledge is a bonus.\n• Experience in some of the following domains: object detection / recognition / segmentation, visual similarity, text detection & OCR, human / face detection, generative models, reinforcement learning, video analytics, model compression / optimization.\n\nEngineering Skills:\n• Proficient in Python. Experience in Golang / C++ / CUDA is a bonus.\n• Proficient in at least one of: PyTorch, TensorFlow, MxNet.\n• Experience in OpenCV is a bonus.\n• Experience in TensorFlowServing, MxNet Model Server or TensorRT Inference Server is a bonus.\n\nPersonal Traits:\n• Curiosity\n• Self-motivated\n• Humble\n• A heart of exploration\n• Teamwork\n• Logical and analytical thinking", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEYXRhIFNjaWVudGlzdCAtIEltYWdlIFByb2Nlc3NpbmciLCJjb21wYW55X25hbWUiOiJTaG9wZWUiLCJjb21wYW55X21pZCI6Ii9nLzExZ2gzZmszNHIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiI3cDFNeHp2VjhJQk5vLU5sQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VVdGVWNsZGZaRkZmWWpORlIxTjRkbHBqZG1sWk1tZE5lamRpWVV0TVdGUkNlVWRqUTJkTVZteDNVbkYxVjFGTFptUmhTRzlGZEdZMlJraG5hVU51UWxGc1pIbGxNblZ5YjJVNWQxSndUVE0zT0VkS1ozSnlSMDFUVVd4ck1WQkVjelJ5UW1wc2RVNW5NRkJQZGtaTlpHNXVZa1JPY3paWFF6VTRaVzUyVG1kUWJtWlliM2xMU1RGb05XTXphRmxzZUdWNVFsb3dVVGhqUzJaUkVoWlVXSEZEV1U4eVVVWTRTMmQwVVZoQ2FtSXlaMEZSR2lKQlQwMVpVbmRCTUdoa09HUXRjRmRHUTJoZlJtNXpSbWczVUhoV1ptbFliVFZSIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNDIiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gS2Fya2lkaSIsImxpbmsiOiJodHRwczovL3d3dy5rYXJraWRpLmNvbS9qb2ItZGV0YWlscy8xMTczP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "SNR MACHINE LEARNING ENGINEER, SMART MFG & AI", "company_name": "Micron", "location": "Singapore (+1 other)", "via": "via Neuvoo", "description": "Micron’s vision is to transform how the world uses information to enrich life for all. ​ Join an inclusive team focused on one thing: using our expertise in the relentless pursuit of innovation for customers and partners. The solutions we create help make everything from virtual reality experiences to breakthroughs in neural networks possible. We do it all while committing to integrity, sustainability, and giving back to our communities. Because doing so can spark the very innovation we are pursuing.\n\nReq. ID: 274461\n\nThe Smart Manufacturing and AI team at Micron Technology is looking for an ambitious Machine Learning Engineer. Are you curious, high velocity and ready to solve complex problems? Do you dream in SQL and machine learning models? If so, we want you to join us! Our mission is to enable to deliver industry winning machine learning solutions to power Micron’s dominance in the highly competitive memory solutions market. Qualified applicants will have experience in a variety... of data and cloud technologies and have extensive practice modeling data, querying, and deploying scalable data pipelines to execute machine learning models. You will collaborate with Data Scientists, ML Engineers, Data engineers and expert users to build and deploy scalable AI/ML solutions that drive value and insight from Micron’s manufacturing processes and systems.\n\nResponsibilities include, but not limited to:\n• Build and maintain data/solution pipelines that feed machine learning models\n• Work in a technical team through development, deployment, and application of applied analytics, predictive analytics, and prescriptive analytics using machine learning and artificial intelligence\n• Design and optimize data structures in data management systems (Hadoop, Snowflake, and Cloud platforms) to enable AI/ML solutions.\n• Build custom software components and analytics applications\n• Create/Maintain CI/CD pipelines of machine learning solutions in the cloud\n\nEducation Qualifications:\n• Technical Degree required. Computer Science or Statistics background highly desired\n\n.\n\nMinimum Qualifications:\n• Experience in building and executing end-to-end ML systems automating training, testing and deploying Machine Learning models\n• Familiarity with machine learning frameworks (TensorFlow, PyTorch, scikit-learn, etc.)\n• Familiarity with software architecture (data structures, data schemas, etc.).\n• Software development skills and the desire to work on cutting edge development in a Cloud environment\n• Strong scripting and programming skills in one of the following, Python or Java\n• Experience with continuous integration/continuous delivery (CI/CD) tools (Jenkins, Git, Docker, Kubernetes)\n• Experience developing Machine Learning or A.I. solutions with either Python, AWS, AZURE, GCP\n• 3+ years building scalable ETL pipelines\n• 3+ years of experience with big data processing and/or developing applications and data sources\n• 3+ years of strong working knowledge of databases (Oracle, MSSQL, Snowflake, or BigQuery)\n• Outstanding analytical thinking, interpersonal, oral and written communication skills\n• Proficiency in the Microsoft Office suite\n• Ability to prioritize and meet critical project timelines in a fast-paced environment\n• Self-motivated and team oriented\n\n Preferred:\n• Deep knowledge of math, probability, statistics and algorithms\n• Demonstrated ability to study and transform data science prototypes into production solutions\n• Knowledge of computer vision and/or signal processing including techniques for classification and feature extraction\n\nWorking Location :\n\nMicron Fab10, 1, Woodlands Industrial Park D, Street 1, Singapore 738799\n\nAbout Us\n\nAs the leader in innovative memory solutions, Micron is helping the world make sense of data by delivering technology that is redefining how the world uses information. Through our global brands — Micron, Crucial and Ballistix — we offer the industry’s broadest portfolio. We are the only company manufacturing today’s major memory and storage technologies: DRAM, NAND, NOR and 3D XPoint™ memory.\n\nAbout Micron Technology, Inc.\n\nWe are an industry leader in innovative memory and storage solutions. Through our global brands – Micron® and Crucial® – our broad portfolio of high-performance memory and storage technologies, including DRAM, NAND, 3D XPoint™ memory and NOR, is transforming how the world uses information to enrich life. Backed by more than 40 years of technology leadership, our memory and storage solutions enable disruptive trends, including artificial intelligence, 5G, machine learning and autonomous vehicles, in key market segments like mobile, data center, client, consumer, industrial, graphics, automotive, and networking. Our common stock is traded on the Nasdaq under the MU symbol. To learn more visit micron.com/careers\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran or disability status.\n\nMicron prohibits the use of child labor and complies with all applicable laws, rules, regulations and other international and industry labor standards.\n\nMicron does not charge candidates any recruitment fees or unlawfully collect any other payment from candidates as consideration for their employment with Micron.\n\nFor US Sites Only: To request assistance with the application process and/or for reasonable accommodations, please contact Micron’s Human Resources Department at 1-800-336-8918 or 208-368-4748 and/or by completing our General Contact Form\n\nKeywords: Singapore || North West (SG-03) || Singapore (SG) || Frontend Manufacturing || Experienced || Regular || Engineering || #LI-ST1 || Tier 4 ", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTTlIgTUFDSElORSBMRUFSTklORyBFTkdJTkVFUiwgU01BUlQgTUZHIFx1MDAyNiBBSSIsImNvbXBhbnlfbmFtZSI6Ik1pY3JvbiIsImNvbXBhbnlfbWlkIjoiL20vMDJnZHF5IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiNjNvamxTdUtVNXo1alY5RkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXNzQkNvd0JRVTVWWDA1eFVuQmtWVGxrWVVwNE1tSldNMDE0ZWpsbFZXaHVSMjVwWlhKNVJuQkJUMkZLZFc1ZllXTkVXalpJVldSb1lWZzRNVU5oUlRWWk5DMXViRlZtU0V4elMzWk5abEZ3ZWxnMWFrNURibUZTV1hSUlRIaFJURkp4VGtGWVNIVnZkR3BKUWtkdlNXcExWSGszVTJ4UlZrMW9jMmhyZFdwTldraFpiR2xwWlZGcGFtODJUelpRWlU0U0ZsUlljVU5aVHpKUlJqaExaM1JSV0VKcVlqSm5RVkVhSWtGUFRWbFNkMEpQTVdKclYyRnNjMlZDTlVselRtaG9WR1JVU0RndFdFcFVUR2MiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY180OSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBOZXV2b28iLCJsaW5rIjoiaHR0cHM6Ly9zZy5uZXV2b28uY29tL3ZpZXcvP2lkPWFjM2FhMWU3OGM2OVx1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Research Engineer - Machine Learning-Computer Vision", "company_name": "Nanyang Technological University", "location": "Singapore (+1 other)", "via": "via Monster", "description": "Job Description :\nThe School of Computer Science and Engineering invites applications for the position as Research Engineer.\nKey Responsibilities:\n• Conduct research on deep learning and visual scene understanding\n• Develop novel algorithms for visual recognition and scene understanding\n• Develop computer vision systems\n• Write technical reports and research papers\n\nJob Requirements:\n• Master’s degree in Computer Science, Computer Engineering or related subjects\n• Research experience in visual recognition, scene understanding and deep learning\n• Excellent computer programing skills for machine learning and computer vision systems\n• Familiar with deep learning frameworks such as PyTorch\n• Strong responsibility for research/work\n\nWe regret that only shortlisted candidates will be notified.Hiring Institution: NTU", "extensions": ["20 days ago", "Full–time"], "detected_extensions": {"posted_at": "20 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJSZXNlYXJjaCBFbmdpbmVlciAtIE1hY2hpbmUgTGVhcm5pbmctQ29tcHV0ZXIgVmlzaW9uIiwiY29tcGFueV9uYW1lIjoiTmFueWFuZyBUZWNobm9sb2dpY2FsIFVuaXZlcnNpdHkiLCJjb21wYW55X21pZCI6Ii9tLzBsNDlrIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiY2xmcUdWWFNyMXNNeDZIaUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXFFQ0N1SUJRVTVWWDA1eFZHMXpSR1JqYTNNMk1UVjBWVnBFY21aM1ZrdG5jVjlaTUZKbVlYZFVjMGR2VEdOMVJYVkhYMmRNWjJ0R1VWVmhZM1pFUmtkNmVUaDFjWEYzVGs5aVdFUktWbE5NTlVoc1RVZFFabVpoUVhaNlZub3dhMU5LWlhkUlNYaHROMGRsYlVwMlpGbG5jWGxwV1ZWWk1rVkNPRXhpZFZkQ1IwSnVUREpzUWxWUFVuTnFZalZ3VkZCR1lWazFNVE0xZDBrdFEyZzJWV1p4ZFRCR09VOTBWalZpT1VSc1NqZENkR2x6YjBOYWJqWkdWMTlsUWxsT09VUkVaRTlPYTJKdVZYbERZMDUyUldKYVJWWTVVbWRIZDJKTFUyRTFRa1ZaWlZaaU5qRTFRUklXVkZoeFExbFBNbEZHT0V0bmRGRllRbXBpTW1kQlVSb2lRVTlOV1ZKM1EzaEZZbE50UjNGTmR6UnZaRTV3YUdaa1VUTnpNMHBTVUZCalFRIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNTciLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTW9uc3RlciIsImxpbmsiOiJodHRwczovL3d3dy5tb25zdGVyLmNvbS5zZy9hbXAvam9iLXZhY2FuY3ktcmVzZWFyY2gtZW5naW5lZXItbWFjaGluZS1sZWFybmluZy1jb21wdXRlci12aXNpb24tbmFueWFuZy10ZWNobm9sb2dpY2FsLXVuaXZlcnNpdHktc2luZ2Fwb3JlLTI3NTY4NjU1Lmh0bWw/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Associate, Machine Learning Engineer (AI Industrialization)", "company_name": "DBS Bank Ltd", "location": "Singapore (+1 other)", "via": "via Neuvoo", "description": "Group Technology and Operations (T&O) enables and empowers the bank with an efficient, nimble and resilient infrastructure through a strategic focus on productivity, quality & control, technology, people capability and innovation. In Group T&O, we manage the majority of the Bank's operational processes and inspire to delight our business partners through our multiple banking delivery channels. Responsibilities Apply cutting edge technologies and tools in big data and machine learning to build, manage and automate pipelines for machine learning models and analytics platform Implement machine learning algorithms and build production grade end-to-end analytics solution to solve business challenges together with Data Scientists and business team Implement and apply industry standard Auto ML solutions to solve real world challenges Create blueprint and reference architecture for various machine learning use cases Study and evaluate the state-of-the-art technologies, tools, and frameworks... of machine learning engineering, and establish, apply and maintain best practices and principles of machine learning Perform code optimization, code reviews to improve the quality of Data Scientists work Automate software testing by writing unit tests for all production code Monitor machine learning model releases, branches for different issues and user stories Manage available resources such as hardware, data, and personnel so that deadlines are met Work with different stakeholders to ensure that the banks production release process is adhered to Requirements Bachelors or masters degree in software Engineering, Computer Science or related fields 4 years of experience in industry (ideally banking, ecommerce, telecoms, retail, and consulting) with demonstrated track record of leveraging advanced analytics to achieve business impact. At least 2 years of experience in data mining and machine learning on large amount of data, and multi-tier software application development and DevOps automation Excellent understanding of software engineering principles and design patterns. Familiar with tools such as JIRA, Git and Jenkins Excellent programming skills in Python (Pandas, NumPy), SQL, bash and willingness to learn other languages as required by the project Experience with Spark, Hadoop and how to optimize Spark jobs that analyse huge amounts of data for better performance Experience with Kubernetes, PCF and services in AWS to deploy ML models as REST APIs Familiar with industry paradigms and standards for model development, validation and testing and have developed and implemented large-scaled industrial standard machine learning solutions from end to end. Strong in problem-solving, being resourceful with end to end critical thinking to find out solutions even in unfamiliar scenarios. Good communication and project management skills. Strong interests in learning about recent developments in machine learning through own initiatives Apply Now We offer a competitive salary and benefits package and the professional advantages of a dynamic environment that supports your development and recognises your achievements", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBc3NvY2lhdGUsIE1hY2hpbmUgTGVhcm5pbmcgRW5naW5lZXIgKEFJIEluZHVzdHJpYWxpemF0aW9uKSIsImNvbXBhbnlfbmFtZSI6IkRCUyBCYW5rIEx0ZCIsImNvbXBhbnlfbWlkIjoiL20vMDFxN241IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoibmJhMU1Lem1MMlVodjlfVUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFV6aDBjWGhZY0ZSRldISlFWMDV3VHpGTFYxRlVaM0E1WW1GeVlpMVFOblpHZGtsa1NVVlljR04xTkdwMWFHTmpibEpxVjI1bk5WSTNSMGxPUkRRelUwOXRMWFF6YUZodlpHRnpMVjlxWjFKUlVYZGhjM1V4Ym5wa2NHTXdVbEZZZGpkUk1IWmFiRWxUWVZKaVVVaGllWGxpY2xVMFoxRldkbU5MZVc5RlEwVjFiSFJzTWxoRFMwOTBWMlIyZDFJeWVqWTNXR3R5UjJscFpHZFJFaFpVV0hGRFdVOHlVVVk0UzJkMFVWaENhbUl5WjBGUkdpSkJUMDFaVW5kRVVFZGpZM016VDJGclpVZEZSRzF5TTFwVk9HMHlWMFptVmxwQiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzY1IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE5ldXZvbyIsImxpbmsiOiJodHRwczovL3NnLm5ldXZvby5jb20vdmlldy8/aWQ9MWEzNzljOGYwMTFhXHUwMDI2dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Data Science- Backend Engineer", "company_name": "Shopee", "location": "Singapore (+1 other)", "via": "via Karkidi", "description": "Job Description:\n• Collaborate with product managers and data scientists to productionise and deploy machine learning models\n• Develop machine learning domain related web backend services, systems, or platforms\n• Design and implement common tooling and frameworks to support high performance, high availability, and scalable services\n• Continuous maintenance and improvement of system performance, functionality, and stability\n\nMinimum Requirements:\n• Bachelor's Degree in Computer Science or related technical discipline\n• Minimum 2 years of relevant experience\n• In-depth understanding of computer science fundamentals (algorithms, data structures, operating systems, networks, databases)\n• Experience in one or more programming languages (Go, C++, Java, Python)\n• Familiar with Linux development environment\n• Experience in design and development of low latency and high concurrency web backend services\n• Familiar with software engineering best practices (unit testing, version control... continuous integration, software design patterns)\n\nPreferred Requirements:\n• Experience in design, optimisation, and use of relational databases (MySQL, PostgreSQL)\n• Experience in one or more commonly used middleware (distributed file system, cache, message queue)\n• Familiar with CI/CD tooling and infrastructure (Jenkins, Gitlab CI)\n• Familiar with common network / RPC protocols (TCP, UDP, HTTP, gRPC)\n• Familiar with virtualisation, containerisation, and orchestration technologies (Docker, Kubernetes)\n• Experience in monitoring systems (Prometheus, Grafana)\n• Experience in distributed databases and systems (Hadoop, Spark, HBase", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEYXRhIFNjaWVuY2UtIEJhY2tlbmQgRW5naW5lZXIiLCJjb21wYW55X25hbWUiOiJTaG9wZWUiLCJjb21wYW55X21pZCI6Ii9nLzExZ2gzZmszNHIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJJY05SS0RhTm1ua3pnc0lZQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VTB0UmVEQlVlWFpaY2tKclNrVnlVMHhpVUU5MVpITnZZWGhHZG5wUlUyZFFMVVphZDNwbVVraG9VMnhNZW5Gb2VVMTBhbFZ1ZFhGSGRURTRZMlZQU1U5bFdreG9SbUY2UXpkRGFYbFBOa2hRVERKRk1XaHVka05DVDNOV01FcGlWRFZJUzBNMlFVeENjbmhSTFdkck9UTk5TekowUzFCaVJEZ3pORzlqWkhobVdWTmtVSGszUlhwMGJWRlRTbEpYTmpReGNqaFNkRzFzYTFGM0VoWlVXSEZEV1U4eVVVWTRTMmQwVVZoQ2FtSXlaMEZSR2lKQlQwMVpVbmRDUlVKUlMzbDJkV0ZaV0RReFluWmhRV3h4UVVwcFRUUjBZVGgzIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNzMiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gS2Fya2lkaSIsImxpbmsiOiJodHRwczovL3d3dy5rYXJraWRpLmNvbS9qb2ItZGV0YWlscy8xMjIzP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}], "chips": [{"type": "Title", "param": "job_family_1", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Data scientist", "value": "data scientist"}, {"text": "Learning engineer", "value": "learning engineer"}, {"text": "Research associate", "value": "research associate"}, {"text": "Data science", "value": "data science"}, {"text": "Data engineer", "value": "data engineer"}, {"text": "Scientist", "value": "scientist"}, {"text": "Trainer", "value": "trainer"}, {"text": "Associate", "value": "associate"}, {"text": "Data analyst", "value": "data analyst"}, {"text": "Engineer", "value": "engineer"}, {"text": "Officer", "value": "officer"}, {"text": "Project manager", "value": "project manager"}, {"text": "Project officer", "value": "project officer"}, {"text": "Senior", "value": "senior"}, {"text": "Audit", "value": "audit"}, {"text": "Consultant", "value": "consultant"}, {"text": "Consulting", "value": "consulting"}, {"text": "Customer", "value": "customer"}, {"text": "Deputy director", "value": "deputy director"}, {"text": "Lecturer", "value": "lecturer"}, {"text": "Operations engineer", "value": "operations engineer"}, {"text": "Owner", "value": "owner"}, {"text": "Research engineer", "value": "research engineer"}, {"text": "Research scientist", "value": "research scientist"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Specialist", "value": "specialist"}, {"text": "Technical architect", "value": "technical architect"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Internship", "value": "INTERN"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Mining", "value": "/business/naics2007/21"}, {"text": "Research", "value": "/business/naics2007/5417"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Staffing", "value": "/business/naics2007/5613"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "NANYANG TECHNOLOGICAL UNIVERSITY", "value": "/m/0l49k"}, {"text": "Shopee", "value": "/g/11gh3fk34r"}, {"text": "DBS Bank Ltd", "value": "/m/01q7n5"}, {"text": "Michael Page", "value": "/m/04cxldw"}, {"text": "Micron", "value": "/m/02gdqy"}, {"text": "Air Liquide", "value": "/g/11dx9gkdhq"}, {"text": "Apple", "value": "/m/0k8z"}, {"text": "ByteDance", "value": "/g/11ghnfr0sv"}, {"text": "CTES Consulting Pte Ltd", "value": "/g/11jrn4m1xc"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "SEPPIC", "value": "/m/0g558ww"}, {"text": "Standard Chartered", "value": "/m/02hszk"}, {"text": "United Overseas Bank", "value": "/m/04gjd1"}, {"text": "AIR LIQUIDE INDUSTRIAL SERVICES PTE LTD", "value": "/g/11hg55y1rb"}, {"text": "Acronis", "value": "/m/04pjlt"}, {"text": "BIGTAPP PTE. LTD.", "value": "/g/11dxpsg5nn"}, {"text": "Burpple", "value": "/g/11dxps5yv5"}, {"text": "Covance by Labcorp", "value": "/m/03ll59"}, {"text": "DHL", "value": "/m/021086"}, {"text": "DUN & BRADSTREET (SINGAPORE) PTE. LTD.", "value": "/g/11g9mpp2ph"}, {"text": "Dathena Science", "value": "/g/11dxprdn6y"}, {"text": "EasyMile", "value": "/g/11bwh58jhs"}, {"text": "Engine Biosciences Pte. Ltd.", "value": "/g/11gxm8pr96"}, {"text": "Experis Singapore", "value": "/g/11dxpnwm3s"}, {"text": "FieldBox.ai", "value": "/g/1ptyw89vr"}, {"text": "GIC Private Limited", "value": "/g/11mpj15pxw"}, {"text": "Government Technology Agency", "value": "/g/11gh0528nq"}, {"text": "Health Sciences Authority", "value": "/m/0h7fhh"}, {"text": "Hewlett Packard Enterprise (HPE)", "value": "/g/11b804x9ty"}, {"text": "Infineon Technologies", "value": "/m/02jzkj"}, {"text": "Infinite Computer Solutions Pte Ltd", "value": "/g/11g9mj72yz"}, {"text": "Institute Of Technical Education (ITE)", "value": "/m/05_02p"}, {"text": "KPMG Singapore", "value": "/g/11dxpsb9nr"}, {"text": "Lazada", "value": "/g/1q5bfkdqp"}, {"text": "Ministry of Defence Singapore", "value": "/m/0566dt"}, {"text": "Ngee Ann Polytechnic", "value": "/m/05451y"}, {"text": "Republic Polytechnic", "value": "/m/06jgzw"}]}]}