{"search_metadata": {"id": "608279502e7d6b2daaf751f8", "status": "Success", "json_endpoint": "https://serpapi.com/searches/c3ad3d566596b469/608279502e7d6b2daaf751f8.json", "created_at": "2021-04-23 07:37:52 UTC", "processed_at": "2021-04-23 07:37:52 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28programmer%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=40", "raw_html_file": "https://serpapi.com/searches/c3ad3d566596b469/608279502e7d6b2daaf751f8.html", "total_time_taken": 1.14}, "search_parameters": {"q": "(programmer) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "40"}, "jobs_results": [{"title": "Machine Learning Software Developer", "company_name": "TEKsystems (Allegis Group Singapore Pte Ltd)", "location": "Singapore", "via": "via Laimoon.com", "description": "We are looking for a high-caliber ML Software Developer to be a part of a growing, dynamic team that aims to provide cutting-edge solutions to cater to the multiple functions across the organization.\n\nThis is a Permanent opportunity, and we have multiple headcounts.\n\nThe Position:\n• You will be working on developing a highly robust and scalable enterprise ML platform from end-to-end\n• Collaborating with data scientists in deploying machine learning models in a fast-paced & strong production environment\n• Diagnose and solve problems when machine learning pipelines fail\n• Provide suggestions and best practices for end to end ML delivery, through R&D on new technologies\n• Running machine learning tests and experiments\n\nThe Candidate:\n• 5- 10 years of solid software engineering experience\n• Programming Languages: Python (preferred), Scala, Java\n• Deep knowledge of machine learning libraries (XGBoost, Tensorflow, etc.) and hands-on experience using these\n• Strong understanding of data... structures, data modeling and software architecture\n• Strong communication & problem-solving skills\n• BSc in Computer Science, Mathematics or similar field; Master's degree is a plus\n• Ability to adapt to a dynamic, value driven, and self-motivated team culture\n\nWhat's in it for you?\n• Exposure to the latest cutting-edge ML and big data technologies\n• Strong focus on productionizing all projects\n• Rewarding work: Opportunity to have real, actual and immediate impact on the business and the industry\n• You'll work with a great team! They're exceptional at their jobs, and winning market share from their competitors every day.\n• Fun, friendly, open, tech-first company culture!\n\nFor more information you can email Nicole Sichon in our Singapore office on nicole.sichon@teksystems.com quoting Job Reference 523963 or alternatively, apply here to register your interest.\nhttp://jobs.en-sg.teksystems.com/umpmRD/machine-learning-software-developer-itcommunications-singapore-singapore-14513195\n\nAllegis Group Singapore Pte Ltd, Company Reg No. 200909448N, EA License No. 10C4544\n\nTechnology", "extensions": ["2 days ago", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJNYWNoaW5lIExlYXJuaW5nIFNvZnR3YXJlIERldmVsb3BlciIsImNvbXBhbnlfbmFtZSI6IlRFS3N5c3RlbXMgKEFsbGVnaXMgR3JvdXAgU2luZ2Fwb3JlIFB0ZSBMdGQpIiwiY29tcGFueV9taWQiOiIvZy8xMWI2ZzRia3YwIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiZXY4Z1pfNTBqaXhnMFM3MkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXNrQ0Nvd0NRVTVWWDA1eFUwdzJabkZ6WVhOQ2JHNUZiMWN6WlRSWFh6SnlVVlJHYm1GSE0zQkJYMGgxUVhkZmF6WnVlbTkxY0V3emMwdHBkVTVEUzFkMlJtZFZNbTV2YzNSeVJGRTRSRlZQVlhKZlMyMWpiVXMyU0RNdGMybEJWSGRJTmxOMmNVWTRPRzFOYjBnM1RrSTRYMFpDU0hGQ2NETlRWVjlvWTFkbGIzUlBNekZFYzJoaFVVMTVNVXRQWTNSRVdtWlRPSFpaVkc1bE9VbG5SV1JNV1hZeFFuUXhPVjlTWTBsQk4wNVNRMjR5Y2tWdmFFbFNXRTVQWmpoME5YRkdOSE52ZWpkTlRUYzJRMVZ6ZFZkWmRuVjJVblZwUjFBMVVHTndiV1YwTTFSeVNGYzFiMk52ZDJ0VlpUSTVPWFJrV2psR1lVVkRWVTV5V1ZsYU1rWlNWbXRKUjFrd1FWb3hNVkZPY0VKc01oSVVWVWh0UTFsUGJVWk1XV1pwYzBGWWRWOWlPVzhhSWtGUFRWbFNkMEpMWVVjeVlqUkVOazlUV2pORFFVVXlhVjlMVkhsRmMxbEhZM2MiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY183IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExhaW1vb24uY29tIiwibGluayI6Imh0dHBzOi8vam9icy5sYWltb29uLmNvbS9qb2JzL2V4dGVybmFsdmlldy8yNjA3Nzk2MD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Fullstack Developer (Blockchain) - Singapore", "company_name": "GovTech", "location": "Singapore (+1 other)", "via": "via JobWiz", "description": "Assurity Trusted Solutions (ATS) is a wholly-owned subsidiary of the Government Technology Agency (GovTech), incorporated to operate the National Authentication Framework (NAF) and National Certification Authority (NCA). We aim to be the Source of Trust in the use of digital services, and committed to enhance Trust and High Assurance of digital services by providing secure and convenient identity management solutions.\n\nAre you ready to be part of the only National Certification Authority (NCA) in Singapore which provides high assurance solutions that enable consumers and businesses to enjoy more seamless and safe digital transactions in their everyday lives?\n\nWe are looking for a Fullstack Developer to join us in our mission to enhance Singapore’s competitiveness as a trusted ICT hub for citizens and businesses, and to expand our product offerings into new regional markets\n\nA brief summary of your job responsibility:\n• Develop new capabilities focusing on strategic systems of... engagement where ICT provides a differentiating factor to our users.\n• Working in a cross-functional team with engineers, product manager, and product designer to understand needs and build the product\n• Deploying applications on AWS\n• Lead conversations on solutioning and system designs, establishing best practices, and mentor other engineers in the team\n\nTo succeed in this role, you will ideally have:\n• 3 years of Full Stack Development experience with a modern JS frontend framework in React.JS (using Typescript) and Backend Development experience with Node.js, Kotlin or Rust\n• Good understanding of how a web application works and basic cryptography\n• Experience with Blockchain Distributed Applications (DApp) development is a plus", "extensions": ["1 month ago", "Full–time"], "detected_extensions": {"posted_at": "1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJGdWxsc3RhY2sgRGV2ZWxvcGVyIChCbG9ja2NoYWluKSAtIFNpbmdhcG9yZSIsImNvbXBhbnlfbmFtZSI6IkdvdlRlY2giLCJjb21wYW55X21pZCI6Ii9nLzExZ2gwNTI4bnEiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJfZEhGYVRfWnZOc1RhTlZOQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdDhCQ3FJQlFVNVZYMDV4VTFJeVFUZzVkR3hyZEZFeFNGWmtabFo1Y21Oa1dHdEdlREpLWmtrMlZrdDFaMlZ0VjI1U2VVSkxUVlF4TkhKWVJXMUtkbHAyTVc1UmN6TTNNbEZQVjNWbmJITnZWSFJrYjNWU1pVSnhOVGx2ZFhCb05sVktNVFpHU0VZNWFHOXBhR3B6UzJ0eWJEbGljVUU0Y1ZoMlVFSXRlUzFNVVhsU05WRTRNWFYxYUVGR09VdzFSWGQwTW1GNlVqVXdUMDFzV0hsWlRHZERUM2RmV21sQkVoUlZTRzFEV1U5dFJreFpabWx6UVZoMVgySTVieG9pUVU5TldWSjNRMXBNUmpGbVVqZDNiekJXTTFsUVVHOTBaMWhXVUhSb1dXSjFVUSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzE1IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYldpeiIsImxpbmsiOiJodHRwczovL2pvYndpei5zZy9qb2IvQ1ItMTcyMjk2NTQzND91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Lead Software Engineer - Angular + Microservices", "company_name": "PERSOLKELLY SINGAPORE PTE. LTD.", "location": "Singapore", "via": "via LinkedIn", "description": "Dear All,\n\nWe are currently hiring AVP Level - Lead Java Developers for a Leading Organisation in SIngapore.\n\nType - Permanent\n\nLocation - Central Singapore\n\nExperience Required - 8+ Years\n\nGood to have Insurance Industry experience.\n\nPlease See More Details Below\n\nJob Purpose\n• Responsible for building and maintain Java applications, include managing Java/Java EE application development while providing expertise in the full software development lifecycle, from concept and design to testing.\n• Commitment to collaborative problem solving, translate business function/ requirement into technical design and product quality are essential.\n\nThe Job\n• Contribute in all phases of the development lifecycle.\n• Developing high-volume, low-latency applications and delivering high-availability and performance.\n• Translate application design and use cases into functional applications.\n• Design, build, and maintain efficient, reusable, and reliable application coding.\n• Identify bottlenecks and bugs... and propose solutions to these problems.\n• Prepare and produce releases of software components.\n• Takes accountability in considering business and regulatory compliance risks and takes appropriate steps to mitigate the risks.\n• Maintains awareness of industry trends on regulatory compliance, emerging threats and technologies in order to understand the risk and better safeguard the company.\n• Highlights any potential concerns /risks and proactively shares best risk management practices.\n\nOur Requirements\n• Proficient in Java, with a good knowledge of its ecosystems.\n• Solid understanding of object-oriented programming.\n• Familiar with Javascript Frameworks like Angular JS.\n• Familiar with various design and architectural patterns.\n• Skill for writing reusable Java libraries.\n• Familiarity with concepts of MVC, JDBC, and RESTful services.\n• Familiar and experienced with SQL, especially Oracle PL-SQL, packages and stored procedures..\n• Implementing automated testing platforms and unit tests.\n• Basic understanding of JVM, its limitations, weaknesses, and workarounds.\n• Analyze and perform evaluation on defect raised by user to further advice.\n• Provide support for SIT/ UAT.\n• Ability to work in a fast paced, team-oriented environment with minimum direction and management oversight.\n• Recognized University degree in relevant discipline.\n• Preferable tertiary qualification in IT and insurance industry certified (eg. LOMA).\n• Minimum 8 years’ experience in application developer position.\n• Preferably with GENERAL insurance domain knowledge.\n• Experienced in RESTful web-service, automation testing and performance tuning will be an added advantage\n\nInterested candidate please send your updated resume and below details to akhil_shylaja@persolkelly.com\n\nNotice Period\n\nFull Name As per passport :\n\nCurrent Location:\n\nCurrent Salary\n\nExpected Salary in Singapore Dollar:\n\nWe regret to inform that only shortlisted candidates will be contacted.\n\nPERSOLKELLY Company\nEA License No. 01C4394\nJayamohanan Nair Shylaja Akhil : EA Registration No. R1988025\n\nBy submitting your curriculum vitae or personal data to us in connection with your job application, you are deemed to have read and agreed to the terms of our Privacy Policy, and consented to the collection, use and disclosure of your personal data by us and our affiliates, in accordance with our Privacy Policy. Please visit www.kellyservices.com.sg for a copy of our Privacy Policy. If you wish to withdraw your consent, please drop us an email to let us know", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJMZWFkIFNvZnR3YXJlIEVuZ2luZWVyIC0gQW5ndWxhciArIE1pY3Jvc2VydmljZXMiLCJjb21wYW55X25hbWUiOiJQRVJTT0xLRUxMWSBTSU5HQVBPUkUgUFRFLiBMVEQuIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJPalNacllUME5tN2FTYjRPQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExpbmtlZEluIiwibGluayI6Imh0dHBzOi8vc2cubGlua2VkaW4uY29tL2pvYnMvdmlldy9sZWFkLXNvZnR3YXJlLWVuZ2luZWVyLWFuZ3VsYXItJTJCLW1pY3Jvc2VydmljZXMtYXQtcGVyc29sa2VsbHktc2luZ2Fwb3JlLXB0ZS1sdGQtMjUxMjIxNDA4MD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Staff Software Engineer - Java", "company_name": "Visa", "location": "Singapore", "via": "via The Muse", "description": "Company Description\n\nCommon Purpose, Uncommon Opportunity. Everyone at Visa works with one goal in mind – making sure that Visa is the best way to pay and be paid, for everyone everywhere. This is our global vision and the common purpose that unites the entire Visa team. As a global payments technology company, tech is at the heart of what we do: Our VisaNet network processes over 13,000 transactions per second for people and businesses around the world, enabling them to use digital currency instead of cash and checks. We are also global advocates for financial inclusion, working with partners around the world to help those who lack access to financial services join the global economy. Visa’s sponsorships, including the Olympics and FIFA™ World Cup, celebrate teamwork, diversity, and excellence throughout the world. If you have a passion to make a difference in the lives of people around the world, Visa offers an uncommon opportunity to build a strong, thriving career. Visa is fueled... by our team of talented employees who continuously raise the bar on delivering the convenience and security of digital currency to people all over the world. Join our team and find out how Visa is everywhere you want to be.\n\nJob Description\n\nThis position is an individual contributor role on the Issuer Processing Platform Development Team. The successful candidate will be part of a team to design and develop REST based APIs and perform unit and integration testing on newly developed components. Candidate will assist with troubleshooting and resolving defects during the software development life cycle. This role will also contribute to building and maintaining Continuous Integration and Continuous Delivery Pipelines. Candidate will interface directly with staff members of Development, Product Management, Project Management, and Quality Assurance.\n\nAs a key member of the development team, the candidate should be comfortable with driving technical ideas and communicating clearly with technical as well as non-technical audiences.\n\nEssential Functions:\n• Design and develop API based applications using Java, utilizing spring framwork.\n• Design, develop, document and implement new functionality, as well as build enhancements, modifications, and corrections to existing software.\n• Develop TDD/BDD unit-tests and oversee execution.\n• Create documentation and procedures for installation and maintenance.\n• Build and maintain relationships with global and virtual teams on software development or support issues.\n• Engage with Quality Assurance team members on defect triage and resolution.\n• Lead development and oversee programming testing functions to ensure that projects are securely delivered while fulfilling expectations.\n• Work as part of a development team and establish close working relationships with stake holders, quality assurance, architects, management and peers in engineering.\n• Identify opportunities for further enhancements and refinements to standards and processes.\n• Prepare design documents; evaluate and recommend solutions to meet user requirements; define and implement solutions.\n• Participate in the Agile process including stand-up meetings, sprint planning, reviews and retrospectives.\n• Lead by example; demonstrating accountability, mentoring junior team members, and by contributing to departmental procedures, best practices, and standards.\n\nQualifications\n\nBasic Qualifications\n• Minimum of Bachelor’s degree or equivalent\n• At least 6 years of working experience in the IT industry, preferably with advanced web development in Java environment\n\nPreferred Qualifications\n• 7-10 years of work experience and a Bachelor’s Degree or 6 years of work experience with an Advanced Degree (e.g. Masters, MBA, JD, MD) or 3 years of experience with a PhD\n• Extensive experience in architecting and developing real-time multithreaded Java applications that are fault-tolerant, scalable and can handle high volumes\n• DevOps experience preferred, with Jenkins, Chef, Kubernetes, CICD, Dockers\n• Experience in building and maintaining Continuous Integration and Continuous Delivery Pipelines\n• Experience in best practices for API development and design patterns.\n• Knowledge of .net code base is a plus\n• Knowledgeable of common developer tool sets such as Java, XML, JSON, REST, Spring etc is preferred\n• Experience in utilizing technologies such as GIT, Maven, JUnit\n• Experience with REST services\n• Design, develop, document and implement new functionality, as well as enhancements, modifications, and corrections to\nexisting software\n• Experience in creating performing tests and produce results to ensure accurate compliance with project design requirements for compliance, load and performance testing\n• Create documentation and procedures for installation and maintenance\n• Ability to develop code that follows established coding guidelines.\n• Service excellence and innovation; create opportunities; consistently think and act 'ahead of the curve.'\n• Quick learner; self-starter, detailed and thorough.\n• Working knowledge NoSQL DB considered a plus\n• Experience in all phases of software development life cycle including project management, functional requirements definition, technical design, development, testing, quality assurance, system certification, systems implementation and system validation.\n• Consistently able to assess and evaluate problems in a production environment and manage risk to the service when recommending change\n• Strong secure coding practices\n• Strong experience working in an Agile environment. Commitment to Agile values and team-based work.\n• Experience in implementing Application Telemetry to help facilitate real time and remote troubleshooting/performance monitoring\n• Should be able to understand and own component security analysis, including code and data flow review. Collaborate with security team to implement and verify secure coding techniques.\n• Experience in virtualized environments, including deployments, maintenance, and troubleshooting\n• Analyze and troubleshoot deployment issues in a timely manner\n\nAdditional Information\n\nWork Hours\n• Incumbent must make themselves available during core business hours.\n\nTravel Requirements\n• This position requires the incumbent to travel for work less than 5% of the time.\n\nMental/Physical Requirements\n• This position will be performed in an office setting. The position will require the incumbent to sit and stand at a desk, communicate in person and by telephone, frequently operate standard office equipment, such as telephones and computers, reach with hands and arms, and bend or lift up to 25 pounds.\n\nVisa will consider for employment qualified applicants with criminal histories in a manner consistent with EEOC guidelines and applicable local law", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTdGFmZiBTb2Z0d2FyZSBFbmdpbmVlciAtIEphdmEiLCJjb21wYW55X25hbWUiOiJWaXNhIiwiY29tcGFueV9taWQiOiIvbS8wMWtxam4iLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJORjdwb3BJdi1fZVd5Rk9fQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFc2tCQ293QlFVNVZYMDV4VVZWTlRteGpZbTAzY1VOdVptbDJObkpOT0dORVdsQmhZek5rT0dwdWJUWjBPR2xvVG1zd1EyOXFjQzFmZG5GQ1prOTViVTlHT1V4eFRFRk5SR3MyTUZweVZXUnlVR2d4VEc1bFdGUkZVRXh0T1RSa2RqUkNTMGgzWHpKaWNsQnZUVWg0VFZsV04yZDVUV00wVW1WMmRqUjFNME5rYVdsMldHRmlPRW8xY20wM01uQjZSekFTRkZWSWJVTlpUMjFHVEZsbWFYTkJXSFZmWWpsdkdpSkJUMDFaVW5kQk4wdzBaMUJWZDBsb1dtRk1jRVkzY1ZneVNrVktWV0ZSUzBGUiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzI3IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFRoZSBNdXNlIiwibGluayI6Imh0dHBzOi8vd3d3LnRoZW11c2UuY29tL2pvYnMvdmlzYS9zdGFmZi1zb2Z0d2FyZS1lbmdpbmVlci1qYXZhP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Software Engineer at Avnet", "company_name": "Avnet", "location": "Singapore", "via": "via BizLINKS Resources Pte Ltd", "description": "Employer Referral\n\nSoftware Engineer at Avnet\n\nJob Summary: Assist in the design and development of IoT software in MCU-based platform Principal Responsibilities: Embedded system software development with good software engineering practices IoT related protocol, sensor and software development performed with sound design considerations Architects, codes, synthesizes, simulates, tests and debugs electronic systems. Provides estimates for completion of tasks and activities. Understands customer's business and technical objectives to determine the optimum tools, devices, and methods the company can offer to assist in the achievement of those objectives. Evaluates, recommends, specifies, installs and maintains design tools. Develops and documents customer proposals, designs, methodologies and user procedures. Writes application notes. Serves as the company's technical representative to clients and suppliers. Other duties as assigned. Job Level Specifications: Foundational knowledge of... specialized disciplines, industry practices and standards, acquired via academic instruction and/or relevant work experience of substantially the same level. Develops solutions to defined tasks, typical assignments and projects. May be solved by the application of specialized foundational knowledge, using existing approaches and solutions. Work is usually performed independently and requires the exercise of judgment and discretion. Receives initial direction although work may be reviewed for accuracy and quality. Collaborates with immediate management and team members within the department or function. Actions typically affect own work assignments and department. Erroneous decisions or failure to accomplish work may require some assistance or resources to remedy. Work Experience: Min 2 years of relevant experience in embedded IoT software development using C/C++ Education and Certification(s): Bachelor or Master Degree in EE/Communication/Computer Engineering Proficiency in C/C++ programming in embedded software environment with driver development experience Experience in lower power IoT connectivity such as NB-IOT, Cat-M1, LoRaWan and Sigfox Experience in at least one IoT protocol such as MQTT, HTTPS, CoAP, and LwM2M and LoRaWAN Hands-on experience using RTOS running on ARM cortex MCU is an advantage Show more\n\nOriginal Joblink: https://sg.linkedin.com/jobs/view/software-engineer-at-avnet-2001288471 ", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciBhdCBBdm5ldCIsImNvbXBhbnlfbmFtZSI6IkF2bmV0IiwiY29tcGFueV9taWQiOiIvbS8wYzh4bWMiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiI1TG5Ud2pvb2dSZWhTeW1oQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFc2tCQ293QlFVNVZYMDV4VVdSaFVXMDNValpMYm5jNVZIbGhaWGxqUjFGMWFtZ3Raa1pOUmxaaVFURnVkelJ1WW1kUlZtZHhkSEZTU0Y4dFZEUkJTa0pqTmpsd2VDMTJhVjlDVVRoaVVGaFpPRVJYVUZGMGNHSnhiR1ozU214c2VYSnRVVXd6TFhoNVdXcFJVWFZOWTJoVE4wMTNMWFZpWldoNWFqQlBWVkppWDFZNGNYbDNjV3h6YW1SR2VXRmxUVlVTRkZWSWJVTlpUMjFHVEZsbWFYTkJXSFZmWWpsdkdpSkJUMDFaVW5kRE9UUm9lR2hQVTJaNmVqQkVWMGgzVVRCMFpYcHBaMUkwTTJSUiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzM1IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJpekxJTktTIFJlc291cmNlcyBQdGUgTHRkIiwibGluayI6Imh0dHBzOi8vd3d3LmJpemxpbmtzLmNvbS5zZy9pbmRleC5waHAvam9iLWxpc3RpbmdzLXB1YmxpYy85Mi1zb2Z0d2FyZS1lbmdpbmVlcnMvMjc5NS1zb2Z0d2FyZS1lbmdpbmVlci0yNzk1P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Pega Developer", "company_name": "Intellectuals Technologies Pte. Ltd.", "location": "Singapore", "via": "via Monster", "description": "Pega developer\n• Job Description:\n- Work on Application using PEGA PRPC, SOAP/REST, XML, SQL, JAVA etc.\n- Design and Code new technical features in Product.\n- Conduct code reviews and ensure coding standards and practices.\n- Implement and follow agile/scrum processes.\n- Responsible for Performance and Code Quality.\n- Work on User Interface related Enhancements.\n- Collaborate with other teams to solve cross functional challenges.\n- Optimize code to improve application efficiency.\n- Implement/Improve automation (in Code, Test, Deployment).\n- Work with Customers, QA and other stakeholders to understand requirements and come up with best technical solution.\n- Support QA processes and deployments.\n- Adhere and Deliver the duties as assigned by supervisor\n- Maintain compliance with all company policies and procedures\n- Should be able to lead and mentor the junior team members.\n- Should be able to write TSD, FSD\n- Should be able to provide Unit Testing scenarios.\n- Should be able to do code... review.\n- Should be able to assess the security implementations\n- Atleast 3 cycles of PRPC implementation experience.\n- Must be able use SOAP UI, QTP, HP QC\nJob Requirements:\n- Atleast 3 cycles of PRPC implementation experience.\n- Must have Pega CSA Certification\n- Should have Experience in SOAP, REST, JSON\n- Should have JAVA and mySQL experience\n- Sound Understanding of PRPC OOTB activities\nGOOD to HAVE\n- Having Banking Domain Experience is plus\n- Technical / Professional Skills\n- Pega CSA Certified\n- Windows, Linux\n- HTML, CSS, JavaScript, Ajax, MySQL\nNon-Technical / Soft Skills\n- Should be Team Player\n- Excellent communication skills\n- Having experience in writing FSD, URS, and TSD", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQZWdhIERldmVsb3BlciIsImNvbXBhbnlfbmFtZSI6IkludGVsbGVjdHVhbHMgVGVjaG5vbG9naWVzIFB0ZS4gTHRkLiIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiRGI2NU14NEdPb2g0REx6ZkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNb25zdGVyIiwibGluayI6Imh0dHBzOi8vd3d3Lm1vbnN0ZXIuY29tLnNnL2FtcC9qb2ItdmFjYW5jeS1wZWdhLWRldmVsb3Blci1pbnRlbGxlY3R1YWxzLXRlY2hub2xvZ2llcy1wdGUtbHRkLXNpbmdhcG9yZS0yNzgwMjUxMS5odG1sP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Senior Network Gameplay Programmer", "company_name": "Ubisoft", "location": "Singapore", "via": "via Bayt.com", "description": "Company Description\n\nCREATOR OF WORLDS\n\nUbisoft’s 19,000 team members, working across more than 40 locations around the world, are bound by a common mission to enrich players’ lives with original and memorable gaming experiences. Their dedication and talent has brought to life many acclaimed franchises such as Assassin’s Creed, Far Cry, Watch Dogs, Just Dance, Rainbow Six, and many more to come. Ubisoft is an equal opportunity employer that believes diverse backgrounds and perspectives are key to creating worlds where both players and teams can thrive and express themselves. If you are excited about solving game-changing challenges, cutting edge technologies and pushing the boundaries of entertainment, we invite you to join our journey and help us Create the unknown.\n\nOpening its doors in July 2008, Ubisoft Singapore features the largest AAA studio in Southeast Asia and is home to a culture that celebrates serious fun and diversity. As proud innovators of naval gameplay and water... technology, we’re super excited to be the lead studio in bringing a brand-new IP to you – Skull and Bones! Our other notable works include every Assassin’s Creed game since Assassin’s Creed II, with our latest Viking adventure being Assassin’s Creed Valhalla.\n\nJob Description\n\nYOUR DAILY ADVENTURE\n\nWhen you’re a Game Network Programmer at Ubisoft Singapore, you have direct influence over the quality of the game’s online experience. You are entrusted with developing the game’s low-level network features, and optimizing network performance. You are part of a team that holds the player’s connected experience at the core of its mission.\n\nDuring the game’s development, you commit yourself to answering the most fundamental questions: Will the game be as responsive as possible in multiplayer matches? Does the latency meet a pro-gamer’s expectations? Is the experience as seamless as it can be?\n\nAs a dependable member of a cohesive game team, you will participate in the design, coding, testing, integration and debugging of the game’s networking and multiplayer engine features. You care about providing our players with the ultimate multiplayer experience they deserve.\n\nWHAT YOU'LL DO\n• Optimize low-level networking systems to improve latency\n• Collaborate with other engineers to improve the game’s network replication\n• Educate content creators and gameplay engineers on how to maximize network reliability and replication\n• Maintain and extend documentation on network-oriented features and systems\n• Debug and optimize existing gameplay networking\n\nQualifications\n\nWHAT YOU BRING\n• Extensive years’ experience in video game development;\n• Strong C/C++ programming skills;\n• Excellent debugging skills in a multiplayer environment;\n• Familiar with multiplayer concepts like Prediction, Replication, Bandwidth and Session management.\n• Collaborate with other engineers to improve the game’s network replication\n• Educate content creators and gameplay engineers on how to maximize network reliability and replication\n• Debug and optimize existing gameplay networking\n• Attention to detail;\n• Good communication and interpersonal skills;\n\nAdditional Information\n\nWHAT YOU’LL ENJOY\n\nCheck out our list of perks and benefits here: https://www.ubisoftsingapore.com/\n\nJOIN THE SQUAD\n\nMaking games is serious business, but it's very important for us to have fun while creating awesome worlds so that we can convey the same sense of joy to millions of players in the world.\n\nCome on board and experience #LifeAtUbi for yourself, we are always on the lookout for talents who thrive in bringing their A-game to work. If this sounds like you, shoot us your resume, portfolio, and anything else to show that you’re serious about fun!\n\nWe are an equal-opportunity employer and value diversity at our company. We do not discriminate on the basis of race, ethnicity, religion, gender, sexual orientation, age or disability status", "extensions": ["9 days ago", "Full–time"], "detected_extensions": {"posted_at": "9 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgTmV0d29yayBHYW1lcGxheSBQcm9ncmFtbWVyIiwiY29tcGFueV9uYW1lIjoiVWJpc29mdCIsImNvbXBhbnlfbWlkIjoiL20vMDJxZHlqIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiMjR1MWVKdU50NGtheUVCV0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXNrQkNvd0JRVTVWWDA1eFVYTkljbGRWUVVWRllVbGtRWEJWYlhKTGQxWjNRMGRIVDFSUWEzTm5ZelZhWTJaeWVYVkZZMmR6WnpGS1lrNVZlREI0WlZNM2RHZG9NbFprYWxaRlprUmZhRzVaY3pKMVYyeDJUM2c1Y3pGa2RqQlJSemhYY0VwWlNqaE5aMVJyVUdONVRsaGlVRll3YVhKVGIxUldSakEyWWtkM1dXRlpka0V4WW14VUxXNU5UekpoWmpRU0ZGVkliVU5aVDIxR1RGbG1hWE5CV0hWZllqbHZHaUpCVDAxWlVuZENURXN5TWxwU1RHRlJPRFpuU0VWNlRrMUVPR3B4Y0RBMmFYaFIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY180NiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCYXl0LmNvbSIsImxpbmsiOiJodHRwczovL3d3dy5iYXl0LmNvbS9lbi9zaW5nYXBvcmUvam9icy9zZW5pb3ItbmV0d29yay1nYW1lcGxheS1wcm9ncmFtbWVyLTU5NDYyNTM1Lz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior Node.js Developer", "company_name": "Publicis Sapient", "location": "Singapore (+1 other)", "via": "via NodeFlair", "description": "Publicis Sapient is looking for a Senior Developer with Node.js to join our vibrant Technology team based in Singapore. You will help deliver some of the most cutting-edge digital transformation programs for our clients across Southeast Asia. You will manage the development, design, user interface, technology integration, and site architecture management. In this hands-on consultant role, you will engage with the client to build and maintain relationships and work as a regional cross-functional agile delivery team member.\n\nThis role is an excellent opportunity for someone who wants to join an international global organization with a 'start-up' mentality. We highly value Openness, Collaboration, Learning Mindset, and partnering with our clients to drive Positive Outcome\n\nYour Impact\n• Providing technical expertise for every phase of the project lifecycle—from concept development to solution design, implementation, optimization and support\n• Working with cross-functional teams to... analyze, evaluate, and incorporate strategic systems into the architecture as appropriate\n• Development of new software solutions as well as supporting, maintaining and enhancing existing systems\n• Migration from Monolithic to pure cloud-based Micro-services\n• Supporting Kubernetes for CI/CD with AWS & Dockerized deployments\n• Algorithmic solution designing & implementatio\n• GraphQL as a query language for API\n• Frameworks & libraries: Express, NodeJS, Apollo Server, Mocha & Chai\n\nQualifications\n• 5+ years experience working with Node.js (Express), GraphQL & REST API\n• Experienced in server programming & proficient in coding with Node.js & Javascript\n• Experienced in working with databases such as PostgreSQL, MySQL, Redis or MongoDB\n• Able to demonstrate a good understanding of REST\n• Experience in deploying applications to cloud services such as AWS, GCP or Microsoft Azure\n• Experienced in optimizing server performance\n• Experience in algorithmic solution designing & implementation\n• Contribute effectively in a fast-paced, deadline-driven, and collaborative programming environment\n• Lead & contribute through the completion of all phases of application development\n• Good problem solver keeping the end goal in mind with a learning mindset\n• Agile development experience to collaborate with the delivery team regionally\n\nSet Yourself Apart\n• In-depth expertise in Docker and Kubernetes\n• Knowledge in front-end coding experience in React.js is a plus\n• Experience in Digital Banking or Financial Service industry preferred\n• Relevant developer certification is a plus\n\nAdditional Information\n• Career growth and training opportunities\n• A collaborative, agile and diverse regional team\n• Comprehensive insurance and medical benefits\n• “Plugged” into a global organization with a start-up mindset", "extensions": ["24 days ago", "Full–time"], "detected_extensions": {"posted_at": "24 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgTm9kZS5qcyBEZXZlbG9wZXIiLCJjb21wYW55X25hbWUiOiJQdWJsaWNpcyBTYXBpZW50IiwiY29tcGFueV9taWQiOiIvbS8wOW44XzJrIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoidTllUjZPSDVHUmN6ejZrV0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZRQkNyY0JRVTVWWDA1eFZFb3RXRzQwV2pGaFFrTllTbW90VW1oNWNrMW5XVEJ1TjNBMk9HNXRPVWt3VGpSbFRURkRiV1JuYTBVMWFsOWthVUpuUkZCM1p6aEZNM1ZxTUcxSlJqZE1hV3d0TFVSSVlTMUZRak56ZG5sMllqQm1kVk4xUVhOQ2FuUkZiRXRwTjFWNlpIazNNak0xUWxKV1ltOTNlVzAyUkhGS1JHdEtXVTVUYUY5cmRURjJZbDkzYkZkQlRIQkxiblJGVUdWNFdUUnFiRkpqTkZKcmNVOWpNVVkyU2t4S0xVWjVWRlpaUTJWTE5tOXljbmhKRWhSVlNHMURXVTl0Umt4WlptbHpRVmgxWDJJNWJ4b2lRVTlOV1ZKM1JGZGFhMXBLVjJGMWJtNVBTMjFZWjNCSFpIRjNZV3R3VlZCT1FRIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNTQiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTm9kZUZsYWlyIiwibGluayI6Imh0dHBzOi8vbm9kZWZsYWlyLmNvbS9qb2JzL2xpc3RpbmdzLzEwNTQ0P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Senior Software Developer (Full Stack) - Remote Job in Home based | Jooble", "company_name": "Respondus, Inc.", "location": "Singapore", "via": "via Jooble", "description": "About Respondus, Inc:\nRespondus is a leading developer of assessment applications for higher education, K-12 and skills certification. Thousands of universities, K-12 districts, publishers, and testing centers use our applications to deliver 100 million assessments annually.\n\nWhy join us? Our work matters – assessments help educators know what students are learning. It’s at the beginning, middle, and end of the education process.\n\nRespondus has been a leader in the education industry for 20 years and is a growing, profitable business that is laser-focused on customers. Nearly all our revenue is recurrent (which means institutions pay us an annual fee to use it) and we have no debt or outside investors. This lets us concentrate on long-term growth that is customer-focused.\n\nAbout the position:\nThis is a full-time, full-telecommute position for a full-stack Senior Software developer. You will work with a small, dynamic team of incredibly talented developers who use the latest... technologies to create products used by tens of millions of students and educators.\n\nThis is a soup to nuts position. You must have the mindset that no project is too big or too small. Over time you may own certain products or features, but you needn’t worry you’ll get stuck in a particular role. There are plenty of new projects and challenges to keep your skills honed.\n\nWe are a tight-knit company and each person’s role is highly-valued. Little weight is put on titles (a few of us have them, but they aren’t used much). Everyone works as a team and focuses on creating awesome products that solve real needs in education and learning.\n\nRequired Skills and experience:\n• 7+ years designing and developing large-scale, production-quality code in a professional software developer role\n• 7+ experience with server side Java technologies and frameworks (Spring, Hibernate, JSP)\n• 5+ experience front-end development (HTML, Javascript, JQuery, CSS)\n• Experience with cloud architectures and Amazon Web Services, including EC2, Autoscaling, RDS, DynamoDB and SQS\n• Proficiency with relational databases (MySQL)\n• Proficiency working with Linux-based development/deployment environments\n• Deep understanding of computer science, object-oriented analysis, and software design principles\n• Bachelors or higher degree in Computer Science, Engineering, or related field\n• Demonstrated experience on all parts of the development process, from design to implementation and maintenance on\n• Large-scale development projects, including ownership of significant portions of the code base.\n• Able to work on small, agile teams and multiple concurrent projects.\n\nAdditional Skills:\n• AWS Solution Architect Certification is a plus\n• Mobile development experience (iOS, Android)\n• Experience working with remote/virtual teams\n• Self-starter, team player\n\nMore Information\n• This is full-telecommute position-can reside in AZ, CO, MA, WA\n• Compensation is competitive and will be commensurate with experience.\n\nPlease send a cover letter and resume, plus any additional information that will help us better know you, to View email address on jobs.github.com", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgRGV2ZWxvcGVyIChGdWxsIFN0YWNrKSAtIFJlbW90ZSBKb2IgaW4gSG9tZSBiYXNlZCB8IEpvb2JsZSIsImNvbXBhbnlfbmFtZSI6IlJlc3BvbmR1cywgSW5jLiIsImNvbXBhbnlfbWlkIjoiL2cvMTFkeHBqZHZrMCIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImxCZHdaTE9jZzFlZ1VCQXRBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2UUJDcmNCUVU1VlgwNXhWSFZ1ZFhkRlRYVlBjVUkzWkdrMFNHWjJNMWhSY0hwcVYyRnJXR0pxVWpGUWMxbFpVVzkzVGpKbVEwVTNXSGMyU1ZNMGN6STBWaTA0VVhCVWEyRk1kMlZIVjJaNlRqUmpabTlIZUd0SlkzZG5ha3BJWmpkaFNIQnljWGxWWmxaYVpUUlRibVY2V2xkcGFXNXhka0V5VUhWb2VsQkZUa2M1Um1aV2FXTkpkMWhDTmtoWVgyc3hMV1psVUdkMVRVdG1jVFZGVjFwcVltNUhSamhmTkVsMVNrUklTMHAyTVZkeFlVaFROekkxTFRsekVoUlZTRzFEV1U5dFJreFpabWx6UVZoMVgySTVieG9pUVU5TldWSjNRV2hVZHpsMWFESkRORlJJZDFCaVFXSlVZMjF6VW01T1lUWmFadyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzYxIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvb2JsZSIsImxpbmsiOiJodHRwczovL3NnLmpvb2JsZS5vcmcvamRwLzUzNTU3ODUxMDM2ODk2MDM5OC9TZW5pb3ItU29mdHdhcmUtRGV2ZWxvcGVyLShGdWxsLVN0YWNrKS0rLVJlbW90ZS1Ib21lLWJhc2VkP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Microsoft Dynamics Developer", "company_name": "Cognizant", "location": "Singapore", "via": "via Neuvoo", "description": "Cognizant hiring a Microsoft Dynamics 365 developer / Architect for Singapore location, find the below job description.\n\nJob Description:\n• Overall 5+ years’ experience in implementing large packaged CRM applications\n• Microsoft Dynamics CRM certified (Microsoft Power Apps + Dynamics 365 Developer - MB-400)\n• Well versed with the overall technical architecture of Dynamics 365\n• Must have 4+ years hands-on development experience in Dynamics project, specifically developing web services, C#, ASP.NET, Javascript and successfully integrate with Dynamics 365\n• Should have worked complete life cycle of at least 2-3 projects.\n• Must have good knowledge on Sales, Service, Marketing modules\n• Experience with deployment of Dynamics CRM solution on hand-held devices preferred\n• Well versed with different versions of .NET Framework, WPF, C# programming, CRM SDK, SQL Server\n• Experience in designing and deploying custom reports/Dashboards with Dynamics 365\n• Experience in CRM Portals, USD & Field... service\n#LI-CTSAPAC\n\nEmployee Status : Full Time Employee\n\nShift : Day Job\n\nTravel : No\n\nJob Posting : Apr 07 2021", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJNaWNyb3NvZnQgRHluYW1pY3MgRGV2ZWxvcGVyIiwiY29tcGFueV9uYW1lIjoiQ29nbml6YW50IiwiY29tcGFueV9taWQiOiIvbS8wM2JmOWgiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJOdTFFZlFESnR5YS1wdW9yQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdDhCQ3FJQlFVNVZYMDV4VWpsS2NtaEJlV0l5TjFnMGRrZDFiMmxWU2tWbmVEaHNVRWR4Um5CeldteFdRVFF5U21sSFFtZDBSVUkyY1dSU2EwbzNXRFoyV0hsbGIyeHBSbGx3VHpKSVYzRlBOMEZ2TFU1V1puQlpjVlF6TFRkemVYZG1ZbHBqUTJGWlNYTlJUVlkzZFZGb2FrOUZRbkoxYUV4V2RUZHhia050YnpNdE9XVXhPRE40WWtabmQyOWlWMjB4YWtOcmVFcEdZMVZpTWpKWVZrVnhlbkpvUTA5UkVoUlZTRzFEV1U5dFJreFpabWx6UVZoMVgySTVieG9pUVU5TldWSjNRM1pzTmpneVMxWnZSMng0TUZWUE0yeGhTa0Z1VFROMk9FbHNRUSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzY4IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE5ldXZvbyIsImxpbmsiOiJodHRwczovL3NnLm5ldXZvby5jb20vdmlldy8/aWQ9ZmUwZjNkYmQ3NjRiXHUwMDI2dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}], "chips": [{"type": "Title", "param": "job_family_1", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Software engineer", "value": "software engineer"}, {"text": "Programmer", "value": "programmer"}, {"text": "Programmer analyst", "value": "programmer analyst"}, {"text": "Senior", "value": "senior"}, {"text": "Cnc programmer", "value": "cnc programmer"}, {"text": "Engineer", "value": "engineer"}, {"text": "Analyst programmer", "value": "analyst programmer"}, {"text": "Science", "value": "science"}, {"text": "Software programmer", "value": "software programmer"}, {"text": "Assistant", "value": "assistant"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Electrical engineer", "value": "electrical engineer"}, {"text": "Executive", "value": "executive"}, {"text": "Java engineer", "value": "java engineer"}, {"text": "Java programmer", "value": "java programmer"}, {"text": "Lecturer", "value": "lecturer"}, {"text": "Manager", "value": "manager"}, {"text": "Operator", "value": "operator"}, {"text": "Project officer", "value": "project officer"}, {"text": "Senior programmer", "value": "senior programmer"}, {"text": "Senior system", "value": "senior system"}, {"text": "Senior technical", "value": "senior technical"}, {"text": "Sr. programmer", "value": "sr. programmer"}, {"text": "Systems programmer", "value": "systems programmer"}, {"text": "Technical", "value": "technical"}, {"text": "Trainee", "value": "trainee"}, {"text": "Trainer", "value": "trainer"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Mining", "value": "/business/naics2007/21"}, {"text": "Rental", "value": "/business/naics2007/532"}, {"text": "Wholesale", "value": "/business/naics2007/42"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "EPAM", "value": "/m/0dlnrc"}, {"text": "VISA", "value": "/m/01kqjn"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "Citi bank", "value": "/m/01dfb6"}, {"text": "TikTok", "value": "/g/11fy265933"}, {"text": "Ubisoft", "value": "/m/02qdyj"}, {"text": "Cognizant", "value": "/m/03bf9h"}, {"text": "HCL SINGAPORE PTE. LTD.", "value": "/g/11fy25ngsv"}, {"text": "Oracle", "value": "/m/05njw"}, {"text": "Credit Agricole Group", "value": "/m/028vbm"}, {"text": "Mindteck (India) Limited", "value": "/m/0cqj8w1"}, {"text": "Nanyang Technological University", "value": "/m/0l49k"}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Zühlke Group", "value": "/g/1hh_rg216"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Avensys Consulting Pte Ltd", "value": "/g/11g7022gjf"}, {"text": "Avnet", "value": "/m/0c8xmc"}, {"text": "GlobalTix Pte Ltd", "value": "/g/11dxpqdhrf"}, {"text": "GovTech", "value": "/g/11gh0528nq"}, {"text": "J.P.Morgan", "value": "/m/01hlwv"}, {"text": "Optimum Solutions (Singapore) Pte Ltd", "value": "/g/11g70hkrbx"}, {"text": "Razer Inc.", "value": "/m/075hc0"}, {"text": "Realtek Malaysia", "value": "/m/05wrm7"}, {"text": "Realtek Singapore Private Limited", "value": "/g/11g9n26trs"}, {"text": "Success Human Resource Centre Pte Ltd", "value": "/g/11g709_209"}, {"text": "TECHNOPALS PTE. LTD.", "value": "/g/11dxpvkynp"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "UST", "value": "/m/08kb8g"}, {"text": "UrbanFox", "value": "/g/11ghs7y0w6"}, {"text": "Adecco GS", "value": "/m/08gz46"}, {"text": "Alphanova Pte. Ltd.", "value": "/g/11f8h_czps"}, {"text": "BioMind", "value": "/g/11dymfr2l6"}, {"text": "Biqmind", "value": "/g/11g21fzhrb"}, {"text": "BitTitan", "value": "/g/11dxpksv89"}]}]}