{"search_metadata": {"id": "60827b553bea7b236dcff6c8", "status": "Success", "json_endpoint": "https://serpapi.com/searches/8a90dd350a5a7d61/60827b553bea7b236dcff6c8.json", "created_at": "2021-04-23 07:46:29 UTC", "processed_at": "2021-04-23 07:46:29 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28programmer%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=190", "raw_html_file": "https://serpapi.com/searches/8a90dd350a5a7d61/60827b553bea7b236dcff6c8.html", "total_time_taken": 0.95}, "search_parameters": {"q": "(programmer) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "190"}, "jobs_results": [{"title": "Software Developer (Javascript) (BB-F8F61)", "company_name": "SnapHunt Pte Ltd", "location": " (+1 other)", "via": "via BeBee", "description": "Join an award-winning, high-growth companyWork with a passionate and talented teamExcellent learning and career development opportunitiesOur client is an e-ticket distribution platform that serves as marketplace for tours and activities in Asia. They are an award-wining company that is expanding rapidly within Asia, and has growing partnerships with well-known brands and organisations.The JobIn this role, you will be a Scrum development team member and be responsible for :Contributing in all phases of software development cycleCollaborating with team effectively, and supporting storyboarding effort of the teamContinuously enhance applications and develop high quality code as per standards & guidelinesPerforming peer-review to ensure code quality and requirements are metSupporting the smooth delivery of SIT and UAT activitiesTroubleshooting assigned bugs in a timely manner and updating status and details in Bug/Issue Tracking SystemThe ProfileYou have a Bachelor's Degree/Post Graduate... Diploma/Professional Degree in Computer Science/Information Technology or equivalent.You have at least 2 years experience in software development.Being a Certified JAVA Developer or Certified Scrum Developer (CSD) will be an advantageYou have experience with Javascript, Frontend frameworks such as Angular and modern web technologies like HTML, CSS3You have experience with JDK 1.5 and above, J2EE and Spring, Hibernate framework, Grails/Groovy, J2EE application servers GlassFish, Jetty or equivalentYou have worked with Databases – MySQL, Oracle, SQL Server or equivalentYou have good knowledge of REST APIs and Design Patterns e.g. MVCYou are familiar with source control management system such as SVN, GIT and bug tracking system such as BugZilla, JIRA etc.Experience with mobile hybrid development as well as native e.g. Cordova/Phonegap is requiredYou have knowledge of Agile and ScrumPrior experience with C, C++ and C# is advantageousYou have strong analytical skills with ability to solve complex problemsYou have strong written and verbal communication skillsYou are a strong team player and are able to work effectively in a collaborative environmentRef: 73776029", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBEZXZlbG9wZXIgKEphdmFzY3JpcHQpIChCQi1GOEY2MSkiLCJodGlkb2NpZCI6IlAyNU9nSXVDalo1Z3NVQUtBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2Y0JDcmNCUVU1VlgwNXhVekpqYmxSVVlqZDZSbFE1UlcxTldWQmtTWFJIVmpCMU9XVm5UMGRrTkV3M1pDMW5kWEpaWm5BM1dXY3hSMTkwWTBkd1lrSmhSVkE1V1dkRWNXOWtURWhpWkRWcVlUUk9OVkJQUmtSTGNqSnhhMmw2ZEVGRmRpMUNiSGh3WkZkdU9UQXljVU50Y25JNGREUXlNMkpPY1hWVlFsQmpOVE16YUdaMk9FTnJkekp1WlhaeVEyRktWRzExY3prMmFpMTFiM1ZSYUd3MlVucFRUa1ZxUTAxM1YyWmxiMnQyYldrdGVFWTNjM2xGWTNKTkVoZFdXSFZEV1U0eWRFMWphVU01VUhkUWF6VnhhSFZCUlJvaVFVOU5XVkozUTAxUGRtdGpMVnBoY1hOd1NXeFVZV2hCVURObFdFbE9UMnRCUVEiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY183IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJlQmVlIiwibGluayI6Imh0dHBzOi8vc2cuYmViZWUuY29tL2pvYi8yMDIxMDQxNy03ZjU4MGZlNDUwMjM4YjkyNGQ0MWZkZDcwZmRmOGY2MT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Full Time Robotics-Coding-Steam Trainer", "company_name": "Gummy Education (bb) Llp", "location": "Singapore", "via": "via Monster Singapore", "description": "??????? ????????????\nAt Gummy Code, we provide a range of fun coding and robotic programmes for children aged 5 & above, so that they can harness their interest in technology from an early age and share their knowledge to their friends and loved ones.\n\n??????? ?????\n• 44 hours work week\nWorking Days\n• 5.5 work week\n• able to work on weekdays and weekends\n\n?????????\n• Across Singapore\n\n????????????????\n• Train and engage students with STEM Robotics & Coding enrichment courses and co-curricular activities for school/enrichment centre/student care students.\n• Help students to learn problem solving and computation skills.\n• Develop, review and revise curriculum and training resources for technology and STEM courses, classes and programmes.\n• Plan and prepare for class in order to acheive lesson objectives.\n• Manage courses, classes, and programmes on the ground as a Lead Trainer.\n• Direct and guide other junior trainers or teaching assistants.\n• Lead teams to participate in local and... international competitions (if required).\n\n??? ???????????? & ???????????????\n• Candidates must possess at least a Diploma or Bachelor's Degree preferably in the area of Engineering, Multimedia or Computer Science or Programming.\n• Minimum of 1 year experience in teaching robotics programme for students between 5 - 18 years old.\n• Ability to manage a class of students not exceeding 40 students.\n• Experience in robotic programme such as Lego Education WeDo 1.0, 2.0, Lego Education Mindstorm EV3, Scratch, micro: bit and Arduino.\n• High energy, enthusiastic, motivational training/teaching style.\n• Prior experience in teaching in the related fields would be an advantage.\n\n???????\n• Interested applicants, please email your resume with last salary drawn and expected salary.\n• Regret that only shortlisted applicants will be notified", "extensions": ["9 days ago", "Full–time"], "detected_extensions": {"posted_at": "9 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJGdWxsIFRpbWUgUm9ib3RpY3MtQ29kaW5nLVN0ZWFtIFRyYWluZXIiLCJodGlkb2NpZCI6Im84VVE4MW9Yb3gtXzM5YTZBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTW9uc3RlciBTaW5nYXBvcmUiLCJsaW5rIjoiaHR0cHM6Ly93d3cubW9uc3Rlci5jb20uc2cvYW1wL2pvYi12YWNhbmN5LWZ1bGwtdGltZS1yb2JvdGljcy1jb2Rpbmctc3RlYW0tdHJhaW5lci1ndW1teS1lZHVjYXRpb24tYmItbGxwLXNpbmdhcG9yZS0yNzY5MjE3Ny5odG1sP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Senior System Developer (Mulesoft)", "company_name": "Razer USA Ltd.", "location": "Singapore", "via": "via Glassdoor", "description": "Senior System Developer (Mulesoft)\nLocation: Asia-Pacific - Singapore\nBU/Function: Information Technology\nSeniority: Manager & Professionals\nJob Code: 1587\n\nJob Responsibilities\nRazer is looking for an energetic and motivated Senior Developer who will contribute in the integration team. The Senior Developer is responsible for design and technical delivery of middleware solutions for Razer, using Anypoint platform, Anypoint Studio, Data weave, Java, Microsoft Power Automate and other technologies. The right candidate must be hands-on with proven experience in leading and managing complex, international, time-critical integration projects. The candidate must be able to communicate well with internal & external facing environments, understand business requirements and translate them into a technical reality that is extendable and scalable.\n• Manage Project Implementation, Change Management and Service Desk function\n• Serving as an API and integration evangelist, acting as a trusted... advisor in guiding all sizes towards the realization of the business outcome by leveraging the application of an API-led strategy using MuleSoft technology\n• Provide architecture, analysis, build, and testing guidance for integrations / process automation solution and implementations, including encryption, security, logging, throttling, scalability and clustering\n• Develop APIs on Mulesoft platform, Business Process Orchestrations - ESB Itinerary using Mule ESB\n• Conduct in-depth code reviews to ensure best practices are being followed\n• Managing the SLAs and deliverables for multiple projects, system changes and upgrades\n• Executing the entire SDLC process and ensuring the accuracy and completeness of functional and technical documentations\n• Vendor engagement and management, responding to quotations and contracts, performing necessary budgeting and costing exercises\n• Other duties as assigned\n\nPre-Requisites\n• Bachelor’s Degree in IT or equivalent\n• 5+ years of lead/architect experience in integration/middleware solutions, with minimum 3+ years of Mulesoft development experience using MuleSoft 3.x, 4.x and Anypoint Studio\n• Experience in designing public and private enterprise secure services using RAML and/or REST based APIs with Cloud hub API manager\n• Proficiency in designing complex mule flows with connectors, components, filters, transformers and routers with support from Java\n• Experience with different built tools like Maven, Bitbucket and CI tools like Jenkins\n• Strong understanding in Enterprise platform knowledge (eg. application, data and security)\n• Experience in working with cross-functional teams in a global team environment\n• Ability to lead the team and deliver working solutions on a tight schedule and fast-paced environment\n• Strong project management and planning skills\n• Strong interpersonal skills, must be collaborative in nature and work well with others\n• Exceptional communication skills, both written and verbal\n• Experience in AWS, Azure will be an added advantage\n• MuleSoft certification/s is a plus (eg. MuleSoft Certified Platform Architect", "extensions": ["16 days ago", "Full–time"], "detected_extensions": {"posted_at": "16 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU3lzdGVtIERldmVsb3BlciAoTXVsZXNvZnQpIiwiaHRpZG9jaWQiOiJDU3RaYVd4ZTdLSW4td0lXQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUlCQ3FJQlFVNVZYMDV4VWpGTFQxUnJUWGRHU0ZaeU5FWnpjazVFUkVab1ZETldVV2szZEd4aUxVOHRXVFJJYUd3M1NFdENVWHBVUm5adllXY3pia1ZWTlhSMlRYUm9NM1F6Vm5Wd04wcHFSRUphYkhoalNsUlRVVEo0ZFc5a2RFeGplWE5MTVUxdWVEZHBaR3RWZFhSMFpYUnJRVXB6WlZCT09IRnpZMVkzWm5OclRtODBlWFJrUmxKd2RVMTZhWEZxZEZsYVNHbHFTRFJLVUY5UVpHUTJORVpoYzBobkVoZFdXSFZEV1U0eWRFMWphVU01VUhkUWF6VnhhSFZCUlJvaVFVOU5XVkozUTNSNE0zTkNlWFU0WTBaUFRVZ3paMTlmYVhOT1QzaHhlV3hrUVEiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18xOCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBHbGFzc2Rvb3IiLCJsaW5rIjoiaHR0cHM6Ly93d3cuZ2xhc3Nkb29yLnNnL2pvYi1saXN0aW5nL3Nlbmlvci1zeXN0ZW0tZGV2ZWxvcGVyLW11bGVzb2Z0LXJhemVyLXVzYS1KVl9JQzMyMzU5MjFfS08wLDMyX0tFMzMsNDIuaHRtP2psPTM3MTc0MDE3NTZcdTAwMjZ1dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "IT Software Engineer (Magento)", "company_name": "UrbanFox", "location": "Singapore", "via": "via LinkedIn", "description": "Responsibilities\n• Maintain and customize existing ecommerce (Magento) platform\n• Development of backend application services and web APIs\n• Identifying and implementing of security and data protection\n• Identifying and optimizing application performance\n• Participate in code review\n• Participate in application architecture design\n• Providing application support, identifying, and resolving technical issues\n• Such other duties and responsibilities as may be reasonably requested by your immediate supervisor / the head of department from time to time.\n\nRequirements\n• Strong programming foundation\n• At least 3 years of hands-on experience in 1 or more high performance PHP projects\n• At least 3 years of hands-on experience with relational databases, preferably MySQL\n• At least 3 years of hands-on experience with ecommerce platforms, preferably Magento\n• At least 3 years of hands-on experience with API development\n• Demonstrated ability in writing code that are well organized and reusable\n•... Team player, outspoken, always ready to share and contribute ideas\n\nGood To Have\n• Magento Certified Developer\n• Experience with Unit Testing\n• Experience with AWS, and basic DevOps skills\n• Knowledge of GIT, Laravel/Lumen\n\nKay added this: Knowledge of GIT, Laravel/Lumen [L(1]\n\nAbout UrbanFox Asia\n\nUrbanFox was unveiled on 24th October 2017, but is not new to the industry. Formerly known as Courex, she was founded in 2009, mainly operating as a Courier service company. Over the years, Courex has evolved into an end-to-end urban logistics expert that provides reliable and economical solutions to help businesses maximize its sales potential. We offer warehousing, multi-channel commerce and delivery solutions.UrbanFox has come a long way since its early days and is now a subsidiary of Keppel Logistics, and works closely with its parent company to leverage on mutual strengths. With Keppel's extensive regional network and UrbanFox’s nimbleness, we are excited about its regional prospects and the growth potential it is able to provide to its customers.We have built a strong foundation of technical know-how and we are constantly exploring new ideas with the aim of adding value to our customers’ businesses. Our team stays up to date on industry’s challenges to help realize customers’ growth ambitions so as to offer solutions that are relevant for different markets around the region.UrbanFox is passionate about building sustainable and innovative solutions that are suitable for businesses of all sizes. We aim to establish long-term partnerships with our customers by providing them with the best experience and value to their business. Accelerate your growth with us", "extensions": ["14 days ago", "Full–time"], "detected_extensions": {"posted_at": "14 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJJVCBTb2Z0d2FyZSBFbmdpbmVlciAoTWFnZW50bykiLCJodGlkb2NpZCI6ImR6ZXZGSFVvUmNjRlpMcWJBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1SUJDcUlCUVU1VlgwNXhVemszZW05WWJWUklWRE5HUVZwelRFNHlWblJtWlZBMGNuVXdSbTkyV0doNGFXbHBNbFkwVkc0M05GVk1TV3RZVW5sbVZsZEZaMWxMY3pWeE0xSXRlbFIyUWpsek1XNDVZM1YyWDFaWGRWSktaRkJ5ZW1admFtbFhhekU0U1ZsRmEyVjFTRkYyTlRGMmEzVmhVVzFSTm10T1VqTm5lRE4yYzFSNWNtNWlVMjh6YUc4emIwUm9kblJNUWxsVVdVaFphRVJ4UTJONmFGaGFUbWhuRWhkV1dIVkRXVTR5ZEUxamFVTTVVSGRRYXpWeGFIVkJSUm9pUVU5TldWSjNRV2hKZFZVd1NXUkdla0ZoU1hCNllWWnhUWFZGWDJ0c1YwcERVUSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzI2IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExpbmtlZEluIiwibGluayI6Imh0dHBzOi8vc2cubGlua2VkaW4uY29tL2pvYnMvdmlldy9pdC1zb2Z0d2FyZS1lbmdpbmVlci1tYWdlbnRvLWF0LXVyYmFuZm94LTI0OTY1MjIzMzk/cmVmSWQ9MjdjZDYxNjItYzgwZi00NmQ4LTg1OTctNGI4YTAzODEzM2M2XHUwMDI2dHJhY2tpbmdJZD1VbHpsbEdlQ3pITFZvM053N21mcjhBJTNEJTNEXHUwMDI2dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Apps Dev Senior Programmer Analyst", "company_name": "Citi bank", "location": "Singapore", "via": "via Bayt.com", "description": "The Applications Development Senior Programmer Analyst is an intermediate level position responsible for participation in the establishment and implementation of new or revised application systems and programs in coordination with the Technology team. The overall objective of this role is to contribute to applications systems analysis and programming activities.\n\nResponsibilities:\n• Conduct tasks related to feasibility studies, time and cost estimates, IT planning, risk technology, applications development, model development, and establish and implement new or revised applications systems and programs to meet specific business needs or user areas\n• Monitor and control all phases of development process and analysis, design, construction, testing, and implementation as well as provide user and operational support on applications to business users\n• Utilize in-depth specialty knowledge of applications development to analyze complex problems/issues, provide evaluation of business process... system process, and industry standards, and make evaluative judgement\n• Recommend and develop security measures in post implementation analysis of business usage to ensure successful system design and functionality\n• Consult with users/clients and other technology groups on issues, recommend advanced programming solutions, and install and assist customer exposure systems\n• Ensure essential procedures are followed and help define operating standards and processes\n• Serve as advisor or coach to new or lower level analysts\n• Has the ability to operate with a limited level of direct supervision.\n• Can exercise independence of judgement and autonomy.\n• Acts as SME to senior stakeholders and /or other team members.\n• Appropriately assess risk when business decisions are made, demonstrating particular consideration for the firm's reputation and safeguarding Citigroup, its clients and assets, by driving compliance with applicable laws, rules and regulations, adhering to Policy, applying sound ethical judgment regarding personal behavior, conduct and business practices, and escalating, managing and reporting control issues with transparency.\n\nQualifications:\n• 5-8 years of relevant experience\n• Experience in systems analysis and programming of software applications\n• Experience in managing and implementing successful projects\n• Working knowledge of consulting/project management techniques/methods\n• Ability to work under pressure and manage deadlines or unexpected changes in expectations or requirements\n\nEducation:\n• Bachelor’s degree/University degree or equivalent experience\n\nThis job description provides a high-level review of the types of work performed. Other job-related duties may be assigned as required.\n\nThe Ocean Data Warehouse team are part of a global team (North America, Belfast, Singapore, Shanghai) that are responsible for the development, expansion and running of a multi-petabyte-scale data warehouse with near real time capabilities that aims to be the industry leading platform for delivery of measurable competitive advantage in all asset classes of the Citi Global Markets business.\n\nThe data strategy that you will be a part of will deliver an enterprise warehouse of trustworthy data being available within Citi in an easy to access, timely manner and allow Citi to excel at managing and using data in order that we can rapidly grasp new business opportunities and enjoy lower costs of doing business.\n\nThis role is to work with Platform Team, monitor the different databases Ocean uses and keep the stability of the environment to provide the best service to the client’s needs.\n\nJoining the team will provide an opportunity to work in major projects with significant impact on the business. You will work in partnership with colleagues in global locations\n\n• Strong academic record, ideally with a degree in computer science, engineering, mathematics or other analytical background\n• Strong Programming skills\n• Knowledge and experience of distributed computing\n• Data Warehousing / BI design skills (platform independent)\n• Good exposure in a Unix/Linux ecosystem\n• Administration, implementation and development experience using the Hadoop Big Data ecosystem (Cloudera preferred) would be highly advantageous\n• IBM Netezza Database Implementation, SQL and Stored Procedure coding and optimization experience\n• Message Bus platform experience(Tibco/Solace)\n• ELT/ETL Experience in a Petabyte-Scale Data Warehouse\n• Strong analysis and troubleshooting skills\n• Ability to Self Learn\n• Excellent analytical and process-oriented skills\n• Excellent verbal and written skills\n• Ability to work in a demanding and fast paced environment\n• Enthusiastic, highly motivated and very detail-oriented individual\n\n-------------------------------------------------\n\nJob Family Group:\n\nTechnology\n\n-------------------------------------------------\n\nJob Family:\n\nApplications Development\n\n------------------------------------------------------\n\nTime Type:\n\n------------------------------------------------------\n\nCiti is an equal opportunity and affirmative action employer.\n\nQualified applicants will receive consideration without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.\n\nCitigroup Inc. and its subsidiaries (\"Citi”) invite all qualified interested applicants to apply for career opportunities. If you are a person with a disability and need a reasonable accommodation to use our search tools and/or apply for a career opportunity review Accessibility at Citi.\n\nView the \"EEO is the Law\" poster. View the EEO is the Law Supplement.\n\nView the EEO Policy Statement.\n\nView the Pay Transparency Posting", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBcHBzIERldiBTZW5pb3IgUHJvZ3JhbW1lciBBbmFseXN0IiwiaHRpZG9jaWQiOiJGWkZFZ2Itc01xQW8tY25mQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUlCQ3FJQlFVNVZYMDV4VkMxMmRGRmpSMTlXT0hSaU1YcG1SR0UzYzFKcVVIUkZjblZ6VjFCM2F6SlNSRzR4WldSWmEzSkhZalphU1VweFVuSk5hekp3V1MwMFZXTTFNMkZZWld0bVJVSjJlRkZYUldaSldFbE5hV0pRYVRCd2FEZEhhalJLWmpOSlZERkNUWEJyUjBkVlZqbElVRXBOVDBaVFZYWTFYMjlvYWxCUVYxWmhjRXQ0Y25aWk1WUjRkbGxhWlRsV1FqRm1ZMUJGVTJkMlIxY3daMlU1T0ZoM0VoZFdXSFZEV1U0eWRFMWphVU01VUhkUWF6VnhhSFZCUlJvaVFVOU5XVkozUWxKWVoxSlRiVlpYVjJ0aU9GVkNXWGN5ZGpkdkxUUXljbTAzWnciLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18zNCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCYXl0LmNvbSIsImxpbmsiOiJodHRwczovL3d3dy5iYXl0LmNvbS9lbi9zaW5nYXBvcmUvam9icy9hcHBzLWRldi1zZW5pb3ItcHJvZ3JhbW1lci1hbmFseXN0LTU4ODU1MjMyLz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Software Engineer (Cryptography)", "company_name": "Thales Group", "location": "Singapore", "via": "via WhatJobs", "description": "Location: Singapore, SingaporeIn fast changing markets, customers worldwide rely on Thales. Thales is a business where brilliant people from all over the world come together to share ideas and inspire each other. In aerospace, transportation, defence, security and space, our architects design innovative solutions that make our tomorrow's possible.Thales in Singapore has been present since 1973, providing state-of-the-art solutions for customers in the aerospace, defence, security and transportation markets. Today, Thales in Singapore employs over 600 people and is home to all regional avionics services, a ground transportation integration centre, and regional innovation hub.\n\nThe Cryptography team in Singapore develops embedded cryptographic libraries for the Mobile Connectivity Solutions business unit. These libraries are integrated in Thales’ products such as removable SIMs and eSIMs. As a Software Engineer, you will be working in a stimulating environment doing software development... and evaluation. This is an ideal role for engineers who want to focus on writing small but complex functions on an embedded target.\n\nA week in the life of an Embedded Software Engineer:\n\nYou will develop and validate software libraries implementing cryptographic functions You will incorporate security countermeasures suited for the end product’s requirements You will occasionally perform attacks on smartcards’ cryptographic module You will assist in the certification of smartcard products You monitor innovation in embedded cryptography. This includes new attack techniques or implementations.\n\nKnowledge, Skills and Experience:\n\nYou must have a Bachelor’s Degree in Computer Science or Computer Engineering. It would be preferred if you have a Master’s degree in Computer Science or Computer Engineering, basic understanding of modern cryptographic algorithms and secure coding, knowledge of possible attacks, software countermeasures. Proficiency in low level programming languages such as C or Assembly. Strong understanding of architecture and programming model of microcontrollers. Willingness to learn Mathematical concepts related to cryptography. It would be preferred if you have used embedded development tools like emulators or development kits. We would like someone to join our team who is a strong verbal and written communicator, logical and creative problem-solver, open-minded and a quick learner. We are looking for someone with at least 2 years of experience in a software engineering position or a related role. At Thales we provide CAREERS and not only jobs. With Thales employing 80,000 employees in 68 countries our mobility policy enables thousands of employees each year to develop their careers at home and abroad, in their existing areas of expertise or by branching out into new fields. Together we believe that embracing flexibility is a smarter way of working. Great journeys start here, apply now", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciAoQ3J5cHRvZ3JhcGh5KSIsImh0aWRvY2lkIjoib0N2VGJOMUprdEJ4MTFzYkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVJQkNxSUJRVTVWWDA1eFVXMVpUR1Y1V1ZveVJESlpNMnBqZVVKclh6aFJWMWhTT0Mxek5sZEJSazA0ZWsxYVJIZHVOVVp4ZEU5ek5FdEhSM2c1Wms0emVGaHJSbmt6ZDJwNlVrWnlZazl5WDNjNVFrNWhMVEZDTFZjMFRGcGlPSGt4UVVoTGNHUjJibXhxYkU0M2JFdHBhMEV6Y0hBdFJGTktiWEZ5VEZaTFozbzJTblJHWjJGSE5rTnJNVW81ZG5OUGVEZEhlV0ZvTFhveGJHSTJNV3hTWDB0RmVuSlJFaGRXV0hWRFdVNHlkRTFqYVVNNVVIZFFhelZ4YUhWQlJSb2lRVTlOV1ZKM1F6VmpUVk5YYUVNd01ETXljbmcxZDB0UWRGUmtUVGxMTVdwemR3IiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNDIiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gV2hhdEpvYnMiLCJsaW5rIjoiaHR0cHM6Ly9lbi1zZy53aGF0am9icy5jb20vam9iLWZvci1Tb2Z0d2FyZS1FbmdpbmVlci1DcnlwdG9ncmFwaHktaW4tU2luZ2Fwb3JlLWNvb3AxNzU2OTIxOD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Contract Executive - AML Compliance", "company_name": "NTUC Income Insurance Co-Operative", "location": "Singapore (+1 other)", "via": "via Monster", "description": "Description\n\nAs part of the AML team within Compliance, you will be performing AML\nWatchlist Filtering and Customer Due Diligence reviews, detecting\nsuspicious transactions, preparing of reports, and given the opportunity\nto enhance the AML workflow and procedures to make them more efficient\nand/or effective.\n• Assists in AML Watchlist Filtering and Customer Due Diligence reviews\nand reporting of suspicious transactions\n• Assists in enhancement of AML workflow and procedures including\nupdating of procedure manual and work instructions\n• Participate in projects related to AML\n• Participate in the follow up on audit findings\n• Undertake any tasks as assigned from time to time\n\nQualifications\n• Diploma or Degree in any discipline\n• Anti-Money Laundering Compliance-related experience and certification\nwould be preferred", "extensions": ["4 days ago", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDb250cmFjdCBFeGVjdXRpdmUgLSBBTUwgQ29tcGxpYW5jZSIsImh0aWRvY2lkIjoiOVgxS25lNURQNWE1SDI3UkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXFJQ0N1SUJRVTVWWDA1eFVtNUtZMXB4V21oTlVVeDBlREZtVlhOZlJ6aEJlbUpuTTFOMlkwSnFVa2hCTm1oc1FraHpUWEZvU0Y5aVRGRm9TbGsxTWtSMk0yZ3lVakJOY0VGVlpuZFhVelJqY1dkVGEwMWZhVTkzZFZodVNUSlVkRWRDT1ZKbE9EbFlaakJMYXpWbE5YTkhiWGswT1drNU1tZEhSVTVQV1VJeE5sRlFNSFpCYjAxblMyMUNWbTk2YVVZeGVHZExaV1ZEWVV0U1MxOUhhbkprZDJaVlVFUnpVWE5FZEZaNk1WUlllbFpJUTNsUE1WTTRSMGRFTldONWNsSkhUV2hqVTAxTlFUWnNaVFZTVTFOUWRXVjFSbVp5VUdsQlpYWjFOWGMxTFhodFVGSlRRUklYVmxoMVExbE9NblJOWTJsRE9WQjNVR3MxY1doMVFVVWFJa0ZQVFZsU2QwRnRaa3N0T0ZwR05tZHVjVU52T0dweVdFVlRUVEpKU1U5dWFYYyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzUwIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1vbnN0ZXIiLCJsaW5rIjoiaHR0cHM6Ly93d3cubW9uc3Rlci5jb20uc2cvYW1wL2pvYi12YWNhbmN5LWNvbnRyYWN0LWV4ZWN1dGl2ZS1hbWwtY29tcGxpYW5jZS1udHVjLWluY29tZS1pbnN1cmFuY2UtY28tb3BlcmF0aXZlLXNpbmdhcG9yZS0wLTUwLXllYXJzLTI2OTgwMzk1Lmh0bWw/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Big Data Developer", "company_name": "None", "location": "Singapore", "via": "via Jobs", "description": "We ar hiring for our project requirement in singapore 5 years of experience in the field of Software Engineering with good communication skills. Atleast 4 years of hands on experience in Hadoop, Hive and Oozie. Atleast 2 years of hands on experience in Apache spark programming. Atleast 2 years of experience working with AWS technologies. Good knowledge and understanding on current big data technolgies. Atleast 5 years of experience working on RDBMS systems such as Oracle, SQL Server and expert level SQL/PL-SQL programming skills. 3 years of experience working on Java/Python and experience in writing shell scrpits. Good knowledge and hands-on experience with Big Data platforms covering Hadoop data platform/tools experience on anyone of these distribution - Cloudera / Hortonworks Must Have Hands on Developing experience in Apache Spark Framework/API's (1.6 / 2.x) - Streaming, Core, SQL Must have Strong programming language background preferably on Scala or python along with SQL on Big... Data context Must have hands on experience in Big data Ingestion tools like Kafka, Sqoop, Flume with integration on DB, Message Queue, Flat files. Basic Knowledge of NoSQL storage (Hive / HBase / Impala / Kudu) & Hadoop File Format (Avro / Parquet) Basic Working knowledge Hadoop connectors across components like Kafka>Spark, Sqoop>HDFS, Flume>Kafka, Spark>HBase, Spark>Impala Good analytical and problem-solving skills with proven communication and experience in working Customer facing roles. Cloudera Certified developer certification, will be preferred We ar hiring for our project requirement in singapore 5 years of experience in the field of Software Engineering with good communication skills. Atleast 4 years of hands on experience in Ha Skills: Business Intelligence, Data Modeling, Data Warehousing, Databases, Etl, Hadoop, Hive, Microsoft Sql Server, Programming, Spark, Sql, Ssis, Software Developing, Communicate, Apache Web Server Experience: 5.00-7.00 Years", "extensions": ["22 days ago", "Full–time"], "detected_extensions": {"posted_at": "22 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJCaWcgRGF0YSBEZXZlbG9wZXIiLCJodGlkb2NpZCI6InpxbUNFQWJ0YUpJd0hMNFFBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9icyIsImxpbmsiOiJodHRwczovL3NnLmZpZGFudG8uY29tL21vYmlsZS9qb2JzL2pvYi1vcGVuaW5nL2luZm9ybWF0aW9uLXRlY2hub2xvZ3ktcHJvamVjdC1tYW5hZ2Vycy9iaWctZGF0YS1kZXZlbG9wZXItMjY1MDUyMDczP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "E-Learning Developer", "company_name": "KBA TRAINING CENTRE PTE LTD", "location": "Singapore", "via": "via LinkedIn", "description": "Develop elearning Management System and E learning courses and Supervise the e learning development team , that shall include but not be limited to: Ensure the LMS is maintained current and operational at all times Develop E Learning courses, story boarding, simple animation, interaction content and maintain content active so students have a trouble free learning experience. Content up dates of IOS and Android company training APP’s Work with company subject matter experts for developing material. Update & revise companies current E learning Portal & courses\n\nIdentify new learning methods and keep management informed of requirements Assist to establish KBAT as a leading E learning training provider with in the industry sector both Nationally and\n\nInternationally. Development and Production of company videos for training and promotions.", "extensions": ["Over 1 month ago", "$3.8K–$4.5K a month", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time", "salary": "$3.8K–$4.5K a month"}, "job_id": "eyJqb2JfdGl0bGUiOiJFLUxlYXJuaW5nIERldmVsb3BlciIsImh0aWRvY2lkIjoiSERqd3oxOWcwdnZfLVVsYkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL3NnLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvZS1sZWFybmluZy1kZXZlbG9wZXItYXQta2JhLXRyYWluaW5nLWNlbnRyZS1wdGUtbHRkLTI0MTIzOTcxNjQ/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "SENIOR SOFTWARE ENGINEER (FULL STACK)", "company_name": "Collins Aerospace", "location": "Singapore", "via": "via Collins Aerospace", "description": "Date Posted:\n2021-01-28-08:00\n\nCountry:\nSingapore\n\nLocation:\n39 Changi North Crescent, Singapore\n\nPosition Title:\n\nSenior Software Engineer (Full Stack Developer – Java, .Net)\n\nPosition Grade:\n\nP3/ P4\n\nDepartment:\n\nInnovation Hub Singapore\n\nReview by\n\nBonar Asido Sihombing\n\nJob Summary\n\n(Description of general\n\npurpose of the job)\n\nWe are looking for a highly skilled application programmer who is comfortable with both front and back end programming. Full Stack Developers are responsible for designing the application architecture, exploring best fit technology, developing the front end and back end components, and ensuring the applications performance, among other duties.\n\nFull Stack Developers will be required to see out a project from conception to final product, as a sole contributor, or part of a developer team, that requiring good organizational skills and attention to detail. This role will also be responsible for the integration with different application frameworks and... platforms within the organization’s Industry 4.0 digital solution ecosystem, as well as supporting exploration of new technology and innovation solution.\n\nRoles and\n\nResponsibilities\n\n(Essential roles, responsibilities an d activities a candidate can expect to assume in this\n\nposition)\n• Works with application development team, business unit process experts, and outsource technology partner to design and develop software applications.\n• Works with application development team, business unit process experts, and outsource technology partner to design and develop software applications.\n• Evaluate and implement best fit frameworks and integrated development environment required to provide required development infrastructure\n• Provide expertise to identify and translate system requirements into software design artefacts.\n• Creates architecture designs (at conceptual and logical level) of large and complex systems in the enterprise with the aim to make the systems sustainable and future-proof after they have been realized\n• Ensure the efficiency, security, and support of the organization's goals in the solution.\n• Create methods for compliance architecture, such as data storage, metadata management, and change control.\n• Synchronize IT systems in development plan with business needs\n• Develop well designed, efficient, testable and high-quality code\n• Develop front end application architecture - UI.\n• Develop back end applications.\n• Setting up apps servers and databases for functionality.\n• Ensure applications performance (responsiveness) and friendliness - UX.\n• Seeing through a project from conception to finished product.\n• Design and develop APIs.\n\nCompetencies\n\n(Essential competencies\n\nrequired for this position)\n\nSelection at least 3 and max 5 Rank by importance (1 being most important)\n\nType of Competencies\n\nRank\n\nAdaptability\n\n2\n\nAnalytical Skills\n\n4\n\nBusiness Judgment\n\nCommunication\n\n3\n\nCustomer Focus\n\nDeveloping Talent\n\nFocus on Results\n\n1\n\nForward Thinking\n\nListening\n\nStrategic Leadership\n\nTeamwork\n\nDimension and\n\nScope\n\n(Describe how the\n\nposition fits into the organization as a whole as well as the level of\n\naccountability)\n\nSupervisory responsibility: (if any)\n\nNo\n\nBudgetary Responsibility: Yes / No Yes\n\nOther financial metrics impacted by this position (eg. Revenue, bookings, etc) No\n\nQualification and\n\nEducation\n\nRequirements\n\n(Education and Work experience that a candidate should have when applying for position)\n\nMinimum Education required (specific field or equivalent):\n• Degree in Computer Science/ Computer Engineering/Information technology.\n• A passion for Enterprise systems integration, sustainability and future-proof\n\nMinimum years of experience in role:\n• Minimum 4 years of working experience in full software development lifecycle\n• Extensive practical Enterprise Architecture experience, certified with a recognised EA framework, e.g. TOGAF\n• Experience within Solution Design & Architecture\n• Experience with Software Development Project Management\n• Experience on Secure Software Development, secure code quality control, and application and system integration vulnerability assessment.\n• Experience with Application Development and Software Assurance in a highly regulated industry\n• Robust knowledge within Security Architecture\n• Experience working within mobile, cloud and infrastructure solutions environments\n• Proficiency with server side languages such as .Net, Node JS, Java, PHP, Python, etc.\n• Proficiency with database technology such as Ms SQL, Oracle, MySQL and MongoDB.\n• Proficiency with fundamental front end languages such as HTML, CSS and JavaScript (e.g Angular JS, React and Amber).\n• Experience with mobile apps development\n• Experience with Cloud services and cloud API services (Google Cloud, Azure, Amazon)\n• Strong communication and interpersonal skills.\n• Great individual performer as well as contributor in a team\n• Good problem solving skills.\n\nPreferred Skills (if any):\n• Demonstrated Excellent level of analytical ability, communication and interpersonal skills required to build relationships with team members to solve problems and resolve issues.\n• Experiences in full software development lifecycle\n• Extensive practical Enterprise Architecture experience, certified with a recognised EA framework, e.g. TOGAF\n• Experience within Solution Design & Architecture\n\nGeneral role in supporting ACE, EH&S, Ethics &\n\nCompliance and\n\nQuality initiatives\n\nACE:\n• Support the Continuous Improvement programs and ACE activities within the company\n• Minimum ACE Associate certification under ACP\n\nEH&S:\n• Support and participate in the EH&S programs and activities within the company\n• Report all incidents (injuries, illnesses, near misses, spills etc), hazardous conditions, and emergencies to his/her supervisor\n• Responsible for performing a risk assessment of work activities, taking corrective and preventive actions\n• Comply with EH&S regulations/policies/programs/rules and use Personal Protective Equipment (PPE)\n• Participate in audits and inspections as and when required\n• Attend EH&S training programs and takes personal responsibility for safety\n\nEthics & Compliance:\n• Understand and carry out work performance in compliance with the UTC Code of Ethics, its Supplements and governing policies and the International Trade Policies and Procedures\n\nQuality:\n• Provide a quality product/service that satisfies our customers’ needs and expectations the first time, every time\n• Emphasize a total quality management process which provides accuracy, and strict compliance with agency regulations and customer requirements, giving the highest degree of confidence; understanding that meeting the requirements of the next employee in the work flow process is just as important as meeting the needs of external customer.\n\nOthers\n\nThis job description is not necessarily a complete list of all job functions, requirements or working conditions. The Company reserves the right to modify essential job functions, job roles & responsibilities and job qualification at any time.\n\nRaytheon Technologies is An Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status, age or any other federally protected class.\n\nPrivacy Policy and Terms:\n\nClick on this link to read the Policy and Terms", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTRU5JT1IgU09GVFdBUkUgRU5HSU5FRVIgKEZVTEwgU1RBQ0spIiwiaHRpZG9jaWQiOiI4WU44RmVLUDZyQ21ja3dHQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdmNCQ3JjQlFVNVZYMDV4VWpsMWVWVndWbUpOTnpnMFp6aEdZbkJvTUdoMk1YZGtNeTA0VUZBeVRtOXNSemszZFdsRGIzUnBZMTlyZEhWWVgzcFNiVEpyV0UxNGNtUnBjamhaV1VKdWNWTjJhM2xNU0VOelJYcDRSbWd0YjNsb1FTMUtUR05DTkdJMmEzVmZPSGxTWTBKUE5tdzRORWxRTm5ObVp6UTRSRVpoUjFWTFdVNHdaazlTWlVKWFUxWTBaWFZrTWxGSWNHYzFPVkZqUmpGaFFWbExialZDUWxwTGJtTlFPQzFFV2taWGNFNVVObWxPYVZCWk1IQXdFaGRXV0hWRFdVNHlkRTFqYVVNNVVIZFFhelZ4YUhWQlJSb2lRVTlOV1ZKM1JGVnlTVzlhWjFJM2NYUjFVbTgwT0hGeVZtZEplRU15WkZWeWR3IiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNjYiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQ29sbGlucyBBZXJvc3BhY2UiLCJsaW5rIjoiaHR0cHM6Ly9qb2JzLmNvbGxpbnNhZXJvc3BhY2UuY29tL2pvYi9zaW5nYXBvcmUvc2VuaW9yLXNvZnR3YXJlLWVuZ2luZWVyLWZ1bGwtc3RhY2svMTczOC8xODgyNTE2OT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}], "chips": [{"type": "Title", "param": "job_family_1", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Software engineer", "value": "software engineer"}, {"text": "Programmer", "value": "programmer"}, {"text": "Programmer analyst", "value": "programmer analyst"}, {"text": "Senior", "value": "senior"}, {"text": "Cnc programmer", "value": "cnc programmer"}, {"text": "Engineer", "value": "engineer"}, {"text": "Analyst programmer", "value": "analyst programmer"}, {"text": "Science", "value": "science"}, {"text": "Software programmer", "value": "software programmer"}, {"text": "Assistant", "value": "assistant"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Electrical engineer", "value": "electrical engineer"}, {"text": "Executive", "value": "executive"}, {"text": "Java engineer", "value": "java engineer"}, {"text": "Java programmer", "value": "java programmer"}, {"text": "Lecturer", "value": "lecturer"}, {"text": "Manager", "value": "manager"}, {"text": "Operator", "value": "operator"}, {"text": "Project officer", "value": "project officer"}, {"text": "Senior programmer", "value": "senior programmer"}, {"text": "Senior system", "value": "senior system"}, {"text": "Senior technical", "value": "senior technical"}, {"text": "Sr. programmer", "value": "sr. programmer"}, {"text": "Systems programmer", "value": "systems programmer"}, {"text": "Technical", "value": "technical"}, {"text": "Trainee", "value": "trainee"}, {"text": "Trainer", "value": "trainer"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Mining", "value": "/business/naics2007/21"}, {"text": "Rental", "value": "/business/naics2007/532"}, {"text": "Wholesale", "value": "/business/naics2007/42"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "EPAM", "value": "/m/0dlnrc"}, {"text": "VISA", "value": "/m/01kqjn"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "Citi bank", "value": "/m/01dfb6"}, {"text": "TikTok", "value": "/g/11fy265933"}, {"text": "Ubisoft", "value": "/m/02qdyj"}, {"text": "Cognizant", "value": "/m/03bf9h"}, {"text": "HCL SINGAPORE PTE. LTD.", "value": "/g/11fy25ngsv"}, {"text": "Oracle", "value": "/m/05njw"}, {"text": "Credit Agricole Group", "value": "/m/028vbm"}, {"text": "Mindteck (India) Limited", "value": "/m/0cqj8w1"}, {"text": "Nanyang Technological University", "value": "/m/0l49k"}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Zühlke Group", "value": "/g/1hh_rg216"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Avensys Consulting Pte Ltd", "value": "/g/11g7022gjf"}, {"text": "Avnet", "value": "/m/0c8xmc"}, {"text": "GlobalTix Pte Ltd", "value": "/g/11dxpqdhrf"}, {"text": "Government Technology Agency", "value": "/g/11gh0528nq"}, {"text": "J.P.Morgan", "value": "/m/01hlwv"}, {"text": "Optimum Solutions (Singapore) Pte Ltd", "value": "/g/11g70hkrbx"}, {"text": "Razer Inc.", "value": "/m/075hc0"}, {"text": "Realtek Malaysia", "value": "/m/05wrm7"}, {"text": "Realtek Singapore Private Limited", "value": "/g/11g9n26trs"}, {"text": "Success Human Resource Centre Pte Ltd", "value": "/g/11g709_209"}, {"text": "TECHNOPALS PTE. LTD.", "value": "/g/11dxpvkynp"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "UST", "value": "/m/08kb8g"}, {"text": "UrbanFox", "value": "/g/11ghs7y0w6"}, {"text": "Adecco GS", "value": "/m/08gz46"}, {"text": "Alphanova Pte. Ltd.", "value": "/g/11f8h_czps"}, {"text": "BioMind", "value": "/g/11dymfr2l6"}, {"text": "Biqmind", "value": "/g/11g21fzhrb"}, {"text": "BitTitan", "value": "/g/11dxpksv89"}]}]}