{"search_metadata": {"id": "60827ecb5fc49360637caee1", "status": "Success", "json_endpoint": "https://serpapi.com/searches/df28c4ba6fe19860/60827ecb5fc49360637caee1.json", "created_at": "2021-04-23 08:01:15 UTC", "processed_at": "2021-04-23 08:01:15 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28software+developer%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=230", "raw_html_file": "https://serpapi.com/searches/df28c4ba6fe19860/60827ecb5fc49360637caee1.html", "total_time_taken": 1.2}, "search_parameters": {"q": "(software developer) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "230"}, "jobs_results": [{"title": "Senior / Software Engineer (Big Data)", "company_name": "EPAM Systems", "location": "Singapore", "via": "via NodeFlair", "description": "We are looking for an experienced Senior / Software Engineer specialized in Big Data in Singapore to make the team stronger.\n\nResponsibilities\n• Play a developer role\n• Write high quality and testable code following clean code principles\n• Implement functionality by following defined software development process without direct supervision\n• Read and understand project and requirement documentation\n• Create documentation describing his/her code\n• Participate in Agile Scrum activities: daily standup, demo session, retrospective, planning, etc\n\nRequirements\n• Polytechnic Diploma or above in Computer Science\n• Minimum 3 years of experience in software engineering and Big Data\n• Advanced knowledge at least one programming language such as Java, Python, Scala\n• Familiar with SQL, Bash\n• Experienced in any of big data technologies and frameworks below:\n• Spark, Spark Streaming, Kafka/ Kafka Streams, Hadoop, Yarn, HDFS, Hive, Airflow, Jupyter\n• Parquet, ORC, AVRO, CarbonData\n• Lambda, Kappa... Data Lake\n• NoSQL Data Bases\n• Data platform\n• Machine learning\n• Software Professional with experience in IT mostly with JVM based technologies and frameworks\n• Has background with different platforms and strong focus on back-ends / Big Data / Analytics Solutions\n• Core professional expertise includes: Platform Architecture, Data Pipelines Architecture, Infrastructure Deployment and Management\n• Able to support existing and potential customers with requirements capture, solutions architecture, system design, solution prototyping\n• Experience with building traditional Cloud Data Warehouses, Data Lakes. Close and intensive work on previous projects with Containers and Resource Management systems: Docker, Kubernetes, Yarn\n• Designed, prototype and adjust end to end solution\n• Designed and implemented set of ingestion workflow to parse, transform and validate input data\n• Designed and developed independent CI/CD pipelines\n• Provided technical guidance for the support team\n• Participated in communication with customer on every phase\n\nWe offer\n• Friendly team and enjoyable working environment\n• Work-life balance and flexible schedule\n• Online training library, mentoring, career development and potential partial grant of certification\n• Unlimited access to LinkedIn learning solutions\n• Referral bonuses\n• Compensation for sick leave and paid time off\n• Opportunities for self-realization", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgLyBTb2Z0d2FyZSBFbmdpbmVlciAoQmlnIERhdGEpIiwiY29tcGFueV9uYW1lIjoiRVBBTSBTeXN0ZW1zIiwiY29tcGFueV9taWQiOiIvbS8wZGxucmMiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJDSGhwUnFBNWp0X1Y1b0lfQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VkdaU2VGTTVSbE0wVm1wblowcHZTVEU0Wm1WdlN6a3RZM04xVTFkdlZsZEtkSEpxUmtsVk5qZHpPREJLWTNwTGRrWklSR3hXUkU1bFVHWmpXVlUxV0ZkYWRHOWtTbEp4UTFOTVFsSjRjbk41ZG5kdVZVeEVkVnAwVTNkTmIwdFhORFZDWkROalNTMTNjbVJXUXpaTlFYTmlkemxqWm1SU1lYWmFUMHhSYW1WQlMwRXhWMGswUmxJd2RUYzBVbmxPV21SbWVYazVjUzFJTkVSbkVoWjZTRFpEV1UxaFMwRmpkbGQwUVdGeWRUWmxTVU5SR2lKQlQwMVpVbmRCU25SYVFuRm9VVzF1TjFFMVNUWTVlR1IxY1dwV2FsTXlTWGxSIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBOb2RlRmxhaXIiLCJsaW5rIjoiaHR0cHM6Ly93d3cubm9kZWZsYWlyLmNvbS9qb2JzL2xpc3RpbmdzLzkzNTE/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Lead Software Engineer, IT - Channels (POS GI) (20000267)", "company_name": "The Great Eastern Life Assurance Co Ltd", "location": "Singapore (+1 other)", "via": "via Jobs", "description": "Lead Software Engineer, IT - Channels (POS GI) (20000267) The Great Eastern Life Assurance Co Ltd Posted on 5-Apr-21 Lead Software Engineer, IT - Channels (POS GI) (20000267) The Great Eastern Life Assurance Co Ltd Job DescriptionJob Purpose Responsible for building and maintain Java applications, include managing Java/Java EE application development while providing expertise in the full software development lifecycle, from concept and design to testing.Commitment to collaborative problem solving, translate business function/ requirement into technical design and product quality are essential. The Job Contribute in all phases of the development lifecycle. Developing high-volume, low-latency applications and delivering high-availability and performance. Translate application design and use cases into functional applications. Design, build, and maintain efficient, reusable, and reliable application coding. Identify bottlenecks and bugs, and propose solutions to these problems. Prepare... and produce releases of software components. Takes accountability in considering business and regulatory compliance risks and takes appropriate steps to mitigate the risks. Maintains awareness of industry trends on regulatory compliance, emerging threats and technologies in order to understand the risk and better safeguard the company. Highlights any potential concerns /risks and proactively shares best risk management practices. Our Requirements Proficient in Java, with a good knowledge of its ecosystems. Solid understanding of object-oriented programming. Familiar with various design and architectural patterns. Skill for writing reusable Java libraries. Knowledge of concurrency patterns in Java. Familiarity with concepts of MVC, JDBC, and RESTful services. Familiar and experienced with SQL, especially Oracle PL-SQL, packages and stored procedures. Experienced in Spring Framework, Hibernate (ORM), and Jasper report will be an added advantage. Implementing automated testing platforms and unit tests. Basic understanding of JVM, its limitations, weaknesses, and workarounds. Analyze and perform evaluation on defect raised by user to further advice. Provide support for SIT/ UAT. Ability to work in a fast paced, team-oriented environment with minimum direction and management oversight. Recognized University degree in relevant discipline. Preferable tertiary qualification in IT and insurance industry certified (eg. LOMA). Minimum 8 years’ experience in application developer position. Preferably with GENERAL insurance domain knowledge. Experienced in RESTful web-service, automation testing and performance tuning will be an added advantage High level of integrity, takes accountability of work and good attitude over teamwork. Takes initiative to improve current state of things and adaptable to embrace new changes. To all recruitment agencies: Great Eastern does not accept unsolicited agency resumes. Please do not forward resumes to our email or our employees. We will not be responsible for any fees related to unsolicited resumes. Additional Information Senior Executive Qualification Bachelor's Degree, Post Graduate Diploma, Professional Degree Founded in 1908, Great Eastern is a market leader and a well-established trusted brand in Singapore and Malaysia. With S$82.5 billion in assets and over 4 million policyholders, the Group also operates in Indonesia and Brunei and has a presence in China as well as a representative office in Myanmar. The Great Eastern Life Assurance Company Limited and Great Eastern General Limited have been assigned the financial strength and counterparty credit ratings of \"AA-\" by Standard and Poor's since 2010, one of the highest among Asian life insurance companies. We are a LIFE company and our purpose is to empower generations to live healthier and better so that they can live life to the fullest. Be it celebrating life’s simple moments or commemorating life’s major milestones, every day, in many ways, we inspire those around us to live great and celebrate life", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJMZWFkIFNvZnR3YXJlIEVuZ2luZWVyLCBJVCAtIENoYW5uZWxzIChQT1MgR0kpICgyMDAwMDI2NykiLCJjb21wYW55X25hbWUiOiJUaGUgR3JlYXQgRWFzdGVybiBMaWZlIEFzc3VyYW5jZSBDbyBMdGQiLCJjb21wYW55X21pZCI6Ii9tLzAycW5mcDciLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiIyOGJJNlB6ZUo0UnZMMXMxQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFcllDQ3ZjQlFVNVZYMDV4VVVsdkxUbDRjRkl3UjBreExVOWFZMUZPTjJsSldETnRXRlYwWjA0d05HMWFaa2hNYkVwbFpFVTFTRTVzUlRsSldESlVUVjloUkcwdFFWQjJPV2hRUjJSTllYa3RlV2xrWVZGaVgwbHZjVTVmUjJVMGJ6QlFVR2cxV2tzd1EyTlFkMEl0UkdoM1lVVmFaVEZSTUdRMVRqQjNSMnRKZDI1SlVWcERaRmRmVFdKbFkxZ3pORzAyWWpZeFMxaFlYMDFtZVhodVNqWk1ZMmw2UzJGVmFuaEJRMVZCVjFoVlEzbEpXSFpHYUdGdFdHTTRNVGhGUkhVNWFraEhlRFZZYm1neU1uWktSREZGZDJKVE1YTjVRV1JqTlZaMWQxZzVXR0pWTm5jeVFVdEhhbWR1VkVoRFdrMUxaRGxKYkdSWk4zZG9ieElXZWtnMlExbE5ZVXRCWTNaWGRFRmhjblUyWlVsRFVSb2lRVTlOV1ZKM1FrOURVVVZZTjAxSk56aHJlUzFYYmpKQk1VWmhNbko2VG5KSVVRIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMTUiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9icyIsImxpbmsiOiJodHRwczovL3NnLmZpZGFudG8uY29tL2pvYnMvam9iLW9wZW5pbmcvc29mdHdhcmUtZGV2ZWxvcGVycy1hcHBsaWNhdGlvbnMvbGVhZC1zb2Z0d2FyZS1lbmdpbmVlci1pdC1jaGFubmVscy1wb3MtZ2ktMjAwMDAyNjctMjc1NTE1ODkwP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Lead, App Development (BB-D0BD1)", "company_name": "Mediacorp", "location": "Singapore", "via": "via BeBee", "description": "Description As the Lead, App Development, you will have responsibility to provide leadership in the development and management of all the front end app and web development activities for the company’s digital products, including video, audio and news & entertainment products. As part of this responsibility you will Lead a group of web, mobile and TV app developers to develop and maintain several video, audio, news and entertainment apps for online, mobile, Smart TV and media player environments Collaborate with product managers, UX managers and designers to specify, compile product requirements and build best in class products Where development is outsourced, you will manage and work with vendors to define development specifications, manage the development timelines and project plans, and ensure the apps are designed for quality, best performance and user experience Develop performance specifications for the front end apps and web environments that are best in class, market... competitive and ensure that the development of the apps deliver on these performance specifications Employ agile development methodology in product and app development Define and enforce processes for software review, unit testing, QA and documentation Conduct regular performance benchmarking with competing products and develop enhancement plans to ensure that the company’s digital products are performing competitively with market benchmarks in their respective categories Provide leadership in managing product stakeholders, interdepartmental technology collaborations, providing regular feedback, recommendations and managing expectations to deliver positive outcomes, technology innovation and best practices Manage the drafting, issuing and running of tenders to select vendors for the above development activities Work closely with vendors in the implementation of the above workstreams to ensure timely delivery of these projects Requirements Degree in Computer Science/Information Technology/Software Engineering Certified Scrum Master would be an added advantage At least 15 years of working experience in software and systems development Proven track record in building iOS/Android/Web/Smart TV applications for media or related products, with at least 5 years of hands-on development Experience in managing apps for multiple products and large teams of at least 20-25 developers Hands-on experience in reviewing, testing and adopting new technology Test automation using tools such as Selenium, Appium etc Expertise in software architecture development Knowledge in cloud and CDN infrastructure Ability to understand, analyse and articulate business vs operational vs technology impact of activities, development initiatives and work plans Experience in managing outsourced vendors and offshore developers will be a distinct advantage Agile project management practitioner Understand data analytics and deployment Understanding UX and development process Desired application/programming competencies – Java, Objective C, C++, C#, php, , javascripts, JSON, AJAX, HTML5, Swift, XML, REST, SOAP, XCODE, MVC, CSS, .NET, MySQL, MS SQL", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJMZWFkLCBBcHAgRGV2ZWxvcG1lbnQgKEJCLUQwQkQxKSIsImNvbXBhbnlfbmFtZSI6Ik1lZGlhY29ycCIsImNvbXBhbnlfbWlkIjoiL20vMDNxdHoxIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoidlVWX0FYLXFrUElBMHdsbUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFUzSmtXbEJYU0RsbE1rcDFTVzlNZUVWNE5tZGpOa0pQU0RWblZtNUhaWFV5VDNkd1RIcEVhREJZYUdkRVdFdHpUak5VY25oMk5HZFNTV3B6VDFkUFRuaHdhM3BmWnpaRU1XRmtWRk5YVTNneVh6WlliVGxvV1hWQlNUZGlWblZ5ZDBwMlVrVkZhMVJMTFZsaGFGZEJkbmRQVFdoTlUxb3RTRjl6UjI1cVJsRnJORWgxT1hsWmQxUTBZbVZEY0cxd2JpMU1Sa3BGWXpkMGVrVjNFaFo2U0RaRFdVMWhTMEZqZGxkMFFXRnlkVFpsU1VOUkdpSkJUMDFaVW5kQmRuVjBNRGhKTUd0UWFFczBjVEo2TTNOSlJEVmtOa3hFV0c5UiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzIyIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJlQmVlIiwibGluayI6Imh0dHBzOi8vc2cuYmViZWUuY29tL2pvYi8yMDIxMDQxNy1lNzY0NTM3N2Q5ZTEwZWM1ZDQxMDlmMjA3MmFkMGJkMT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior Firmware Engineer", "company_name": "Percept Solutions Pte. Ltd.", "location": "Singapore (+1 other)", "via": "via Monster Singapore", "description": "• Software Development\n• Perform USB2.0 and USB3.0, USB PD device driver development, test, optimisation and maintenance\n• Undertake WHQL testing and certification of drivers and device frameworks\n• Participate in all phases of SDLC and prepare corresponding documentation\n• Undertake porting and maintenance of existing drivers to new frameworks and OSes\n• Resolve defects reported by internal and external customers\n• Work closely with USB host & device firmware development teams\n\nKnowledge and skill requirements:\n• Degree/Master in Computer Science/Engineering\n• 5-10 years or above experience in the area of USB device drivers development\n• Working experience from specification to delivery of certified products\n• In-depth understanding of WDM and KMDF frameworks, multi-threading and DLLs\n• Thorough knowledge of USB2.0 and USB3.0 protocols and USBCV is a must\n• Thorough understanding of USB Device Classes (HID, MSC, CDC, UVC, UAC, , DFU, Custom) is required. D2XX and D3XX knowledge is a... definite plus.\n• Knowledgeable in WinUSB and libusb (Windows or Linux)\n• Embedded development experience in WinCE, MacOS, Android and Linux is a definite plus\n• Experience working with hardware boards, scope and USB analysers\n• Experience in USB device pre-testing and USB certification\n• Professional attitude to work and meticulous in coding and testing\n• Must have participated and experienced in SQA processes\n\nEA Licence No.:18S9405 / EA Reg. No.:R1330864\n\nTo apply please click the Apply button or send us your updated profile to\n\nPercept Solutions is undergoing a growth phase and are on the lookout for talent. Applicants are encouraged to follow Percept Solutions on LinkedIn @ https://www.linkedin.com/company/percept-solutions/ to stay up to date on our upcoming roles and events", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgRmlybXdhcmUgRW5naW5lZXIiLCJjb21wYW55X25hbWUiOiJQZXJjZXB0IFNvbHV0aW9ucyBQdGUuIEx0ZC4iLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IkpUR0MxVFhYV1ViLU5CTDFBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTW9uc3RlciBTaW5nYXBvcmUiLCJsaW5rIjoiaHR0cHM6Ly93d3cubW9uc3Rlci5jb20uc2cvYW1wL2pvYi12YWNhbmN5LXNlbmlvci1maXJtd2FyZS1lbmdpbmVlci1wZXJjZXB0LXNvbHV0aW9ucy1wdGUtbHRkLXNpbmdhcG9yZS0yNjU3NDk4My5odG1sP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Senior Software Engineer ( Full Stack Java)", "company_name": "VISA", "location": "Singapore", "via": "via Bayt.com", "description": "Job Description and Responsibilities\n\nQualifications", "extensions": ["14 days ago", "Full–time"], "detected_extensions": {"posted_at": "14 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgRW5naW5lZXIgKCBGdWxsIFN0YWNrIEphdmEpIiwiY29tcGFueV9uYW1lIjoiVklTQSIsImNvbXBhbnlfbWlkIjoiL20vMDFrcWpuIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoicWl6bW5IZmJLcVN2SDl0UUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXNzQkNvd0JRVTVWWDA1eFUwWnZTM1pRUkdRemNXUnhXVTl1VWpCWk1taDZXR2s0VUZSeVdXUXlNRVp6VkZCRVExbG9WbTQzUkRWeFZtdFRZMDlIUWxoVVluZHllRWhXZVRoc1NrVTRkRE5zUjNoWGVFcFViamQ0UXpCTmRXMDROemRYUVVReGRGTnliRzlvWjFKUlVuaEtWblJwYTIxZlQwMXpaV0Z2YkROUlUxQkhXVFJPUlhkTlpWVjNVbUpHVWxnU0ZucElOa05aVFdGTFFXTjJWM1JCWVhKMU5tVkpRMUVhSWtGUFRWbFNkME5VVHpkUllsWTRUVnBVUzJaUlVHcFFlWEF6WXpGdVIybzVWMmMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18zNCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCYXl0LmNvbSIsImxpbmsiOiJodHRwczovL3d3dy5iYXl0LmNvbS9lbi9zaW5nYXBvcmUvam9icy9zZW5pb3Itc29mdHdhcmUtZW5naW5lZXItZnVsbC1zdGFjay1qYXZhLTU5Mzg5NzkyLz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Testing Engineer", "company_name": "Fusion Worldwide", "location": "Singapore (+1 other)", "via": "via Glassdoor", "description": "Position Summary:\n\nAs a member of our organization, you are responsible for CPU/IC testing and go/no-go decisions on CPU/IC's that go through the test center. Completes testing process and ensure that proper actions are being taken to screen for part quality/counterfeit and conformity. Exhibits proper use and maintenance use of all test tools and equipments\n\nWhat we can do for you!\n• Provide training to give you the knowledge to thrive in a fast-paced environment\n• Offer support through a collaborative, and open environment with proven professionals with decades of QC expertise\n• Enable growth through direct and focused mentorship\n\nWhat can you do for us!\n• Responsible for testing of CPU/IC product based on customer requirements or results of incoming inspection.\n• Conducts tests on inbound CPU/IC according to the process doc and customer requirements. Reports results to Quality, Warehouse, and Commodity Managers as well as recording in RMS.\n• Proper disposition of CPU/IC once testing... is completed to ensure that CPU/IC that pass go into good locations and those that fail are quarantined.\n• Maintain and update proper software revisions and bios updates for all CPU/IC tests.\n• Ensure proper completion of all test processes.\n• Provide maintenance on boards and equipment as needed to maintain proper operation of the boards.\n• Proper handling and ESD protection of all CPU's\n• Maintaining board database as new platforms are brought into operation.\n• Review metrics related to test results.\n• Provide monthly updates on activities and improvements made on processes.\n• Work with the team to further strengthen and improve test processes with a goal of 0 defects\n• Suggest improvements in workflow and equipment to make testing more efficient and effective.\n\nWho we're looking for!\n• At least 3 years of work experience in the Semicon/Electronics or related industry\n• Good knowledge of quality systems and QA principles, practices and standards\n• A high-energy, smart, and persistent individual, driven to succeed and revolutionize an industry\n• Proficient with standard business tools (email, voicemail, MS Office 365, etc.)\n• Ability to juggle multiple tasks and inputs in a fast-moving environment\n\nEstablished in 2001, Fusion Worldwide is a premier, global open market distributor of electronic components with an established reputation of excellence in sourcing, quality, and outstanding customer support. Solving supply chain disruptions is where we are truly able to provide key service to all our customers, and we are looking for motivated individuals like you to join this rapidly growing industry! With our company headquarters located in the scenic Boston Seaport area, we also have key locations in Amsterdam, Singapore, Munich, Guadalajara, Seoul, and San Francisco. At our current rate of growth, we are continuously expanding our global footprint to reach all corners of the world, and we are dedicated to finding top talent to help us grow in all regions", "extensions": ["4 days ago", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJUZXN0aW5nIEVuZ2luZWVyIiwiY29tcGFueV9uYW1lIjoiRnVzaW9uIFdvcmxkd2lkZSIsImNvbXBhbnlfbWlkIjoiL2cvMWhmdDJrZl8wIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiSW0zTU9BZnFZM0pHazRZekFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZZQkNyY0JRVTVWWDA1eFUxazNhelY0VVRZemRscFJaRk5LVG14cGNERnZNWE4xY2xaYVJGUjRYekZ2VWpWdU1rbzNkM1Y1ZWxOcVlVeEdiVU5GVUhwUGREWjBlSFZqTjJKbmF5MWtNSFZJYVhZd01XWmtNSGw2Y0Zoa2VuZGZjMGN6VEd4TVJHcFZaWEZQZDAxR05GcEhWVjloUkdObFVHRnNkVk5LUWpaMVlrdDNNa3MzVURaTlZIUllWRTVVUmxwb2EyUmllbU5LUkROT2JGRnllQzFQV0c1RFJDMXBNWHAxWjAxRlUwTm9UMWx0VVhScGIzVnphMFkwRWhaNlNEWkRXVTFoUzBGamRsZDBRV0Z5ZFRabFNVTlJHaUpCVDAxWlVuZENiMTlzUm5SbE9VNHdaMUpMTUZkM1ltMHlTa3BPT0VWdGJWVlIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY180MSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBHbGFzc2Rvb3IiLCJsaW5rIjoiaHR0cHM6Ly93d3cuZ2xhc3Nkb29yLnNnL2pvYi1saXN0aW5nL3Rlc3RpbmctZW5naW5lZXItZnVzaW9uLXdvcmxkd2lkZS1KVl9JQzMyMzU5MjFfS08wLDE2X0tFMTcsMzMuaHRtP2psPTM3MDQ2MjI1OThcdTAwMjZ1dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior Software Engineer - 19386-JOB", "company_name": "None", "location": "Singapore", "via": "via Jobs", "description": "Responsibilities: Work as part of Agile scrum team (geographically distributed) to design, implement, and test our bioinformatics software that enables researchers, scientists, geneticists and clinicians manage the complex workflows required to successfully sequence the genome Transform operational/customer needs into technical description and design specification for a software system Lead the requirement gathering process and perform requirement analysis and risk analysis Assume the role of a product owner in an agile scrum team Develop, manage and prioritize the team's product backlog Act as the primary liaison to product manager, customer support and other development teams to coordinate inter-dependencies to fulfill overall product delivery Work with overall system owner and project office to align team's delivery with overall project plan Verify team's delivery against requirements to ensure the right functionality Assist in troubleshooting system problems during development and... sustaining of product Develop and review project artefacts defined in the software life cycle in conformance to regulatory requirements Required Educational Background: At least a Bachelor's degree in Computer Science, Computer Engineering, Bioengineering or engineering related area Desired Profile: At least 4 years of working experience in Life Science industry with knowledge in DNA Sequencing or at least 4 years of experience as a Business/System Analyst. (Medical Device is preferred) Certified Scrum Master or Product Owner or working experience in regulated product development environment (SDLC and ISO 13485) Strong analytical skills, problem solving and troubleshooting Strong verbal and written communication skills A track record that includes being part of a team which completed and shipped successful products Must thrive in fast-paced, dynamic environment Experience in participating in cross-organizational or inter-company collaboration Experience in developing full stack web applications in Java is a plus Experience in working with offshore teams is a plus Experience in working with customer support is a plus Experience with Lab Information Management Systems is a plus", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgRW5naW5lZXIgLSAxOTM4Ni1KT0IiLCJjb21wYW55X25hbWUiOiJOb25lIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJ4cVh6WDRNS09iN0d1ZERtQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnMiLCJsaW5rIjoiaHR0cHM6Ly9zZy5maWRhbnRvLmNvbS9qb2JzL2pvYi1vcGVuaW5nL3NvZnR3YXJlLWRldmVsb3BlcnMtc3lzdGVtcy1zb2Z0d2FyZS9zZW5pb3Itc29mdHdhcmUtZW5naW5lZXItMTkzODZqb2ItMjc1NDM2OTk0P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Software Engineer (Cryptography)", "company_name": "Thales Group", "location": "Singapore", "via": "via WhatJobs", "description": "Location: Singapore, SingaporeIn fast changing markets, customers worldwide rely on Thales. Thales is a business where brilliant people from all over the world come together to share ideas and inspire each other. In aerospace, transportation, defence, security and space, our architects design innovative solutions that make our tomorrow's possible.Thales in Singapore has been present since 1973, providing state-of-the-art solutions for customers in the aerospace, defence, security and transportation markets. Today, Thales in Singapore employs over 600 people and is home to all regional avionics services, a ground transportation integration centre, and regional innovation hub.\n\nThe Cryptography team in Singapore develops embedded cryptographic libraries for the Mobile Connectivity Solutions business unit. These libraries are integrated in Thales’ products such as removable SIMs and eSIMs. As a Software Engineer, you will be working in a stimulating environment doing software development... and evaluation. This is an ideal role for engineers who want to focus on writing small but complex functions on an embedded target.\n\nA week in the life of an Embedded Software Engineer:\n\nYou will develop and validate software libraries implementing cryptographic functions You will incorporate security countermeasures suited for the end product’s requirements You will occasionally perform attacks on smartcards’ cryptographic module You will assist in the certification of smartcard products You monitor innovation in embedded cryptography. This includes new attack techniques or implementations.\n\nKnowledge, Skills and Experience:\n\nYou must have a Bachelor’s Degree in Computer Science or Computer Engineering. It would be preferred if you have a Master’s degree in Computer Science or Computer Engineering, basic understanding of modern cryptographic algorithms and secure coding, knowledge of possible attacks, software countermeasures. Proficiency in low level programming languages such as C or Assembly. Strong understanding of architecture and programming model of microcontrollers. Willingness to learn Mathematical concepts related to cryptography. It would be preferred if you have used embedded development tools like emulators or development kits. We would like someone to join our team who is a strong verbal and written communicator, logical and creative problem-solver, open-minded and a quick learner. We are looking for someone with at least 2 years of experience in a software engineering position or a related role. At Thales we provide CAREERS and not only jobs. With Thales employing 80,000 employees in 68 countries our mobility policy enables thousands of employees each year to develop their careers at home and abroad, in their existing areas of expertise or by branching out into new fields. Together we believe that embracing flexibility is a smarter way of working. Great journeys start here, apply now", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciAoQ3J5cHRvZ3JhcGh5KSIsImNvbXBhbnlfbmFtZSI6IlRoYWxlcyBHcm91cCIsImNvbXBhbnlfbWlkIjoiL20vMDFwaGo0IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoib0N2VGJOMUprdEJ4MTFzYkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFVqZ3lRa2hHZUhKb2FFcGpXblppTjJoVlNIaHdSVEpWYWtkVU4ydHJRemhCTkc1UmFHRXphelE0VDJzeVkyMXRXbE40U1d4UWNIRjNNbHB4T0RKcU1sRkVaSEl6UlVwYVZFMHpMVzVTY1c1RlJXMUdYMGN4VTBwTFdHaFdUblJNYldwVVZuVkdTWHBsY1UxWldGWjFYMjEwVkV0R2RERm9ORzFaVjA5TWVVcENjSE5VTmpkT1pIRmllVkZDVlZsUGJ6WlZWVzFNUmtKMmExcG5FaFo2U0RaRFdVMWhTMEZqZGxkMFFXRnlkVFpsU1VOUkdpSkJUMDFaVW5kQlpEVkhSM0JXZUdkamNuUTVaMnd3U0Vab1F5MVFPWEJMUVZabiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzUyIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFdoYXRKb2JzIiwibGluayI6Imh0dHBzOi8vZW4tc2cud2hhdGpvYnMuY29tL2pvYi1mb3ItU29mdHdhcmUtRW5naW5lZXItQ3J5cHRvZ3JhcGh5LWluLVNpbmdhcG9yZS1jb29wMTc1NjkyMTg/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Senior - Software Engineer - Java", "company_name": "JJ Consulting Services", "location": "Singapore (+1 other)", "via": "via Monster", "description": "Job Description :\nOur Client is an established company in Singapore, who is seeking to recruit Senior/ Software Engineer (Java).\nResponsibilities\n• You will be responsible for design, development of APIs that meets project requirements, is high quality and is based on reference architecture and various design patterns.\n• You will be responsible for and incorporating & adhering to API standards and practices set by API chapter teams and make sure it is followed.\n• You will be able to provide feedback on standards and patterns time to time back to chapter leads. This is to make sure standards and patterns are practical and also evolving.\n• You will be able to participate in an agile team to deliver the full lifecycle, including requirements, architecture, design, development, testing and deployment.\n• You will be able to review code from project teams time to time and advise whether code meets the required standards.\n• You will be able to interact with various stakeholders including... product owners, BAs to design and deliver technical solutions to support various functions.\n• Work in a Globally Distributed Development team environment to enable successful delivery with a minimal supervision\n• You are passionate, creative and self-driven\n• You are curious and collaborative, and a believer in the power of teams and team work\n\nQualification & Experience Required\n• Minimum 3-7 years of experience in software engineering designing and building highly scalable applications\n• Strong hands-on experience in API development, design, deployment and operation in production.\n• Aware of all the cross cutting concerns and development patterns for API\n• Strong hands-on experience in Java 8 Strong understanding of Java concurrency, concurrency patterns, experience building thread safe code\n• Highly comfortable with Java Spring Framework / Spring Cloud / Spring batch\n• Possesses deep understanding on Cloud Native applications\n• Experienced with building applications using AWS, PCF or OpenShift\n• Data modelling experience in both Relational and NoSQL databases\n• Good understanding of OAuth 2.0 / SAML 2.0 protocols\n• Experience writing unit, functional, load and end-to-end tests\n• Experience working with JIRA, Confluence, Jenkins & bitbucket\n• Strong working knowledge of SDLC and Agile development methodologies\n• Certification in AWS, Java, J2EE, ITIL would be an added advantage\n\nJJ Consulting Services\nEA Licence No.: 12C6207\nWe thank all applicants in advance and regret that only short listed candidates will be notified.\nExperience:\n• Software Engineering: 3 years (Preferred)\n\nLocation:\n• Singapore (Required", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgLSBTb2Z0d2FyZSBFbmdpbmVlciAtIEphdmEiLCJjb21wYW55X25hbWUiOiJKSiBDb25zdWx0aW5nIFNlcnZpY2VzIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJXNGFCbG05dUVvYlZnS1c5QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1vbnN0ZXIiLCJsaW5rIjoiaHR0cHM6Ly93d3cubW9uc3Rlci5jb20uc2cvam9iL3Nlbmlvci1zb2Z0d2FyZS1lbmdpbmVlci1qYXZhLWpqLWNvbnN1bHRpbmctc2VydmljZXMtc2luZ2Fwb3JlLTI4NTk3Mjc/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Software Engineer (Java Microservices)", "company_name": "EPAM Systems", "location": "Singapore", "via": "via NodeFlair", "description": "We are looking for an experienced Software Engineer specializing in Java Microservices in Singapore to make the team stronger.\n\nResponsibilities\n• Write high quality, testable code following clean code and SOLID design principles\n• Conduct code reviews\n• Create design, technical and project documentation\n• Plan and schedule own work for tasks and projects, also implement functionality without direct supervision\n• Perform profiling and troubleshooting of existing solutions\n• Coordinate application deployment\n• Follow and understand defined software development process\n• Participate in workshops and presentation of proposed solutions to clients\n• Communicate with the clients on a regular basis to clarify business requirements\n• Assist team members with providing of technical solutions\n• Work independently while in close collaboration with others in the team and across projects\n\nRequirements\n• Bachelor's degree or above in Computer Science, Software Engineering or related majors\n• Strong... programming experience of more than 5 years and deep knowledge on data structure and algorithms\n• Typical tech stack for this role: Java 8/11, Spring Boot, JUnit/Mockito, MySQL, Kafka, Avro, git, Jenkins, PCF, DDD/BDD/TDD\n• Need to be strong in Spring Cloud\n• Strong Microservices\n• DS and Algorithms: looking for problem solving skills and the ability to optimize code\n• PCF: Manage and own the pipeline. We will consider strong Developers without PCF experience but the individual must be willing to learn PCF quickly\n• Fundamental knowledge on Docker and Kubernetes will be helpful. Know how to scale up and down etc\n• Secure coding practices\n• OS: Linux etc. Basic commands knowledge needed to browse the logs etc. to understand the issues better\n\nNice to have\n• Pair programming experience: Currently not completely doing Pair programming but would like to get there in near future\n\nWe offer\n• Friendly team and enjoyable working environment\n• Work-life balance and flexible schedule\n• Online training library, mentoring, career development and potential partial grant of certification\n• Unlimited access to LinkedIn learning solutions\n• Referral bonuses\n• Compensation for sick leave and paid time off\n• Opportunities for self-realization", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciAoSmF2YSBNaWNyb3NlcnZpY2VzKSIsImNvbXBhbnlfbmFtZSI6IkVQQU0gU3lzdGVtcyIsImNvbXBhbnlfbWlkIjoiL20vMGRsbnJjIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoib0hwaUJHM2hSMnJydndfekFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFUyVmlhVzg1U3pNMGIweFVUVXMzZGpkT01XMDNTR1ZzUjJsRlQwWjZUazVLZFRSb1JXdGFOMGN3YUhrNU9XVmhVR28xTUU5WVNuZEpZa0ZmYWtadk9YbEZjRmRDWlRWdGRXaFllamhCYURGSFptWldUMnN4VUVKRmRUbHROMFpJTVROc2IxQlNkalE0Y3poeE5WVnJWbTk0ZG00d1pIZGlXVzlSZEdrMVFqazBUMlpEZFhRNU5FdEdZVWhzWTNoTlZEWnpRV04xYW5BMVNrZDNFaFo2U0RaRFdVMWhTMEZqZGxkMFFXRnlkVFpsU1VOUkdpSkJUMDFaVW5kQmVtWnVNR1IyVTFkV1VqRjNlV0l6U21oTGNXTjBlR3BrYWkxUiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzY0IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE5vZGVGbGFpciIsImxpbmsiOiJodHRwczovL3d3dy5ub2RlZmxhaXIuY29tL2pvYnMvbGlzdGluZ3MvOTM1Nz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}], "chips": [{"type": "Title", "param": "job_family_1", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Software engineer", "value": "software engineer"}, {"text": "Senior", "value": "senior"}, {"text": "Test engineer", "value": "test engineer"}, {"text": "Cloud engineer", "value": "cloud engineer"}, {"text": "Engineer", "value": "engineer"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Assurance engineer", "value": "assurance engineer"}, {"text": "Programmer", "value": "programmer"}, {"text": "Coach", "value": "coach"}, {"text": "Qa engineer", "value": "qa engineer"}, {"text": "Devops engineer", "value": "devops engineer"}, {"text": "Frontend engineer", "value": "frontend engineer"}, {"text": "Java engineer", "value": "java engineer"}, {"text": "Solutions engineer", "value": "solutions engineer"}, {"text": "Testing engineer", "value": "testing engineer"}, {"text": "Analyst", "value": "analyst"}, {"text": "Data engineer", "value": "data engineer"}, {"text": "Design engineer", "value": "design engineer"}, {"text": "Development manager", "value": "development manager"}, {"text": "Devops consultant", "value": "devops consultant"}, {"text": "Firmware engineer", "value": "firmware engineer"}, {"text": "Lecturer", "value": "lecturer"}, {"text": "Manager", "value": "manager"}, {"text": "Network systems", "value": "network systems"}, {"text": "Principal", "value": "principal"}, {"text": "Principal engineer", "value": "principal engineer"}, {"text": "Quality engineer", "value": "quality engineer"}, {"text": "Science", "value": "science"}, {"text": "Scrum master", "value": "scrum master"}, {"text": "Security architect", "value": "security architect"}, {"text": "Security engineer", "value": "security engineer"}, {"text": "Senior engineer", "value": "senior engineer"}, {"text": "Senior lecturer", "value": "senior lecturer"}, {"text": "Senior system", "value": "senior system"}, {"text": "Senior technical", "value": "senior technical"}, {"text": "Software architect", "value": "software architect"}, {"text": "Specialist", "value": "specialist"}, {"text": "Stack engineer", "value": "stack engineer"}, {"text": "System engineer", "value": "system engineer"}, {"text": "Technical", "value": "technical"}, {"text": "Trainee", "value": "trainee"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Wholesale", "value": "/business/naics2007/42"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Mining", "value": "/business/naics2007/21"}, {"text": "Rental", "value": "/business/naics2007/532"}, {"text": "Retail", "value": "/business/naics2007/44"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": ".AB4Jjf.qPB6Vc{padding-right:11px}.qfpP8d{padding:7px 0 7px 11px}.S003Ke{flex:none}.ZoN4Lb{color:rgba(0,0,0,.54)}.nAXVG{color:#70757a}.IxQsL{color:rgba(0,0,0,.26)}.xFO1De{color:#fff}.ooFpK{color:rgba(255,255,255,.30)}.mtnwac{color:#4285f4}.WxeeKb{color:#34a853}.hIVRU{color:#f29900}.EXaTMc{color:#fbbc04}.sxn46d{color:#000}.gqMTF{color:#1a73e8}.zpn8Mb{color:#d93025}.dEUPmd{color:#1e8e3e}.PJNo1{color:#fbbc04}Actively Hiring", "value": "e"}, {"text": "EPAM", "value": "/m/0dlnrc"}, {"text": "VISA", "value": "/m/01kqjn"}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Zühlke", "value": "/g/1hh_rg216"}, {"text": "Cardinal Health", "value": "/m/040vzx"}, {"text": "Credit Agricole Group", "value": "/m/028vbm"}, {"text": "GlobalTix Pte Ltd", "value": "/g/11dxpqdhrf"}, {"text": "HCL SINGAPORE PTE. LTD.", "value": "/g/11fy25ngsv"}, {"text": "Jobline Resources Pte Ltd", "value": "/g/11gp2647pn"}, {"text": "Mediacorp", "value": "/m/03qtz1"}, {"text": "Realtek", "value": "/m/05wrm7"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "TECHNOPALS PTE. LTD.", "value": "/g/11dxpvkynp"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "Thales", "value": "/m/01phj4"}, {"text": "UST", "value": "/m/08kb8g"}, {"text": "UrbanFox", "value": "/g/11ghs7y0w6"}, {"text": "Activate Interactive", "value": "/g/11dxq192l5"}, {"text": "Cognizant", "value": "/m/03bf9h"}, {"text": "DELL", "value": "/m/0py9b"}, {"text": "HCL Technologies", "value": "/m/0698gv"}, {"text": "ORACLE", "value": "/m/05njw"}, {"text": "PUBLICIS SAPIENT", "value": "/m/09n8_2k"}, {"text": "Singapore Press Holdings Limited", "value": "/m/0d7mwh"}, {"text": "Temasek Polytechnic", "value": "/m/098s73"}, {"text": "TikTok", "value": "/g/11fy265933"}, {"text": "Zendesk", "value": "/m/0wkm4pl"}, {"text": "A-it Software Services Pte Ltd", "value": "/g/11dxpy_gl_"}, {"text": "ACCENTURE PTE LTD", "value": "/m/09n8w94"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "Adecco GS", "value": "/m/08gz46"}, {"text": "Atidan Technologies", "value": "/g/11c74f0b8_"}, {"text": "Autodesk", "value": "/m/018nm3"}, {"text": "Avnet", "value": "/m/0c8xmc"}]}]}