{"search_metadata": {"id": "608279693a218a4c2cead129", "status": "Success", "json_endpoint": "https://serpapi.com/searches/84a3c92ac268b092/608279693a218a4c2cead129.json", "created_at": "2021-04-23 07:38:17 UTC", "processed_at": "2021-04-23 07:38:17 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28solution+architect%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=50", "raw_html_file": "https://serpapi.com/searches/84a3c92ac268b092/608279693a218a4c2cead129.html", "total_time_taken": 2.23}, "search_parameters": {"q": "(solution architect) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "50"}, "jobs_results": [{"title": "Technical Architect, Hybrid Cloud", "company_name": "NTT", "location": "Singapore", "via": "via Careers At NTT", "description": "In a constantly changing world, we work together with our people, clients and communities to enable them to fulfill their potential to do great things. We believe that by bringing everyone together, we can solve problems using innovative technology that can create a world that is sustainable and secure. At NTT, we encourage you to remain continuously curious, as that is what keeps you fast, flexible and relevant. No two days will be the same but that is what will help you grow and realize your full potential.\n\nThe power is in your hands to do great things. It’s time to lead the change, be the authentic you, to solve difficult challenges, to set the pace of change and to unleash your potential.\n\nWant to be a part of our team?\nThe Technical Architect is a seasoned professional who is responsible for specifying and designing solutions based on their technical expertise across one or more technology domains. The individual in this position takes responsibility for the successful overall... technical design and build of the custom elements of the solution to meet a client’s business requirements.\n\n\"Provides primarily pre-sales technical support for the development and implementation of complex products/applications/solutions. Uses in-depth product knowledge to provide technical expertise to sales staff and the customer through sales presentations and product demonstrations. Assists the sales staff in assessing potential application of company products to meet customer needs and may prepare detailed product specifications for the development and implementation of customer products/applications/solutions. May create detailed design and implementation specifications for complex products/applications/solutions. May build a mini-application based on customer requirements to demonstrate feasibility of the application, often requiring rapid prototyping and/or product demo for client. May provide consultation to prospective users and/or product capability assessment and validation. Report only those incumbents with incentives not tied to product sales.\"\n\nWorking at NTT\n\nKey roles and responsibilities:\n• Select and apply appropriate design standards, methods and tools, consistent with the agreed enterprise and solution architectures and ensure that these are effectively applied and adopted.\n• Guide successful implementation and execution of system solutions.\n• Provides detailed and specific advice regarding the application of their specialism(s) to the planning and operations processes.\n• Contributes to the development of solution architectures in specific business, infrastructure or functional areas.\n• Defines and manages scoping, requirements definition and prioritisation activities for small-scale changes and assists with more complex change initiatives.\n• Designs components using appropriate modelling techniques following agreed architectures, design standards, patterns and methodology.\n• Provides pre-sales technical support and expertise in analysing client requirements, in conjunction with the client’s current infrastructure, architecture, system capabilities and business challenges.\n• Ensure technical solutions accomplish the client’s objectives.\n• Work with Solutions Architects (SAs) to produce a technical specification for the solution’s custom development and systems integration requirements.\n• Develop the technical design document to match the solution design specifications.\n• Lead the scope of work determination, product pricing and RFP/RFI responses and assist with the decision to pursue or abort a deal.\n• Manages client proof of concept (POC) initiatives, which require appropriation of appropriate resources, and setup and delivery of the POC.\n\nKnowledge, skills and attributes\n• Demonstrate broad product knowledge integrated with strong technology understanding\n• Good understanding of the vendor’s products, business and technology positioning\n• Excellent communication skills both verbal and written\n• Ability to establish and create excellent client relationships with their technical expertise\n• Ability to develop and leverage their knowledge of reference architectures\n• Ability to maintain knowledge of trends and development in technology domains\n• Knowledgeable in core frameworks used\n• Strong knowledge of the problem domain that their systems are to provide solutions for\n\nAcademic qualifications and certifications:\n• Qualification in Information Technology, Computer Science or Information Systems\n• Certification and working knowledge of Enterprise Architecture methodologies (e.g. TOGAF, Zachman, SOA, ITIL, COBIT, etc.)\n• Relevant vendor and industry certifications, e.g. Cisco, Microsoft, Oracle,\n• Software and programming languages, e.g. C++\n• SAFe Scaled Agile certification advantageous\n\nExperience required:\n• Proven track record as a developer and architect of new systems/solutions\n• Previous work experience working as a systems administrator or network engineer\n• Proven client engagement and development consulting experience\n• Experience managing expectations when balancing alternatives against business and financial constraints\n• Proven experience in a variety of architectures for specific domain or specialization\n• Experienced designer and development know-how\n• Project management experience\n• Experience presenting technical solutions to non-technical audiences\n• Experience working in an agile development environment\n\nWhat will make you a good fit for the role?\nStandard career level descriptor for job level:\n• Seasoned and experienced professional\n• Has full understanding of specialisation area\n• Resolves wide range of issues in creative ways\n• Fully qualified, career level, career journey-orientated\n• Uses good judgement in selecting tools and methods to solve problems\n• Networks with senior internal and external people in own area of expertise\n• Receives little instruction on day-to-day work, receives general instructions on new assignments\n• Typically requires demonstrable related experience with a Bachelor’s or equivalent degree; or moderate level experience and a Master’s or equivalent degree; or a PhD or equivalent degree without experience; or equivalent work experience\n\nJoin our growing global team and accelerate your career with us. Apply today.\n\nEqual opportunity employer\n\nNTT is proud to be an equal opportunity employer with a global culture that embraces diversity. We are committed to providing an environment free of unfair discrimination and harassment. We do not discriminate based on age, race, color, sex, religion, national origin, disability, pregnancy, marital status, sexual orientation, gender reassignment, veteran status, or other protected category", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJUZWNobmljYWwgQXJjaGl0ZWN0LCBIeWJyaWQgQ2xvdWQiLCJjb21wYW55X25hbWUiOiJOVFQiLCJjb21wYW55X21pZCI6Ii9tLzA1bXlicDgiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiIzalZBOGhRSTdaSUF3dUNrQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFc3dCQ293QlFVNVZYMDV4VVhkeE4xRjRSVlIwVDJ4UVJIZ3daRmhWYVd4TU16TktSRUpXTVZoVU9FNHdZMko0ZEZFMFZtcDZVa0ZGZDJ4NVExSmhlRGxVUmxwcFNDMUNiUzFyU1hKNU5XVk1kRVY2TW1kdUxXZEhZak5HZFZKNk1WaDRiMU5xTjNNeGJFWTVOMjVmWVhsNVVWOW9ibTVVV0RVdE1YWjNXazVCV2pJMFNWa3pZVVJCWkdWbWFqbGhPSElTRjJGdWJVTlpUVzFHUmtwTGVEVk9iMUJzWlhGSmVVRmpHaUpCVDAxWlVuZENiMU5sUTJ0RVNHbGthbnBYWkRRM1JVbFJSVkp3VUZBemJTMUIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY183IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIENhcmVlcnMgQXQgTlRUIiwibGluayI6Imh0dHBzOi8vY2FyZWVycy5oZWxsby5nbG9iYWwubnR0L2dsb2JhbC9lbi9qb2IvUi01MzQ0MC9UZWNobmljYWwtQXJjaGl0ZWN0LUh5YnJpZC1DbG91ZD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior Solutions Architect", "company_name": "verizon", "location": "Singapore", "via": "via Jobs | Fidanto", "description": "When you join Verizon\n\nVerizon is a leading provider of technology, communications, information and entertainment products, transforming the way we connect across the globe. We’re a diverse network of people driven by our ambition and united in our shared purpose to shape a better future. Here, we have the ability to learn and grow at the speed of technology, and the space to create within every role. Together, we are moving the world forward – and you can too. Dream it. Build it. Do it here.\n\nDiversity and Inclusion at Verizon\n\nAt Verizon, we know that diversity makes us stronger. We are committed to a collaborative, inclusive environment that encourages authenticity and fosters a sense of belonging. We strive for everyone to feel valued, connected, and empowered to reach their potential and contribute their best. Check out our diversity and inclusion (https://www.verizon.com/about/careers/work-culture) page to learn more.\n\nWhat you’ll be doing...\n\nAs a Senior Solution Architect... you’ll fulfill the role of trusted technical adviser for Verizon Enterprise Services (VES) clients. You will also act as the technical solutions lead for internal and external solution development including proposals, RFPs, RFIs, and RFQs by putting together solutions across multi-towers (Cloud, Security, Networking, UCC, Contact Center), supporting literature, diagrams, write-ups, responses, and presentations.\n\nYou may know Verizon only as the company making your smartphone work. But at Verizon Enterprise we're also the company helping 99% of the Fortune 1000 work. In particular, we are recognized by analysts and clients as a leader in global security, voice and data networks, and Software Defined Networking (SDN) and are focused on our client’s success though delivering the connected world Simply, Securely, Reliably.\n\nBeing an integral part of the sales team to identify and qualify business opportunities, identify key Client technical objections and develop the strategy to resolve technical blockers.\n\nOwning the technical relationship with clients, including managing product and solution briefings, proof-of-concept work, coordination of additional technical resources, and obtaining Client requirements and translates these into a (Client specific) Solution Design and/or Verizon Enterprise offer.\n\nLeading solution definition and solution design both internal within Verizon Enterprise as well as towards the Client.\n\nLeading prioritization of Client solution / technical requirements and champions resolution of solution / product gaps internally (also towards Product Groups).\n\nWorking with potential Client to analyze IT infrastructure for potential opportunities to demonstrate Verizon Enterprise solution's unique capabilities.\n\nArticulating the Verizon Enterprise vision on technologies and solutions towards the Client and positions Verizon Enterprise as thought leader on key technological developments.\n\nDeveloping individual skill sets and expanding product knowledge to maximize value and to deliver quality services to our clients.\n\nAttaining designated certification requirements and attending product-specific training, reviewing technical literature, and obtaining hands-on experience.\n\nTraveling to Client sites, conferences, and other related events as required.\n\nWhat we’re looking for...\n\nYou’ll need to have:\n\nBachelor’s degree in engineering, computer science or four or more years of work experience.\n\nSix or more years of relevant work experience.\n\nSix or more years of experience as a technical sales engineer in an IT infrastructure environment or equivalent experience in a Client-facing or IT staff role (including working as a member of a professional services or IT engineering team).\n\nExperience presenting and delivering technical pitches.\n\nWillingness to travel.\n\nEven better if you have:\n\nExperience architecting IT infrastructure for scalable, distributed systems.\n\nExperience generating solution documentation for both internal stakeholders and clients in the form of diagrams, slides, documents, spreadsheets.\n\nAbility to quickly learn, understand, and work with new emerging technologies, methodologies and solutions in the SDN / IT infrastructure space.\n\nTechnical knowledge of datacenter network architecture, SDN, and large-scale private cloud networks.\n\nMultiple security, architecture, and industry certifications such as (CISSP, TOGAFv9, ITIL, Cisco CCNA or CCNP, CCSK, Microsoft, Amazon, etc.).\n\nExperience in three or more of the following: Data and IP Services (MPLS, SIP, internet, VPN, SDN, NFV, SDWAN); Network Operations (WLAN, LAN, WAN, IP PBX, Automation/Orchestration); Security (DDOS, FW, IDS, WAF, DDI, SIEM, Analytics, Micro-segmentation); Data Center Outsourcing (application management, storage, virtualization, serverless); Call Center Technologies (ACD, IVR, Call Recording, Chat, Cloud Delivery, toll free, Omni-channel); IT Applications Management (SOA, Web Services).\n\nKnowledge of leading technology network and security vendor portfolios such as Cisco, Viptela, Versa, Fortinet, Palo Alto, Riverbed, and Juniper.\n\nExperience evaluating prospective IT infrastructure and deliver the appropriate evaluation, ROI, savings, proposed operational evolution and associated process management.\n\nREQNUMBER: 553838-1A", "extensions": ["2 days ago", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29sdXRpb25zIEFyY2hpdGVjdCIsImNvbXBhbnlfbmFtZSI6InZlcml6b24iLCJjb21wYW55X21pZCI6Ii9tLzA3X2RuIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoibWlUODhNWGExRi1XMm1IUEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXN3QkNvd0JRVTVWWDA1eFVrdGplbkpsWjNnd1J6SjZTV3cxUVV3MWFIb3pPRXA1UVVVMlJWUk9hSFJ6TFdVdFZFdDFPREJ6VEd0U2FsbFlRVGhIZVRWSVVHMTRTRVUxZFU4NU9HWTVja1YwYlRWSmNIVjNPSGhOTVdsaGJWbDFSVFZuVERKRk1tRmZkM1Z6Y0RaR05FUkdVazVaWldGUFJqUTFObTQ0ZVhGQk1GUnFVM05oV1hkVmNrWkdSRTluYVMwU0YyRnViVU5aVFcxR1JrcExlRFZPYjFCc1pYRkplVUZqR2lKQlQwMVpVbmRCVVZCYVNITkdOREV3WTNoUFNGQmxjMDkzWXpGVFRIWmpWbmwzIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMTUiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9icyB8IEZpZGFudG8iLCJsaW5rIjoiaHR0cHM6Ly9zZy5maWRhbnRvLmNvbS9qb2JzL2pvYi1vcGVuaW5nL3dlYi1hZG1pbmlzdHJhdG9ycy9zZW5pb3Itc29sdXRpb25zLWFyY2hpdGVjdC0yNzc0NDc4Njc/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Technical Architect - ASEAN", "company_name": "Salesforce.org", "location": "Singapore", "via": "via Neuvoo", "description": "Job Details\n\nThe Technical Architect will be responsible for implementing Salesforce products and solutions, utilising web-based technologies and applying enterprise system integration and security architectures.\n\nIdeally, the candidate has a CRM and/or ERP implementation background, Salesforce.com experience and certification is advantageous. However, candidates with a solid technical architecture and development background in Java, .Net and integration will also be considered.\n\nResponsibilities\n• Support Technical Architect in requirements gathering sessions and producing requirements and design documents.\n• Develop Integrations, security, single-sign-on and application customizations.\n• Implement development and release process.\n• Configure products and solutions, and perform quality testing.\n• Develop training materials and conduct training to customers.\n\nExperience/Skills Required:\n• 5+ years of experience implementing and integrating enterprise systems\n• Strong customer facing... experience\n• Software vendor background will be advantage\n• Ability to deliver integration projects using established integration technologies and EAI-tools\n• Experience with web and/or cloud application development in Force.com, Heroku, SpringSource, Amazon RDS, Azure, J2EE or .Net\n• A good understanding of XML, SQL, and Object Oriented Design Patterns\n• Travel regularly with average of 30% but may be higher as required by client engagements\n\nExperience/Skills Desired:\n• Ability to define and deliver custom Force.com enterprise applications\n• Hands on development experience with Apex, Visualforce and/or the API\n• Completion of several projects in development roles\n• Experience with data extraction, transformation and load tools\n• Expertise in Single Sign On, Master Data Management, Social Enterprise Technologies or Data Warehousing\n• Fluency in ASEAN languages such as Vietnamese or Thai is highly preferred as this role will cover these countries\n\nAttributes\n• Detail-oriented and motivated individual with the ability to rapidly learn and take advantage of new concepts, business models, and technologies\n• Intensity, drive and the desire to succeed\n• Analytical, resourceful and creative problem-solving skills\n• Team player with strong communication and interpersonal skill\n\nAbout Salesforce\nSalesforce is the global leader in customer relationship management (CRM) software. We pioneered the shift to cloud computing, and today we're delivering the next generation of social, mobile and cloud technologies that help companies revolutionize the way they sell, service, market and innovate-and become customer companies. We are the fastest growing of the top 10 enterprise software companies, the World's Most Innovative Company according to Forbes and one of Fortune's 100 Best Companies to Work For. Our \"more human, less corporate\" culture is built around doing work that matters, winning as a team and celebrating success Aloha-style. Ready to find your #dreamjob?\nThank you for your expression of interest\n•", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJUZWNobmljYWwgQXJjaGl0ZWN0IC0gQVNFQU4iLCJjb21wYW55X25hbWUiOiJTYWxlc2ZvcmNlLm9yZyIsImNvbXBhbnlfbWlkIjoiL20vMDdidHI1IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiYVV0UW92WTYtTnA3WjFYQkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVJQkNxSUJRVTVWWDA1eFVsWlJjbGh3Y1ZaRWFUaFVUMUZvTURab1kwMURiM05pTUZGVlNIVkxhMlY0VFV4SWVIZDNSRE5PUmpOc04yaHZXRTl5WWpkQ2RGVkVkM1pYVG5aWlIzSTVaVmh3TVVSVFkzSnhVSGxGUW1OMFIyRXRTeTExZG5SMFQwOVRXRnBSUzNNd2NITnpSMTlKWlZaSmRscEtYM05KUmpKbmJHOXhXVzU0TlZWaVIzSnRSVjlrTW5BeUxYVkdObTV2V1ZWQ1ZsOXNObVZHV0hGYWJ6QlJFaGRoYm0xRFdVMXRSa1pLUzNnMVRtOVFiR1Z4U1hsQll4b2lRVTlOV1ZKM1FrSkpWekJSWXpGUVZEZGFXazE2T0dodmNEWkVkM1pEV1RKMFFRIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMjIiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTmV1dm9vIiwibGluayI6Imh0dHBzOi8vc2cubmV1dm9vLmNvbS92aWV3Lz9pZD0zYWU5MDc0YjYzMGJcdTAwMjZ1dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior Solutions Architect- Digital Venture", "company_name": "Standard Chartered", "location": "Singapore", "via": "via HelpOneBillion", "description": "We're looking for a Senior Solutions Architect to lead the security team of our small, but growing company. This will be a critical role in the organisation and you will need to be at the top of your game, with an industry reputation to match.\n\nArchitecture is the bedrock on which every digital bank is built and we want to build delightful high quality products for our customers. Work with us and help us build state-of-the-art customer experiences and our internal tools and public facing web and mobile applications. Develops mobile application in a way that is easy for non-tech savvy people to use and can be customized fast and seamlessly. The code and libraries used must be up-to-date and well commented.\n\nThe Role Responsibilities\n\nWe are seeking a talented and passionate individual to join our architecture team. The purpose of the Architecture function is to help the new organisation to achieve its strategic priorities through best in class use of enabling technologies. Our... architecture team is accountable for architecting, designing and overseeing the delivery of products and services in diverse domains such as Mobile channels, APIs, Cloud technologies, Core Banking, Payments and Finance\n\nAs a senior solution architect an enabler to delivering great experiences for our clients you'll be accountable for architecting our end-to-end Customer Journey flows; defining and iterating architectural patterns and providing feedback/reviewing the architecture of others. Sharing your own experience and knowledge is a must as is our expectation that you'll provide coaching to our engineers and business teams on what great architecture looks like.\n\nThe successful candidate needs to have hands on experience working in a mature agile environment; regularly used to influencing business and delivery stakeholders; have strong functional, technical expertise and a passion for challenging the status quo.\n\nIn terms of the day to day you will be responsible for:\n• Architecture definition - Defining end to end architecture to support the business needs, for one or more Banking or Technology domains that enables our business, improves scalability and resiliency, and drives implementation efficiency.\n• APIs, Events & Cloud - Defining a logical domain driven API & event model and implementation approach that makes best use of modern cloud patterns, the associated technical and operational standards, and working with implementation teams to govern & guide build execution\n\nOur Ideal Candidate\n\nTo be successful in this role we believe the below experience will make it easier:\n• Communicating and influencing across organisational contexts and driving long term behavioural change\n• Strong technical, functional knowledge and experience delivering outcomes across a breadth of industries ideally with a deep full-stack experience in one or more spaces.\n• Integration (API) & Cloud Experience and preferably certified cloud architecture.\n• Security and/or Data architecture experience is a bonus.\n• Banking Domain Experience, ideally in Retail Banking\n• At least 5-10 years of banking experience and more than 5 years of experience as an architect and also have delivery background\n• Able to work and deliver independently with a strong commitment, willingness to take up challenges, self-motivated and proactive in delivering ahead of expectations. Of course, you will be collaborating internally with other architects and sharing the expertise\n• A self-starter whose primary role will be that of the architect but is also happy to roll up their sleeves and perform other tasks to help us close out whatever is the priority (could be some requirements, could be some development, could be some logistics). We expect that >80% of the role will be architecture\n• Hands on experience working in mature agile environments and delivering outcomes iteratively focused on value to the customer\n• Evidence of continual improvement and investment into you (i.e. training, education, secondments into new areas)\n\n'114972", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29sdXRpb25zIEFyY2hpdGVjdC0gRGlnaXRhbCBWZW50dXJlIiwiY29tcGFueV9uYW1lIjoiU3RhbmRhcmQgQ2hhcnRlcmVkIiwiY29tcGFueV9taWQiOiIvbS8wMmhzemsiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiI0UEZGcWhpWTJ6dHZQTWZDQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdmNCQ3JjQlFVNVZYMDV4VTBKc1UwbHdSemd5ZVhOUVh5MU5jamRFUlVsRVV6Rm1jbTR5UVRKTU9EQkdUbXhXWWtkcGFHUlhTbWR6VUdJM2NUQnpkV2htZFRZemRGWjZhRkZJUjNWVVQweG9ObWRyVlc5YVNVUkxZVVJmZVd4TlF6aGpRVGd0WHpSV1JHWlVjM1o2T0U5WFpWSTNVVmRwUzNaM1VVeElNMmRPYTNCbU4zQkxkMDUxY0VrMFYyMDFTVTFDYkdWdmQwOTBZa2xqTlhrNGJERmtVWEZCWkZOTVZGTlpNbGx2VjIxbGRucHVkalJmZDFreVlrWlpFaGRoYm0xRFdVMXRSa1pLUzNnMVRtOVFiR1Z4U1hsQll4b2lRVTlOV1ZKM1FXcEhkR3RVYkRoTWJYSm9ObmRhZDFKSVJFODFSWGh5TlVWSGR3IiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMzAiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSGVscE9uZUJpbGxpb24iLCJsaW5rIjoiaHR0cHM6Ly9oZWxwb25lYmlsbGlvbi5jb20vam9iLzlmM2Y1ZTc4NDViNDczNmFiNzViYTQyNDBmZWYwNzljL1Nlbmlvci1Tb2x1dGlvbnMtQXJjaGl0ZWN0LURpZ2l0YWwtVmVudHVyZT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "IT Solutions Architect", "company_name": "Recruitment Hub Asia Pte Ltd", "location": "Singapore", "via": "via Joblum Singapore", "description": "JOB RESPONSIBILITIES:\n• Works deals assigned to the sales team supported, prioritizing effort based on maximizing total impact on team productivity and profit, or as directed by the sales manager.\n• Build and size out IT outsourcing solution based on customer requirement align with delivery team capabilities.\n• Proactively scopes the technical solution required to address customer requirements, assesses customers’ met and unmet needs, and recommends solutions that optimize value for both the customer and the firm.\n• Secures input from all necessary solution stakeholders within the customer firm. Adapts solutions, as necessary, to ensure appropriate support.\n• Coordinates closely with internal sales, sales support, and service resources to align solution design with customers’ business requirements.\n• Secures from customer technical staff commitments needed to ensure a deal’s “technical close.”\n• Meets assigned targets for profitable sales growth in assigned product lines, market... areas, channel, or teams supported.\n• Monitors customer support for outsourcing solutions proposed throughout the sales process, and alerts the sales and account teams to potential risks of deal closure.\n\nQUALIFICATIONS:\n• Minimum Diploma/Degree from an accredited institution in Computer Science field\n• Minimum six years of sales or sales engineering experience in a business-to-business, large/strategic customer segment; or\n• Experience in Outsourcing account management (Managed Services); and/or\n• Minimum three years of Infrastructure support (e.g. Wintel, Unix, Network…etc.) experiences; and/or\n• Minimum five years of End User Support (e.g. Onsite, W2W, Projects, Helpdesk…etc.) experiences.\n• Candidate with Tender handling experiences will be added advantage.\n• Freshman will be considered as well\n• Product certification. (e.g. ITIL, PMP or Prince)\n\nInterested candidates please send resumes to asmita.chauhan＠recruitmenthubasia.com to apply.We regret to inform that only shortlisted candidates will be contacted.\nAsmita Chauhan R1980706\nRecruitment Hub Asia Pte Ltd 12C6135", "extensions": ["7 days ago", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJJVCBTb2x1dGlvbnMgQXJjaGl0ZWN0IiwiY29tcGFueV9uYW1lIjoiUmVjcnVpdG1lbnQgSHViIEFzaWEgUHRlIEx0ZCIsImNvbXBhbnlfbWlkIjoiL2cvMTFkeHB3d18wZiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6InZkQVR5WTBmMGJSUWFMaWRBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVvd0NDc3dCUVU1VlgwNXhVVkZGWTBNdFdqRjVTVVZTVld3MU9XWTFRVWh3V1V0amNtbGFXRzlPYURoNGFXbFVkSG8wWW5Kc09FbFdTbmxzYTFwVk1VWmlVa1Z2TjNwMVdYcEZZVEZ5UTI0d1JHWnpSVEZUVURSYVpIRmxTRXBIVEV0VVpHcDJTa1oyVW5oNmMxQldlalI0VFZaU1FsZGhlbVJ0ZWxabWNWODNiWHBrVDJOdFpWWlZiWGd0VEhCaGVsUk1OUzB6WVZGQlprSkpkM0ExVTFKelFXWmhhalUzTWpscFJWazRNbDloYVVWeVUwaHlWbU5yUzNoa2JHUXdVVWxJZFhsNmRVMUxlVVpxWlZOQldVcFFFaGRoYm0xRFdVMXRSa1pLUzNnMVRtOVFiR1Z4U1hsQll4b2lRVTlOV1ZKM1JHSjZjM2swTm5WRlZFNTNWVko0TWsxeU1uUTRaRzFDY3pOR1p3IiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMzYiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9ibHVtIFNpbmdhcG9yZSIsImxpbmsiOiJodHRwczovL3NnLmpvYmx1bS5jb20vam9iL2l0LXNvbHV0aW9ucy1hcmNoaXRlY3QvNjIxOTIwP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Jooble - Client Solution Architect", "company_name": "None", "location": "Singapore", "via": "via Jooble", "description": "VMware Professional Services (PS) Organization drives and influences the success of each VMware implementation. The PS team is dedicated to the success of our customers and their digital strategies. The PS team ensures that VMware customers are successfully implementing and delivering against their business plans from adoption all the way to a fully functioning solution that meets their defined business outcomes.\n\nAs a Client Solutions Architect (CSA), you will be responsible for the PS design and scoping of services of complex transformational solutions for our customers. The role will require you to understand the products, frameworks, and design patterns used for VMware solutions. You will be asked to contribute to these frameworks, develop reusable domain solutions, and mentor internal & external stakeholders on the use of the tools. You will be working as part of a team with similar charters. To effectively build solutions to solve for complex business problems it will be... important to build a strong network among your peers and internal & external teams. You should be ready to take ownership of the pre-sales initiatives and programs to aid in delivering of our solutions.\n\nThe ideal candidate will have a good mix of Technical Skills, Business Acumen, and a strong bias for customer centricity. The ideal candidate will need to be able to understand the customers vision and to be able to translate this to desired business outcomes and the IT solutions which underpin them. You will be acting as a lead technologist and should have a broad understanding of VMware and related technologies.\n\nThe ideal candidate would have domain level understanding in one or more of the following Franchises:-\n• Multi-Cloud\n• Application Modernization\n• Digital Workspace\n• Virtual Cloud Networking\n• Intrinsic Security\n\nVMware PS is committed to offering a collaborative and supportive working environment with a full enablement plan and the opportunity to develop in the latest Software-Defined Datacenter or Digital Workspace technologies and solutions. We promote an inclusive atmosphere where your voice will be heard, and where you will be part of a dynamic team working in partnership with each other and with our customers.\n\nWe are looking for conscientious and responsible individuals who can build on our successful track record and come with us on the next stage of our journey. We will sponsor your enablement and certification for VMware technical skills and potentially non-VMware specific but associated certifications and soft skills via our 'Take1' initiatives.\n\nKEY RESPONSIBILITIES:\n\nThe Client Solutions Architect (CSA) is primarily responsible to lead the technical pre-sales engagement with customers through the following activities:-\n• Working in close partnership with the core sales, services sales and delivery teams to understand desired customer outcomes, technical objectives, and services requirements\n• Design high level solutions to meet the business outcomes and IT objectives\n• Development of Vision for the Solution, Strategy and Services Roadmaps\n• Ability to think past individual products and create end to end solutions to meet the business outcomes\n• Effectively communicate the proposed services architecture to the customer, partners and project teams to demonstrate its tangible value\n• Ensure that proposals, services solution designs and Statements Of Work are technically sound, deliverable, competitive and representative of market leadership in the application of technology to addressing business outcomes\n• Assist with the completion and response of customer issues RFI's, RFQ's and RFP's\n• Ownership of the technical components of the Statement of Work including pre-requisites, responsibilities, technical scaling factors, out of scope items etc.\n• Accurately define role based Level Of Effort required to deliver the solution in line with VMware best practice and support guidelines\n• Facilitate accurate, timely and efficient handover of projects from the sales phase to delivery\n• Author blogs, technical articles and white papers based on experiences\n• Speak at events such as VMworld, Sales Kick-Offs, Technical Summits etc.\n• Provide lessons learned feedback to Services Sales, Delivery Management and Engineering based on customer feedback\n• Creates artefacts and manages collaboration with PS Engineering\n• Adhere to VMware PS sales process and methodologies on all opportunity pursuits\n• Mastery of necessary tooling including PS Solution Builder\n• Maintain proficiency in VMware service offerings, value propositions, and representative case studies\n• Support Field enablement of Client Solution Executives (PS Client Sales Execs), CSAs, inside Client Sales Execs and iCSAs based on domain expertise\n• Mentoring of peers and more junior CSAs as appropriate\n• Lead internal enablement and community discussions around emerging technologies\n• Obtain continuous feedback from the field, including customers, bringing IP back to corporate teams and making recommendations on future service offerings\n• Working with PS Client Sales Execs help to scrub franchise specific forecasts to provide the best possible view for the business\n• Confidently gather use case requirements and solution designs while functioning as an advocate for \"Best Practices\" and driving adoption of VMware solutions\n• Ensure the solution being delivered is fit for purpose, referencing the initial business goals and objectives of the project through strong governance\n• Maintain up to date high-level technical knowledge of the VMware product line and future product direction and expert level knowledge of your specialist domains\n\nYOU ARE:\n• A seasoned technical architect with a deep understanding of the Government, Enterprise, and/or Commercial environments, and embraces solution selling with the ability to solve customer's business needs through the innovative application of cloud-based business solutions.\n• Self-motivated, results-oriented, proactive and upbeat, you work as a member of a team and independently, developing long-term strategic and technical relationships.\n• A clear thinker as well as an effective presenter and communicator, you effectively lead the architectural discussions and technical development of customer environments.\n• Broad industry knowledge with a solid understanding of technology platforms and how to design solutions based on VMware's portfolio. Proven experience in driving complex solution sales in a competitive environment with knowledge of AWS, Microsoft, RedHat, and other industry leading cloud-based vendors.\n• Must have proven experiences and confidence in driving complex competitive solution sales scenarios, working in a matrix environment, and leading opportunities to closure.\n\nYOUR KNOWLEDGE AND EXPERIENCES: -\n• You adopt a solutions sales/ consultative selling approach to sell business and IT outcomes, calling on your understanding of the VMware product range and services offerings in an industry context.\n• You have a broad range of product knowledge, technical architectural design and hands-on experiences in VMware vSphere, NSX, Cloud management product (e.g. vRA, vCD etc.), DevOps tools, and End User Computing in medium to large environments\n• You are familiar with broadly accepted architectural frameworks (e.g. TOGAF, ITIL etc.), Project Management (e.g. PMP, Prince2), as well as working knowledge for third-parry infrastructure and/or cloud native products and solutions (e.g. Microsoft, Red Hat, Cisco, Dell)\n• You are able to generate proposals that are commercially sound, deliverable and compelling, and experiences in producing and reviewing Statements of Work for services.\n• You are empathetic, and harness the 'one VMware team' spirit to collaborate in a multi-competency environment (sales, presales, generalist, specialists)\n• You have developed strong relationships with regional IT decision makers in Government, Enterprise, and/or Commercial accounts, and are able to adapt internal and external communication to a target audience\n• You participate actively in VMware User Groups and/or recognized as a vExpert\n\nMINIMUM ENTRY QUALIFICATIONS AND REQUIREMENTS:-\n• 8+ years in Information Technology, preferably in the areas of Pre-Sales/ Business Development/ Advisory/ Delivery, or at least 5+ years in a CSA capacity and should have supported a regional quota\n• Experience in Enterprise Architecture fundamentals, methods and concepts, IT governance, business process management, and IT implementation.\n• A Bachelor's or advanced degree in business/computing, or equivalent\n• VMware certifications as well as certifications related to Public Cloud provider (AWS, Azure), Private Cloud, Virtual Infrastructure, Modern Applications, Digital Workspace, and/or Systems Management\n• Industry related specialized knowledge and/or additional certifications expected – Project Management, TOGAF, ITIL Foundation (or Advanced), and COBIT\n• Able to travel up to 50% when required, and to travel occasionally within Asia Pacific and to the USA\n• Technical services scoping experience in a consulting/ services environment, including time supporting sales and liaising with technical practices and delivery\n• Delivery or production experience in at least 2 of the 5 main Franchises\n• Strong presentation, C-level client management and business development skills with the ability to articulate options & ideas\n• Superior organizational and negotiation skills\n• Experience of working in a multi-dimensional and matrixed organization\n• Ability to influence external & internal decision makers and to anticipate challenges and take pro-active action to address\n• Strong documentation and technical writing skills with an ability to create high impact customer facing deliverables\n• Ability to demonstrate solid commercial acumen\n• Adaptable and progressive learner with the ability to communicate complex technical topics to both a technical and non-technical audience\n• An active listener with excellent communications and interpersonal skills, with an ability to utilizes different styles of questioning techniques and manage conflict and objection handling\n• Experience of working with a wider team to respond to RFI, RFQ or RFPs", "extensions": ["29 days ago", "Full–time"], "detected_extensions": {"posted_at": "29 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJKb29ibGUgLSBDbGllbnQgU29sdXRpb24gQXJjaGl0ZWN0IiwiY29tcGFueV9uYW1lIjoiTm9uZSIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiWkFKOE5UR3diZXRYZ2QyQkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb29ibGUiLCJsaW5rIjoiaHR0cHM6Ly9zZy5qb29ibGUub3JnL2pkcC8tNjczNzQ2MTEzNTQ1NDcwNzM5NC9DbGllbnQtU29sdXRpb24tQXJjaGl0ZWN0LVNpbmdhcG9yZT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior Manager - Cloud Engineering - SG1", "company_name": "Deloitte SEA", "location": "Singapore", "via": "via Jobs At Deloitte Southeast Asia - Deloitte", "description": "At Deloitte, we offer a unique and exceptional career experience to inspire and empower talents like you to make an impact that matters for our clients, people and community. Deloitte offers you a highly inclusive, collaborative workplace and unrivalled opportunities to realize your full potential. We are always looking for people with the relentless energy to push themselves further, and to find new avenues and unique ways to reach our shared goals.\n\nWork you will do\n\nCloud is transforming the way technology enables the business. It represents a radical shift in how IT services are obtained, used, and managed. Companies are navigating through the various cloud options and deciding between private, public, or a combination across different and dynamic provider ecosystems. Our cloud specialists guide our clients through multi-year journeys from the case for change through implementation across all dimensions of cloud - business alignment, technology architecture and design, cloud... application on-boarding, and transforming their operating model – to help solve our client’s most complex issues with the focus on value creation.\n\nOur practitioners work collaboratively within integrated, cross-functional teams to deliver comprehensive strategies that enable Cloud and Infrastructure transformations. Teamwork is crucial as teams are composed of a diverse group of specialists across multiple disciplines from both within our consulting practice and from our clients, helping drive towards a successful outcome. Our practitioners are expected to own and deliver their respective deliverables while managing different clients and other stakeholders.\n\nIn partnership with other leaders in the firm, you will focus on selling and delivering cloud solutions using AWS. As Cloud Architect, you will you will drive the design and delivery of world-class cloud solutions for our clients, providing expertise on cloud infrastructure services including design, build and migrate. This includes taking a lead role in the cloud architecture and engineering practice. You will be challenged to find approaches that enable rapid adoption of new cloud services and drive transformation for our client’s business and IT processes.\n• Promote public cloud internally to sales and delivery teams to drive growth.\n• Be the go to person for Cloud Network engineering. You should have a deep understanding and hands on experience of services offered on Public Cloud platforms and understand how to configure these services to support the building of complex solutions.\n• Support the solution architects, and delivery teams in design, build, configuration, testing and deployment on Public Cloud\n• Capture and share best-practice knowledge amongst the Public Cloud solutions architect community\n• Build deep relationships with senior technical individuals within customers to enable them to be cloud advocates, and provide advisory around integration of on-premises environments with Public Cloud\n• Act as a technical liaison between customers, delivery teams and support.\n\nYour role as a leader\n\nAt Deloitte, we believe in the importance of empowering our people to be leaders at all levels. We expect our people to embrace and live our purpose and shared values, challenging themselves every day to identify issues that are most important to our clients, our people and the communities, and to make an impact that matters. In addition to living our purpose, Managers/ Senior Managers /Directors across our Firm are expected to:\n• Establish a strong leadership brand by inspiring others through passion, integrity, and appreciation.\n• Create opportunities to drive impact by leveraging each person’s strengths to build high performing teams.\n• Apply deep knowledge of trends and activity to drive continuous improvement and build lasting relationships across a diverse network.\n• Translate and communicate broader strategy into a convincing team vision and goals, in order to align the team and sets priorities to achieve objectives.\n• Actively contribute to building the talent pipeline by championing a talent experience that attracts, develops and retains top talent and high performing teams.\n\nEnough about us, let's talk about you\n\nIf you are someone with:\n• The right person will be detailed, highly technical, having 12+ years of current network infrastructure experience, preferably with Cloud integration from on premises networks\n• AWS Certified or Google Cloud Certified\n• 6+ years project experience migrating and deploying cloud based solutions (GCP, Azure or AWS)\n• 6+ years architecting, implementing and supporting Network for Microsoft Azure or Amazon Web Services or Google Cloud Platform\n• Experience with infrastructure as code is a must\n• Experience with building, configuring and supporting network infrastructure solutions (on-premises, virtualization, Public Cloud) using both Linux/Unix and Windows with specific recommendations on server, load balancing, HA/DR, & storage architectures\n• Technical proficiency including systems experience, strong troubleshooting and problem solving skills, and issue management in a multi-platform environment\n• Experience with deploying cloud based solutions and workload migration strategy using tools\n• Experience with Enterprise application and database architecture is an advantage\n• Demonstrated skills in communication (oral, written, presentation), analysis, problem solving and short term and long term planning\n• An appreciation of the consulting lifestyle and ability to travel (both locally and abroad) is a pre-requisite to fit to our short-term and long-term project assignment.\n\nNext Steps\n\nSo what are you waiting for? Join the winning team now.\n\nDue to volume of applications, we regret only shortlisted candidates will be notified", "extensions": ["20 days ago", "Full–time"], "detected_extensions": {"posted_at": "20 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgTWFuYWdlciAtIENsb3VkIEVuZ2luZWVyaW5nIC0gU0cxIiwiY29tcGFueV9uYW1lIjoiRGVsb2l0dGUgU0VBIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJneHl0ZUlzd0hKMUNETzFYQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnMgQXQgRGVsb2l0dGUgU291dGhlYXN0IEFzaWEgLSBEZWxvaXR0ZSIsImxpbmsiOiJodHRwczovL2pvYnMuc2VhLmRlbG9pdHRlLmNvbS9qb2IvU2luZ2Fwb3JlLVNlbmlvci1NYW5hZ2VyLUNsb3VkLUVuZ2luZWVyaW5nLVNHLzU3Mjc0MTMxMC8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Cloud Solution Architect", "company_name": "INTEGRATED HEALTH INFORMATION SYSTEMS PTE. LTD.", "location": "Singapore", "via": "via MNC Jobs Singapore | MNC Jobs In Singapore", "description": "Position Summary / Project Description\n• The Cloud Engineer applies extensive technical knowledge of cloud technologies to develop and deploy hybrid/multi cloud solutions aligned with business objectives and security requirements.\n• He/She plans and executes implementation of new solutions or migration of workload from on premise infrastructure to the cloud.\n• He/She is a creative and comfortable in dealing with the diversity of tasks.\n• He/She ensures that the proposed solution is feasible from multiple perspectives in the areas of ease of migration, affordability and security.\n\nRoles And Responsibilities\n• He/She will be part of the Cloud Platform team. He/she will be required to plan, design, build and operate the company’s cloud infrastructure platform to ensure relevancy, scalability and cost effectiveness\n• He/She will collaborate and work with various stakeholders and technical teams to develop solutions running on commercial cloud to meet business objectives\n• He/She will... ensure proposed solution aligns with cloud infrastructure’s standards and policies as well as existing Healthcare policies and framework, especially security and compliance\n• Be the subject matter expect for all projects onboarding or transitioning to the Cloud Infrastructure Platform from design, solution, provisioning, monitoring to compliance adherence\n• Develop, maintain and upkeep Cloud Infrastructure stacks, templates, images and other artifacts including scripting, automation and deployment using agile methodology\n\nRequirements / Qualifications\n• Bachelor’s degree (or higher) in Computer Science/Information Technology or relevant discipline\n• Minimum 4 years hands-on experience designing and building enterprise scale cloud infrastructure with Amazon Web Services or Microsoft Azure\n• Possesses Amazon Web Services Solutions Architect or Azure Solutions Architect Expert certification\n• Minimum 4 years working experience with cloud technologies and tools such as Containers, Ansible, Terraform, Chef, Puppet and languages such as YAML, JSON or Python\n• Good working knowledge of various technologies including VMWare, Windows, Linux, storage, network, firewalls, load balancers, backup and security\n• Good project management skills with excellent stakeholder management on project status, risks, timeline, budget and compliance.\n• Excellent verbal and spoken English skills with ability to influence others to move towards consensus\n• Strong initiative, good team player, enjoys taking ownership of issues, process driven and great attention to details", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDbG91ZCBTb2x1dGlvbiBBcmNoaXRlY3QiLCJjb21wYW55X25hbWUiOiJJTlRFR1JBVEVEIEhFQUxUSCBJTkZPUk1BVElPTiBTWVNURU1TIFBURS4gTFRELiIsImNvbXBhbnlfbWlkIjoiL2cvMTFmeTF0dGNycCIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjVSRkJnVkxfRzlvRUhmNmtBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVzd0NDb3dDUVU1VlgwNXhWRmc1VFdaaVZVaEpRVmhaVUd3dGJ6Wk1kalpzYURKUlNHNUxSMTloT1daMVJsUm5aRVZYYkZCWWVVOXNUalJ3YzJaZlEwaGZjbVJhYUdoWldEQm9SMjQ1WVZGaFRGcHpha2d5V21vNGJVWmZZVmRPU25sRFJGSnBTQzFHWm5OU2JUUXdTSGN3ZVRCYVpHaFphRVJmT0hsbFIyVldhMUZGU21oZlVrUTVjRkpUZUUxMWNsWkNhV1F3ZFROdFNtWlhNbGREYW1OU1gwRk5WMEpuVFU1SGVWWk9WMFpoYkU1RE5GUkRNMjEwWmpsTFIxZEpObmM0WmpKUGRVcE1iM1pxYzFjNFNHcFhjRmxIWXpKaFZISkphRFZqWDFKRmVWVmhaaTFIZEdac1dFVkdjRmMyV1dGQ1dEbG5jV2N5VDB4cE9YWXliVGRLV2tsaExYbDNjR1ExTkZFd2RXZGFWeElYWVc1dFExbE5iVVpHU2t0NE5VNXZVR3hsY1VsNVFXTWFJa0ZQVFZsU2QwUTNRazVRWkhOSWJFcDBlRlY2TTNGWVFVd3phblZoUXpGS1luYyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzUxIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1OQyBKb2JzIFNpbmdhcG9yZSB8IE1OQyBKb2JzIEluIFNpbmdhcG9yZSIsImxpbmsiOiJodHRwczovL3NnLm1uY2pvYnouY29tL2pvYnMvY2xvdWQtc29sdXRpb24tYXJjaGl0ZWN0LWhvdWdhbmctMjk1Nzg3P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Systems Architect (Assistant Manager level)", "company_name": "Omron Asia Pacific Pte Ltd", "location": " (+1 other)", "via": "via Workable For Job Seekers", "description": "Key Roles and Responsibilities:\n• Implement middleware solution for IT Integration projects across multi-platforms environment as well as system development life cycle management.\n• Lead and work with various IT Team (Operation, Application and Infrastructure) on defining IT standards, policies and procedure for middleware or integration platform.\n• Be the subject matter expert in IT architecture design, system and technical integration and middleware concepts. Acts as principal designer for corporate systems architecture including application, data, and infrastructure architecture.\n• Responsible for defining and documenting conceptual IT architecture; capture and document non-functional (architectural) requirements, facilitate preparation of estimates and define technical requirements for proposals.\n• Provides consultation to business partners and IT management to ensure development of efficient application systems utilizing established standards, procedures and methodologies.\n•... Responsible for coordinating and executing all Master Data Management related activities within region via integration platform.\n• To implement a solid Master Data Management solution.\n• Manage and ensure projects are successfully delivered in accordance to expectations with proper documentations.\n• Manage both on-shore/off-shore vendors to ensure on time delivery of accurate work.\n• Proactive monitoring of strategic direction of various vendors/software products, technology and market trends, and determines potential impact and value to the enterprise.\n• Diploma/Degree in Computing\n• TOGAF certified.\n• Minimum 5 years in implementing integration services and the concept of EAI\n• Working knowledge of systems architectural concepts and frameworks like TOGAF\n• Process general understanding in IT infrastructure architecture design.\n• Strong project and vendor management skills are essential.\n• Experience in ERP solutions, Integration platform, Workflow and SQL, Enterprise architecture\n• Experience in handling master data management\n• Experience with webMethods or other integration/middleware platform\n• Database - Oracle, MSSQL, PL/SQL knowledge\n• Java,C++ or other programing language knowledge\n• Experience with Javascript, PHP, HTML\n• Experience with XML standard\n• Excellent communication (both verbal and written) & interpersonal skills\n• Self-managed, highly motivated and has a strong drive for results\n• Excellent analytical, communication, interpersonal and presentation skills\n• Company culture - fast paced, multi-tasking, team focusing, empowering, creative, innovative and open communication\n• Competitive salaries\n• Excellent career advancement opportunities\n• Corporate Health Screening", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTeXN0ZW1zIEFyY2hpdGVjdCAoQXNzaXN0YW50IE1hbmFnZXIgbGV2ZWwpIiwiY29tcGFueV9uYW1lIjoiT21yb24gQXNpYSBQYWNpZmljIFB0ZSBMdGQiLCJjb21wYW55X21pZCI6Ii9nLzExZjAxbDZqODIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiItVHpsTlR4NHByX2N5T1ZiQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFb3dDQ3N3QlFVNVZYMDV4VTNWWU1uWXlXaTFFU2s5UE1qTTVlVlpRU3pGNVJsZHlVbmhGYlRKSWNXczNPVnAyTVhCb1JUZGxjMXBTVkVOWVlUZ3hWMEZWTFV0aFMzWnlWbVJxWjFjMGMwWnJWVlp2WkhFemRGbEZkRU50ZG05bFNIWTVNRTF2VldkSmFYTnljR3BNUjNwcFZHTllkV051UlZwR1YyWndlR3hKZUVWRmIyNXZhQzFmVG5sbU1sSk9kM2xHTWt4eWRYWkNkVU5MVVVOVWIzbG1SWFJNV2taT2FFaEdUR3BNUTA5cVRITnJibkUzVHpWbVlqZzNUV0pRVUZCNFRqTnNTR2R2U0dKbU5WQm5UMVJzRWhkaGJtMURXVTF0UmtaS1MzZzFUbTlRYkdWeFNYbEJZeG9pUVU5TldWSjNRbE5LUlZKRlNWQmFRbGswVEVrdFlqVTFjalJNT0VsT1dreFVadyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzU4IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFdvcmthYmxlIEZvciBKb2IgU2Vla2VycyIsImxpbmsiOiJodHRwczovL2FwcGx5LndvcmthYmxlLmNvbS9vbXJvbi1hc2lhLXBhY2lmaWMtcHRlLWx0ZC9qLzc1QUNCOENDMUQvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Enterprise Solution Architect", "company_name": "Sciente Inc", "location": "Singapore", "via": "via SCIENTE", "description": "Seeking a passionate Solution Architect to define IT solutions that align with our clientÃ¢â‚¬â„¢s digital transformation strategies. You will be driving projects involving web, mobile and leveraging on the latest technologies available.\n\nMandatory Skill(s)\n• Degree in Information Technology, Computer Engineering, Computer Science or Information System;\n• Minimum 12 years of IT work experience with at least 5 years in designing and implementing medium to large scale enterprise applications;\n• Proficient in TOGAF, architectural and solutioning tools;\n• Good understanding of .Net/J2EE development, frontend/backend, microservices, API and cloud applications;\n• Practical experience in HTML5, Java, .Net, React Native, iOS, Android;\n• Solid Agile development experience and deep experience architecting large enterprise-wide systems;\n• Confident, good team player and strong stakeholder management experience;\n• Interest in exploring new cutting-edge technologies;\n• Strong business acumen... strategic and analytical thinking, root cause analysis, and creative problem-solving ability.\n\nDesirable Skill(s)\n• TOGAF certified;\n• PMP-Certified.\n\nResponsibilities\n• To define the IT digitization roadmap adhering to the corporateÃ¢â‚¬â„¢s business strategy;\n• To translate business requirements into an end-to-end design and develop a high-level technical plan and blueprint for IT solutions;\n• To present and demonstrate to senior stakeholders the IT strategies and capabilities of the new architecture solutions;\n• Evaluate and recommend the use of leading-edge technologies and methods, considering their practicality, technical limitations and criticality;\n• To be Involved in the development of enterprise software delivery strategies, applying Agile and DevOps techniques to solutions;\n• Create documents on architectural design and other analysis outcome;\n• Subject Matter Expert in addressing problems related to system and application design, performance, integration, security", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJFbnRlcnByaXNlIFNvbHV0aW9uIEFyY2hpdGVjdCIsImNvbXBhbnlfbmFtZSI6IlNjaWVudGUgSW5jIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJxa0ZHM3YwcUViU1dCRmpaQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFNDSUVOVEUiLCJsaW5rIjoiaHR0cHM6Ly93d3cuc2NpZW50ZS5jb20vc2NpZW50ZS1pbmMvdGVjaG5vbG9neS1qb2JzLzUzMDkvZW50ZXJwcmlzZS1zb2x1dGlvbi1hcmNoaXRlY3QvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}], "chips": [{"type": "Title", "param": "job_family_1", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Solution architect", "value": "solution architect"}, {"text": "Solutions architect", "value": "solutions architect"}, {"text": "Architect", "value": "architect"}, {"text": "Cloud architect", "value": "cloud architect"}, {"text": "Technical architect", "value": "technical architect"}, {"text": "Enterprise architect", "value": "enterprise architect"}, {"text": "Senior", "value": "senior"}, {"text": "Consultant", "value": "consultant"}, {"text": "Financial services", "value": "financial services"}, {"text": "Infrastructure architect", "value": "infrastructure architect"}, {"text": "Manager", "value": "manager"}, {"text": "Application architect", "value": "application architect"}, {"text": "Cloud engineer", "value": "cloud engineer"}, {"text": "It architect", "value": "it architect"}, {"text": "Lead architect", "value": "lead architect"}, {"text": "Network architect", "value": "network architect"}, {"text": "Security architect", "value": "security architect"}, {"text": "Senior architect", "value": "senior architect"}, {"text": "Systems engineer", "value": "systems engineer"}, {"text": "Associate director", "value": "associate director"}, {"text": "Deputy", "value": "deputy"}, {"text": "Engineers", "value": "engineers"}, {"text": "Head", "value": "head"}, {"text": "Infrastructure", "value": "infrastructure"}, {"text": "Lab", "value": "lab"}, {"text": "Network engineer", "value": "network engineer"}, {"text": "Presales consultant", "value": "presales consultant"}, {"text": "Public sector", "value": "public sector"}, {"text": "Senior analyst", "value": "senior analyst"}, {"text": "Senior consultant", "value": "senior consultant"}, {"text": "Senior director", "value": "senior director"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Software architect", "value": "software architect"}, {"text": "Solution consultant", "value": "solution consultant"}, {"text": "System architect", "value": "system architect"}, {"text": "System engineer", "value": "system engineer"}, {"text": "Systems analyst", "value": "systems analyst"}, {"text": "Systems architect", "value": "systems architect"}, {"text": "Technical trainer", "value": "technical trainer"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Accounting", "value": "/business/naics2007/5412"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Management", "value": "/business/naics2007/55"}, {"text": "Real Estate", "value": "/business/naics2007/53"}, {"text": "Wholesale", "value": "/business/naics2007/42"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Amazon", "value": "/m/0mgkg"}, {"text": "Microsoft", "value": "/m/04sv4"}, {"text": "EPAM Systems", "value": "/m/0dlnrc"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "IBM", "value": "/m/03sc8"}, {"text": "Salesforce", "value": "/m/07btr5"}, {"text": "EY", "value": "/m/0g9jc"}, {"text": "Publicis Sapient", "value": "/m/02myjp"}, {"text": "Randstad", "value": "/m/08pt1z"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Alibaba Group Holding Limited", "value": "/m/07s6ctl"}, {"text": "Avanade", "value": "/m/094456"}, {"text": "Capgemini", "value": "/m/03vlk0"}, {"text": "Comtel Solutions Pte Ltd", "value": "/g/11dxpztgnb"}, {"text": "DELL", "value": "/g/11c54ch2jm"}, {"text": "Ericsson", "value": "/m/02kyh"}, {"text": "HTZ Resources", "value": "/g/11h21p9b4d"}, {"text": "Infinite Computer Solutions Pte Ltd", "value": "/g/11g9mj72yz"}, {"text": "Michael Page", "value": "/m/04cxldw"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "Orange Business Services", "value": "/m/08zvyz"}, {"text": "Recruitment Hub Asia Pte Ltd", "value": "/g/11dxpww_0f"}, {"text": "TEKsystems (Allegis Group Singapore Pte Ltd)", "value": "/g/11b6g4bkv0"}, {"text": "Talent Trader Group Pte Ltd", "value": "/g/11dxpmlc5b"}, {"text": "Tata Consultancy Services", "value": "/m/01psx8"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "VMware", "value": "/m/01t9k5"}, {"text": "Verizon", "value": "/m/07_dn"}, {"text": "A-Speed Infotech Pte Ltd", "value": "/g/11g9mxswl4"}, {"text": "ABeam Consulting", "value": "/g/11bc6whr_f"}, {"text": "Amazon Web Services (AWS)", "value": "/g/11dxprr2xv"}, {"text": "Amazon Web Services Singapore", "value": "/m/0rznzt1"}, {"text": "Aon", "value": "/m/0z7n"}, {"text": "Avaya", "value": "/m/01sqlk"}, {"text": "Azendian Solutions Pte Ltd", "value": "/g/11dxpvcjj2"}, {"text": "Big Cloud", "value": "/g/11c743lwsr"}]}]}