{"search_metadata": {"id": "6082791d9d15863ee3c923ef", "status": "Success", "json_endpoint": "https://serpapi.com/searches/2585bbd5f0148186/6082791d9d15863ee3c923ef.json", "created_at": "2021-04-23 07:37:01 UTC", "processed_at": "2021-04-23 07:37:01 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28data+scientist%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=20", "raw_html_file": "https://serpapi.com/searches/2585bbd5f0148186/6082791d9d15863ee3c923ef.html", "total_time_taken": 1.26}, "search_parameters": {"q": "(data scientist) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "20"}, "jobs_results": [{"title": "Data Science Lead Trainer", "company_name": "Institute Of Data Pte. Ltd.", "location": "Singapore", "via": "via Joblum Singapore", "description": "About Us\n\nThe Institute of Data is a Professional Network of Data Scientists, Cyber Security Analysts and Digital Marketers. In partnership with leading universities, the government of Singapore and hundreds of employers, we transform careers for a data-driven world.\n\nThe Institute of Data operates in the information technology sector. Demand for our training products is driven by the information capability recruitment needs of business. These capabilities, in the areas of security, compliance, operational efficiency, growth and decision making are more important to business now than ever before.\n\nOur courses are unlike those offered at traditional education providers. With remote and in- person, you can up-skill from anywhere. Beyond learning knowledge, process and theory, you will experience the real power of practical training by industry experts – allowing you to confidently practice and work in the industry.\n\nJob Description\n\nAs a Trainer at the Institute of Data you will lead... this transformative experience in a remote environment.\n\nResponsibilities:\n• Deliver class content 9am - 1pm Monday to Friday + additional hours to prep and support student as well as mark assignments.\n• Work closely with your instructional team to provide students with meaningful and prompt feedback on their progress.\n• Collaborate alongside staff in order to best meet the needs and learning styles of your students.\n• Guide students through the development of real world projects that will showcase their abilities to hiring managers.\n• Facilitate a dynamic and collaborative classroom community.\n• Inspire students to persevere through the challenges of learning complex subjects.\n• Contribute to the material and direction of an expanding curriculum, ensuring the course remains cutting-edge and effective for students.\n• Bring your network into the classroom environment and help facilitate job opportunities for your cohort.\n\nWhy be a trainer for the Data Science & AI course?\n\nIf you are looking to make a life-changing impact by doing what you know and love, this is the position for you. Through this unparalleled opportunity, you will:\n• Hone your own leadership and management skills by becoming part of the team\n• Deepen your own skills by guiding students through a rigorous journey where they begin as driven beginners and leave as empowered data analysts and scientists.\n• Contribute your own expertise to a deep and broad curriculum\n• Facilitate a supportive and energetic community that lasts well beyond the course.\n• As a member of the trainer team, you will not only impact the careers of your own students who are mostly changing careers, but you’ll also have a unique opportunity to shape the potential of students.\n\nSkills and Qualifications\n\nMust Have:\n• You have previous data science or engineering teaching experience, through a course, workshop, team training.\n• You have at least 3 years of commercial data science experience.\n• You are an expert in SQL, Python, and related Python libraries (pandas, numpy).\n• You have domain expertise in statistics, mathematics, and probability.\n• You can build and apply statistical models in python using machine learning libraries, such as scikit-learn and statsmodels.\n• You have a deep understanding of statistical hypothesis testing and experimental design, data visualization techniques and tools (i.e. matplotlib, bokeh, etc), and manipulation of large data sets.\n• You can demonstrate and explain the function of machine learning algorithms such as regularized regression, naive bayes, decision trees, ensemble methods, KNN, K-means clustering, and neural networks.\n\nNice to have:\n• Proficiency with python libraries such as NLTK; Hadoop or Apache Spark; D3.js or R.\n• You are on top of industry trends in big data, machine learning, deep learning, and AI.\n• Management and/or director experience in a small business or team\n• Relevant data professional certification.\n\n3month contract starting 26th April\n\nMust have full working rights in Singapore", "extensions": ["15 days ago", "$80K–$112K a month", "Full–time"], "detected_extensions": {"posted_at": "15 days ago", "schedule_type": "Full–time", "salary": "$80K–$112K a month"}, "job_id": "eyJqb2JfdGl0bGUiOiJEYXRhIFNjaWVuY2UgTGVhZCBUcmFpbmVyIiwiY29tcGFueV9uYW1lIjoiSW5zdGl0dXRlIE9mIERhdGEgUHRlLiBMdGQuIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJkN0pQd3JKTVJkSGVCQUZVQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYmx1bSBTaW5nYXBvcmUiLCJsaW5rIjoiaHR0cHM6Ly9zZy5qb2JsdW0uY29tL2pvYi9kYXRhLXNjaWVuY2UtbGVhZC10cmFpbmVyLzYwNDM4Mz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Research Associate (Computer Science and Data Science) (R00005334)", "company_name": "Nanyang Technological University", "location": "Singapore (+1 other)", "via": "via Jobs Guide Hub", "description": "Research Associate (Computer Science and Data Science) (R00005334) Jobs in Singapore at Nanyang Technological University\n\nTitle: Research Associate (Computer Science and Data Science) (R00005334)\n\nCompany: Nanyang Technological University\n\nLocation: Singapore\n\nType: Full-Time\n\nCategory:\n\nSchool of Computer Science and Engineering (SCSE) invites applications for the position of Research Associate.\n\nKey Responsibilities:\n\nThe Research Associate (RA) will be conducting research and development in the area of spatiotemporal and graph data mining and learning. The RA will be researching, designing and developing models and algorithms for mining spatiotemporal and graph data.\n\nJob Requirements:\n\nMaster degree in Computer Science and Data Science discipline\n\nResearch and development experience on spatiotemporal and graph data\n\nProgramming skills and good knowledge and experience on Software Engineering are an asset\n\nEnglish writing and speaking skills\n\n​\n\nWe regret that only shortlisted... candidates will be notified", "extensions": ["5 days ago", "Full–time"], "detected_extensions": {"posted_at": "5 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJSZXNlYXJjaCBBc3NvY2lhdGUgKENvbXB1dGVyIFNjaWVuY2UgYW5kIERhdGEgU2NpZW5jZSkgKFIwMDAwNTMzNCkiLCJjb21wYW55X25hbWUiOiJOYW55YW5nIFRlY2hub2xvZ2ljYWwgVW5pdmVyc2l0eSIsImNvbXBhbnlfbWlkIjoiL20vMGw0OWsiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJ3T1dOcVJUOS1CbDdHLUxMQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFcUVDQ3VJQlFVNVZYMDV4VVRFMVRVOXNVMU5NVEZSVk1FZFJNMHhYU0VsWFNqTjJNMlJzWDI5WFdWTTBabHBxUkdwTFpWUXlWM2RMWmxaYVZYZ3hVbnB5VlVGWFZTMDFTelV4Tkc1SFFVTXRVV05NTjNsclZWVkRhVzh5Y2tkb1Z5MXdjVXhFUVc5NVRYaFFZakI2ZVhWWGFTMDBSMWh2UkhGdFVqaDFNMjk0Ykd4NGRYTXRaRFpUTWpsWFRucFJNVTV3ZW5OWk5rUjZXV05SZFVkS1ZrUTVTMnRFVkZCV2RIQm9iVnBqZVVaQ1ltaENRbTVXV0RCQ2VFUkJZekZFWVhjemRWVkVWSGxsV0RseVExRndabXROYUhScFdUbGpRM1pqWHpseGFrMWlTRVZPTTJkQ1FSSVdTRmh0UTFsS1dITk5ZM0pSYzBGWE1tNXlYMmRCZHhvaVFVOU5XVkozUWtOVGMydG9TRkpRZGpsRWRGRXRiMWwyZW1ac1l6RkVXRlJuUVEiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18xMyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIEd1aWRlIEh1YiIsImxpbmsiOiJodHRwczovL2pvYnNndWlkZWh1Yi5jb20vam9iL3Jlc2VhcmNoLWFzc29jaWF0ZS1jb21wdXRlci1zY2llbmNlLWFuZC1kYXRhLXNjaWVuY2UtcjAwMDA1MzM0Lz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Data Science Engineer- Smart Mfg & AI - Singapore", "company_name": "Micron Technology", "location": "Singapore", "via": "via JobWiz", "description": "Micron’s vision is to transform how the world uses information to enrich life for all. Join an inclusive team focused on one thing: using our expertise in the relentless pursuit of innovation for customers and partners. The solutions we create help make everything from virtual reality experiences to breakthroughs in neural networks possible. We do it all while committing to integrity, sustainability, and giving back to our communities. Because doing so can spark the very innovation we are pursuing.\n\nReq. ID: 241921\n\nMicron Technology’s vision is to transform how the world uses information to enrich life and our commitment to people, innovation, tenacity, collaboration, and customer focus allows us to fulfill our mission to be a global leader in memory and storage solutions. This means conducting business with integrity, accountability, and professionalism while supporting our global community.\n\nDo you believe that data provides groundbreaking insight? Do you see data as an asset that... builds a competitive advantage? Great…so do we!\n\nMicron Technology operates in a highly competitive industry where innovation depends on hardworking minds extracting fresh insights from an ever-expanding data universe. We are seeking an experienced Data Engineer capable of designing and implementing large data solutions from data streams and intelligent systems, including transforming, supporting, configuring and enhancing existing data solutions. Are you experienced in applying Data Science & Data Engineering, advanced analytics and Machine learning to traditional data warehousing and Big Data, never-before-solved problems for industrial manufacturing at scale? Does this sound like the right team for you? Apply today!\n\nAs a Data Science Engineer at Micron Technology Inc., you will be a key member of a cross-functional team responsible for developing and growing Micron’s methods and systems for extracting new insight for our expanding data streams. You will be collaborating with other data scientists, solution analysts, engineers, technicians and data mining teams to design and implement systems to extract data from Micron’s business systems, transforming it into an actionable format, and as needed, creating dynamic presentation layers for use by high-level engineers and managers throughout the company. You will be creating new solutions, as well as, supporting, configuring, and enhancing existing solutions.\n\nResponsibilities and Tasks\n\nUnderstand the Business Problem and the Relevant Data\n• Maintain an intimate understanding of company and department strategy\n• Translate analysis requirements into data requirements\n• Identify and understand the data sources that are relevant to the business problem\n• Develop conceptual models that capture the relationships within the data\n• Define the data-quality objectives for the solution\n• Be a subject matter expert in data sources and reporting options\n\nDevelop, Support, Automate, and Orchestrate an Ecosystem of ETL Processes for Varying Volumes of Data\n• Identify and select the optimum methods of access for each data source (real-time/streaming, delayed, static)\n• Determine transformation requirements and develop processes to bring structured and unstructured data from the source to a new physical data model\n• Develop processes to efficiently load the transform data into the data management system\n• Troubleshoot operational escalations and resolve business partner issues in a timely manner with strong collaboration and care for business priorities.\n\nGenerate Insights\n• Discovering new solutions and opportunities by analyzing data, identify patterns and trends\n• Collecting & modelling large sets of structured and unstructured data from disparate sources\n• Devising and applying models and algorithms for mining data.\n• Working with unstructured data like video, images, etc.\n\nQualifications and Experience:\n• Core statistical knowledge is required to be successful in this role. A degree or certification in Data science will be a plus.\n• 2+ Years of knowledge in predictive & prescriptive modelling, machine learning.\n• 3+ years developing, delivering, and/or supporting data engineering, advanced analytics or business intelligence solutions\n• 3+ years of experience working with SAP HANA, SQL Server, SSIS and Power BI or Tableau platforms\n• Experience with one of the cloud platforms is a must. (Azure, Google cloud or Snowflake)\n• Experience with one of the following is a must. (R, Python, MATLAB, SAS)\n• Experience in IIOT & Blockchain will be an added advantage.\n• Experience working with any of the following technology or solutions is a plus (SAP, JDA, Salesforce, Big Data platforms, Cloud)\n• Strong communication skills (written, verbal and presentation)\n• Experience working in a global, cross-functional environment\n• Ability to travel as needed\n\nEducation:\n\nM.S. degree in Computer Science, Software Engineering, Electrical Engineering, Applied Mathematics or related field of study.\n\nAbout Micron Technology, Inc.\n\nWe are an industry leader in innovative memory and storage solutions. Through our global brands – Micron® and Crucial® – our broad portfolio of high-performance memory and storage technologies, including DRAM, NAND, 3D XPoint™ memory and NOR, is transforming how the world uses information to enrich life. Backed by more than 40 years of technology leadership, our memory and storage solutions enable disruptive trends, including artificial intelligence, 5G, machine learning and autonomous vehicles, in key market segments like mobile, data center, client, consumer, industrial, graphics, automotive, and networking. Our common stock is traded on the Nasdaq under the MU symbol. To learn more visit micron.com/careers\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran or disability status.\n\nMicron prohibits the use of child labor and complies with all applicable laws, rules, regulations and other international and industry labor standards.\n\nMicron does not charge candidates any recruitment fees or unlawfully collect any other payment from candidates as consideration for their employment with Micron.\n\nFor US Sites Only: To request assistance with the application process and/or for reasonable accommodations, please contact Micron’s Human Resources Department at 1-800-336-8918 or 208-368-4748 and/or by completing our General Contact Form\n\nKeywords: Singapore || North East (SG-02) || Singapore (SG) || Frontend Manufacturing || Experienced || Regular || Information Systems and Technology || #LI-ST1 || Tier 4 ", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEYXRhIFNjaWVuY2UgRW5naW5lZXItIFNtYXJ0IE1mZyBcdTAwMjYgQUkgLSBTaW5nYXBvcmUiLCJjb21wYW55X25hbWUiOiJNaWNyb24gVGVjaG5vbG9neSIsImNvbXBhbnlfbWlkIjoiL20vMDJnZHF5IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiOUp0VnRkQzFsazJsRWN3N0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZZQkNyY0JRVTVWWDA1eFZIcFhObnBDYkhOamVqTjBWSFp0U0hBek9HNU1ZVEJtTFZoTFkybDZaV05yVjJoalJ6RmlibEpXWlMxM2NVZGtaRUl3WVhaTVZHTXhOMDlNVkdsdWNEZG9UMnBYVDBKSVRXSlhaMUJSTlVkWWVHVndZMFZ2ZDJsNGJrVklRMnRGYTBwdUxYUTRWVUpvU2pOSk1YWkRSbGhuV25Oa1duSTJRa0ZPUTBzeFZYRkZTRVp5WW0xR1oyUjNaVUZVVjA1QlVtZGlZMGM0TFd4MmJVUlBNV3RLYzB3NFRrUm1SRnBWUm1kSU1Wa3dRVFJGRWhaSVdHMURXVXBZYzAxamNsRnpRVmN5Ym5KZlowRjNHaUpCVDAxWlVuZEVSVkZrVDJ0ZloySTFhRU4yWlhab09HWTJkVVZQT0ZKVVRUaG4iLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18yMSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JXaXoiLCJsaW5rIjoiaHR0cHM6Ly9qb2J3aXouc2cvam9iL0NSLTE3ODk2MzAzMDA/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Data Scientist - Sr - Data Scientist", "company_name": "Engine Biosciences Pte. Ltd.", "location": "Singapore", "via": "via Monster", "description": "Engine Biosciences is a venture-backed biotechnology company discovering and developing novel therapeutics and precision medicines, utilizing a proprietary platform that integrates massively parallel biological experimentation with data science, machine learning and AI. Led by scientific experts from MIT, Harvard, Mayo Clinic and UCSD, and successful drug developers, informaticians, and company builders, Engine is working on multiple programs and therapeutic areas and growing rapidly across US and Asia.\n\nWe are seeking a Data Scientist or Senior Data Scientist with strong expertise in machine learning, statistics or computational biology to design data infrastructure and predictive models for accelerated target and biomarker discovery. You will work with integrating, modeling and interpreting a diverse set of biological data including genomics data, pathway and interaction data and text mining data from internal and external sources to drive scientific insight. You will have a track... record of success in deriving insights from heterogenous sources of biological data through machine learning approaches. You will also bring hands-on experience in algorithm development, data science, machine learning and cloud computing, and will have applied these skills to ideally target discovery. Essential for this role, you will collaborate globally with Engine’s teams and external partners in Asia, US and EU.\n\nMinimum Requirements\n\n· Ph.D. in Computational Biology / Statistics / Machine Learning / Computer Science, or a related field.\n\n· Expertise in comprehensive set of data analytics and modeling methods using machine learning and deep learning approaches and deep understanding of the theories and algorithms\n\n· Familiarity with multi-dimensional omics data and biochemical experimental data and their analysis\n\n· Experience in cloud based (e.g. AWS) data science. Familiarity with SageMaker is an advantage.\n\n· Programming skills in at least two of: Python, AngularJS, Node.js., Java. R., Matlab, SQL and NoSQL dbs.\n\n· Familiarity with DevOps and good software practices (i.e. version control, continuous integration, pipeline development and deployment)\n\n· Strong communication and global collaboration skills.\n\nDesired Skills & Experience\n\n· 2+ years of hands-on industry experience in algorithm development and machine learning in application for drug discovery and biomarker identification\n\n· Experience in natural language processing approaches\n\n· Strong peer reviewed publication record in data science, statistics, bioinformatics, and machine learning.\n\n· Experience in communicating biological interpretation to the science team and executive leadership\n\n· Experience in identifying external datasets to support project needs\n\n· Amazon Web Services (AWS) experience including DevOps, Security, VPC, EC2, EMR, Docker, SPARK, ElasticSearch, Lambda, Redshift, and Amazon Machine Learning (TensorFlow, MXNet, SageMaker).\n\n· Experience working across multiple time zones with executive leadership, scientists and engineers.\n\n· Candidates must hold a valid working visa, residency or citizenship of the US or Singapore.\n\nTo apply, please email your cv to [Confidential Information", "extensions": ["20 days ago", "Full–time"], "detected_extensions": {"posted_at": "20 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEYXRhIFNjaWVudGlzdCAtIFNyIC0gRGF0YSBTY2llbnRpc3QiLCJjb21wYW55X25hbWUiOiJFbmdpbmUgQmlvc2NpZW5jZXMgUHRlLiBMdGQuIiwiY29tcGFueV9taWQiOiIvZy8xMWd4bThwcjk2IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiTWtCRUw4NXhYd3lkRTlyS0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRW9zQ0Nzd0JRVTVWWDA1eFZEQkxSVWQ1VEdWTVh6TnViVmRFTm1WQ0xUVlRUVEF5TFhGVGJVbG5NbTk1UVdndE5qaEpNbk5GV0dKa05qRnNiV042UVdJeU5rbzJVekV6ZEVSSmFtbDZkVzlmVlc1a1kwVmthVFprUjJ4WmIzVnhPVVE0WVhKQ1NFMUdSRGRmVjNGNk0xWm1PQzEwZEU0eVpIcHBZM2d3V1V4alpVZ3lVWFV6ZFRCeFVWRmphVGxLWlRabGVqQk1kbVYyY21jd1ZtaFBXV0Z6WVRNNGVYQkdSMDQzUTFRM2JIWnBVVVYxYTAxaFZIbEhPR0o0YUhkeFFqVlpTVWRGUzBWRE5FYzRVbkpSYVZrM0VoWklXRzFEV1VwWWMwMWpjbEZ6UVZjeWJuSmZaMEYzR2lKQlQwMVpVbmRETWxGTGFESlZXVW8xWmxGNWJURnViR1Z4UWtKNmVsWkZZVEJCIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMjgiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTW9uc3RlciIsImxpbmsiOiJodHRwczovL3d3dy5tb25zdGVyLmNvbS5zZy9hbXAvam9iLXZhY2FuY3ktZGF0YS1zY2llbnRpc3Qtc3ItZGF0YS1zY2llbnRpc3QtZW5naW5lLWJpb3NjaWVuY2VzLXB0ZS1sdGQtc2luZ2Fwb3JlLTI3NTcxODA5Lmh0bWw/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Data Scientist - Machine Learning", "company_name": "Experis Singapore", "location": " (+1 other)", "via": "via Neuvoo", "description": "Our client is a rising MedTech startup is looking for smart and capable Data Scientist to join their exciting Data Science team in Singapore.\n\nThe Responsibilities\n• Research and develop algorithms to detect abnormal subtle changes in physiology using biosensor data in real time\n• Research and develop algorithms to derive clinical derivative parameters from continuous biosensor data\n• Design and architect the algorithms workflow\n• Optimize data analysis processes and systems for better efficiency and maintenance\n• Analyze the pattern, causes and effects of health and disease in the cohort of collected patient data\n• Documentation for the explanation on how algorithms has been implemented, verified and validated\n• Draft and apply paper publications\n• Edit or review task related research documentations\n\nThe Requirements\n• Master or PhD in Bioinformatics, Statistics, Engineering or related field\n• Have good statistical modelling and machine learning skills\n• Hand on experience with end... to end development of data analytics solutions\n• Good knowledge of big data technologies\n• Good with time-series data analytics, anomaly detection, unsupervised learning, hypothesis testing\n• Proficient programming in Python, C/C++\n• Good research ability and critical thinking skills\n• Good communicator", "extensions": ["15 days ago", "Full–time"], "detected_extensions": {"posted_at": "15 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEYXRhIFNjaWVudGlzdCAtIE1hY2hpbmUgTGVhcm5pbmciLCJjb21wYW55X25hbWUiOiJFeHBlcmlzIFNpbmdhcG9yZSIsImNvbXBhbnlfbWlkIjoiL2cvMTFkeHBud20zcyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImtXMkdFaWVCR2V0ekVia1BBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2WUJDcmNCUVU1VlgwNXhVV2wyYTFNdE5tZExiVGRHVkhSNlVFTnlTRXg1TkVOT05YQlZlamxRTUVKeU5XZDBObUpaV1RsU2R6bHFha3BOYlMxaWNqUjJjMWRhYTNWeWFYUnFORmRwZVVacGVUbFpSbEJyVEZoTWRHeHdZM2t3Vlc1VVkzbHhNRU5ZVFVSV1YzWndNM0ZZVVV0VlEzUndaMjlyUkVsSFYzWkpUM05wYzJjeFJFOWxiR3N0YXkxWllrNXJjMGRIZWtSSGRWWktWa2RLV1ZCV09FTkZSMUpFVG5rdFJYaHVaamQzVldReVpsaHJMV2xqTldGRkVoWklXRzFEV1VwWWMwMWpjbEZ6UVZjeWJuSmZaMEYzR2lKQlQwMVpVbmRFZGtWWVNFeGpObVJsWm1WSlIxQm9VbTh3ZFV4UlpWWjZRM0ZuIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMzUiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTmV1dm9vIiwibGluayI6Imh0dHBzOi8vc2cubmV1dm9vLmNvbS92aWV3Lz9pZD0yYzliYjQ3ZGQ1MWJcdTAwMjZ1dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Specialist - Data Scientist", "company_name": "Infineon Technologies", "location": "", "via": "via Singapore Job Mela", "description": "Part of your life. Part of tomorrow.We make life easier, safer and greener - with technology that achieves more, consumes less and is accessible to everyone. Microelectronics from Infineon is the key to a better future. Efficient use of energy, environmentally-friendly mobility and security in a connected world - we solve some of the most critical challenges that our society faces while taking a conscientious approach to the use of natural resources.In your new role you will:Define and implement process models in Infineon process mining platform, based on UiPath Process Mining / Process GoldIn collaboration with business process expert and IT application owner,describe process model requirements and identify IT application data needed for implementation of process modelAssure availability of defined IT application data in a dedicated process miningImplement business process models and dashboards in process mining platform based on prepared dataTake ownership over-developed process... models and assure their maintenance and continuous improvementConsult in capabilities of process mining, provide trainings for end usersProvide support in scouting and observation of process mining provider market as well as newest capabilities, ensure continuous exchange with other process mining developersBecome familiar with bsusiness processes built up in model, mainly in area of financeYou are best equipped for this task if you have:Degree in Mathematics, Computer Science, Natural Science or EngineeringFresh graduate or 1 year of professional experience in the above-mentioned areas, preferable in a big international enterpriseInterested to work in a dynamic start-up spirit-driven intercultural environmentExperience in with data analysis and visualization is a mustGood consulting and moderation skills, ability to explain solution in person and in writingData manipulation skills for one of the well-known database systems like Oracle or MS SQL is a an advantage: SQL, stored proceduresAbility and readiness to use agile methodologies in dynamic work environmentHands-on experience with one or more Process Mining tools (Celonis, UiPath Process Mining, QPR etc.)Process mining experience in Finance is an advantage but not pre-assumptionFamiliarity with Finance, Procurement or supply chain processes in an enterprise suite (e.g. SAP, Oracle, Microsoft) or dedicated business applications is an advantageETL Tool experience (e.g. Alteryx ) is a benefitEnglish language is a must, German is an advantage", "extensions": ["7 days ago", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTcGVjaWFsaXN0IC0gRGF0YSBTY2llbnRpc3QiLCJjb21wYW55X25hbWUiOiJJbmZpbmVvbiBUZWNobm9sb2dpZXMiLCJjb21wYW55X21pZCI6Ii9tLzAyanpraiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjlheEtmaDg4YTVHMWw3T01BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2WUJDcmNCUVU1VlgwNXhVMjV3VlhWRWVYWkZNMWhNTUc4d2RYVkJNamRMYUhKbVIzRlpiRlJoT1ZBM1EyNW5Na0ZqYmkxNllrSkJVMnBJYUZkd2NIZHFiVlY1ZWpKT2VEaFdXRXBoWlVwVVRWZzFNMDlMYjBaWVEweEpabEJvZGpNelQyOTBMWFpUUlVGWFZWZEZZMnd5ZUY5cmNsTnVMV0V4Wm1Sd1V6aDBaMWgxTms5dlJXUk5Xbm8yWlhVd1pVOWpkR2R5U201Sk1rcHJNVXd5Y1V4eVIxTkpaV1YyWkMwNVIxbFhaVlF5Ym01dU5HZHNkR1JwVG05dkVoWklXRzFEV1VwWWMwMWpjbEZ6UVZjeWJuSmZaMEYzR2lKQlQwMVpVbmREUkZJelUzbFFkMHAzTVV4WVQxQlZSbXhrVkZaU2NrbExXR3BuIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNDMiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gU2luZ2Fwb3JlIEpvYiBNZWxhIiwibGluayI6Imh0dHA6Ly93d3cuc2luZ2Fwb3Jlam9ibWVsYS5jb20va2FsbGFuZy1qb2JzL3NwZWNpYWxpc3QtZGF0YS1zY2llbnRpc3QtMTEwMTY1P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "AI/ML - Annotation Analyst- Thai Language Specialist", "company_name": "Apple", "location": "Singapore", "via": "via Jobs At Apple", "description": "Summary\nPosted: Apr 19, 2021\nWeekly Hours: 40\nRole Number:200198824\n\nImagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. The people here at Apple donʼt just craft products - they build the kind of wonder thatʼs revolutionized entire industries. Itʼs the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it.\n\nAre you interested in being part of a team that continues to innovate the way people and machines interact? The launch of Siri was a defining moment in the history of Artificial Intelligence. Siri offers a faster, easier way to get things done on your Apple devices, even before you ask. Millions of people now use Siri to send a message, play their favorite song or even take a selfie. The Siri team is... passionate about technology with a focus on enriching the Siri customer experience. We are looking for motivated Annotation Analysts that demonstrate active listening, integrity and acute attention to detail. Bring passion and dedication to your job and there's no telling what you could accomplish.\n\nThis position will be based at the Apple corporate campus at Ang Mo Kio.\n\nKey Qualifications\n\nKey Qualifications\n• Fluency in Thai reading, writing, and comprehension skills\n• Fluency in English reading, writing and comprehension skills\n• Excellent active listening skills with the ability to understand verbal nuances in the Thai language\n• Highly organized with strong attention to detail\n• Understanding of the APAC region and cultural variations where the Thai language is spoken\n• Demonstrates attention to detail and critical thinking skills in evaluation of Siri’s language usage and dialect\n• Ability to independently navigate systems and tools\n• Demonstrates integrity and focuses on customer privacy\n• Experience in content review or a similar environment, prior testing experience preferred\n• Demonstrates flexibility and adaptability to changing work-flows and responsibilities\n• Grows with a team where expertise is shared and feedback is welcomed\n• Excels at working independently to make timely decisions and take appropriate actions\n• Experience as an end user of Siri, similar Intelligent Personal Assistants, or other AI\n• Successfully meets or exceeds targets, working within tight deadlines\n• Ability to identify business process solutions that increase efficiencies\n• Ability to maintain focus and aim for high results through large volumes of tasks\n\nDescription\n\nDescription\nOur team is comprised of very talented individuals, who are passionate about AI/ML and ensuring Apple services are at their best. As part of the Annotation Team you'll play a central role in enhancing the user experience. We work in a fast paced, dynamic, technology focused environment. As an Annotation Analyst, you'll listen and transcribe audio files and evaluate Siri’s response and language usage, from customers who have opted in to the grading program. You'll use your language and cultural knowledge, along with analytical skills, to evaluate responses against guidelines. Your flexibility and the ability to prioritize tasks is essential. We focus on the user experience, thinking creatively on how customers use Siri and use this knowledge for improvements.\n\nBecause we believe our individual backgrounds, perspectives, and passions help us build the ideas that move all of us forward. We'll train you to be an expert in understanding, supporting and improving the customer experience. This position comes with competitive pay, great benefits, eligibility to participate in our company stock plan, time off, and employee discount.\n\nEducation & Experience\n\nEducation & Experience\nBachelors degree or equivalent work experience preferred\n\nAdditional Requirements\n\nAdditional Requirements\n• Ability to work Monday- Friday from 8:00am-5:00pm or 9:00am-6:00pm local time; with scheduling and work flexibility based on business needs\n• Positions with language skills require strong grammar and cultural awareness\n• Successful completion of a pre-employment assessment and background check\n• Successful completion of initial training and certification testing", "extensions": ["4 days ago", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBSS9NTCAtIEFubm90YXRpb24gQW5hbHlzdC0gVGhhaSBMYW5ndWFnZSBTcGVjaWFsaXN0IiwiY29tcGFueV9uYW1lIjoiQXBwbGUiLCJjb21wYW55X21pZCI6Ii9tLzBrOHoiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJST2h0aDJqR18zS2JDaHlTQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFc3NCQ293QlFVNVZYMDV4VTBsc1JHb3lZbUpyTTFCaGFFZGZWbU4zVEdNeWVrMUpTVzUyTTFSaE5XNHRjRXhMY2tKd1FXTTBSMFl0TmpFeGVXcDZOMDlhYVVzMllVVXhTV28yZDA5aVN6VnlaR0pNWWxKd1FXNW9kbVZpTlRWbGJXVkJTRzQyTWpoMVZHcFdPR3BMTjNGcVkwZHRjRzA1UjBjMk5sbGpYeTF1TWxSYVkzRktXWEp6WmpobFdESkhaRzBTRmtoWWJVTlpTbGh6VFdOeVVYTkJWekp1Y2w5blFYY2FJa0ZQVFZsU2QwTk9lREIwWmtOVlpqWnBWSGRJY1U5UlJGcFJNVll5V0RWWllWRSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzUxIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnMgQXQgQXBwbGUiLCJsaW5rIjoiaHR0cHM6Ly9qb2JzLmFwcGxlLmNvbS9lcy1jby9kZXRhaWxzLzIwMDE5ODgyNC9haS1tbC1hbm5vdGF0aW9uLWFuYWx5c3QtdGhhaS1sYW5ndWFnZS1zcGVjaWFsaXN0P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Data Scientist", "company_name": "DHL", "location": "Singapore", "via": "via Bayt.com", "description": "As the innovation leader in the logistics industry, Deutsche Post DHL Group (DPDHL) focuses on output-oriented innovation management. DHL Asia Pacific Innovation Center (APIC) drives trend research and development of innovative and future-ready supply chain solutions in addition to serve as a regional platform for collaborative innovation with customers, industry partners, research institutes and academia.\n\nFormed in 2016, DHL Applied Analytics is a part of APIC and aims to spearhead the design and development of innovative customer-centric analytics solutions towards the development of new business concepts and value-add across the supply chain.\n\nIf you are a dynamic team player with an entrepreneurial spirit to make a change with your skill set and potential, we’d like to welcome you to explore the career opportunities available with DHL Applied Analytics\n\nKey Accountabilities\n\nAnalytics Solution Design and Development\n\n• Design and implement innovative solutions using statistical... models, machine learning and other data mining techniques\n\n• Handle challenges of analyzing real-world data, such as incompleteness, bias, class imbalance and high volatility\n\n• Create effective visualizations and dashboards to communicate insights with end-users\n\n• Support the development and deployment of scalable and robust software solutions, working with IT solutions engineers\n\nProject Management\n\n• Engage with customer management teams to understand business requirements, project scope and develop a sound project plan\n\n• Think strategically and creatively, to exploit data science for a competitive advantage\n\n• Manage project implementation (for analytics scope only) to ensure that solutions are delivered on time and on requirements\n\nKnowledge Development and Management\n\n• Research and experiment with new advances in analytical methods, algorithms and tools to deepen and develop new capabilities (i.e. deep learning, optimization, parallel computing)\n\n• Elevate team competencies by sharing the latest trends and best practices\n\n• Support knowledge management by ensuring that learnings and insights arising from conferences, projects and industry engagements are documented\n\nREQUIREMENTS\n• 2-5 years experience in Data Science, Analytics\n• Experience with Python, including packages such as NumPy, Pandas and scikit-learn\n• Experience in training, selecting and tuning machine learning models, employing techniques like data preparation, feature engineering, cross-validation and bagging/ boosting.\n• Experience in data visualization tools or libraries such as Tableau, Power BI or packages in Python or Javascript\n• Experience with RDBMS such as MySQL, PostgreSQL, MongoDB, MS SQL Server\n• Good verbal and written communication skills\n• Good project management and organization skills\n• Enjoy self-direction, self-learning and creativity\n• Good team player\n• *\n• * Nice to have:\n• Experience in developing NLP (Natural Language Processing) and image recognition models\n• Experience with deployment and maintenance of models in production, e.g. APIs with capped response time, performance monitoring, automatic retraining and tracking data/ model lineage\n• Experience with cloud platforms like Azure or GCP, especially in relation to data science\n• Experience with Docker, Kubernetes and other supporting container platforms/ tools\n•", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEYXRhIFNjaWVudGlzdCIsImNvbXBhbnlfbmFtZSI6IkRITCIsImNvbXBhbnlfbWlkIjoiL20vMDIxMDg2IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiT0M4MnBNeHowYU9XRVFZdkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXNzQkNvd0JRVTVWWDA1eFVYQTRVMHBCWmt0RmEweEVhMjlQUm5oek1rTXpVamxaYVc5Q1gwbFVhMHN4V2xaNk0waDFaRzgxT0hCdGNEVTFaVlZrTjFvelprOW1jR1JRTlRONFkyMVZVRXg1WDAxdlYxOXpPV3hVTmsxQlJVcFVNRW8wU1dWRGEzWmZkMUU0UjNORlVYSkVWa05wUlROak0yRm9kMFF3WlUxSWFXdHdjV1YzYTJoQlFqRTVhSGhIVERVU0ZraFliVU5aU2xoelRXTnlVWE5CVnpKdWNsOW5RWGNhSWtGUFRWbFNkMFJyY2pKalFXMTVhbGhPWkVkMFRXVlhhVFJMYjBONk9XOHRSVkUiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY181OSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCYXl0LmNvbSIsImxpbmsiOiJodHRwczovL3d3dy5iYXl0LmNvbS9lbi9zaW5nYXBvcmUvam9icy9kYXRhLXNjaWVudGlzdC01ODkzMjQ1MS8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Data Science Trainer Job in Singapore | Jooble", "company_name": "Institute of Data Science", "location": "Singapore (+1 other)", "via": "via Jooble", "description": "Mar 25, 2021\nData Science Trainer\n• Institute of Data\n• Singapore\n\nFull timeSecurity\n\nJob Description\n\nOur Data Science and Artificial Intelligence (AI) programs are life-changing educational experiences where students graduate with the skills and mind set to take on new careers in a wide variety of Data Science & AI roles. Our students are passionate about data science, often career changers who are working full time in a similar or unrelated field.\n\nWe are looking for lead and assistant trainers to lead this transformative experience.\n\nThis is a part-time role outside normal business hours.\n\nWhy be a trainer for the Data Science & AI course?\n\nIf you are looking to make a life-changing impact by doing what you know and love, this is the position for you. Through this unparalleled opportunity, you will:\n• Hone your own leadership and management skills by becoming part of the team\n• Deepen your own skills by guiding students through a rigorous journey where they begin as driven... beginners and leave as empowered data analysts and scientists.\n• Contribute your own expertise to a deep and broad curriculum\n• Facilitate a supportive and energetic community that lasts well beyond the course.\n\nAs a member of the trainer team, you will not only impact the careers of your own students who are mostly changing careers, but you’ll also have a unique opportunity to shape the potential of students.\n\nSkills and Qualifications\n\nMust Have:\n• You have previous data science or engineering teaching experience, through a course, workshop, team training, etc.\n• You are eager to shape the skills, minds, and trajectories of the newest generation of data scientists.\n• You are eager to join a fast-growing education business.\n• You have at least 2 years of professional data science experience.\n• You are an expert in SQL, Python, and related Python libraries (pandas, numpy).\n• You have domain expertise in statistics, mathematics, and probability.\n• You can build and apply statistical models in python using machine learning libraries, such as scikit-learn and statsmodels.\n• You have a deep understanding of statistical hypothesis testing and experimental design, data visualization techniques and tools (i.e. matplotlib, bokeh, etc), and manipulation of large data sets.\n• You can demonstrate and explain the function of machine learning algorithms such as regularized regression, naive bayes, decision trees, ensemble methods, KNN, K-means clustering, and neural networks.\n• You are the person your colleagues naturally gravitate to when they are trying to figure something out.\n\nNice to have:\n• You have proficiency with python libraries such as NLTK; Hadoop or Apache Spark; D3.js or R.\n• You are on top of industry trends in big data, machine learning, deep learning, and AI.\n• Management and/or director experience in a small business (for Lead role)\n• Relevant data professional certification.\n\nResponsibilities and Duties\n• Coordinate with directors with the planning and implementation of the Data Science and AI program\n• Deliver instructions up to 20 hours per week, including teaching, advising, and content development.\n• Work closely with your instructional team to provide students with meaningful and prompt feedback on their progress.\n• Collaborate alongside staff in order to best meet the needs and learning styles of your students.\n• Guide students through the development of real world projects that will showcase their abilities to hiring managers.\n• Facilitate a dynamic and collaborative classroom community.\n• Inspire students to persevere through the challenges of learning complex subjects.\n• Contribute to the material and direction of an expanding curriculum, ensuring the course remains cutting-edge and effective for students.\n\nApplicants are to apply with their resume and a cover letter.\n\nAbout Institute of Data\n\nThe Institute of Data transforms careers and companies for a data-driven world.\n\nCyber security, big data and artificial intelligence are increasingly important to business and society with the rapid adoption of information technology.\n\nWe help professionals build a career in this high-growth industry through our education programs and established industry network.\n\nModern business must also adapt in order to keep up and stay competitive. We help businesses evolve with innovative solutions and industry partnerships.\n\nApply Now\n\nShare this job", "extensions": ["29 days ago", "Full–time"], "detected_extensions": {"posted_at": "29 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEYXRhIFNjaWVuY2UgVHJhaW5lciBKb2IgaW4gU2luZ2Fwb3JlIHwgSm9vYmxlIiwiY29tcGFueV9uYW1lIjoiSW5zdGl0dXRlIG9mIERhdGEgU2NpZW5jZSIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoibVI4ZVJpS1haZGZ0cWhOV0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb29ibGUiLCJsaW5rIjoiaHR0cHM6Ly9zZy5qb29ibGUub3JnL2pkcC8tODk0MTc2NjI3ODU5NzY5NjQxMi9EYXRhLVNjaWVuY2UtVHJhaW5lci1TaW5nYXBvcmU/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Data Scientist", "company_name": "Titansoft Pte Ltd", "location": "Singapore (+1 other)", "via": "via Job Vacancies In Singapore", "description": "Game changer, armed with data.< strong>< p>\n\nYou know all about our users, through data analysis. And because you do, you can identify issues and present insights to our Product Owners, spurring them into action. Working with your team, you play a key role in enhancing our business value. After all, you're the one who ignited the spark. And no spark, no fire.< p>\n\nWhat a Data Scientist does in Titansoft:< strong>< p>\n• Apply statistical and machine learning techniques to build models for user classification, fraud detection and other objectives.< li>\n• Mine, analyze and visualize data from company databases to drive optimization and improve product development, marketing techniques and business strategies.< li>\n• Identify, understand and solve business problems based on the company's overall targets.< li>\n• Coordinate with different feature teams to implement models and design proper performance evaluation metrics.< li>< ul>\n\nWhat we are looking for in a Data Research Engineer... strong>< p>\n\nQualifications< strong>< p>\n• Bachelor (and above) in Computer Science, Mathematics or Physics, Engineering, Statistics or other equivalent qualifications< li>< ul>\n\nExperience< strong>< p>\n• Equip with knowledge and experience in application of a variety of Machine Learning techniques (clustering, decision tree, neural network, etc.)< li>\n• Equip with knowledge and experience in application of advanced statistical techniques (regression, various statistical tests, etc.).< li>\n• Real-world Machine Learning project experiences.< li>\n• Having kaggle or other competition experience is a plus.< li>< ul>\n\nSkills< strong>< p>\n• Proficiency in Python (must), SQL or other programming languages.< li>\n• Proficiency in common Machine Learning frameworks, etc., Scikit-learn, Keras, Tensorflow< li>\n• Strong problem-solving skills< li>\n• Excellent written and verbal communication skills for coordinating across teams and with stakeholders.< li>< ul>\n\nPlease apply for our position at the following link below.< strong>< p>\n\nhttps: www.titansoft.com en career 122< strong>< p>\n\nWhat everyone gets in Titansoft (psst. We didn't get that Best Tech Company to Work for Award in 2017 for nothing!)< strong>< p>\n• 18 days of rest and relaxation for each year (P.S. It gets even better over the years!)< li>\n• Competitive salaries and bonuses bench-marked against big players in the industry (Yeap, those companies!)< li>\n• Flexible working hours (Sleep in a little longer after fixing that pesky bug from last night)< li>\n• Comprehensive insurance coverage Very well-stocked pantry (We've never heard of the term 'Hunger Games', nope)< li>\n• Communities of Practice and Workshops catered for your growth and learning< li>\n• Substantial subsidies and programs to keep that creative flow while having fun (Health promotion program, annual overseas company outing, an annual dinner that nobody will ever forget, etc.)< li>\n• Hardcore work and hardcore fun!< li>< ul", "extensions": ["14 days ago", "Full–time"], "detected_extensions": {"posted_at": "14 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEYXRhIFNjaWVudGlzdCIsImNvbXBhbnlfbmFtZSI6IlRpdGFuc29mdCBQdGUgTHRkIiwiY29tcGFueV9taWQiOiIvZy8xMWc3MDUyajhwIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiODdSNS1nbzBHanlaQ0N6UUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZZQkNyY0JRVTVWWDA1eFVrODRjWE4wVm1aMlgxOUNaMDh3V2t4NFEzSk9RMFpJVWpWclIwcENZMVpZZUZGeVoyVXhSSFI2WjJsUWQzbDBZbHB5TldaTU4waFNPSFZ1UkZNd09IZzViR2g1T1hneGFEYzNVR1V3VUdNMWEybGpSSEpzUzAwMldISnpWRVkwVFRWSFJUbFNRWE5wWVZKVmJuTjJObVZOUjBkeE9VNVVjREJXU0Y5TFRHVTJUR1JyWTNCME5IRXlWMFpYU2poVVkxTjVSRlpPYm5kTkxWZHBaVTlIZFU5a05tUkJZVEYwYlV0eVpFUnlWRVJGRWhaSVdHMURXVXBZYzAxamNsRnpRVmN5Ym5KZlowRjNHaUpCVDAxWlVuZEJWVWRDUjA1WVozQjBUVGxXU0ZCdFRFOWhTSEowU0V4RGRFcG4iLCJmY3YiOiIzIiwiZmNfaWQiOiJmY183MSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2IgVmFjYW5jaWVzIEluIFNpbmdhcG9yZSIsImxpbmsiOiJodHRwczovL2pvYmVrYS5zZy9qb2JzLzE0NjE4L1RpdGFuc29mdC1QdGUtTHRkLURhdGEtU2NpZW50aXN0LTIwMjEtMDQtMDk/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}], "chips": [{"type": "Title", "param": "job_family_1", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Data scientist", "value": "data scientist"}, {"text": "Learning engineer", "value": "learning engineer"}, {"text": "Research associate", "value": "research associate"}, {"text": "Data science", "value": "data science"}, {"text": "Data engineer", "value": "data engineer"}, {"text": "Scientist", "value": "scientist"}, {"text": "Trainer", "value": "trainer"}, {"text": "Associate", "value": "associate"}, {"text": "Data analyst", "value": "data analyst"}, {"text": "Engineer", "value": "engineer"}, {"text": "Officer", "value": "officer"}, {"text": "Project manager", "value": "project manager"}, {"text": "Project officer", "value": "project officer"}, {"text": "Senior", "value": "senior"}, {"text": "Audit", "value": "audit"}, {"text": "Consultant", "value": "consultant"}, {"text": "Consulting", "value": "consulting"}, {"text": "Customer", "value": "customer"}, {"text": "Deputy director", "value": "deputy director"}, {"text": "Lecturer", "value": "lecturer"}, {"text": "Operations engineer", "value": "operations engineer"}, {"text": "Owner", "value": "owner"}, {"text": "Research engineer", "value": "research engineer"}, {"text": "Research scientist", "value": "research scientist"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Specialist", "value": "specialist"}, {"text": "Technical architect", "value": "technical architect"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Internship", "value": "INTERN"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Mining", "value": "/business/naics2007/21"}, {"text": "Research", "value": "/business/naics2007/5417"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Staffing", "value": "/business/naics2007/5613"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "Nanyang Technological University", "value": "/m/0l49k"}, {"text": "Shopee", "value": "/g/11gh3fk34r"}, {"text": "DBS Bank Ltd", "value": "/m/01q7n5"}, {"text": "Michael Page", "value": "/m/04cxldw"}, {"text": "Micron", "value": "/m/02gdqy"}, {"text": "Air Liquide", "value": "/g/11dx9gkdhq"}, {"text": "Apple", "value": "/m/0k8z"}, {"text": "ByteDance", "value": "/g/11ghnfr0sv"}, {"text": "CTES Consulting Pte Ltd", "value": "/g/11jrn4m1xc"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "SEPPIC", "value": "/m/0g558ww"}, {"text": "Standard Chartered", "value": "/m/02hszk"}, {"text": "United Overseas Bank", "value": "/m/04gjd1"}, {"text": "AIR LIQUIDE INDUSTRIAL SERVICES PTE LTD", "value": "/g/11hg55y1rb"}, {"text": "Acronis", "value": "/m/04pjlt"}, {"text": "BIGTAPP PTE. LTD.", "value": "/g/11dxpsg5nn"}, {"text": "Burpple", "value": "/g/11dxps5yv5"}, {"text": "Covance by Labcorp", "value": "/m/03ll59"}, {"text": "DHL", "value": "/m/021086"}, {"text": "DUN & BRADSTREET (SINGAPORE) PTE. LTD.", "value": "/g/11g9mpp2ph"}, {"text": "Dathena Science", "value": "/g/11dxprdn6y"}, {"text": "EasyMile", "value": "/g/11bwh58jhs"}, {"text": "Engine Biosciences Pte. Ltd.", "value": "/g/11gxm8pr96"}, {"text": "Experis Singapore", "value": "/g/11dxpnwm3s"}, {"text": "FieldBox.ai", "value": "/g/1ptyw89vr"}, {"text": "GIC Private Limited", "value": "/g/11mpj15pxw"}, {"text": "Government Technology Agency", "value": "/g/11gh0528nq"}, {"text": "Health Sciences Authority", "value": "/m/0h7fhh"}, {"text": "Hewlett Packard Enterprise (HPE)", "value": "/g/11b804x9ty"}, {"text": "Infineon Technologies", "value": "/m/02jzkj"}, {"text": "Infinite Computer Solutions Pte Ltd", "value": "/g/11g9mj72yz"}, {"text": "Institute Of Technical Education (ITE)", "value": "/m/05_02p"}, {"text": "KPMG Singapore", "value": "/g/11dxpsb9nr"}, {"text": "Lazada", "value": "/g/1q5bfkdqp"}, {"text": "Ministry of Defence Singapore", "value": "/m/0566dt"}, {"text": "Ngee Ann Polytechnic", "value": "/m/05451y"}, {"text": "Republic Polytechnic", "value": "/m/06jgzw"}]}]}