{"search_metadata": {"id": "608279e0ada54b4132934efb", "status": "Success", "json_endpoint": "https://serpapi.com/searches/6814c375e46235d7/608279e0ada54b4132934efb.json", "created_at": "2021-04-23 07:40:16 UTC", "processed_at": "2021-04-23 07:40:16 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28programmer%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=80", "raw_html_file": "https://serpapi.com/searches/6814c375e46235d7/608279e0ada54b4132934efb.html", "total_time_taken": 1.23}, "search_parameters": {"q": "(programmer) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "80"}, "jobs_results": [{"title": "Salesforce Developer", "company_name": "Razer Inc.", "location": "Singapore", "via": "via Neuvoo", "description": "Job Responsibilities\n\nThe Salesforce Developer is responsible for designing, configuring, implementing, testing, and deploying solutions for Razer internal business groups, using Apex, SOQL and Visualforce, and often leveraging HTML, CSS, JavaScript, Lightning, Excel Macro and other technologies.\n\nThis is a customer-centric role, therefore, the Developer must be able to communicate well with internal & external facing environments, understand customer requirements and translate them into a technical reality that is extendable and scalable.\n• Lead/participate in Salesforce.com (SFDC) Project Implementation, Change Management and Service Desk function\n• Responsible for designing, configuring, developing, testing, training, documenting and deploying high quality and adhering to best practice business solutions on the Force.com platform\n• Conduct design review of the application and provide guidance to the team on recommendations to help ensure the development of a successful... application\n• Conduct a peer review of codes and/or components that other team members have improving overall code quality, making sure the design is up to SFDC standards, or providing sign off\n• Develop and maintain integrations between SFDC and 3rd party services (eg. APIs, middleware, etc)\n• Migrating/Deploying codes and SFDC components using out of the box and/or other deployment tools\n• Coordinate and manage communications between business analysts, application developers, vendors, and internal business users\n• Leverage on thorough understanding of business processes and system processes to make recommendations and propose technical/non-technical solutions to meet business requirements\n• Migrating SFDC records through data loader and other migration tool\n• Other duties as assigned\n\nPre-Requisites\n• Bachelor’s Degree in IT or equivalent with 5+ years of technical experience, minimum 3 years in SFDC\n• Experience as a consultant is preferred\n• Good understanding of SFDC fundamental concepts (application, data and security), CRM domain knowledge (Sales Cloud, Service Cloud and Marketing Cloud) and best practices\n• Strong module configuration and technical skills in Apex, Visualforce, Java, etc.\n• Strong technical foundation in integration components for SFDC, SFDC APIs (SOAP, REST, BULK APIs), Apex controllers, Apex Web Services, Apex callout, inbound & outbound messaging, SFDC data loaders, middleware, etc.\n• Strong analytical and problem solving skills; experience in both process and solution analysis\n• Strong interpersonal skills, results oriented and ability to work independently and effectively in a global team environment\n• Ability to multitask effectively and deliver working solutions on a tight schedule and fast-paced environment\n• Strong oral and written communication skills\n• Experience in Salesforce Lightning will be added advantage\n• Salesforce Certification/s is a plus", "extensions": ["4 days ago", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTYWxlc2ZvcmNlIERldmVsb3BlciIsImNvbXBhbnlfbmFtZSI6IlJhemVyIEluYy4iLCJjb21wYW55X21pZCI6Ii9tLzA3NWhjMCIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImQyaFJybC1vM1I4V0czSnZBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhVekU1VEZsS1RtRmpSR2sxT0hFMlNrTktUV2hSTjJWT1UwRndiRkZ1U1c5M1IwcEVaMWRmTkY5NlZVaFNaVFl6YlVrd1dXbzNjR1pQWDFkME4zRjNXWGw2UlhSRlYzWTRMVFZKZVdjNWN6TlZSbWg1VjJvdFptNVFORVZmVTJWNk0wVm9MVGRZV21kaVNUQlZNa042Y0ZKT04yeG5iSFpFY1dWRlYwRkxRMGt3ZEMxTVRuVkdjbEk1TjJsUVJISjZTemhmYkVkRGRGcFZhWE5uRWhZMFdHMURXVXRZZVVKemVsSjBRV0pHZEVsSFVVUkJHaUpCVDAxWlVuZEVORVpJZVRJdFRtUXlNMU5RWTFOeGNrNXFTRTluY2xCRGR6aDMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY183IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE5ldXZvbyIsImxpbmsiOiJodHRwczovL3NnLm5ldXZvby5jb20vdmlldy8/aWQ9YzI3MmY4MmM1NDUzXHUwMDI2dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Senior Full Stack Developer", "company_name": "TECHNOPALS PTE. LTD.", "location": "Singapore (+1 other)", "via": "via Learn4Good", "description": "Roles &\n\nResponsibilities\n\nRESPONSIBILITY· Solution the design and develop the software using waterfall/Agile methodology· Perform investigation, troubleshoot issues by developing scripts, SQL queries· Work closely and collaborate with the Business Analysts and Quality Engineers/application testers for user stories elaboration, test automation, bug fixes etc· Work with deployment team/DevOps team on setting up continuous integration, build and release automation· Provide estimates for stories during sprint planning for Agile project· Convert acceptance criteria into automated unit tests cases· Support production issues and duty rotation for after-office-hours support· Champion Agile technical practices such as test driven development, pair programming and refactoring· Involve in application deployment to the various environments\n\nSKILLS SET AND TRACK RECORD· Tertiary\n\nEducation in relevant fields is preferred· Relevant software development certifications, e.g. Microsoft Certified... Solution Developer for Dynamics or equivalent· Good understanding and completion of projects using waterfall/Agile methodology· Demonstrable skills in development (C#, ASP, SQL Server, Java, Core Java)· Hands on development experience on C#/.NET, MVC, LINQ, Telerik, Kendo\n\nUI, WebAPI, Entity Framework· Excellent knowledge on front-end tools - React, Angular and other JS frameworks· Good knowledge on AWS cloud· Experience in secure coding, WAF and VAPT.· Must possess a DevOps mindset. Demonstrate knowledge of creating packaging/build scripts with MSBuild, Maven, Docker etc is mandatory·\n\nAbility to troubleshoot complex issues ranging from system resource to application stack traces· Track record in implementing systems with high availability, high performance, high security hosted at various data centres or hybrid cloud environments will be an added advantage· Team player with ability to collaborate and work effectively within team· Good written and verbal communication and interpersonal skills· Passion for automation, standardization and best practices· Good presentation skills is preferred\n\nTell employers what skills you have\n\nAgile Methodologies\n\nSoftware Development\n\nTest Automation\n\nWeb Applications\n\nWeb Development\n\nWeb Servicesdesignedtroubleshoot\n\nUser story\n\nDevelop software\n\nAgile Development\n\nSQL Query\n\nBUG Fixing", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgRnVsbCBTdGFjayBEZXZlbG9wZXIiLCJjb21wYW55X25hbWUiOiJURUNITk9QQUxTIFBURS4gTFRELiIsImNvbXBhbnlfbWlkIjoiL2cvMTFkeHB2a3lucCIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IktMUVhmYnpCZTEyazlOWEJBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2WUJDcmNCUVU1VlgwNXhWR2t4WjI5dVlrSkpVME5RTnpadmEwMW5jVzVGVmtVd1EwUTRlbXBTVGxZNWNTMUVUMjFhZWpSNU4xRTBZM2RaU25SaFJFTm1UWGN3VVV0aFdWaFpXRFpVZEhCaGF6WkROM1pZVnpadGRFMUVhWGhoTm01WE5EQnZTa1V6U0dOUU5WTmhXRWcxYnpBM1QzRmFjMVF3WmtSVVlrbzVSa1JhUzJONFNrNUpUVzFTVWxaVE5sVnVURlkwY21sMU1tbzFNVU5YYUVWc2JFNDNNWFJKTW5KS1RGZFRlbGhOTjJjdGNEbHZkbGhrY25WTkVoWTBXRzFEV1V0WWVVSnplbEowUVdKR2RFbEhVVVJCR2lKQlQwMVpVbmRFU0ZSRk1tTXlVa000UlcxUlNVUkVSM1ZhUlVwdFgzVTNVR3AzIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMTUiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGVhcm40R29vZCIsImxpbmsiOiJodHRwczovL3d3dy5sZWFybjRnb29kLmNvbS9qb2JzL3NpbmdhcG9yZS9zb2Z0d2FyZV9kZXZlbG9wbWVudC8yNzEyODczMzAvZS8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Staff Software Engineer - API - Singapore", "company_name": "Singtel", "location": "Singapore", "via": "via JobWiz", "description": "Job Description :\n\nRealise your full potential with Asia's leading communications group. While we take pride in our 140-year heritage, our philosophy is to always look forward and evolve. Today, we are a leader in cutting-edge ICT innovation and digital advances, powered by a vast network of offices in countries and territories across Asia Pacific, the Middle East, Europe and the USA. Come be a part of our dynamic organisation as we create the infocomms landscape of the future.\n\nThe responsibilities of this role are:\n\nPerform architecture, design and review of security policies for adherence to standards and best practices.\n\nDevelopment of API security standards and implementation (Oauth, OpenId) as part of API gateway.\n\nResponsible for development and maintenance of API gateway plugins in a languages Lua, Java, or Javascript.\n\nResponsible for the review of the end-to-end integration of service patterns on API management platform.\n\nResponsible to define & establish API development... best practices ,API versioning and Security Guidelines.\n\nResponsible for deployment patterns of API gateway and agreed SLA including includes API gateway upgrade as well.\n\nEstablish and Manage the API governance function within organization. Support multiple groups and teams within organization to review best practices and guidelines\n\nEstablish the operating model of the API gateway implementation and setup the onboarding process consistently across project teams.\n\nThe ideal candidate will need to have the following qualities and experience:\n\nDeep knowledge and hands-on experience in API management platforms (Apigee or Kong, or alternate) and API related activities: requirement analysis, solution architecture and design, resource-based API modeling, micro-services architecture.\n\nKnowledge about API design standards, patterns and best-practices - Deep knowledge and hands-on experience in API security standards and implementation (Oauth, OpenId)\n\nProven track record of acting as SME for API projects - Knowledge and experience designing and implementing API Governance\n\n4+ years of experience as both a hands-on architect and a software engineer across variety of data domains\n\nStrong hands-on experience in API development, design, deployment and operation in production.\n\nGood understanding of OAuth 2.0 / OpenID / SAML 2.0 protocols\n\nHighly comfortable with Java Spring Framework / Spring Cloud / Spring batch\n\nPossesses deep understanding on Cloud Native applications\n\nExperienced with building applications usingAWS, PCF or Openshift\n\nExperience writing unit, functional, load and end-to-end tests\n\nExperience working with JIRA, Confluence, Jenkins & bitbucket\n\nStrong working knowledge of SDLC and Agile development methodologies\n\nCertification in AWS, Java, J2EE, ITIL would be an added advantage\n\nLet's shape a better world through technology. Join us to lead the change.\n\nNote to Recruitment Agencies\n\nIn sourcing for candidates for particular roles, the Singtel Group works only with a panel of selected recruitment agencies expressly engaged under written agreements. Even then, these agencies are only activated from time to time for specific recruitment exercises for particular roles under instructions expressly issued by a member of the Singtel Talent Acquisition team.\n\nExcept under such circumstances, no agency shall source or attempt to source any candidates for the Singtel Group. The Singtel Group will not pay nor be obliged or liable to pay any recruitment fees of any kind whatsoever to any agency where candidate CVs are submitted to the Singtel Group by such agency on an unsolicited or speculative basis.\n\nThe Singtel Group reserves all rights to directly contact any candidate to which such CVs relate without any obligation or liability whatsoever to the agency concerned (including without limitation any obligation or liability to pay any recruitment fees of any kind).\n\nJob Description :\n\nRealise your full potential with Asia's leading communications group. While we take pride in our 140-year heritage, our philosophy is to always look forward and evolve. Today, we are a leader in cutting-edge ICT innovation and dig", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTdGFmZiBTb2Z0d2FyZSBFbmdpbmVlciAtIEFQSSAtIFNpbmdhcG9yZSIsImNvbXBhbnlfbmFtZSI6IlNpbmd0ZWwiLCJjb21wYW55X21pZCI6Ii9tLzAyMHpmbCIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjdTQUpLNGZQUXc5ZzZMX0xBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVzc0JDb3dCUVU1VlgwNXhVbUptVUZKek5VVjZUalE0VFhwVmJWQlNjRXBCVmw5ZlEzaGtSazh6WlhSRlIzWlBPV3hyYzJobGVubEViekZpYzFOQ01XWjBkak42TUdSTVVWcENXalpaWlZGUE1sVTJSemRuTjBOMUxWZGZhVlYwYjI5TldWQkxWbFJKV1hodFVGaGhRamN0YjFGWlRXbFlRbUZtWldkUFNVMXpjakJsU0ZOaFpsYzJaM00zY25Wdk0wY1NGalJZYlVOWlMxaDVRbk42VW5SQllrWjBTVWRSUkVFYUlrRlBUVmxTZDBKRWNFSlpaV1pQVEhaNFQyMU1lbXAzVlU1UFZUTnlabTFTVDNjIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMjMiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9iV2l6IiwibGluayI6Imh0dHBzOi8vam9id2l6LnNnL2pvYi9DUi00MjU0NTQ0MTMzP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Apps Dev Sr Programmer Analyst", "company_name": "Citi bank", "location": "Singapore", "via": "via Bayt.com", "description": "The Applications Development Senior Programmer Analyst is an intermediate level position responsible for participation in the establishment and implementation of new or revised application systems and programs in coordination with the Technology team. The overall objective of this role is to contribute to applications systems analysis and programming activities.\n\nResponsibilities:\n• Conduct tasks related to feasibility studies, time and cost estimates, IT planning, risk technology, applications development, model development, and establish and implement new or revised applications systems and programs to meet specific business needs or user areas\n• The primary focus of the job would be an individual contributor to build a suite of next generation UI products in the Equities Cash space. The candidate needs to have hands on experience with HTML5 front end JS frameworks (React/ Angular) and with Java(Springboot) and Node JS. Experience with building real time trading/order management... platforms would be preferred.\n• The candidate would also need to have experience conducting technology workshops, brainstorming and coming up with UI prototypes in Figma/Sketch or wireframes in Balsamiq to set the direction of the project\n• Monitor and control all phases of development process and analysis, design, construction, testing, and implementation as well as provide user and operational support on applications to business users\n• Utilize in-depth specialty knowledge of applications development to analyze complex problems/issues, provide evaluation of business process, system process, and industry standards, and make evaluative judgement\n• Recommend and develop security measures in post implementation analysis of business usage to ensure successful system design and functionality\n• Consult with users/clients and other technology groups on issues, recommend advanced programming solutions, and install and assist customer exposure systems\n• Ensure essential procedures are followed and help define operating standards and processes\n• Serve as advisor or coach to new or lower level analysts\n• Has the ability to operate with a limited level of direct supervision.\n• Can exercise independence of judgement and autonomy.\n• Acts as SME to senior stakeholders and /or other team members.\n• Appropriately assess risk when business decisions are made, demonstrating particular consideration for the firm's reputation and safeguarding Citigroup, its clients and assets, by driving compliance with applicable laws, rules and regulations, adhering to Policy, applying sound ethical judgment regarding personal behavior, conduct and business practices, and escalating, managing and reporting control issues with transparency.\n\nQualifications:\n• 5-8 years of relevant experience\n• Experience in systems analysis and programming of software applications\n• Experience in managing and implementing successful projects\n• Working knowledge of consulting/project management techniques/methods\n• Ability to work under pressure and manage deadlines or unexpected changes in expectations or requirements\n• Front end framework: React/Angualar\n• Backend Framework: Springboot(Java)/ Node(JS)\n• Experience with realtime trade/order management systems.\n• Experience with Websockets/ Server Sent events/ Polling/ Web workers.\n• Know-how of couchbase(Querying, Analytics etc).\n• Sketch/ Balsamiq/ Figma for prototyping and design.\n• Experience Conducting code and design reviews, organizing scrums, and contributing to the platform code that serves as a backbone for developers to build user functionality.\n\nEducation:\n• Bachelor’s degree/University degree or equivalent experience\n\nThis job description provides a high-level review of the types of work performed. Other job-related duties may be assigned as required.\n\n-------------------------------------------------\n\nJob Family Group:\n\nTechnology\n\n-------------------------------------------------\n\nJob Family:\n\nApplications Development\n\n------------------------------------------------------\n\nTime Type:\n\n------------------------------------------------------\n\nCiti is an equal opportunity and affirmative action employer.\n\nQualified applicants will receive consideration without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.\n\nCitigroup Inc. and its subsidiaries (\"Citi”) invite all qualified interested applicants to apply for career opportunities. If you are a person with a disability and need a reasonable accommodation to use our search tools and/or apply for a career opportunity review Accessibility at Citi.\n\nView the \"EEO is the Law\" poster. View the EEO is the Law Supplement.\n\nView the EEO Policy Statement.\n\nView the Pay Transparency Posting", "extensions": ["18 days ago", "Full–time"], "detected_extensions": {"posted_at": "18 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBcHBzIERldiBTciBQcm9ncmFtbWVyIEFuYWx5c3QiLCJjb21wYW55X25hbWUiOiJDaXRpIGJhbmsiLCJjb21wYW55X21pZCI6Ii9tLzAxZGZiNiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IkFhZGhwWjA0cldtQUpYbU1BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhVMEZTVG1nd1RtUjFhbEJ3YzAxRWJqaEdNbkIxT0V0ZmFrOVRTMmMyY0RscU56WnZSWGhSTWpWbmFWZG1RVWhRTkMwd1QwUlpRV3M1ZVhwTVdVTm1kMEZxYUhKM1gxVXpVV0o0VG5kRk1taDZUMXBNVGtscFZEZFFaV2w0Y2s1bE1qZG5PRGQwVVhVMlZscDBOSFZEWDNGM2JtMXFUMlJ6V1U5SVQzUTFORlYwUkhSS1VYbE5kVmhZTWpkNVZVWlNTblpsTFRSaU1USkxWbmxSRWhZMFdHMURXVXRZZVVKemVsSjBRV0pHZEVsSFVVUkJHaUpCVDAxWlVuZERlSGswUVdOcldHOWtXR1JZTUc5dE5qSlpTalZVU2twaWJuSlIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18zMSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCYXl0LmNvbSIsImxpbmsiOiJodHRwczovL3d3dy5iYXl0LmNvbS9lbi9zaW5nYXBvcmUvam9icy9hcHBzLWRldi1zci1wcm9ncmFtbWVyLWFuYWx5c3QtNTkzNDMzNzkvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Software Engineer (Mobile and Web Application Development) - Accounting Firm", "company_name": "3E Accounting Pte Ltd", "location": "Singapore (+1 other)", "via": "via 3E Accounting", "description": "3E Accounting Singapore is currently looking to appoint a Software Engineer (Mobile and Web Application Development) to join their company digital R&D team in Singapore office.\n\n3E Accounting Pte Ltd aims to be the leading corporate service provider and top accounting firm in Singapore providing One-Stop Solution services for our clients.\n\n3E Accounting Pte Ltd, Singapore is the global headquarters of 3E Accounting International, an International Accounting network with a global presence in more than 80 countries worldwide.\n\nOur Mission\nTo offer the Three Es: efficiency, effectiveness and economy, all part of our One-Stop Solution services for our clients.\n\nOur Vision\nThe World’s leading corporate service provider, offering services beyond excellence.\n\nRemuneration is commensurate with qualifications and work experience. Qualified and interested candidates should email their resume to info@3ecpa.com.sg\n\nPlease state your current and expected salary.\n\nJob Responsibilities:\n\n• Design... and develop various component of the web and mobile application\n• Responsible for analysing requirements, developing and maintaining Web Services APIs, applications to meet the business needs.\n• Collaborate closely with users and internal stakeholders to manage the resolution of tasks/issue within the web\n• Oversee the implementation of corrective, preventive and adaptive maintenance\n• Any other ad-hoc duties as required or assigned\n\nRequirements:\n\n• Degree in Computer Science, Information Technology or related degrees\n• Prior experience in web development\n• Experience in development of modern responsive User Interface using HTML5, CSS3, Javascript, Jquery and Node.js etc", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciAoTW9iaWxlIGFuZCBXZWIgQXBwbGljYXRpb24gRGV2ZWxvcG1lbnQpIC0gQWNjb3VudGluZyBGaXJtIiwiY29tcGFueV9uYW1lIjoiM0UgQWNjb3VudGluZyBQdGUgTHRkIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJWOUVWZE90aGNNNi1DcTB5QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIDNFIEFjY291bnRpbmciLCJsaW5rIjoiaHR0cHM6Ly93d3cuM2VjcGEuY29tLnNnL2NhcmVlcnMvc29mdHdhcmUtZW5naW5lZXItbW9iaWxlLWFuZC13ZWItYXBwbGljYXRpb24tZGV2ZWxvcG1lbnQvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "SOFTWARE ENGINEER - C#,.NET - SINGAPOREANS ONLY - 0-2 YRS EXP", "company_name": "APBA TG Human Resource Pte Ltd", "location": "", "via": "via Joblum Singapore", "description": "Job Description\n• Part of project team and to provide software solution customized to meet specific project and operation requirement\n• Software Development (C#/)\n• Documentation of the Software Requirements and Software Design\n• Functional Testing and Software Testing (Static Code Testing, Dynamic Code Testing)\n• Training of customers and/or cross training of colleagues\nRequirement\n• Degree or Diploma in Computer Science / Computer Engineering / Information Technology.\n• Programming knowledge (C#) is preferred.\n• 3 to 4 years programming experience in C#,.Net\n• Knowledge of Software Development Cycle\n• Has successfully delivered projects with knowledge of Software Development Cycle.\n• Able to take on challenges of software project to deliver project on time with acceptable quality.\n• Fresh Degree Holders who are have an interest in Software Development & keen to learn will be favourably considered\n\n10 position(s) available.\nin location AMK: This is ayearly renewable contract position... with benefits. This is NOT a PERM position.\nIn location Boon Lay: could be perm too", "extensions": ["22 days ago", "$3.5K–$4.9K a month", "Full–time"], "detected_extensions": {"posted_at": "22 days ago", "schedule_type": "Full–time", "salary": "$3.5K–$4.9K a month"}, "job_id": "eyJqb2JfdGl0bGUiOiJTT0ZUV0FSRSBFTkdJTkVFUiAtIEMjLC5ORVQgLSBTSU5HQVBPUkVBTlMgT05MWSAtIDAtMiBZUlMgRVhQIiwiY29tcGFueV9uYW1lIjoiQVBCQSBURyBIdW1hbiBSZXNvdXJjZSBQdGUgTHRkIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiI1a1FtS0lWZFhxaHFxcUR0QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYmx1bSBTaW5nYXBvcmUiLCJsaW5rIjoiaHR0cHM6Ly9zZy5qb2JsdW0uY29tL2pvYi9zb2Z0d2FyZS1lbmdpbmVlci1jLW5ldC1zaW5nYXBvcmVhbnMtb25seS81OTM3OTU/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Software Developer (Mobile apps)", "company_name": "THE TALENT SHARK PTE. LTD.", "location": "Singapore", "via": "via Jobs | Fidanto", "description": "Job Description:The role of the Software Developer will be responsible for designing, developing, and implementing business solutions for the company and its clients. The role also comprises on-site/offsite low-level requirements gathering, understanding client’s needs, and working with the architects to come up with a viable solution.\n\nQualificationsBachelors or Associate degree in IT discipline. 3-5+ years in software development or equivalent.3-5+ years work experience with the following languages and tools:\nGood working experience on mobile development by using IOS(Swift), Android (Kotlin), or Xamarin.\nFamiliar with Apple and Google store App deployment\nGood understanding of development methodologies, testing practices, and tools and knowing when to apply each method to achieve the desired outcomes.\nFamiliarity with architecture styles/APIs (REST, API, MVC)\nClient/Server scripting framework (JavaScript, Angular.js, React JS, Node.js)\nExcellent troubleshooting and communication... skills\nBSc/BA in Computer Science, Engineering or a related field\nKnowledge of security standards and techniques for web applications\nUnderstand browser-specific compatibility issues\nExpertise in the design, implementation, and deployment of user-centric software, with a focus on usability\nAdded advantages\nUnderstanding and practicing Agile methodologieso Certification in mobile development or equivalent\nFamiliar with Cloud application deployment such as (azure, AWS or google cloud)\nExperience in Java-based mobile application\nExperience in Java/J2EE, .Net, and/or mobile Technologies\nGood knowledge of DevOps (Jenkins), automated testing would be beneficial.Responsibilities\nReport to Development Lead\nDevelops software solutions by studying information needs; conferring with users; studying systems flow, data usage, and work processes; investigating problem areas; following the software development lifecycle.\nDetermines operational feasibility by evaluating analysis, problem definition, requirements, solution development, and proposed solutions.\nDocuments and demonstrates solutions by developing documentation, flowcharts, layouts, diagrams, charts, code comments, and clear code.\nPrepares and installs solutions by determining and designing system specifications, standards, and programming.\nImproves operations by conducting systems analysis, recommending changes in policies and procedures.\nUpdates job knowledge by studying state-of-the-art development tools, programming techniques, and computing equipment; participating in educational opportunities; reading professional publications; maintaining personal networks; participating in professional organizations.\nProtects operations by keeping information confidential.\nProvides information by collecting, analyzing, and summarizing development and service issues.\nAccomplishes engineering and organization mission by completing related results as needed.\nSupports and develops software engineers by providing advice, coaching, and educational opportunities.\nProvide level 2 and 3 support to business users", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBEZXZlbG9wZXIgKE1vYmlsZSBhcHBzKSIsImNvbXBhbnlfbmFtZSI6IlRIRSBUQUxFTlQgU0hBUksgUFRFLiBMVEQuIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJMWWo2ZGtwUVdPMUlzRkw2QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnMgfCBGaWRhbnRvIiwibGluayI6Imh0dHBzOi8vc2cuZmlkYW50by5jb20vam9icy9qb2Itb3BlbmluZy9zb2Z0d2FyZS1kZXZlbG9wZXJzLWFwcGxpY2F0aW9ucy9zb2Z0d2FyZS1kZXZlbG9wZXItbW9iaWxlLWFwcHMtMjc3MzY0Mjk1P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Software Engineer (Java Microservices)", "company_name": "EPAM Systems", "location": "Singapore", "via": "via The Muse", "description": "EPAM is committed to providing our global team of more than 41,150 EPAMers with inspiring careers from day one. EPAMers think creatively and lead with passion and honesty. Our people are the source of our success. We value collaboration, work in partnership with our customers, and strive for the highest standards of excellence. In today's market conditions, we're supporting operations for hundreds of clients around the world remotely. No matter where you are located, you'll join a dedicated, diverse community that will help you discover your fullest potential.\n\nDESCRIPTION\nWe are looking for an experienced Software Engineer specializing in Java Microservices in Singapore to make the team stronger.\nResponsibilities\n• Write high quality, testable code following clean code and SOLID design principles\n• Conduct code reviews\n• Create design, technical and project documentation\n• Plan and schedule own work for tasks and projects, also implement functionality without direct supervision\n•... Perform profiling and troubleshooting of existing solutions\n• Coordinate application deployment\n• Follow and understand defined software development process\n• Participate in workshops and presentation of proposed solutions to clients\n• Communicate with the clients on a regular basis to clarify business requirements\n• Assist team members with providing of technical solutions\n• Work independently while in close collaboration with others in the team and across projects\nRequirements\n• Bachelor's degree or above in Computer Science, Software Engineering or related majors\n• Strong programming experience of more than 5 years and deep knowledge on data structure and algorithms\n• Typical tech stack for this role: Java 8/11, Spring Boot, JUnit/Mockito, MySQL, Kafka, Avro, git, Jenkins, PCF, DDD/BDD/TDD\n• Need to be strong in Spring Cloud\n• Strong Microservices\n• DS and Algorithms: looking for problem solving skills and the ability to optimize code\n• PCF: Manage and own the pipeline. We will consider strong Developers without PCF experience but the individual must be willing to learn PCF quickly\n• Fundamental knowledge on Docker and Kubernetes will be helpful. Know how to scale up and down etc\n• Secure coding practices\n• OS: Linux etc. Basic commands knowledge needed to browse the logs etc. to understand the issues better\nNice to have\n• Pair programming experience: Currently not completely doing Pair programming but would like to get there in near future\nWe offer\n• Friendly team and enjoyable working environment\n• Work-life balance and flexible schedule\n• Online training library, mentoring, career development and potential partial grant of certification\n• Unlimited access to LinkedIn learning solutions\n• Referral bonuses\n• Compensation for sick leave and paid time off\n• Opportunities for self-realization", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciAoSmF2YSBNaWNyb3NlcnZpY2VzKSIsImNvbXBhbnlfbmFtZSI6IkVQQU0gU3lzdGVtcyIsImNvbXBhbnlfbWlkIjoiL20vMGRsbnJjIiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoickNLSnc3b1lRZDFPdWdfUUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFVsQk5aRmQ0TkV0RVMxSlpNVFJrZGkxWmRsUTBYMjFQUzNaWE9GbEJabGhzV1ZOcE9WRjNVR2hVU25oaVFqSnFRV1EzTVd0amVVNXliRTR6WnpOdmRrbDRiRkprTFZsa1VFMWZjbHBJUzFkaGNtZEdibGxIWVU1d1lVRlpPVVphZVhwVE5URTBjR0pDY1hOcVJUUjRiVWM1VEU1aVZWOUdOazFrU0VOeGVETnpNVGMxWkZsTllVNXlTelJvU2pGdGJVcHhXWEIxVlZkSGEwVm5FaFkwV0cxRFdVdFllVUp6ZWxKMFFXSkdkRWxIVVVSQkdpSkJUMDFaVW5kQ1YzZzRXREF3YldwclZHazJabkpmUmpSQmNEVm9TbmRRWm1aMyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzU1IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFRoZSBNdXNlIiwibGluayI6Imh0dHBzOi8vd3d3LnRoZW11c2UuY29tL2pvYnMvZXBhbXN5c3RlbXMvc29mdHdhcmUtZW5naW5lZXItamF2YS1taWNyb3NlcnZpY2VzP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "ServiceNow Software Engineer", "company_name": "MORGAN MCKINLEY PTE. LTD.", "location": "Singapore", "via": "via Learn4Good", "description": "Roles &\n\nResponsibilities\n\nTHE CLIENTOur client is a top technology organization where they provide various platforms and innovation solutions through large data centers to their clientele base. They are looking for a Service\n\nNow Engineer and Portal Developer to join their team. RESPONSIBILITIES AND DUTIES:\n\nAbility to handle Global Operations Out of the Box thinker and brining best practices for process improvements Prototype and analysis of Complex Solutions. Interact with team and guide in technical analysis, designing & performance tuning Design and code reviews to ensure standards and quality level for the build Manage in-house & vendor deliverables very optimally to meet time, scope & budget commitments.\n\nWork with globally distributed teams & build excellent working relationships with other teams inside and outside of Global Software Engineering. Prepare and report project performance metrics and KPIs QUALIFICATIONS: BS Computer Science or equivalent with a minimum 5+ years or... more experience in core Service\n\nNow implementation, support ITIL v3 Foundation Certification preferred. Solid experience in Service\n\nNow Customer Service Management implementation, ITSM workflows Extensive hands-on experience of working with script-based Service\n\nNow components such as business rules, script includes, client scripts, UI pages etc . Relevant knowledge of Service\n\nNow development best practices. Relevant knowledge of Service\n\nNow platform administration. Experience in creating and customizing Service\n\nNow custom applications. Good knowledge on service portals with experience coding in Angular\n\nJS. Good architectural and hands-on Integrations experience with Enterprise suite applications.\n\nExperience with integrations to other systems using the MID server and direct/Scripted web services. Knowledge and experience with JavaScript, Power\n\nShell, JSON, REST and SOAP. Monitor health, environment upgrade/clone, usage and overall compliance of the application. Good functional knowledge on ITSM,ITOM,CSM and other Service\n\nNow functions. Good to have Service\n\nNow Trainings/Certifications, Service\n\nNow System Administration, Service\n\nNow Advanced System Administration, Scripting in Service\n\nNow, Service\n\nNow Orchestration, Application Development in Service\n\nNow, Service\n\nNow Customer Service Management If you feel you have the right skills and experience for the role, kindly submit your updated CV in word format to (Please contact us using the \"Apply for this Job Posting\" box below)\n\nReferrals are greatly appreciated.\n\nEA Licence No: 11C5502EA Registration Number: R1877789\n\nTell employers what skills you have\n\nAnalysis\n\nAngular JSAngular\n\nJSHTML/CSSInnovation\n\nJavaJavaScript\n\nJavaScript Frameworksinteract withbest practice\n\nProcess Improvementsplatform\n\nData Centre\n\nOut-of-the-box thinker", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZXJ2aWNlTm93IFNvZnR3YXJlIEVuZ2luZWVyIiwiY29tcGFueV9uYW1lIjoiTU9SR0FOIE1DS0lOTEVZIFBURS4gTFRELiIsImNvbXBhbnlfbWlkIjoiL2cvMTFmMDFiOWI2OCIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IllicTZ3NXlLVG91aXR6QmhBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVvc0NDc3dCUVU1VlgwNXhVVFpzVVc5NGJUWnRVMFJCV2pKNmVFaHRjV05IUnpWUFlscFphVGhzVTJ0a1pWZFBaMWQxVDNkbFRteFNPVjl5UjJ4cVpXVjVWbkphUW1ReFFXSkVabTlRZVRCWkxVRklaemhXZW1ZNU1XRjFjVVF6VFc0d1JUUnhOMG93UTBoRWVtWnNiQzF2WjFseU0wMDRUVmxOVDJ4d1VtNU9iWFJmV0VSYVQzaFVhVzF3WkVWMVRFa3dWMlpPUm5Sa1NEZFdhRlpsUlV0TlFWVkxiVVZXWHpoaE1sWnliV2w1UWs4MGFGOHhObUZ1WDIxaWJVUmlaRFJCT0UxbU1HNTZSelYwYlZGSmNGVm1FaFkwV0cxRFdVdFllVUp6ZWxKMFFXSkdkRWxIVVVSQkdpSkJUMDFaVW5kQk1IZGtYMDFhUkd4Wk0xQndNWEIxV0VRM1VUZFpTMXBCZGtSbiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzYyIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExlYXJuNEdvb2QiLCJsaW5rIjoiaHR0cHM6Ly93d3cubGVhcm40Z29vZC5jb20vam9icy9zaW5nYXBvcmUvaW5mb190ZWNobm9sb2d5LzI3MTI4OTU4MS9lLz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Software Engineer for UST, Singapore", "company_name": "UST", "location": "Singapore", "via": "via LinkedIn", "description": "UST is a leading provider of platforms, digital innovation, artificial Intelligence and end-to-end IT services and solutions for Global 1000 companies. We have more than 25,000 employees based in more than 20 countries.\n\nLooking for an experienced Site Reliability Engineer to be a part of world class software engineering team.\n• At least 6 years of developmental experience in ASP .NET, MVC. Hands on expertise in .NET CORE is needed\n• 2+ years of experience in Azure PAAS is a must.\n• Good Hands-on experience in SQL DB\n• Experienced in Power shell scripting\n• Experienced in CI/CD creating pipelines and automated deployments. Should be well versed with DevOps practices.\n• Microsoft certified Azure certifications (preferred).\n• Strong communication and presentation skills to provide new feature demos to project stakeholders.", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciBmb3IgVVNULCBTaW5nYXBvcmUiLCJjb21wYW55X25hbWUiOiJVU1QiLCJjb21wYW55X21pZCI6Ii9tLzA4a2I4ZyIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Im4xcDBGYzhkaWNHRlVzSUNBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVzc0JDb3dCUVU1VlgwNXhVbEJQTkZoWE0yMW1NREo2ZERWcFgzRllZVFEzU21STk5IVXlabGxyTjBaeE1tdDJhR2QzVVhGSGIydFRlRXh5ZUhCcFJUSjRObTFEWkUwelRuUk1RVVozY1hCdWFIcHpZbXd3U0RsalRUaERUMnQ2TlhaRlRXMUxNMHRGUWtWamFEQkJjSEJTVFZka1VtVkdOM00xVVdWVVZHWlpaVVJmWTNaVVJGRXdWVEp1Y1dWd2FUa1NGalJZYlVOWlMxaDVRbk42VW5SQllrWjBTVWRSUkVFYUlrRlBUVmxTZDBGMWIwMVNiR1p3TUVKdlpsWjFXVTQwVDNNMlNGaEZlV1pEUkZFIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNjkiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGlua2VkSW4iLCJsaW5rIjoiaHR0cHM6Ly9zZy5saW5rZWRpbi5jb20vam9icy92aWV3L3NvZnR3YXJlLWVuZ2luZWVyLWZvci11c3Qtc2luZ2Fwb3JlLWF0LXVzdC0yNDk0MjE4NjcwP3JlZklkPWJmOTI5NzlmLTQxZmYtNDhmYy1hMmNjLWI5OWUwNTcwNDRmYlx1MDAyNnRyYWNraW5nSWQ9QzVrS01SMHJqMkZySEJsZzBBUW9IZyUzRCUzRFx1MDAyNnBvc2l0aW9uPThcdTAwMjZwYWdlTnVtPTBcdTAwMjZ0cms9cHVibGljX2pvYnNfam9iLXJlc3VsdC1jYXJkX3Jlc3VsdC1jYXJkX2Z1bGwtY2xpY2tcdTAwMjZ1dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}], "chips": [{"type": "Title", "param": "job_family_1", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Software engineer", "value": "software engineer"}, {"text": "Programmer", "value": "programmer"}, {"text": "Programmer analyst", "value": "programmer analyst"}, {"text": "Senior", "value": "senior"}, {"text": "Cnc programmer", "value": "cnc programmer"}, {"text": "Engineer", "value": "engineer"}, {"text": "Analyst programmer", "value": "analyst programmer"}, {"text": "Science", "value": "science"}, {"text": "Software programmer", "value": "software programmer"}, {"text": "Assistant", "value": "assistant"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Electrical engineer", "value": "electrical engineer"}, {"text": "Executive", "value": "executive"}, {"text": "Java engineer", "value": "java engineer"}, {"text": "Java programmer", "value": "java programmer"}, {"text": "Lecturer", "value": "lecturer"}, {"text": "Manager", "value": "manager"}, {"text": "Operator", "value": "operator"}, {"text": "Project officer", "value": "project officer"}, {"text": "Senior programmer", "value": "senior programmer"}, {"text": "Senior system", "value": "senior system"}, {"text": "Senior technical", "value": "senior technical"}, {"text": "Sr. programmer", "value": "sr. programmer"}, {"text": "Systems programmer", "value": "systems programmer"}, {"text": "Technical", "value": "technical"}, {"text": "Trainee", "value": "trainee"}, {"text": "Trainer", "value": "trainer"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Mining", "value": "/business/naics2007/21"}, {"text": "Rental", "value": "/business/naics2007/532"}, {"text": "Wholesale", "value": "/business/naics2007/42"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "EPAM", "value": "/m/0dlnrc"}, {"text": "VISA", "value": "/m/01kqjn"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "Citi bank", "value": "/m/01dfb6"}, {"text": "TikTok", "value": "/g/11fy265933"}, {"text": "Ubisoft", "value": "/m/02qdyj"}, {"text": "Cognizant", "value": "/m/03bf9h"}, {"text": "HCL SINGAPORE PTE. LTD.", "value": "/g/11fy25ngsv"}, {"text": "Oracle", "value": "/m/05njw"}, {"text": "Credit Agricole Group", "value": "/m/028vbm"}, {"text": "Mindteck (India) Limited", "value": "/m/0cqj8w1"}, {"text": "Nanyang Technological University", "value": "/m/0l49k"}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Zühlke Group", "value": "/g/1hh_rg216"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Avensys Consulting Pte Ltd", "value": "/g/11g7022gjf"}, {"text": "Avnet", "value": "/m/0c8xmc"}, {"text": "GlobalTix Pte Ltd", "value": "/g/11dxpqdhrf"}, {"text": "GovTech", "value": "/g/11gh0528nq"}, {"text": "J.P.Morgan", "value": "/m/01hlwv"}, {"text": "Optimum Solutions (Singapore) Pte Ltd", "value": "/g/11g70hkrbx"}, {"text": "Razer Inc.", "value": "/m/075hc0"}, {"text": "Realtek Malaysia", "value": "/m/05wrm7"}, {"text": "Realtek Singapore Private Limited", "value": "/g/11g9n26trs"}, {"text": "Success Human Resource Centre Pte Ltd", "value": "/g/11g709_209"}, {"text": "TECHNOPALS PTE. LTD.", "value": "/g/11dxpvkynp"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "UST", "value": "/m/08kb8g"}, {"text": "UrbanFox", "value": "/g/11ghs7y0w6"}, {"text": "Adecco GS", "value": "/m/08gz46"}, {"text": "Alphanova Pte. Ltd.", "value": "/g/11f8h_czps"}, {"text": "BioMind", "value": "/g/11dymfr2l6"}, {"text": "Biqmind", "value": "/g/11g21fzhrb"}, {"text": "BitTitan", "value": "/g/11dxpksv89"}]}]}