{"search_metadata": {"id": "608279922236e21d9fa5e11a", "status": "Success", "json_endpoint": "https://serpapi.com/searches/03f8b82e07691db5/608279922236e21d9fa5e11a.json", "created_at": "2021-04-23 07:38:58 UTC", "processed_at": "2021-04-23 07:38:58 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28programmer%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=60", "raw_html_file": "https://serpapi.com/searches/03f8b82e07691db5/608279922236e21d9fa5e11a.html", "total_time_taken": 6.21}, "search_parameters": {"q": "(programmer) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "60"}, "jobs_results": [{"title": "Programming Operator", "company_name": "Avnet", "location": "", "via": "via Singapore - Karier.co", "description": "Job Summary:\n\nPrograms and operates manual or tape and reel equipment or operates other automated programming equipment to produce customer approved first article semiconductor devices.\n\nPrincipal Responsibilities:\n• Operates production equipment.\n• Completes and updates all programming documentation as required.\n• Performs in-process lot acceptance.\n• May assess, troubleshoot and/or resolve problems associated with running first articles.\n• May conduct and perform scheduled preventative maintenance processes and procedures, as well as perform minor trouble shooting and needed adjustments to equipment.\n• May perform quality inspections to ensure all orders meet established criteria and all product quality issues are resolved prior to shipment.\n• May analyze and utilize customer supplied information and interpret device manufacturer’s specifications on device functionality to create a functional job file for programming selected devices\n• As a lead, monitors production to ensure... machines are running at capacity to meet production goals, notifies management of any issues that may delay shipments, ensures employees are following procedures and processes and coaches employees to improve performance\n• Identifies, investigates, and participates in opportunities to improve processes and procedures, to include various key performance metrics.\n• Other duties as assigned.\n\nJob Level Specifications:\n• Acquires basic skills through work experience or formal training to perform routine tasks.\n• Tasks are routine, repetitive and manual in nature with minimal complexity or variation and specific to the job.\n• Work is performed under supervision with detailed instructions. Priorities are provided for performing work.\n• Interacts mostly with immediate peers within assigned team. Based on nature of the role, may respond to requests from others in the organization.\n• Impact of decisions is primarily contained to the work of the job.\n\nWork Experience:\n• Typically requires less than one year of related experience.\n\nEducation and Certification(s):\n• High School Diploma or equivalent\n\nDistinguishing Characteristics:\n• Skills to master:\n• Manual Programming: must be certified on two programming platforms / processes\n• Auto Programming: must be certified on one platform and know all machine functions\n• Tape & Reel: must be certified on two tape and reel platforms\n• QC: must be certified on one QC/ inspection process\n\nThe above statements are intended to describe the general nature and level of work being performed. They are not intended to be construed as an exhaustive list of all responsibilities, duties, and skills", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9ncmFtbWluZyBPcGVyYXRvciIsImNvbXBhbnlfbmFtZSI6IkF2bmV0IiwiY29tcGFueV9taWQiOiIvbS8wYzh4bWMiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJqWFItMlNRZ1VWRkJuWDNtQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFc3NCQ293QlFVNVZYMDV4VkVGVlV6UndTMnhGWmt4RlVVOWlTRlJ3WnpacGVIVnZVVjlUYjBsRFlVZ3pibW8xWW5NNFIzQTNPV3BGZDFsak9GSjJRWEZrZEcxbE1UTm1NRFUzYUhjM1drRk5hRTQ1YVVkQk1XSmliRGR3ZDJKbE5EQTJZMnR4TjBseWRGWTJkek5zUzIxdVNYWTFRVVEwVEd0eGRFdFVWRGRyWTBKdVJXOHdVVE5aY0dVNGRpMUxWa1FTRm13emJVTlpUakkwU0hOWGJuUlJZV3h1U1VkSlFuY2FJa0ZQVFZsU2QwSndNWFZuUTBSeE9FNVVPRE5wTkdsWWJteDVSRE52Y2t0ZlgzYyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzciLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gU2luZ2Fwb3JlIC0gS2FyaWVyLmNvIiwibGluayI6Imh0dHBzOi8vc2cua2FyaWVyLmNvL2FtcC95bUs/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Junior Salesforce Developer", "company_name": "Volt", "location": "Singapore", "via": "via MNC Jobs Singapore | MNC Jobs In Singapore", "description": "This is a thrilling opportunity to work as a Junior Salesforce Developer based in Singapore. You will be hands-on with project and vendor management during the implementation stage of my client’s project. Your other key task will be to spearhead data migration, testing, and commissioning of a newly designed system.\n\nYour day-to-day responsibilities will include:\n• Hands-on project and vendor management during the implementation stage of my client’s project\n• Spearheading data migration, testing, and commissioning of the new system\n• Providing L2 support after the system goes live\n• Configuring and assembling modules on Saleforce.com\n• Working with business users to develop enhancements\n\nYou will ideally have:\n• A Bachelor’s Degree in Computer Science or Management Information Systems\n• 2+ years of experience using Sales Cloud and Salesforce\n• Software engineering skills within Salesforce:\n• Apex, VisualForce, SOQL, Unit Testing\n• Java SE & EE (Java, JSF, SQL)\n• Strong project and... people management skills\n• Certification in Declarative Development for Platform App Builders in Lightning Experience (DEX402)\n• Certification in Programmatic Development using Apex and Visualforce in Lightning Experience (DEX450)\n\nPlease send your resume in WORD format by clicking the apply button below or contact David Zhang on +65 6701 1510 for a confidential discussion. Please note that only short-listed candidates will be contacted. CEI Reg. Number R1987026 (Zhang David Fu Hao", "extensions": ["20 days ago", "Full–time"], "detected_extensions": {"posted_at": "20 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJKdW5pb3IgU2FsZXNmb3JjZSBEZXZlbG9wZXIiLCJjb21wYW55X25hbWUiOiJWb2x0IiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJpaFp1dXFFM2tOSFlfN0E3QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1OQyBKb2JzIFNpbmdhcG9yZSB8IE1OQyBKb2JzIEluIFNpbmdhcG9yZSIsImxpbmsiOiJodHRwczovL3NnLm1uY2pvYnouY29tL2pvYnMvanVuaW9yLXNhbGVzZm9yY2UtZGV2ZWxvcGVyLXNpbmdhcG9yZS0xMjgzNjI/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Software Developer #SGUnitedTraineeships", "company_name": "3E Accounting Pte Ltd", "location": "Singapore (+1 other)", "via": "via 3E Accounting", "description": "Traineeship Description:\n\nTrainee will learn and develop the capability to make breakthroughs in design, development, testing, debugging and implementing software applications or specialised utility programs in support of end users’ needs on platform.\n\nJob Responsibilities:\n\n• Responsible in supporting the full software development of new and existing applications.\n\n• Explore and create new design/architectures (but not limited to) for better scaling and performance of services\n\n• Define and prototype feature specifications\n\n• Create prototype to explore feasibility of new solution\n\n• Optimise application for maximise speed and scalability.\n\n• Develop, construct, analyse and troubleshoot large-scale systems.\n\n• Maintaining the system, new feature, bug fixing, code refactoring and performance optimisation.\n\n• Possess the ability to translate ideas into functioning features\n\n• Deliver high quality application and system support\n\n• Any other ad-hoc duties as required or... assigned\n\nTechnical Skills and Competencies Trainee will learn:\n\n1. Trainee should be able to develop, integrate and maintain the software independently\n\n2. Trainee should be able to translate ideas into functioning features\n\n3. Trainee should be able to communication the features/functions of the developed/developing software to the other stakeholders confidently.\n\nTrainee should be able to support both front-end and back-end software development\n\nRequirements:\n\n• Singapore Citizen or Permanent Resident; and Graduated or graduating in calendar year 2019 or 2020 from universities, or other educational institutions (e.g. private universities and overseas institutions); or Graduated earlier from above institutions and completed National Service in 2019 or 2020", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBEZXZlbG9wZXIgI1NHVW5pdGVkVHJhaW5lZXNoaXBzIiwiY29tcGFueV9uYW1lIjoiM0UgQWNjb3VudGluZyBQdGUgTHRkIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiIxckY4UTMweTJuU01zODYzQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIDNFIEFjY291bnRpbmciLCJsaW5rIjoiaHR0cHM6Ly93d3cuM2VjcGEuY29tLnNnL2NhcmVlcnMvc29mdHdhcmUtZGV2ZWxvcGVyLXNndW5pdGVkdHJhaW5lZXNoaXBzLz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Programmer Analyst 5-IT", "company_name": "ORACLE", "location": "Singapore", "via": "via TimesJobs", "description": "The Fusion Program Director will report to Director, Fusion Migration to the Oracle Public Cloud (OPC) program, and will be responsible for driving multiple initiatives, programs, and projects at the same time to successful completion. Specific responsibilities:Manage programs and projects simultaneously to successful completion.Agile Release Train (ART) Release Train Engineer (RTE): Be a servant leader and coach for the Agile Release Train (ART)Facilitate the ART events and processesAssist the teams in delivering valueFacilitate removal of impediments to help the ART and the teams to deliver business values via committed PI objectivesEngage and communicate with OAL and business stakeholders, help manage risk, and drive relentless improvementSynchronize within the ART and across other ARTsWork closely with OAL development teams, ATG, product development, and other stakeholders to mitigate risks, resolve issues, and remove impedimentsTrack and communicate program, project, and ART... metrics and risks/issuesQualifications:Minimum of 10 years of experience in software product development or IT program and project managementMinimum of 10 years of experience as a scrum master, program or project manager, or development leadSAFe knowledge or implementation experience is a plusDemonstrated leadership and people management skillsPossess strong communication and analytical skills and a thorough understanding of product development and product managementExcellent interpersonal skills, good with people, ability to negotiateKnowledge on product management, software development, DevOps, CICD, and Agile methodologiesTools:Atlassian JIRA, Confluence or other Agile project management toolsEducation, certification, & training experience:BS degree required; MS, MIS, or MBA is a plusPMI PMP, SAFe Agilest, and Certified Scrum Master are idealDetailed Description and Job RequirementsWork with Oracle's world class technology to develop, implement, and support Oracle's global infrastructure", "extensions": ["13 days ago", "Full–time"], "detected_extensions": {"posted_at": "13 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9ncmFtbWVyIEFuYWx5c3QgNS1JVCIsImNvbXBhbnlfbmFtZSI6Ik9SQUNMRSIsImNvbXBhbnlfbWlkIjoiL20vMDVuanciLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiIwcnRicGgtbG1PeTJvTjAtQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFc3NCQ293QlFVNVZYMDV4VVRFeVRWcEZaR2N5YjNWUldtdHhlbEEyTXpKNGRtc3ljV3R2TFhobWFVVndkVXRYVHpaTVUzZEdhakZDU1ZoTFJXRmpObUp2Tmpsd04yOVhYMEl4U0hsUlJIWmFTV1puZFRCd04yTllaRGxIWVVaVlVHTkVTMnBvYVVad1IwTlJZV0pKYWpod09HTk5hRUpET0ZWM01XdENUMEpTTTBsbVNsVlhVazFqU2w5SFNpMUljSGdTRm13emJVTlpUakkwU0hOWGJuUlJZV3h1U1VkSlFuY2FJa0ZQVFZsU2QwUlNWMHB3UTNOcE5VUmFSRVUxZUU5Vk1rUmtlVEp6ZGxScUxXYyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzIyIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFRpbWVzSm9icyIsImxpbmsiOiJodHRwczovL3d3dy50aW1lc2pvYnMuY29tL2pvYi1kZXRhaWwvcHJvZ3JhbW1lci1hbmFseXN0LTUtaXQtb3JhY2xlLXNpbmdhcG9yZS0xMC10by0xMy15cnMtam9iaWQteDdfX1NMQVNIX190S3dqZ1k5SnpwU3ZmX19QTFVTX191QWdadz09P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Software Developer (Mobile apps)", "company_name": "THE TALENT SHARK PTE. LTD.", "location": "Singapore", "via": "via LinkedIn", "description": "Job Description\n\nThe role of the Software Developer will be responsible for designing, developing, and implementing business solutions for the company and its clients. The role also comprises on-site/offsite low-level requirements gathering, understanding client’s needs, and working with the architects to come up with a viable solution.\n\nQualifications\n\nBachelors or Associate degree in IT discipline. 3-5+ years in software development or equivalent.\n\n3-5+ years work experience with the following languages and tools:\n• Good working experience on mobile development by using IOS(Swift), Android (Kotlin), or Xamarin.\n• Familiar with Apple and Google store App deployment\n• Good understanding of development methodologies, testing practices, and tools and knowing when to apply each method to achieve the desired outcomes.\n• Familiarity with architecture styles/APIs (REST, API, MVC)\n• Client/Server scripting framework (JavaScript, Angular.js, React JS, Node.js)\n• Excellent troubleshooting and... communication skills\n• BSc/BA in Computer Science, Engineering or a related field\n• Knowledge of security standards and techniques for web applications\n• Understand browser-specific compatibility issues\n• Expertise in the design, implementation, and deployment of user-centric software, with a focus on usability\n• Added advantages\n• Understanding and practicing Agile methodologies\n• Certification in mobile development or equivalent\n• Familiar with Cloud application deployment such as (azure, AWS or google cloud)\n• Experience in Java-based mobile application\n• Experience in Java/J2EE, .Net, and/or mobile Technologies\n• Good knowledge of DevOps (Jenkins), automated testing would be beneficial.\n\nResponsibilities\n• Report to Development Lead\n• Develops software solutions by studying information needs; conferring with users; studying systems flow, data usage, and work processes; investigating problem areas; following the software development lifecycle.\n• Determines operational feasibility by evaluating analysis, problem definition, requirements, solution development, and proposed solutions.\n• Documents and demonstrates solutions by developing documentation, flowcharts, layouts, diagrams, charts, code comments, and clear code.\n• Prepares and installs solutions by determining and designing system specifications, standards, and programming.\n• Improves operations by conducting systems analysis, recommending changes in policies and procedures.\n• Updates job knowledge by studying state-of-the-art development tools, programming techniques, and computing equipment; participating in educational opportunities; reading professional publications; maintaining personal networks; participating in professional organizations.\n• Protects operations by keeping information confidential.\n• Provides information by collecting, analyzing, and summarizing development and service issues.\n• Accomplishes engineering and organization mission by completing related results as needed.\n• Supports and develops software engineers by providing advice, coaching, and educational opportunities.\n• Provide level 2 and 3 support to business users", "extensions": ["4 days ago", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBEZXZlbG9wZXIgKE1vYmlsZSBhcHBzKSIsImNvbXBhbnlfbmFtZSI6IlRIRSBUQUxFTlQgU0hBUksgUFRFLiBMVEQuIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJNZWlyT3NSMV9INkRuRjE1QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExpbmtlZEluIiwibGluayI6Imh0dHBzOi8vc2cubGlua2VkaW4uY29tL2pvYnMvdmlldy9zb2Z0d2FyZS1kZXZlbG9wZXItbW9iaWxlLWFwcHMtYXQtdGhlLXRhbGVudC1zaGFyay1wdGUtbHRkLTI1MTA4MjQ5MjU/cmVmSWQ9NTNkNWM2YjktOTNlNS00ZTNmLThkOWMtYmI2YWQ2ZDQxYTQ4XHUwMDI2dHJhY2tpbmdJZD1jNVNybFhSOEE2c3hGamxEMUowY2FRJTNEJTNEXHUwMDI2cG9zaXRpb249N1x1MDAyNnBhZ2VOdW09MFx1MDAyNnRyaz1wdWJsaWNfam9ic19qb2ItcmVzdWx0LWNhcmRfcmVzdWx0LWNhcmRfZnVsbC1jbGlja1x1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Senior Software Engineer (Java)", "company_name": "EPAM Systems", "location": "Singapore", "via": "via The Muse", "description": "EPAM is committed to providing our global team of more than 41,150 EPAMers with inspiring careers from day one. EPAMers think creatively and lead with passion and honesty. Our people are the source of our success. We value collaboration, work in partnership with our customers, and strive for the highest standards of excellence. In today's market conditions, we're supporting operations for hundreds of clients around the world remotely. No matter where you are located, you'll join a dedicated, diverse community that will help you discover your fullest potential.\n\nDESCRIPTION\nWe are looking for an experienced Senior Software Engineer specialized in Java for our Singapore office to make the team stronger.\nResponsibilities\n• Hands-on developer who writes high quality, secure code that is modular, functional and testable\n• Create or introduce, test, and deploy new technology to optimize the service\n• Contribute to all parts of the software's development include design, development... documentation and testing\n• Have strong ownership of your team's software and are deep in maintenance characteristics, runtime properties and dependencies including hardware, operating system, and build\n• Communicate, collaborate and work effectively in a global environment\nRequirements\n• At least 7 years of experience in the IT industry\n• Degree in Computer Science or related field\n• Experience with spring framework is mandatory\n• Strong foundation in algorithms, data structures and core computer science concepts\n• Evidence of working with object-oriented development and design patterns\n• Proficiency in Java and Kotlin, other modern programming language is a plus\n• Key technology focus areas: Java, Spring Boot, Kotlin, MariaDB, PCF, MQ\n• Strong written and verbal English communication skills\n• Strong analytical and excellent problem solving skills\n• Experience working in an Agile environment\n• Experience with XP, TDD and BDD in the software development processes\n• Proficiency with CI/CD, DevOps, modern tools such as Git and Jira\n• Experience designing scalable fault tolerant platforms that are resilient to infrastructure failures\nWe offer\n• Friendly team and enjoyable working environment\n• Work-life balance and flexible schedule\n• Online training library, mentoring, career development and potential partial grant of certification\n• Unlimited access to LinkedIn learning solutions\n• Referral bonuses\n• Compensation for sick leave and paid time off\n• Opportunities for self-realization", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgRW5naW5lZXIgKEphdmEpIiwiY29tcGFueV9uYW1lIjoiRVBBTSBTeXN0ZW1zIiwiY29tcGFueV9taWQiOiIvbS8wZGxucmMiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJxSzZNREhvaU9FdEcwbjhDQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VVZwZlN6bFNVMUZUZVd0T2FHNDJYMTlQYld3MlpYYzJZbGxDYkZoeFNrOVhXblJIV0ZsaGVTMWpjRlZPYjBobmRWRm9OMkpoUzBJeFoyMUVRazlYUzI5TFNGSm1hVE5JZEVSTU1rNTZORTVHZWpCamJ6WkljbE5qVG5aR1VEaHFXVXhoYlRoRVRUTndVMHhsZGpZeE9FNVBkMGN0WW1nMk1tSm9iblExZGpSMlZuRXdia3N0VWxjdGVFZHhRMlIzY2xSMFFrRmpPVkpNYVhoQkVoWnNNMjFEV1U0eU5FaHpWMjUwVVdGc2JrbEhTVUozR2lKQlQwMVpVbmREU0RsWlNXUlVhRXBMU0ZkamFUZFZibG93TFRCNFUyVTRVR3RCIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMzQiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gVGhlIE11c2UiLCJsaW5rIjoiaHR0cHM6Ly93d3cudGhlbXVzZS5jb20vam9icy9lcGFtc3lzdGVtcy9zZW5pb3Itc29mdHdhcmUtZW5naW5lZXItamF2YS00MzMwZmQ/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Software Engineer", "company_name": "Hatcher Plus Pte. Ltd.", "location": "Singapore", "via": "via Monster", "description": "About Hatcher+:\n\nHeadquartered in Singapore, Hatcher+ is a global data-driven early-stage venture firm and we have analyzed over 600,000 VC transactions and constructed over 4 billion virtual VC portfolios to explore the return profiles of various strategies. The insights have led us to build a data-driven approach to venture investing that delivers robust, predictable returns, global deal flows and co-investment opportunities.\n\nAbout VAAST platform:\n\nHatcher+ VAAST™, the world's most advanced Venture-as-a-Service Technology platform incorporates AI-based application analysis and deal scouting, portfolio management and reporting, and comprehensive support for the daily operations of accelerators and venture capital firms. VAAST™ has been designed from the ground up to enable quantitative analytics and big data to play a role alongside traditional, more subjective decision-making for the first time. Through its inclusion of AI/ML, deal scouting capability and predictive scoring ... technologies VAAST™ helps VCs identify potential startup opportunities based on an investor defined mandate. Using the Deal Scout feature, users can scout startups using Natural Language Processing and use the Hatcher+ Opportunity Score to determine the best fit.\n\nTechnology:\n\nHatcher+ VAAST™ platform is built using HTML, JavaScript, Vue.js, CSS, PHP (Laravel), MySQL and 3rd party API integrations etc. We are in the midst of scaling up our technical architecture and adopting Vue.js as our frontend framework. The platform is supported by data tools and a predictive AI engine for scoring deals built using python and ML libraries.\n\nHatcher+ software engineering team:\n\nAt Hatcher+, we are looking for smart, tenacious and hardworking individuals who can challenge themselves in a highly collaborative environment. We welcome frontend engineers who are passionate about their craft, interested in the Venture Capital and FinTech industries and take the initiative to develop highly reusable front-end systems for Venture as a Service web application.\n\nRequirements:\n\n· Degree in computer science, computer engineering or similar\n\n· Experience with development in HTML, CSS, JavaScript and any of the modern frontend frameworks.\n\n· Collaborate with backend engineers on creating APIs for use with the frontend.\n\n· Comfortable working with relational database (MySQL)\n\n· Familiar with using git\n\n· Able to write clean, reusable, well-documented, and easily maintainable code", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciIsImNvbXBhbnlfbmFtZSI6IkhhdGNoZXIgUGx1cyBQdGUuIEx0ZC4iLCJjb21wYW55X21pZCI6Ii9nLzExZ3htNV9iZGciLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJHUlBERzhDOGhQU3Z4M3A3QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFb3NDQ3N3QlFVNVZYMDV4VWxad1luUnZRa3BaV21rMVkzSnBOR3QwTkRoNk5HdDJUemhFY2xnelJVSXlORlpXZEU5RlRuVnFjRUk1YjNORWIzaERUR1pMU1hGUGFrWXRVRlk1Vmswell6RkVTekU1TlcxQ1pVMVZWbUZoVVd3eWNWWlpUMDFDVW1WVkxWUXRhSFp2YTNsamRrOTZZVEJPVDBSdmVESmhWa05QVFZsM1ZIZG1hSFEzVW5CWmRraEdaa3BxV0hadGJFNVpja2xYVm0wd1JrODRNamhtVkZwQmNGaElhRzF0VHpWMVRtbHdVbUpIVm05NlJsSTBObmR1VVVkblRYUjVkbEJhUTFoVFdWUktTM2xKRWhac00yMURXVTR5TkVoelYyNTBVV0ZzYmtsSFNVSjNHaUpCVDAxWlVuZERTMTlZU0dzNE5YVmxaMVJYUVd4Mk5XVlpWMjVpVlU5a1JsSm4iLCJmY3YiOiIzIiwiZmNfaWQiOiJmY180MSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNb25zdGVyIiwibGluayI6Imh0dHBzOi8vd3d3Lm1vbnN0ZXIuY29tLnNnL2FtcC9qb2ItdmFjYW5jeS1zb2Z0d2FyZS1lbmdpbmVlci1oYXRjaGVyLXBsdXMtcHRlLWx0ZC1zaW5nYXBvcmUtMjc4MDI1NTEuaHRtbD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Microsoft Engineer​/Share Point", "company_name": "D2X EXPERTISE PTE. LTD.", "location": "Singapore", "via": "via Learn4Good", "description": "Position: Microsoft Engineer (Share Point)\nRoles &\n\nResponsibilities\n\nThe Engineer will join the Infrastructure Production Services Department. He will cover the Following services :\n\nEngineer Mail services (lotus, Microsoft Exchange, outlook), Mobile device Management, DLP and other Microsoft environment (SharePoint,Skype,...)\n\nAs part of his job , he will :\n\n- Be responsible for the implementation and management of system and services in supporting client's messaging platform consisting of Lotus Notes, Lotus Domino, and SMTP.\n\n- Take in charge the Outlook migration,\n\n- Be responsible for architectural development, planning, and implementation of the overall strategic goals of systems.\n\n- Identify, evaluate, implement, and support related technologies such as but not limited to messaging web access, instant messaging, and collaboration and unified messaging.\n\n- Provide support in the areas of Lotus software products standardization, leveraging of mailboxes management and capacity... planning. This includes but is not limited to Lotus Notes/Domino, Sametime, and Quick\n\nPlace.\n\n- Respond to requests from users (as Level 2 and 3 of the escalation procedures) and assist in deploying/configuring systems so as to conform to our infrastructure standards.\n\n- Provide resolution of more complex issues escalated from the support helpdesk and provide extra frontline support capacity as directed. Candidate criteria : - Minimal education level Bachelor Degree / BSc Degree or equivalent\n\nAcademic qualification / Speciality - Microsoft certified and migration experience 5+ years' experience in Microsoft administration\n\n- Level of minimal experience 6-10 years Experience - Minimum 5 years Microsoft Exchange/outlook experience. MCSE certification is a plus.\n\n- Minimum 5 years' experience in DLP. Required skills Hard skills\n\n- Good understanding of DNS, E-Mail Routing, Email Tracking, SMTP / application Mail Relay,Backup and Restore, Disaster Recovery concepts - Single item, single mailbox, Exchange Server, Exchange Site\n\n- In-depth knowledge of various features and configurations available in Exchange 2016, Roles and Services of Exchange 2010, High availability (DAG), Public Folder Management, Messaging Policies and Compliance, Configuring Reporting and Logging, Permissions and Role Based Access Control (RBAC), Transport Rules\n\n- Good understanding and work experience of Anti-Spam and Anti-virus applications and products like various email gateways, IronPort, proof point, Exchange online protection Soft Skills\n\nAbility to understand Enterprise Architecture concept\n\n- Knowledge of ITIL framework\n\n- Excellent analytical problem solving\n\n- Proactive with strong teamwork and interpersonal skills\n\n- Excellent communication skills\n\n- Autonomy, curiosity and fast adaptation to changes\n\n- Innovative and creative thinker\n\nTechnical skills required - Mobile Device Management solutions (AirWatch.)- MS Active Directory / Domain\n\n- Knowledge of Exchange Shell, VBS and windows Power\n\nShell scripting\n\n- Knowledge on Active Directory Object Administration and Management\n\nLanguages Français and Anglais\n\nTell employers what skills you have\n\nBanking\n\nEngineering\n\nManagement\n\nMicrosoft\n\nMicrosoft Outlook\n\nMobile\n\nPrivate Banking\n\nProduction\n\nMS-Exchange\n\nLotus Software\n\nMail Services", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJNaWNyb3NvZnQgRW5naW5lZXLigIsvU2hhcmUgUG9pbnQiLCJjb21wYW55X25hbWUiOiJEMlggRVhQRVJUSVNFIFBURS4gTFRELiIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiTXFmUzc5X3k0VTc0S01aMkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMZWFybjRHb29kIiwibGluayI6Imh0dHBzOi8vd3d3LmxlYXJuNGdvb2QuY29tL2pvYnMvc2luZ2Fwb3JlL2luZm9fdGVjaG5vbG9neS8yNzEyNzk2NzAvZS8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "C# Developer", "company_name": "AccionLabs", "location": "Singapore", "via": "via SmartRecruiters Jobs", "description": "Company Description\n\nAccion Labs is a global technology services firm with offering a full range of product life-cycle services in the emerging technology segment. This includes Web 2.0, Open Source, SaaS/Cloud, Mobility, IT Operations Management/ITSM, Big Data and traditional BI/DW.\n\nThrough nine global offices and a rapid-response delivery model, Accion offers a range of engagement models such as turn-key projects, extended-teams, shared-IP development, offshore-leveraged engagements and professional staffing (contract, contract-to-hire & direct perm).\n\nRole: - Project Manager\n\nRequired\n\n· Have managed large transformational Mainframe platform migration / re-hosting projects\n\n· Understanding of Mainframe application related to infra needs\n\n· Knowledge and understanding of UX / Linux\n\n· Should have hands-on experience in projects\n\n· Strong project management skills. PMP certification is an added advantage\n\n· Have run a large complex project of at least 5m++\n\n· Ability in managing and... handling 3P vendors providing application porting services and workload solutions services.\n\n· Experience in contract administrations\n\n· Ability in managing cross-country / regional / virtualization resources in projects\n\n· Managing at CxO level customer\n\nJob Description\n\nRole: - C# Developer\nJob Description\n\n· 2-6 Years of experience in C# design and development\n\n· Should have experience on Data GridView control\n\n· Should have experience on Gridview - Devexpress\n\n· Should have hands on experience for Oracle/PLSQL/SQL\n\n· Good experience on Winforms.\n\n· Good Analytical and communication skill.\n\n· Exposure to Finance domain will be advantage.\n\nAdditional Information\n\nAll your information will be kept confidential according to EEO guidelines", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDIyBEZXZlbG9wZXIiLCJjb21wYW55X25hbWUiOiJBY2Npb25MYWJzIiwiY29tcGFueV9taWQiOiIvZy8xMWR4cHFtMTZ2IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoick8zMVVTdFFGVzE5ZS1wdkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFZFbFliMGxMT0RWSmNYZENNV2hpWjBSV1prcHNkR2szTldRelVWaHpaak5IYUZaRmJHSkhVR1ZxUTBsYVdXWjRjbTVhTjJSNVFXaDZRbXc1T0ZOblVXMDRUMXBmVVhFNFdUTnBabXBoYW1sclgwOWxWVVp3V0RoTU1uY3pYMkZFTWw5MVF6UjFkRzU1UzBsQlgzSXhUelkzUWtKbWQycERSak5oWjJSRk4yeDRjMk14UVhwSE1FaGFaR2w1WVU1bVdEUkdjWFJrUTAxSGFHdDNFaFpzTTIxRFdVNHlORWh6VjI1MFVXRnNia2xIU1VKM0dpSkJUMDFaVW5kQlRWSlFSRzVMUlY4d1JESkxOSEZ5VkhaV05HeHBYemRNWlY5MyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzUxIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFNtYXJ0UmVjcnVpdGVycyBKb2JzIiwibGluayI6Imh0dHBzOi8vam9icy5zbWFydHJlY3J1aXRlcnMuY29tL0FjY2lvbkxhYnMyLzEwOTE1OTIxNS1jLWRldmVsb3Blcj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior Software Engineer - Traffic", "company_name": "Twitter", "location": "Singapore (+1 other)", "via": "via Bayt.com", "description": "The Position\n\nThe Traffic team provides infrastructure to enable fast and reliable access to Twitter for anyone, anywhere, on any network. Our mission of shaping the next generation of Twitter traffic control directly impacts the lives of our users, their trust in our platform, and the success of our business. Through software and protocols, traffic steering, global load balancing, and regional content caching and distribution, we remove the barriers that prevent people from participating in the public conversation.\n\nAs a Senior Software Engineer, you will collaborate with highly motivated and wonderful software engineers, data scientists, network architects, and client engineers. You will lead and support innovative solutions to sophisticated and modern engineering challenges, to enhance Twitter’s Edge initiatives. As part of the team, you will learn, teach, grow, and help bring Twitter closer to our users. You will make critical decisions, write designs and code that drives user... growth and satisfaction through reliability and performance improvements.\n\nWhat You’ll Do:\n• Contribute to the team’s vision and articulate strategies to have fundamental impact at our massive scale;\n• Ideate and drive innovative projects that will improve user experience;\n• Provide strong leadership within your very own problem space, through data-driven decisions, robust software designs, and effective delegation;\n• Actively engage with cross-functional teams such as network specialists, data scientists, or client engineers to identify and iterate on game-changing opportunities;\n• Build and maintain high-performance, fault-tolerant and scalable distributed systems;\n• Establish and uphold best engineering practices through thorough code and design reviews and improved processes and tools;\n• Groom junior engineers through mentoring and delegation;\n• Diagnose and solve complex problems in distributed systems, and develop solutions that have a significant impact at Twitter’s massive scale;\n• Drive a culture of trust, respect and inclusion within your team.\n\nWho You Are:\n• You are excited about building massively scalable solutions and top tier services for worldwide impact;\n• You want to iterate quickly and safely on high scale systems;\n• You love to collaborate, mentor, and learn with a great team;\n• Passionate about finding elegant solutions to complex technical problems;\n• Want to challenge yourself, and to work with the best engineers in the industry;\n• You are always looking for opportunities to grow and learn;\n• You enjoy working both collaboratively and independently.\n\nQualifications\n• At least 4 years of software development experience, preferably with backend infrastructure, distributed systems and/or performance analysis;\n• Proven experience with software engineering standard methodologies for iterative development, testing, code reuse, etc…;\n• Strong bias to action, creative problem solving attitude, and proactive communication;\n• Strong design and architecture skills;\n• Excellent written and verbal communication skills;\n• Experience in iOS or Web development is a plus.\n\nCompany Description\n\nTwitter serves the public conversation because conversation is a force for good in the world. The opportunity to help the world connect, debate, learn, and solve problems is what draws us to careers at Twitter, and it’s what keeps us here", "extensions": ["7 days ago", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgRW5naW5lZXIgLSBUcmFmZmljIiwiY29tcGFueV9uYW1lIjoiVHdpdHRlciIsImNvbXBhbnlfbWlkIjoiL20vMGhuMXZjZyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Ikp5Q0J2Wm9zLW9RblBIQ0tBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhVMFZ2UmxsdFNXRm5ObWRLVUhSM1JYbElZM013V25kdlUyRnZSRGRDTjNGRmVVVTFlSGRxUjBwWlQxOVllbEE1VFRCUWJXeHZhVmxRTWpWTVpXZFNSMHc0TldwYVZtOXNUMk41U0VVM2RWWmtRV2h1VTFBeGNVNU1NV3hOWjBodlRGbzJZa0l4ZUhsT1JuUkhMVzVqYlUxTlpISm5NVTUxTW1OdFFVUnRNRkZOVURSVWVIZGhTa3hxVGtGMlVIaDBNWGRsUTJOc1RWZG9XR1YzRWhac00yMURXVTR5TkVoelYyNTBVV0ZzYmtsSFNVSjNHaUpCVDAxWlVuZEVkbU5YUm5ocmFtczRWMU13UldsR1RIUlRaekZRVUMxNk5ESkIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY181OCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCYXl0LmNvbSIsImxpbmsiOiJodHRwczovL3d3dy5iYXl0LmNvbS9lbi9zaW5nYXBvcmUvam9icy9zZW5pb3Itc29mdHdhcmUtZW5naW5lZXItdHJhZmZpYy01OTUxMjQ5Mi8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}], "chips": [{"type": "Title", "param": "job_family_1", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Software engineer", "value": "software engineer"}, {"text": "Programmer", "value": "programmer"}, {"text": "Programmer analyst", "value": "programmer analyst"}, {"text": "Senior", "value": "senior"}, {"text": "Cnc programmer", "value": "cnc programmer"}, {"text": "Engineer", "value": "engineer"}, {"text": "Analyst programmer", "value": "analyst programmer"}, {"text": "Science", "value": "science"}, {"text": "Software programmer", "value": "software programmer"}, {"text": "Assistant", "value": "assistant"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Electrical engineer", "value": "electrical engineer"}, {"text": "Executive", "value": "executive"}, {"text": "Java engineer", "value": "java engineer"}, {"text": "Java programmer", "value": "java programmer"}, {"text": "Lecturer", "value": "lecturer"}, {"text": "Manager", "value": "manager"}, {"text": "Operator", "value": "operator"}, {"text": "Project officer", "value": "project officer"}, {"text": "Senior programmer", "value": "senior programmer"}, {"text": "Senior system", "value": "senior system"}, {"text": "Senior technical", "value": "senior technical"}, {"text": "Sr. programmer", "value": "sr. programmer"}, {"text": "Systems programmer", "value": "systems programmer"}, {"text": "Technical", "value": "technical"}, {"text": "Trainee", "value": "trainee"}, {"text": "Trainer", "value": "trainer"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Mining", "value": "/business/naics2007/21"}, {"text": "Rental", "value": "/business/naics2007/532"}, {"text": "Wholesale", "value": "/business/naics2007/42"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "EPAM", "value": "/m/0dlnrc"}, {"text": "VISA", "value": "/m/01kqjn"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "Citi bank", "value": "/m/01dfb6"}, {"text": "TikTok", "value": "/g/11fy265933"}, {"text": "Ubisoft", "value": "/m/02qdyj"}, {"text": "Cognizant", "value": "/m/03bf9h"}, {"text": "HCL SINGAPORE PTE. LTD.", "value": "/g/11fy25ngsv"}, {"text": "Oracle", "value": "/m/05njw"}, {"text": "Credit Agricole Group", "value": "/m/028vbm"}, {"text": "Mindteck (India) Limited", "value": "/m/0cqj8w1"}, {"text": "Nanyang Technological University", "value": "/m/0l49k"}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Zühlke Group", "value": "/g/1hh_rg216"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Avensys Consulting Pte Ltd", "value": "/g/11g7022gjf"}, {"text": "Avnet", "value": "/m/0c8xmc"}, {"text": "GlobalTix Pte Ltd", "value": "/g/11dxpqdhrf"}, {"text": "GovTech", "value": "/g/11gh0528nq"}, {"text": "J.P.Morgan", "value": "/m/01hlwv"}, {"text": "Optimum Solutions (Singapore) Pte Ltd", "value": "/g/11g70hkrbx"}, {"text": "Razer Inc.", "value": "/m/075hc0"}, {"text": "Realtek Malaysia", "value": "/m/05wrm7"}, {"text": "Realtek Singapore Private Limited", "value": "/g/11g9n26trs"}, {"text": "Success Human Resource Centre Pte Ltd", "value": "/g/11g709_209"}, {"text": "TECHNOPALS PTE. LTD.", "value": "/g/11dxpvkynp"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "UST", "value": "/m/08kb8g"}, {"text": "UrbanFox", "value": "/g/11ghs7y0w6"}, {"text": "Adecco GS", "value": "/m/08gz46"}, {"text": "Alphanova Pte. Ltd.", "value": "/g/11f8h_czps"}, {"text": "BioMind", "value": "/g/11dymfr2l6"}, {"text": "Biqmind", "value": "/g/11g21fzhrb"}, {"text": "BitTitan", "value": "/g/11dxpksv89"}]}]}