{"search_metadata": {"id": "60827b2b1988e50de7a120e6", "status": "Success", "json_endpoint": "https://serpapi.com/searches/e40107d28c06c538/60827b2b1988e50de7a120e6.json", "created_at": "2021-04-23 07:45:47 UTC", "processed_at": "2021-04-23 07:45:47 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28IT+analyst%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=180", "raw_html_file": "https://serpapi.com/searches/e40107d28c06c538/60827b2b1988e50de7a120e6.html", "total_time_taken": 0.93}, "search_parameters": {"q": "(IT analyst) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "180"}, "jobs_results": [{"title": "#NEXTDIGITAL2020 - Consultant / Senior Consultant, Business Intelligence (Data Visualisation)", "company_name": "Singtel Group", "location": "Singapore", "via": "via Singtel Careers", "description": "About NCS\n\nNCS is a leading information and communications technology (ICT) and communications engineering services provider across the Asia-Pacific region. We are headquartered in Singapore and a wholly owned subsidiary of the Singtel Group. We have in-depth domain knowledge and unique capabilities that create business value for customers. We offer a broad range of services, including consulting, systems development and integration, business process outsourcing, infrastructure management and solutions, and technology solutions.\n\nWhat is the opportunity?\n\nNCS is looking for a data visionary to help businesses identify key performance metrics and dimensions for data analysis. You will create crystal clear, compelling visualisations of data in clients’ business intelligence or data visualisation tools – using dashboards and reports to tease out and share insights from data.\n\nTo do this, you need to have top-notch communications skills – with clients you will interact closely with, and... teams you need to collaborate with – to supply your data canvas with the information they need to convey just the right amount of information, to the right audience, and help them make better data-driven decisions.\n\nWhat will you do?\n• Dive into company data to identify sources and features that will drive business objectives.\n• Build powerful, stand-out dashboards and automate reports for core business metrics and performance trends.\n• Grasp users’ needs and challenges, and translate them into business and technology solutions\n• Tap on your inner artist – use creative data visualisation techniques and tools to give users the best experience possible\n• Prototype new ideas as part of a digital product team – from research to release\n• Migrate and operationalise home-grown reports to enterprise grade business workflows powered by data insights - work with data engineering team throughout the data lifecycle from source to analysis to modelling.\n• Work closely with project manager and technical leads to provide regular status reporting and support them to refine issues/problem statements and propose/evaluate relevant analytics solutions\n• Bring your experience and ideas to effective and innovative engineering, design and strategy\n• Work in interdisciplinary teams that combine technical, business and data science competencies that deliver work in waterfall or agile software development lifecycle methodologies\n• The range of accountability, responsibility and autonomy will depend on your experience and seniority, including:\n• Contributing to our internal networks and special interest groups\n• Mentoring to upskill peers and juniors\n\nThe ideal candidate should be / possess:\n• Possess good communications skills to understand our customers' core business objectives and build end-to-end data centric solutions to address them\n• Good critical thinking and problem-solving abilities\n• Prior experience building compelling and usable data visualizations and analytics with commercial and/or open source BI tools\n• Certification or hands-on experience in leading data analytics and visualisation products such as Tableau, Qlik, PowerBI, MicroStrategy, SAS Visual Analytics\n• Excel in Excel!\n• SQL proficiency necessary to build and maintain complex queries and data pipelines\n• Undergraduate or graduate degree in Computer science or equivalent\n\nNice to have:\n• Experience with integrating dashboards and reports into applications and web forms\n• Data pipeline and/or database development experience\n• Prototyping and development skills in web front-end technologies such as JavaScript frameworks (Angular, React) especially on charting libraries (Highcharts, D3, Chart.js)\n\nIf you would like to be part of the winning team that does great work, apply today!\n\n#NCSlife\n\nTo All Agencies:\n\nAgencies must have a valid fee agreement in place and they must have been assigned the specific requisition to which they submit resumes, by the Talent Acquisition team. Any resume submitted outside of this process will be deemed the sole property of Singtel Group and in the event a candidate is submitted outside of this policy is hired, no fee or payment of any kind will be paid", "extensions": ["5 days ago", "Full–time"], "detected_extensions": {"posted_at": "5 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiIjTkVYVERJR0lUQUwyMDIwIC0gQ29uc3VsdGFudCAvIFNlbmlvciBDb25zdWx0YW50LCBCdXNpbmVzcyBJbnRlbGxpZ2VuY2UgKERhdGEgVmlzdWFsaXNhdGlvbikiLCJjb21wYW55X25hbWUiOiJTaW5ndGVsIEdyb3VwIiwiY29tcGFueV9taWQiOiIvbS8wMjB6ZmwiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJ2cFUzbm9HTzlkRFRWSEMyQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VW5KSFRVMVJXR05JWDA0M1VYSldiRzl2YVZSaFgyTndWSHBGVFdWWVVXcENURkp4UkRGMU9FdEJhRkF3TWpCQ1VXbG1kWFpJUjJ4MGMzVlNMVkp3YVVKbk9ESlBkWGhaUTNwV1REVm5hVXRpVG5VdFFXRnFjWEF6UlhodVpqQlZMVlV6ZEUwdGRFWkVkVEJWZWxGVWNGZGpOa1J0V21aU1J6SlpTRlZ6VFRkT2FVVm5RVlJWVG5SSVF6ZFFOV2hOWVZOSmFXSnNSMjR3ZGpoQkVoWkxNM1ZEV1V4cGRrWnphbEYwVVdKcmR6WXlXVU5CR2lKQlQwMVpVbmRDWjFKT2NFODVNbkE0ZFZCVE5sOWtWMnQ1ZWt0Q1RqTXdaa0pCIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBTaW5ndGVsIENhcmVlcnMiLCJsaW5rIjoiaHR0cHM6Ly9ncm91cGNhcmVlcnMuc2luZ3RlbC5jb20vam9iL1B5dGhvbi1XZWItRGV2ZWxvcGVyLzU3NTc4MDUxMC8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": ".NET IT Analyst, Senior, Lead", "company_name": "Ethos Search Associates Pte Ltd", "location": "Singapore", "via": "via Jobs", "description": "These will be continuously renewable contract positions. There are multiple positions ranging from IT Analyst, Senior IT Analyst, and Technical Lead depending on skills. Please indicate which position you are interested in when applying. Thank you. Job Scope: ensure all the applications systems remain in good working order. support new application systems when they become operational. respond to production emergencies in a timely manner. This includes bringing up the server (in a crash) or system processes, fixing problems or finding workarounds. diligently perform routine checks and to escalate any anomaly detected, to alert and conduct troubleshooting together with other system engineers, database administrator (DBA) and outsourced vendors. meet the Service Level Agreement (SLA) timelines. follow through every issue / problem till closure; and complete the necessary documentation. assist users and answer queries regarding the supported operationalsystems. interact with the helpdesk... agents, end-users and external vendors during application support and problem resolution. standby support on weekends / public holidays. In the event of scheduled downtime or during a crash, required to be in office during off-office-hours to support the systems. make some code changes/enhancements that arise from service requests. tracking and management of the project timelines and resources that he/she has been assigned to undertake. understudy and undertake the development of new applications and maintenance of any existing systems work independently with minimum supervision, also work effectively as a team member among the system support and application development teams. Core Requirements: Bachelor Degree in Information Technology (IT), Computer Engineering, Computer Science or equivalent. 2 (5 for Senior, 8 for Lead) years of work experience in IT development with full SDLC exposure. Additional skill Requirements: IT Analyst 1 system analysis and design; designing, developing and maintaining web applications. IT Operational Support, Service Desks/Help Desk, service level agreement. Microsoft .Net framework (ASP.NET), .NET Core framework, MVC and be proficient in C#.NET. JavaScript, AJAX, JQuery, JSON and XML. Microsoft SQL Server, relational database schema design, SQL queries/stored procedures. SOAP and/or REST based web services and APIs. analytical tools, preferably Splunk. supporting mobile applications. using marketing communications products to send Electronic Direct Mailers (EDM). AWS services including AWS S3, AWS Kinesis Firehose and AWS Athena. AWS Pinpoint. 2 years of work experience in Singapore IT Analyst 2 system analysis and design; designing, developing and maintaining web applications. analysis, design and integration for integrated systems, including developing file interfaces. development and maintenance support on: a) ASP .NET, C# .NET, JavaScript, AJAX, HTML 5, CSS, JQuery, JSON, XML, BOOTSTRAP b) Web Services development and integration using SOAP and/or REST based web services c) Framework including .Net Core and MVC (preferably with .Net Framework 4.7.2 and above) Microsoft SQL Server; SQL queries/stored procedures. database design and encryption methodologies. designing and development of Proof-Of-Concept. logging framework, such as Serilog. RabbitMQ and Redis message-broker implementations. Microsoft certifications MCTS and/or MCPD in C# .NET. analytical tools, preferably Splunk. cloud-based (AWS/Azure/GCP) implementations. batch scripting (.bat and .vbs). 1 year of work experience in Singapore. Senior IT Analyst 1 certified in Amazon Web Services like AWS Certified Cloud Practitioner or better. certified in Microsoft Azure platform. Google Cloud services. container technology like Docker, Docker Swarm or Kubernetes. C# (NET) or other C-based programming language (e.g. PHP, PERL, C++) front-end technologies like HTML5, jQuery, JavaScript and CSS. front-end framework like Angular, AngularJS, REACT, or equivalent. NodeJS or Python. SQL technology like MSSQL, MySQL, PostgreSQL, MariaDB, or equivalent; SQL queries or stored procedures. NoSQL like MongoDB, CouchDB, or equivalent. Service Oriented Architecture (SOA); integrating application using SOAP or REST. mobile app development, e.g. Android Development Platform or iOS Development Platform. chatbot technology like Dialogflow, Google Action, LUIS. WIT.AI, AWS Lex, or equivalent. continuous integration and continuous delivery. agile projects using SCRUM or equivalent. Data Analytics tools like QlikSense, Google Data Studio, Amazon QuickSight, or Microsoft PowerBI. working experience in government agency environment; exposure to IM8, WOGAA, Digital Standards. 1 year of work experience in Singapore. Senior IT Analyst 2 certified in Amazon Web Services like AWS Certified Cloud Practitioner or better. certified in Microsoft Azure platform. Google Cloud services. container technology like Docker, Docker Swarm or Kubernetes. C# (NET) or other C-based programming language (e.g. PHP, PERL, C++) front-end technologies like HTML5, jQuery, JavaScript and CSS. front-end framework like Angular, AngularJS, REACT, or equivalent. NodeJS or Python. SQL technology like MSSQL, MySQL, PostgreSQL, MariaDB, or equivalent; SQL queries or stored procedures. NoSQL like MongoDB, CouchDB, or equivalent. Service Oriented Architecture (SOA); integrating application using SOAP or REST. mobile app development, e.g. Android Development Platform or iOS Development Platform. chatbot technology like Dialogflow, Google Action, LUIS. WIT.AI, AWS Lex, or equivalent. continuous integration and continuous delivery. agile projects using SCRUM or equivalent. Content Search technology like Alfresco Content Management System, EBSCOHOST Discovery Services, Google Enterprise Search, or equivalent. working experience in government agency environment; exposure to IM8, WOGAA, Digital Standards. 1 year of work experience in Singapore. Senior IT Analyst 3 & 4 Microsoft .NET and front-end technologies (i.e. ASP.NET, C#, HTML/DHTML, CSS, JavaScript, JQuery and AJAX). Service Oriented Architecture (SOA), development and integration using SOAP and/or REST based web services. Microsoft SQL Server; relational database schema design; SQL queries/stored procedures on Microsoft SQL Server. implementing web application that is able to handle both Unicode (e.g. English) and non-Unicode (e.g. Myanmar script) based languages. harvesting and parsing web pages for targeted information. implementing web application using Responsive Web Design. development interacting with Alfresco Content Management System using Lucene queries. application running on Linux, Apache, MySQL,PHP (LAMP) or Java. analytical tools, preferably Splunk. code scanning tools, preferably Fortify. streaming technology (e.g. media streaming) batch scripting (.bat and .vbs). Requirements and impact analysis IT operational support Project management support 5 years of work experience in Singapore Technical Lead 1 application systems with large volumes of transactions (100,000) per day. configuration management, and thus be able to track specifications; control and streamline changes; maintain and improve system performance by using suitable tools and methodologies; and manage project documentations. planning, executing and leading testing team for integrated systems. inventory management; liaise with system/network teams and/or vendors for infrastructure maintenance. ITIL V3 Foundations certification. ASP .NET, C# .NET, JavaScript, AJAX, HTML 5, CSS, JQuery, JSON, XML, BOOTSTRAP Web Services development and integration using SOAP and REST based web services file interfaces and batch jobs, downstream impact and data flow with other systems. Library metadata standards such as MARC and/or MARC21 format. test strategy for web-based and mobile applications. 3 years of work experience in Singapore Technical Lead 2 designing, developing and maintaining web applications using Microsoft .NET and front-end technologies, specifically ASP.NET, C#, HTML/DHTML, CSS, JavaScript, JQuery and AJAX, Service Oriented Architecture (SOA), developing applications and integration using web services in C# .NET with SOAP, REST, WSDL, XML and JSON based web services. designing, developing and maintaining web widgets/components using AngularJS, HTML5, CSS4 and WebComponent. designing, developing and maintaining website that support Responsive Web Design (RWD) using front-end open-source framework such as Twitter Bootstrap and UX web technologies such as CSS3, Media Queries and AngularJS. development and system support on SOLR search engine. Digital Library Standard using METS/ALTO formats. data analytics, with experience using automated tools in the area of personalization and recommendation. Schema.org implementation. social media development. lead and guiding team members/peers/developers. cloud-based (e.g. AWS/Azure/GCP) implementations. Linux/Apache/MySQL/Php/Perl (LAMP). Requirements and impact analysis IT operational support Project management support 5 years of work experience in Singapore Multiple .NET Developer contract positions Skills: .NET, Asp.net, C#, Dotnet, Soap, Rest, Mysql, Json, Jquery, Ajax, Mvc, Edms, Aws, Web Service, Amazon Web Service, Azure, Bootstrap, Html, Css, Batch Scripting, Mcts, Splunk, Php Mysql, Pearl, React Native, Angular Js, Mariadb, Docker, Javascript, Scrum, Agile, Android, Iphone, Ios Experience: 2.00-12.00 Years Education: Bachelors/ Degree", "extensions": ["22 days ago", "Contractor"], "detected_extensions": {"posted_at": "22 days ago", "schedule_type": "Contractor"}, "job_id": "eyJqb2JfdGl0bGUiOiIuTkVUIElUIEFuYWx5c3QsIFNlbmlvciwgTGVhZCIsImNvbXBhbnlfbmFtZSI6IkV0aG9zIFNlYXJjaCBBc3NvY2lhdGVzIFB0ZSBMdGQiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IllSNnN2QmJiUDgwRG45ODVBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9icyIsImxpbmsiOiJodHRwczovL3NnLmZpZGFudG8uY29tL2pvYnMvam9iLW9wZW5pbmcvaW5mb3JtYXRpb24tdGVjaG5vbG9neS1wcm9qZWN0LW1hbmFnZXJzL25ldC1pdC1hbmFseXN0LXNlbmlvci1sZWFkLTI2NTA0NDczMT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "IT Risk and Security Analyst", "company_name": "Sciente Inc", "location": "Singapore", "via": "via SCIENTE", "description": "Great opportunity to work in an established financial services organization and be responsible for IT Risk and Security Analysis for the organization.\n\nMandatory Skill(s)\n• Diploma / Bachelor's Degree in Computer Science;\n• Minimum 3 years of relevant working experience in IT risk governance, cybersecurity and ID management;\n• Experience in penetration testing and security review;\n• Experience in ID review on AIX, LINUX, WINTEL, MARIADB, ORACLE, SOLARIS platforms;\n• Ability to work in a fast-paced environment and meet deadlines;\n• Good written and verbal communication skills;\n• Analytical and meticulous;\n• Team player and committed.\n\nDesirable Skill(s)\n• Certified Information Systems Security Professional (CISSP).\n\nResponsibilities\n• Ensure all compliance and security control functions are performed timely and orderly;\n• Track, monitor and valid security-related and risk issues, provide an action plan to rectify the issues and prevent recurrence;\n• Create awareness on risk and control... and ensure trainings are conducted with training plans in place;\n• Collate requests from auditors and keep track of all outstanding issues;\n• Perform security testing such as penetration tests;\n• Analyse the results from pentest, network and vulnerability scans and propose recommendation to improve controls;\n• Follow through all cybersecurity-related issues until closure;\n• Manage ID access and perform ID reviews;\n• In charge of application reviews and monitor database logs/alerts", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJJVCBSaXNrIGFuZCBTZWN1cml0eSBBbmFseXN0IiwiY29tcGFueV9uYW1lIjoiU2NpZW50ZSBJbmMiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IkxoQnl1QmU3Q3EydlFvekpBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gU0NJRU5URSIsImxpbmsiOiJodHRwczovL3d3dy5zY2llbnRlLmNvbS9zY2llbnRlLWluYy90ZWNobm9sb2d5LWpvYnMvNjA1My9pdC1yaXNrLWFuZC1zZWN1cml0eS1hbmFseXN0Lz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "System Analyst (IBM Solutions)", "company_name": "I Plus Q", "location": "Singapore (+1 other)", "via": "via Glassdoor", "description": "Reference Number: LND-200505-388\n\nOur client with a total staff strength of over 350 in Singapore and China, is one of the leading and fastest growing business advisory groups in Singapore. Their IT arm providing integrated IT solutions for Systems Consulting & Development and IBM Solutions is hiring a System Analyst.\n\nJobs Responsibilities\n• Perform presales activities with Business Development Manager\n• Scope users’ requirements and propose customization needs to the client\n• Prepare customization proposal\n• Develop & conduct systems’ testing on programs developed\n• Document functional specs and users’ documentation\n• Conduct end-users’ training on the developed programs\n\nJobs Requirements\n• Minimum 3-4 years programming experience in IBM Solutions such as Lotus Notes, DB2, Tivoli\n• Certified in Lotus Notes programming (preferred)\n• Exposure to administrative workflow (HR, leave applications, assets tracking\n• Ability to prepare functional & users’ documentation", "extensions": ["16 days ago", "Full–time"], "detected_extensions": {"posted_at": "16 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTeXN0ZW0gQW5hbHlzdCAoSUJNIFNvbHV0aW9ucykiLCJjb21wYW55X25hbWUiOiJJIFBsdXMgUSIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiRjU3Q195QWdnUHdzNkUyTUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBHbGFzc2Rvb3IiLCJsaW5rIjoiaHR0cHM6Ly93d3cuZ2xhc3Nkb29yLnNnL2pvYi1saXN0aW5nL3N5c3RlbS1hbmFseXN0LWlibS1zb2x1dGlvbnMtaS1wbHVzLXEtSlZfSUMzMjM1OTIxX0tPMCwyOF9LRTI5LDM3Lmh0bT9qbD0zNjU3Mjk2NzAxXHUwMDI2dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Data Analyst (BB-714B5)", "company_name": "Sciente International", "location": "Singapore (+1 other)", "via": "via BeBee", "description": "8 April 2021 We are in search for a Data Analyst who can leverage his/her analytics skills to support automation and data analytics projects. Mandatory Skill(s) Degree holder majoring in Finance, Analytics, Computer Science or equivalent; Experience and hands on skills in Python, SQL, Tableau; Proficient in data analysis, data visualization and working with large scale datasets; Experience in data modelling , data mining as well as machine learning; Proficient in Microsoft and VBA; Strong communication skills with an analytical mindset. Desirable Skill(s) Experience working in Unix/Linux environment; Python certified; Tableau or Qlik certified. Responsibilities Collaborate with different stakeholders to understand data needs, gather requirements and implement data solutions to deliver business goals; Responsible for raw data analysis and data profiling for data integration; Build and maintain data queries as well as data pipelines using SQL and Python; Provide technical solutions... design scalable data models and suggest visualizations to meet the business objectives; Take part in designing and executing user acceptance testing; Build and improve regulatory reporting dashboards and conduct monthly reporting; Ensure documentation and traceability of requirements and, process flow diagrams, and other project documents", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEYXRhIEFuYWx5c3QgKEJCLTcxNEI1KSIsImNvbXBhbnlfbmFtZSI6IlNjaWVudGUgSW50ZXJuYXRpb25hbCIsImNvbXBhbnlfbWlkIjoiL2cvMTFjNzNnajE5biIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6InhFdFBDZkU2Q3FKdm5yQUtBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2WUJDcmNCUVU1VlgwNXhWSFJYZW5wT00yVjZSa015Y0MxUlYyOW1SVzFMVDJKZloxSXlOV3AzTldnMVNTMUpjVkJwZVZnNE4zVnFlVGQ0ZFV0NlJGbzVWMHRJVTNseGRFRk1kRXgxYXpGNmEyMU9WREZHUkVRNE9GQkJVSFkwVGxBMGQxOUpZM0ZtUkdSVFMyTjFVRE5pT1d0ZmMzbFZTVzFCYm04d05IcHdRMU5PTkdnNWR6ZExYMFl6UTBwUU1YbEVTemxMYW5ndFZtRkdaamhSTkZSRVFtZHFVRU5hUjNkNk5IWmZWbTk1TUZSQ04xVlRYMUZqTkZadkVoWkxNM1ZEV1V4cGRrWnphbEYwVVdKcmR6WXlXVU5CR2lKQlQwMVpVbmRDUlMxQk16bDFUbEZaYVVOdFZWcE9lbG8xUjFvMFZXZFBTWEIzIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMjYiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQmVCZWUiLCJsaW5rIjoiaHR0cHM6Ly9zZy5iZWJlZS5jb20vam9iLzIwMjEwNDE3LTMyMWUyYzA5Zjk2YTRhMDQ3NTkwMzIxMjRlNDcxNGI1P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Business Analyst", "company_name": "MavenTree Technology Pte Ltd", "location": "Singapore", "via": "via LinkedIn", "description": "• Tertiary Education in relevant fields is preferred.\n• Hands-on experience in related field is preferred\n• Hands-on experience in at least 1 full project development life cycles.\n• Advantageous to have:\n• Consulting or Business Analysis experience\n• Business Analysis certification (Certification of Competency in Business AnalysisTM (CCBA®),\n\nCertified Business Analysis ProfessionalTM (CBAP®).\n• Up to date on product trends, best practices and technologies.\n• Strong analytical, conceptualisation and problem solving skills.\n• Ability to take a broad, strategic perspective as well as drill deep to understand business needs and\n\nchallenges.\n• Results and customer oriented.\n• Team player with strong organization and people handling skills.\n• Excellent communication skills, both oral and written, with the ability to pitch ideas and influence\n\nstakeholders.\n• Working knowledge of Cloud and Agile", "extensions": ["7 days ago", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJCdXNpbmVzcyBBbmFseXN0IiwiY29tcGFueV9uYW1lIjoiTWF2ZW5UcmVlIFRlY2hub2xvZ3kgUHRlIEx0ZCIsImNvbXBhbnlfbWlkIjoiL2cvMTFnNl96ZnFybSIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6InRJeEJIRU5SYzI4cFJnYkZBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVvc0NDc3dCUVU1VlgwNXhVa3BSYVdGek1uTm5XRFJxUjJ4ZlVUQlNRVkJSUm5veU1YTkxaR1JxWkhNMlRYRTJWa2RFYld4eVoyMWFVM3B0UkhSMVdrUXdUMXBHYTB0MGFXWnBZalZsYUhORkxWWkpXR1JLTWxwMlFVTmZaVGRZVmxwV09GaHNiVEJ2Tm14SVVGUmthMkZRVEdjMVpFdDBWR2wzWjNWYWFYaGpNbU42V1RCU1dGRTNOMjVpYUdreVJFWkhlR2RyWkU5TE9IQnRSWE5rUVRSamJISm1hbGR4UjJwMVgzVmxTMU51VXkxU2MyODRSVk51WmxORWNERkNjREJTVkhRNVZFVnBlSGRzYUZkamRXaEdFaFpMTTNWRFdVeHBka1p6YWxGMFVXSnJkell5V1VOQkdpSkJUMDFaVW5kRVdERnhTM2xoZVhFeGMxaGZOR3c1UkZOVlFrTnpUVGszY0daMyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzMyIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExpbmtlZEluIiwibGluayI6Imh0dHBzOi8vc2cubGlua2VkaW4uY29tL2pvYnMvdmlldy9idXNpbmVzcy1hbmFseXN0LWF0LW1hdmVudHJlZS10ZWNobm9sb2d5LXB0ZS1sdGQtMjUwNjkyMzk0NT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "CSOC Triage Analyst - 12 Month Contract", "company_name": "Bloomberg", "location": "Singapore", "via": "via EFinancialCareers", "description": "CSOC Triage Analyst - 12 Month Contract\n\nShift: Thursday-Friday 8AM-6PM, Saturday-Sunday 8AM-9PM.\n\nWe protect Bloomberg.\nThere's no such thing as a \"safe system\" - only safer systems. Our Security teams work to build and maintain the safest operating environment for Bloomberg's users. The Triage Analyst's function, within the Cyber Security Operations Center, is considered to be a key pillar in Bloomberg's security program design and strategy. Are you a motivated technical professional, who has a passion towards cyber security? And are accomplished in a systems- or applications-support role? In this entry role, Bloomberg will provide you the opportunity to apply your current skills, while you rapidly developing new ones that are required in the Cyber Security field.\n\nThe Bloomberg CSOC is responsible for the detection of cyber threats, and when detected, responsible for the rapid response, across both the diverse lines of business and the global network. The CSOC is an open and... collaborative environment, where members work together to identify and address the latest in cyber security threats facing the company. The CSOC is to staffed 24 x 7 x 365, with varying shifts, and multiple tiers of support, ranging from first response teams to the Computer Incident Response Team. Further, there is opportunity to work with these more experienced members on some of the latest cyber security defense technologies.\n\nIn this role, we'll trust you to:\n- Work Thursday-Friday 8AM-6PM, Saturday-Sunday 8AM-9PM, to support the 24x7x365 Cyber Security Operations Center\n- Demonstrate a passion and good judgment as a network defender\n- Identify and act as the initial responder to all security events\n- Learn and understand the broader security of Bloomberg's environment\n- Monitor for events that match pre-defined criteria, and respond according to standard operating procedures as well as use good judgment for matters where a procedure doesn't exist\n- Bring to closure a significant majority of events without the involvement of other teams\n- Share robust case notes when raising issues in order to help the next team member\n- Remain up-to-date with cyber security threats and trends\n- Deliver on relevant cyber security metrics and measurements for the role and area of responsibility\n- Collaborate directly with colleagues across the firm to resolve security matters while furthering the program's brand through your constructive and thoughtful approach\n- Respond to varying seniority levels of employees and contractors throughout Bloomberg, to address cyber security concerns\n- Ensure appropriate coverage for the assigned shift and provide ample awareness to changes to commitments\n- Produce and maintain documentation and standard operation procedures\n- Generate ideas for continued improvement, including conceptual design of new threat scenarios\n\nYou'll need to have:\n- Deep understanding in a variety of logs, log events, and Splunk\n- Previous experience working with a Security Event and Incident Management platform\n- Knowledge of enterprise network and host security controls\n- Experience working with remote cross-regional teams\n- Ability to be autonomous but proactive in reaching out for support\n- Good familiarity with operating systems (Windows, Linux and MAC)\n- Solid understanding of computer networks and the TCP/IP stack\n- Deep understanding of cyber security trends and potential threats\n- Knowledge of client-server applications, multi-tier web applications, relational databases, firewalls, VPNs and enterprise Anti-Virus products\n- Prior experience with Microsoft Office solutions\n- Proven initiative in further growing knowledge in security space\n- Good communication and interpersonal skills and the ability to take initiative\n- Dedication and ability to collaborate with team members\n- Experience providing superb customer service\n\nWe'd love to see:\n- Work experience within a Cyber Security Operations Center\n- Experience with programming / scripting\n- Experience with middle-ware web services (IIS, Apache)\n- Experience with databases (MS SQL, Oracle, DB2)\n- Relevant Certifications in the information security space\n- Bachelor's degree in related field\n\nIf this sounds like you:\nApply! If we think you are a good match we'll get in touch to let you know the next steps.\n\nTo learn more, visit our YouTube channel \"Inside Bloomberg\" www.youtube.com/InsideBloomberg\n\nWe are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status", "extensions": ["17 hours ago", "Full–time"], "detected_extensions": {"posted_at": "17 hours ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDU09DIFRyaWFnZSBBbmFseXN0IC0gMTIgTW9udGggQ29udHJhY3QiLCJjb21wYW55X25hbWUiOiJCbG9vbWJlcmciLCJjb21wYW55X21pZCI6Ii9tLzAyN3NtNiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImlyaTFiOGs0TnpodURnb09BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhVVUpVUlROUFltaDBRMVZuYzBsbVgxaGZkbkJxWVdvNU9YVkhjbVJ4Tlc4elVVOWhjRkEwYldkQmFVaGhVRUZpWlZod01HZzJRMTlJZFc1SWNFY3hiRTE1ZVhSdWFIUnBNMTlGYzNFdE1XaGtUVTlIY25ocWRGUnJiRmhxVlUxRlVVMTFXSFkyVjJGT1JuQnJTbmxsWDBkbWFIZGxVV056ZW5Fd1NtTlJRVVZLWTFwUVFuVm1WVEZ2V1d4SE4yTjZNV1o2WTNSNlRtNVhPVU4zRWhaTE0zVkRXVXhwZGtaemFsRjBVV0pyZHpZeVdVTkJHaUpCVDAxWlVuZENabmt5T0RCM1N6RTJXazVqWlMwMFpFeFhNbVYwVVhWVExVWjMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18zOSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBFRmluYW5jaWFsQ2FyZWVycyIsImxpbmsiOiJodHRwczovL3d3dy5lZmluYW5jaWFsY2FyZWVycy5zZy9qb2JzLVNpbmdhcG9yZS1TaW5nYXBvcmUtQ1NPQ19UcmlhZ2VfQW5hbHlzdF8tXzEyX01vbnRoX0NvbnRyYWN0LmlkMTA0OTk3MDU/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Business Intelligence Business Analyst", "company_name": "None", "location": "Singapore", "via": "via Jobs", "description": "Job Scope: We are currently looking for an experienced BI Systems Business Analyst to support the delivery of a multi-million Data Mart project that will integrate various external and internal data sources and build a best-in-class data mart and data access self-service tool. Work directly with business users and stakeholders to understand the business needs and translate business requirements into detailed requirements documentation. Employ best practices during requirements gathering and documentation stages. Partner with the IT project manager to manage the data mart project phases/releases from initiation to completion. Manage stakeholder expectations and communications within and beyond functional track. Interacts regularly with senior management level stakeholders to provide periodical project status updates, raise risks and issues encountered in the project. Develop and communicate test strategy and test cases. Coordinate execution and validation of test cases with... stakeholders for user acceptance testing, training, and obtaining project signoffs. Coordinate defects clarification, triage, and resolution with IT team. Develop and actively maintain the data mart data dictionary. Job Requirements: Degree in data management, analytics, statistics, mathematics, or business management. Minimum of 3 years' experience in business analysis and requirements gathering and documentation. Strong knowledge and experience in industry standard project management practices. Strong knowledge of data warehouse modeling and business intelligence concepts (e.g., entity relationship diagramming, SQL querying, source to target mapping, etc.). Excellent visualization skills using Tableau, SiSense or other relevant visualization tools preferred. Advanced knowledge of Excel and SQL. Good Knowledge on CRM, ERP or Financial systems preferred. PMP certification is desirable", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJCdXNpbmVzcyBJbnRlbGxpZ2VuY2UgQnVzaW5lc3MgQW5hbHlzdCIsImNvbXBhbnlfbmFtZSI6Ik5vbmUiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6InBybjhsRmtORjZmbVo1NlNBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9icyIsImxpbmsiOiJodHRwczovL3NnLmZpZGFudG8uY29tL2pvYnMvam9iLW9wZW5pbmcvYnVzaW5lc3MtaW50ZWxsaWdlbmNlLWFuYWx5c3RzL2J1c2luZXNzLWludGVsbGlnZW5jZS1idXNpbmVzcy1hbmFseXN0LWNlbnRyYWwtc2luZ2Fwb3JlLTI3NTQzNzE0ND91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "DevOps (Analyst - Consultant)", "company_name": "Accenture", "location": "Singapore", "via": "via Accenture", "description": "About Accenture\n\nAccenture is a global professional services company with leading capabilities in digital, cloud and security. Combining unmatched experience and specialized skills across more than 40 industries, we offer Strategy and Consulting, Interactive, Technology and Operations services—all powered by the world’s largest network of Advanced Technology and Intelligent Operations centres. Our 506,000 people deliver on the promise of technology and human ingenuity every day, serving clients in more than 120 countries. We embrace the power of change to create value and shared success for our clients, people, shareholders, partners and communities. Visit us at www.accenture.com.\n\nAccenture Technology combines business and industry insights with innovative technology services to transform your business. Join one of the world’s largest independent providers of technology services to grow your expertise and help clients worldwide to innovate at scale and transform their businesses... Help change how the world works and lives through technology innovation.\n\nRole: DevOps (Analyst – Consultant)\n\nRole & Responsibilities:\n• Build automation wherever possible to improve development team’s agility- never do the same thing twice. If you're using Bash, PowerShell, Python.\n• Experience in setting up and using Agile continuous integration tools, for example:\n• Continuous integration tool such as Azure DevOps, Github Action, Jenkins\n• Configuration delivery tool such as Helm, Kubectl, Powershell DSC\n• Experience in IaC (Infrastructure as a code) automation using Terraform preferred", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEZXZPcHMgKEFuYWx5c3QgLSBDb25zdWx0YW50KSIsImNvbXBhbnlfbmFtZSI6IkFjY2VudHVyZSIsImNvbXBhbnlfbWlkIjoiL20vMDFycDJjIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiVW9BeWxTZlpoczZva0JfM0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFVua3ljakpHUlZCdWVGcHZZazUxZG1WcGRsOUxXR1ZKTWpSWGMwTm1RbWhzYVVKMFNsZEVRVlZCY1dGR1VVTTJjbkp0UjBscVgycDBaa3RETUZRemVraDFTeTF5V2tWRWQwZ3RWMUpMTFhCaVVtaG5kMlJKY2twcVYxUndiWHB3WkcxR2JsRmZPV3haZGxKdldtcE9TVXBEUWxOc2EzZEdWREkyV21oVk5WTmtWRTlZUmtsVGJqTjVTR05JTUdsMVVYRjRSWG95VERoeGFWSlJFaFpMTTNWRFdVeHBka1p6YWxGMFVXSnJkell5V1VOQkdpSkJUMDFaVW5kQmRuTlRiWEpoY0hsQlZIQlhjbkl5UjNKQlMyWXROVWQwYlhoMyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzUxIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEFjY2VudHVyZSIsImxpbmsiOiJodHRwczovL3d3dy5hY2NlbnR1cmUuY29tL3NnLWVuL2NhcmVlcnMvam9iZGV0YWlscz9pZD0wMDg2MTg2NF9lblx1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "PEGA Developer - Architect (Analyst - Manager)", "company_name": "Accenture Southeast Asia", "location": "Singapore", "via": "via LinkedIn", "description": "About Accenture\n\nAccenture is a global professional services company with leading capabilities in digital, cloud and security. Combining unmatched experience and specialized skills across more than 40 industries, we offer Strategy and Consulting, Interactive, Technology and Operations services—all powered by the world’s largest network of Advanced Technology and Intelligent Operations centres. Our 506,000 people deliver on the promise of technology and human ingenuity every day, serving clients in more than 120 countries. We embrace the power of change to create value and shared success for our clients, people, shareholders, partners and communities. Visit us at www.accenture.com.\n\nAccenture is an Irish-domiciled multinational professional services company that provides services in:\n• Technology\n• Strategy & Consulting\n• Interactive\n• Operations\n\nAs a Fortune Global 500 company, it has been incorporated in Dublin, Ireland since September 1, 2009. In 2019, the company reported revenues... of $43.2 billion, with more than 492,000 employees serving clients in more than 200 cities in 120 countries.\n\nAccenture Technology combines business and industry insights with innovative technology services to transform your business. Join one of the world’s largest independent providers of technology services to grow your expertise and help clients worldwide to innovate at scale and transform their businesses. Help change how the world works and lives through technology innovation.\n\nJob Title: PEGA Application Developer - Architect (Analyst - Manager)\n\nCritical Success Factors:\n\nMandatory\n• Depending on seniority, around 1-10 years in System Integrator (SI) environment (in an implementation/a development capacity, rather than sales/maintenance)\n• At least 1-5 years of hands-on experience in development / architecture\n• We will consider Java Developers at (Analyst - Consultant level) who are keen to make a switch to pick up PEGA\n\nPreferred/Optional\n• Experience in PEGA Rule Process Commander (PRPC)n / Care Management Framework (PEGA)\n• Experience in PEGA technical and architecture with broad industry and functional knowledge\n• 7.n PEGA Certification is preferred (PEGA Certified SA/SSA)\n\nKey responsibilities may include:\n• Collaborate with Project Team in understanding client requirements and how they translate in application features\n• Collaborate with the Team to set specifications for new applications Perform troubleshooting and debugging of applications when required\n• Evaluate existing applications to reprogram, update and add new features Work with business process owners/SMEs to assess capabilities and identify high-level user requirements\n• Work with project managers, architects and SMEs to define metrics and performance goals for the process.\n• Participate in transitioning the requirements and use cases.\n\nYou will also have opportunities to hone your functional skills and expertise in an area of specialization. We offer a variety of formal and informal training programs at every level to help you acquire and build specialized skills faster. Learning takes place both on the job and through formal training conducted online, in the classroom, or in collaboration with teammates. The sheer variety of work we do, and the experience it offers, provide an unbeatable platform from which to build a career.\n\nAccenture is an equal opportunities employer and welcomes applications from all sections of society and does not discriminate on grounds of race, religion or belief, ethnic or national origin, disability, age, citizenship, marital, domestic or civil partnership status, sexual orientation, gender identity, or any other basis as protected by applicable law", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQRUdBIERldmVsb3BlciAtIEFyY2hpdGVjdCAoQW5hbHlzdCAtIE1hbmFnZXIpIiwiY29tcGFueV9uYW1lIjoiQWNjZW50dXJlIFNvdXRoZWFzdCBBc2lhIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJOcFNLTzV1eDhLMVgwWWZqQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExpbmtlZEluIiwibGluayI6Imh0dHBzOi8vc2cubGlua2VkaW4uY29tL2pvYnMvdmlldy9wZWdhLWRldmVsb3Blci1hcmNoaXRlY3QtYW5hbHlzdC1tYW5hZ2VyLWF0LWFjY2VudHVyZS1zb3V0aGVhc3QtYXNpYS0yNDU0MDYyNzk4P3JlZklkPTlmZDE4YWIwLTRhMzQtNDI1Yy04ZTYwLTRmNjliODRkMWJlM1x1MDAyNnRyYWNraW5nSWQ9MHlJMTB0RGg0L2hhdlppUGVCaW1RUSUzRCUzRFx1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Business Operations", "value": "GC06"}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Accounting and Finance", "value": "GC01"}, {"text": "Science and Engineering", "value": "GC27"}, {"text": "Advertising and Marketing", "value": "GC03"}, {"text": "Customer Service", "value": "GC10"}, {"text": "Legal", "value": "GC17"}, {"text": "Protective Services", "value": "GC23"}, {"text": "Management", "value": "GC18"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Property", "value": "GC24"}, {"text": "Sales and Retail", "value": "GC26"}, {"text": "Social Services and Non-Profit", "value": "GC28"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "Business analyst", "value": "business analyst"}, {"text": "Analyst", "value": "analyst"}, {"text": "Security analyst", "value": "security analyst"}, {"text": "Systems analyst", "value": "systems analyst"}, {"text": "It analyst", "value": "it analyst"}, {"text": "Data analyst", "value": "data analyst"}, {"text": "System analyst", "value": "system analyst"}, {"text": "Support analyst", "value": "support analyst"}, {"text": "Associate", "value": "associate"}, {"text": "Management analyst", "value": "management analyst"}, {"text": "Operations analyst", "value": "operations analyst"}, {"text": "Soc analyst", "value": "soc analyst"}, {"text": "Test analyst", "value": "test analyst"}, {"text": "Intelligence analyst", "value": "intelligence analyst"}, {"text": "Research analyst", "value": "research analyst"}, {"text": "Senior", "value": "senior"}, {"text": "Senior analyst", "value": "senior analyst"}, {"text": "Control analyst", "value": "control analyst"}, {"text": "Manager", "value": "manager"}, {"text": "Project analyst", "value": "project analyst"}, {"text": "Researcher", "value": "researcher"}, {"text": "Risk analyst", "value": "risk analyst"}, {"text": "Service analyst", "value": "service analyst"}, {"text": "Technology analyst", "value": "technology analyst"}, {"text": "Accounting analyst", "value": "accounting analyst"}, {"text": "Application analyst", "value": "application analyst"}, {"text": "Behavior analyst", "value": "behavior analyst"}, {"text": "Business", "value": "business"}, {"text": "Center analyst", "value": "center analyst"}, {"text": "Compliance analyst", "value": "compliance analyst"}, {"text": "Coordinator", "value": "coordinator"}, {"text": "Desk", "value": "desk"}, {"text": "Desk analyst", "value": "desk analyst"}, {"text": "Financial analyst", "value": "financial analyst"}, {"text": "Functional analyst", "value": "functional analyst"}, {"text": "Hr analyst", "value": "hr analyst"}, {"text": "Interns", "value": "interns"}, {"text": "Operations center", "value": "operations center"}, {"text": "Process analyst", "value": "process analyst"}, {"text": "Programmer analyst", "value": "programmer analyst"}, {"text": "Project manager", "value": "project manager"}, {"text": "Qa analyst", "value": "qa analyst"}, {"text": "Senior associate", "value": "senior associate"}, {"text": "Senior consultant", "value": "senior consultant"}, {"text": "Specialist", "value": "specialist"}, {"text": "Sr analyst", "value": "sr analyst"}, {"text": "Support executive", "value": "support executive"}, {"text": "Technical analyst", "value": "technical analyst"}, {"text": "Technical architect", "value": "technical architect"}, {"text": "Trainee", "value": "trainee"}, {"text": "Treasury analyst", "value": "treasury analyst"}, {"text": "Wealth management", "value": "wealth management"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Internship", "value": "INTERN"}, {"text": "Part-time", "value": "PARTTIME"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Research", "value": "/business/naics2007/5417"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Mining", "value": "/business/naics2007/21"}, {"text": "Real Estate", "value": "/business/naics2007/53"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Engineering Services", "value": "/business/naics2007/5413"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Utilities", "value": "/business/naics2007/22"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "SingTel", "value": "/m/020zfl"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "Trustwave", "value": "/m/0n3xjf5"}, {"text": "Government Technology Agency", "value": "/g/11gh0528nq"}, {"text": "OCBC", "value": "/m/055r27"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "Credit Agricole Group", "value": "/m/028vbm"}, {"text": "UL", "value": "/m/01q1gj"}, {"text": "VISA", "value": "/m/01kqjn"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "American Express", "value": "/m/01w6dw"}, {"text": "Avensys Consulting", "value": "/g/11g7022gjf"}, {"text": "Binance", "value": "/g/11hcz1r4wl"}, {"text": "BlueVoyant", "value": "/g/11h1y4qdlf"}, {"text": "Caterpillar", "value": "/m/0319hp"}, {"text": "Cognizant Singapore, Cognizant Technology Solutions", "value": "/m/03bf9h"}, {"text": "DBS Bank Ltd", "value": "/m/01q7n5"}, {"text": "Deloitte SEA", "value": "/g/11f_g4x9d_"}, {"text": "Dyson", "value": "/m/05cskg"}, {"text": "EPAM Systems", "value": "/m/0dlnrc"}, {"text": "Experis Singapore", "value": "/g/11dxpnwm3s"}, {"text": "HSBC", "value": "/m/096k1t"}, {"text": "JPMorgan Chase & Co.", "value": "/m/01hlwv"}, {"text": "Jobline Resources Pte Ltd", "value": "/g/11gp2647pn"}, {"text": "Marina Bay Sands Pte Ltd", "value": "/m/09mhd9q"}, {"text": "Medtronic", "value": "/m/03z4j3"}, {"text": "Mizuho Bank", "value": "/m/022103"}, {"text": "Public Service Division", "value": "/g/11g6__bv10"}, {"text": "RECRUIT EXPRESS PTE LTD", "value": "/g/11g706hzhq"}, {"text": "RHB Singapore", "value": "/g/11c73srg7f"}, {"text": "Randstad", "value": "/m/08pt1z"}, {"text": "Randstad Singapore", "value": "/g/11g70b50mr"}, {"text": "SITA", "value": "/m/06l20z"}, {"text": "Selby Jennings", "value": "/g/11fy2ds3gn"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "Xcellink Pte Ltd", "value": "/g/11c73prcqy"}, {"text": "Xilinx", "value": "/m/03dwkc"}, {"text": "103 Golden Agri International Pte Ltd", "value": "/g/11fy210tb9"}, {"text": "Activate Interactive Pte Ltd", "value": "/g/11dxq192l5"}, {"text": "Amazon", "value": "/m/0mgkg"}, {"text": "Apple", "value": "/m/0k8z"}]}]}