{"search_metadata": {"id": "608279fbd036a76c9a8ab21a", "status": "Success", "json_endpoint": "https://serpapi.com/searches/d9e612f8752cf971/608279fbd036a76c9a8ab21a.json", "created_at": "2021-04-23 07:40:43 UTC", "processed_at": "2021-04-23 07:40:43 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28product+manager%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=90", "raw_html_file": "https://serpapi.com/searches/d9e612f8752cf971/608279fbd036a76c9a8ab21a.html", "total_time_taken": 1.36}, "search_parameters": {"q": "(product manager) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "90"}, "jobs_results": [{"title": "Product Manager - Fintech - E-Commerce", "company_name": "Adecco Personnel Pte Ltd", "location": "Singapore", "via": "via Monster", "description": "Job Description :\nWith the effortless commitment in the development of digital currency spot and trading systems, we are looking out for energetic and highly motivated Product Manager to join the team!\nProduct Manager (Fintech/ E-Commerce)\nThe Opportunity\n• Our client is one of leading and fast-growing fintech companies that specialized in blockchain space\n• Exciting job opportunity as part of the global team\n• Attractive remuneration package and benefits\n\nThe Talent\n• Min 3 years in product management experience, preferably in Fintech or E-commerce space\n• Familiar with loyalty and retention programs, customer lifecycle/journey, and CRM\n• Led scrum team as product owner with good understanding in Agile software development methodologies\n• Strong project management and strategic planning skills, with ability to thrive in a fast-paced and dynamic entrepreneurial environment\n• Sharp analytical mind, innovation in problem solving and excellent communication skills\n\nThe Job\n• Develop... implement, and execute customer engagement, retention, and loyalty products/projects based on customer behaviour, data, and best practices\n• Turn business requirements into a roadmap of features broken down by quarter\n• Maintain a prioritized backlog with clear and concise user stories\n• Stakeholder management skills to work successfully with engineering and design to ensure that a functionality is delivered on time and with best quality in the market\n• Work closely with the data team to set up multivariate experiments, conduct in-depth data analysis, identify learnings, optimize iterative functions and user experience\n• Cooperate with marketing teams for enhancement of active user, conversion, retention rate, interaction design, project management etc\n\nNext Step\nPrepare your updated resume (include your current salary package with full breakdown such as base, incentives, annual wage supplement, etc.) and expected package.\nEmail your updated resume to . All shortlisted candidates will be contacted. All the best!\nZita Tang Yun Zi\nEA License No: 91C2918\nPersonnel Registration Number: R1653970", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9kdWN0IE1hbmFnZXIgLSBGaW50ZWNoIC0gRS1Db21tZXJjZSIsImNvbXBhbnlfbmFtZSI6IkFkZWNjbyBQZXJzb25uZWwgUHRlIEx0ZCIsImNvbXBhbnlfbWlkIjoiL20vMDhnejQ2IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiV0M4Y255LWdBdEItQzlRQkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRW9rQ0Nzd0JRVTVWWDA1eFVtbEtiRzE2YkZONFZHczNORU5QWDNOalpHNTVSazlvTjNSTU1FYzFaMkpsUTFoaFIwSjBabGRVWVVWMFdXZFZUblJqTTNOWVdtZHRVV3BVZVhCT1pVUkJjak0wVkhaR1EyZEpibU00VlU1UlowTndVR2RKTVdoMmFYcFJia2hxY0hkaVgzVkJNRkF0WVdWdFdtaExURUZHYjI5a01tRmFjQzFrTXpCeVlsTlhSWHBSYm1seGVHOUdaRkZKVFV0cGIzTklRbDlTVVY5a1pVOUlWV1prWDBVM1YzUTNURXB0WjJWMFFXeEZRWEJDWW1WdmFqSnFaelZOZFVWa09YcFVTVms1U1dsMkVoUmZTRzFEV1V4YVNEVmxkVEZDY3pZdGNqVkJRaG9pUVU5TldWSjNRVzExUjNGYVVUZFVOMEZCTVZCNWRGazRkR2ROWkdKcGFHVklRUSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzciLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTW9uc3RlciIsImxpbmsiOiJodHRwczovL3d3dy5tb25zdGVyLmNvbS5zZy9qb2IvcHJvZHVjdC1tYW5hZ2VyLWZpbnRlY2gtZS1jb21tZXJjZS1hZGVjY28tcGVyc29ubmVsLXB0ZS1sdGQtc2luZ2Fwb3JlLTI0OTE5NDQ/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Product Manager-Payment/wallet", "company_name": "TikTok", "location": "Singapore", "via": "via Bayt.com", "description": "1. Identify and bridge payment service product gaps, prioritize, and continuously build and iterate products;\n2. Work with legal, GR, PR, compliance, security to continuously improve TikTok Wallet and payment system to create a stable, agile and robust in-app wallet system;\n3. Closely monitor all business endpoints' payment status, analyze the daily data and cope with urgent requests;\n4. Integrate with Tax, KYC (know your customer), order system to support all business endpoints on TikTok Platform;\n5. Create a central platform to support TikTok internal teams to better operate TikTok Wallet system, to ensure smooth and seamless pay-out execution.\n1. Excellent communication skills, can clearly describe the vision, planning and problem; and coordinate with other teams to solve it together in depth;\n2. 3+ years of product management experience building payment/wallet product\n3. User-first mindset with high attention to details\n4. Entrepreneurship, able to deal with rapid changes and... imperfect status quo;\n5. Has a global vision and enthusiasm, and pays continuous attention to global internet products;\n6. Fluency in English, mandarin is a plus", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9kdWN0IE1hbmFnZXItUGF5bWVudC93YWxsZXQiLCJjb21wYW55X25hbWUiOiJUaWtUb2siLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IlQ0QWplajdjUEswaGVZcnVBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQmF5dC5jb20iLCJsaW5rIjoiaHR0cHM6Ly93d3cuYmF5dC5jb20vZW4vc2luZ2Fwb3JlL2pvYnMvcHJvZHVjdC1tYW5hZ2VyLXBheW1lbnQtd2FsbGV0LTU3OTE0OTU5Lz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Product Specialist/ Product Manager (in Radiology)", "company_name": "BioMind", "location": "Singapore", "via": "via Glassdoor", "description": "Singapore\n\n3-5 Years\n\nBachelor\n\nResponsibilities\n• Provide hospital in service and training of our appointed Sales Channels in the region with well documented training materials. Show and teach all users the ease of using our product Pre-Sales through on-site demo and Post Sales with hospitals users.\n• Ensure all conferences / exhibitions are well organised according to our company standards. In charge of Product info updates and circulation to relevant staff and distributors through company log in website or emails.\n• To gather, analyse data and business intelligence (competition) from various sources (internal and external) to develop a strategic road map for any GTM- go to market. To communicate the strategy to all relevant parties.\n• New product kick off seminars for distributors and users to be organised at an appropriate time with the Sales department, with all relevant supporting marketing materials. Conduct professional product training with certification, having successfully... attended the course.\n• Work closely with our Machine Learning & Software development team when developing new products and engage in application sharing with them on market trends and wants.\n• As the leader of future Product / Application Specialists (radiographers) in India, South Korea and Japan (we may need to add more specialists depending on our business growth), your leadership in this capacity is to ensure our strategies are efficiently and effectively implemented.\n\nQualifications & Experiences\n• Degree in Radiology, Medical Imaging, or other related discipline or equivalent.\n• Experience in Diagnostic Imaging or Biomedical Imaging field for the medical device industry would be an advantage, preferably in experience as a radiologist.\n• Experience in negotiating with regulatory authorities.\n• Medical Device Act and other medical device related regulations in Singapore and globally\n• Skilled in document management", "extensions": ["14 days ago", "Full–time"], "detected_extensions": {"posted_at": "14 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9kdWN0IFNwZWNpYWxpc3QvIFByb2R1Y3QgTWFuYWdlciAoaW4gUmFkaW9sb2d5KSIsImNvbXBhbnlfbmFtZSI6IkJpb01pbmQiLCJjb21wYW55X21pZCI6Ii9nLzExZHltZnIybDYiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJZQ3RWRzQyMEMxYzZqYS1mQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdDhCQ3FJQlFVNVZYMDV4VTNsa1lrZFVWR3hyTFZBM2IzVTRPVWRuZDE5UVVrWk5kMWRCYmxKWVlXUTVNV2hqYzAxQk5sb3hhamwxUWt4eVZrMW1hbWN5VFdOd1lXeFJlalpYYkdKcFJFUTRVV1JGYzIwNE5qZDRUbDgyYW1zd2JFZDVOMDFTTkhsdUxXcGlUMUpLYzJabVNrNDFRblpYUWtvMllXUTBXV1JCTUMxSlNWSXllV1pFWDNWSk9HMWxPV1J3YXpaWmNURmFSbWR5ZFZsdE1VdGxURGh2YW05QkVoUmZTRzFEV1V4YVNEVmxkVEZDY3pZdGNqVkJRaG9pUVU5TldWSjNRV1ZLVDNwSFUyUnZYMmhqU25WblNuVk1RMWt4YlhkR1VFaFlkdyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzE5IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEdsYXNzZG9vciIsImxpbmsiOiJodHRwczovL3d3dy5nbGFzc2Rvb3Iuc2cvam9iLWxpc3RpbmcvcHJvZHVjdC1zcGVjaWFsaXN0LXByb2R1Y3QtbWFuYWdlci1pbi1yYWRpb2xvZ3ktYmlvbWluZC1KVl9JQzMyMzU5MjFfS08wLDQ3X0tFNDgsNTUuaHRtP2psPTQwMjk0MjI4MDhcdTAwMjZ1dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Assistant Manager, Life Product Development", "company_name": "AXA", "location": "Singapore", "via": "via Laimoon.com", "description": "Primary Location\n\n: SINGAPORE-SINGAPORE-SINGAPORE\n\nOrganization\n\n: AXA Singapore\n\nContract Type\n\n: Regular\n\nShift\n\n: Day Job\n\nSchedule\n\n: Full-time\n\nDescription\n\nBUSINESS CONTEXT & MAIN PURPOSE OF THE JOB\n• Contribute in the aspects of value proposition for P&H products (market research & marketing aspect\n• Brainstorm and assist in new P&H initiatives for distributors\n• Manage the existing distributors’ challenges (tracking and communication)\n• Doing portfolio analysis of the distributors in P&H production and help them to upsell/cross-sell to existing customers\n• To assist in lead gen initiatives\n\nRESPONSIBILITIES/KEY ACCOUNTABILITIES\n\nManage Distributors’ Initiatives & Campaigns by:\n• Liaising with internal stakeholders to track the data and blast out communications\n• Liaising with Marketing and Events team on P&H events\n• Analysing portfolio mix to help in designing campaign mechanics\n• Handle campaigns related queries\n• Prepare campaign approval form and requisite payment\n•... Prepare presentation slides for department meetings/events\n• Doing data analysis and monthly report with distribution focus\n• Assist in-house design of communication materials such as simple eDM\n\nContribute in P&H value proposition by:\n• Brainstorm with the team and comes up with suitable marketing content of the existing protection plans\n• Social Media Content\n• Doing market research\n• Brainstorm ideas on new sales angle of the existing products\n\nAssist in lead gen initiatives:\n• Liaising with L&C and Marketing team on the content and social media posts\n• Liaise with Digital team to track the results\n\nOther responsibilities and assignment delegated by the direct hiring manager\n\nQualifications\n\nEXPERIENCE & QUALIFICATIONS\n• Diploma and above\n• 5-6 years of relevant experience in insurance related industry\n• Good analytical skills\n• Good in MS Excel & MS Powerpoint\n• Creative\n• A team player with ability to multi-tasking\n• Able to work effectively and independently under pressure and in a fast paced environment\n• Ensures timely high quality deliverables\n• Good interpersonal skills\n\nAbout AXA\nAXA Insurance is part of the AXA group, a worldwide leader in insurance and asset management, with 160,000 employees serving 108 million clients in 57 countries.\n\nPresent in Singapore since 1969, AXA Insurance has been serving the general and life insurance needs of individuals and companies in Singapore through a wide range of innovative products. As one of the top global insurers in Singapore, AXA Insurance protects more than a third of a million customers in Singapore. As a company whose business is about protecting people, AXA Insurance is committed to building a stronger and safer society by empowering customers to live better lives.\n\nFor more information, please visit www.axa.com.sg\n\nWhat We Offer Discover a stimulating environment, based on excellence on a global scale. Are innovation and initiative important to you? Do you focus on solutions? Are you customer-orientated? We offer a wealth of career opportunities and a wide variety of positions in many fields. We want our employees to enjoy fulfilling careers and keep moving their careers in the right direction, whether at home or across the globe.\n\nOur size and diversity of activities means our people have many opportunities to evolve, by moving roles cross-functionally or internationally, based on their performance and aspirations. At AXA, all work and no play isn’t our way. We’re creating the future with more inclusive, agile work environments. Speak to us to find out more", "extensions": ["4 days ago", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBc3Npc3RhbnQgTWFuYWdlciwgTGlmZSBQcm9kdWN0IERldmVsb3BtZW50IiwiY29tcGFueV9uYW1lIjoiQVhBIiwiY29tcGFueV9taWQiOiIvbS8wNG1uOTkiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJSRXRfRXNHQnRZRVY2VDdmQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFc2tCQ293QlFVNVZYMDV4VTBOSk5XTklhMkZaV21SNVIwUkxRbXRoZEZocE1EbDJhWHA0WWpsSmNscGFNSEZqYWxSWlFUUkxlVlpGU1VOUmVtWjJTbHBWT0VGUWNGZDRWM2xXY2pOb1Nqa3diVkZ4YkZCR2RqY3pSa05VT0hkWU4yazNkR0Z1Vldwa1JGOVVTVlZ5VFZWQ2JrbHNiMlEwYUU0eVdUQmZhMGcyUkVscFNtVlZkMFpPZFVJMVJXTkhOVFlTRkY5SWJVTlpURnBJTldWMU1VSnpOaTF5TlVGQ0dpSkJUMDFaVW5kQmIySkZXWGx4T1Y5TVZXaFRhRzVTZVhsNWVYaEZlR1p2UjNsQiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzI3IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExhaW1vb24uY29tIiwibGluayI6Imh0dHBzOi8vam9icy5sYWltb29uLmNvbS9qb2JzL2V4dGVybmFsdmlldy8yNjA1MDE5NT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Regulatory Affairs Manager, APAC (PPE) (BB-6314E)", "company_name": "Robert Walters", "location": "Singapore (+1 other)", "via": "via BeBee", "description": "An exciting Regulatory Affairs Manager, APAC (PPE) role has been made available at one of the world's leading medical supplies company.About the Regulatory Affairs Manager, APAC (PPE) Role:In charge of the PPE portfolio, you will provide technical leadership in the development and implementation of regulatory strategies to support the achievement of business objectives, while ensuring compliance with domestic, regional, and international PPE regulations.Key Responsibilities: Actively monitor the evolving regulatory landscape and proactively communicate potential business impact to managementDevelop the company's presence in industry groups to facilitate the organisation's ability to shape the regulatory landscapeDevelop and implement domestic, regional, product specific regulatory strategies in support of business objectivesPrepare accurate right first time regulatory submissions to secure timely approvals in support of business initiativesEngage commercial and functional stakeholders... on progress of regulatory initiatives and proactively communicate risks and present mitigation plansProvide an interpretation of regulatory requirements, both domestic and regional to the appropriate business team members and highlight implications of differences with respect to product development and testing activities so as to minimise overall development activities while bringing speed to the registration processConduct training seminars on domestic and regional regulatory requirements and/or impending regulations to the appropriate business team members to enable the best development activities To succeed in this Regulatory Affairs Manager, APAC (PPE) role, you must possess relevant regulatory technical experience in PPE sector, including direct experience in submissions and regulatory defence, regulatory review, regulatory certification and product life cycle management within the Asia Pacific region.Key Requirements: A broad technical background is required; preferably a graduate level degree, or as a minimum, a bachelor’s degree in a major scientific discipline, preferably pharmacy, chemistry, or microbiologyMinimum of eight years' relevant regulatory technical experience in PPE sector, including direct experience in submissions and regulatory defence, regulatory review, regulatory certification and product life cycle management within the Asia Pacific regionExpertise in the various regulatory framework covering PPE across Asia Pacific. Proven track record of registering disinfectants and medical devices across Asia PacificExcellent understanding of key US and EU PPE regulatory framework. Ability to articulate the impact of these regulations to Asia Pacific This organisation needs no introduction and is recognised as a key leader within the medical supplies field. The culture is demanding, but if you are confident and have a can-do attitude, the potential rewards are significant. The business is also very focused on developing and training their people to the highest standards.If you are driven, determined and want to take the next step in your career, this Regulatory Affairs Manager, APAC (PPE) role is for you. Great career progression opportunities await the right person in this exciting Regulatory Affairs Manager, APAC (PPE) role in Singapore.Apply now to learn more.Do note that we will only be in touch if your application is shortlisted.Do note that we will only be in touch if your application is shortlisted", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJSZWd1bGF0b3J5IEFmZmFpcnMgTWFuYWdlciwgQVBBQyAoUFBFKSAoQkItNjMxNEUpIiwiY29tcGFueV9uYW1lIjoiUm9iZXJ0IFdhbHRlcnMiLCJjb21wYW55X21pZCI6Ii9tLzA2NGtwa3AiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiI4ZlhDZTJZcWN2OXlrSXZHQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdDhCQ3FJQlFVNVZYMDV4VTBOcGRtZHVXa3g2Y0Y5RVh6RmFSa0pLWHpsallXeElXbnBGUW5OMlpsVmpjMDR0ZUdoU1UxUlhObVpyVnpCWWRHSlVhalV6ZUUxWloxcHRPV1E0U1VWWE1HNXljaTFQYWpoeVRtODFlbXBHVWtaS1dtaHdSblpNTjA5WGMySnBhVzFsUzJ0M2NXcEhaMjQ1V2s1b1VUSndjMWRSUjJWWFlXNU9Vazl5WVZrM1ZrWmthRUZIYXpSbVVYWkNlVWRDWm5oclRrODFaRmszU1dKQkVoUmZTRzFEV1V4YVNEVmxkVEZDY3pZdGNqVkJRaG9pUVU5TldWSjNRVXRPV2kxdlV6bG5hVGxoUW5oMWJGWXpTREZ0UkZWT2MwaFdkdyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzM1IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJlQmVlIiwibGluayI6Imh0dHBzOi8vc2cuYmViZWUuY29tL2pvYi8yMDIxMDQxNy1kZGU5ODNiNzYzYzhjODNiNGQxYjYxZDMxNGQ2MzE0ZT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Product Manager (Digital)", "company_name": "CHUBB ASIA PACIFIC PTE. LTD.", "location": "Singapore", "via": "via LinkedIn", "description": "Digital at Chubb\n\nAt Chubb, we believe that the experience is the product – as such, customer experience and a Digital-by-default strategy is at the heart of everything we do. As part of our growing Digital Business, you’ll be welcomed into a highly competent, lively and supportive environment where your voice matters. With a focus on collaborative working – we are looking for ambitious and experienced Digital talent to ensure we’re creating the best new service-based products and experiences for our partners.\n\nRole Overview\n\nThe Digital Product Owner for E-Service is responsible for the delivery of the Digital Product vision around how our customers will self-serve online. My Account allows our customers to access and manage their policies in one place, update personal and payment information and make an end-to-end claim without the need to call. My Account will also create new revenue streams for incremental growth of our Online Channel by promoting new subscription-based products... to existing customers.\n\nIn this role, you will be assigned a development scrum team with a range of multi-disciplinary skills to deliver digital solutions that combine insurance product, technology and front-end user experience for Chubb across Asia Pacific.\n\nThe Digital Product Owner is a critical link between the development teams and our business stakeholders – as such, we’re looking for someone with very strong communication skills to captain our Digital delivery for My Account. You will bring different members of the business together to make sure we’re always finding new ways to build the best product possible to meet the demanding needs of our customers.\n\nYou will be working closely with our Insights teams to use data from all channels to keep us on our toes, listening to customer needs so we can focus on creating new products with a personalised service that keeps them coming back for more.\n\nMain Responsibilities\n• Collaborate with global Chubb colleagues to identify priority scope for maximum customer satisfaction and business value, and track through to achievement\n• Develop clear business cases for new features and functionality to be developed\n• Identify risks and dependencies across Chubb’s business functions to ensure a smooth and timely delivery\n• Provide clarity and direction to your dedicated development team to facilitate regular sprint planning and prioritisation\n• Ensure Business Analysts can translate your requirements into clear, small and testable User Stories for delivery within an agreed timebox\n• Empower the development team to solve complex and technical problems to ensure that the business and user needs are met throughout the project execution and delivered in the most efficient way\n• Responsible for understanding, overseeing and defending the product concept and user experience that has been planned - approving and participating in the creation of solutions to problems and unforeseen circumstances that may appear during execution phases\n• Work with the Digital Technology team to ensure that the delivery adheres with Chubb’s Digital Architecture and Information Security standards\n• Seek our data to analyse and make decisions around all the elements related to the product (User experience, insurance products, promotion, digital marketing etc.) being wholly accountable for the production to meet plans, quality and expectations\n\nExperience\n\n& Qualifications\n• Minimum of 3 years’ experience as a Digital Product Owner, preferably responsible for a highly-performant mobile app or web-based platform\n• Certified Agile Scrum Product Owner with experience in educating on and delivering using Agile Scrum methodologies\n• Experience using Atlassian Jira and Confluence to maintain product backlogs and sprint planning\n• Bachelor’s Degree in Business, Marketing, Communication, UX or other related field required\n• Proficient in Microsoft Applications (Word, Excel and PowerPoint) and working knowledge of common application software\n• Ideally understanding of insurance products and their related services (claims etc) is preferred\n• Track record of website optimization and solutions that positively impact consumer experience\n• Ability to quickly assimilate technical and business information into clearly defined deliverables\n• Highly effective in problem-solving and creative solutions\n• Strong team player with excellent organization, communication and coordination skills\n• Ability to meet deadlines in a fast-paced, collaborative business environment, handling multiple projects simultaneously", "extensions": ["9 days ago", "Full–time"], "detected_extensions": {"posted_at": "9 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9kdWN0IE1hbmFnZXIgKERpZ2l0YWwpIiwiY29tcGFueV9uYW1lIjoiQ0hVQkIgQVNJQSBQQUNJRklDIFBURS4gTFRELiIsImNvbXBhbnlfbWlkIjoiL20vMDltOHh5aCIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Ikc2Mk8wMjBuSkhUVm9TalVBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVva0NDc3dCUVU1VlgwNXhVMGhpWjFwRlMwOHdiVmswZG1Vd1lYRlBRM1p6VkhGeWRsOXlWVE0wZFY5bVlYcFFTRmRRUjNsamFIcEJjMkZTT0hGd2FrZzFObWhLUlVreFNVWkRUblZ5WHpaV1pHWkhkelp5VkRGS1dtRXRhemMwTXpOMlFsVk1NbXhOVHpaSE9XMDFNVEJWUlVKb1RsRmtVVFUzVEZkdVYwdG5OVEoxZFRaYVNXSnVlV0pIZG5GSlNGSnFjR2xhU3poMk1GZEZYM0pMTWxCcVRFNVhlQzF3UzBaUmQydHBXVUpsVkhkVmRuRTRaR3BGT1VocmMzWjBOelZXTTFWQ04xSkxNMk16WVhGUGJFbHVFaFJmU0cxRFdVeGFTRFZsZFRGQ2N6WXRjalZCUWhvaVFVOU5XVkozUkdGdE1rdGFUbkJVZFMxNVVscEtNMGRCTjFaNE9ETnRWVkpWWnciLCJmY3YiOiIzIiwiZmNfaWQiOiJmY180MSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL3NnLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvcHJvZHVjdC1tYW5hZ2VyLWRpZ2l0YWwtYXQtY2h1YmItYXNpYS1wYWNpZmljLXB0ZS1sdGQtMjUwMzY2OTkxOT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior Product Manager – Unified Communications & Collaboration", "company_name": "SearchElect", "location": "Singapore (+1 other)", "via": "via Jobs", "description": "Contract type: Permanent\nLocation: Singapore\nIndustry:IT InfrastructureBusiness LevelMarketingIndustry\nREF: 37492\nContact name: Danica Pagsisihan\nContact email: danica@searchelect.com\nJob published: 1 day ago\nKey Words: Unified Communications, Microsoft, Partnerships, Product Management, Managed Services Sales, Solution Selling, Collaboration, Cloud Communications\nRole: Senior Product Manager – Unified Communications & Collaboration\nIndustry: Information and communications technology\nLocation: SingaporeAbout Our ClientOur client is a fully integrated info-communications company, offering a full range of information, communications and Technology services for both consumer and Enterprise markets offering the latest solutions. They are a digital ecosystem enabler with a solution-oriented approach and proven managed services capabilities with cutting edge platforms to take customers to the next level of intelligence powered by cloud, mobility, IoT, collaboration, security, and network... services. They are present in hundreds of countries around the world, serving thousands of customers, many among it are Fortune 500 customers.About the Senior Product Manager – Unified Communications & Collaboration\nMBA or bachelor’s degree in engineering, business, equivalent experience desirable. Excellent oral and written communications skills in English.\nProven experience in managed services sales, solution selling, complex sales, and managing enterprise customer negotiations and relationships.\nSales and sales overlay support experience in Microsoft Teams.\nSubject matter expertise in Unified Communications & Collaboration and knowledge of all leading vendor solutions and offerings\nExperience in a start-up environment and / or starting a new business in large organization.\nMicrosoft Certified Solutions Expert: Communication (advantage); or other Microsoft certifications preferably around communication, messaging and/or productivity\nBusiness management exposure or experience and understanding of P&L and cost models.\nAbility to achieve results through virtual teams of internal and external stakeholders.\nInternational experience and experience working in a multi-cultural environment.Responsibilities\nEnsure achievement of Territory financial and non-financial business objectives for Unified Communications & Collaboration.\nWork with Territory sales management to define and execute optimal go-to-market strategy and prioritization for key geographies and market segments. Should drive consideration and planning based on market size / potential, direct and partner strategies, network access, cost structures, and go-to-market and sales strategy, and partner selection.\nDevelop internal training and supporting documentation necessary, and leverage respective product managers and engineering, to train the company and partner sales, commercial management, solution architects, and others involved in selling and supporting service offerings, and on necessary processes.\nInstitute pre-sales process involving Sales, Business Development Managers, Presales Engineers, and Commercial management, and ensure all relevant stakeholders are adequately trained on service offering, value proposition, and sales process. Aim to enable all teams to handle 80% of all requirements by leveraging templates and other materials, with direct product engagement on remaining 20%. Work with services operations teams to ensure appropriate level of operational review and approval on non-standard bids in region.\nAct as subject matter expert, support resource, and escalation point in support of individual deals for both the company and partner. Provide hands-on support in preparation of bid responses for large, complex, or unique deal requirements. Act as gatekeeper in qualification process where necessary, and lead effort to position product effectively with qualified prospects with solution selling process.\nOverall responsibility for definition and execution of localization requirements. Work with product managers and services engineering team to ensure optimal localization.\nDevelop and/or adapt presentations, proposal templates, costing models, and other materials necessary to support all stages of the sales cycle in the Territory. Work with respective product managers to maintain library of approved documentation and other materials for service offering for Territory, including templates for items such as contracts, proposals, presentations, sales materials, end-customer terms and conditions.\nManage relationship with major partner product functions based in territory. Ensure adequate promotion of and support for the company with partner and ensure alignment and active engagement in sales process.\nWork with product managers to determine appropriate pricing strategy, including bundling with other offerings, packaged offers, subscription and metered billing, wholesale or inter-carrier pricing models, and on-net / off-net models for the Territory. Maintain Territory price book and work with other product managers to ensure it is accurately captured in order management and billing systems.\nSupport and work with Business Development Managers and other product managers to define ideal alliance partner strategy including preferred carrier partners, business models and negotiation of relationships. Ensure appropriate resourcing and governance and actively support implementation and execution of agreements with carrier partners.\nWork with product marketing and corporate communications to develop and execute marketing and PR plan, including press releases, events, advertising, partner and vendor program support, and enterprise customer programs for Territory. Support and help to coordinate coordinating budgeting, planning, and branding approvals internally and with partner organizations.About YouPlease note: Interested Applicants must be able to work in Singapore.\nYou spot opportunities to drive business growth for our brand and our customers, making sure the company’s brand is always protected, enhanced, and elevated.\nYou focus on result & impact that your actions have on your business & customers, making agile changes to your plans to meet evolving business needs.\nAs a team, we embrace new ideas, challenges and change with positivity and a hands-on approach.\nHandles ambiguity well and can manage stakeholders through such situations.\nCapable of identifying key business opportunities and resolve issues and manage priorities and focusing on these to deliver required results with minimal direction and supervision.Personal Attributes\nExcellent oral, written, presentation, and overall communication skills.\nCreativity, flexibility, and openness to alternative approaches\nAbility to set priorities, develop and execute a clear and concise plan, and drive execution.If you are interested to learn more about the above job role or any other job opportunities, please apply to this job advertisement or alternatively contact the following consultant:\nDanica Pagsisihan\n+65 65898787\ndanica@searchelect.com", "extensions": ["24 days ago", "Full–time"], "detected_extensions": {"posted_at": "24 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgUHJvZHVjdCBNYW5hZ2VyIOKAkyBVbmlmaWVkIENvbW11bmljYXRpb25zIFx1MDAyNiBDb2xsYWJvcmF0aW9uIiwiY29tcGFueV9uYW1lIjoiU2VhcmNoRWxlY3QiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjY2TUR2WW0xUW94UDA5UmVBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9icyIsImxpbmsiOiJodHRwczovL3NnLmZpZGFudG8uY29tL2pvYnMvam9iLW9wZW5pbmcvbWFuYWdlcnMtYWxsLW90aGVyL3Nlbmlvci1wcm9kdWN0LW1hbmFnZXItdW5pZmllZC1jb21tdW5pY2F0aW9ucy1jb2xsYWJvcmF0aW9uLTI2MjkyNDE1OD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior/product Innovation Manager, Product Innovation", "company_name": "M1 Limited", "location": "Singapore", "via": "via MNC Jobs Singapore | MNC Jobs In Singapore", "description": "Job ID: DO-PM-PI-1 Job Type: Full Time Job Classification: Senior / Manager Department: Digital Office Function: Product Management Location: Jurong Years of Experience:\nJob Responsibilities/Requirements:\nM1 is Singapore’s most vibrant and dynamic communications company, providing mobile and fixed services to over two million customers. Since the launch of commercial services in 1997, we have achieved many firsts, including the first operator to offer nationwide 4G service, as well as ultra high-speed fixed broadband, fixed voice and other services on the Next Generation Nationwide Broadband Network. With a continual focus on network quality, customer service, value and innovation, M1 links anyone and anything; anytime, anywhere.\nM1’s Vision is to become a Digital telco that is cloud enabled and leading in customer experience, partner of choice and attracting talent to create new digital capabilities.\nThe Product Innovation Lab seeks to establish M1 as an innovative organization... across both Consumer and Business portfolios as recognized by our partners, channels, people and most importantly our customers. The Product Innovation Lab comprises a cross functional team across innovation partnerships, product management, digital experience and software engineering. Innovative solutions developed through the Lab will drive the vision in creating incremental value for our customers, partners and our people across M1’s businesses.\nThis role will drive the introduction and co-creation of products in partnership with our customers and technology partners. Being part of M1’s digital transformation initiative, the role will have the opportunity to redefine our digital product experience tapping into M1’s new IT Ecosystem from enabling self-serve to overseeing the seamless integration into M1’s network or partner platform.\nROLE OBJECTIVES\nThe incumbent is responsible for scouting the innovation ecosystem, product evaluation and co-creation of next generation products to the market within the Product Innovation Lab. Reporting to the Head of Product Innovation, the incumbent will help to define the product strategy contributing to the commercial and brand success of both M1’s consumer and business portfolios:\n• Influence M1’s product strategy and plans\n• Provide thought leadership in identifying key innovation and technology trends across the globe and understand how it will influence M1’s businesses over time\n• Bridge business teams’ target markets, needs and overall business strategy with best in class products\n• Identify synergies with platform and other products on our path to become a Digital Telco\n• Create product funnel for new market offerings, driving profitable business growth and meet business targets\n• Identify and drive value proposition of new products and how they will bring commercial value that contributes to M1’s next wave of growth\n• Be the technology lead and be the effective bridge between business and technical audiences\n• Co-develop product solutions with partners\n• Drive a seamless experience for our customers across the whole product lifecycle\n• Be part of M1’s digital transformation drivers\n\nROLE ACCOUNTABILITY\n• Be a key leader and mentor within the Product Innovation Lab\n• Create awareness within the innovation ecosystem of M1 as the partner of choice to bring new products into the Singapore and regional markets\n• Ensure that we are constantly across the latest innovation and technology trends globally\n• Identify areas for growth and create strategic product line roadmaps to help drive adoption of the product and differentiating features\n• Understand M1’s business strategies, needs and challenges across consumer and business portfolios\n• Map innovative solutions and new technologies to M1’s business needs and use cases\n• Identify and evaluate potential solution partners to create new market offerings, driving profitable business growth and meet business targets\n• Evaluate and build new capabilities which will enhance M1’s new IT Ecosystem\n• Be a M1’s digital telco platform expert and enable the integration of M1’s new products into our new IT Ecosystem\n• Prototype and customize different solutions within the Product Innovation Lab\n• Collaborate closely with internal stakeholders on the development, proof-of-concepts, and release of products\n• Partner relationship management\n• Conduct customer research activities to determine gaps in service\n\nKEY REQUIREMENTS\n• A Bachelor Degree with 7 to 12 years of experience in product management and innovation related roles\n• Certification in Design Thinking, Agile, Lean methodologies or similar is preferred\n• Experience in launching products in both B2C and B2B segments would be highly preferred\n• Ability to demonstrate having a strong grasp of the innovation ecosystem (accelerators/incubators/co-working spaces/innovation labs/start-ups), venture capitals (VCs/CVCs), consultancy and strategic partnerships is highly preferred\n• Knowledge and experience in working and integrating with telecommunication related systems (OSS/BSS)\n• Experience in innovative product development methodologies such as Design Thinking, Agile, Lean\n• Demonstrate strong leadership skills in managing and mentoring teams\n• Self-driven and can work within diverse and cross-functional teams\n• Strong ability to understand and articulate both technical and business requirements\n• Recognized for creativity and disruption of traditional trends and ways of working\n• Adept influencer, internally and externally\n• Strong quantitative and qualitative analytical skills and the ability to derive insight from research and findings and to develop a product proposition\n• Results driven with the flexibility to adapt/realign direction as required in this dynamic technology industry\n• Demonstrate strong sense of ownership\n• Cultural sensitivity and ability to work with customers, teams and partners\n• Proven ability to put customers at the heart of the business\n• Excellent organisational and time management skills with attention to detail and good problem-solving skills\n• Strong written and spoken communication skills and be comfortable interacting with Senior Management", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IvcHJvZHVjdCBJbm5vdmF0aW9uIE1hbmFnZXIsIFByb2R1Y3QgSW5ub3ZhdGlvbiIsImNvbXBhbnlfbmFtZSI6Ik0xIExpbWl0ZWQiLCJjb21wYW55X21pZCI6Ii9tLzA1bjQ4NiIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IlBiV3Iwc2U5cFhpLXF0NVFBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV0OEJDcUlCUVU1VlgwNXhWRlJOYURSblRscGlTMVpzVjNsSldFSktXSFo0YlZoRlRHZFpTa2xhWmtWa2VEQkdkMDF5UlVkU1ZEQlhlV2N0VjFkdk9HMVVXalpXVWtJMWFqbGhiR2MzWkZkbU1UTnhSSGRCYURkalIyazFhVzlNWm5WTVUyYzNNV05tZHpKbFprUmFNblJaUzFaT00ycG5USFY0Y2t0RGN6Z3RXWHB1TTNGR1QzSXRNMlpwYTFablYzcHBUbEo1Y0ZKVFlUQTFUekYyVlhwSWEzRk1kakpSRWhSZlNHMURXVXhhU0RWbGRURkNjell0Y2pWQlFob2lRVTlOV1ZKM1ExSlRhRzgxTkROamJtdDNPWGx4VEc1aGFWOW9SMlpJZGpJemR3IiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNTQiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTU5DIEpvYnMgU2luZ2Fwb3JlIHwgTU5DIEpvYnMgSW4gU2luZ2Fwb3JlIiwibGluayI6Imh0dHBzOi8vc2cubW5jam9iei5jb20vam9icy9zZW5pb3Jwcm9kdWN0LWlubm92YXRpb24tbWFuYWdlci1wcm9kdWN0LWlubm92YXRpb24tanVyb25nLTE1NTEyOD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Product Manager, Auction and Delivery Ads", "company_name": "TikTok", "location": "Singapore", "via": "via Bayt.com", "description": "The mission of TikTok Ads Platform is to connect global advertisers and users, advertisers of any industry and experience level are able to get suitable marketing solutions, then easily create, manage and optimize ads. The Core Ads team is looking for an experienced Product Manager to build highly scalable machine learning products that determine what ads billions of TikTok users see and engage with. You will be responsible for helping 'millions' of advertisers improve their return on ad spend, growing overall monetization efficiency, and protecting the experience of our users, creators and community through industry leading recommendation system. Responsibilities:\n1. Build next-gen bidding, budget and automation ad products\n2. Improve ad personalization, relevance and ranking\n3. Optimize ad inventory strategy for revenue and user experience\n4. Shape delivery insights that shed light on ML system for marketers and brands\n5. Enable advertisers to achieve true business value with upper... and lower funnel objectives\n6. Grow advertiser retention via enhanced delivery experience and higher ROI\n\nQualifications\n1. BA/BS degree in Computer Science, EE, Mathematics or Statistics, or equivalent practical experience. Experience with machine learning/ recommendation system a plus.\n2. At least 3-5 years of commercial experience in a product management role, with demonstrated leadership in the management of a product (or portfolio of products) through the software development lifecycle, from conception to launch to ongoing performance measurement and optimization.\n3. Fast learner with a good sense of judgment and original thinking.\n4. Highly analytical with excellent communication, organizational skills", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9kdWN0IE1hbmFnZXIsIEF1Y3Rpb24gYW5kIERlbGl2ZXJ5IEFkcyIsImNvbXBhbnlfbmFtZSI6IlRpa1RvayIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiWG91WkRNcXI0TWFrRFFCdUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCYXl0LmNvbSIsImxpbmsiOiJodHRwczovL3d3dy5iYXl0LmNvbS9lbi9zaW5nYXBvcmUvam9icy9wcm9kdWN0LW1hbmFnZXItYXVjdGlvbi1hbmQtZGVsaXZlcnktYWRzLTU4NzQyNjIyLz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Product Manager - Ratings & Credit Content", "company_name": "S&P Global", "location": "Singapore", "via": "via Laimoon.com", "description": "S&P Global Market Intelligence\n\nThe Role: Product Management - GTM and Strategy\n\nThe Location: Singapore\n\nThe Team: The team is responsible for defining and implementing the go-to-market approach as well as the market strategy of the Credit Risk Solutions business in Asia-Pacific. The team works on day-to-day management and long term strategic planning and execution in all markets, supporting sales strategies, go-to-market, and product development regionally.\n\nThe Impact: This role is responsible for maintaining and growing the Credit Risk Solutions business in the Asia-Pacific region as a key member of the Credit Risk Solutions team.\n\nWhat's in it for you:\n• Opportunity to help lead the long term strategic credit initiatives in the Asia-Pacific region\n• Work closely with a broad group of stakeholders to launch new products and grow the business in the region\n• Be part of a highly skilled team focusing on both developed and developing credit and capital markets\n• Regional role with... opportunity to travel and interact with different facets of the business as conditions allow\nResponsibilities: Help oversee the management of the Credit Risk Solutions product line in Asia-Pacific with responsibility for day-to-day management of the market strategy and go-to-market plan. Work with key stakeholders across commercial, marketing, product, technology and senior management in order to provide local management for the Credit Risk Solutions business line within the Asia-Pacific region. Act as a subject matter expert in client meetings. Develop and author thought leadership articles which address market problems and articulate the value of our capabilities. Represent S&P Global Market Intelligence in market facing presentations, events and webinars on credit risk topics.\n\nWhat We're Looking For:\n• 5+ years of product management experience\n• University education, ideally with a focus on economics or finance\n• Experience in financial services, in particular in the Credit space\n• Experience working on a globally located team and coordinating across time zones\n• Experience working to launch products in different markets and grow existing business lines within Asia-Pacific\n• Ability to work closely within a team but also be able to work independently with little supervision\n• Strong client-facing and presentation skills\nS&P Global Market Intelligence\n\nAt S&P Global Market Intelligence, we know that not all information is important-some of it is vital. Accurate, deep and insightful. We integrate financial and industry data, research and news into tools that help track performance, generate alpha, identify investment ideas, understand competitive and industry dynamics, perform valuation and assess credit risk. Investment professionals, government agencies, corporations and universities globally can gain the intelligence essential to making business and financial decisions with conviction.\n\nS&P Global Market Intelligence is a division of S&P Global (NYSE: SPGI), which provides essential intelligence for individuals, companies and governments to make decisions with confidence. For more information, visit www.spglobal.com/marketintelligence.\n\nS&P Global is an equal opportunity employer committed to making all employment decisions without regard to race/ethnicity, sex, pregnancy, gender identity or expression, color, creed, religion, national origin, age, disability, marital status (including domestic partnerships and civil unions), sexual orientation, military veteran status, unemployment status, or other legally protected categories, subject to applicable law.\n\n20 - Professional (EEO-2 Job Categories-United States of America), PDMGDV202.2 - Middle Professional Tier II (EEO Job Group), SWP Priority - Ratings - (Strategic Workforce Planning)\n\nJob ID: 259485\nPosted On: 2021-02-08\nLocation: Singapore, Singapore\nTechnology", "extensions": ["17 days ago", "Full–time"], "detected_extensions": {"posted_at": "17 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9kdWN0IE1hbmFnZXIgLSBSYXRpbmdzIFx1MDAyNiBDcmVkaXQgQ29udGVudCIsImNvbXBhbnlfbmFtZSI6IlNcdTAwMjZQIEdsb2JhbCIsImNvbXBhbnlfbWlkIjoiL20vMDJfbmw0IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiQXNTelA5dDR3TGxkVXFrdkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXQ4QkNxSUJRVTVWWDA1eFVtZFZhVEZXVEdWYU9YYzRUbU5ZWlZCRVQyRkZVVkpHYkdNMVlUQllVVE01UW5SWFRUWmhVVE5QVkhwMFQwbFFjalJxVmtJdGIybHpVMHhRTUVoMVJVd3dVMEZWYzBKYVowdHRXazFLYm5ReFNEWm9WVFJrYlhGNFVuWnRNUzF1YUZOYWFrdE5Ta0p0WTE5ZlFVb3hiVWgxZGtWNWRrWkNOVE5aVHpWS1YwdGZUMU10ZEVWa2RIbzRVakZtVFZKa01VNVpOVFoxTVhNMFFYaEJFaFJmU0cxRFdVeGFTRFZsZFRGQ2N6WXRjalZCUWhvaVFVOU5XVkozUkVSU1dHSk9kMnAwUTNBeWQwUkxVM2huYTBwSE5ubEtlRlF6VVEiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY182NiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMYWltb29uLmNvbSIsImxpbmsiOiJodHRwczovL2pvYnMubGFpbW9vbi5jb20vam9icy9leHRlcm5hbHZpZXcvMjQ0NTAwMjE/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Management", "value": "GC18"}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Business Operations", "value": "GC06"}, {"text": "Advertising and Marketing", "value": "GC03"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Accounting and Finance", "value": "GC01"}, {"text": "Legal", "value": "GC17"}, {"text": "Farming and Outdoors", "value": "GC13"}, {"text": "Human Resources", "value": "GC15"}, {"text": "Media, Communications and Writing", "value": "GC20"}, {"text": "Sales and Retail", "value": "GC26"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "Product manager", "value": "product manager"}, {"text": "Manager", "value": "manager"}, {"text": "Production manager", "value": "production manager"}, {"text": "Project manager", "value": "project manager"}, {"text": "Senior", "value": "senior"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Director", "value": "director"}, {"text": "Manufacturing manager", "value": "manufacturing manager"}, {"text": "Marketing manager", "value": "marketing manager"}, {"text": "Plant manager", "value": "plant manager"}, {"text": "Program manager", "value": "program manager"}, {"text": "Regional", "value": "regional"}, {"text": "Sr. manager", "value": "sr. manager"}, {"text": "Account manager", "value": "account manager"}, {"text": "Admin manager", "value": "admin manager"}, {"text": "Affairs manager", "value": "affairs manager"}, {"text": "Assistant", "value": "assistant"}, {"text": "Brand manager", "value": "brand manager"}, {"text": "Commodity manager", "value": "commodity manager"}, {"text": "Communication", "value": "communication"}, {"text": "Customer", "value": "customer"}, {"text": "Dealer", "value": "dealer"}, {"text": "Development manager", "value": "development manager"}, {"text": "Devops engineer", "value": "devops engineer"}, {"text": "Engineering", "value": "engineering"}, {"text": "Executive", "value": "executive"}, {"text": "Product specialist", "value": "product specialist"}, {"text": "Production supervisor", "value": "production supervisor"}, {"text": "Risk manager", "value": "risk manager"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Transactional", "value": "transactional"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Internship", "value": "INTERN"}, {"text": "Part-time", "value": "PARTTIME"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Toiletries", "value": "/business/naics2007/3256"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Foods & Beverages", "value": "/business/naics2007/311"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Management", "value": "/business/naics2007/55"}, {"text": "Research", "value": "/business/naics2007/5417"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "Citi", "value": "/m/01dfb6"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "Binance", "value": "/g/11hcz1r4wl"}, {"text": "Amazon", "value": "/m/0mgkg"}, {"text": "Standard Chartered", "value": "/m/02hszk"}, {"text": "United Overseas Bank", "value": "/m/04gjd1"}, {"text": "Apple", "value": "/m/0k8z"}, {"text": "DBS Bank", "value": "/m/01q7n5"}, {"text": "Tata Communications", "value": "/m/04338k"}, {"text": "Workato", "value": "/g/11dxpy_3xd"}, {"text": "BNY Mellon", "value": "/m/02vps5x"}, {"text": "EPAM Systems", "value": "/m/0dlnrc"}, {"text": "GVT Government Technology Agency (GovTech)", "value": "/g/11gh0528nq"}, {"text": "Paypal", "value": "/g/122s91_5"}, {"text": "PeopleSearch Pte Ltd", "value": "/g/11c73ngn0w"}, {"text": "Randstad", "value": "/m/08pt1z"}, {"text": "Singapore Airlines", "value": "/m/015f2x"}, {"text": "TEKsystems (Allegis Group Singapore Pte Ltd)", "value": "/g/11b6g4bkv0"}, {"text": "ABBOTT LABORATORIES (SINGAPORE ) PRIVATE LIMITED", "value": "/m/09m57z3"}, {"text": "ADVANCE INTELLIGENCE PTE. LTD.", "value": "/g/11dymfkxss"}, {"text": "AXA", "value": "/m/04mn99"}, {"text": "Adecco Personnel Pte Ltd", "value": "/m/08gz46"}, {"text": "Adidas Group", "value": "/m/01jtml"}, {"text": "Agency for Science, Technology and Research", "value": "/m/0gmjcg"}, {"text": "Alibaba", "value": "/m/07s6ctl"}, {"text": "Argyll Scott", "value": "/g/11dxpk2374"}, {"text": "Autodesk", "value": "/m/018nm3"}, {"text": "Bank of Singapore", "value": "/m/0r3vczm"}, {"text": "Barry Callebaut", "value": "/m/03clky2"}, {"text": "BioMind", "value": "/g/11dymfr2l6"}, {"text": "CHUBB ASIA PACIFIC PTE. LTD.", "value": "/m/09m8xyh"}, {"text": "Cargobase", "value": "/g/11dxppfsjn"}, {"text": "Cargobase Pte Ltd", "value": "/g/11fy240nxm"}, {"text": "DKSH", "value": "/m/0dj2nh"}, {"text": "Dathena", "value": "/g/11dxprdn6y"}, {"text": "Dyson", "value": "/m/05cskg"}, {"text": "Enggsol Pte Ltd", "value": "/g/11g9mnfmm1"}, {"text": "Ethos BeathChapman", "value": "/g/11c73z0xm0"}, {"text": "Eu Yan Sang", "value": "/m/03cl9hn"}, {"text": "Flintex Consulting Pte. Ltd.", "value": "/g/11h1z41pzb"}, {"text": "GIVAUDAN SINGAPORE PTE LTD", "value": "/g/11f00wn519"}, {"text": "Goldman Sachs", "value": "/m/01xdn1"}, {"text": "GovTech Singapore", "value": "/g/11dxpkfs_6"}]}]}