{"search_metadata": {"id": "608278e02c687849bb1e15ce", "status": "Success", "json_endpoint": "https://serpapi.com/searches/2270cfdd4181d260/608278e02c687849bb1e15ce.json", "created_at": "2021-04-23 07:36:00 UTC", "processed_at": "2021-04-23 07:36:00 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28IT+analyst%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=10", "raw_html_file": "https://serpapi.com/searches/2270cfdd4181d260/608278e02c687849bb1e15ce.html", "total_time_taken": 2.27}, "search_parameters": {"q": "(IT analyst) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "10"}, "jobs_results": [{"title": "Business Process Analyst (Asia Pacific)", "company_name": "NTT", "location": "Singapore", "via": "via Jobs", "description": "In a constantly changing world, we work together with our people, clients and communities to enable them to fulfill their potential to do great things. We believe that by bringing everyone together, we can solve problems using innovative technology that can create a world that is sustainable and secure. At NTT, we encourage you to remain continuously curious, as that is what keeps you fast, flexible and relevant. No two days will be the same but that is what will help you grow and realize your full potential.The power is in your hands to do great things. It’s time to lead the change, be the authentic you, to solve difficult challenges, to set the pace of change and to unleash your potential. Want to be a part of our team? Plans, performs and implements process improvement initiatives (such as Lean or Six Sigma). Diagrams and evaluates existing processes. Organizes, leads and facilitates cross-functional project teams. Develops metrics that provide data for process measurement... identifying indicators for future improvement opportunities. Collects data to identify root cause of problems. Measures performance against process requirements. Aligns improvement to performance shortfalls. Provides consultation on the use of re-engineering techniques to improve process performance and product quality. May deliver presentations and training courses including measurement, analysis, improvement and control. Surveys and analyzes best practices for techniques and processes. Communicates team progress. Performs cost and benefit analyses. Survey Tip: Employees at the highest levels typically have Six Sigma Black Belt or Master certification. Working at NTT Individuals in this position are responsible for the governance of process performance and process change. He/She will be accountable for process or assigned processes from end-to-end which includes implementation, maintenance and improvement of this process.Drives process improvement initiatives through the disciplined use of measurements, accountability, analysis and discussion of process alternatives in order to arrive at best practices. Will provide operational support for a business segment, group or team. Brings expertise or identifies subject matter experts in support of multi-functional efforts in process improvement, data capture and analysis, infrastructure support, tool ownership and compliance with procedures, etc. Advises business groups by providing strategic direction to initiative prioritization, integration and resource application. Ensures that policies and procedures align with corporate vision.Key roles and responsibilities:Development and documentation of an end-to-end processes aligned to policiesBenchmark processes against industry leaders and identify external best practices.Accountable for the overall performance and results of the process.Ensure the identification and management of critical process success factors.Manage process improvements, including opportunities for automation of process steps and data driven performance measures.Conduct process reviews and approve or reject process deviation requests.Agree on process responsibilities across organisational silos and drive adherence to the process.Reporting of process status, related KPI’s and progress to peers and executives.Facilitation, resolution of escalated cross-functional issues.Representation of the process to all external groups.Identify training needs and ensure that process owners educate relevant end users to operate processes effectively.General knowledge, skills and attributes:Expert knowledge on processes and up and downstream impact of process stepsFluent in change management and continuous improvement methods, such as Six Sigma or LeanExcellent problem solving and root cause analysis abilityComfortable with ambiguity and changeAbility to develop and entrench change techniques in an organisation Possess required technical skills Ability to make decisions fast and establish rules towards proper business management Qualifications and certifications:Relevant Bachelor’s degreeProject Management certificationSix Sigma or Lean or equivalent type certification Work experience:Significant relevant work experience combined with functional knowledge of work streamsExperience with project management methods like Scrum or AgileExperience constructing business process methodology toolbox What will make you a good fit for the role? Standard career level descriptor for job level:• Seasoned and experienced professional• Has full understanding of specialisation area• Resolves wide range of issues in creative ways• Fully qualified, career level, career journey-orientated• Uses good judgement in selecting tools and methods to solve problems• Networks with senior internal and external people in own area of expertise• Receives little instruction on day-to-day work, receives general instructions on new assignments• Typically requires demonstrable related experience with a Bachelor’s or equivalent degree; or moderate level experience or equivalent work experience Join our growing global team and accelerate your career with us. Apply today. Equal opportunity employer NTT is proud to be an equal opportunity employer with a global culture that embraces diversity. We are committed to providing an environment free of unfair discrimination and harassment. We do not discriminate based on age, race, color, sex, religion, national origin, disability, pregnancy, marital status, sexual orientation, gender reassignment, veteran status, or other protected category", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJCdXNpbmVzcyBQcm9jZXNzIEFuYWx5c3QgKEFzaWEgUGFjaWZpYykiLCJjb21wYW55X25hbWUiOiJOVFQiLCJjb21wYW55X21pZCI6Ii9tLzAxYzNmcSIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImJ0ZnhfRVFDV002N2k4OHVBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVzc0JDb3dCUVU1VlgwNXhVVmhDZW5aRWFHNXROSEI2V0VWaVlWQTBZWFJqVDBaV2JFbDJORlptUTJabFJ6RTBUREZ0UjJNNU9URlhjSEpFWTFocE0yYzBRVXg2VVZOVmRGQkdiemhUZEhsTllYcGhYMk5DUlY4NFlWRXdNWGg2Y0MxRFdVWlpkVlp2UmxKRmMybFRiRWwxWDFKU1NqaEVha1J6TjJvdGRuWTVOa3ROVjFKcFprZFdjV2REVXpaM05Gb1NGalJZYVVOWlRVeFdUMlJJU1hOQldGQjRjRk5aUTNjYUlrRlBUVmxTZDBGeE0xWmFUMFUzVkdwb1RFdHZXREJSU214UFkzZFNVblYwTjBFIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIiwibGluayI6Imh0dHBzOi8vc2cuZmlkYW50by5jb20vam9icy9qb2Itb3BlbmluZy9jb21wdXRlci1zeXN0ZW1zLWFuYWx5c3RzL2J1c2luZXNzLXByb2Nlc3MtYW5hbHlzdC1hc2lhLXBhY2lmaWMtMjc3ODg4NzA5P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Senior Data Analyst", "company_name": "Burpple", "location": "Singapore", "via": "via NodeFlair", "description": "Burpple is seeking a Data Scientist. We are looking for a passionate certified Data Analyst. The successful candidate will turn data into information, information into insight and insight into business decisions. The job is to be the\"data eyes and ears\" guiding the product team.\n\nThe Role Objective\n• Defining new opportunities for product impact Influencing product and sales to solve the most impactful market problems.\n• Apply your expertise in quantitative analysis and the presentation of data to see beyond the numbers and understand how our users interact with our products.\n• Work as a key member of the product team to solve problems and identify trends and opportunities.\n• Inform, influence, support, and execute our product decisions and product launches.\n• Set KPIs and goals, design and evaluate experiments, monitor key product metrics, understand root causes of changes in metrics.\n• Exploratory analysis to discover new opportunities: understanding ecosystems, user behaviours, and... long-term trends Identifying levers to help move key metrics.\n\nResponsibilities\n• Product Strategy : Evaluate and define product and business KPIs and metrics along with Product Managers and Product Designers.\n• Data Visualization: Democratize data by building customized dashboards & reports for relevant stakeholders.\n• Analysis: Offer deep dive analysis to key stakeholders across all teams and products, in order to determine product features and UX optimization strategies.\n• Respond to data and product related inquiries in real-time to support business and technical teams\n• Provide data solutions, tools, and capabilities to enable self-service frameworks for data consumers\n• Responsible for developing and executing tools to monitor and report on data quality\n• Responsible for establishing appreciation and adherence to the principles of data quality management, including metadata, lineage, and business definitions\n• Build Machine Learning models to predict behaviour of users\n\nRequired Qualifications\n• Overall, 5 years of experience with at least 1 year of experience specifically in Product Analytics, preferably in e-commerce\n• You've master’s degree in Business Analytics, statistics, mathematics, economics, computer science or an equivalent education or possess relevant practical experience\n• Strong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracy\n• Strong knowledge of and experience with reporting packages (Business Objects etc), databases (SQL etc), programming (Python,R & ETL frameworks)\n• A/B Testing: Experience designing experiments and analyzing results with a solid background in statistics\n• Tracking Technologies: Google Analytics (Preferably IQ certified) or similar alternatives e.g. Adobe Analytics, Mixpanel, Amplitude\n• Should understand Machine Learning Algorithms\n• Excellent attention to detail can-do attitude with a relentless focus to get things done. Data needs to be precise. Conclusions drawn from data analysis will drive critical client decisions.\n• Demonstrated analytical skills. Ability to work with large amounts of data: facts, figures, and number crunching. Ability to see through the data and analyze it to find conclusions", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgRGF0YSBBbmFseXN0IiwiY29tcGFueV9uYW1lIjoiQnVycHBsZSIsImNvbXBhbnlfbWlkIjoiL2cvMTFkeHBzNXl2NSIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Im1DcDYweW0tZWhiUmtDLUFBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhVazV0UkZBdFQwZGZZVE15ZW1jMVJXNXNaM2xNUTIxQk1WUklYMlpwVm1OWFpFRlhkWEY1VjNSS05FOURkMEZhV0RCRFpIRkVkbFUyTldsTVowUlphVVJMU0hac2QzWjNRMDkxTUdSZloya3hkMFJKYXpCbFJ6TkRMVUpPZWxKVFZ6RXROVkp1VkcwdE5WQkxhbXd0TnpCbWFUTktUWFJHZEd4alpqVXhTME0yUVRCSFYySjZiRk5FVW1nMVlUSm9SbXBSYTFOTmJDMTBlR3huRWhZMFdHbERXVTFNVms5a1NFbHpRVmhRZUhCVFdVTjNHaUpCVDAxWlVuZEJXRkV6Y2sxWFJFTk5YM1E0ZFZkRExXVkdTREJqVERSWWRqWkIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18xMyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBOb2RlRmxhaXIiLCJsaW5rIjoiaHR0cHM6Ly9ub2RlZmxhaXIuY29tL2pvYnMvbGlzdGluZ3MvMTI3OTE/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Cyber Security Analyst", "company_name": "Volt Singapore", "location": "Singapore", "via": "via Volt Singapore", "description": "Cyber Security Defensive Operation Analyst\n\nLooking for someone with strong experience/knowledge regarding network incident response. You must be able to advise/articulate how suspicious traffic is investigated, triaged, or remediated during an incident involving hacking tools.\n\nThis is a full-time position, salary range is $5000-6800, with additional allowances and bonuses. The working hours are 9am to 6pm, with an once a month shift scheduling from 7am to 7pm.\n\nRole and Responsibilities:\n• Conduct technical analysis and triage based on triggered alerts to determine the severity, impact, scope and corresponding response actions.\n• In-depth analysis and processing Open Source Threat Intelligence (OSINT) and Intelligence sources to assess cybersecurity threats, the risk associated and the organizational impact.\n• Working closely with the Threat Intelligence team to enhance contextualization capabilities and improve monitoring scope\n• Acting as a point of contact to internal... stakeholders and vendors by emails and incident reporting hotline.\n• This role involves working over the weekends (12 hours shifts with three days off-in-lieu after the shift)\n\nQualifications:\n• Degree from a university or significant course work in Computer Science, Networking, engineering or other computer-related fields of study.\n• One or more of the following professional certification is beneficial: CGEIT, GCIH or similar.\n• Proficient understanding of cyber and IT security risk, threat and prevention measure.\n• Proficient understanding of networking and network security technologies.\n• Good understanding of Threat Intelligence utilization towards incident response\n• Good knowledge of security standards and best practices\n• Good understanding of various operating systems\n• Good understanding of the Cyber Kill Chain and the ability to display clear analytical skills.\n• Previous experience in a corporate or enterprise environment, engaging with and responding to a diverse array of internal stakeholders, including senior management.\n• Knowledge of Microsoft Office suite (Word, Excel, PowerPoint and Access)\n• Knowledge of Splunk is beneficial\n\nPlease send your resume in WORD format by clicking the apply button below or contact Ronald Cheung on +65 6701 1521 for a confidential discussion. Please note that only short-listed candidates will be contacted.CEI Reg. Number R2090722 (Cheung Ronald", "extensions": ["2 days ago", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDeWJlciBTZWN1cml0eSBBbmFseXN0IiwiY29tcGFueV9uYW1lIjoiVm9sdCBTaW5nYXBvcmUiLCJjb21wYW55X21pZCI6Ii9nLzExZzd6MDVrYzMiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJpdkVSWWNXZUotcHVYSDFqQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdllCQ3JjQlFVNVZYMDV4VTJsMFpWaGxPRzFTVVRKQldrMWZWM0UxYmtOQk56VTFjbXRoZFRsbVVHVTNiV2xsUjJRNVluQjFWM0o0VkhZelJrZHRiVWs0U0dwNWQxSmxkMHRPU1VaRFQyVmxMVmQzWm5SMlRpMXhTWGxXY0dsNk1scDNVbWhYWVhwMlZERnBhR2xNU1RSdFkycHpZbHBXYTBoaVIxVnFkMUF3V1dOVU1XUjRlbTlXT1ZoM1ltVndhalppU21jd1oyUkJRMHRvVWtaRWIzbzRSblF5UnpFeWJVbHFXRVpwUlhWVWRVZElRMGR5TjNabFZFZ3dFaFkwV0dsRFdVMU1WazlrU0VselFWaFFlSEJUV1VOM0dpSkJUMDFaVW5kRGJGWlZVRzUxVUdVME1GaHpUbEpLWms1dFpXWkJYMmt3UlRGbiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzIwIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFZvbHQgU2luZ2Fwb3JlIiwibGluayI6Imh0dHBzOi8vd3d3LnZvbHRpbnRlcm5hdGlvbmFsLmNvbS5zZy9qb2IvY3liZXItc2VjdXJpdHktYW5hbHlzdC0xNi8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Senior System Analyst", "company_name": "RHB Singapore", "location": "Singapore", "via": "via SmartRecruiters Jobs", "description": "Company Description\n• RHB Singapore is a progressive and growing financial organization. We are committed to creating a fulfilling, dynamic and engaging work environment for our team of more than 15,000 employees across nine locations in ASEAN, China and Hong Kong.\n\nJob Description\n\nPrimary Objective\n\nCustodian and system expert who can advise, analyze, plan, implement, maintain, support (and retire/refresh where required) all locally hosted (On premise, Cloud) business applications and platforms required to run Singapore operations:\nCommon to all Senior System Analyst\n• Maintain and ensure business application running in production are kept running and supported in a healthy state;\n• Analyze and recommend new application and platform acquisitions to meet evolving Singapore Operation’s needs based on capturing and documenting business requirements elicited from business stakeholders\n• Where the business application is in-house developed do the required coding and development... otherwise engage with 3rd party vendor to get enhancements developed and then deploy into test and prod when ready\n• Ensure IT is operated in a manner that complies with Bank Policies and frameworks, standards, circulars, guidelines and MAS regulated act, notices, circulars, and guidelines applicable to technology (Compliance, Audit, Risk Adherence). – Application and Platforms\n• Ensure IT assets are protected and secure – Applications and Platforms\n• Assist in annual budgeting – Applications and Platforms\n• Be a key stakeholder and technology partner on the bank Digital journey.\n• Foster and champion bank PRIDE values within the technology department and imbue the department with a culture of teamwork, innovation, discipline, resiliency and dedication to how work is approached.\n• Where vendor based solution approach adopted and/or outsourced approach, arrange due diligence and assessment from technology perspective on behalf of users.\n• Provide day-to-day support to business users on any application system issues or constraints\n• Ensure assigned application deployments running on bank managed environments are properly QA and meet conditions.\n• Co-ordinate the setup and manage test environments to ensure business can do their enhancements and new projects testing for assign applications.\n\nSpecific to Senior System Analyst\n\nSenior System Analysts are assigned to specialize in one of the following groupings of business applications and platforms:\n• Core Systems: Back-office systems such as core banking systems (Customer, Statements, Loans/Limits, Deposit, GL, Branch Banking, Trade, Asset Based Financing) and In-house Systems (loans related, bank notes system, Safe deposit box, excel based).\n• Digital and Payments: Digital, Payments and Channel systems such as Mobile Banking (MBK), SOA / API and Messaging platforms, UAS/E2EE/MFA customer token platform, Digital onboarding, ATMs, SWIFT/MEPS+, G3 Fast and Bulk Payments, Cheque processing system, Enterprise workflow system, document share system, RPA\n\nKey Responsibilities\n\nStrategy, Planning, Mgmt. Reporting\n• Provide expert advice and support to technology management in the area of expertise\n• Contribute in the formulation a comprehensive Branch IT strategy covering IT policies and procedures, security, architecture, business solutions and operational functional requirements\n• Keep abreast of developments and innovations in the FI IT landscape\n• Provide mentorship, support and guidance to colleagues, share information and facilitate problem solving\n• Contribute in the yearly budgeting for IT expenditures and investments.\n\nIT Operations\n• Ensure business applications running in production are healthy and functioning per expected.\n• Ensure prompt and efficient provision of IT support based on assigned area of expertise (includes request from Data center operations team)\n• Oversee contingency plans and ensure their adequacy\n• Ensure IT assets are protected and secure\n• Maintain and ensure timely renewal of digital certificates and proper lodgment with IT security team.\n• Ensure IT operations run in a manner consistent with high score from audit, risk, compliance assessments. The following to be operationalized as standard procedure against all IT asset components:\n\n– Administrative Accounts\n\n– All admin accounts lodged into PAM solution per group IT Security guidelines and MAS notice 655 point 4.1\n\n– Patching – Patch notification process established with vendors and patch calendar updated, upon patch release assessment and implementation as needed Per patching guidelines and MAS notice 655 point 4.2\n\n– Hardening - Per component definition and enforcement against SG security standard and Group IT Security guidelines and SG addendum/s and MAS notice 655 point 4.3\n\n– Network Perimeter Defense\n\n– Network traffic and segments, firewalls, proxies, dns, vpn access setup in secure manner per group IT security guidelines and MAS notice 655 4.4\n\n– Malware – IT Security consulted and all required IT security protections installed on IT assets per MAS notice 655 point 4.5\n\n– Multi-factor Authentication – MFA, where applicable implement MFA of administrative and internet accounts with access to customer information using PAM per MAS notice 655 point 4.6\n\n– Logging and Monitoring – Security, Capacity, Downtime, Audit – Capacity Mgmt. – Pre-emptive monitoring (via monitoring), planning and execution of capacity upgrades as needed\n\n– EOL/EOS Upgrades – Per group guidelines. Track and execute upgrades and/or do risk assessment and deviation approval.\n\n– Housekeeping – scripted clean-ups and truncations of logs and temp files after necessary archives executed\n\n– Backups – Required backup strategy per backup guidelines operationalized to central Backup Platform. Recurring scheduled backup validation activities scheduled and performed ongoing to ensure backups working per need.\n\n• Work with system stakeholders to ensure proper classification of system criticality and ensure design and architecture can meet the assessed criticality needs:\n\n– MAS 644 defined Critical system – Ensure DR setup and working and can achieve RTO within 4 hours, RPO within 2 hours and maximum unplanned downtime of not more than 4 hours per rolling 12 months;\n\n– MAS 644 defined non-critical system – Ensure HA/DR per stakeholder requirement.\n\n• BCM related activity planning and execution.\n\n• Review and Approve/Reject production change requests as part of TCAB committee • Raise CAB CR as necessary.\n\n• Cutover related planning and execution.\n\n• Ensure and maintain adequate test environments in good working order to support enhancements and new projects;\n\n• Adhere to SDLC for both in-house and 3rd party solution platforms.\n\n• Take BAU day 2 operational ownership in terms of maintenance, support and minor enhancement ownership of new systems and/or major enhancements delivered by the Digital Delivery and DevOps team.\n\n• Track IT related spend against budget.\n\n• Write Memos to authorize procurements.\n\n• Write Memos to get deviation approvals where required.\n\nApplication and Systems Development / New Platform Acquisition\n\n• Lead in the requirements gathering and documentation, design and where in-house the coding, test support and implementation of new systems or enhancements of existing systems:\n\n– Analyze, design, document and develop technical solutions according to business requirements (or in case of off the shelf, co-ordinate with 3rd party vendor).\n\n– Provide accurate, complete and up to date system documentation.\n\n– Provide training to users to ensure correct usage and proper adoption upon rollout – Oversee the QA of software implementation.\n\n• Oversee the deployment and implementation of applications to run on Cloud for existing systems based on end-user needs and business rationale.\n\n• Assist team lead to write and table committee papers as required to get new systems and/or platforms, or major refreshes approved.\n\n• Write Memos to authorize procurements.\n\n• Write Memos to get deviation approvals where required.\n\n• Work together with Digital Delivery and DevOps team to support digital and cloud initiatives in terms of initial advisory and then follow-on necessary analysis and coordination/implementation related to integration requirements and enhancement required to existing business applications to enable the digital initiative.\n\n• Work with Digital Delivery and DevOps team to support migration of workloads running onpremises to Cloud.\n\nRegulatory and Procedural Expertise\n\n• Keep up to date and refreshed on required reading related to guiding how IT must be run in a regulated Financial institution. Minimum read list:\n\n– MAS Technology Risk Management Guidelines (TRMG)\n\n– MAS Notice 644 – Technology Risk Management.\n\n– MAS Notice 655 – Cyber Hygiene\n\n– MAS Outsourcing Guidelines\n\n– RHB Group IT Security Guidelines and SG addendum/s\n\n– SG Patching Guidelines\n\n– SG Backup Guidelines\n\n– SG Technology Department Operational Manual (OM)\n\n– SG IT Standard Operational Procedures (SOP), and System Manuals (SM)\n\n– SG Procurement Operational Manual (OM)\n\nOther Responsibilities\n\n• Participate in Monthly Technology Department meetings.\n\n• Participate in regular Team meeting.\n\n• Use Department issue and work tracking platform.\n\n• Maintain and keep up to date team knowledge base and assist in updating team document assets such as system manual / standard operating procedures (SOP), and operations manuals.\n\nQualifications\n\nFormal Education:\n• Bachelor Degree/Masters Qualification\n\nProfessional Accreditation:\n• TOGAF architecture certification (not mandatory)\n• Net developer related certification (not mandatory)\n• Java developer related certification (not mandatory)\n• SQL Developer related certification (not mandatory)\n\nPreferred level of Experience (by years/function/industry):\n• Minimum 5 years of experience documenting requirements, designing solutions, and coding or configuring off the shelf software as part of technology department in a financial institution based in Malaysia or Singapore\n• Minimum 3 years of experience in providing level 3 IT operations support in a financial institution based out of Malaysia or Singapore.\n• Experience managing vendors\n\nOther skills required:\n• Working knowledge of bank operations and products\n• Experience in supporting and configuring core banking systems\n• Experience in agile based SDLC methodologies\n• JavaScript / Node.js | .Net | Java | SQL | Python | Shell Scripting development skills\n\nAdditional Information\n\nRHB is a dynamic organization that promotes a work culture of high performance, where its biggest asset, the RHB-ians, are continuously developed & nurtured to their fullest potential through its robust talent management practices.\n\nAt RHB, we take PRIDE in our people and our teams. Great relationships built on trust, a ‘leading it right’environment, challenging assignments and a culture of excellence are the pillars to the dynamic and diversified workplace we call home", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU3lzdGVtIEFuYWx5c3QiLCJjb21wYW55X25hbWUiOiJSSEIgU2luZ2Fwb3JlIiwiY29tcGFueV9taWQiOiIvZy8xMWM3M3NyZzdmIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiLXBnZjRiQ3BYNkV4NkdKeUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFVVdzVkMWh4YVhOVlZFd3hZM0V5U1dGcmQzbHdORmxDYzNVMVdGRnpZWEpoZVc1WlduSXlXV1JFVFdjelJIUmxWWEpmT1hGdVQweEdWMnAwVFhGTk9FSXlTRUphYnpBNWExUlNNWEIzTkRWelRXbEJNbVZ5WmxwS1dUWm1ZVk5xTWxsNE5sbElZbUl5YkMxV1VrUktZbTFRY0dWVldtOXFRMDFxUzBRM2JYbGtaREJRT1MxcWVFMHRSRlI0Y1RNMGNUWkdhamxVZUVkVFZYWjNFaFkwV0dsRFdVMU1WazlrU0VselFWaFFlSEJUV1VOM0dpSkJUMDFaVW5kQlVrNUZaV05zTVRaSmNGbEplVnBVV21kblZWUnhVelJ5WTJKbiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzI4IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFNtYXJ0UmVjcnVpdGVycyBKb2JzIiwibGluayI6Imh0dHBzOi8vam9icy5zbWFydHJlY3J1aXRlcnMuY29tL1JIQlNpbmdhcG9yZS83NDM5OTk3MjQwNzQwNTAtc2VuaW9yLXN5c3RlbS1hbmFseXN0P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Business System Analyst", "company_name": "Volt - International", "location": "Singapore", "via": "via LinkedIn", "description": "Position: Business System Analyst\n\nThe Client\n\nMy client is a global leader in semiconductor manufacturing.\n\nThey are currently looking for a Business System Analyst to set sail on their digitalisation journey with them.\n\nThe role will focus on providing internal stakeholders with new analytical products to support the achievement of business objectives.\n\nThe Role\n• Consult and communicate stakeholders and business users to understand, shape and agree on the requirements for new products\n• Perform proof of concepts/protyping to validate concepts with stakeholders and users\n• Write and review functional/technical specifications\n• Perform BI tasks such as ETL and translate data onto reports/dashboards\n\nJob Requirements\n• Bachelor’s Degree in Computer Science/Engineering or equivalent\n• 3 years of work experience in similar capacity required to perform the role\n• Proficient in Oracle Data warehouse design and concepts\n• Proficient with data visualisation tools such as Tableau\n•... Demostrated experience with PLSQ and ETL process\n• Project Management certification is a plus\n\nNext Step\n\nInterested applicants please send your resume to henry.tan@voltasia.com.sg or contact Henry Tan on +65 6701 1521 for a confidential discussion.\n\n-\n\nEA Registration No. 12C5526 | CEI Registration No. R1763552, Tan Ee Boon (Chen Yiwen", "extensions": ["23 hours ago", "Full–time"], "detected_extensions": {"posted_at": "23 hours ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJCdXNpbmVzcyBTeXN0ZW0gQW5hbHlzdCIsImNvbXBhbnlfbmFtZSI6IlZvbHQgLSBJbnRlcm5hdGlvbmFsIiwiY29tcGFueV9taWQiOiIvbS8wOW0yM2R5IiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoibnFsYlZuNTJhWTZvR0FjQkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZZQkNyY0JRVTVWWDA1eFVuVlVNVVY0VkRCU1JHZzVUMlIzUmt3NGVITkJlRWx0ZEhvd1gyaEJRa3A2ZEd4blUydzNjamd3ZVdvMmFVdFdSbWRrVjBOS2VHVjRjbWxUWWtoTVRqTkpRVlZ3Wm5Wck9WUlpiWEptWDJRNFZEWmxiRFZhTkRaa05ETllSV3gwZEdocE1pMWhZV2xJTTFaMlFrTlVZa0ZHYm1wM1lqUmxWRmwwUTIxQ05UWnBXbFZQTWprMWMwVkdPWEZyVVhGaE5WUlVXa1pIWmxCT09XSlRWR0pUTkVWaVUzUTVjWG93YlVJM2VUTjRWRkpuRWhZMFdHbERXVTFNVms5a1NFbHpRVmhRZUhCVFdVTjNHaUpCVDAxWlVuZEJVbkY0YzJsUU9ETTJiMGR5Tm5ZekxXOWFOMjQyUkZCWE9YZDMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18zNSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL3NnLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvYnVzaW5lc3Mtc3lzdGVtLWFuYWx5c3QtYXQtdm9sdC1pbnRlcm5hdGlvbmFsLTI0OTc3MDk1NzU/cmVmSWQ9NWVmNTk5YmQtODNlYS00YzA5LWJjZWUtNWE0ODdhYzE4YTk3XHUwMDI2dHJhY2tpbmdJZD1xRnhxb0d3WEN4JTJCRUM5STkyeGtzVXclM0QlM0RcdTAwMjZwb3NpdGlvbj0xOFx1MDAyNnBhZ2VOdW09MFx1MDAyNnRyaz1wdWJsaWNfam9ic19qb2ItcmVzdWx0LWNhcmRfcmVzdWx0LWNhcmRfZnVsbC1jbGlja1x1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Business Analyst", "company_name": "Dyson", "location": "Singapore", "via": "via Business Analyst | Dyson Careers", "description": "Dyson Global IT\nAt Dyson, we demand the highest standard of performance from the technologies we engineer. Our people expect the same from the technology that supports them. We are a community that appreciates and advocates better engineering. A community of pioneers.\nDyson IT are mid-transformation. Our aim, to create robust IT architecture, to manage data effectively and efficiently and continue to grow our world-class team. A team who is strategic, enabling business acceleration, growth and success.\n\nOur Application Business Services Team\nDyson’s Global IT applications service has end to end accountability for the design, delivery and support of all business applications enabling Dysons global commercial, operational and enterprise business process. Forming a large proportion of the IT Function, the team are arranged into investment areas including Owner Experience & Retail, Supply Chain, Manufacturing, Finance & compliance and People and collaboration.", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJCdXNpbmVzcyBBbmFseXN0IiwiY29tcGFueV9uYW1lIjoiRHlzb24iLCJjb21wYW55X21pZCI6Ii9tLzA1Y3NrZyIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IlY1c1lBM2x5WFZvZjRycDNBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVzc0JDb3dCUVU1VlgwNXhVbGRQWjJ4NGIxQnpVRUowYlhSbU5EaEtOMmx3WVhKcVV6VmhVSFZEVDJkdFltNTZlVzF1V0dWNlVFa3lYM1JyZDBOTVNETnFjRWxETjJZNWRubHVkVmN3Y1RkdVNUQktMVEZXWkdnNFVUVjFaVjlUUzI5b1VpMTRSazlEU2sxcFozUm5ObkJwTWxwdVFrUTRhbWhHU2s1elZsOTRabU5vVnpoWlFVNVFMVmxzY1dzelEwc1NGalJZYVVOWlRVeFdUMlJJU1hOQldGQjRjRk5aUTNjYUlrRlBUVmxTZDBFM1ExY3diV0YzYjFkNmRsRnFWMlYxZFVneWFHVTRXbm81YWxFIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNDIiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQnVzaW5lc3MgQW5hbHlzdCB8IER5c29uIENhcmVlcnMiLCJsaW5rIjoiaHR0cHM6Ly9jYXJlZXJzLmR5c29uLmNvbS9lbi1nYi9qb2ItZGVzY3JpcHRpb24vYnVzaW5lc3MtYW5hbHlzdC8zMzYyNj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior Business Analyst", "company_name": "Avensys Consulting", "location": "Singapore (+1 other)", "via": "via Cturtle", "description": "Avensys is a reputed global IT professional services company headquartered in Singapore. Our service spectrum includes enterprise solution consulting, business intelligence, business process automation and managed services. Given our decade of success we have evolved to become one of the top trusted providers in Singapore and service a client base across banking and financial services, insurance, information technology, healthcare, retail and supply chain.\n\nWe are currently looking to hire Senior Business Analyst. This is an exciting opportunity to expand your skill set, achieve job satisfaction and work-life balance. More details as below.\n\n1-year renewable contract\n\nResponsibilities\n• Liaise with stakeholders to identify business needs.\n• Review existing business processes to identify opportunities.\n• Prepare business cases defining potential benefits, solutions to increase efficiencies of business processes and associated risks.\n• Propose alternative solutions to streamline... business processes.\n• Establish requirements for the implementation of changes in the business processes.\n• Conduct in-depth analysis of the business requirements specification and feasibility studies.\n• Translate business requirements and user needs into functional specifications.\n• Collaborate with developers to ensure requirements are incorporated into system design.\n• Guide the team to gather and document existing system specifications.\n• Function as the liaison between users and technical staff throughout the solution implementation cycle.\n• Work with relevant stakeholders on User Acceptance Testing.\n• Develop technical documentation and training materials.\n• Conduct user training to facilitate adoption of new systems features.\n• Act as a point of contact for users regarding complex queries.\n• Scope out statement of works setting clear expectations of deliverable and exclusions.\n\nRequirements\n• Bachelor’s degree in Computer-related discipline or equivalent.\n• Minimum of 8 years’ IT experience.\n• Minimum of 6 years’ IT Business Analysis experience.\n• Minimum of 2 years’ experience working in Agile development projects.\n• Certified Business Analyst (CBA) certification will be highly advantageous.\n• Experience in developing Agile and/or UML requirements artifacts is mandatory", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQnVzaW5lc3MgQW5hbHlzdCIsImNvbXBhbnlfbmFtZSI6IkF2ZW5zeXMgQ29uc3VsdGluZyIsImNvbXBhbnlfbWlkIjoiL2cvMTFnNzAyMmdqZiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImtyTzJtOHJ3TGYxRUFIVmJBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2WUJDcmNCUVU1VlgwNXhVMWhvTmtScFh6UnphVk00TW1NdFlqWnRSblkxYTNkWGJIWTNkek5RTFc0MWFWTllZV3B6WmxKdFlUZGthbmM1ZFhsSFNUazJOSFUzUkhOU2EzWTRUREV6VEZOVmNVWndObWcxZGpOT1VHWTRSV2xHZFhoTVRXeEdSa3d0TW05WFozRlliRE5SUlZaWWNsbGhTVEJRTnpSRU9XeG5TbXRUUXpjeU1FOTJkblJKVW5CWU5rcHVaMVpIYjFnNE9USldZVFIyY25sSFVsTkVPVGcyY1d3MmJISk9kVXd0VG1OWk0xQXliSEF0UzFCckVoWTBXR2xEV1UxTVZrOWtTRWx6UVZoUWVIQlRXVU4zR2lKQlQwMVpVbmRETFRoUU5HVTFVa1Y1V0RNeGNDMUxMV1V3U1ZwTVJtNXJOSFIzIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNTAiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQ3R1cnRsZSIsImxpbmsiOiJodHRwczovL2N0dXJ0bGUuY28vam9iL3Nlbmlvci1idXNpbmVzcy1hbmFseXN0Lz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Business Analyst (Retail Application) - up to $7,000", "company_name": "Randstad Singapore", "location": "Singapore (+1 other)", "via": "via Randstad Singapore", "description": "• Business Analyst - Retail Applications\n• Retail/Luxury Group\n• 1 year contract (up to $7,000)\n\nabout the company\n\nOur client is a sophisticated global luxury group.\n\nWith a prestigious brand name, they are looking for a Business Analyst to join their tech team.\n\nThis is a 12-month contract position based in the Singapore office.\n\nabout the job\n\nYou can support both the business and IT strategy through the delivery of quality innovative technology systems across APAC.\n\nThis person will be responsible for the coordination of all retail technology including the rollout of new POS in the region.\n• Coordinate all retail applications and implementation of projects that contribute to the improvement and standardization of the business, technology infrastructure and/or systems and applications in alignment with business and user needs.\n• Working closely with global counterparts and key business stakeholders, manage teams to deliver retail transformation projects for the region\n• Work with... country/region team to define best practices, design solutions, conduct business case studies, evaluate project feasibility, gather user requirements and prepare proposal / presentations\n• Design and propose application changes to address business needs with proper functional specifications\n• Manage and evaluate internal/external application vendors on technical design, delivery and support\n• Develop and coordinate application test plans and test cases, and facilitate test sessions\n• Develop, coordinate and implement regular/project-based application training plans, training sessions and training materials\n• Provide ongoing application system maintenance and problem resolution\n• Provide Level 2 support on business applications\n\nskills and experience required\n\nTo succeed in this position, you will need:\n• Min 3 years of experience in Project Management and large-scale retail technology implementation projects\n• Min 3 years’ experience in retail industry with in depth knowledge of retail business process\n• Experience working across both the Retail, Omni, and Consumer facing business and IT to deliver high touch solutions\n• Strong project management experience managing large scale projects across multiple countries\n• Hands-on experience in ERP, Marketing Automation, POS systems is a plus.\n• Experience in SAP is a plus\n• PMI/ITIL certification is a plus\n• Strong business sense and business operational experience\n\nTo apply online please use the 'apply' function, alternatively you may contact Melissa at melissa.low(at)randstad.com.sg\n\n(EA: 94C3609/ R1658081)\n\nskills\nbusiness analyst, project management, business analysis, project manager, sap, erp, business process, retail, supply chain, BI, FMCG, applications, luxury\n\nqualification\nMin 3 years of experience in Project Management and large-scale retail technology implementation projects\nMin 3 years’ experience in retail industry with in depth knowledge of retail business process\n\nexperience\n3 years\n\nworking hours\nFull-Time\n\neducational requirements\nAssociate Degree/Diploma", "extensions": ["3 days ago", "$6K–$7K a month", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time", "salary": "$6K–$7K a month"}, "job_id": "eyJqb2JfdGl0bGUiOiJCdXNpbmVzcyBBbmFseXN0IChSZXRhaWwgQXBwbGljYXRpb24pIC0gdXAgdG8gJDcsMDAwIiwiY29tcGFueV9uYW1lIjoiUmFuZHN0YWQgU2luZ2Fwb3JlIiwiY29tcGFueV9taWQiOiIvZy8xMWc3MGI1MG1yIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiNzBMZzVVaG5YTXR3U3lsYUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZZQkNyY0JRVTVWWDA1eFVWaFhZMTh6T1hsSFJWODVWbVZXTlY5UlZUbHZObDh4Um5ORWIwSldiSFJ2TkV0RVZuZHZURlZ5ZFhORlRtYzVPRlJ0V1ROa1pqTlZUMTl4TURCV1pXTk5aalIzYkhKM05HbFRiRzkxV1hGNE5tMU9ZbGRuZFd4R1V6VkdiVTE1VlY5aFNWVlFiWGRRZVVOaVlVazFlRVJ2V0hGYVJtWTBUMFI1WjJ0alJuZDZOV0Y2VUdSS2EzZE5lbnBmYVRZek16ZzJaMW90YVdkVldEUkVUamhvTURGVmMwTkdUV2xPWms5MlZsTlFXRk5SRWhZMFdHbERXVTFNVms5a1NFbHpRVmhRZUhCVFdVTjNHaUpCVDAxWlVuZEVUMW95Y2xrM1l6VXRVVXRhWjI5aGRtVnBaMmxqYldGbk1HdEIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY181OCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBSYW5kc3RhZCBTaW5nYXBvcmUiLCJsaW5rIjoiaHR0cHM6Ly93d3cucmFuZHN0YWQuY29tLnNnL2pvYnMvYnVzaW5lc3MtYW5hbHlzdC1yZXRhaWwtYXBwbGljYXRpb24tdXAtdG8tNzAwMF9zaW5nYXBvcmVfMzY3MjM2MDcvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Digital Business Analyst", "company_name": "Sciente Inc", "location": "Singapore", "via": "via SCIENTE", "description": "Our client is looking for an experience digital Business Analyst to be involved in their transformation projects involving high visibility, newly launched platforms.\n\nMandatory Skill(s)\n• Has a Bachelors degree in Information Technology or Computer Science or similar;\n• At least 5 years experience working on projects and enhancements, focusing on business analysis through implementation;\n• Experience in requirements analysis, process improvement effort, implementation of process efficiencies and use of Process Modeling and UML tools;\n• Ability to elicit, articulate and document process modeling, business requirements, description of business context using scenarios and Data / Reporting requirements;\n• Excellent written, presentation and communication skills;\n• Good Stakeholder Management experience;\n• Ability to build strong working relationships with IT teams and business;\n• Good working knowledge of project life cycle methodology and prevalent project planning tools.\n\nDesirable... Skill(s)\n• PMP Certified.\n\nResponsibilities\n• Will be responsible to analyse business and functional requirements, organising, modelling, and documenting these requirements to ensure that they are complete and unambiguous;\n• Analyze, design/redesign, implement, and document business processes;\n• Responsible for conducting and analyzing feasibility studies/impact assessments regarding implementation of IT solutions;\n• Manage Business Analysis work stream and interacting with SME, other BA and IT Team to propose functional solutions;\n• Captures business requirements in a precise form that can be used for system development;\n• Analyses and makes recommendations on associated business processes;\n• Coordinate roll-outs and enhancements on digital platforms and operational processes;\n• Develop, deliver, and evaluate training materials; supplement materials when necessary;\n• Deploy test environment and conduct final acceptance tests for solutions;\n• Ensure the successful delivery/implementation of changes/projects from end-to-end from analysis, users requirements management, solutioning, test planning, facilitation of simulation, preparation for implementation, live verification and documentation", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEaWdpdGFsIEJ1c2luZXNzIEFuYWx5c3QiLCJjb21wYW55X25hbWUiOiJTY2llbnRlIEluYyIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoicldNOC1Hd0hfMTUzT3lYeUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBTQ0lFTlRFIiwibGluayI6Imh0dHBzOi8vd3d3LnNjaWVudGUuY29tL3NjaWVudGUtaW5jL3RlY2hub2xvZ3ktam9icy81NjYxL2RpZ2l0YWwtYnVzaW5lc3MtYW5hbHlzdC8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "SOC Analyst | 12-Months Contract", "company_name": "Manpower Singapore", "location": "Singapore", "via": "via Manpower Singapore", "description": "Description:\nIn this role, you will join an advanced threat detection and response team, drive proactive identification of threats within the organization, provide rapid response, monitor user activity, network events, and signals from security tools to identify events that merit attention. Prioritization. and Investigation. Ideal candidate has cyber security experience, hands-on technical skills on Windows, Linux and Network security, along with experience in identifying live intrusions and triage security events in real-time. Responsibilities include:\n• Review security alerts and evaluate urgency and relevancy?\n• Perform initial security investigation and triage\n• Follow runbook for incident escalation\n• Request or run vulnerability scan and review the assessment report.\n• Manages and configures security monitoring tools.\n• Ability to backfill other security roles as required.\n\nQualifications:\n• Prior experience in an Information Technology or Information Security Department, with... incident response experience in an enterprise setting.\n• 5+ years of overall IT experience.\n• 3+ years with IT Security Teams.\n• Windows and Linux experience.\n• Working experience with SIEM solutions (QRadar, Splunk, Elastic Security).\n• Previous work experience with the various phases of security incident response.\n• In-depth understanding of the types of events of interest in electronic logs.\n• Deep understanding of cyber defense principles, common attack vectors, incident response methodologies, log analysis and attacker techniques.\n• Excellent familiarity with best practices related to security incident response activities and protocols, including litigation holds, chain of custody, and playbooks.\n• Awareness of incident response requirements of PCI, HIPAA and other applicable laws, regulations and guidelines.\n• Excellent technical writing and presentation skills.\n• Degree in IT or any related discipline\n\nDesired Certifications (Any of the following)\n• CISSP\n• GCTI (GIAC Cyber Threat Intelligence)\n• GSEC (GIAC Security Essentials)\n• CEH (Certified Ethical Hacker)\n• SANS Security SEC401\n• Security+\n\nBernice Mae Nocum Rallonza EA License No. 02C3423 Personnel Registration No. R1442141\n\nPlease note that your response to this advertisement and communications with us pursuant to this advertisement will constitute informed consent to the collection, use and/or disclosure of personal data by ManpowerGroup Singapore for the purpose of carrying out its business, in compliance with the relevant provisions of the Personal Data Protection Act 2012. To learn more about ManpowerGroup's Global Privacy Policy, please visit https://www.manpower.com.sg/privacy-policy", "extensions": ["2 days ago", "Contractor"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Contractor"}, "job_id": "eyJqb2JfdGl0bGUiOiJTT0MgQW5hbHlzdCB8IDEyLU1vbnRocyBDb250cmFjdCIsImNvbXBhbnlfbmFtZSI6Ik1hbnBvd2VyIFNpbmdhcG9yZSIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiSmJXNklsTTZ1U2dDamVaSkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNYW5wb3dlciBTaW5nYXBvcmUiLCJsaW5rIjoiaHR0cHM6Ly93d3cubWFucG93ZXIuY29tLnNnL2pvYi9zb2MtYW5hbHlzdC0xMi1tb250aHMtY29udHJhY3QtMj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Business Operations", "value": "GC06"}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Accounting and Finance", "value": "GC01"}, {"text": "Science and Engineering", "value": "GC27"}, {"text": "Advertising and Marketing", "value": "GC03"}, {"text": "Customer Service", "value": "GC10"}, {"text": "Legal", "value": "GC17"}, {"text": "Protective Services", "value": "GC23"}, {"text": "Management", "value": "GC18"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Property", "value": "GC24"}, {"text": "Sales and Retail", "value": "GC26"}, {"text": "Social Services and Non-Profit", "value": "GC28"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "Business analyst", "value": "business analyst"}, {"text": "Analyst", "value": "analyst"}, {"text": "Security analyst", "value": "security analyst"}, {"text": "Systems analyst", "value": "systems analyst"}, {"text": "It analyst", "value": "it analyst"}, {"text": "Data analyst", "value": "data analyst"}, {"text": "System analyst", "value": "system analyst"}, {"text": "Support analyst", "value": "support analyst"}, {"text": "Associate", "value": "associate"}, {"text": "Management analyst", "value": "management analyst"}, {"text": "Operations analyst", "value": "operations analyst"}, {"text": "Soc analyst", "value": "soc analyst"}, {"text": "Test analyst", "value": "test analyst"}, {"text": "Intelligence analyst", "value": "intelligence analyst"}, {"text": "Research analyst", "value": "research analyst"}, {"text": "Senior", "value": "senior"}, {"text": "Senior analyst", "value": "senior analyst"}, {"text": "Control analyst", "value": "control analyst"}, {"text": "Manager", "value": "manager"}, {"text": "Project analyst", "value": "project analyst"}, {"text": "Researcher", "value": "researcher"}, {"text": "Risk analyst", "value": "risk analyst"}, {"text": "Service analyst", "value": "service analyst"}, {"text": "Technology analyst", "value": "technology analyst"}, {"text": "Accounting analyst", "value": "accounting analyst"}, {"text": "Application analyst", "value": "application analyst"}, {"text": "Behavior analyst", "value": "behavior analyst"}, {"text": "Business", "value": "business"}, {"text": "Center analyst", "value": "center analyst"}, {"text": "Compliance analyst", "value": "compliance analyst"}, {"text": "Coordinator", "value": "coordinator"}, {"text": "Desk", "value": "desk"}, {"text": "Desk analyst", "value": "desk analyst"}, {"text": "Financial analyst", "value": "financial analyst"}, {"text": "Functional analyst", "value": "functional analyst"}, {"text": "Hr analyst", "value": "hr analyst"}, {"text": "Interns", "value": "interns"}, {"text": "Operations center", "value": "operations center"}, {"text": "Process analyst", "value": "process analyst"}, {"text": "Programmer analyst", "value": "programmer analyst"}, {"text": "Project manager", "value": "project manager"}, {"text": "Qa analyst", "value": "qa analyst"}, {"text": "Senior associate", "value": "senior associate"}, {"text": "Senior consultant", "value": "senior consultant"}, {"text": "Specialist", "value": "specialist"}, {"text": "Sr analyst", "value": "sr analyst"}, {"text": "Support executive", "value": "support executive"}, {"text": "Technical analyst", "value": "technical analyst"}, {"text": "Technical architect", "value": "technical architect"}, {"text": "Trainee", "value": "trainee"}, {"text": "Treasury analyst", "value": "treasury analyst"}, {"text": "Wealth management", "value": "wealth management"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Internship", "value": "INTERN"}, {"text": "Part-time", "value": "PARTTIME"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Research", "value": "/business/naics2007/5417"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Mining", "value": "/business/naics2007/21"}, {"text": "Real Estate", "value": "/business/naics2007/53"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Engineering Services", "value": "/business/naics2007/5413"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Utilities", "value": "/business/naics2007/22"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "SingTel", "value": "/m/020zfl"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "Trustwave", "value": "/m/0n3xjf5"}, {"text": "Government Technology Agency", "value": "/g/11gh0528nq"}, {"text": "OCBC", "value": "/m/055r27"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "Credit Agricole Group", "value": "/m/028vbm"}, {"text": "UL", "value": "/m/01q1gj"}, {"text": "VISA", "value": "/m/01kqjn"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "American Express", "value": "/m/01w6dw"}, {"text": "Avensys Consulting", "value": "/g/11g7022gjf"}, {"text": "Binance", "value": "/g/11hcz1r4wl"}, {"text": "BlueVoyant", "value": "/g/11h1y4qdlf"}, {"text": "Caterpillar", "value": "/m/0319hp"}, {"text": "Cognizant Singapore, Cognizant Technology Solutions", "value": "/m/03bf9h"}, {"text": "DBS Bank Ltd", "value": "/m/01q7n5"}, {"text": "Deloitte SEA", "value": "/g/11f_g4x9d_"}, {"text": "Dyson", "value": "/m/05cskg"}, {"text": "EPAM Systems", "value": "/m/0dlnrc"}, {"text": "Experis Singapore", "value": "/g/11dxpnwm3s"}, {"text": "HSBC", "value": "/m/096k1t"}, {"text": "JPMorgan Chase & Co.", "value": "/m/01hlwv"}, {"text": "Jobline Resources Pte Ltd", "value": "/g/11gp2647pn"}, {"text": "Marina Bay Sands Pte Ltd", "value": "/m/09mhd9q"}, {"text": "Medtronic", "value": "/m/03z4j3"}, {"text": "Mizuho Bank", "value": "/m/022103"}, {"text": "Public Service Division", "value": "/g/11g6__bv10"}, {"text": "RECRUIT EXPRESS PTE LTD", "value": "/g/11g706hzhq"}, {"text": "RHB Singapore", "value": "/g/11c73srg7f"}, {"text": "Randstad", "value": "/m/08pt1z"}, {"text": "Randstad Singapore", "value": "/g/11g70b50mr"}, {"text": "SITA", "value": "/m/06l20z"}, {"text": "Selby Jennings", "value": "/g/11fy2ds3gn"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "Xcellink Pte Ltd", "value": "/g/11c73prcqy"}, {"text": "Xilinx", "value": "/m/03dwkc"}, {"text": "103 Golden Agri International Pte Ltd", "value": "/g/11fy210tb9"}, {"text": "Activate Interactive Pte Ltd", "value": "/g/11dxq192l5"}, {"text": "Amazon", "value": "/m/0mgkg"}, {"text": "Apple", "value": "/m/0k8z"}, {"text": "Aramco", "value": "/m/01qjg2"}]}]}