{"search_metadata": {"id": "608278e379627cfdd982a7e0", "status": "Success", "json_endpoint": "https://serpapi.com/searches/748685b3763a93ea/608278e379627cfdd982a7e0.json", "created_at": "2021-04-23 07:36:03 UTC", "processed_at": "2021-04-23 07:36:03 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28software+engineer%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=10", "raw_html_file": "https://serpapi.com/searches/748685b3763a93ea/608278e379627cfdd982a7e0.html", "total_time_taken": 1.36}, "search_parameters": {"q": "(software engineer) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "10"}, "jobs_results": [{"title": "Software Developer​/Javascript", "company_name": "SnapHunt Pte Ltd", "location": " (+1 other)", "via": "via Learn4Good", "description": "Position: Software Developer (Javascript)\nJoin an award-winning, high-growth company\n\nWork with a passionate and talented team\n\nExcellent learning and career development opportunities\n\nOur client is an e-ticket distribution platform that serves as marketplace for tours and activities in Asia. They are an award-wining company that is expanding rapidly within Asia, and has growing partnerships with well-known brands and organisations.\n\nThe JobIn this role, you will be a Scrum development team member and be responsible for :\n\nContributing in all phases of software development cycle\n\nCollaborating with team effectively, and supporting storyboarding effort of the team\n\nContinuously enhance applications and develop high quality code as per standards & guidelines\n\nPerforming peer-review to ensure code quality and requirements are metSupporting the smooth delivery of SIT and UAT activities\n\nTroubleshooting assigned bugs in a timely manner and updating status and details in Bug/Issue Tracking... System\n\nThe Profile\n\nYou have a Bachelor's Degree/Post Graduate Diploma/Professional Degree in Computer Science/Information Technology or equivalent.\n\nYou have at least 2 years experience in software development.\n\nBeing a Certified JAVA Developer or Certified Scrum Developer (CSD) will be an advantage\n\nYou have experience with Javascript, Frontend frameworks such as Angular and modern web technologies like HTML, CSS3\n\nYou have experience with JDK 1.5 and above, J2EE and Spring, Hibernate framework, Grails/Groovy, J2EE application servers Glass\n\nFish, Jetty or equivalent\n\nYou have worked with Databases – MySQL, Oracle, SQL Server or equivalent\n\nYou have good knowledge of REST APIs and Design Patterns e.g. MVCYou are familiar with source control management system such as SVN, GIT and bug tracking system such as BugZilla, JIRA etc.\n\nExperience with mobile hybrid development as well as native e.g. Cordova/Phonegap is required\n\nYou have knowledge of Agile and Scrum\n\nPrior experience with C, C++ and C# is advantageous\n\nYou have strong analytical skills with ability to solve complex problems\n\nYou have strong written and verbal communication skills\n\nYou are a strong team player and are able to work effectively in a collaborative environment\n\nRef", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBEZXZlbG9wZXLigIsvSmF2YXNjcmlwdCIsImNvbXBhbnlfbmFtZSI6IlNuYXBIdW50IFB0ZSBMdGQiLCJjb21wYW55X21pZCI6Ii9nLzExYzc0dDYxdzgiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJuTUNxWm4xQlJFTV9pMGtlQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdllCQ3JjQlFVNVZYMDV4VWs5M1VERmpWVlZVU1cxWmNEWnJhM051ZWxwRmEwRlhRMk4zV1VsVlUzTjJNMEYwU0VKVlgzVTNlRWRET1c5bE1FUldSRkkwWkVzd1RHMDVjRk0zTXpOTmIxbDBWemhSWmxVd1VrNWlaVU5VU1MxcVJFcGZaWGRxUlc5VlUzQm9NVTVYWDNoV1JEZ3RXRmcxWDNwU01sYzBSVm8wY0c0M2RUVnNlWHBRVkhwb1ZVSnNSblZtZFY5MlFqQlZhalZMUm1KaE1IUlBURzB0UVhaM2JqWkhNSHBXZWxKdlEwZG9URVkzU1doVmNGSlpFaFkxU0dsRFdVNTFZa1Z2Y1RSMFVXRnNiVzlpTkVKQkdpSkJUMDFaVW5kRE1HODFVSFpwYm1WSVZXTmpXV3g0UTBaa1JVbDRVRkZCUW5KbiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzciLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGVhcm40R29vZCIsImxpbmsiOiJodHRwczovL3d3dy5sZWFybjRnb29kLmNvbS9qb2JzL3NpbmdhcG9yZS9zb2Z0d2FyZV9kZXZlbG9wbWVudC8yNzEzNDkxNDIvZS8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Software Engineer (Nucleus) #BAS2020 (Singapore,  Singapore)", "company_name": "Singtel", "location": "Singapore", "via": "via APAC Tech Jobs", "description": "About NCS\n\nNCS is a member of the Singtel Group and the leading information, communications and technology (ICT) service provider with presence in the Asia Pacific region.\n\nWe deliver end-to-end ICT solutions to help governments and enterprises realise business value through digital transformation and the innovative use of technology. Over the years, NCS has played a critical role in the Singapore government’s efforts to computerise the civil service sector and integrate IT into its public services\n\nSoftware Engineer (Nucleus)\n\nNucleus is an NCS programme that equips software engineers with professional training, technical expertise and industry experience. We help you develop your ICT skills and accelerate your career as you work on technology projects that make a difference in the lives of people.\n\nWe have designed Nucleus to help build your foundation, develop your technical skillsets and deepen your specialisation experience. You will be immersed in challenging projects and attain... NUS-ISS accredited graduate certification programmes. Through this, you will be on your way to attain a Master of Technology.\n\nNCS is looking for talents with strong interest in application development and maintenance to join our Nucleus programme. Join us as we make a difference and impact to the lives of people to champion digital transformation for the future.\n\nKey Responsibilities\n• Participate in discussions with stakeholders to understand business and system requirements\n• Perform technical tasks to develop/enhance software applications according to Functional and Technical specifications\n• Maintain and improve software applications\n• Execute unit, integration, system and user acceptance testing\n• Using configuration management, integration and build automation tools to deploy applications\n• Identify opportunities and suggest recommendations for system improvement\n\nThe ideal candidate should have/be:\n• Degree in Computer Science or related engineering fields\n• Fresh graduates or with less than two years equivalent practical work experience\n• Proficiency in one or more frontend framework (HTML5/Angular/React JS)\n• Proficiency in one or more backend languages (Java/.NET/Python/PHP)\n• Proficiency in database will be added advantage\n• Experience in frontend and backend web application development will be added advantage", "extensions": ["19 hours ago", "Full–time"], "detected_extensions": {"posted_at": "19 hours ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciAoTnVjbGV1cykgI0JBUzIwMjAgKFNpbmdhcG9yZSwgIFNpbmdhcG9yZSkiLCJjb21wYW55X25hbWUiOiJTaW5ndGVsIiwiY29tcGFueV9taWQiOiIvbS8wMjB6ZmwiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJLZEhWb3dBM3BabG0yVUE2QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFc3NCQ293QlFVNVZYMDV4VWsweWMzSXRjVmhMZGtWSk5taDNXbHB2TW5SRVEyZGhhR2M1VDNkWmMzcDNabkZtVmxGTlpYaDVVMWxqTkc5UFJVNTRWbVpOYTI1WWJHRlVhbWhIVDJOS1dqTTBWVmR6UjJzelVrdFliemhSVEd4WGJrazBhM0UwVGpoVVZVbG1UV3gzT1hWdWF6SXlMWGRSWmpCMGRWZDNURmhyVjBabE9EQlBZall3UkZORlJtbzVWamdTRmpWSWFVTlpUblZpUlc5eE5IUlJZV3h0YjJJMFFrRWFJa0ZQVFZsU2QwSnJhemwxVmtWM1QxSjJPVzVsZVdST1QzRnFlVFUwU3pWVWNYYyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzE0IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEFQQUMgVGVjaCBKb2JzIiwibGluayI6Imh0dHBzOi8vYXBhY3RlY2hqb2JzLmNvbS9qb2IvMTU0NjQvc29mdHdhcmUtZW5naW5lZXItbnVjbGV1cy1iYXMyMDIwLXNpbmdhcG9yZS1zaW5nYXBvcmUvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Fullstack Java Software Engineer (based in Vietnam)", "company_name": "Zühlke", "location": "Singapore (+1 other)", "via": "via Zühlke", "description": "The Zuhlke Opportunity.\nThrive in an environment where you can express your passion and enthusiasm for software development and be inspired by your colleagues’ enthusiasm. As a Fullstack Software Engineer based in our Vietnam office, you will cooperate with interdisciplinary teams in projects and experience how technology and team spirit unite to create innovative solutions. Your job will involve working closely with clients to develop, test, and ship software that meets their needs. You will efficiently and competently solve complex software challenges. Continuous further development and active knowledge exchange mean that you will be working with the latest methods and tools to stay up to date with the latest trends.\n\nAs part of the pioneer team, you will have the unique opportunity to be onboarded by our high performing Singapore-based colleagues for three months. On top of experiencing the sights and sounds of another vibrant city, you will also receive mentorship within teams who... have diverse technical knowledge. And of course, this is only to kickstart your long term success upon your return home.\n\nOur reputation is fundamental to our business, so our culture emphasizes quality, reliability, and respect. We value learning new technologies and skills thus, we invest in a generous local training budget to attend conferences, participate in certified courses, and our annual technical camp is a lot of fun.\n\nYour Talent.\n• You have a degree in computer science or an equivalent related field (bachelor's/master's).\n• You have proven expertise in the JavaScript ecosystem and used frameworks like ReactJS and Angular where you apply your in-depth knowledge in JavaScript and/or TypeScript.\n• You leverage your development workflow with tools like npm, webpack and Node.js.\n• You have multiple years of experience with state-of-the-art web architectures and enjoy developing modern web applications.\n• You value high quality code and you want to satisfy your thirst for knowledge of the latest technologies every day.\n• You have professional experience in Java stack of between 3-7 years.\n• You have a thorough knowledge of build and deployment of Full Stack applications, including practice with automated testing frameworks like Selenium, Jasmine or similar tools.\n• Having hands-on experience in native Android or iOS development is a plus\n• You have professional experience working in an agile development environment. Ideally, you are a certified Scrum developer or master.\n• You have strong communication skills and like making decisions.\n\nLife at Zuhlke.\nAt Zuhlke Asia you get the best of both worlds. You can leverage on the benefits of working in a stable, large, highly reputable company with a long history of success while enjoying the freedom and autonomy of working in a fast-growing start-up environment. Zuhlke offers you networked innovation power and the security of a long-running, international success story. We support your personal development with specialised workshops and active knowledge sharing among experts", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJGdWxsc3RhY2sgSmF2YSBTb2Z0d2FyZSBFbmdpbmVlciAoYmFzZWQgaW4gVmlldG5hbSkiLCJjb21wYW55X25hbWUiOiJaw7xobGtlIiwiY29tcGFueV9taWQiOiIvZy8xaGhfcmcyMTYiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJGTkw2YzJkS3VfYlVzUF9BQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VkRjNGRIZDFOVlpVZEVwZk0zcEJValJpVkZkdVVtOVdWbFkyV2xKcmNuRjNRME5SU1RkcFNtZG9WVU4zWkhCQ1RXbFZPWGhtTkdsSWVYQnJRMDlZTjI1cWVHc3haVUpwVUVkdmJHVkpOVlo2T1haV2FVTlZOSGN0VG1wRWNVVTBURTEzY0dKd1drUm5NemhYWkV4ZlQwWlZabHBUUkRCcGFVVXRVSEYzVG1sMlFqWXdUMlJGUTNoMk9YRk5NbmczZFMxM1kyTlFiMUIzWTNCUkVoWTFTR2xEV1U1MVlrVnZjVFIwVVdGc2JXOWlORUpCR2lKQlQwMVpVbmRFYmtaeGJ6SkVTbGxoU1VSamN6bFZaVEZrU1VNemN6VndWRUpCIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMjIiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gWsO8aGxrZSIsImxpbmsiOiJodHRwczovL3d3dy56dWVobGtlLmNvbS9lbi9jYXJlZXJzL2Z1bGxzdGFjay1qYXZhLXNvZnR3YXJlLWVuZ2luZWVyLWJhc2VkLWluLXZpZXRuYW0/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Principal / Senior Software Engineer", "company_name": "Mediacorp Pte Ltd", "location": "Singapore (+1 other)", "via": "via Workable For Job Seekers", "description": "Individual with holistic understanding of both the operational and scope aspects of projects, from creating and implementing systems software to analyzing data to improve existing ones. Ability to conceptualize the big picture and is able to work with various departments to manage and develop systems within Mediacorp. Works to balance various aspects of a project such as architecture and system dynamics.\n\nResponsibilities:\n• Develop, test and implement new software programs\n• Clearly and regularly communicate with management and technical support colleagues\n• Design and update software database. This includes, but is not limited to: Software Applications, Web Sites, Data Communication Processes and User Interfaces\n• Test, maintain and recommend software improvements to ensure strong functionality and optimization\n• Independently install, customize and integrate commercial software packages\n• Facilitate root cause analysis of system issues\n• Work with experienced team members to... conduct root cause analysis of issues, review new and existing code and/or perform unit testing\n• Identify ideas to improve system performance and impact availability\n• Resolve complex technical design issues\n• Development of technical specifications and plans\n• Analyze user requirements and convert requirements to design documents\n• Make good technical decisions that provide solutions to business challenges\n• Provide comprehensive support to internal customers; achieve resolution to outstanding problems or issues\n• Compile timely, comprehensive and accurate documentation and or reports as requested\n• Possess up-to-date knowledge of technological developments in the industry\n• Communicate effectively and professionally in all forms of communication with internal and external customers\n• Possess strong problem solving and decision making skills while using good judgment\n• Possess strong business analyst skills. Able to drive users in business processes and workflows studies.\n• Multi-task and change from one task to another without loss of efficiency or composure\n• MS SQL 2012 and above\n• SSRS (Reporting Services)\n• Microsoft SQL Server Integration Services (SSIS)\n• MS VisualStudio 2012 and above\n• C#, ASP.NET, Java, Python - With experience in WebService API like SOAP, REST, JSON\n• Team Foundation Server 2017 or AzureDevOps\n• K2 Process Automation Platform\n• Microsoft 365 Services\n• Degree or Diploma in Information Technology, Information Systems or equivalent.\n• Relevant work experience (5 years) in business analysis and software development.\n• ITIL Certification is an advantage.\n• Ability to multi-task, prioritize and manage time effectively\n• Excellent communication skills, good interpersonal skills and ability to work within and cross-business unit teams.\n\nThank you for your interest and application to this role. Please note that only shortlisted candidates will be contacted", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcmluY2lwYWwgLyBTZW5pb3IgU29mdHdhcmUgRW5naW5lZXIiLCJjb21wYW55X25hbWUiOiJNZWRpYWNvcnAgUHRlIEx0ZCIsImNvbXBhbnlfbWlkIjoiL20vMDNxdHoxIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiN25MZkdhMXp2SXZlZnhXT0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZZQkNyY0JRVTVWWDA1eFZIVnRWMlZWUTJaU2QzY3pXVTVuVWtOdFoxaDBWblZtUzFaa1JqaDBRMWRqUVRFMlVscElTakEzWjAxM1RtMUVNbmc0UlhoeGNHMTFSbTVRYzFwdE1IVmFlalpUUTB0UFNscHdaMWhmVDBwNkxVdFVlWFJKYTBVd2JsZEZhR3RWZGxWVFNYcEhSRmM0WTFKaU9WZEhNREUzTVZGVGJtUnhNR3RrV21Sb1RreFhRakpZYnpsTFJXbG5ZbVF5Um0wMlgyNWlPRFpmTmpWU2NWYzRNbEpLWm01NFNFSkJNM1F3VUhBeVdUVnpXQzFqRWhZMVNHbERXVTUxWWtWdmNUUjBVV0ZzYlc5aU5FSkJHaUpCVDAxWlVuZEVTVFZzVldsT2VIcHVkWGRLUWtOdmIxSTVaMVZtV1RJeWVuVkIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18zMCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBXb3JrYWJsZSBGb3IgSm9iIFNlZWtlcnMiLCJsaW5rIjoiaHR0cHM6Ly9hcHBseS53b3JrYWJsZS5jb20vbWVkaWFjb3JwL2ovNDg2MkYzRjE2Ri8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Technical Lead, Software Engineering (Edge Team)", "company_name": "DELL", "location": "Singapore", "via": "via Dell Careers", "description": "Technical Lead, Software Engineering (Edge Team) - Singapore\n\nDell Technologies is seeking an entrepreneurial and innovative Technical Lead (Software Engineering) to drive the vision and execution of a new Enterprise Edge Initiative. If you are passionate about how the edge is revolutionizing the future infrastructure and enable the next wave of ultra-low latency Internet applications, this is the role for you.\n\nAs a Technical Lead (Software Engineering) in our new Edge innovation group, you\n• Have the passion in developing and supporting the growth of the next generation software architectures and inspire innovation within the team\n• Develop scalable real-time low-latency processing solutions in an agile delivery method\n• Lead and guide the team in design, code and implement new algorithms to solve complex problems\n• Work collaboratively with cross-functional distributed teams in engineering, QA and product management in all phases – ensuring delivery of quality... solutions\n\nRequirements:\n• Bachelor’s degree in Computer Science or related field (master’s degree preferred) or relevant experience and at least 10+ years of relevant application design & development experience\n• Solid knowledge of at least one or more programming language: Golang, Java, Rust, C# or NodeJS and at least one or more SQL/NoSQL database engines: MySQL, DynamoDB, Cassandra, MongoDb, Redis\n• Good working knowledge of Cloud platforms (Azure, AWS, GCP etc.) SDLC, Agile methodologies, and Agile development experience\n• Knowledge of compute, server, storage, networking, virtualization, HCI concepts and containerization using Docker and/or Kubernetes\n• Understanding and demonstrable experience of modern architecture/designs - micro-services/API-firstdevelopment/high-throughput/event-driven system\n\nGood to have:\n• AWS or Azure or GCP certified solution architect and machine learning algorithms knowledge such as clustering, classification and data processing tools such as TensorFlow, Scikit\n• Experience of Dell and VMware products is a plus but not expected. However, you should be eager to learn Dell/VMware products and other related technologies\n\nDell Technologies is a unique family of businesses that helps organizations and individuals build their digital future and transform how they work, live and play—providing customers with the industry’s broadest and most innovative technology and services portfolio. We value our customers, winning together, innovation, results and integrity. Grow your career with a highly competitive salary, bonus programs, world-class benefits and unparalleled learning and development opportunities— all at a company that is proud to be diverse and inclusive. Learn more on how we are closing the diversity gap here.\n\nDell is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at Dell are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. Dell will not tolerate discrimination or harassment based on any of these characteristics. Dell encourages applicants of all ages. Read the full Employment Opportunity Policy here", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJUZWNobmljYWwgTGVhZCwgU29mdHdhcmUgRW5naW5lZXJpbmcgKEVkZ2UgVGVhbSkiLCJjb21wYW55X25hbWUiOiJERUxMIiwiY29tcGFueV9taWQiOiIvbS8wcHk5YiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Ikp1aERCYy1jcllWNDFkS2NBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVzc0JDb3dCUVU1VlgwNXhVVWxZUjJkSmVteG9WM1ZSUjFwTE5FaEJNVkEzYjI1dVVEUk9Va1poTWxKNmVuTnVRVXBNTTNSbVpXSllhVVZmYjJaVVprZG5TbHA0UWpobFZucFJaVzVRUlRjelYwMXdjRGxTUzJkalJrVlVXSFp1TW1SbU1VTnVNV3RCZUMxWVdFaEZRbEpqV1hJeU9GOTNaMFpIT0RsRE5HbFJVVTQxVDFWRGJFUnJZM2wzWm0wd2Vsa1NGalZJYVVOWlRuVmlSVzl4TkhSUllXeHRiMkkwUWtFYUlrRlBUVmxTZDBGYU5HVnVYM1ZTVUc5eVNrNW9lR3htTURBeVNrOWtUME15WkVFIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMzgiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gRGVsbCBDYXJlZXJzIiwibGluayI6Imh0dHBzOi8vam9icy5kZWxsLmNvbS9qb2Ivc2luZ2Fwb3JlL3RlY2huaWNhbC1sZWFkLXNvZnR3YXJlLWVuZ2luZWVyaW5nLWVkZ2UtdGVhbS8zNzUvMTc5MjQ1MjI/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Software Developer (Python/Java)", "company_name": "EPS Consultants Pte Ltd", "location": "Singapore", "via": "via Neuvoo", "description": "Job Description\n\nJob Description:\n• Be part of a Team responsible for the deployment of solutions\n• Involve in the entire software development life cycle including application development, implementation and maintenance\n• Perform installation, configuration and customization of respective COTS products\n• Involve in the creation of documentation e.g. the creation of end user guides, troubleshooting guides etc.\n• Assist in integration testing which include the diagnoses of program/software defects\n• Provide maintenance support for existing projects\n\nSkill sets:\n• Proficient in the following programming languages: C# or Java or Angular\n• Knowledge and/or experience in: Relational Database; e.g. MSSQL, Oracle\n• Knowledge and/or experience in one or more of the following will be an advantage: Linux / Shell Script o Message Queue e.g. RabbitMQ or equivalent Big Data / Data Analytics e.g. Hadoop o Unstructured / NoSQL Database; e.g. MongoDB DevOps e.g. Gitlab, Docker, Jenkins or equivalent... Agile Methodology e.g. Scrum UI / UX Design\n• Able to work independently and as a team\n\nEducation / Experience:\n• Diploma/Bachelors in Computer Engineering/Computer Science or equivalent\n• 1 - 4 years' of relevant working experience but fresh graduates are encouraged to apply", "extensions": ["2 days ago", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBEZXZlbG9wZXIgKFB5dGhvbi9KYXZhKSIsImNvbXBhbnlfbmFtZSI6IkVQUyBDb25zdWx0YW50cyBQdGUgTHRkIiwiY29tcGFueV9taWQiOiIvZy8xMWdieGdzY3Z5IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiaWQxay1aWHVXVm9FMUxaWkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRW9zQ0Nzd0JRVTVWWDA1eFVraEZhVXhZVEVsWWRtOUZhRU5xWlZscGRFVmtaWEY1TlV3MlVVUllUVEV4UzFKUVgzSTNjVEF6WlRCTFdVVmFXRTVvZGtKWE5IcFFTVnB6WDBSSVJGYzVVVFZFVEdwWE4yRjRUSGczVGpaeFpWTlNPRFpyT1dOWlVWVmZWM0k0TkVnMGNuWlJhVmRaWVhaU0xVc3RaamQwVWxWVFFtaFVaMmR0WkVzME5HMXdZakJVY25GelgxWnFRbkJGYUdaWVQyMXZWWGd4V0RadVUwaHFNR1Y0YzA1blVtOTJiVVpGVUVVeFpUa3RTalpFYm5Jek1XbGpVVEZ3UTA1blVtRmtUbkJuV1RNdEVoWTFTR2xEV1U1MVlrVnZjVFIwVVdGc2JXOWlORUpCR2lKQlQwMVpVbmRDTkZkS1RucFhhVGRXV25CWFJGUndURVk0T1hWMGIySlNjbFZuIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNDYiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTmV1dm9vIiwibGluayI6Imh0dHBzOi8vc2cubmV1dm9vLmNvbS92aWV3Lz9pZD0yMDJmNTNkZmMyZDVcdTAwMjZ1dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Certification Engineer - Hardware - APAC", "company_name": "Zvc Singapore Pte. Ltd.", "location": "Singapore", "via": "via Monster", "description": "Zoomies help the world connect — and deliver happiness while doing it. We set out to build the best video conferencing product for the enterprise, and today help people communicate better with products like Zoom Phone, Zoom Rooms, Zoom Video Webinars, Zoom Apps, and OnZoom.\n\nWe’re problem-solvers and self-starters, working at a fast pace to design solutions with our customers and users in mind. Here, you’ll work across teams to dig deep into impactful projects that are changing the way people communicate, and enjoy opportunities to advance your career in a diverse, inclusive environment.\n\nWe are looking for an energetic, detailed, and experienced Hardware Certification Engineer with deep expertise in unified communication and internet media streaming devices. This position involves working with leading hardware companies to define hardware certification specifications with Zoom software and services.\n\nResponsibility\n• Build a consistent certification strategy across multiple hardware... categories\n• Define the hardware API, testing tool, and certification specification for new hardware categories, use cases, Zoom software and service\n• Collaborating with internal and partner’s product manager, engineering, marketing, and reference design teams, and effectively manage releases of new hardware certifications\n• Manage third-party certification labs, execute certification specifications objectively, accurately, and consistently\n• Communicating to customers - Certification guarantees consistent and unified User Experience delights to our users and across hardware from different partners\n• Manage the life cycle of certification spec, maintain consistency across multiple categories\n\nRequirements\n• 8+ years in product engineering, interoperability, testing of fast-paced smart TV, streaming player, set-top-box, smart IoT or unified communications industries\n• Position based in Singapore\n• Excellent writing, communication, and presentation skills; ability to manage ambiguity, solve complex technical problems and define a clear API, test tool and test specification\n• Technical background is required, Engineering. Computer Science degree a plus\n• Must be detail-oriented, organized, ethical, responsible, and self-motivated\n• Understanding of SaaS, a plus\n• Language proficiency: Mandarin/Chinese is highly preferred\n\nEnsuring a diverse and inclusive workplace where we learn from each other is core to Zoom’s values. We welcome people of different backgrounds, experiences, abilities and perspectives including qualified applicants with arrest and conviction records as well as any qualified applicants requiring reasonable accommodations in accordance with the law.\n\nWe believe that the unique contributions of all Zoomies is the driver of our success. To make sure that our products and culture continue to incorporate everyone's perspectives and experience we never discriminate on the basis of race, religion, national origin, gender identity or expression, sexual orientation, age, or marital, veteran, or disability status.\n\nAll your information will be kept confidential according to EEO guidelines", "extensions": ["4 days ago", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDZXJ0aWZpY2F0aW9uIEVuZ2luZWVyIC0gSGFyZHdhcmUgLSBBUEFDIiwiY29tcGFueV9uYW1lIjoiWnZjIFNpbmdhcG9yZSBQdGUuIEx0ZC4iLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImhVbXhjeDljQmQ4VWtwSGlBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTW9uc3RlciIsImxpbmsiOiJodHRwczovL3d3dy5tb25zdGVyLmNvbS5zZy9hbXAvam9iLXZhY2FuY3ktY2VydGlmaWNhdGlvbi1lbmdpbmVlci1oYXJkd2FyZS1hcGFjLXp2Yy1zaW5nYXBvcmUtcHRlLWx0ZC1zaW5nYXBvcmUtMjc3OTEwMTMuaHRtbD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Software Engineer/ Senior Software Engineer/ Consultant - PEGA", "company_name": "HCL SINGAPORE PTE. LTD.", "location": "Singapore (+1 other)", "via": "via LinkedIn", "description": "Atleast 4 cycles of PRPC implementation experience.\nMust have Pega CSSA Certification\nShould have Experience in SOAP, REST, JSON\nShould have JAVA and mySQL experience\nSound Understanding of PRPC OOTB activities\n\nGOOD to HAVE\nHaving Banking Domain Experience is plus\n\nTechnical / Professional Skills\nPega CSSA Certified\nWindows\nHTML, CSS, JavaScript, Ajax\nMySQL,\n\nNon-Technical / Soft Skills\nShould be Team Player\nExcellent communication skills", "extensions": ["2 days ago", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlci8gU2VuaW9yIFNvZnR3YXJlIEVuZ2luZWVyLyBDb25zdWx0YW50IC0gUEVHQSIsImNvbXBhbnlfbmFtZSI6IkhDTCBTSU5HQVBPUkUgUFRFLiBMVEQuIiwiY29tcGFueV9taWQiOiIvZy8xMWZ5MjVuZ3N2IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiNWE3U1lFQmRQTVgxbWRtLUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRW9zQ0Nzd0JRVTVWWDA1eFVXSXpZMXBWVjJOVlprd3ljMnQxY1VSS1ozSTJiRmQ2VVRoNVVHdFZOM0pKTlU5NGRUaHJhVFIxWlMxTVZXSkpWRlY2Ym0xVVRIUnhkWHBUYjNwVU1GSlVURUp5WldSamMxZFNSelV0ZDJrd1NHbDFORkJ5VmpCMFpIRlpZbUZ2TTJOaFFUUTVlbEJ1VkVZMmFtaGpOa0pqTkdsMVRYUkNUbEpuYjJSbE1YZEpUbk10U1hKTU9XOTJkMFZ3UkRCelgweDZXbk51Ym1abGJuSnNhUzFST0djeE9XVktlV2t4UTI1WlJsRlRURWhhV25kTVJqTm5TbXRLTTNwRVUwVnlhVk4zYjBSb0VoWTFTR2xEV1U1MVlrVnZjVFIwVVdGc2JXOWlORUpCR2lKQlQwMVpVbmREYVhVM1QyRkRhMVZyWm10UGRWbEdNMDh0YVRkU1pURldkMDVuIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNTciLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGlua2VkSW4iLCJsaW5rIjoiaHR0cHM6Ly9zZy5saW5rZWRpbi5jb20vam9icy92aWV3L3NvZnR3YXJlLWVuZ2luZWVyLXNlbmlvci1zb2Z0d2FyZS1lbmdpbmVlci1jb25zdWx0YW50LXBlZ2EtYXQtaGNsLXNpbmdhcG9yZS1wdGUtbHRkLTI1MTQxMTY1NTA/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Senior Fullstack Software Engineer​/Java", "company_name": "Zühlke Engineering AG", "location": "Singapore", "via": "via Learn4Good", "description": "Position: Senior Fullstack Software Engineer (Java)\nLocation: null\nYour Job. Thrive in an environment where you can express your passion and enthusiasm for software development and be inspired by your colleagues’ enthusiasm. As a full-stack software engineer, you will cooperate with interdisciplinary teams in projects and experience how technology and team spirit unite to create innovative solutions. Your job will involve working closely with clients to develop, test, and ship software that meets their needs.\n\nYou will efficiently and competently solve complex software challenges. Continuous further development and active knowledge exchange mean that you will be working with the latest methods and tools to stay up to date with the latest trends. Our reputation is fundamental to our business, so our culture emphasizes quality, reliability and respect. We value learning new technologies and skills thus, you will get a generous budget to attend conferences, participate in certified... courses, and our annual technical camp is a lot of fun.\n\nYour Talent.\n\nYou have a degree in computer science or an equivalent related field (bachelor's/master's).\n\nYou have proven expertise in the JavaScript ecosystem and used frameworks like React\n\nJS and Angular where you apply your in-depth knowledge in JavaScript and/or TypeScript. You leverage your development workflow with tools like npm, webpack and Node.js.\n\nYou have multiple years of experience with state-of-the-art web architectures and enjoy developing modern web applications. You value high quality code and you want to satisfy your thirst for knowledge of the latest technologies every day.\n\nYou have professional experience in Java stack for at least 5-6 years.\n\nYou have a thorough knowledge of build and deployment of Full Stack applications, including practice with automated testing frameworks like Selenium, Jasmine or similar tools. Having hands-on experience in native Android or iOS development is a plus\n\nYou have professional experience working in an agile development environment. Ideally, you are a certified SCRUM developer or master.\n\nYou have strong communication skills and like making decisions. And Zuhlke. At Zuhlke Asia you get the best of both worlds. You can leverage on the benefits of working in a stable, large, highly reputable company with a long history of success while enjoying the freedom and autonomy of working in a fast-growing start-up environment. Zuhlke offers you networked innovation power and the security of a long-running, international success story.\n\nWe support your personal development with specialised workshops and active knowledge sharing among experts", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgRnVsbHN0YWNrIFNvZnR3YXJlIEVuZ2luZWVy4oCLL0phdmEiLCJjb21wYW55X25hbWUiOiJaw7xobGtlIEVuZ2luZWVyaW5nIEFHIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJRZXNUMklGWnlwejFaRTZ0QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExlYXJuNEdvb2QiLCJsaW5rIjoiaHR0cHM6Ly93d3cubGVhcm40Z29vZC5jb20vam9icy9zaW5nYXBvcmUvc29mdHdhcmVfZGV2ZWxvcG1lbnQvMjcxMjg2MzYwL2UvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Senior Software Engineer, AI-Led Solutions", "company_name": "Singtel Group", "location": "Singapore", "via": "via Singtel Careers", "description": "As part of the Cloud Infrastructure team to optimize the capability, scalability, availability and security of the Cloud platforms to meet set requirements. Incorporate continuous improvement process in operations through constant monitoring, reporting, evaluating and improving the operation metrics.\n\nIndependently develop highly available and secure application architectures with an eye for automation within the deployment and delivery lifecycles.\n\nKey Roles & Responsibilities:\n• Design, develop and implement SaaS, tools and services.\n• You will build and run development with an eye for flexibility, best practices, high performance and continuous improvement.\n• Discovering and implementing automation to enable to development and deployment team.\n• Architect, Design and Build the applications and its CICD pipelines using cloud services.\n• Review and identify areas for improvements to optimize platforms and its services for system delivery, performance, scalability reliability and... extensibility.\n• Develop unit test package, execute tests & document test results to ensure the quality of the program.\n• Assist in the integration testing, system testing, User Acceptance Test (UAT) & implementation activities to fix the reported problems/bugs of the system to ensure the smooth execution of programs in the production environment.\n• Investigate all reported problems/errors & initiate amendments & testing so that the system can operate correctly & efficiently.\n• Provide advice and support for SaaS technology and systems.\n\nThe Ideal Candidate Should Have/ Be:\n• Degree in Computer Science or Electronic/Electrical/Software Engineering.\n• 3-5 years of relevant working experience, including scripting and programming experiences.\n• Minimum 3 years experiences in infrastructure management and cloud operations.\n• Deep understanding of software development, containerisation and orchestration with cloud environments.\n• Strong learning capability; an experimenter, a researcher enthusiastic about technology and automation.\n• An independent worker.\n• Experience with Docker and Kubernetes.\n• Cloud AWS or Azure Advanced Certification.\n• Experience with integrating and creating Splunk custom apps & commands in Python\n• Experience with customising the Splunk dashboards with some custom JavaScript and CSS.\n• Ideally Splunk Admin/Developer or higher certified\n• Experience setting up cloud environments from scratch.\n• Software Development experience, with skills in scripting & programming frameworks like PowerShell, Ansible, JavaScript, Python, Terraform, Linux shell scripts etc.\n• Knowledge of core programming framework such as .NET are relevant.\n• Good understanding of databases such as SQL Server, mongo DB are critical.\n• Development experience for mid-size IT projects.\n• System operations and administration experience on enterprise systems.\n\nThe main duties and responsibilities will be subjected to review when there is change in business requirements and scope of work", "extensions": ["13 days ago", "Full–time"], "detected_extensions": {"posted_at": "13 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgRW5naW5lZXIsIEFJLUxlZCBTb2x1dGlvbnMiLCJjb21wYW55X25hbWUiOiJTaW5ndGVsIEdyb3VwIiwiY29tcGFueV9taWQiOiIvbS8wMjB6ZmwiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJuSzhULTIyRFdPNGV1NlVwQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VkZkTGVqWTVUM0ZWYXkxeVNEaGtlVTlwU1hwVlIwdFhXWGN5VERadk5VVkdTM1ZhVTJoSVExcGpURGcwTTFWWFluVTVUMVJVYWpoQ1IyZHhkMFV5UTNJdFJFMXNWblF6VTFSRlVXUkZhVGRSVlY5RmJqRkJhMEZNTlcxWU5tWmZVWGhCYURBemJUZDBiRFZzVkhsMmFXVlJZelJ6ZHpGSVVURndOMDkxVjBFNWQzUk5TR050Y1VSbGFXZGlaRXREUlhoeFUzbE5ORE5RUVZWbkVoWTFTR2xEV1U1MVlrVnZjVFIwVVdGc2JXOWlORUpCR2lKQlQwMVpVbmRCYlhrNGJ6STRSVEJpVkdSaU5HVlNaa2RUWmtjdGVFWm5OVWhSIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNjgiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gU2luZ3RlbCBDYXJlZXJzIiwibGluayI6Imh0dHBzOi8vZ3JvdXBjYXJlZXJzLnNpbmd0ZWwuY29tL2pvYi9ORVhUU09MVVRJT05TMjAyMC1Tb2x1dGlvbi1BcmNoaXRlY3QtU2luZy81NzY1OTE5MTAvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}], "chips": [{"type": "Title", "param": "job_family_1", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Software engineer", "value": "software engineer"}, {"text": "Engineer", "value": "engineer"}, {"text": "Senior", "value": "senior"}, {"text": "Cloud engineer", "value": "cloud engineer"}, {"text": "Test engineer", "value": "test engineer"}, {"text": "Research engineer", "value": "research engineer"}, {"text": "Assurance engineer", "value": "assurance engineer"}, {"text": "It engineer", "value": "it engineer"}, {"text": "Java engineer", "value": "java engineer"}, {"text": "Qa engineer", "value": "qa engineer"}, {"text": "System engineer", "value": "system engineer"}, {"text": "Data engineer", "value": "data engineer"}, {"text": "Devops engineer", "value": "devops engineer"}, {"text": "Network engineer", "value": "network engineer"}, {"text": "Principal engineer", "value": "principal engineer"}, {"text": "Quality engineer", "value": "quality engineer"}, {"text": "Solutions engineer", "value": "solutions engineer"}, {"text": "Technical", "value": "technical"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Associate", "value": "associate"}, {"text": "Associate engineer", "value": "associate engineer"}, {"text": "Automation", "value": "automation"}, {"text": "Design engineer", "value": "design engineer"}, {"text": "Development engineer", "value": "development engineer"}, {"text": "Development manager", "value": "development manager"}, {"text": "Engineering manager", "value": "engineering manager"}, {"text": "Firmware engineer", "value": "firmware engineer"}, {"text": "Frontend engineer", "value": "frontend engineer"}, {"text": "Hardware engineer", "value": "hardware engineer"}, {"text": "Lecturer", "value": "lecturer"}, {"text": "Manager", "value": "manager"}, {"text": "Officer", "value": "officer"}, {"text": "Principal", "value": "principal"}, {"text": "Product engineer", "value": "product engineer"}, {"text": "Programmer", "value": "programmer"}, {"text": "Project officer", "value": "project officer"}, {"text": "Research associate", "value": "research associate"}, {"text": "Science", "value": "science"}, {"text": "Security engineer", "value": "security engineer"}, {"text": "Senior engineer", "value": "senior engineer"}, {"text": "Senior lecturer", "value": "senior lecturer"}, {"text": "Senior system", "value": "senior system"}, {"text": "Senior technical", "value": "senior technical"}, {"text": "Services engineer", "value": "services engineer"}, {"text": "Software architect", "value": "software architect"}, {"text": "Software engineering", "value": "software engineering"}, {"text": "Specialist", "value": "specialist"}, {"text": "Stack engineer", "value": "stack engineer"}, {"text": "Systems analyst", "value": "systems analyst"}, {"text": "Systems engineer", "value": "systems engineer"}, {"text": "Technical marketing", "value": "technical marketing"}, {"text": "Testing engineer", "value": "testing engineer"}, {"text": "Trainee", "value": "trainee"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Wholesale", "value": "/business/naics2007/42"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Rental", "value": "/business/naics2007/532"}, {"text": "Staffing", "value": "/business/naics2007/5613"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": ".AB4Jjf.qPB6Vc{padding-right:11px}.qfpP8d{padding:7px 0 7px 11px}.S003Ke{flex:none}.ZoN4Lb{color:rgba(0,0,0,.54)}.nAXVG{color:#70757a}.IxQsL{color:rgba(0,0,0,.26)}.xFO1De{color:#fff}.ooFpK{color:rgba(255,255,255,.30)}.mtnwac{color:#4285f4}.WxeeKb{color:#34a853}.hIVRU{color:#f29900}.EXaTMc{color:#fbbc04}.sxn46d{color:#000}.gqMTF{color:#1a73e8}.zpn8Mb{color:#d93025}.dEUPmd{color:#1e8e3e}.PJNo1{color:#fbbc04}Actively Hiring", "value": "e"}, {"text": "EPAM", "value": "/m/0dlnrc"}, {"text": "VISA", "value": "/m/01kqjn"}, {"text": "Nanyang Technological University", "value": "/m/0l49k"}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Zühlke", "value": "/g/1hh_rg216"}, {"text": "HCL SINGAPORE PTE. LTD.", "value": "/g/11fy25ngsv"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "Experis Singapore", "value": "/g/11dxpnwm3s"}, {"text": "OakTree Consulting", "value": "/g/11g70jfhtq"}, {"text": "Realtek Malaysia", "value": "/m/05wrm7"}, {"text": "TikTok", "value": "/g/11fy265933"}, {"text": "UST", "value": "/m/08kb8g"}, {"text": "UrbanFox", "value": "/g/11ghs7y0w6"}, {"text": "Activate Interactive Pte Ltd", "value": "/g/11dxq192l5"}, {"text": "Cardinal Health", "value": "/m/040vzx"}, {"text": "Cognizant", "value": "/m/03bf9h"}, {"text": "Collins Aerospace", "value": "/m/0kv61y1"}, {"text": "Credit Agricole Group", "value": "/m/028vbm"}, {"text": "DELL", "value": "/m/0py9b"}, {"text": "EPS Consultants Pte Ltd", "value": "/g/11gbxgscvy"}, {"text": "GlobalTix Pte Ltd", "value": "/g/11dxpqdhrf"}, {"text": "HCL Technologies", "value": "/m/0698gv"}, {"text": "Jobline Resources Pte Ltd", "value": "/g/11gp2647pn"}, {"text": "Metropolitan Wireless International Pte Ltd", "value": "/g/11g9m_xbc4"}, {"text": "PALO IT", "value": "/g/11dxpwj75r"}, {"text": "Singapore Press Holdings Limited", "value": "/m/0d7mwh"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "Thales DIS (Singapore) Pte. Ltd.", "value": "/g/11f0197yrz"}, {"text": "Thales Group", "value": "/m/01phj4"}, {"text": "Zendesk", "value": "/m/0wkm4pl"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "Aryan Solutions", "value": "/g/11dxptv4s4"}, {"text": "Atidan Technologies", "value": "/g/11c74f0b8_"}, {"text": "Bee Cheng Hiang Hup Chong Foodstuff Pte Ltd", "value": "/g/11dxpq9hhl"}]}]}