{"search_metadata": {"id": "60827eb437014c17d062f9b4", "status": "Success", "json_endpoint": "https://serpapi.com/searches/1d6472226110f189/60827eb437014c17d062f9b4.json", "created_at": "2021-04-23 08:00:52 UTC", "processed_at": "2021-04-23 08:00:52 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28IT+analyst%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=220", "raw_html_file": "https://serpapi.com/searches/1d6472226110f189/60827eb437014c17d062f9b4.html", "total_time_taken": 1.19}, "search_parameters": {"q": "(IT analyst) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "220"}, "jobs_results": [{"title": "Business Analyst", "company_name": "Mantu", "location": "Singapore", "via": "via WhatJobs", "description": "Perform business analysis and/or acting as point of contact with product owners and various business representatives Responsible for enhancing the product backlog with detailed specifications Product backlog / specifications are acceptable for the construction/sprint phase: all topics are clarified and if not clear, assumptions are taken & validatedClarify and communicate the specifications to the Product owners and developments teams Responsible for gathering and analyzing user requirement and impact analysis during Project preparation phase Producing General/Detailed Functional Specification and communicating to project teamsClarify and coordinate with development team for IT estimation Learns the system functions / data and is able to define the evolutions of the functional architecture Responsible for proper documentation of functional and non-functional specifications Review test cases of SIT tester Prepare and support UAT Exchange functional solutions to BA Chapter Contribute to... support / incident analysis as required Ensure that risks and issues are escalated to line manager\n\nAbout you\n\nComputing / Engineering Bachelor’s Degree or equivalent experience required 5+ years of overall experience performing business analysis professional software engineering JIRA and Confluence knowledge is required Detail oriented and good documentation skill is required Experienced in Waterfall and Scrum methodology Ability to work in fast-paced environments High level of professionalism, patience and maturity Certified product owner or scrum master certification is a plus Banking knowledge related to Wealth Management / Private banking is a plus", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJCdXNpbmVzcyBBbmFseXN0IiwiaHRpZG9jaWQiOiI4bmJkR1AtNkstR1VxMURSQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFdoYXRKb2JzIiwibGluayI6Imh0dHBzOi8vZW4tc2cud2hhdGpvYnMuY29tL2pvYi1mb3ItQnVzaW5lc3MtQW5hbHlzdC1pbi1TaW5nYXBvcmUtY29vcDE3NTgyNjM4P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Risk Analyst, Business Continuity Management & Physical Security (Analyst/Associate)", "company_name": "Bank of Singapore", "location": "Singapore (+1 other)", "via": "via Glassdoor", "description": "Responsible for the overall second line of defence in the areas of business continuity and physical security risk, ensuring that business units have detailed business continuity plans to ensure that critical functions are recovered following any major interruption, and also putting in place a robust physical security program in the Bank.\n\nResponsibilities\n• Strengthen operational risk management governance and framework.\n• Document and update operational risk policies and procedures and engage Group OCBC to ensure policies and processes are in alignment.\n• Support and coordinate the implementation, maintenance and enhancement of the BCM program such as BC Planner reviews, Desktop Walkthroughs, Call Tree Exercises, BCP testing and Maturity Scorecards. Support organization efforts in other areas such as Crisis Management, IT DR and CSIRT.\n• Support/Manage the development, implementation and maintenance of the Physical Security Program which includes the Physical Security Risk Assessment... on Key Headquarters.\n• Facilitate the Physical Security Self-Assessment for business units, provide guidance and review the results.\n• Assist in travel advisories, incl monitoring of events, providing advisory and support to business travellers.\n• Coordinate and conduct briefing, awareness training and exercises to raise staff awareness and capabilities in the areas of Crisis Management, Business Continuity Management and Physical Security.\n• Provide guidance/advice to business units on all BCM and Physical Security matters.\n• Lead/ Participate in various operational risk initiatives/activities, thematic reviews, deep dives, etc.\n• Participate internal or cross-functional projects to achieve productivity/quality improvement which include user requirement specifications, user acceptance test and documentation of new procedures and training materials.\n\nRequirements\n• Relevant working experience in business continuity management and physical security in the banking environment.\n• Good knowledge of banking products and operations preferred\n• Degree in finance / banking or related discipline preferred.\n• At least 1 year of banking experience with exposure in various disciplines, preferably from Private Banking background or minimum 5 years’ experience in BCM and/ or Physical Security.\n• Proficient in Microsoft Office Applications (i.e. Excel, Powerpoint, Word).\n• Good understanding of industrial BCM standards and local regulatory requirements, experience with crisis/incident management, BCM certification by a recognized BCM Institution (i.e. DRII, BCI) are preferred\n• Fluency in English is essential.\n• Good communication, presentation and interpersonal skills to facilitate interactions\n• Strong communication, presentation and interpersonal skills and able to maintain strong relationships with stakeholders.\n• Able to exercise sound judgment and establish both strategic and tactical plans in the management of operational risk.\n• Possess strong analytical, problem solving and report writing skills.\n• Independent and able to multi-task in a competitive environment.\n• High level of integrity", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJSaXNrIEFuYWx5c3QsIEJ1c2luZXNzIENvbnRpbnVpdHkgTWFuYWdlbWVudCBcdTAwMjYgUGh5c2ljYWwgU2VjdXJpdHkgKEFuYWx5c3QvQXNzb2NpYXRlKSIsImh0aWRvY2lkIjoicVpPQUtaNXQ2aGdDaW5mM0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZZQkNyY0JRVTVWWDA1eFVqTjFhVE5qWjBwWVZIRXhXV2h5WlRCWU1IUkZjV1pYVTBKQ04yaFVZMUp4ZDBwck1YQjJkR1JtYURadk5raHRhSHBXVkVkdmJsZFVZbEp4TVRsV2IwUTJRM3BWTkdvemFWSnBWVXhVZVZNMU1uZG9lbDlYTkV0NVZrTlJkRFJSU0RkR1ZrWlpTRXBGV2pSV2VIZzNSMHg0U0ZWek56ZFdOR3BUYWtGUlkzSmhhMHhYZFhSc1kzVXdNWEpyYkVWaGNFSXdlbGRzVUVwbVRFeDRVSFpwVEZwSllVcEZSMUZ3TkV0WVRWUXlORXhWRWhaMFNEWkRXVWxEWVVkZlEyeGZVV0pJWDNGVFFVTkJHaUpCVDAxWlVuZEVWbHBIUVRreVNtYzVTa2RFVVdWM04xWk9WM05DTnpOSFZUWkIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18xMSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBHbGFzc2Rvb3IiLCJsaW5rIjoiaHR0cHM6Ly93d3cuZ2xhc3Nkb29yLnNnL2pvYi1saXN0aW5nL3Jpc2stYW5hbHlzdC1idXNpbmVzcy1jb250aW51aXR5LW1hbmFnZW1lbnQtcGh5c2ljYWwtc2VjdXJpdHktYW5hbHlzdC1hc3NvY2lhdGUtYmFuay1vZi1zaW5nYXBvcmUtSlZfSUMzMjM1OTIxX0tPMCw3OV9LRTgwLDk3Lmh0bT9qbD00MDEwMTM2MjUxXHUwMDI2dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Data Analyst, Finance (SAP Lumira/BI/BWH)", "company_name": "Epson Singapore", "location": "Singapore", "via": "via LinkedIn", "description": "Company Profile\n\nAs a global technology leader, Epson creates and delivers technology solutions for businesses and consumers, from inkjet printers and digital printing systems to 3LCD projectors, smart glasses, sensing systems and industrial robots.\n\nEpson has a comprehensive infrastructure of service outlets, solution centres and manufacturing facilities supporting customers in the region. Today, the company continues to exceed customer expectations with its wide range of high precision, energy-efficient products in the region.\n\nJob Summary\n\n- Data Analyst interprets data and turns it into information which can offer ways to improve a business, thus affecting business decisions\n\n- Data Analyst gathers information from various sources and interpret patterns and trends\n\n- Data Analyst’s job focus on the analytical nature of the role. Once data has been gathered and interpreted, the Data Analyst will report back what has been found in a comprehensive study to the wider business/relevant... colleague\n\n- Data Analysts makes recommendations about the methods and ways in which a company obtains and analyses data to improve quality and the efficiency of data systems\n\nKey Accountabilities\n\n- Defining new data collection and analysis processes\n\n- Collecting and interpreting data\n\n- Analysing results\n\n- Reporting the results back to the relevant members of the business\n\n- Identifying patterns and trends in data sets\n\n- Working alongside teams within the business or the management team to establish business needs\n\nKey Job Requirements\n\nJob / Skills Competencies\n\n- Experience in data models and reporting packages\n\n- Experience in BI or BWH\n\n- Ability to analyse large datasets\n\n- Ability to write comprehensive reports\n\n- Strong verbal and written communication skills\n\n- An analytical mind and inclination for problem-solving\n\n- Attention to detail\n\n- Pursue organizational compliance consistent with sound and high standard of conduct\n\n- Being vocal, self-driven, motivated, able to work with minimal supervision, contribute to ideas and knowledge are highly desirable\n\nCritical Work Experience\n\n- At least 4 years of hands-on operation experience as data analyst\n\nQualifications\n\n- Pursuing or completed relevant professional data analytic qualification or certification\n\n- Candidate with diploma/degree in Computer Science with accounting/business reporting knowledge will be a plus factor", "extensions": ["7 days ago", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEYXRhIEFuYWx5c3QsIEZpbmFuY2UgKFNBUCBMdW1pcmEvQkkvQldIKSIsImh0aWRvY2lkIjoiTWRjUW1uSTNrbkY5YURJZkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZZQkNyY0JRVTVWWDA1eFVUUndSbkZuYWtWWFQzZHBSRUpCV1dVNGFuaFZibVYyYjFVMWVXTnZORGh1YlRjd1Z5MHdlRTltTlRCUlExSlFhVGsyZWpkUGIxbFpiRTQzVFhKSU9XSlpXbGRTVTA1dVowMWlOVXA0VUV0SGNWVlZjSFJqVlVaTFFtODRZek5YY0hGNVpHeDFObWxSYWxGSk4yVmFUa0Z3VGxoelpVSjJlazR5UkZwclVGWk5SMDVVYlhsclVVRnBXSEZuZGpKeVJHWlJOazk0Vm5JeE1WSlFkM2xmVFVONVRFNVpkR3BTWjBKdVFtWnhiM2RqRWhaMFNEWkRXVWxEWVVkZlEyeGZVV0pJWDNGVFFVTkJHaUpCVDAxWlVuZERlWGczWHpoMFIwUjFRMHgxYlRkalpISkpkRk5zU1MxdU5tSlIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18xOCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL3NnLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvZGF0YS1hbmFseXN0LWZpbmFuY2Utc2FwLWx1bWlyYS1iaS1id2gtYXQtZXBzb24tc2luZ2Fwb3JlLTI0ODc0NzQyMjE/cmVmSWQ9ZTY5NmRlOWQtMGU3OC00ZGZjLWE2OGMtOTk2MGY0N2EzZTBlXHUwMDI2dHJhY2tpbmdJZD1DS0lxS1lTc2M0VmFXV1d1UlN0amh3JTNEJTNEXHUwMDI2dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "HR Business Analyst", "company_name": "NTT Ltd.", "location": "Singapore", "via": "via WhatJobs", "description": "In a constantly changing world, we work together with our people, clients and communities to enable them to fulfill their potential to do great things. We believe that by bringing everyone together, we can solve problems using innovative technology that can create a world that is sustainable and secure. At NTT, we encourage you to remain continuously curious, as that is what keeps you fast, flexible and relevant. No two days will be the same but that is what will help you grow and realize your full potential. The power is in your hands to do great things. It’s time to lead the change, be the authentic you, to solve difficult challenges, to set the pace of change and to unleash your potential. Want to be a part of our team?The Business Analyst’s key function is to work with internal and external clients to determine requirements and to define solutions to address complex business, process and systems problems, and improvements in the organization. They act as a liaison among... stakeholders in order to understand the structure, policies, and operations of an organization, and to recommend solutions that enable the organization to achieve its goals. Radford reference: \"Analyzes complex business problems to be solved with automated systems. Identifies gaps and provides technical expertise in business requirements for system functional specifications and scales new and current systems, processes and procedures in a cost effective manner. Configures system settings and options; plans and executes unit, integration and acceptance testing to meet business requirements. Designs details of automated systems. May provide consultation to users in the area of automated systems. May lead cross-functional linked teams to address business or systems issues. Survey Tip: May be client-focused, working in conjunction with Professional Services and Outsourcing functions. May include company-wide, web-enabled solutions.\" Working at NTT Key Roles and Responsibilities: Act as a bridge between the business problems and the technology solutions. Analyse, transform and ultimately resolve the business problems with the help of technology. Work with internal clients and apply best practice methodologies to determine business requirements and to define solutions to address business, process, information and system problems, improvements or change. Deliver business projects in line with sponsor requirements and enterprise architecture. Proactive development and deployment of enhanced services and platforms, covering all the functional aspects from service/product definition through to build and deployment. Ensure the identification and documentation of operational gaps including user guides, templates, test cases and related user training. Assist with the resolution of issues pertaining to the service. Adhere to and follow the relevant development and support processes. Communicate and escalate if any issues arise or deliverables cannot be met and request assistance to ensure closure of issues. Take responsibility for delivery of project elements with minimal supervision Knowledge, Skills and Attributes: Broad understanding of business practices and processes Excellent team player who displays good client service orientation with well-developed administrative and organization skills Deep expertise in specific systems, processes and technologies that they will be required to analyze Meticulous attention to detail whilst working under pressure Excellent verbal and written communication skills Ability to listen empathetically Ability to build rapport and engage effectively with a variety of stakeholders Knowledge of project management methodology Excellent analytical skills with the ability to convert business requirements into operational deliverables (functional requirements) to meet business objectives Excellent documentation skills, in particular, functional requirements, test cases, system user documentation, processes and procedures and presentations Very good working knowledge of Microsoft Exchange, Word, Excel Project, PowerPoint and Visio Academic Qualifications and Certifications: Typically requires Bachelor’s degree or equivalent with related demonstrable experience Project management certification would be advantageous Relevant technology certification(s) Required Experience: Demonstrable experience as a Business Analyst gained within a technology services environment Experience as a system administrator or developer would be advantageous Demonstrable experience in coordinating and managing tasks, and small projects What will make you a good fit for the role? Standard career level descriptor for job level: • Seasoned and experienced professional • Has full understanding of specialisation area • Resolves wide range of issues in creative ways • Fully qualified, career level, career journey-orientated • Uses good judgement in selecting tools and methods to solve problems • Networks with senior internal and external people in own area of expertise • Receives little instruction on day-to-day work, receives general instructions on new assignments • Typically requires demonstrable related experience with a Bachelor’s or equivalent degree; or moderate level experience and a Master’s or equivalent degree; or a PhD or equivalent degree without experience; or equivalent work experience", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJIUiBCdXNpbmVzcyBBbmFseXN0IiwiaHRpZG9jaWQiOiJ3TGtmQlFBaldDVFVzdk5GQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFdoYXRKb2JzIiwibGluayI6Imh0dHBzOi8vZW4tc2cud2hhdGpvYnMuY29tL2pvYi1mb3ItSFItQnVzaW5lc3MtQW5hbHlzdC1pbi1TaW5nYXBvcmUtY29vcDE3NTgxODkzP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Senior IT Analyst (AWS, .NET)", "company_name": "Ethos Search Associates Pte Ltd", "location": "Singapore", "via": "via Jobs", "description": "This will be a continuously renewable contract position based in Bedok. Scope of Work: ensure all the applications systems remain in good working order. support new application systems when they become operational. respond to production emergencies in a timely manner. This includes bringing up the server (in a crash) or system processes, fixing problems or finding workarounds. perform routine checks and to escalate any anomaly detected, to alert and conduct troubleshooting together with other system engineers, database administrator (DBA) and outsourced vendors. meet the Service Level Agreement (SLA) timelines. follow through every issue / problem till closure; and complete the necessary documentation as required by NLB. assist users and answer queries regarding the supported operational systems. interact with the helpdesk agents, end-users and external vendors during application support and problem resolution. standby support on weekends / public holidays. In the event of scheduled... downtime or during a crash, required to be in office during off-office-hours to support the systems. make some code changes/ enhancements that arise from service requests. tracking and management of the project timelines and resources that he/she has been assigned to undertake. understudy and undertake the development of new applications and maintenance of any existing systems work independently with minimum supervision, also work effectively as a team member among the system support and application development teams Requirements: bachelor's degree in Information Technology (IT), Computer Engineering, Computer Science or equivalent. FIVE (5) years working experience in working experience in the IT industry, with exposure to end-to-end software development lifecycle (SDLC), system analysis and design, application development, and operational support and maintenance. ONE (1) year of work experience in Singapore, and thus to have minimally equipped well in understanding and meeting the user requirements. certified in Amazon Web Services like AWS Certified Cloud Practitioner or better. certified in Microsoft Azure platform. experience or certification in Google Cloud services. experience with container technology like Docker, Docker Swarm or Kubernetes. proficient in C# (NET) or other C-based programming language (e.g. PHP, PERL, C++) proficient in front-end technologies like HTML5, jQuery, JavaScript and CSS. experienced with front-end framework like Angular, AngularJS, REACT, or equivalent. have experience with NodeJS or Python. proficient in SQL technology like MSSQL, MySQL, PostgreSQL, MariaDB, or equivalent and be proficient in writing optimized SQL queries or stored procedures. working experience with NoSQL like MongoDB, CouchDB, or equivalent. working experience in Service Oriented Architecture (SOA) by having integrating application using SOAP or REST services before. working experience with EZProxy access and authentication software. working experience with chatbot technology like Dialogflow, Google Action, LUIS. WIT.AI, AWS Lex, or equivalent. working experience in continuous integration and continuous delivery like Jenkin, Spinnaker, Bamboo, CodePipeline, or equivalent. working experience in agile projects using SCRUM or equivalent. working experience with Content Search technology like Alfresco Content Management System, EBSCOHOST Discovery Services, Google Enterprise Search, or equivalent. working experience in government agency environment in the past 5 years with exposure to IM8, WOGAA, Digital Standards, and/or other Singapore government security policies compliance requirements. Continuous renewable contract for .NET and AWS developer. Skills: .NET, Asp.net, C#, Sql, Sql Server, Mysql, Perl, Php Programmer, Aws, Web Service, Amazon Web Service, Soap, Javascript, Rest, Php Experience: 5.00-15.00 Years Education: Bachelors/ Degree", "extensions": ["12 days ago", "Contractor"], "detected_extensions": {"posted_at": "12 days ago", "schedule_type": "Contractor"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgSVQgQW5hbHlzdCAoQVdTLCAuTkVUKSIsImh0aWRvY2lkIjoiQTM4amE0d3hKbl9ySlhtckFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIiwibGluayI6Imh0dHBzOi8vc2cuZmlkYW50by5jb20vam9icy9qb2Itb3BlbmluZy9pbmZvcm1hdGlvbi10ZWNobm9sb2d5LXByb2plY3QtbWFuYWdlcnMvc2VuaW9yLWl0LWFuYWx5c3QtYXdzLW5ldC0yNzIwMjQyNTk/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Senior Business Systems Analyst", "company_name": "Xilinx", "location": "Singapore", "via": "via Glassdoor", "description": "Description\n\nAt Xilinx, we are leading the industry transformation to build an adaptable, intelligent world. ARE YOU bold, collaborative, and creative? We develop leaders and innovators who want to revolutionize the world of technology. We believe that by embracing diverse ideas, pushing boundaries, and working together as ONEXILINX, anything is possible.\n\nOur culture of innovation began with the invention of the Field Programmable Gate Array (FPGA), and with the 2018 introduction of our Adaptive Compute Acceleration Platform (ACAP), has made a quantum leap in capability, solidifying our role as the adaptable platform supplier of choice. From the beginning, we have always believed in providing inventors with products and platforms that are infinitely adaptable. From self-driving cars, to world-record genome processing, to AI and big data, to the world's first 5G networks, we empower the world's builders and visionaries whose ideas solve every day problems and improve people's... lives.\n\nIf you are PASSIONATE, ADAPTABLE, and INNOVATIVE, Xilinx is the right place for you! At Xilinx, we care deeply about creating significant development experiences while building a strong sense of belonging and connection. We champion an environment of empowered learning, wellness, community engagement, and recognition, so you can focus on work that matters - world class technology that improves the way we live and work. We are ONEXILINX.\n\nFinance BI & Reporting Analyst\n\nJob description\n\nThe Finance BI & Reporting Analyst will provide both functional support (business process and systems analysis, testing, user support and training) and light technical support (report and dashboard development, maintenance of Tableau views and hierarchies) to the Finance organization from Business Intelligence & Data Analytics perspective. As a key member of our Finance Infrastructure Team the Finance BI & Reporting Analyst will be a first point of contact for Finance BI report troubleshooting and development in our new Snowflake DW solution.\n\nPrimary responsibilities\n• The Finance BI & Reporting Analyst will work closely with key stakeholders across Finance and IT to deliver reporting and analytics capabilities that support our efforts to increase process efficiencies.\n• Responsibilities include business analysis, requirements gathering, output and format evaluation, report creation and automation.\n• In addition to helping to build new reports and automating existing manual and/or duplicate reports, the Finance BI & Reporting Analyst will provide ongoing user support to the Finance organization, including reporting tools training and troubleshooting of BI reporting issues.\n• Individuals will also be responsible for analyzing complex data models and building reports to generate business insights and satisfy evolving management requirements.\n\nDesired skills and experience\n• 3-5 years experience applying analytical techniques to solve real business problems\n• Advanced Tableau skills are a must (preferably with Tableau certification) experience working with Snowflake or other cloud-based data sources is very desirable\n• Ability to retrieve, manipulate, and analyze large datasets\n• Strong interpersonal skills; must be able to effectively work with Finance and IT users and be able to drive projects and reporting improvements\n• Excellent presentation, communication and social skills, with solid attention to detail\n• Ability to comprehensively understand data elements, sources and relationships in business and technical terms\n• Bachelor’s degree preferably in a quantitative field (finance/accounting/statistics/engineering", "extensions": ["15 days ago", "Full–time"], "detected_extensions": {"posted_at": "15 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQnVzaW5lc3MgU3lzdGVtcyBBbmFseXN0IiwiaHRpZG9jaWQiOiIyVVF6cm5xYXUtTmQ3ZFhrQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFc3NCQ293QlFVNVZYMDV4VWpoSFgwcHhNbDl3VlhOVlpuaHdRV3cwYkd4TmFTMDBXRzVKVjJWUVJXRkxiMnhGTkdWNFExZGFXamgyZDE5NU1FMTJVRTExZERCVGNrVXdTek0wWHpZM01YbFZkbWhqWlhOWE0wMXBXWEl4TlVGVGVXUTBZa2xQU0RKSmVFOXFZek5pWWxZNWRGbGpURUZJU1hVNWFUZGxjbDh4VlRkUlJFTXRWa1ZtTUdOaFYxOUhhRTRTRm5SSU5rTlpTVU5oUjE5RGJGOVJZa2hmY1ZOQlEwRWFJa0ZQVFZsU2QwUjVYMUp6TVRsZloySlFVV3g0WHpKMU9VNWhWalpEYlVNeFJXYyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzMzIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEdsYXNzZG9vciIsImxpbmsiOiJodHRwczovL3d3dy5nbGFzc2Rvb3Iuc2cvam9iLWxpc3Rpbmcvc2VuaW9yLWJ1c2luZXNzLXN5c3RlbXMtYW5hbHlzdC14aWxpbngtSlZfSUMzMjM1OTIxX0tPMCwzMV9LRTMyLDM4Lmh0bT9qbD00MDI5MzU2MDYwXHUwMDI2dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Application Support Analyst", "company_name": "RECRUIT EXPRESS PTE LTD", "location": "Singapore (+1 other)", "via": "via LinkedIn", "description": "Key Responsibilities\n• Reactive problem investigation, diagnosis & resolution\n• Participate in post mortem activities for any breaks in system availability\n• Carry out root cause and trend analysis of problems and to identify, implement solutions to prevent repeat reoccurrence\n• Participate in change review meetings to review application development and infrastructure changes that impacting applications\n• Define and implement best practice operational standards (e.g. standardised monitoring, logging, escalation, scheduling).\n• Work with Infrastructure team to proactively improve application serviceability, reliability and scalability\n• Work with Infrastructure team to identify and implement new products that will increase operational robustness and efficiency\n• Review and amend technical documentation such as support and disaster recovery procedures to ensure that they are kept up to date\n• Work with Infrastructure team to ensure that all relevant metrics for server performance and... capacity are available\n• Use metrics to maintain and enhance system performance\n\nFormal Education & Certification\n• Candidate must possess at least Diploma/Advanced/Higher/Graduate Diploma.\n• At least 3 years of Application Support experience\n• Ability to pick up new information quickly and to work independently\n• A consistent attitude and respect for high quality standards and maintains this despite competing pressures\n• Excellent verbal and communication skills and able to translate complex technical issues into plain English, easily digestible for customers and stakeholders\n• Strong relationship builder who develops and maintains relationships to help attain targets. Able to share information across teams, business lines and geographies\n• Strong problem solving background with a focus on ownership of issues and a commitment to resolving them\n• Comfortable working in a fast-paced, customer-focused organisation, undergoing change. Flexible and able to adapt to new situations as the business demands\n• Influential and able to persuade peers and stakeholders (at various levels) and thereby, overcome uncertainty to change and sustain support\n• Innovative and able to create new ways of working, which are effective and easily accepted\n• Occasional travel and on-call availability at all times\n• Good analytical skills and ability to investigate the source of a problem across several different systems if required\n• Track record of effecting application management changes within a global, high-availability environment\n\nRequired Skill(s): Navision, SQL\n\nInterested candidates please forward resume in MS Word to ********\n\nRoy Huang Peijie [CEI No: R1104471]\n\nContact Number: ********\n\nEmail Address: ********\n\nRecruit Express Pte Ltd\n\nEA Licence No: 99C4599\n\nWe regret that only shortlisted candidates will be contacted.\n\nJob originally posted on GrabJobs. If you need to report this job please contact GrabJobs", "extensions": ["5 days ago", "Part-time"], "detected_extensions": {"posted_at": "5 days ago", "schedule_type": "Part-time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBcHBsaWNhdGlvbiBTdXBwb3J0IEFuYWx5c3QiLCJodGlkb2NpZCI6Ik5VNzc5LXk4TTlMSFV5ampBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVvc0NDc3dCUVU1VlgwNXhVVmN0TWpGd2QxRkJXbkZpVkRadk4yMDBOMk5KY1U1U1YwMTNXVnByYkV4M04yWlVaRmh2WmpkRWRuZzRlbkJPTjBkbVMxZ3pNRkIxWVdKR1RrOU5kVE4wWkdsM1kzTklaRFJzUTJscFV6QlhNV2g0YlhkWWJVVmthV3cyWW5wNFEyNXZOR05hUTAweWRERmtjelpUZUdGTVFrUlVOMmxIUmpjMmVtNVFiSEp5ZERoR1RHWlNiV1o1TkdKNFFUWkpla1V0ZDFKckxWWmFjRlY2YldadU1sTkVkV0phUldzelpsbDNiV0phYkZWUk1ERmhPREZWVVRRMVNuWlBOVU5hWkVaZlMyTTFFaFowU0RaRFdVbERZVWRmUTJ4ZlVXSklYM0ZUUVVOQkdpSkJUMDFaVW5kQ2FUZGhRVFJHV1dWbWJWRXhhbEZWUkdWcE4ycHJPRmxrYzJGQiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzQwIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExpbmtlZEluIiwibGluayI6Imh0dHBzOi8vc2cubGlua2VkaW4uY29tL2pvYnMvdmlldy9hcHBsaWNhdGlvbi1zdXBwb3J0LWFuYWx5c3QtYXQtcmVjcnVpdC1leHByZXNzLXB0ZS1sdGQtMjUxNDQ0ODA2OT9yZWZJZD1mNTY3NDYyYS1lNTNiLTRiNWQtOWNkYi0xN2M1NWVjNDQ5YWFcdTAwMjZ0cmFja2luZ0lkPUVUS3MvTGJMN0V6SXNNVXZiVmNvWEElM0QlM0RcdTAwMjZwb3NpdGlvbj0xNlx1MDAyNnBhZ2VOdW09MFx1MDAyNnRyaz1wdWJsaWNfam9ic19qb2ItcmVzdWx0LWNhcmRfcmVzdWx0LWNhcmRfZnVsbC1jbGlja1x1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Business Analyst", "company_name": "NTT DATA Singapore Pte Ltd", "location": "Singapore (+1 other)", "via": "via Jobs | Fidanto", "description": "Bachelor's degree\n• 1-4 years of experience working as Business Consultant in Finance/Insurance domain.\n• Educational Qualification - Graduate (BE/BTech preferred)\n• Good knowledge of digital applications and financial products\n• Experience of having worked on a policy administration system\n• Very good communication skills\n• 1+ year(s) of experience using tools in the Microsoft Office Suite (Excel, PowerPoint, Word, Outlook)\n• Flexibility and willingness to travel, potentially 75%\n\n• Experienced in AEM, PEGA & CMS(Content management system) technologies.\n• Certification in Insurance domain, AEM, PEGA & CMS will be added advantage.\n• Good knowledge of digital applications and financial products\n• Competent ability with SQL - able to write functional queries and procedures\n• Provide proactive consulting, analyze requirements, gather Business Requirements\n• Prepare business blueprint, functional specification documents\n• Prepare solutions and coordinate with technical team with viable... solution matching business requirements.\n• Designing test plan and test cases.\n• Perform integration testing and conduct user acceptance test (UAT) with business users\n• Conduct training to business users when necessary\n• Good knowledge of Project management tools such as HPQC & JIRA\n• Create Process Flows of existing and proposed system\n• Good communication and presentation skills\n\n• Assisting project teams in defining client's problem\n• Conducting research, interviews with key stakeholders, and/or other business analysis tasks\n• Contributing to client deliverables and project routines\n• Prior knowledge and/or experience using tools like JIRA or TFS\n• Suggest areas for process and productivity improvements within the team\n• Collating and reconciling data and information from various sources to ensure completeness and accuracy\n• Producing and providing clarification on periodic or ad-hoc reports or analyses within the project framework\n• Participating in planning of roadmaps, projects and work streams to ensure the delivery of the required outputs.\n• Helps with creating Insurance domain assets.\n• Innovative thinking, resourcefulness, and agility by leveraging best practices and creativity to get things done\n• Team player that knows how to Influence and partner by building strong relationships with leaders, peers, and clients", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJCdXNpbmVzcyBBbmFseXN0IiwiaHRpZG9jaWQiOiIyYXpYQXducUFaTkNxa291QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnMgfCBGaWRhbnRvIiwibGluayI6Imh0dHBzOi8vc2cuZmlkYW50by5jb20vam9icy9qb2Itb3BlbmluZy9idXNpbmVzcy1pbnRlbGxpZ2VuY2UtYW5hbHlzdHMvYnVzaW5lc3MtYW5hbHlzdC0yNzUyMjExODY/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Senior Forensic Analyst", "company_name": "Manpower Staffing Services (S) Pte Ltd", "location": "Singapore (+1 other)", "via": "via LinkedIn", "description": "Description\n\nJob Description :\n\nRole will be responsible for conducting forensic investigations and analysis in support of cyber incidents that are reported into the Incident Response team. This role will require the ability to triage and conduct thorough examinations of all types of digital media across a diverse environment, the ability to determine containment and/or remediation activities that may be required as well as identify potential threats. Reporting and collaborating with the different areas of business is required.\nQualifications: At least 5 years of experience in IT Security Digital Forensics At least 5 years of experience in Incident Response in a global corporate enterprise Demonstrated computer forensic investigations experience. Excellent technical writing and presentation skills. Expert-level knowledge of common attack vectors and penetration techniques. Solid working knowledge of networking technology and tools, firewalls, proxies, IDS/IPS and encryption... Demonstrated knowledge of forensic tools (Encase, FTK, Axiom Magnet, Black Bag, SIFT, Kali) Experience with malware analysis (reverse engineering). Experience managing large and small-scale cyber security incidents. Demonstrated understanding of database structures and SQL. Conduct examination of digital media (hard drives, network traffic, images, etc.). Capture / analyze network traffic for indications of compromise. Review log-based data, both in raw form and utilizing SIEM or aggregation tools. Perform live network assessments using leading packet capture and analysis software tools. Establish timelines and patterns of activity based on multiple data sources. Identify, document and prepare reports on relevant findings. Excelent understanding of networking protocols Experience with programming or scripting languages (Python, Ruby, Powershell) Demonstrated system administration skills. Degree in IT or any related discipline\n\nRequired Certifications (any two of the following) ACE (Access Data Certified Examiner) EnCe ( EnCase Certified Examiner) AWS Security GCFE (GIAC Certified Forensics Examiner) GNFA (GIAC Network Forensics Analyst) GCIA (GIAC Certified Intrusion Analyst) GCIH (GIAC Certified Intrusion Handler) GREM (GIAC Reverse Engineering Malware) OSCP (Offensive Security Certified Professional)\nRvin James Murillo Andalan EA License No. 02C3423 Personnel Registration No. R1331697\nPlease note that your response to this advertisement and communications with us pursuant to this advertisement will constitute informed consent to the collection, use and/or disclosure of personal data by ManpowerGroup Singapore for the purpose of carrying out its business, in compliance with the relevant provisions of the Personal Data Protection Act 2012. To learn more about ManpowerGroup's Global Privacy Policy, please visit https://www.manpower.com.sg/privacy-policy", "extensions": ["28 days ago", "Full–time"], "detected_extensions": {"posted_at": "28 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgRm9yZW5zaWMgQW5hbHlzdCIsImh0aWRvY2lkIjoiYmVXWFJBT0xOQU9JUEs5RkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL3NnLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvc2VuaW9yLWZvcmVuc2ljLWFuYWx5c3QtYXQtbWFucG93ZXItc3RhZmZpbmctc2VydmljZXMtcy1wdGUtbHRkLTI1MDcyOTc3Mzk/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "IT Support Executive", "company_name": "bizconnectivity", "location": "Singapore", "via": "via Glassdoor", "description": "IT Support Executive\n\nThe role of the IT Support Executive at Business Connectivity Pte Ltd is to ensure proper computer, server, network operations so that end users can accomplish organizational tasks. This includes receiving, prioritizing, documenting and actively resolving end user help requests. Problem resolution will involve the use of diagnostics and help request tracking tools, as well as require that the individual gives hands-on help at the desktop, network and server level.\n\nThe role will require travelling to client’s premises to work and will involve the meeting of clients.\nQualification\n\n– Bachelor Degree/Post Graduate Diploma/Professional Degree in Computer Science/Information Technology or equivalent\n\n– Proficiency in English Language\n\n– Professional Certification an added advantage – MCSA, MCSE, CCNA, ITIL\nJob skills\n\n– Minimum 2 years working experience in related field preferably entry level specialized in IT/Computer – Network/System/Database Admin or... equivalent\n\n– Knowledge of basic computer hardware and software\n\n– Experience with network and servers operating system\n\n– Experience with desktop operating systems including Windows and Mac OS, Linux, Ubuntu, Zpanel, WMWare, Citrix, IIS\n\n– Extensive application support experience\n\n– Strong documentation skills\n\n– Exceptional interpersonal skills, with a focus on rapport building, listening and questioning skills\n\n– Good written and oral communication skills\n\n– Strong analytical and problem solving skills\n\n– Good understanding of the organizations goals and objectives\nJob Responsibilities\n\n– Setup, maintenance and monitoring of servers, computer networks and security\n\n– Evaluate documented resolutions and analyse trends for ways to prevent future problems\n\n– Record, track and document the help desk request problem-solving process including all successful and unsuccessful decisions made, and actions taken, through to the final resolution\n\n– Access software updates, drivers, knowledge bases, and frequently asked questions resources on the internet or in our Resource DataBase to aid problem resolution\n\n– Identify and learn appropriate software and hardware used and supported by the Company\n\n– Perform post-resolution follow-ups to help requests\n\n– Develop help sheets and knowledge base articles for end users\n\n– Acquisition and deployment as required\n\n– Build rapport and elicit problem details from help desk and off-site customers\n\n– Other duties as assigned\n\nPlease submit your application to hr@bizconnectivity.com\n\nAt Business Connectivity, we understand that the success of our company can only be achieved through teamwork with the contribution of every team member. We believe that growth is important regardless of age or experience, and therefore we actively seek to nurture and train each and every one of our staff. If you would like to join our family and be part of our team, send in your resume to hr@bizconnectivity.com", "extensions": ["16 days ago", "Full–time"], "detected_extensions": {"posted_at": "16 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJJVCBTdXBwb3J0IEV4ZWN1dGl2ZSIsImh0aWRvY2lkIjoiZ3ZtaU9yV0VueDFlYzJjMUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBHbGFzc2Rvb3IiLCJsaW5rIjoiaHR0cHM6Ly93d3cuZ2xhc3Nkb29yLnNnL2pvYi1saXN0aW5nL2l0LXN1cHBvcnQtZXhlY3V0aXZlLWJpemNvbm5lY3Rpdml0eS1KVl9JQzMyMzU5MjFfS08wLDIwX0tFMjEsMzYuaHRtP2psPTM2NTcyMjk1NDBcdTAwMjZ1dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Business Operations", "value": "GC06"}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Accounting and Finance", "value": "GC01"}, {"text": "Science and Engineering", "value": "GC27"}, {"text": "Advertising and Marketing", "value": "GC03"}, {"text": "Legal", "value": "GC17"}, {"text": "Management", "value": "GC18"}, {"text": "Protective Services", "value": "GC23"}, {"text": "Customer Service", "value": "GC10"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Property", "value": "GC24"}, {"text": "Sales and Retail", "value": "GC26"}, {"text": "Social Services and Non-Profit", "value": "GC28"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "Business analyst", "value": "business analyst"}, {"text": "Analyst", "value": "analyst"}, {"text": "Security analyst", "value": "security analyst"}, {"text": "Systems analyst", "value": "systems analyst"}, {"text": "It analyst", "value": "it analyst"}, {"text": "Data analyst", "value": "data analyst"}, {"text": "System analyst", "value": "system analyst"}, {"text": "Support analyst", "value": "support analyst"}, {"text": "Test analyst", "value": "test analyst"}, {"text": "Associate", "value": "associate"}, {"text": "Management analyst", "value": "management analyst"}, {"text": "Operations analyst", "value": "operations analyst"}, {"text": "Soc analyst", "value": "soc analyst"}, {"text": "Research analyst", "value": "research analyst"}, {"text": "Senior", "value": "senior"}, {"text": "Senior analyst", "value": "senior analyst"}, {"text": "Control analyst", "value": "control analyst"}, {"text": "Intelligence analyst", "value": "intelligence analyst"}, {"text": "Manager", "value": "manager"}, {"text": "Project analyst", "value": "project analyst"}, {"text": "Researcher", "value": "researcher"}, {"text": "Risk analyst", "value": "risk analyst"}, {"text": "Service analyst", "value": "service analyst"}, {"text": "Technology analyst", "value": "technology analyst"}, {"text": "Accounting analyst", "value": "accounting analyst"}, {"text": "Application analyst", "value": "application analyst"}, {"text": "Behavior analyst", "value": "behavior analyst"}, {"text": "Business", "value": "business"}, {"text": "Center analyst", "value": "center analyst"}, {"text": "Compliance analyst", "value": "compliance analyst"}, {"text": "Coordinator", "value": "coordinator"}, {"text": "Desk", "value": "desk"}, {"text": "Desk analyst", "value": "desk analyst"}, {"text": "Financial analyst", "value": "financial analyst"}, {"text": "Functional analyst", "value": "functional analyst"}, {"text": "Hr analyst", "value": "hr analyst"}, {"text": "Interns", "value": "interns"}, {"text": "Operations center", "value": "operations center"}, {"text": "Process analyst", "value": "process analyst"}, {"text": "Programmer analyst", "value": "programmer analyst"}, {"text": "Project manager", "value": "project manager"}, {"text": "Qa analyst", "value": "qa analyst"}, {"text": "Senior associate", "value": "senior associate"}, {"text": "Senior consultant", "value": "senior consultant"}, {"text": "Specialist", "value": "specialist"}, {"text": "Sr analyst", "value": "sr analyst"}, {"text": "Support executive", "value": "support executive"}, {"text": "Technical analyst", "value": "technical analyst"}, {"text": "Technical architect", "value": "technical architect"}, {"text": "Trainee", "value": "trainee"}, {"text": "Treasury analyst", "value": "treasury analyst"}, {"text": "Wealth management", "value": "wealth management"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Internship", "value": "INTERN"}, {"text": "Part-time", "value": "PARTTIME"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Research", "value": "/business/naics2007/5417"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Mining", "value": "/business/naics2007/21"}, {"text": "Real Estate", "value": "/business/naics2007/53"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Engineering Services", "value": "/business/naics2007/5413"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Utilities", "value": "/business/naics2007/22"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "SingTel", "value": "/m/020zfl"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "Trustwave", "value": "/m/0n3xjf5"}, {"text": "Government Technology Agency", "value": "/g/11gh0528nq"}, {"text": "OCBC", "value": "/m/055r27"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "Credit Agricole Group", "value": "/m/028vbm"}, {"text": "HSBC", "value": "/m/01vq1f"}, {"text": "Randstad Singapore", "value": "/g/11g70b50mr"}, {"text": "UL", "value": "/m/01q1gj"}, {"text": "VISA", "value": "/m/01kqjn"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "American Express", "value": "/m/01w6dw"}, {"text": "Avensys Consulting", "value": "/g/11g7022gjf"}, {"text": "Binance", "value": "/g/11hcz1r4wl"}, {"text": "BlueVoyant", "value": "/g/11h1y4qdlf"}, {"text": "Caterpillar", "value": "/m/0319hp"}, {"text": "Cognizant Singapore, Cognizant Technology Solutions", "value": "/m/03bf9h"}, {"text": "DBS Bank Ltd", "value": "/m/01q7n5"}, {"text": "Deloitte SEA", "value": "/g/11f_g4x9d_"}, {"text": "Dyson", "value": "/m/05cskg"}, {"text": "EPAM Systems", "value": "/m/0dlnrc"}, {"text": "Experis Singapore", "value": "/g/11dxpnwm3s"}, {"text": "JPMorgan Chase & Co.", "value": "/m/01hlwv"}, {"text": "Jobline Resources Pte Ltd", "value": "/g/11gp2647pn"}, {"text": "Medtronic", "value": "/m/03z4j3"}, {"text": "Mizuho Bank", "value": "/m/022103"}, {"text": "Public Service Division", "value": "/g/11g6__bv10"}, {"text": "RECRUIT EXPRESS PTE LTD", "value": "/g/11g706hzhq"}, {"text": "RHB Singapore", "value": "/g/11c73srg7f"}, {"text": "SITA", "value": "/m/06l20z"}, {"text": "Selby Jennings", "value": "/g/11fy2ds3gn"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "Xcellink Pte Ltd", "value": "/g/11c73prcqy"}, {"text": "Xilinx", "value": "/m/03dwkc"}, {"text": "103 Golden Agri International Pte Ltd", "value": "/g/11fy210tb9"}, {"text": "Activate Interactive Pte Ltd", "value": "/g/11dxq192l5"}, {"text": "Amazon", "value": "/m/0mgkg"}, {"text": "Apple", "value": "/m/0k8z"}, {"text": "Aramco", "value": "/m/01qjg2"}]}]}