{"search_metadata": {"id": "60827af2e93ff465aa6edcb7", "status": "Success", "json_endpoint": "https://serpapi.com/searches/ef5437bafc4fec11/60827af2e93ff465aa6edcb7.json", "created_at": "2021-04-23 07:44:50 UTC", "processed_at": "2021-04-23 07:44:50 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28product+manager%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=160", "raw_html_file": "https://serpapi.com/searches/ef5437bafc4fec11/60827af2e93ff465aa6edcb7.html", "total_time_taken": 0.9}, "search_parameters": {"q": "(product manager) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "160"}, "jobs_results": [{"title": "Global Payment Product Manager, Payment Network-Singapore", "company_name": "TikTok", "location": "Singapore", "via": "via Bayt.com", "description": "- Responsible for building and expanding the global payment network platform by connecting with payment partners like mainstream payment service providers, financial institutions around the world to support ByteDance Group’s business international expansion. - Managing end-to-end product development to deliver high-quality payment product in timely manner, taking the lead in analyzing partners' capabilities, business requirements, coordinating with Engineering, Business and other internal stakeholders, testing etc.\n- Responsible for upgrading and optimizing the platform products to enhance the platform's capability in improving end-user experience, operation efficiency, system stability, meeting compliance requirement, and reducing cost etc.\n- Bachelor Degree or above, excellent academic performance. Engineering or Computer Science background is a plus.\n- 2-5 years of work experience, at least 2 years of payment related experience. Have good understanding about global payment... ecosystem including but not limited to Cards, eWallets, Bank Transfer, Cash-based payment methods.\n- Experience in end-to-end product management in software or web technologies with good summarizing and abstract thinking ability.\n- Strong analytical skills, be able to think logically and independently.\n- Experience working with payment solution providers, banking service providers is a plus.\n- Have experience in system and platform design is a strong plus.\n- Strong execution skills with a sense of responsibility and ownership, drive projects forward and solve problems timely and efficiently.\n- Excellent communication skills, strong cross functional collaboration skills.\n- Entrepreneurial drive with appreciation of user experience and business and commercial issues.\n- Can use English as a working language and work in a multicultural cross functional team environment", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJHbG9iYWwgUGF5bWVudCBQcm9kdWN0IE1hbmFnZXIsIFBheW1lbnQgTmV0d29yay1TaW5nYXBvcmUiLCJjb21wYW55X25hbWUiOiJUaWtUb2siLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Ik9iY1Q2MFJoNU5CNUc0RzlBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQmF5dC5jb20iLCJsaW5rIjoiaHR0cHM6Ly93d3cuYmF5dC5jb20vZW4vc2luZ2Fwb3JlL2pvYnMvZ2xvYmFsLXBheW1lbnQtcHJvZHVjdC1tYW5hZ2VyLXBheW1lbnQtbmV0d29yay1zaW5nYXBvcmUtNTYzNjMwMTUvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Senior Product Manager - Car Financing - Consumer Secured Lending", "company_name": "OCBC Bank", "location": "Singapore", "via": "via Laimoon.com", "description": "Roles and Responsibilities:\n• Deliver car financing KPIs in terms of volumes, revenues, projects and initiatives\n• Design, plan and implement new products and features\n• Understand portfolio financials, analyse trends and initiate appropriate actions to optimise profits and returns\n• Collate and track competitive product offerings and devise appropriate sales objection handling and counter strategies\n• Work closely with Credit, Ops and other stakeholders to ensure that our policies and process is relevant and competitive, with the appropriate risk management & controls in place\n• Ensure that all product documentation is properly maintained and annual reviews/approvals are completed on time\n• Maintain product library and update marketing collaterals including website\n• Manage end-to-end process to ensure compliance to regulations and policies by working closely with RCU, ORMC, Risk, Ops, IT and other stakeholders\n• Drive continuous process enhancements, lead projects and initiatives to... achieve better efficiency, productivity and customer experience\n• Work with internal and external partners to plan, develop and execute on campaigns/events/activities to drive customer cross-sell and product bundles\nReporting:\n• Direct reporting to Head Car Financing & Renovation Loan Business, Consumer Secured Lending\n\nQualifications\nRequirements:\n• University degree\n• 3-5 years of experience in a product management role, preferably in lending business\n• Possess strong interpersonal, communication and problem solving skills.\n• Have drive, initiative and ability to work independently as well as in a team\nretail banking", "extensions": ["12 days ago", "Full–time"], "detected_extensions": {"posted_at": "12 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgUHJvZHVjdCBNYW5hZ2VyIC0gQ2FyIEZpbmFuY2luZyAtIENvbnN1bWVyIFNlY3VyZWQgTGVuZGluZyIsImNvbXBhbnlfbmFtZSI6Ik9DQkMgQmFuayIsImNvbXBhbnlfbWlkIjoiL20vMDU1cjI3IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiM0Vfa05IV1dqbDBJUjNlYUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFVVSkNaMFprVDJOcWNFeHFabEZvUjBWaVNFbDFPVkl0ZFhKVE9XRndSakZyUkhoUlNrazBZbmRGTjNGd1FrMXVURmh6UzJzeE1ucHhaMkk0YkhWek1VMWlNazVUWmtkVGFVVmZlRFJvWDA5SVJFTlNXa05sTUd0bk5UZFdRV2xDVWt4U1MwSm1RM2xsTFZCMlkxaEZNRXRsY0dSSVV6bDJkVWMwYVZaV2QzVkNkVU5SWDFJdFJVaERjbGRsVjJWUmVXaE9WbUZMZGxaUGMwaFJFaFk0Ym5GRFdVMTVhMFJqVjNkMFFXSmljRFl0YjBSQkdpSkJUMDFaVW5kRVlWTXhRV014U0ZWclNXaHBhMWxMT0ZWdlNURkRkSEJmTFhoQiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzExIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExhaW1vb24uY29tIiwibGluayI6Imh0dHBzOi8vam9icy5sYWltb29uLmNvbS9qb2JzL2V4dGVybmFsdmlldy8yNTgxNTE5Mz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Sr. Product Manager", "company_name": "Amazon", "location": "Singapore", "via": "via LinkedIn", "description": "Job Description\n\nAmazon Web Services (AWS) is a highly reliable, scalable, low-cost infrastructure platform in the cloud that powers hundreds of thousands of enterprise, government and start-up business and organizations globally.\n\nThe AWS Marketing Response Center (MRC) team is seeking an exceptionally bright, creative, multitasking and self-motivated individual to join the MRC global team.\n\nMRC is an important customer engagement arm in the Marketing organization. Our mission is to learn from customers, understand their needs, and educate them about the benefits of AWS and all the services we offer, in order to help them embark on their cloud journey quickly and easily. It is a critical function within the lead and demand generation process, with the objective to profile, nurture, and qualify marketing leads generated from various marketing events, campaigns, and activities.\n\nMRC OPAS owns Operation, Planning, Analysis and Scale for MRC team globally.MRC OPAS drives operations and... planning, conducts business analysis, and reports on programs. OPAS also drives non-linear scale and enablement programs for high performing MRC teams around the world, with the objective of increasing the quality of inbound leads through targeted profiling and lead nurturing activities. MRC OPAS also creates and executes projects to drive strategic focus area to achieve non-liner business growth.\n\nMRC OPAS is running a strategic project which leverages artificial intelligence and machine learning (AI/ML) services to transform the traditional customer engagement landscape into a personalized experience that makes it easy to onboard prospects and customers onto the AWS Cloud. MRC OPAS is seeking a talented, self-directed Technical Product Manager to drive the integration and deployment of AI/ML technology used for MRC activities.\n\nThis role will be responsible for driving the roadmap, defining product requirements, collaborating with engineering and tirelessly championing the needs of customers whom MRC Reps engaged with. Given the breadth of the platform we are building, this role will require coordination across many internal and external teams. You'll work with customers, partners, and operational stakeholders to prioritize roadmap features, and spearhead the definition of new capabilities through expertly crafted narratives and business requirements documents.\n\nThe ideal candidate will have exceptional problem solving skills, strong business judgment, and demonstrated experience leading cross-functional teams. We are looking for someone with a proven ability to execute both strategically and tactically, and who is excited to take on a new, ambiguous project that will be industry defining. A technical background is required to be able to effectively communicate and work with engineers.\n\nResponsibilities For This Position Include\n• Creating the product strategy for the new platform that appeals to unique needs and requirements of MRC teams\n• Managing the entire product life-cycle from strategic planning to tactical execution\n• Owning product strategy and roadmap for MRC platform and working with key stakeholders to deliver on MRC vision\n• Authoring product requirements documents\n• Research and identify new opportunities for AWS to innovate on behalf of our customers\n• Being customer obsessed to ensure the safety and security of customer data and information\n• Deploy technologies and processes to increase efficiency and effectiveness of MRC team.\n• Measure and report on the effectiveness of enablement investments and programs, including sharing insights with relevant stakeholders.\n• Lead and manage strategic projects which contribute to MRC business growth.\n\nBasic Qualifications\n• 5+ years of relevant work experience in product management\n• 5+ years of relevant work experience in program and project management\n• Bachelor's Degree in Computer Science, Information Technology, or related field required\n• Knowledge of cloud computing and AWS services, especially artificial intelligence and machine learning\n• Experience executing long term strategic roadmaps and handle demanding priorities\n• Ability to conceptualize, scope and execute projects to strict deadlines.\n• Exceptional written, verbal, and interpersonal communication skills\n• Ability to work in a highly ambiguous environment\n• Experience in gathering data, analysis and presentation (written and oral)\n• Ability to think logically and structure answers\n• Proven success managing time and juggling multiple projects in a high growth environment where priorities shift fast\n• Attention to detail\n• Great organizational skills\n\nPreferred Qualifications\n• Experience with marketing technology products a plus\n• Experience in B2B, high-tech products/services preferred\n• Has AWS SA Professional certification\n• Confident, self-motivated individual with strong, demonstrable bias for action.\n• Post-graduate education / Masters level qualification (MBA from top tier school is a plus)\n• Ability to handle confidential information with discretion, and deal with professionals inside and outside the company\n\nAmazon is an equal opportunity employer, and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, disability, age, or other legally protected status.\n\nJob Description : Amazon Web Services (AWS) is a highly reliable, scalable, low-cost infrastructure platform in the cloud that powers hundreds of thousands of enterprise, government and start-up business and organizations globally. The AWS Marketing\n\nExperience: 5.00-8.00 Years", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTci4gUHJvZHVjdCBNYW5hZ2VyIiwiY29tcGFueV9uYW1lIjoiQW1hem9uIiwiY29tcGFueV9taWQiOiIvbS8wbWdrZyIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6InRFMFEyblZVaTRLOUpnVVNBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVzc0JDb3dCUVU1VlgwNXhVbFV4T0ZaV2FXeG5TVGxsTURaS1RHTXhMVlZTVW5jeFEzSnNSVkY2T0dOcFp6a3dXbFJ6YWt4ZllqQkpZVkpyVVhGMmQxWk9aa1kwZDAxM1EyTlZVRWh4Ym5adGRHWmZVVnBMVW1WdGRHbExjM2d4V1RsYVJHVnNOMDgyUWs5UlptWmpObUl0Y25KQlEwUkxlV2xsTm5KM2RFMW9lbU14ZUUxTFJqSjNPVVZFUTNwWFp6SVNGamh1Y1VOWlRYbHJSR05YZDNSQlltSndOaTF2UkVFYUlrRlBUVmxTZDBGUFVEQXdVR1IzVEdVeE9FeDRaekkyYUZaT2FVZEhkbWhLVldjIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMTgiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGlua2VkSW4iLCJsaW5rIjoiaHR0cHM6Ly9zZy5saW5rZWRpbi5jb20vam9icy92aWV3L3NyLXByb2R1Y3QtbWFuYWdlci1hdC1hbWF6b24tMjQ3MTQ5MTQxMz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Product Policy Manager, Suicide Self Harm Dangerous Act (SSHDA)", "company_name": "TikTok", "location": "Singapore", "via": "via Bayt.com", "description": "As a Product Policy Manager, you will become an expert on safety issues such as Child Safety, Hate Speech, Bullying etc. and understand the impact of technology, media and cultural trends on these different safety issues. You will be part of a global and regional team, ensuring that our policies safeguard the safety of our users and platforms. What will I be doing?\n- Conduct further research and craft content policies for our global community on TikTok platforms, with a focus on safety issues such as Child Safety, Hate Speech, Bullying etc. etc\n- Collaborate with Global Public Policy, Product, Operations, Legal, and Public Relations teams to improve content policies and streamline enforcement policies and processes\n- Assist in articulating, interpreting, and implementing content policies externally and internally\n\nWhat should I bring with me?\n- Academic background in Public Policy, Law, or related experience\n- Significant experience in policy, policy enforcement, or public policy... specifically in technology/social media/content\n- Experience with international Internet/social media/content issues TikTok is committed to creating an inclusive space where employees are valued for their skills, experiences, and unique perspectives. Our platform connects people from across the globe and so does our workplace. At TikTok, our mission is to inspire creativity and bring joy. To achieve that goal, we are committed to celebrating our diverse voices and to creating an environment that reflects the many communities we reach. We believe individuals shouldn't be disadvantaged because of their background or identity, but instead should be considered based on their strengths and experience. We are passionate about this and hope you are too", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9kdWN0IFBvbGljeSBNYW5hZ2VyLCBTdWljaWRlIFNlbGYgSGFybSBEYW5nZXJvdXMgQWN0IChTU0hEQSkiLCJjb21wYW55X25hbWUiOiJUaWtUb2siLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IkwzWER3bzNaUlNDOFBDLW9BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQmF5dC5jb20iLCJsaW5rIjoiaHR0cHM6Ly93d3cuYmF5dC5jb20vZW4vc2luZ2Fwb3JlL2pvYnMvcHJvZHVjdC1wb2xpY3ktbWFuYWdlci1zdWljaWRlLXNlbGYtaGFybS1kYW5nZXJvdXMtYWN0LXNzaGRhLTU4ODAwNDYzLz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Product Manager-2100006788", "company_name": "Standard Chartered", "location": "Singapore", "via": "via Bayt.com", "description": "Product Manager - (2100006788)\n\nJob: Institutional Banking\nPrimary Location: Asia-Singapore-Singapore\n\nSchedule: Full-time\nEmployee Status: Permanent\nPosting Date: 29/Mar/2021, 10:44:26 AM\nUnposting Date: 30/Apr/2021, 10:59:00 PM\n\nAbout Standard Chartered\nWe are a leading international bank focused on helping people and companies prosper across Asia, Africa and the Middle East.\n\nTo us, good performance is about much more than turning a profit. It's about showing how you embody our valued behaviours - do the right thing, better together and never settle - as well as our brand promise, Here for good.\n\nWe're committed to promoting equality in the workplace and creating an inclusive and flexible culture - one where everyone can realise their full potential and make a positive contribution to our organisation. This in turn helps us to provide better support to our broad client base.\n\nThe Role Responsibilities\n\nStrategy\n\nOverall trade strategy has digitization of Trade as a key pillar to... transform the business over the next 3-5 years. The role is expected to leverage both proprietary channels/capabilities and pioneer innovation/partnerships with 3rd party platforms/consortiums to transform the doc trade business working with product managers, fintechs, internal tech, data & operations teams etc.\n\nBusiness\n\nThis group product manager role in trade digitization initiatives will steer the commercialisation and implementation of the digitization agenda across the Doc trade portfolio. This function within Trade Finance targets to address internal and client communications with regards to new initiatives, enhancements & digital product capabilities in the region and countries. It will ensure the alignment of multiple digitization and change management workstreams working with the Global Products Managers, Regional Trade Heads, Country Heads and relevant internal functions across Digital channels, data , operations, governance etc.\n\nThe incumbent has joint accountability (with digital channels, trade ops, implementation & product mgmt etc) for commercialisation of the trade digital initiatives and accountability\n\nProcesses\n• Manage sourcing, shortlisting and identification of digital solutions for Doc trade across client facing /operational efficiency enhancing solutions etc working with DCDA, ops, product, sales, regions\n• Work with DCDA, Product Mgmt, Sales & client to commercialize all relevant Trade Finance digitization, platform/partnership initiatives, enhancements, in order to achieve digital KPIs\n• Project manage the execution of live transactions together with LPMs\n•", "extensions": ["24 days ago", "Full–time"], "detected_extensions": {"posted_at": "24 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9kdWN0IE1hbmFnZXItMjEwMDAwNjc4OCIsImNvbXBhbnlfbmFtZSI6IlN0YW5kYXJkIENoYXJ0ZXJlZCIsImNvbXBhbnlfbWlkIjoiL20vMDJoc3prIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiVHlBcGtCckM1UktTSHdXcEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZZQkNyY0JRVTVWWDA1eFVteFZjV3RRYTFoRldGSmxVR0ZKUjFoNU4yZFdaelJCYlU0MGFHdzRObGxDV1c0eWMybENiVlpRVDBNMVpVVkpkM2xJY2psRU1FRTJOMjFXVUVGUmRFeG1hRVZpWDNaa1lXUndRM1pVYkdOUVRVSTFRMUpwY2pVMVJHbFRPVFZsYlVsbVZscDZiblF3Y0hCTVgwOW1hbmRtV1hCYVQyMVNVM1p3ZUhOMlJGbE5OM2xpY0UwMlIwUm1VWGxYWkRoTlNVUlVYMGRMWkVwc2EwczNTM0ZFVEc1RE1VZFdibWhFY0VSNlJWRnRhekJqRWhZNGJuRkRXVTE1YTBSalYzZDBRV0ppY0RZdGIwUkJHaUpCVDAxWlVuZEJOVk15VmsxclFXRkliM04yWmpkclJuUmlUMk5LYm5OeVlrVjMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18zMCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCYXl0LmNvbSIsImxpbmsiOiJodHRwczovL3d3dy5iYXl0LmNvbS9lbi9zaW5nYXBvcmUvam9icy9wcm9kdWN0LW1hbmFnZXItMjEwMDAwNjc4OC01OTI4NzQzMC8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Sr. Product Manager, AWS Professional Services", "company_name": "Amazon", "location": "Singapore", "via": "via LinkedIn", "description": "Job Description\n\nAWS Professional Services helps Customers achieve their desired business outcomes through the innovative use of the AWS platform. To ensure Customers have a seamless experience with accelerated time-to-value, AWS Professional Services builds and maintains Customer Solutions and Packaged Offerings. These Solutions and Offerings can be technology specific and/ or industry specific. We are looking for Sr. Product Managers who will build, launch, maintain, and enhance AWS Professional Services Solutions across Asia Pacific and Japan (APJ).\nPart technologist, part industry expert, part program manager, part product management – this multi-faceted hands-on role is based in Singapore with APJ coverage. This is an individual contributor role that will lead cross-functional efforts. In addition to building and launching AWS Professional Services Solutions, you'll also oversee the localization of Solutions for non-English speaking market segments.\nIt is always Day 1 at Amazon... As such, we're looking for candidates who embrace the entrepreneurial spirit – they understand the customer deeply, build and launch Solutions, localize them when needed, and iterate the Solution based on feedback.\nA great candidate will have hand-on skills with Cloud Architecture or Data Analytics, have experience in curating and launching professional services offerings at scale across APJ, would have worked in one or more industry verticals, possess excellent business acumen, have a proven track record of high-caliber program management, and have strong communication skills. Most of all, they will have a keen willingness to learn and demonstrate the Amazon Leadership Principles.\n\nResponsibilities\n• Responsible for end-to-end lifecycle of Solutions from build, launch, maintain, enhance, and retire.\n• Distill customer needs for both technical and industry Professional Services Solutions through direct customer engagement, market segment analysis, and input from other AWS teams.\n• Build end-to-end outcome-oriented AWS Professional Services Solutions including: Delivery kit (code, diagrams, documentation); Sales kit (proposal, pitch deck, statement of work); Delivery and Sales enablement content\n• Develop and execute Solution launch plans through collaboration with other AWS functions.\n• Measure Solution adoption and impact including customer feedback.\n• Capture and publish customer references.\n• Work with internal teams and external vendors to localize Solutions for non-English speaking market segments (you do *not* need to be an expert in non-English languages!)\n• Contribute to Enterprise programs working closely with AWS Business Development, Sales, Solution Architecture, Professional Services teams.\n• Solution delivery is not a core part of the role. However, the Sr. Product Manager will guide delivery resources from time-to-time, primarily post-launch.\n• Where relevant, work with members of the AWS Partner Network (APN) to co-develop Solutions.\n• This is an individual contributor role.\n• Approximately 25% travel expected (only after Covid-19 travel restrictions lift).\n\nBasic Qualifications\n• 15+ years of experience in technical product management or professional services for a technology consulting/ software development organization.\n• Proven track record in analysis of customer needs across market segments.\n• Led and delivered Cloud programs (e.g., Cloud migrations, developed Cloud native applications).\n• Must have hands-on skills with Cloud Architecture and/ or Data Analytics.\n• Experience with Agile delivery, engagement leadership and product lifecycle management.\n• Understanding of distributed systems and operating at Cloud scale.\n• Regional experience across Asia Pacific and Japan. Must be comfortable working with a globally dispersed organization.\n• Excellent written and verbal communication skills.\n\nPreferred Qualifications\n• All of the basic qualifications.\n• A minimum of 5 years' experience working with customers from an industry vertical (preferred verticals include Financial Services, Telco, Manufacturing, Oil and Gas, Media & Entertainment).\n• Exposure to Lean product management/ Design Thinking.\n• AWS certified or equivalent. Associate level or Professional level (preferred", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTci4gUHJvZHVjdCBNYW5hZ2VyLCBBV1MgUHJvZmVzc2lvbmFsIFNlcnZpY2VzIiwiY29tcGFueV9uYW1lIjoiQW1hem9uIiwiY29tcGFueV9taWQiOiIvbS8wbWdrZyIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImstTURCMVl0U01Ub0hxNDdBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVzc0JDb3dCUVU1VlgwNXhWSFJoUlRONGVXVmlORGh6YzA5VVdWRnRhekpIUWxjNFN5MVhSSEJEZDNSRlZEbGpaV2RNYUc1SVNGTlZlbVZPYmtsUmNsTmtUemQxYUd4Qk5XOHdkMUUzT1dob1RtWXpSM2cwVVZOaWNYaFJjM0pmZDFGdlJUaFlkbUp4YjAxUVpFbFVTME14Ym1jMlYxTkVTR2xQVWpaV1FUSlRhbHB2VUZOUGNFazRVV3RrZVVSWVlXZ1NGamh1Y1VOWlRYbHJSR05YZDNSQlltSndOaTF2UkVFYUlrRlBUVmxTZDBGS1VUbHhSUzEyUmtGSWJFNUNXR0ZrU1dkSVp6ZEtOa1pKZEVFIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMzciLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGlua2VkSW4iLCJsaW5rIjoiaHR0cHM6Ly9zZy5saW5rZWRpbi5jb20vam9icy92aWV3L3NyLXByb2R1Y3QtbWFuYWdlci1hd3MtcHJvZmVzc2lvbmFsLXNlcnZpY2VzLWF0LWFtYXpvbi0yNTA3Mjg3ODE0P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Product Manager (AM/M) - Share Margin Financing, OSPL - Products Group", "company_name": "OCBC Bank", "location": "Singapore", "via": "via Laimoon.com", "description": "Roles and Responsibilities:\n• Product Manager for Share Margin Financing.\n• Operations management - Integrate functions (end-to-end value chain) of respective departments to optimize day-to-day running of business.\n• Preparation of monthly BAU Computation on interest income sharing pay-out, Monthly Management Reporting presentation, daily data management of margin statistics.\n• Performance management - Review pricing structures, monitor and analyse loans and client base. Monitor TR performance and review incentive schemes. Stats tracking for reporting and business planning.\n• Co-ordinate and manage cross-functional initiatives.\n• Need to be able to provide support on weekends or public holidays for month end reporting preparations.\n• Any other ad-hoc activities as assigned.\nReporting to:\n• VP, Share Margin Financing\n\nQualifications\nRequirements:\n• At least 5 years working experience in consumer lending products,\n• Strong work ethics and competency in Microsoft office (Excel... PowerPoint is a must).\n• Excellent communication and interpersonal skill, with ability to work well with internal and external partners\n• Self-driven with initiative and integrity to meet deadline and deliver good work\n• Able to work independently and as a team\n• Possess logical and critical thinking with strong analytical skills\nfx & money markets", "extensions": ["13 days ago", "Full–time"], "detected_extensions": {"posted_at": "13 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9kdWN0IE1hbmFnZXIgKEFNL00pIC0gU2hhcmUgTWFyZ2luIEZpbmFuY2luZywgT1NQTCAtIFByb2R1Y3RzIEdyb3VwIiwiY29tcGFueV9uYW1lIjoiT0NCQyBCYW5rIiwiY29tcGFueV9taWQiOiIvbS8wNTVyMjciLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJKUTgwR1UxMk9YdWZfTzdpQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VWsxa1NIbFRYMVZpYzIxRlpqVmFjRTV2Y2pObWEwNDNjMkpaUVc1RGEybDVNR2RJZW1ZNGJtbDFWMDlZUm0xeVZtTklPR1ZzU1Y4MlNrcGlTMkp2VTFFNWIxQnpVekJ1YkRod1lYTnJjSHBxUjJJMGJXSTFaemhYZGtkb0xXTmFlVEJwYVRWUlVsVndZVU52T0V4bGFHTXdPRmwxWldkNFEyOTNibTg0U2tnelVXaFVka1JtWTJjNGNIVmpjMlprTjBsdVFub3pablppTFVGUkVoWTRibkZEV1UxNWEwUmpWM2QwUVdKaWNEWXRiMFJCR2lKQlQwMVpVbmREY2taR1JtRXpXazFRTld4c1lYWjFNMnhWTmxoUk4yeDRPSGhSIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNDUiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGFpbW9vbi5jb20iLCJsaW5rIjoiaHR0cHM6Ly9qb2JzLmxhaW1vb24uY29tL2pvYnMvZXh0ZXJuYWx2aWV3LzI1ODE0OTUxP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Regional Senior Product Manager, Monetization Integrity", "company_name": "TikTok", "location": "Singapore", "via": "via Bayt.com", "description": "TikTok is the leading destination for short-form mobile video. Our mission is to inspire creativity and bring joy. TikTok has global offices including Los Angeles, New York, London, Paris, Berlin, Dubai, Mumbai, Singapore, Jakarta, Seoul and Tokyo. Key responsibilities:\n- Craft ad integrity processes and risk control product strategies on TikTok platforms.\n- Plan and manage complex ad integrity-related projects from problem definition to final execution. - Work closely with cross-functional partners (ad policy, product management, data analytics, operations, engineering) to identify, assess and resolve ad integrity-related issues in our products.\n- Manage the roadmap: effectively prioritize business opportunities from a wide range of inputs so that you are working on the most impactful projects.\n- Translate customer, employee and systems problems into tangible customer improvements. - Design localized services and integrity solutions that meet the unique requirements of local... markets.\n- 5-10 years experience in product management; ideally, in ad integrity or risk control.\n- You’re entrepreneurial. You're self-driven. Comfortable working in fast-paced environments and passionate in building products that scale. - A clear communicator of product decisions and their rationale.\n- Deep interest in developing business opportunities through solving customer problems. - Experience with project management and coordination.\n- Excellent communication skills (written and verbal) in stakeholder management. - Highly data-sensitive, capable of in-depth data interpretation.\n- Bachelor's degree or above; technical background a plus", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJSZWdpb25hbCBTZW5pb3IgUHJvZHVjdCBNYW5hZ2VyLCBNb25ldGl6YXRpb24gSW50ZWdyaXR5IiwiY29tcGFueV9uYW1lIjoiVGlrVG9rIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJ4YjhHMDF5dkVnWjlIaWpxQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJheXQuY29tIiwibGluayI6Imh0dHBzOi8vd3d3LmJheXQuY29tL2VuL3NpbmdhcG9yZS9qb2JzL3JlZ2lvbmFsLXNlbmlvci1wcm9kdWN0LW1hbmFnZXItbW9uZXRpemF0aW9uLWludGVncml0eS01OTA1MDUzNi8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Blockchain Product Manager", "company_name": "Binance", "location": "Singapore", "via": "via Bayt.com", "description": "Binance is the global blockchain company behind the world’s largest digital asset exchange by trading volume and users, serving a greater mission to accelerate cryptocurrency adoption and increase the freedom of money.\n\nAre you looking to be a part of the most influential company in the blockchain industry and contribute to the crypto-currency revolution that is changing the world?\n\nWe are looking for an experienced/senior Product Manager to focus on Binance Chain or other blockchain initiatives and strategies. He/She should be a capable blockchain enthusiast with a leadership mindset of innovation and creativity for developing existing and new Products. He/She should also be familiar with user growth techniques, and focus to increase the user base by continuously improving the products, through combining different resources and planning with timelines.\n\nResponsibilities\n• Research, innovate and inspire viable new product development strategies and execute up to product launch and... beyond.\n• Responsible for products across multiple blockchain technology stacks, including Wallets of all platforms, DEX, DeFi etc.\n• Coordinate and communicate with other teammates and across with others teams inside and outside Firm to push the deliveries, promote information sharing and improve collaboration efficiency.\n• Focus on product operation data and be responsible for product line business results\n\nRequirements\n• 2+ years of product management or related work experience, or technology background with 1+ year of product management experience.\n• Familiar with blockchain industry and related technology, especially on cryptocurrency wallets, dApps, exchange, smart contract.\n• Ability to analyze data and combine business specific issues to obtain and research data, in order to push user adoption and growth.\n• Maintain good learning ability and new things and acceptance, excellent communication and coordination skills, work responsibility and enthusiasm.\n• Experience in internationally renowned Internet companies, or experience in product development for large Internet platform products are great bonus.\n• Experience in global facing products is preferred, especially payments or financial software products", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJCbG9ja2NoYWluIFByb2R1Y3QgTWFuYWdlciIsImNvbXBhbnlfbmFtZSI6IkJpbmFuY2UiLCJjb21wYW55X21pZCI6Ii9nLzExaGN6MXI0d2wiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJfeEx3dmUxOEFJbHRZV2tMQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VW5GaWFYVlpOVTkxWlRWRWVqQllhME10U213eWMyVjBORXcyTW5WbldIWnVlbkpSTXpVNFVuUmlNMlZUTld0RlFXdE5SRTlITTB0VWVtZ3llREp1YTJ0dFRIQklURkZZVFRWUGVFSTVaRFUxV21WNU5HcGxWVmw1Vkdrek1raENaRVYzYTFObVJGaDRhelZUVDFNNFkwY3laM1pmT1RGSE5UYzNUVWg1Tm1aUk1TMWlUMnBPWVVWUE9FMVRhMHhSTjFGcU1WODJUVVJUVVRSQkVoWTRibkZEV1UxNWEwUmpWM2QwUVdKaWNEWXRiMFJCR2lKQlQwMVpVbmREYTNaT1NYVm1SblYwV21jd1JXVktZV3hEU2s4M1RIZHFObmRCIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNTYiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQmF5dC5jb20iLCJsaW5rIjoiaHR0cHM6Ly93d3cuYmF5dC5jb20vZW4vc2luZ2Fwb3JlL2pvYnMvYmxvY2tjaGFpbi1wcm9kdWN0LW1hbmFnZXItNTkxOTgxNDEvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Product Manager (Artificial Intelligence Platforms)", "company_name": "GVT Government Technology Agency (GovTech)", "location": "Singapore", "via": "via Workday", "description": "The Government Technology Agency (GovTech) aims to transform the delivery of Government digital services by taking an \"outside-in\" view, putting citizens and businesses at the heart of everything we do. We also develop the Smart Nation infrastructure and applications, and facilitate collaboration with citizens and businesses to co-develop technologies.\n\nJoin us as we support Singapore’s vision of building a Smart Nation - a nation of possibilities empowered through info-communications technology and related engineering.\n\nWho we are\nGovTech's Data Science and Artificial Intelligence (DSAI) division uses technology and data to help deliver high-quality digital services to citizens and businesses in Singapore. We build software products for government agencies to better understand and use their data to improve operations and decision making.\n\nWhat the role is\nProduct managers help make sure the right things get done. At a high level, this means establishing a clear vision for what a... product should be and what needs to be done to get there. On a day to day basis, this means handling all the different facets of a project and making sure they are coordinated. And at the core, this means building a foundation of knowledge across user needs, technical constraints, and design goals so you can act as a bridge across all of them.\n\nConcretely this means:\n• Making good product decisions\n• Working with designers to create intuitive user experiences\n• Creating multiple proposals for the many forms a product can take\n• Driving the team toward consensus on what the product should be\n• Understanding users better than anyone else\n• Conducting user studies to understand their needs and problems\n• Analysing data to uncover usage patterns that inform product decisions\n• Researching the industry to understand existing solutions\n• Work closely with the engineering team\n• Translating the product strategy into detailed, actionable plans for business and engineering teams\n• Communicating across teams\n• Explaining technical considerations to non-technical audiences\n• Public-speaking, giving presentations and writing papers\n• Identifying key stakeholders, including government agencies, industry partners and the broader tech community, and convincing them to give their support\n• Coordinating efforts across multiple functions including marketing, legal and finance\n• Keeping things organised\n• Running efficient meetings to keep people updated and make good decisions\n• Prioritising, planning, and tracking what needs to be done\n• Documenting key information and decisions about the product\n\nWhat it is like working here\nWe build products that serve a variety of agency users, who use them to solve highly meaningful problems pertinent to our society, from transportation, to education, to healthcare. The public sector is full of opportunities where even the simplest software can have a big impact on people’s lives. We are here to improve how we live as a society through what we can offer as a government.\n• Rapid Prototyping - Instead of spending too much time debating ideas we prefer testing them. This identifies potential problems quickly, and more importantly, conveys what is possible to others easily.\n• Reliable Productization - To scale an idea, a prototype or a Minimum Viable Product to a software product, we scrutinize and commit to its usability, reliability, scalability and maintainability.\n• Ownership - In addition to technical responsibilities, this means having ideas on how things should be done and taking responsibility for seeing them through. Building something that you believe in is the best way to build something good.\n• Continuous Learning - Working on new ideas often means not fully understanding what you are working on. Taking time to learn new architectures, frameworks, technologies, and even languages is not just encouraged but essential.\n\nWhat we are looking for\nThe customers for our products are normally agency users, which means that prior public service experience will help. A disciplined approach and strong problem-solving instincts are fundamental to succeed. Your aptitude for completing the tasks and attitude to continuous learning are more valued than any formal certification.\n\nWe look for people who:\n• Have solid communication and stakeholder management skills\n• Can analyse and use data to solve problems\n• Have an interest in data science and machine learning\n• Have good design sense\n• Have experience writing code\n• Take initiative to make things happen\n• Want to work for the public good", "extensions": ["16 days ago", "Full–time"], "detected_extensions": {"posted_at": "16 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9kdWN0IE1hbmFnZXIgKEFydGlmaWNpYWwgSW50ZWxsaWdlbmNlIFBsYXRmb3JtcykiLCJjb21wYW55X25hbWUiOiJHVlQgR292ZXJubWVudCBUZWNobm9sb2d5IEFnZW5jeSAoR292VGVjaCkiLCJjb21wYW55X21pZCI6Ii9nLzExZ2gwNTI4bnEiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJ6OGRyMHJQVEtPZFVDbTRjQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFcllDQ3ZjQlFVNVZYMDV4Vkdodlh6bDVOR3RuVDBoblh6ZzRTbVphVjNocWVVMU1OMHcyT1dSWk0wUTNNUzEzY0Y5WVNFeHFjbmhuVEZkZmEyWmZXa2haT1c5TlF6UkNURUZoWDJnMlJWWkdTbDkwVVUxbVNDMHlTbEpLTFdjNFNXZHVZWGhoU0hOMVNpMU1iemxmTTJ3MmRqaEhlVk5FWjBKU2FqVk5hbFkyWTJFdGNHNUliRTk2YzFkWk4wZGlOUzFHZGs5aVFYcFNSbFJuT1ZaMlYzZzNkRzFKZDBGdVNIUkliVUpXVGtjM1dUVjJaVEJIWkdSUFptcEdVR1ZIVDFsWk9XcHFlalJ2YldadFVtUnJjVE5LT1hWRVoyMVJiV2xMTUdaVmFXUmhWM2xPU0ZKNE1tWjRORlkxTWxCdU9EUlZXVFEyY1hKWE0yOTRVUklXT0c1eFExbE5lV3RFWTFkM2RFRmlZbkEyTFc5RVFSb2lRVTlOV1ZKM1JGVlRMVVZtUjJSVlpYcGpVMFF6VVdadFoyczVkMDlUVDNWMlVRIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNjQiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gV29ya2RheSIsImxpbmsiOiJodHRwczovL3NnZ292dGVycC53ZDEwMi5teXdvcmtkYXlqb2JzLmNvbS9QdWJsaWNTZXJ2aWNlQ2FyZWVycy9qb2IvU2luZ2Fwb3JlL1Byb2R1Y3QtTWFuYWdlci0tQXJ0aWZpY2lhbC1JbnRlbGxpZ2VuY2UtUGxhdGZvcm1zLV9KUi0xMDAwMDAwMDUyMz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Management", "value": "GC18"}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Business Operations", "value": "GC06"}, {"text": "Advertising and Marketing", "value": "GC03"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Accounting and Finance", "value": "GC01"}, {"text": "Legal", "value": "GC17"}, {"text": "Farming and Outdoors", "value": "GC13"}, {"text": "Human Resources", "value": "GC15"}, {"text": "Sales and Retail", "value": "GC26"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "Product manager", "value": "product manager"}, {"text": "Manager", "value": "manager"}, {"text": "Project manager", "value": "project manager"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Development manager", "value": "development manager"}, {"text": "Director", "value": "director"}, {"text": "Manufacturing manager", "value": "manufacturing manager"}, {"text": "Marketing manager", "value": "marketing manager"}, {"text": "Plant manager", "value": "plant manager"}, {"text": "Production manager", "value": "production manager"}, {"text": "Program manager", "value": "program manager"}, {"text": "Regional", "value": "regional"}, {"text": "Senior", "value": "senior"}, {"text": "Sr. manager", "value": "sr. manager"}, {"text": "Account manager", "value": "account manager"}, {"text": "Admin manager", "value": "admin manager"}, {"text": "Affairs manager", "value": "affairs manager"}, {"text": "Assistant", "value": "assistant"}, {"text": "Brand manager", "value": "brand manager"}, {"text": "Commodity manager", "value": "commodity manager"}, {"text": "Communication", "value": "communication"}, {"text": "Customer", "value": "customer"}, {"text": "Dealer", "value": "dealer"}, {"text": "Devops engineer", "value": "devops engineer"}, {"text": "Engineering", "value": "engineering"}, {"text": "Executive", "value": "executive"}, {"text": "Product specialist", "value": "product specialist"}, {"text": "Production supervisor", "value": "production supervisor"}, {"text": "Risk manager", "value": "risk manager"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Transactional", "value": "transactional"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Internship", "value": "INTERN"}, {"text": "Part-time", "value": "PARTTIME"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Toiletries", "value": "/business/naics2007/3256"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Foods & Beverages", "value": "/business/naics2007/311"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Management", "value": "/business/naics2007/55"}, {"text": "Research", "value": "/business/naics2007/5417"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "Citi", "value": "/m/01dfb6"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "Amazon", "value": "/m/0mgkg"}, {"text": "Binance", "value": "/g/11hcz1r4wl"}, {"text": "Standard Chartered", "value": "/m/02hszk"}, {"text": "United Overseas Bank", "value": "/m/04gjd1"}, {"text": "Apple", "value": "/m/0k8z"}, {"text": "Tata Communications", "value": "/m/04338k"}, {"text": "Workato", "value": "/g/11dxpy_3xd"}, {"text": "BNY  Mellon", "value": "/m/02vps5x"}, {"text": "DBS Bank", "value": "/m/01q7n5"}, {"text": "EPAM Systems", "value": "/m/0dlnrc"}, {"text": "GVT Government Technology Agency (GovTech)", "value": "/g/11gh0528nq"}, {"text": "Grab", "value": "/m/0134c_p9"}, {"text": "Paypal", "value": "/g/122s91_5"}, {"text": "PeopleSearch Pte Ltd", "value": "/g/11c73ngn0w"}, {"text": "Randstad", "value": "/m/08pt1z"}, {"text": "Singapore Airlines", "value": "/m/015f2x"}, {"text": "TEKsystems (Allegis Group Singapore Pte Ltd)", "value": "/g/11b6g4bkv0"}, {"text": "ABBOTT LABORATORIES (SINGAPORE ) PRIVATE LIMITED", "value": "/m/09m57z3"}, {"text": "ADVANCE INTELLIGENCE PTE. LTD.", "value": "/g/11dymfkxss"}, {"text": "AXA", "value": "/m/04mn99"}, {"text": "Adecco Personnel Pte Ltd", "value": "/m/08gz46"}, {"text": "Adidas Group", "value": "/m/01jtml"}, {"text": "Aetna, a CVS Health Company", "value": "/m/0kg8x"}, {"text": "Agency for Science, Technology and Research", "value": "/m/0gmjcg"}, {"text": "Alibaba", "value": "/m/07s6ctl"}, {"text": "Argyll Scott", "value": "/g/11dxpk2374"}, {"text": "Autodesk", "value": "/m/018nm3"}, {"text": "Barry Callebaut", "value": "/m/03clky2"}, {"text": "BioMind", "value": "/g/11dymfr2l6"}, {"text": "CHUBB ASIA PACIFIC PTE. LTD.", "value": "/m/09m8xyh"}, {"text": "Cargobase", "value": "/g/11dxppfsjn"}, {"text": "Cargobase Pte Ltd", "value": "/g/11fy240nxm"}, {"text": "DKSH", "value": "/m/0dj2nh"}, {"text": "Dathena", "value": "/g/11dxprdn6y"}, {"text": "Dyson", "value": "/m/05cskg"}, {"text": "Enggsol Pte Ltd", "value": "/g/11g9mnfmm1"}, {"text": "Ethos BeathChapman", "value": "/g/11c73z0xm0"}, {"text": "Eu Yan Sang", "value": "/m/03cl9hn"}, {"text": "Flintex Consulting Pte. Ltd.", "value": "/g/11h1z41pzb"}, {"text": "GIVAUDAN SINGAPORE PTE LTD", "value": "/g/11f00wn519"}, {"text": "Goldman Sachs", "value": "/m/01xdn1"}, {"text": "GovTech Singapore", "value": "/g/11dxpkfs_6"}]}]}