{"search_metadata": {"id": "60827a62a4bb3870f4375f12", "status": "Success", "json_endpoint": "https://serpapi.com/searches/7337ff81429a4052/60827a62a4bb3870f4375f12.json", "created_at": "2021-04-23 07:42:26 UTC", "processed_at": "2021-04-23 07:42:26 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28solution+architect%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=110", "raw_html_file": "https://serpapi.com/searches/7337ff81429a4052/60827a62a4bb3870f4375f12.html", "total_time_taken": 1.45}, "search_parameters": {"q": "(solution architect) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "110"}, "jobs_results": [{"title": "Presales Cloud Solution Architect", "company_name": "Mirantis", "location": "Singapore", "via": "via Neuvoo", "description": "Company Description\n\nMirantis is the fastest way to modern apps, providing containers-as-a-service at enterprise scale. The company uses a unique as-a-service model to deliver Kubernetes and related open source software, empowering developers to build, share and run their applications anywhere - from public cloud to hybrid cloud to the edge. Mirantis serves many of the world’s leading enterprises, including Adobe, DocuSign, Liberty Mutual, PayPal, Reliance Jio, Splunk, STC, Vodafone, and Volkswagen. Learn more at www.mirantis.com.\n\nJob Description\n\nFor more than 13 years, Agilent Development Center at Mirantis has been working as part of Agilent on building laboratory solutions to meet the full spectrum of customers' needs. Our team is growing, and today we are looking for talented QA Engineers who would join our department.\n\nAs a QA Engineer in our center at Mirantis, you will be part of a team that designs and develops new scientific software components. We build solutions for... organizing laboratories in distributed environments, storing experimental measurements, managing instruments, security and access control, data management with flexible, scalable on-prem & cloud storage options, and API allowing partner integrations.\n\nYour primary responsibilities will include close work with the team and Product Owner on project requirements, design of testing strategies, automated and manual testing for desktop, server, and web applications.\n\nQualifications\n• 2+ years of experience in Software Testing and Quality Assurance;\n• Good knowledge of software development life cycle, Agile methodologies, testing methodologies, and testing tools;\n• Proactive self-starter with a keen eye for details, with a focus on end-user experiences, and the ability to go above and beyond to ensure a high-quality release;\n• Experience developing detailed test cases, filing detailed defect reports, and providing relevant data for test reporting;\n• Troubleshoot and provide detailed debug information for expediting issue resolution;\n• Experience developing automated tests and frameworks (C#, Java, etc.) will be an advantage;\n• Experience with CI for automated testing (Jenkins, pipe-lines) will be an advantage;\n• Good in written and spoken English.\n\nOpportunities we can offer:\n• Active participation in the development of strategies for manual and automated testing for crucial components of Agilent’s products;\n• Influence on such aspects of projects life as requirements definition and planning, testing workflows, functionality and appearance of each project;\n• Professional development in QA automation and CI;\n• Close work with Agilent employees from the US, Europe, and Australia in a collaborative development environment.\n\nAdditional Information\n\nWe offer:\n\n- Work in a leading company in cloud computing industry\n\n- High-energy atmosphere of open source projects\n\n- Multiple opportunities for on-the-job learning and professional growth\n\n- Flexible schedule (both full-time and part time)\n\n- Participation in OpenStack and Kubernetes cloud design projects\n\n- Supervision by experienced mentors\n\n- On-site English courses\n\n- Opportunity to make a difference in the world of cloud computing\n\nMirantis ranked in the top 50 of G2's Best IT Cloud Products of 2021!\nI'm interestedPrivacy Policy", "extensions": ["7 days ago", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcmVzYWxlcyBDbG91ZCBTb2x1dGlvbiBBcmNoaXRlY3QiLCJjb21wYW55X25hbWUiOiJNaXJhbnRpcyIsImNvbXBhbnlfbWlkIjoiL20vMDEybDZwcGMiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJLTTJ4LWVIWU1LZ2U5ZlNzQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUlCQ3FJQlFVNVZYMDV4VVMxWlZsVTVVSGxHU1ZScGJtMTFPVVF6YkVwMFR6aDFXV2c0YjJkaFFVMU9MVzQ0VXpGMlR6TTJYMGxSU2toamJISjFhRFpTWmxoMFExcFVWR0V6WlY5dGFFSlVRV1Z3Ukhab2NTMDVNVEJpTFZGclpUUmZPVkZLTVZVd1JFeHVRak5PVkhBelgySXRUMGh0VmpGdWFXNDRYMlJuYkdwVWVVRklSMll6U25VMmVWQkJVVmN5TTBsa1JFMVJSM2MyWmtkWVUyNXVabGQwZEVsbkVoZFpNM0ZEV1UxVVZrVlpVM0UxVG05UWNGOWhTSEZCWXhvaVFVOU5XVkozUkdscFNtOUlNVE5LT1c1d1RVbDRSMmc1VFZjdFJqTlRSalkxVVEiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY183IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE5ldXZvbyIsImxpbmsiOiJodHRwczovL3NnLm5ldXZvby5jb20vdmlldy8/aWQ9ZjAxMWU2NmJlMzk1XHUwMDI2dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Cloud Solution Architect / Purview", "company_name": "Microsoft", "location": "Singapore", "via": "via Microsoft Careers", "description": "Microsoft envisions a world where passionate innovators come to collaborate, envisioning what can be and taking their careers places they simply couldn’t anywhere else. This is a world of more possibility, more innovation, more openness, and sky’s-the-limit thinking – a cloud-enabled world.\n\nOur mission is to empower every person and every organization on the planet to achieve more. This mission is ambitious and at the core of what our customers and employees care deeply about. We have unique capability in harmonizing the needs of both individuals and organizations. We deeply care about taking our ideals and vision global and making a difference in lives and organizations in all corners of the planet.\n\nWe are always learning. Insatiably curious. We lean into uncertainty, take risks, and learn quickly from our mistakes. We build on each other’s ideas, because we are better together. We stand in awe of what humans dare to achieve and are motivated every day to empower others to do more... and achieve more through our technology and innovation. Together we make a difference.\n\nTo learn more about Microsoft’s mission, please visit: https://careers.microsoft.com/mission-culture \n\nCheck out all of our products at: http://www.microsoft.com/en-us\n\nMicrosoft aspires to help our customers achieve their own digital transformation, leveraging the power of Microsoft Cloud solutions and services. To this end, Microsoft is investing in a dedicated Customer Success team that will help Microsoft customers successfully adopt Microsoft Cloud solution and services", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDbG91ZCBTb2x1dGlvbiBBcmNoaXRlY3QgLyBQdXJ2aWV3IiwiY29tcGFueV9uYW1lIjoiTWljcm9zb2Z0IiwiY29tcGFueV9taWQiOiIvbS8wNHN2NCIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImNBRzNESGZISFhJQ3NEVW5BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1SUJDcUlCUVU1VlgwNXhVak10VGtsbU5EVnhVbGQ2VTJadk5XcDBjbTVNU1RscVRWYzRhRFV0Y2tORmExWmhNVmRFU0hVeldtMVVUVEUwTmpWSGN6RnlUMFUxZEMwMFlscHJWM0ZYTTFWa09WSkVWWEIwYWxFM2IySnFialpyU3paR1EwbFhYMnB1YkhZemJYVnFUMUZsZUUxcFQzbEZaV0pVUkRacWVVZEllRVJvZFdKNGVpMW5kbFV3YzAxdlkyNUZXbWxmVG05bFdsa3RkazVXYUVWMGNsSkJRalZuRWhkWk0zRkRXVTFVVmtWWlUzRTFUbTlRY0Y5aFNIRkJZeG9pUVU5TldWSjNRemcwYWxSM2NITkhSa0ZhYTJOV1NHaHZUVXBUUW14bWJXRkJRUSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzE1IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1pY3Jvc29mdCBDYXJlZXJzIiwibGluayI6Imh0dHBzOi8vY2FyZWVycy5taWNyb3NvZnQuY29tL3VzL2VuL2pvYi85ODM4MTkvQ2xvdWQtU29sdXRpb24tQXJjaGl0ZWN0LVB1cnZpZXc/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Solution Architect   Azure", "company_name": "Morgan McKinley", "location": "Singapore (+1 other)", "via": "via MNC Jobs Singapore | MNC Jobs In Singapore", "description": "Solution Architect\n\n(Enterprise Solutions and Innovations)\nOur client is the leading and the most stable brands in the consumer electronics sector. Award winning company in emabrasing Innovation and Digital platform.\n\nSolution Architect is responsible for development of end-to-end technical Enterprise Solutions and exploration of new Innovation\n• Lead technical solutioning process: requirements gathering, build RFP document, lead vendor selection process, execute POC, build proposal and secure customer's acceptance.\n• Explore new technology (e.g. IoT, Hololens, SDWAN, Power Platform), build business case and justify RoI.\n• Contribute in building company's technology roadmap.\n• Construct and maintain Enterprise Architecture artefacts: technology standards and policies.\n• Construct technical documentations: architecture diagram, security diagram, data architecture, process flow-chart, etc.\n• Be accountable for success of technology engagement.\n• Actively participate in clients' proposal... and contract negotiations.\nJob Requirements\n• Bachelor's degree in IT/Computer Science or equivalent professional experience.\n• Minimum 10 years of IT experience with >5 years in leading technical solutioning.\n• Stakeholders management, on different level of seniority.\n• Vendor management: drive RFP, negotiation, POC, POV, quality management.\n• ITIL certified.\n• Cloud certification, e.g. AWS/Azure cloud architect.\n• TOGAF certified (preferred).\n• Project Management experience (preferred): PMP certified and/or Agile PM trained/certified.\nBackground of Technical Skills\n• Broad technical knowledge in infrastructure technology and solution\n• Network technology: MPLS, IPSEC, MRTG, Solarwind, secure VPN, etc.\n• Server technology: MOM, SCCM, WSUS, ADFS, etc.\n• End-point technology: Intune, AV, Virtual PC, etc.\n• Solid experience in cloud technologies: Azure, AWS, IaaS, PaaS, SaaS.\n• Experience with leading edge technology: IoT, SDWAN, edge computing, etc.\n• Strong knowledge on security best practices: Zero Trust Network, MFA, remote-VDI, etc.\n\nSoft Skills\n• Result-driven: work with/through others to achieve end results.\n• Team player, collaborative, able to work with any department in matrix environment.\n• Impactful communication and presentation skills.\n• Agile mindset: small progress with iterations.\n• Comfortable in leading ambiguous and new technology projects.\n• Resilient, able to thrive under pressure.\n• Forward-looking, technology driven.\n• Analytic, critical thinking, curious mind.\n• Objective, holistic, transparent\n\nMORGAN MCKINLEY PTE LTD\n\nEA Licence No: 11C5502\n\nRegistration No: R1659128\n\nRegistration Name: Cullen Phoebe Rose Sabuag", "extensions": ["14 days ago", "Full–time"], "detected_extensions": {"posted_at": "14 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2x1dGlvbiBBcmNoaXRlY3QgICBBenVyZSIsImNvbXBhbnlfbmFtZSI6Ik1vcmdhbiBNY0tpbmxleSIsImNvbXBhbnlfbWlkIjoiL2cvMTFjNThyZjUwcyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjVtbGJ2LTdKb0FNbkdYSmZBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2Y0JDcmNCUVU1VlgwNXhVWHB0ZVhwWldGVmFhSGN0VjBnME5tMVpSek10TXpOUWRubHdXR2RuZUc1NE5WSmlTelJCZEVwT05sbGFSMEpYY201cE5VcFlPVzVZUTJkZlJEa3dOVlJyYlZSbVptNHdWVTlrTUhNNGFHVlJTa1JZWms1UlRIVkdWa1p4YzFaNlJtTlVNMnRNTjJZM056UmxZWE5PT0RSSE9GRlFaa1ZDY2xkUVoydDBUamwxT1hZM1pWWlFNRVJ2TWxsYWVVcDJXbUZyVUhwa04zUmphalpzWDNaaWJHeFdlVk5GT1ZoTVQxRTJkRlJGWkZGUkVoZFpNM0ZEV1UxVVZrVlpVM0UxVG05UWNGOWhTSEZCWXhvaVFVOU5XVkozUTFkRlprVnNURlp0UTNWa1RVMHpUMk55VGtoQlZ6WXhVblZVUVEiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18yMyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNTkMgSm9icyBTaW5nYXBvcmUgfCBNTkMgSm9icyBJbiBTaW5nYXBvcmUiLCJsaW5rIjoiaHR0cHM6Ly9zZy5tbmNqb2J6LmNvbS9qb2JzL3NvbHV0aW9uLWFyY2hpdGVjdC1henVyZS1zaW5nYXBvcmUtMjQyMjAxP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "GIT _ Senior Architect (125901)", "company_name": "Singtel Group", "location": "Singapore", "via": "via Singtel Careers", "description": "Singtel, Asia’s leading communications technology group, provides an extensive range of telecommunications and digital services to millions of consumers and businesses across Asia, Australia, Africa and the USA. With over 140 years of innovation behind us, we continue to push boundaries in our networks and services, to enrich lives and transform businesses.\n\nOur core values – Customer Focus, Challenger Spirit, Teamwork, Integrity, and Personal Excellence – shape the way we work. We are passionate about making a difference and have an open and inclusive culture where everyone is empowered to do their best. Our diverse business means you will enjoy unique opportunities and rewarding experiences to learn and grow your career in a dynamic industry.\n\nJoin us and experience what it’s like to be with an Employer of Choice*. Together, let’s create a brighter digital future for all. *Awarded at the HR Fest Awards 2020\n\nSingtel are at the leading edge of technology development to improve the... experience of our customers as they consume services across mobile, voice and data infrastructure, managed services, cloud computing, IT services and professional consulting. To support that journey, we are searching for top talent and have an exciting opportunity for an Architect to strengthen our team.\n\nThis is a strategic role expected to focus on Application Architecture for various digital channels and platforms.\n\nResponsibilities\n• Understands business functions and transform requirements into architecture and blueprint for the solution being created. Need to propose new innovative solutions, updates to existing solutions, negotiate alternative options, build technical and release roadmaps\n• Construct a solution architecture around Microservices and APIs, and be able to decompose monolith applications into meaningful implementable Microservices and APIs in a Cloud/DevOps environment\n• Work closely with the development team and get their buy-in into accepting the design to be implemented. Also, work with different stake holders, product owner, senior executives, external parties like system integrators, product partners.\n• Provide technology perspective to business to achieve roadmap and prioritization by keeping abreast with industry trends. Where required, help business size the complexity of problem and help simplify and define MVP\n\nExperience\n• 12+ years of experience in the technology industry including 8+ in architecture of scalable and high-performance internet facing systems\n• Possess strong background and experience as a successful Software engineer/Architect in building large scale, highly available Internet and mobile applications.\n• Have in depth knowledge of cloud computing, microservices architecture (incl. design pattern, rest/grpc, gateway & service mesh etc.), DevOps, Streaming architecture, Modern data architecture, Mobile and Web application architecture\n• Good experience in API security including OAuth2/OIDC, Tokens, mTLS etc.\n• Significant experience working on mission critical internet facing applications focusing on scalability, performance, architecture aspects\n• Passion for architecture and ability to pick up and learn new technological advances very quickly\n• Exhibits leadership in guiding team members, adapts to changes in technology and business domains, has good knowledge of latest trends in the market and is well respected within the team\n• Solid understanding of Public Cloud (pref. AWS) architecture. AWS certification is a big plus\n• Experience in Java, Spring boot, any modern messaging technology, any Traditional and NoSQL database is a big plus\n\nWe believe in the strength of a vibrant, diverse and inclusive workforce where backgrounds, perspectives and life experiences of our people help us innovate and create strong connections with our customers. We strive to ensure all our people practices are non-discriminatory and provide a fair, performance-based work culture that is diverse, inclusive and collaborative", "extensions": ["13 days ago", "Full–time"], "detected_extensions": {"posted_at": "13 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJHSVQgXyBTZW5pb3IgQXJjaGl0ZWN0ICgxMjU5MDEpIiwiY29tcGFueV9uYW1lIjoiU2luZ3RlbCBHcm91cCIsImNvbXBhbnlfbWlkIjoiL20vMDIwemZsIiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiZmVIQV9YQVhyQ2pMS21XSEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVJQkNxSUJRVTVWWDA1eFVVTjRVRWhNY2w5dldWWTBXV1JsTWkxaWFEVkRNVXQ0YmxwdlJVRjFZVnByTlRjM1QwZFpjMjVCYWsxM1ZsaGFVMmgyU2tKblRXbFhNazl5U0VkWVVqQnJWbkpYUTBaWFFrcDNaR3BvVUcxeFRWaFBjRmhyV2xOeVMweE9NWG93VVVKUFF5MWFaRTVoUmtoMVYwZHRjME5pVmpVeFZYWmxNRkJoWDE5dFJ6RjVkbmhqZGtKZlVUY3RNVGQyVXpsbmVuZFRaSHBHVVdkalVTMW5FaGRaTTNGRFdVMVVWa1ZaVTNFMVRtOVFjRjloU0hGQll4b2lRVTlOV1ZKM1EwRjVlVWhPU1dwcFMxazVaa05FUzJWWVlrUjNZVTVFZDIxVFFRIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMzEiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gU2luZ3RlbCBDYXJlZXJzIiwibGluayI6Imh0dHBzOi8vZ3JvdXBjYXJlZXJzLnNpbmd0ZWwuY29tL2pvYi9HSVQtXy1TZW5pb3ItQXJjaGl0ZWN0LSUyODEyNTkwMSUyOS1TaW5nLzU3OTU3NTExMC8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Client Solutions Architect (BB-85A4E)", "company_name": "VMware", "location": "Four (+1 other)", "via": "via BeBee", "description": "VMware Professional Services (PS) Organization drives and influences the success of each VMware implementation. The PS team is dedicated to the success of our customers and their digital strategies. The PS team ensures that VMware customers are successfully implementing and delivering against their business plans from adoption all the way to a fully functioning solution that meets their defined business outcomes.As a Client Solutions Architect (CSA), you will be responsible for the PS design and scoping of services of complex transformational solutions for our customers. The role will require you to understand the products, frameworks, and design patterns used for VMware solutions. You will be asked to contribute to these frameworks, develop reusable domain solutions, and mentor internal & external stakeholders on the use of the tools. You will be working as part of a team with similar charters. To effectively build solutions to solve for complex business problems it will be important... to build a strong network among your peers and internal & external teams. You should be ready to take ownership of the pre-sales initiatives and programs to aid in delivering of our solutions.The ideal candidate will have a good mix of Technical Skills, Business Acumen, and a strong bias for customer centricity. The ideal candidate will need to be able to understand the customers vision and to be able to translate this to desired business outcomes and the IT solutions which underpin them. You will be acting as a lead technologist and should have a broad understanding of VMware and related technologies.The ideal candidate would have domain level understanding in one or more of the following Franchises:-Multi-CloudApplication ModernizationDigital WorkspaceVirtual Cloud NetworkingIntrinsic SecurityVMware PS is committed to offering a collaborative and supportive working environment with a full enablement plan and the opportunity to develop in the latest Software-Defined Datacenter or Digital Workspace technologies and solutions. We promote an inclusive atmosphere where your voice will be heard, and where you will be part of a dynamic team working in partnership with each other and with our customers.We are looking for conscientious and responsible individuals who can build on our successful track record and come with us on the next stage of our journey. We will sponsor your enablement and certification for VMware technical skills and potentially non-VMware specific but associated certifications and soft skills via our ‘Take1’ initiatives.KEY RESPONSIBILITIES:The Client Solutions Architect (CSA) is primarily responsible to lead the technical pre-sales engagement with customers through the following activities:-Working in close partnership with the core sales, services sales and delivery teams to understand desired customer outcomes, technical objectives, and services requirementsDesign high level solutions to meet the business outcomes and IT objectivesDevelopment of Vision for the Solution, Strategy and Services RoadmapsAbility to think past individual products and create end to end solutions to meet the business outcomesEffectively communicate the proposed services architecture to the customer, partners and project teams to demonstrate its tangible valueEnsure that proposals, services solution designs and Statements Of Work are technically sound, deliverable, competitive and representative of market leadership in the application of technology to addressing business outcomesAssist with the completion and response of customer issues RFI’s, RFQ’s and RFP’sOwnership of the technical components of the Statement of Work including pre-requisites, responsibilities, technical scaling factors, out of scope items etc.Accurately define role based Level Of Effort required to deliver the solution in line with VMware best practice and support guidelinesFacilitate accurate, timely and efficient handover of projects from the sales phase to deliveryAuthor blogs, technical articles and white papers based on experiencesSpeak at events such as VMworld, Sales Kick-Offs, Technical Summits etc.Provide lessons learned feedback to Services Sales, Delivery Management and Engineering based on customer feedbackCreates artefacts and manages collaboration with PS EngineeringAdhere to VMware PS sales process and methodologies on all opportunity pursuitsMastery of necessary tooling including PS Solution BuilderMaintain proficiency in VMware service offerings, value propositions, and representative case studiesSupport Field enablement of Client Solution Executives (PS Client Sales Execs), CSAs, inside Client Sales Execs and iCSAs based on domain expertiseMentoring of peers and more junior CSAs as appropriateLead internal enablement and community discussions around emerging technologiesObtain continuous feedback from the field, including customers, bringing IP back to corporate teams and making recommendations on future service offeringsWorking with PS Client Sales Execs help to scrub franchise specific forecasts to provide the best possible view for the businessConfidently gather use case requirements and solution designs while functioning as an advocate for “Best Practices” and driving adoption of VMware solutionsEnsure the solution being delivered is fit for purpose, referencing the initial business goals and objectives of the project through strong governanceMaintain up to date high-level technical knowledge of the VMware product line and future product direction and expert level knowledge of your specialist domainsYOU ARE:A seasoned technical architect with a deep understanding of the Government, Enterprise, and/or Commercial environments, and embraces solution selling with the ability to solve customer’s business needs through the innovative application of cloud-based business solutions.Self-motivated, results-oriented, proactive and upbeat, you work as a member of a team and independently, developing long-term strategic and technical relationships.A clear thinker as well as an effective presenter and communicator, you effectively lead the architectural discussions and technical development of customer environments.Broad industry knowledge with a solid understanding of technology platforms and how to design solutions based on VMware’s portfolio. Proven experience in driving complex solution sales in a competitive environment with knowledge of AWS, Microsoft, RedHat, and other industry leading cloud-based vendors.Must have proven experiences and confidence in driving complex competitive solution sales scenarios, working in a matrix environment, and leading opportunities to closure.YOUR KNOWLEDGE AND EXPERIENCES:-You adopt a solutions sales/ consultative selling approach to sell business and IT outcomes, calling on your understanding of the VMware product range and services offerings in an industry context.You have a broad range of product knowledge, technical architectural design and hands-on experiences in VMware vSphere, NSX, Cloud management product (e.g. vRA, vCD etc.), DevOps tools, and End User Computing in medium to large environmentsYou are familiar with broadly accepted architectural frameworks (e.g. TOGAF, ITIL etc.), Project Management (e.g. PMP, Prince2), as well as working knowledge for third-parry infrastructure and/or cloud native products and solutions (e.g. Microsoft, Red Hat, Cisco, Dell)You are able to generate proposals that are commercially sound, deliverable and compelling, and experiences in producing and reviewing Statements of Work for services.You are empathetic, and harness the ‘one VMware team’ spirit to collaborate in a multi-competency environment (sales, presales, generalist, specialists)You have developed strong relationships with regional IT decision makers in Government, Enterprise, and/or Commercial accounts, and are able to adapt internal and external communication to a target audienceYou participate actively in VMware User Groups and/or recognized as a vExpertMINIMUM ENTRY QUALIFICATIONS AND REQUIREMENTS:-8+ years in Information Technology, preferably in the areas of Pre-Sales/ Business Development/ Advisory/ Delivery, or at least 5+ years in a CSA capacity and should have supported a regional quotaExperience in Enterprise Architecture fundamentals, methods and concepts, IT governance, business process management, and IT implementation.A Bachelor’s or advanced degree in business/computing, or equivalentVMware certifications as well as certifications related to Public Cloud provider (AWS, Azure), Private Cloud, Virtual Infrastructure, Modern Applications, Digital Workspace, and/or Systems ManagementIndustry related specialized knowledge and/or additional certifications expected – Project Management, TOGAF, ITIL Foundation (or Advanced), and COBITAble to travel up to 50% when required, and to travel occasionally within Asia Pacific and to the USATechnical services scoping experience in a consulting/ services environment, including time supporting sales and liaising with technical practices and deliveryDelivery or production experience in at least 2 of the 5 main FranchisesStrong presentation, C-level client management and business development skills with the ability to articulate options & ideasSuperior organizational and negotiation skillsExperience of working in a multi-dimensional and matrixed organizationAbility to influence external & internal decision makers and to anticipate challenges and take pro-active action to addressStrong documentation and technical writing skills with an ability to create high impact customer facing deliverablesAbility to demonstrate solid commercial acumenAdaptable and progressive learner with the ability to communicate complex technical topics to both a technical and non-technical audienceAn active listener with excellent communications and interpersonal skills, with an ability to utilizes different styles of questioning techniques and manage conflict and objection handlingExperience of working with a wider team to respond to RFI, RFQ or RFPs", "extensions": ["20 hours ago", "Full–time"], "detected_extensions": {"posted_at": "20 hours ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDbGllbnQgU29sdXRpb25zIEFyY2hpdGVjdCAoQkItODVBNEUpIiwiY29tcGFueV9uYW1lIjoiVk13YXJlIiwiY29tcGFueV9taWQiOiIvbS8wMXQ5azUiLCJhZGRyZXNzX2NpdHkiOiJGb3VyIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiM3VvTlFKUG9qZW1OeUhwR0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXN3QkNvd0JRVTVWWDA1eFV6WkRjMVZNYTJ3NU1XUTBWVXREVjBSRVRYZHdTa0pyVjBKTFpsOWtPRlZKVm5kbE4wNVhlR3BvVW1KdWRHNVZTREZZWWpWMVMwNUVOSFJWYlRWbU5VTTBRbXBtY0VaQmMxWlFiVFExYlZOa1dHWkVOVGRtTm1GRldXeFZhRkZrV25oeVkwbGhaSFZuVkZkdlRIaHljREJUU0hFd1VsRTJiWEJpTnpkU2VGcE5WRlZoZFVRU0Yxa3pjVU5aVFZSV1JWbFRjVFZPYjFCd1gyRkljVUZqR2lKQlQwMVpVbmREY1hodVgyTlNUM0ExTkRKc2NISjBiVzgwT0U1VVJWQnZlWEozIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMzkiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQmVCZWUiLCJsaW5rIjoiaHR0cHM6Ly9zZy5iZWJlZS5jb20vam9iLzIwMjEwNDIyLWQ4YjAxYTViZjQ0M2M5ZjU3YmZiZjZmM2UzNDg1YTRlP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Senior Cloud Architect", "company_name": "Robert Walters", "location": "Singapore (+1 other)", "via": "via Jobs", "description": "An exciting Senior Cloud Architect job opportunity has become available working for a leading financial services company in Singapore. About the Senior Cloud Architect Role: You will be reporting to the Head of Infrastructure and working closely with all technology teams across the organisation. Key Responsibilities: Understand bank IT operations, software development, release management, business continuity policies, processes, methodologies Lead incubation and development of components and solutions for technical services infrastructure Comprehend and map complicated interdependencies between application dependencies and infrastructure components. Think laterally across multiple technology types and define patterns of usage Bridge the gap between stakeholders in lines of businesses, from C-level down to Application Developers level. Communicate technical concepts in clear and established terms using appropriate channels, offline and online collaboration methodologies Combine... conceptual thinking and hands-on support for prototyping, PoC work, delivering examples. Translate logical architectures (based on both vendor and open source products) to technical architectures Work closely with engineering, platform engineering, database engineering, web engineering and middleware engineering teams and close gaps in value chain between components of IT solutions and business users To be successful in this role, you will need strong end-to-end knowledge of cloud, architecture, infrastructure, applications, AWS/Amazon and Microsoft Azure with any experience working within financial services being desirable. Key Requirements: Five or more years’ experience in infrastructure architecture or equivalent field Amazon Certified Solution Architect Professional level or Google Certified Cloud Architect level or similar experience Hands-on experience in Hashicorp OpenSource tools, Ansible, Chef Five or more years of hands-on experience in RHEL/Windows administration Five or more years of hands-on experience in solutions design, requirements gathering Five or more years of hands-on experience in bash scripting, distributed Linux based systems design and delivery Exposure to and proof of hands-on experience container orchestrators with Kubernetes, Docker Swarm, Mesos, or others Exposure to and proof of hands-on experience in infrastructure as code deployments Hands-on experience in Semantic Media Wiki, Graph Databases, Apache TinkerPop, RDF Experience with Amazon Web Services and Microsoft Azure Public Cloud Platforms Hands-on continuous integration experience using Jenkins Pipelines, Git Hands-on experience of RESTful and/or web services deployment, including A/B testing Hands-on experience in one of the following web application development technology: Java/Python/NodeJS This organisation needs no introduction and is recognised as a key leader within the financial services field. The culture is demanding but if you are confident and have a can-do attitude the potential rewards are significant. The business is also very focused on developing and training their people to the highest standards.If you are driven, determined and want to take the next step in your career, this is the role for you. Great career progression opportunities await the right person in this exciting Senior Cloud Architect job in Singapore.Apply now to learn more. Do note that we will only be in touch if your application is shortlisted", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQ2xvdWQgQXJjaGl0ZWN0IiwiY29tcGFueV9uYW1lIjoiUm9iZXJ0IFdhbHRlcnMiLCJjb21wYW55X21pZCI6Ii9tLzA2NGtwa3AiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJOWlY5WVFMZUpuWXk1NjEyQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUlCQ3FJQlFVNVZYMDV4VWt4WlpuZE1UWFpMWDBwUmNHUlZRbUpUWVhaVWFsZGtSemhIYlVwb1RFdFZkVzk0Y1hOVk9FbEpTWE5RYzNsMU5VWnJRbmQ0YzNCcWQwSXRUMlpVZFdSbUxXZDNZVkF5VldGbFgzTnFaa1JwU1Voa1dFNTFUVEJrVDJwaldTMHpaa1pMUlhNMGNFOUNVVlJ1VFd4UWVWRkthak5yV1ZCa1JHVXRXWFpIZFhsbVNVeHpiMGhRZVMxNFJWOHdaMlZLUldaRmEwVk5kM0JZVUZoUkVoZFpNM0ZEV1UxVVZrVlpVM0UxVG05UWNGOWhTSEZCWXhvaVFVOU5XVkozUkhsWVYyRndTbXg1WXpKSVExaDZOamhFV1RaVVVtWmhNRVozWnciLCJmY3YiOiIzIiwiZmNfaWQiOiJmY180NyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIiwibGluayI6Imh0dHBzOi8vc2cuZmlkYW50by5jb20vam9icy9qb2Itb3BlbmluZy93ZWItYWRtaW5pc3RyYXRvcnMvc2VuaW9yLWNsb3VkLWFyY2hpdGVjdC0yNzc4NzUwMjQ/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Communications Solution Architect - Pre-sales", "company_name": "SearchElect Pte Ltd", "location": "Singapore", "via": "via Monster", "description": "Key Words: Enterprise, Solutions, Consulting, Infrastructure, Strategy, Technology, Collaboration, Unified Communications, Voice, Telephony, Video Conferencing, Network, VoIP, IP PBX, Contact Centre, Cloud Communication Service\nRole: Communications Solution Architect (Pre-sales)\nIndustry: Information Technology\nFunction: Presales, Technical Sales Consulting\nLocation: Singapore\nAbout Our Client\nA market leader communication and network infrastructure with a stronghold in services and solutions. The client spans across industries in healthcare, hospitality, education, government and transportation.\nAbout the Communications Solution Architect (Pre-sales)\n• Assist the Enterprise Sales Strategy and Business Objectives covering business partners and activities\n• Up-keep the skills, autonomy and professionalism of the company and Pre-Sales Business Partner\n• Oversee company’s technology infrastructure and provide strategic solutions in meeting the company’s objectives\n• Champion drivers... business cases and overall implementation plans\n• Provide technical solutions to client’s needs and requirements by connecting a range of standard products and third-party suppliers in the conceptual solution architecture\n• Liaise and feedback between the client on the value proposition of solutions and work with product specialists to obtain technical requirements\n• Raise feature request to Communications Business Unit if enhancement is required on the products and solutions\n• Ensure the smooth process and integrity of the final proposed solution involving the accounts team to derive and recommend solutions\n• Influence and convince clients with technical delivery and financial profitability in meeting business requirements\n• Converge technical knowledge between peers and business partners to create future opportunities\n• A sound knowledge of the market and competitors to provide value and unique proposition in customizing solutions\n• Conduct POC and promotion in Communications, trades hows and events\nAbout You\nPlease note: Interested Applicants must be able to work in Singapore.\n• Pre-sales experience in Enterprise Voice, Unified Communications, Collaboration Applications and network\n• Flexibility in communication and tailoring to client needs\n• Presentation and language skills\n• Technical skills in specialized area\n• Selling skills and partnership experience\n• Experience in Contact Center Solutions designing\n• Any industry relevant Enterprise Voice, Unified Communications, Collaboration Applications and network certification\n• Degree in Engineering / Computer Science or related studies\n• Experience in customer-facing role preferred (sales, sales engineering, consulting)\n• Experience in architecture, desired in conceptualization, definition, development and/or implementation of IT/Telco based solutions in the areas of Enterprise Communications Services (VoIP, IP PBX), Contact Centre, Unified Communications Technologies, Cloud Communication Services\nPersonal Attributes\nMindset\n• Positive can-do attitude\n• High adaptability to customer needs\n• Collaborative and ability to coach peers\n• Works well under pressure and deadlines\n• Encourage open communication\n\nSkillset\n• Creative and Versatile\n• Presentation and proposal skills\n• Good listening and influencing skills\n• Knowledgeable in the technology market\n• Communication skills\n\nDiscipline\n• Analytical and problem solving\n• High level of motivation\n• Accountability towards work\n• Possess efficiency\n\nIf you are interested to learn more about the above job role or any other job opportunities, please apply to this job advertisement or alternatively contact the following consultant:\nDanica Pagsisihan\n+65 65898787\n[Confidential Information]\nSearchElect Pte. Ltd. adheres to the Singapore Ministry of Manpower Tripartite guidelines on Non-Discriminatory Job Advertisements which you can find more information about HERE. If you feel any part of this job advertisement is discriminatory please immediately raise to our attention via [Confidential Information]. We take these matters seriously and thank you for your cooperation", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDb21tdW5pY2F0aW9ucyBTb2x1dGlvbiBBcmNoaXRlY3QgLSBQcmUtc2FsZXMiLCJjb21wYW55X25hbWUiOiJTZWFyY2hFbGVjdCBQdGUgTHRkIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJwRDRoRC1lYmxvSExiZGdFQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1vbnN0ZXIiLCJsaW5rIjoiaHR0cHM6Ly93d3cubW9uc3Rlci5jb20uc2cvam9iL2NvbW11bmljYXRpb25zLXNvbHV0aW9uLWFyY2hpdGVjdC1wcmUtc2FsZXMtc2VhcmNoZWxlY3QtcHRlLWx0ZC1zaW5nYXBvcmUtMjE0MTY4Mj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior / Solution Architect (Mobile App)", "company_name": "EPAM Systems", "location": "Singapore (+1 other)", "via": "via Bayt.com", "description": "EPAM is committed to providing our global team of more than 41,150 EPAMers with inspiring careers from day one. EPAMers think creatively and lead with passion and honesty. Our people are the source of our success. We value collaboration, work in partnership with our customers, and strive for the highest standards of excellence. In today’s market conditions, we’re supporting operations for hundreds of clients around the world remotely. No matter where you are located, you’ll join a dedicated, diverse community that will help you discover your fullest potential.\n\nDESCRIPTION\nWe are looking for an experienced Senior / Solution Architect in Singapore to make the team stronger.\nResponsibilities\n• Design and build advanced applications for the mobile platform\n• Lead discussion with CTO on application risk assessment\n• Work with infrastructure team to set up environment and drive vendor discussion\n• Collaborate with cross-functional teams to define, design, and ship new features\n• Work with... outside data sources and API's\n• Unit-test code for robustness, including edge cases, usability, and general reliability\n• Work on bug fixing and improving application performance\n• Continuously discover, evaluate, and implement new technologies to maximize development efficiency\n• Full-cycle web application development using Agile approach:\n• Idea generation and high-level vision creation\n• Solution design and documenting, proposal\n• Development, testing, and Production launch\n• Run customer’s demo and education sessions\n• Coordinate your work with other developers to deliver first-class technology solutions in a positive, fun, yet challenging and deadline driven environment\n• Work closely with other Product and Technology teams, internal and external, to bring technology solutions and perspectives to the product development process\n• Provide input on, follow and evangelize code quality guidelines and standards\n• Participate in code reviews to highlight best of breed solutions\n• Identify / troubleshoot application code-related issues, and review and provide feedback on any required final user documentation\nRequirements\n• Information BS/MS degree in Computer Science, Engineering or a related subject\n• Senior Solution architect: Minimum 12-15 years of software development experience with minimum 7 years of Solution Architect (Mobile Domain)\n• Solution Architect: Minimum 10 -12 years of software development experience with 4-6 years of Solution Architect (Mobile Domain)\n• Software architect for integrating vendor products & implementation for mobile banking solution. The focus would be more on system integration, architecture review, driving the implementation on the client side\n• Able to document SAD\n• Experience working with Java in mobile domain\n• Experience with third-party libraries and APIs\n• Working knowledge of the general mobile landscape, architectures, trends, and emerging technologies\n• Mobile banking experience is strongly preferred\n• Banking experience is required\n• Strong understanding & experience with Design patterns, Data Structures\n• Familiarity with RESTful APIs to connect mobile applications with back-end services\n• Demonstrable capability to use OS frameworks for multi-threading, data persistence, and adapting user interface across multiple screen sizes\n• Experience with performance and memory usage tuning\n• Developed a culture of benchmarking and optimization\n• Comfortable working in agile product development environment, building from scratch and continuously improving it\n• Drive architecture and technology choices for the mobile products\n• Ability to lead mobile projects through the complete development lifecycle\n• Solid understanding of the full mobile development life cycle\nWe offer\n• Friendly team and enjoyable working environment\n• Work-life balance and flexible schedule\n• Online training library, mentoring, career development and potential partial grant of certification\n• Unlimited access to LinkedIn learning solutions\n• Referral bonuses\n• Compensation for sick leave and paid time off\n• Opportunities for self-realization", "extensions": ["7 days ago", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgLyBTb2x1dGlvbiBBcmNoaXRlY3QgKE1vYmlsZSBBcHApIiwiY29tcGFueV9uYW1lIjoiRVBBTSBTeXN0ZW1zIiwiY29tcGFueV9taWQiOiIvbS8wZGxucmMiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJxM0ljeEFxeGFQSUxjVlhwQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUlCQ3FJQlFVNVZYMDV4VVhFNU1qVjJZVFpvUzBkdGEwVnhhVzlVY1cwd1RHOU5NWFZIYURaVWFsOVVaa2hSWW5SeFpIa3liR2d5ZDJoSkxXUnVURTVVY0dSUVNXSTViRFY1VkRCSVYwbHVaM0JYVlVKTE5taHRiVkU0VUZOcWRWbG1kSEpoVms5b2JXcGhVVlpvYkc1R2NHRm1OMHBwV200ME9WaEJNRXBIWDI5UlIxTXpiR2gxVEV0RldXOVpOVFpUVlhWd05GSlpNR2huYURVemVFbEdjRmxWYUVsUkVoZFpNM0ZEV1UxVVZrVlpVM0UxVG05UWNGOWhTSEZCWXhvaVFVOU5XVkozUkRGS1dHSnZWV2Q2UjBKYVRUTlRaM0V3TWxsU09YSk5WMHBHWnciLCJmY3YiOiIzIiwiZmNfaWQiOiJmY181OCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCYXl0LmNvbSIsImxpbmsiOiJodHRwczovL3d3dy5iYXl0LmNvbS9lbi9zaW5nYXBvcmUvam9icy9zZW5pb3Itc29sdXRpb24tYXJjaGl0ZWN0LW1vYmlsZS1hcHAtNTk0OTkxMjYvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Platforms (Solutions) Architect", "company_name": "InterWorks, Inc.", "location": "Singapore", "via": "via Neuvoo", "description": "Are you passionate and deeply curious about technology? Can you see all the moving parts of a project and bring them together with precision? Do you see relationships with others as crucial to success? So do we.\n\nAt InterWorks, we’re equal parts work and play. We love people, and empowering them with the best tools for success is one of our favorite things. We support clients through a wide variety of challenges, so we need someone who can provide solutions tailored to clients’ unique needs and grounded in best practices.\n\nWhat You’ll Do\n• Advise clients’ analytics platform strategy and organisation-wide deployment\n• Consult with business and IT stakeholders to architect and implement an analytics environment that fits their requirements and is built on best practices\n• Evaluate existing client environments for best practices and opportunities to improve performance and gain efficiencies\n• Lead cloud modernisation efforts to move clients’ analytics workloads from on-prem datacenters... to cloud platforms\n• Develop and deliver product and service offerings that leverage our expertise and maximise value\n• Lead critical outage troubleshooting efforts for our clients’ platforms\n• Develop and implement platform maintenance automation scripts\n• Scope engagements and provide project clarity with actionable steps and deliverables\n\nWhat You’ll Need\n\nThis role requires a broad range of technical competencies and soft skills. An ideal candidate has a solid foundation in several of these areas and an appetite to learn and grow in others:\n• Cloud architecture (AWS, Azure, GCP)\n• Server hardware and virtualisation\n• Network security (TLS, firewalls/routing, reverse proxy, load balancing)\n• User authentication (Active Directory, LDAP, SAML, OpenID, Kerberos)\n• Windows and Linux Server administration\n• Scripting (Bash, Python, PowerShell) for CLI and REST API\n• Tableau Server architecture, configuration and administration\n• Tableau Desktop development (Performance and UX Design)\n• Alteryx Server architecture, configuration and administration\n• SQL and database management\n• Consulting, whiteboarding and Presentation for technical and business audiences from analyst to executive level\n• Proactive project management\n\nWhy InterWorks\n\nInterWorks is a people-focused tech consultancy that empowers clients with customised, collaborative solutions, and we love pursuing innovation alongside people who inspire us. Our approach to work and community is unique and unconventional—just like us—and that’s the way we want it. The only thing missing is you.\n\nClick here for the InterWorks Privacy Policy", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQbGF0Zm9ybXMgKFNvbHV0aW9ucykgQXJjaGl0ZWN0IiwiY29tcGFueV9uYW1lIjoiSW50ZXJXb3JrcywgSW5jLiIsImNvbXBhbnlfbWlkIjoiL20vMG44cXl2XyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Im14SV9FdUFDd0JCdmxTQlhBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2Y0JDcmNCUVU1VlgwNXhWRlJKUmw5NFpHdGFaMGgzYzI1SGNtVkZibTVJV0hSNU0zRk5TWGRzTUZWS1ozSm9lbU41YTBSSk5sSk5jeTB4YkY5SlYxcHFSbVEyTFU5YVN6UnZhVll4VWpSQmMyRnZObmxuVG5Cbk5tWjNjVE5EWldkTllXaDZhREJEZEZCMmVEa3djME14VnpSSE5saFNjRXRPYWs4MVdXWXpURVJhUlRCbE0zTjFZMkpUTmpaQmRXNXpXVlUwYVZSc1RtOTBOM3AzTjNoSldGQk1TVlpPUVVoRVVFbDVWWFJDT0daeWNEaDNXbEp4WkVOckVoZFpNM0ZEV1UxVVZrVlpVM0UxVG05UWNGOWhTSEZCWXhvaVFVOU5XVkozUVc5UWNsUm5NSHBIV2xGTldsZEpSa0ZxVTBsdGNrWXpWVUpUVVEiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY182NiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBOZXV2b28iLCJsaW5rIjoiaHR0cHM6Ly9zZy5uZXV2b28uY29tL3ZpZXcvP2lkPTY3Yjc1YjVhZTA4OFx1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Solutions Architect", "company_name": "Exclusive Networks", "location": "Singapore", "via": "via Glassdoor", "description": "Exclusive Networks is the global specialist VAD for cybersecurity and cloud solutions the defining and interdependent technologies of the digital era. Its capabilities are backed by best-of-breed vendor portfolios, unparalleled skills and a host of compelling services from pre and post-sales technical support to leasing, training, professional services and global project management. With offices across five continents and presence in over 100 countries, Exclusive Networks has a unique local sale, global scale model that enables its partners to achieve global reach, while delivering all the added value of a locally focused specialist distributor. Find out more at www.exclusive-networks.com.\n\nRoles & Responsibilities:\n\n1)Pre-Sales Role\n• Primarily responsible for solving technical business needs of partner and/or end user by providing presales support (presentations, demos, POCs, proposal writing, compliance table and product briefings)\n• Develop working proficiency on products and... technologies through self-directed and formal training\n• Responsible for qualifying requests for POC\n• Set POC objectives with customer based on:\n• Target loan duration of 2 weeks\n• To drive POC for expected closure within the same quarter\n• Independently present vendors solution to end users during the first customer meeting with the exception of:\n• C-level audience is present\n• CIO/CTO/Technical Evaluators are involved in first meeting\n• Strategic named accounts where vendors have indicated they want to be engaged from start of opportunity\n• Managing key partners for the line of business with the Product Manager(s)\n• Provide updates and training to partners from time to time\n• Developing un-named end user accounts and partners / resellers jointly identified with Product Manager(s)\n\nKey Measurements\n• To be technically proficient and certified in product lines jointly identified with the Country Manager within the first 90 days from employment date\n• To be able to carry out at least 2 POCs independently with minimal assistance from vendor\n• Keeping POC cycles within the maximum duration of 1 month\n\nQualification, Skills, Knowledge and Experience:\n• Degree / Diploma in IT / Computer Studies or equivalent\n• Min 3 years hands on experience in deployment and troubleshooting complex multi-vendor network issues in LAN and WAN networks\n• Strong knowledge of security and networking infrastructure environment\n• Process good analytical, communication and interpersonal skill\n• Self motivate, independent and ability to multi-task\n• Continuous relevant certifications by respective products is required", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2x1dGlvbnMgQXJjaGl0ZWN0IiwiY29tcGFueV9uYW1lIjoiRXhjbHVzaXZlIE5ldHdvcmtzIiwiY29tcGFueV9taWQiOiIvZy8xMWZ5MXZ6a3FjIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoicnl4YXY1a2l6Mlo3T3JaT0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZjQkNyY0JRVTVWWDA1eFVWQjNUMUJpUlU4eU5uWkxWVGR6TTBoYVVDMUNSM0J0Y1ZsV1FYRlpiMVZ6U1ZGR1ZVUjNYME4wYUdkYVJtRnFXRmhCVkhCUVZrZEVNUzFJVmtad2MxVlRSVTlTV0RBdGRuUTROVzFaYkd0a1owRnFZV0k0ZUVFMU4yaFhZMEZzZVRoaGRWcDBNRFEzWDFoWFNWazFMVFppWnpOSWFFc3hhVEp4ZFhKS1FWQTNaM2R4VTB4MFRtZEdiVmxFU0ZwVFUySTFTa3d0VVVGbE5pMUhlbmxFVkVsd1pFTjRkR3hEVmtvNFQzSkhjRGxWRWhkWk0zRkRXVTFVVmtWWlUzRTFUbTlRY0Y5aFNIRkJZeG9pUVU5TldWSjNRVmRVTjFCTFNUSTBXWFpZWlY5cWVIRTNSbXRJU1daQk1UZEdkdyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzc0IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEdsYXNzZG9vciIsImxpbmsiOiJodHRwczovL3d3dy5nbGFzc2Rvb3Iuc2cvam9iLWxpc3Rpbmcvc29sdXRpb25zLWFyY2hpdGVjdC1leGNsdXNpdmUtbmV0d29ya3MtSlZfSUMzMjM1OTIxX0tPMCwxOV9LRTIwLDM4Lmh0bT9qbD00MDY2NzE1NTc1XHUwMDI2dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}], "chips": [{"type": "Title", "param": "job_family_1", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Solution architect", "value": "solution architect"}, {"text": "Solutions architect", "value": "solutions architect"}, {"text": "Architect", "value": "architect"}, {"text": "Cloud architect", "value": "cloud architect"}, {"text": "Technical architect", "value": "technical architect"}, {"text": "Enterprise architect", "value": "enterprise architect"}, {"text": "Senior", "value": "senior"}, {"text": "Consultant", "value": "consultant"}, {"text": "Financial services", "value": "financial services"}, {"text": "Infrastructure architect", "value": "infrastructure architect"}, {"text": "Manager", "value": "manager"}, {"text": "Application architect", "value": "application architect"}, {"text": "Cloud engineer", "value": "cloud engineer"}, {"text": "It architect", "value": "it architect"}, {"text": "Lead architect", "value": "lead architect"}, {"text": "Network architect", "value": "network architect"}, {"text": "Security architect", "value": "security architect"}, {"text": "Senior architect", "value": "senior architect"}, {"text": "Systems engineer", "value": "systems engineer"}, {"text": "Associate director", "value": "associate director"}, {"text": "Deputy", "value": "deputy"}, {"text": "Engineers", "value": "engineers"}, {"text": "Head", "value": "head"}, {"text": "Infrastructure", "value": "infrastructure"}, {"text": "Lab", "value": "lab"}, {"text": "Network engineer", "value": "network engineer"}, {"text": "Presales consultant", "value": "presales consultant"}, {"text": "Public sector", "value": "public sector"}, {"text": "Senior analyst", "value": "senior analyst"}, {"text": "Senior consultant", "value": "senior consultant"}, {"text": "Senior director", "value": "senior director"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Software architect", "value": "software architect"}, {"text": "Solution consultant", "value": "solution consultant"}, {"text": "System architect", "value": "system architect"}, {"text": "System engineer", "value": "system engineer"}, {"text": "Systems analyst", "value": "systems analyst"}, {"text": "Systems architect", "value": "systems architect"}, {"text": "Technical trainer", "value": "technical trainer"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Accounting", "value": "/business/naics2007/5412"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Management", "value": "/business/naics2007/55"}, {"text": "Real Estate", "value": "/business/naics2007/53"}, {"text": "Wholesale", "value": "/business/naics2007/42"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Amazon", "value": "/m/0mgkg"}, {"text": "Microsoft", "value": "/m/04sv4"}, {"text": "EPAM Systems", "value": "/m/0dlnrc"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "IBM", "value": "/m/03sc8"}, {"text": "Salesforce", "value": "/m/07btr5"}, {"text": "EY", "value": "/m/0g9jc"}, {"text": "Publicis Sapient", "value": "/m/02myjp"}, {"text": "Randstad", "value": "/m/08pt1z"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Alibaba Group Holding Limited", "value": "/m/07s6ctl"}, {"text": "Avanade", "value": "/m/094456"}, {"text": "Capgemini", "value": "/m/03vlk0"}, {"text": "Comtel Solutions Pte Ltd", "value": "/g/11dxpztgnb"}, {"text": "DELL", "value": "/g/11c54ch2jm"}, {"text": "Ericsson", "value": "/m/02kyh"}, {"text": "HTZ Resources", "value": "/g/11h21p9b4d"}, {"text": "Infinite Computer Solutions Pte Ltd", "value": "/g/11g9mj72yz"}, {"text": "Michael Page", "value": "/m/04cxldw"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "Orange Business Services", "value": "/m/08zvyz"}, {"text": "Recruitment Hub Asia Pte Ltd", "value": "/g/11dxpww_0f"}, {"text": "TEKsystems (Allegis Group Singapore Pte Ltd)", "value": "/g/11b6g4bkv0"}, {"text": "Talent Trader Group Pte Ltd", "value": "/g/11dxpmlc5b"}, {"text": "Tata Consultancy Services", "value": "/m/01psx8"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "VMware", "value": "/m/01t9k5"}, {"text": "Verizon", "value": "/m/07_dn"}, {"text": "A-Speed Infotech Pte Ltd", "value": "/g/11g9mxswl4"}, {"text": "ABeam Consulting", "value": "/g/11bc6whr_f"}, {"text": "Amazon Web Services (AWS)", "value": "/g/11dxprr2xv"}, {"text": "Amazon Web Services Singapore", "value": "/m/0rznzt1"}, {"text": "Aon", "value": "/m/0z7n"}, {"text": "Avaya", "value": "/m/01sqlk"}, {"text": "Azendian Solutions Pte Ltd", "value": "/g/11dxpvcjj2"}, {"text": "Big Cloud", "value": "/g/11c743lwsr"}]}]}