{"search_metadata": {"id": "60827e1c8e02e4394590de18", "status": "Success", "json_endpoint": "https://serpapi.com/searches/fae8f2d867249239/60827e1c8e02e4394590de18.json", "created_at": "2021-04-23 07:58:20 UTC", "processed_at": "2021-04-23 07:58:20 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28solution+architect%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=0", "raw_html_file": "https://serpapi.com/searches/fae8f2d867249239/60827e1c8e02e4394590de18.html", "total_time_taken": 5.28}, "search_parameters": {"q": "(solution architect) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "0"}, "jobs_results": [{"title": "Solution Architect (AWS)", "company_name": "Accenture", "location": "Singapore", "via": "via Accenture", "description": "About Accenture\n\nAccenture is a global professional services company with leading capabilities in digital, cloud and security. Combining unmatched experience and specialized skills across more than 40 industries, we offer Strategy and Consulting, Interactive, Technology and Operations services—all powered by the world’s largest network of Advanced Technology and Intelligent Operations centres. Our 506,000 people deliver on the promise of technology and human ingenuity every day, serving clients in more than 120 countries. We embrace the power of change to create value and shared success for our clients, people, shareholders, partners and communities. Visit us at www.accenture.com.\n\nJob Title: Solution Architect (AWS)\n\nJob Description\n\nAccenture is looking for passionate and customer obsessed AWS solution architects to help deliver complex projects using AWS native services. You’ll work with smart people across our industry specialist organisations, and technology groups to help our... customers get the most out of AWS in their cloud journey. The role is based in Singapore and will include travel in the ASEAN region.\n\nCritical Success Factors:\n\nBasic Criteria\n• 3 -10 years of experience with Amazon Web Services. Candidate must have strong experience with multiple AWS services beyond traditional IaaS.\n• Candidate must have at least 2 AWS Associate Certifications and 1 AWS Professional Certification\n• Hands-on AWS experience with a minimum of 2 implementations (preferred in Enterprise scale environments)\n• Experience with at least one programming language (compiled or interpreted languages)\nPreferred Criteria\n• Bachelor’s degree or equivalent\n• Experienced AWS Cloud Architect with specialization in at least one of the following areas:\n• AWS Cloud Strategy: Business Case development, application assessment and migration planning, Cloud Operating Model design\n• AWS Security: Compliance, Cloud Security Architecture, third-party security tools/platforms, encryption/KMS/CloudHSM, Inspector, Macie, IAM policies/roles, Shield, WAF, etc.\n• Cloud Native Application Architecture: AWS PaaS/FaaS services, Serverless architecture, Lambda, API Gateway, Containerization and Microservices, Lightweight architectures including JavaScript frameworks (Backbone.js, AngularJS, React), single page applications, and modern web applications.\n• AWS Migration: Optimization of applications to scalable cloud designs, rearchitecting applications to modern cloud patterns, and database migration (including cross-platform)\n• DevOps and Infrastructure as Code: AWS environment and application automation utilizing CloudFormation and third-party tools (Chef, Puppet, Ansible, etc.). CI/CD pipeline setup using AWS services such as CodeBuild/Commit/Deploy", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2x1dGlvbiBBcmNoaXRlY3QgKEFXUykiLCJjb21wYW55X25hbWUiOiJBY2NlbnR1cmUiLCJjb21wYW55X21pZCI6Ii9tLzAxcnAyYyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6InZfclFRSHE4Tm9VenJXNktBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhVWFEyV2pOM2MxTTRjR3c0ZFVoamFtWnhSRmxPWkRrdGMwbzNha1JDTW5NeVpTMTRMVFpTUmpnNUxUVlhWbmcwVEVacFVXcENVbk42VTA1NWFqWkhPWFJZV21SQlptcGpla2xLWWpoamVtaHdVVWRYV0haSFNYVnhkamN0WWxkRFpGWmlaVEZTU3pZdGRHMWhNMVJHZFVkNlNVVlpSRTh6UkVOelF6VkdMVTFTTUVOd1oyOXVUMHhPVUhaQlFqSmpka2t4U0hKelVFZFVUV2wzRWhaSldEWkRXVTl5V1VJNFlsTjBRVmhWYm5GbGQwUm5HaUpCVDAxWlVuZEJZMUY2TUZBM2NXbzViVkp2ZEROc2RVeG1ZbmRMZWt0SWRHNW4iLCJmY3YiOiIzIiwiZmNfaWQiOiJmY183IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEFjY2VudHVyZSIsImxpbmsiOiJodHRwczovL3d3dy5hY2NlbnR1cmUuY29tL3NnLWVuL2NhcmVlcnMvam9iZGV0YWlscz9pZD0wMDgzMzkwNF9lblx1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Cloud Solutions Architect", "company_name": "TEKsystems (Allegis Group Singapore Pte Ltd)", "location": "Singapore", "via": "via EFinancialCareers", "description": "Cloud Solutions Architect\n\nAn exciting Cloud SA role with a public cloud management consultancy focused on total cloud\nconsultancy and managed services. The company partners with popular public clouds such\nas Google Cloud Platform, Amazon Web Services, Microsoft Azure and offers the\narchitecture and platform best suited to their clients' needs\n\nThe Position:\n\n• Understand clients' business and functional needs and create customized managed Cloud enabled solutions.\n• Create and deliver proposals/presentations/pitch documents to address client requirements.\n• Work closely with the Sales team in client engagements.\n• Deliver product demonstrations to prospective clients and engage in functional level discussions on product aspects, features and benefits.\n• Play a pivotal role in anchoring client RFPs, ensure superior quality and content of RFP responses.\n• Design and re-architect Public or Hybrid cloud infrastructure (AWS, GCP and\n• Microsoft Azure) to ensure maximum uptime and... scalability to meet clients' constantly evolving business needs.\n• Support the service delivery team to initiate pilot projects, demonstrations, Proof of-concepts (POC), evaluations, managed services projects and consulting projects.\n• Design and implement Disaster Recovery as a Service (DRaaS) based on Public/Hybrid Cloud model.\n• Design solutions to migrate from No-Virtualization environment to a Virtualization or Cloud environment.\n• Exhibit strong understanding of the managed cloud hosting business concepts (AWS, GCP and Microsoft Azure), market practices and trends, customer needs, existing products and IT solutions, key global and regional players, business dynamics etc.\n• Should be conversant with making architectural decisions based on the cloud recommended architectural principles and best practices.\n• Extensive experience in 'Lift and shift' of an existing on-premises application to one of the cloud partners.\n• Experience in setting up, maintenance of Data Centre & Managed Cloud Services.\n• Extensive experience of creating Managed Cloud Solutions (Public, Hybrid) that is consistent of enterprise application and security standards and policies.\n• Experience in designing solutions for Disaster Recovery hosting on Cloud, Managed Services, on premise or hosted solutions, Virtualization techniques and High Availability solutions.\n• Consult & communicate with customers to prepare Various Technical solutions to enable the client organization to upscale their infrastructure without any downtime on Cloud platform.\n• Communicating expertise with Alliance partners, Application developers and OEMs like AWS, Google, Microsoft, etc.\nThe Candidate:\n\n• Knowledge of modern DevOps tooling (Jenkins, Ansible, Ansible, Chef, Puppet, Spinnaker, Terraform, etc.)\n• Experience migrating & deploying application of containers and managing applications with container management platforms (ECS, Kubernetes, Docker Swarm)\n• Knowledge in a CI/CD environment\n• AWS/ GCP or Azure\n• Passionate about IT and great communicator\n• Good presentation and documentation skills\n• Good interpersonal and analytical skills\n• Good stakeholder management, risk & issue management skills\nGood to have\n\n• 'AWS Certified Solutions Architect - Associate' Certification\n• 'Google Certified Professional - Solutions Architect' Certification\n• Microsoft Azure certifications", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDbG91ZCBTb2x1dGlvbnMgQXJjaGl0ZWN0IiwiY29tcGFueV9uYW1lIjoiVEVLc3lzdGVtcyAoQWxsZWdpcyBHcm91cCBTaW5nYXBvcmUgUHRlIEx0ZCkiLCJjb21wYW55X21pZCI6Ii9nLzExYjZnNGJrdjAiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJqaHJMS0tvckZUYjlscUtCQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFc3NDQ293Q1FVNVZYMDV4Vkc1MWVHSnNRbVp4VG5OWVdWUnJRV3BVZFRabE9UbEVNMnBqUkRoWFEzQTRObDlPTUMxc1Yya3lhRGx1WldsdlgyNUpPVlkwTVRBM1l6QjJTVGhvYkZSbk9HcG5iVWRhVmtsZmEyRTFiME5TZFhGUVRuUk1OR1YyV0d4NVIyRmlWVTE1VlZsaGEwdHlkbU16ZUZad1pGOXhWMnRPZEZGRFJUaDVhVE5ST1V4aWJVdERYM2cyVVhCVFMxQmlRMEp5T1ZGdk1tRTFWMWxsZWxvM1VtVlFTVEYzVFRRdE0zSkJNWG81VUZwVlRtcDZSalUwUzNwaE9VVXlTRkZ3UlVWbGR6UmFORlZoZVhoTVpUZzFhamxEUTFoUVdWSTNMVWxoT0ZjdGMyUllUekpaYTJ4TFQwNDNUVmhIY3pSSFVIZzNkWGxKZVhScFZEWldSSFkyY2xSd1lqZDFSMDluY3hJV1NWZzJRMWxQY2xsQ09HSlRkRUZZVlc1eFpYZEVaeG9pUVU5TldWSjNRa1ppZUdNdE5XZFNTalpDVW5KMlNuZEVNMGxOU0VKVWQxZEhkdyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzE0IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEVGaW5hbmNpYWxDYXJlZXJzIiwibGluayI6Imh0dHBzOi8vd3d3LmVmaW5hbmNpYWxjYXJlZXJzLmNvLnVrL2pvYnMtU2luZ2Fwb3JlLUNsb3VkX1NvbHV0aW9uc19BcmNoaXRlY3QuaWQxMDgwNjU2MD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "AWS Solution architect", "company_name": "Oliver James Associates", "location": "Singapore (+1 other)", "via": "via Jobs", "description": "Opportunity for an experienced Solutions Architect with AWS certification to join a leading and global organisation in the Insurance/FS industry!Looking for an individual to work with the technical leadership team to propose and design the system application architecture.Experience Required: AWS certified Solutions Architect Experienced in the solution architecture- including an understanding of the security Hands on full stack development experience- web applications- angular, CSS, js, .NET, ASP.NET Registration No: R1661132 EA Licence No: 20C0336", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBV1MgU29sdXRpb24gYXJjaGl0ZWN0IiwiY29tcGFueV9uYW1lIjoiT2xpdmVyIEphbWVzIEFzc29jaWF0ZXMiLCJjb21wYW55X21pZCI6Ii9nLzExYzczbm5sbGsiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJoMERsYk8wb19SMWZXQV84QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFb3NDQ3N3QlFVNVZYMDV4VTE5eGRsWXRRWG8yVDBsdk5FeFRWbXBzZWxWdFluWnhPRzFGWkVSbVEyNXBXbG80UnpKYU0xcHNZbk5QVUZKUE5teFpiblpNYjBVeVNVTktNbEJ4VW5sMmNWTjRTMGh5WlRaTlNraGtRV2xrV1dodFkzWjJablkwYVdwUExVWmxiRGd6VEdJMFRGWm5iVzlMWmt4RWNrVnBRakEzTWxoblIxbDZSbDh0VEVSR1ZFTndNRTV2WWtaT1NDMHRNakF3VlhSTFZ6RkxlRFpmYVVJeGRqWkZNR2hrUXpGblRVRm1iVTF4TWtwMFdVb3RUWFJwUjFCT05sb3lOWFJKYzFZMGNVOHplVlZ3RWhaSldEWkRXVTl5V1VJNFlsTjBRVmhWYm5GbGQwUm5HaUpCVDAxWlVuZENWM05uVGxodVNtcDNNMjFJWW5sTlRWZHhVRTEzWjNwVVlYVjMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18yMiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIiwibGluayI6Imh0dHBzOi8vc2cuZmlkYW50by5jb20vam9icy9qb2Itb3BlbmluZy9hcmNoaXRlY3RzLWV4Y2VwdC1sYW5kc2NhcGUtYW5kLW5hdmFsL2F3cy1zb2x1dGlvbi1hcmNoaXRlY3QtMjc3ODc1MTk1P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Cloud Solutions Architect", "company_name": "The Lancet", "location": "Singapore", "via": "via Mendeley", "description": "Job ID: JR0156640\n\nJob Category: Sales\n\nPrimary Location: Singapore, Central Singapore SG\n\nOther Locations:\n\nJob Type: Experienced Hire\n\nCloud Solutions Architect Job Description\n\nWe are a high-performing and dynamic team of senior technical sales professionals within Intel Corporation's Datacenter Sales group driving Intel's data-centric growth and transformation. We are looking for a highly motivated and passionate learner who will thrive in an inclusive and diverse team-setting, engage opportunities with new approaches and persevere until success is realized.\n\nIn this commissioned technical-sales role, you will be responsible for establishing preference and driving deployments of Intel-based solutions for Private-/Public-/Hybrid-cloud infrastructure and cloud/data services.\n\nYour main responsibilities are (but are not limited to) :\n• In collaboration with sales and technical leaders, your primary focus will be to help drive revenue growth by accelerating the adoption of novel... solution architectures that showcase Intel's advanced products and technologies\n• You will drive (private/hybrid/multi) cloud and data-pipeline implementation projects utilizing and expanding upon a deep expertise in CSP services/technologies as well as broad know-how around how applications and services are constructed using cloud platforms, and being a subject matter expert on security as it relates to customer applications and services\n• You will be expected to understand the business use-cases, technical merits and TCO (Total Cost of Ownership) value propositions; identify gaps and opportunities; and work adeptly in a cross functional team environment with Intel's product/solutions teams and ecosystem partners to deploy solutions that address the customers' requirements\n• You'll be expected to employ 'solution selling' methodologies to influence within the customer organization and Intel, manage Intel's engagements with engineering, architects, senior management and product line/business decision makers\n• You will cultivate senior-level relationships with global Cloud Service Providers (CSPs), Digital Services/SaaS providers, Enterprise and Government customers and SI (Solutions Integrators)/MSP (Managed Service Providers) partners to maximize Intel mindshare and gain insight, with the aim to increase and deepen our engagements based on win-win technology/business collaborations\n• You'll need to stay current and familiar with emerging vertical and horizontal technologies, products and technology trends. You will learn from, collaborate with, and influence the brightest technical minds in the industry to share best-practice knowledge amongst the Cloud Solution Architect community (within Intel and ecosystem partners) and encapsulate customer/market feedback into the Intel business units/development teams to shape future product/technologies.\n\nQualifications\n\nYou must possess the below minimum qualifications to be initially considered for this position.\n• Bachelor's degree or higher in Computer Science, Electrical Engineering or equivalent experience is required\n• Substantial years of experience in a technical sales role within a medium to large organization with a strong track record of selling technical Cloud (Public, Private, Hybrid), Data or AI solutions\n• Continued learning certifications, at least one of the following: AWS Certified Solutions Architect, Google Cloud Certified Architect, Microsoft Azure Solutions Architect, or similar\n• Experience as a Principal Cloud [Solutions] Architect, Cloud [Software] Systems Engineer, Customer Solutions Engineer [Cloud / Data, Analytics/AI] or combination of experience as DevOps Engineer, Data Architect, Cloud/SaaS Software Developer with hyperscale CSPs, GSIs and key market influencers\n• Strong verbal and written communication, presentation and collaboration skills. Good relationship building skills are necessary, including the ability to build a rapport and communicate effectively with all levels of Intel and the customer.\n\nInside this Business Group\n\nIntel's Sales and Marketing (SMG) organization works with global customers and partners to solve critical business problems with Intel based technology solutions. SMG works across business units to amplify the customers voice and deliver solutions that accelerate their business. Our teams work across the entire sales cycle, pushing ingredient products to our \"billings\" customers while also pulling end solutions through to \"consumption\". We work across numerous industries, including retail, enterprise and government, cloud services and healthcare as examples. The operations team focuses on forecasting, driving alignment with factory production and delivering efficiency tools and our marketing capability drives demand and localized marketing in locations around the globe. Our sales force navigates a complex partner and customer ecosystem while shaping product roadmaps, driving value for our customers, and collaborating to harness emerging technology trends to deliver comprehensive solutions.\n\nSG Experienced Hire JR0156640 Singapore\n\nCategories", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDbG91ZCBTb2x1dGlvbnMgQXJjaGl0ZWN0IiwiY29tcGFueV9uYW1lIjoiVGhlIExhbmNldCIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoibmw0X2VJc0xvdHJJYnl6dUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNZW5kZWxleSIsImxpbmsiOiJodHRwczovL3d3dy5tZW5kZWxleS5jb20vY2FyZWVycy9qb2IvY2xvdWQtc29sdXRpb25zLWFyY2hpdGVjdC0zNTA0NDI0P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Solutions Architect", "company_name": "ESOL PTE. LTD.", "location": "Singapore", "via": "via Learn4Good", "description": "Location: null\nRoles &\n\nResponsibilities\n\nWhat to expect:\n\nTechnically responsible for establishing the direction for the IT architecture, automation, implementation and delivering robust infrastructure approaches. Design architect and implement codification on new automation systems with integration to existing Ci/CD environment to deliver business value in accordance to existing DevOps practices Create, evaluates and implements plans and design proposals for high impact IT solutions, involving leading edge technologies and methods considering key factors such as its long-term effectiveness, practicality, technical limitations and criticality Develop and maintain Code to automate infrastructure and automation for compliance, logging, monitoring (CLM) requirements and integration to designate code repository lead and drive cloud operations efficiency with DevOps and continuous improvement together with infrastructure and application requirements Work in a cross-functional service team... consisting of software engineers, DevOps, DevSecOps and other specialists Minimum qualifications:\n\nDisciplines in Computer Science, Computer or Electronics Engineering, Information Technology or related qualifications. Minimum 10 years of design, implementation and consulting experience - must have a minimum of 3+ years hands-on experience as cloud/DevOps related technologies.\n\nMust be Certified AWS Solution Architect Preferred qualifications:\n\nProfessional certification in SysOps and/or DevOps in AZURE Kubernetes/ Docker added advantage Demonstrated experience and/or familiarity to work with different applications and/or Cloud Services to develop operations solutions to manage an infrastructure.\n\nExperience with application security and application compliance Demonstrated experience and/or familiarity with concepts / technologies in the following list will be an added advantage:\n\nShell (/bin/sh), Go, TypeScript, JavaScript, Kotlin, Python Data:\n\nMySQL (RDS), Couch\n\nDB, Redis Continuous Integration/Delivery:\n\nGitlab CI, Travis, Jenkin, Bamboo, GoCD Container Orchestration:\n\nKubernetes, Docker Compose Configuration and Compliance Automation:\n\nChef, Ansible Deployments:\n\nHelm, Kustomize, Fargate IaC:\n\nTerraform Hosting: AWS, Azure, GCP Logging:\n\nFluent\n\nD, Elastic\n\nSearch, Splunk Telemetry:\n\nPrometheus, Zipkin, Jaegar, Sysdig Security:\n\nHarbor, Clair, Vault, Open Policy Agent, Twistlock\n\nTell employers what skills you have\n\nCloud Computing\n\nDevOpsEnterprise Architecture\n\nEnterprise Software\n\nInformation Architecture\n\nIntegration\n\nPre-sales\n\nSOASoftware Development\n\nSolution Architecturedesignedenvironment\n\nCDautomation systemsbusiness value", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2x1dGlvbnMgQXJjaGl0ZWN0IiwiY29tcGFueV9uYW1lIjoiRVNPTCBQVEUuIExURC4iLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImpTRDhjdlNsQzZaOGx2U3lBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGVhcm40R29vZCIsImxpbmsiOiJodHRwczovL3d3dy5sZWFybjRnb29kLmNvbS9qb2JzL3NpbmdhcG9yZS9zb2Z0d2FyZV9kZXZlbG9wbWVudC8yNzEyOTI0MzIvZS8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Partner Solution Architect APAC", "company_name": "Cradlepoint", "location": "Singapore", "via": "via LinkedIn", "description": "This is a strategic role at a very important time as Cradlepoint expands across the APAC region. This position will be the lead Partner Solution Architect APAC facing partners driving enablement and skills into the selected partners. The Partner Solution Architect will support the partners in positioning Cradlepoint technology and solutions, will be the initial point of contact for partner CTOs and sales teams. He/She will be the link person between the partner technical and sales teams and the Cradlepoint selling teams in any given account or vertical. He/She will work side by side with the VP Partner Sales APAC. Enterprise and Public Sector are fast growing segments in our industry across the APAC region. The development of Enterprise class partners to address this opportunity is in early stages of development for Cradlepoint. We need a strong technologist and technology evangelist to drive onboarding, enablement and pipeline creation to meet company revenue expectations and partner... growth. Cradlepoint requires the creation of a community of partner SEs, Architects and CTOs in order to support the scaling of our business through the channel. The Partner Solution Architect serves as the main pre-sales technical point of contact for Cradlepoint’s system integrator and reseller partners. They create and drive the technical enablement strategy for partners in APAC by aligning Cradlepoint technology roadmaps with the account’s vision and strategy. Measures of success include increases in partner revenue, new customer acquisition rates, renewal rates, customer satisfaction, and certifications for partner technical resources.\n\nResponsibilities\n\nTrain and evangelize system integrator and reseller partners on Cradlepoint solutions and technology\n\nExceed quarterly sales quota targets and management objectives\n\nDocument end to end enterprise solution designs and architectures\n\nProactively identify potential 3rd party partners that would enhance Cradlepoint products and cloud offerings\n\nManage certification activity with system integrator and reseller partners\n\nWork in parallel with system integrator and reseller partners and Cradlepoint field sales teams on key customer opportunities\n\nDocument and prioritize new features and solution requests from system integrator and reseller partners\n\nPeriodically develop white papers and solution briefs\n\nCreate and deliver technical product and roadmap training presentations and demos.\n\nEngage and coordinate Cradlepoint enterprise support team during pre-sales trial and pilot activities\n\nSetup, configure and test innovative edge network solutions for system integrator and reseller partners in Cradlepoint labs working closely with internal R&D and QA teams\n\nModel the financial business case associated with each sales opportunity\n\nSuccessfully match customer pain/requirements to proposed solutions\n\nManage all technical aspects of RFP / RFI responses with partners\n\nEffectively communicate client needs to the R&D teams for future product enhancements\n\nCollect and document competitive intelligence\n\nTravel as required throughout APAC\n\nQualifications\n\nPreferred - Bachelor of Science\n\nExperience\n\nin a complex sales environment;\n\nAbility to forge strong, long-lasting relationships with senior executives.\n\nAbility to creatively explain and present complex concepts in an easy to understand manner.\n\nConfident self-starter with integrity and accountability; a track record of consistent achievement.\n\nDecisive problem-solving ability and capability to assess people and situations with accuracy.\n\n5+ years of experience working as a Sales Engineer/Solution Architect with system integrator and reseller partners.\n\n5+ years of experience building or supporting edge enterprise branch routing, security and wireless solutions.\n\nProven track record selling networking, wireless or security solutions into enterprise accounts, system integrators, and reseller partners\n\nExcellent written and verbal communication skills in English (additional language skills in addition to English would be desirable)\n\nExcellent presentation and creativity skills\n\nConfident self-starter with integrity and accountability; a track record of consistent achievement\n\nA strong aptitude for business strategy and excellent collaboration skills\n\nShould have practical hands on experience or strong knowledge in one or multiple areas:\n\nEssential\n\nExperience\n\nLAN/WAN network topologies and interworking (ie. MPLS, BGP, OSPF, EIGRP)\n\nEnterprise, Carrier or Public Wi-Fi solutions (ie. Motorola, Cisco, Meraki, Ruckus)\n\nSolid understanding of 5G, LTE, 3GPP(HSPA+,LTE)/3GPP2(EV_DO) Broadband Wireless Data Architectures\n\nVirtual Private Network Solutions and Technology\n\nNetwork Management Solutions\n\nNetwork Security (ie. UTM, Firewalls, IDS/IPS, SBC, ACL, NAT)\n\nExperience\n\nwith M2M and mobile solutions\n\nSD-LAN/SD-WAN experience\n\nEnterprise edge networking solution and managed services including ITIL\n\nSolid understanding of API and SDK technologies and python\n\nCradlepoint, Cisco, or other industry certifications at professional level or above", "extensions": ["14 hours ago", "Full–time"], "detected_extensions": {"posted_at": "14 hours ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQYXJ0bmVyIFNvbHV0aW9uIEFyY2hpdGVjdCBBUEFDIiwiY29tcGFueV9uYW1lIjoiQ3JhZGxlcG9pbnQiLCJjb21wYW55X21pZCI6Ii9nLzExYzc0M183YzkiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiI1M2ZpZ1o1M0VJTTk0RkMxQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VW5oT2EzY3dUVGRJWWxGRFpFWTVORTB0V1RGU2NVNHdhMVpvZVVWMFNuTmpNRXhsWlZCVmVXSlNiWEpXZEhwRlRURlpWMjQ1YzE5VlUyUnZlak5OZVU0MFlVaEtTak56WDJkb1N6bG1jMlpPUlRKVFltSkhZV2hVZDNsTE1WZElUMWRmUVd0M1lsVk9NamsxUldsR1Z5MHljazEwVTB0V2EwWXlOMUZRY1RreGVITm5NM1V6VkRCTWNHOU5WemQyVkhsYVRYUndYMHg0VDB4M0VoWkpXRFpEV1U5eVdVSTRZbE4wUVZoVmJuRmxkMFJuR2lKQlQwMVpVbmREVGtWSmN6aHJSMmhMT1dock4wOU9jMDlQYXpWRWRURkJNWFpSIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNDAiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGlua2VkSW4iLCJsaW5rIjoiaHR0cHM6Ly9zZy5saW5rZWRpbi5jb20vam9icy92aWV3L3BhcnRuZXItc29sdXRpb24tYXJjaGl0ZWN0LWFwYWMtYXQtY3JhZGxlcG9pbnQtMjUxNTcxOTA0Nj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Google Cloud Solution Architect (Specialist-Manager)", "company_name": "Accenture", "location": "Singapore", "via": "via Accenture", "description": "About Accenture\n\nAccenture is a global professional services company with leading capabilities in digital, cloud and security. Combining unmatched experience and specialized skills across more than 40 industries, we offer Strategy and Consulting, Interactive, Technology and Operations services—all powered by the world’s largest network of Advanced Technology and Intelligent Operations centres. Our 506,000 people deliver on the promise of technology and human ingenuity every day, serving clients in more than 120 countries. We embrace the power of change to create value and shared success for our clients, people, shareholders, partners and communities. Visit us at www.accenture.com.\n\nAccenture Technology combines business and industry insights with innovative technology services to transform your business. Join one of the world’s largest independent providers of technology services to grow your expertise and help clients worldwide to innovate at scale and transform their businesses... Help change how the world works and lives through technology innovation.\n\nJob Title: Google Cloud Solution Architect (Specialist-Manager level)\n\nAccenture's Google Cloud Platform team helps customers transform and evolve their business through the use of Google’s global network, web-scale data centers and software infrastructure. You will be an integral member in our entrepreneurial team in this rapidly growing business, helping to shape the future of businesses of all sizes use technology to connect with key stakeholders across all levels.\n\nResponsibilities include and are not limited to:\n• Serve as the Google Cloud Platform (GCP) SME to clients within Accenture team engagements for design, architecture, and deployment in the GCP cloud space using automated orchestration and configuration management techniques\n• Perform as a partner with leading Cloud Service Provider (CSPs) and enterprises to meet security goals and pave the way for digital transformation and modernization\n• Partner clients and team members to identify the right balance of defense-in-depth techniques to translate customer’s goals into a secure and effective solution\n• Engage in designing and implementing secure and compliant enterprise servers, network infrastructure, boundary protection, and cloud architectures using Infrastructure-as-Code\n• Be exposed to a myriad of other technology stacks in the leading cloud providers such as GCP, Azure and AWS understanding and utilizing their unique native services in deployments\n• Authoring and peer review of detailed design documentation, including security documentation and inclusive of vendor best practices", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJHb29nbGUgQ2xvdWQgU29sdXRpb24gQXJjaGl0ZWN0IChTcGVjaWFsaXN0LU1hbmFnZXIpIiwiY29tcGFueV9uYW1lIjoiQWNjZW50dXJlIiwiY29tcGFueV9taWQiOiIvbS8wMXJwMmMiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJlWElrN0NxZ2lLb1NSeDA3QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VWtkalZuaHZlRmwwYlZaclluZEtRMmxPTlRWTk9GcHNUVVZGTkVFMmJYbHZiMDA1VXpVNU5HWjBaMjlwY2tZMVJuRTFSbWh0VDBKUFF5MUhUSE4zVFhOcmNVeEZTVXQxTkRSaVVYSk9ZMjlHY1dWcmRWVnljblZhTW01Q1gyOUhja1o2TXpGWGNHWjRlWEZ6Y0RRdGRuaFpTVWxFTkRGUFZtVlBabkI1VEhWaWRGTjJTekZ0VDJWWFh6QnFRV3MxWTFOalpFSXdkblJEVlhkQkVoWkpXRFpEV1U5eVdVSTRZbE4wUVZoVmJuRmxkMFJuR2lKQlQwMVpVbmREUVZOMFIxcGhVamhIVUVSVk9VNUpZemRtVjFWVlRtVmthMmxSIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNDgiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQWNjZW50dXJlIiwibGluayI6Imh0dHBzOi8vd3d3LmFjY2VudHVyZS5jb20vc2ctZW4vY2FyZWVycy9qb2JkZXRhaWxzP2lkPTAwODU4NDE1X2VuXHUwMDI2dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Solution Architect, AWS Cloud", "company_name": "ANTAES ASIA PTE. LTD.", "location": "Singapore", "via": "via Learn4Good", "description": "Location: null\nRoles &\n\nResponsibilities\n\nJob\n\nDescription:\n\n· Contribute to projects for Antaes clients· Build and maintain the high-level architecture view of the program\n\n- Support the investigation on areas of the solution not fully decided yet by organizing brainstorming/follow-ups with internal and external experts and by contributing with his own expertise/experience.o\n\nE.\n\nG. but not restricted to: data platform, workflow automation tool, target Cloud patterns, multi-entity guidelines etc.\n\n- Follow-up with the program management team and participates in the weekly/monthly project meetings, act as SPOC for the Program PMO\n\n- Follow-up with application teams on the progress of architecture validation of their applications\n\n- Review solutions proposed by application teams and Domain solutions architects and check their alignment with our target principles.\n\n- Contribute to the promotion of Antaes services on top of assistance provided to clients\n\nJob\n\nRequirements:\n\n- Minimum... Bachelor’s Degree or equivalent experience required\n\n- At least 10 years in technical architecture or equivalent and have successfully carried out transformation projects\n\n- At least 2 years of experience in cloud technologies\n\n- Able to design cloud and legacy architectures (application and infrastructure), define cloud migration strategies (application and infrastructure)- Very good understanding of all the building blocks of the information system: application layers, networks, virtualization servers, storage and cloud systems, security, and business requirements to propose solutions to meet business needs.\n\n- Strong knowledge of the following technologies:o Linux / Windows system administrationo Languages: .NET, Javao Network and security concept:\n\nRouting, Firewall, IDS, IPS etco CI / CD tools:\n\nJenkins, Gitlab\n\nCI,, AWS toolso Infra As Code tools:\n\nTerraform, cloudformationo Containerization tools:\n\nDocker, rkto Container orchestrators: K8s, Openshift, EKS- AWS Cloud solution architect certification and other relevant professional certifications\n\nTell employers what skills you have\n\nCloud Computing\n\nDataEnterprise Architecture\n\nEnterprise Software\n\nIntegration\n\nJob Descriptions\n\nPatterns\n\nPre-sales\n\nProgram Management\n\nSOASoftware Development\n\nSolution Architectureguidelinesplatform\n\nWorkflow Automation\n\nHigh Level Architecture", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2x1dGlvbiBBcmNoaXRlY3QsIEFXUyBDbG91ZCIsImNvbXBhbnlfbmFtZSI6IkFOVEFFUyBBU0lBIFBURS4gTFRELiIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiNDktLWdmeWJ3NFJCLS1uN0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMZWFybjRHb29kIiwibGluayI6Imh0dHBzOi8vd3d3LmxlYXJuNGdvb2QuY29tL2pvYnMvc2luZ2Fwb3JlL3NvZnR3YXJlX2RldmVsb3BtZW50LzI3MTM4ODc3MC9lLz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior Solutions Architect", "company_name": "Amazon.com, Inc.", "location": "Singapore", "via": "via HelpOneBillion", "description": "Do you have a passion for helping customers design large distributed systems? Would you like to do this using the world's most advanced cloud computing technologies? Do you have a knack for helping organizations understand application architectures and integration approaches, architecting advanced cloud-based solutions, and launching the build-out of those systems? Are you one of those rare technologists with the consultative leadership skills to help guide major projects to success? Come join the Amazon Web Services (AWS) team as a Principal Solutions Architect in Singapore!\n\nAs an Enterprise Accounts Solutions Architect you will be responsible for creating and driving the technical strategy for strategic customer accounts with a complex and multi-faceted relationship with AWS. You will partner with customers, AWS partners and AWS teams to craft highly scalable, flexible and resilient cloud architectures that provide solutions to solve customer business problems and accelerate the... adoption of AWS services.\n\nThe right person will possess C-Level customer facing skills that will allow them to represent AWS well within the customer's environment and drive discussions with senior personnel regarding trade-offs, best practices, and risk mitigation. He/she should also have a demonstrated ability to think strategically about business, product, and technical challenges. He/she will have these attributes:\n\nBe fun to work with. Our company credo is \"Work hard. Have fun. Make history\". As the right candidate, you will love what you do, and instinctively know how to make work fun. You will be dynamic and creative, and willing to take on any challenge.\n\nEnjoy working with customers of all shapes and sizes. You will have a passion for educating, training, designing, and building cloud computing systems for a diverse and challenging set of customers.\n\nHave a strong understanding of large scale cloud computing solutions. You will enjoy keeping your existing technical skills and developing new ones, so that you can make strong contributions to deep architecture discussions around systems and applications in the cloud. You regularly take part in deep-dive education and design exercises along with technical deep dive drive technical discussions to create world class systems in AWS for your customers.\n\nThe right individual will have experience in most of the following areas:\n• · Business acumen - Leads confidently conversations at C-level and one-down (e.g. director, vice president) on strategic and transformational business subjects\n• · Architecture & design - Brings a proven track record in delivering enterprise and infrastructure architectures, application and service designs for distributed, business critical applications.\n• · Industry expertise - Is a subject matter expert in one of the areas including Financial Services, eCommence, Telco, Airlines, Manufacturing.\n• 10+ years of experience in design/implementation/consulting experience with distributed applications\n• Experience in infrastructure, compute, containers, database and networking architecture for large scale environments\n• Hands-on experience in application development and modernization including micro-service, and API driven-architectures\n• Working knowledge on a broad range of technologies including Serverless, Big Data and Analytics, Machine learning, Containers e.g. Kubernetes, etc.\n• Strong business acumen and interest to understand business problems and ability to explain the technology value proposition\n• Strong verbal and written communications skills, as well as the ability to work effectively across internal and external organizations.\n• Technical degree required; Computer Science or Math background highly desired.\n• AWS or other public clouds hands-on experience and certification\n• Experience working in a presales consulting role within the enterprise software market or Internet industries servicing MNCs or global enterprises.\n\nAmazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer, and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, disability, age, or other legally protected status", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29sdXRpb25zIEFyY2hpdGVjdCIsImNvbXBhbnlfbmFtZSI6IkFtYXpvbi5jb20sIEluYy4iLCJjb21wYW55X21pZCI6Ii9tLzBtZ2tnIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiOVlEc3lhNDRzUVpGN3NZbUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZZQkNyY0JRVTVWWDA1eFVYTkJiVXhZT1RKWmJVeG5kREJKTmxCRlNWUmFRMWRPU0VnM2NuTmphVVZYZVVaM1QwVktjV3d5YTNKSGFEWXhMWE5yU0VZMGRXUmZSVXBPTWxadVVHNHhla1ZXZGpWUFFURmFNSGcwWXprM2VtWkZXalpsVjBSeE0wRlJkMU5YYm5ScWMweEJZMFEyTTFGTVpHczNVR2RRU1hWaFJDMHlhRVJwVERrMUxWaHhWRlZGZUhSTFRHeFpUa05FWTBoa2VEbG5hMWd5T0RGNGRsbFpVMFIzTW05SGJWcFRkM2g0YlZSSU9WYzBia1paRWhaSldEWkRXVTl5V1VJNFlsTjBRVmhWYm5GbGQwUm5HaUpCVDAxWlVuZEVkbTFqY25oeFdHNXVaRWxWY21rMGEzSnRaMUIyWmpkaFdVaG4iLCJmY3YiOiIzIiwiZmNfaWQiOiJmY181OSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBIZWxwT25lQmlsbGlvbiIsImxpbmsiOiJodHRwczovL2hlbHBvbmViaWxsaW9uLmNvbS9qb2IvMDM0N2NlNGIxZjhiMjY0Mjk1OGRlMmFkMTZmZWM2MGIvU2VuaW9yLVNvbHV0aW9ucy1BcmNoaXRlY3Q/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Cloud Solutions Architect", "company_name": "Intel", "location": "Singapore", "via": "via Jobs", "description": "Job Description We are a high-performing and dynamic team of senior technical sales professionals within Intel Corporation's Datacenter Sales group driving Intel's data-centric growth and transformation. We are looking for a highly motivated and passionate learner who will thrive in an inclusive and diverse team-setting, engage opportunities with new approaches and persevere until success is realized.In this commissioned technical-sales role, you will be responsible for establishing preference and driving deployments of Intel-based solutions for Private-/Public-/Hybrid-cloud infrastructure and cloud/data services.Your main responsibilities are (but are not limited to) :In collaboration with sales and technical leaders, your primary focus will be to help drive revenue growth by accelerating the adoption of novel solution architectures that showcase Intel's advanced products and technologies You will drive (private/hybrid/multi) cloud and data-pipeline implementation projects utilizing... and expanding upon a deep expertise in CSP services/technologies as well as broad know-how around how applications and services are constructed using cloud platforms, and being a subject matter expert on security as it relates to customer applications and services You will be expected to understand the business use-cases, technical merits and TCO (Total Cost of Ownership) value propositions; identify gaps and opportunities; and work adeptly in a cross functional team environment with Intel's product/solutions teams and ecosystem partners to deploy solutions that address the customers' requirements You'll be expected to employ 'solution selling' methodologies to influence within the customer organization and Intel, manage Intel's engagements with engineering, architects, senior management and product line/business decision makers You will cultivate senior-level relationships with global Cloud Service Providers (CSPs), Digital Services/SaaS providers, Enterprise and Government customers and SI (Solutions Integrators)/MSP (Managed Service Providers) partners to maximize Intel mindshare and gain insight, with the aim to increase and deepen our engagements based on win-win technology/business collaborations You'll need to stay current and familiar with emerging vertical and horizontal technologies, products and technology trends. You will learn from, collaborate with, and influence the brightest technical minds in the industry to share best-practice knowledge amongst the Cloud Solution Architect community (within Intel and ecosystem partners) and encapsulate customer/market feedback into the Intel business units/development teams to shape future product/technologies. Qualifications You must possess the below minimum qualifications to be initially considered for this position.Bachelor's degree or higher in Computer Science, Electrical Engineering or equivalent experience is required Substantial years of experience in a technical sales role within a medium to large organization with a strong track record of selling technical Cloud (Public, Private, Hybrid), Data or AI solutions Continued learning certifications, at least one of the following: AWS Certified Solutions Architect, Google Cloud Certified Architect, Microsoft Azure Solutions Architect, or similar Experience as a Principal Cloud (Solutions) Architect, Cloud (Software) Systems Engineer, Customer Solutions Engineer (Cloud / Data, Analytics/AI) or combination of experience as DevOps Engineer, Data Architect, Cloud/SaaS Software Developer with hyperscale CSPs, GSIs and key market influencers Strong verbal and written communication, presentation and collaboration skills. Good relationship building skills are necessary, including the ability to build a rapport and communicate effectively with all levels of Intel and the customer", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDbG91ZCBTb2x1dGlvbnMgQXJjaGl0ZWN0IiwiY29tcGFueV9uYW1lIjoiSW50ZWwiLCJjb21wYW55X21pZCI6Ii9tLzAzczdoIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiRmdiajdESjBCdHhpS2NmeUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXNzQkNvd0JRVTVWWDA1eFVXbGpVMWs1TldOeGNYbFdNMjlPU2poUVNVbHNZV3MzYm1KUlNXRTFRaTEwVTNGa1IxOHdORkpZTW1oak9EZFJWRkpoVWtodFVsQTNUbWh0VkZsdFpITmhURUV4VDJWYU1UWXlVRmxVVmw5NGRscG1aRUZCV1doRFRsSmhTVjh3VWxSRmVsWnNNRE5MZGt0UlYydDFWV1JCUVVSQmFqUkdRMU5QT1dkVWRETk9iRk5mWkU4U0ZrbFlOa05aVDNKWlFqaGlVM1JCV0ZWdWNXVjNSR2NhSWtGUFRWbFNkMFIyUzBObk5IZFVUVEY1Y1hNNWJXbEhRVzlPWkRBM2MxaHRaSGMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY182NyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIiwibGluayI6Imh0dHBzOi8vc2cuZmlkYW50by5jb20vam9icy9qb2Itb3BlbmluZy9hcmNoaXRlY3RzLWV4Y2VwdC1sYW5kc2NhcGUtYW5kLW5hdmFsL2Nsb3VkLXNvbHV0aW9ucy1hcmNoaXRlY3QtMjc3ODg4ODA5P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}], "chips": [{"type": "Title", "param": "job_family_1", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Solution architect", "value": "solution architect"}, {"text": "Solutions architect", "value": "solutions architect"}, {"text": "Architect", "value": "architect"}, {"text": "Cloud architect", "value": "cloud architect"}, {"text": "Technical architect", "value": "technical architect"}, {"text": "Enterprise architect", "value": "enterprise architect"}, {"text": "Manager", "value": "manager"}, {"text": "Senior", "value": "senior"}, {"text": "Consultant", "value": "consultant"}, {"text": "Financial services", "value": "financial services"}, {"text": "Infrastructure architect", "value": "infrastructure architect"}, {"text": "Application architect", "value": "application architect"}, {"text": "Cloud engineer", "value": "cloud engineer"}, {"text": "It architect", "value": "it architect"}, {"text": "Lead architect", "value": "lead architect"}, {"text": "Network architect", "value": "network architect"}, {"text": "Security architect", "value": "security architect"}, {"text": "Senior architect", "value": "senior architect"}, {"text": "Systems engineer", "value": "systems engineer"}, {"text": "Associate director", "value": "associate director"}, {"text": "Deputy", "value": "deputy"}, {"text": "Engineers", "value": "engineers"}, {"text": "Head", "value": "head"}, {"text": "Infrastructure", "value": "infrastructure"}, {"text": "Lab", "value": "lab"}, {"text": "Network engineer", "value": "network engineer"}, {"text": "Presales consultant", "value": "presales consultant"}, {"text": "Public sector", "value": "public sector"}, {"text": "Senior analyst", "value": "senior analyst"}, {"text": "Senior consultant", "value": "senior consultant"}, {"text": "Senior director", "value": "senior director"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Software architect", "value": "software architect"}, {"text": "Solution consultant", "value": "solution consultant"}, {"text": "System administrator", "value": "system administrator"}, {"text": "System architect", "value": "system architect"}, {"text": "System engineer", "value": "system engineer"}, {"text": "Systems analyst", "value": "systems analyst"}, {"text": "Systems architect", "value": "systems architect"}, {"text": "Technical trainer", "value": "technical trainer"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Accounting", "value": "/business/naics2007/5412"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Management", "value": "/business/naics2007/55"}, {"text": "Real Estate", "value": "/business/naics2007/53"}, {"text": "Wholesale", "value": "/business/naics2007/42"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Amazon", "value": "/m/0mgkg"}, {"text": "Microsoft", "value": "/m/04sv4"}, {"text": "EPAM Systems", "value": "/m/0dlnrc"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "IBM", "value": "/m/03sc8"}, {"text": "Salesforce", "value": "/m/07btr5"}, {"text": "EY", "value": "/m/0g9jc"}, {"text": "Publicis Sapient", "value": "/m/02myjp"}, {"text": "Randstad", "value": "/m/08pt1z"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Alibaba Group Holding Limited", "value": "/m/07s6ctl"}, {"text": "Avanade", "value": "/m/094456"}, {"text": "Capgemini", "value": "/m/03vlk0"}, {"text": "Comtel Solutions Pte Ltd", "value": "/g/11dxpztgnb"}, {"text": "DELL", "value": "/g/11c54ch2jm"}, {"text": "Ericsson", "value": "/m/02kyh"}, {"text": "HTZ Resources", "value": "/g/11h21p9b4d"}, {"text": "Infinite Computer Solutions Pte Ltd", "value": "/g/11g9mj72yz"}, {"text": "Michael Page", "value": "/m/04cxldw"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "Orange Business Services", "value": "/m/08zvyz"}, {"text": "Recruitment Hub Asia Pte Ltd", "value": "/g/11dxpww_0f"}, {"text": "TEKsystems (Allegis Group Singapore Pte Ltd)", "value": "/g/11b6g4bkv0"}, {"text": "Talent Trader Group Pte Ltd", "value": "/g/11dxpmlc5b"}, {"text": "Tata Consultancy Services", "value": "/m/01psx8"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "Verizon", "value": "/m/07_dn"}, {"text": "A-Speed Infotech Pte Ltd", "value": "/g/11g9mxswl4"}, {"text": "ABeam Consulting", "value": "/g/11bc6whr_f"}, {"text": "Amazon Web Services (AWS)", "value": "/g/11dxprr2xv"}, {"text": "Amazon Web Services Singapore", "value": "/m/0rznzt1"}, {"text": "Aon", "value": "/m/0z7n"}, {"text": "Avaya", "value": "/m/01sqlk"}, {"text": "Azendian Solutions Pte Ltd", "value": "/g/11dxpvcjj2"}, {"text": "Big Cloud", "value": "/g/11c743lwsr"}]}]}