{"search_metadata": {"id": "6082798a4d443d3bf0666614", "status": "Success", "json_endpoint": "https://serpapi.com/searches/d1d2e49adf6f04b0/6082798a4d443d3bf0666614.json", "created_at": "2021-04-23 07:38:50 UTC", "processed_at": "2021-04-23 07:38:50 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28solution+architect%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=60", "raw_html_file": "https://serpapi.com/searches/d1d2e49adf6f04b0/6082798a4d443d3bf0666614.html", "total_time_taken": 1.0}, "search_parameters": {"q": "(solution architect) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "60"}, "jobs_results": [{"title": "#NEXTSOLUTIONS2020: Lead Cloud Architect (#5G)", "company_name": "Singtel Group", "location": "Singapore", "via": "via Singtel Careers", "description": "We have a great opportunity for a talented and self-motivated Associate Director, Cloud Architect to join our Go-Cloud team. At NCS, we seek to nurture talents in creating and developing innovative solutions. If you are passionate about new technologies and new ideas, NCS could be a place for you!\n\nResponsibilities\n\n• Engage customer actively to understand customer pain points and requirements.\n\n• Responsible for the definition, design and interpretation of technical architecture artefacts taken from user requirements specifications or in direct discussions with the business, to create solutions architecture, architecture blueprint, technology roadmap, etc. to meet business requirements\n\n• Contribute in detailed qualification of opportunities, formulate strategies and technical approaches\n\n• Build solution value propositions, including compelling business cases to accelerate solution adoption\n\n• Work closely with solution architect, sales, business development, internal and external... suppliers to produce quality and cost-effective technical solutions to address customer requirement.\n\nTeamwork\n\n• Adopt Cloud standards and methodology in implementation.\n\n• Share knowledge within or other NCS teams\n\n• Participate in peer reviews to improve project quality\n\nThe ideal candidate should possess:\n\n• Bachelor in Computer Science, Electrical/Computer Engineer, Information Technology or related discipline\n\n• Has minimally 8 years’ experience in designing/implementation/consulting of large-scale private/public/hybrid cloud infrastructure solutions\n\n• The candidate should have attained professional certifications in the following areas with at least 5 years of implementation experience in:\n\n• AWS/Azure\n\n• Possess hands-on experience and good technical skills with proven track records in IT infrastructure and/or emerging IT technologies engineering in the following area:\n\n• Platform, storage, database and virtualization\n\n• Cloud infrastructure (IaaS/PaaS)\n\n• Container technologies like Dockers, Kubernetes and AWS ECS\n\n• Knowledge of with DevOps techniques and Agile practices is an added advantage\n\n• Proficient in multi-tiered architecture, design and implementation\n\n• Experience with Web and server technologies including Virtualization, Web services, EAI, with knowledge of J2EE and SOA concept\n\n• Knowledge of client/server and distributed computing knowledge with messaging, SOAP, .NET and AD\n\n• Strong working knowledge and ability to apply architecture concepts, frameworks and methodologies to projects\n\n• Experienced in business and technical analysis, architecture design, project management.\n\n• Ability to communicate IT architecture methods, concepts, standards and policies\n\n• PMP, ITIL and TOGAF certification is an added advantage\n\n• Good written and verbal communication and presentation skills, able to interact professionally with all levels of the organization\n\nApply today if you would like to be part of the winning team that does great work!\n\n#NCSlife", "extensions": ["25 days ago", "Full–time"], "detected_extensions": {"posted_at": "25 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiIjTkVYVFNPTFVUSU9OUzIwMjA6IExlYWQgQ2xvdWQgQXJjaGl0ZWN0ICgjNUcpIiwiY29tcGFueV9uYW1lIjoiU2luZ3RlbCBHcm91cCIsImNvbXBhbnlfbWlkIjoiL20vMDIwemZsIiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiOU0zM2ZPMnAwQ0hySXJXa0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFVWbGphMk00ZDE5cVNVMVlja0l5WkV0dFprWjBiVFZIV1ZKYVJGcHBaekE0VFhabmNrSlZNV0pVYUdGa2JIZElTekJKY2xZNGRWUjViSFJHTTFablZFUkdWVjlVT0d4bVpXNVlMWEZHWm0xd2VtdDFRVnBaVjJjeGMxUkZiREZqUzFveE4zTkpWemxEYzBKUU5qVmZURWxRUVZsU2RtUk9PR0oxWWpNNGFHazNTMGg0ZURoclMwaFJWa05GYURSR09HOVhkVWhNTjJGR1QxcDNFaFpwYm0xRFdVOTFURVUxU3pSMFVXSjFlRnA2VVVSbkdpSkJUMDFaVW5kRWRYcEdVV3hEYTNRNVVFaEtNMk5LU0dsSFdVeDZkVWh2YTJoMyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzciLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gU2luZ3RlbCBDYXJlZXJzIiwibGluayI6Imh0dHBzOi8vZ3JvdXBjYXJlZXJzLnNpbmd0ZWwuY29tL2pvYi9ORVhUU09MVVRJT05TMjAyMC1Bc3NvY2lhdGUtRGlyZWN0b3IlMkMtQ2xvdWQtQXJjaGl0ZWN0LVNpbmcvNTc1ODYxMzEwLz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Cloud Solutions Architect (Presales), HCL Technologies, Singapore, Singapore", "company_name": "HCL Technologies", "location": "Singapore (+1 other)", "via": "via BizLINKS Resources Pte Ltd", "description": "Employer Referral\n\nCloud Solutions Architect (Presales) at HCL Technologies\n\nHCL Technologies helps global enterprises reimagine their businesses in the digital age. Through innovative technology solutions built around Digital, IoT, Cloud, Automation, Cybersecurity, Analytics, Infrastructure Management and Engineering Services, amongst others, we solve complex business problems for our clients. We are a 'next-generation’ technology firm, driven by a unique Mode 1-2-3 strategy that not only acts as our roadmap for the future, but also a powerful model for any enterprise looking to thrive in this age of disruption. Opportunity HCL Technologies is currently investing in its Cloud Solutions Practice which is growing rapidly across the globe. Cloud Solution team is considered an elite and high-performance team across the company. As part of this, we are seeking to recruit an experienced 'Solution Architect’ to join our Enterprise Cloud Architecture Solutions practice based in Singapore... The successful candidate will have skills w.r.t cloud solutioning, presales, consulting and client engagement and will have successful track record at least with two leading cloud service providers. The primary objective of the role is to focus on achieving sales targets, either through acquisition of new business and/or through extension of scope within existing clients. Working closely with the Business Development Executives, sales teams and COEs, providing managed application, platforms and infrastructure services in the cloud opportunities. Responsibilities To work effectively with the key stakeholders across the Cloud Solutions practice and Business Development Executives (BDEs) within HCL Technologies to effectively lead the aligned pre sales and consulting engagements to success To engage with CxO level stakeholders at prospective clients in advisory capacity to deliver high impact solution-shaping workshops Analyse customer business problems, elicit functional and non-functional requirements, and formulate actionable strategies to solve customer challenges by leveraging existing offerings or through the creation of new GTM offerings. Producing compelling value propositions and customer solutions, throughout the sales lifecycle, owning the Cloud Solutions elements of formal RFI/PQQ and client conversations / presentations as required Be fully mobile and support BDEs in client presentations and Meetings supporting the proposed technical solutions Working with the BDEs, contributing to sales and margin target achievements on assigned pipeline opportunities. Be at the forefront of technology discussions within the Managed Services, Cloud space and actively liaise with the Service Design and Management teams within the practice to contribute towards the successfully contract signature Actively feed new ideas and opportunities back to the GTM offering team to ensure team members are aware of the latest technology and its potential application. The ability to lead workshops and brain storming sessions designed to identify and plan high value strategic solutions. Ensuring HCL quality and efficiency practices are adhered too. Ensuring that responses achieve maximum level of re-use of standardised artefacts and offerings artefacts. Remain technology and market aware to ensure the production of relevant customer propositions and GTM offerings. Expertise The ideal candidate will be an experienced Solution Architect with a proven track record of winning business and guiding clients through the entire client acquisition process. The typical skills set of Solution Architect: Requires 6-14 Years of experience in end to end pre-sales / solutions selling on high net worth deals and comes from hands on implementation background Experience in architecting solutions, ability to understand customer pain points, requirements and translate these into a winning solution approach, responding to RFPs for cloud management Outsourcing Services Strong client facing and communication skills and capable to independently think, conduct customer workshops articulate and comprehend customer pain points in technology and commercial areas for providing solutions. Hands-on Public cloud infrastructure design and deployment experience in enterprise organisations Excellent soft skills particularly in client expectation management. Ability to articulate to both technical/non-technical stakeholders for RFPs. Good knowledge towards cloud transformation and migration engagements. Excellent understanding of various cloud technologies- Azure and AWS Proven track record and accurate solutions estimations in Cloud infrastructure design - including network topology and security considerations Automation and Configuration management. Cloud consumption and economics Cloud Technology platforms Monitoring Solutions PaaS and Containers Solutions Application modernization is an added advantage Good networking, LAN/WAN, TCP/IP knowledge and security experience including high-level design Cloud certification is desirable - e.g. AWS/Azure/VMWare: Cloud Platform and Infrastructure. Expert knowledge of AWS & Azure platform features and capabilities Networking & Security – VPC , Direct Connect , ELB Virtual Network, ExpressRoute, Traffic Manager, Load Balancer, DNS, VPN Gateway, Application Gateway , SG , ACLs , MFA etc . Data & Storage (SQL Database, Document DB, Redis Cache, Storage: Blobs, Tables, Queues, Files and Disks) o Networking Identity & Access Management (Active Directory, Azure Active Directory B2B, Azure Active Directory Domain Services, Multi-Factor Authentication) Understanding of common application approaches and technologies (e.g. SOA, message queuing) Experience using AWS Cloud Formation or automated deployment/configuration tools (e.g. Chef/Puppet) Outstanding presentation and communication skills, especially with senior level stakeholders Experienced in eliciting requirements from formal and informal documents and conversations Experience mapping RFI/PQQ requirements to Services, Solutions and Offerings Experience scoping, defining and commercialising value propositions Ability to collaborate across the business where required Be proficient in assessing options (e.g. risk, performance, cost-benefit) and informing decision-makers with persuasive visualisations based upon assessment outputs. Show moreOriginal Joblink: https://sg.linkedin.com/jobs/view/cloud-solutions-architect-presales-at-hcl-technologies-1985246544?refId=6d39b614-8c7b-49c4-ac5a-3cd0c6333c52&position=17&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click ", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDbG91ZCBTb2x1dGlvbnMgQXJjaGl0ZWN0IChQcmVzYWxlcyksIEhDTCBUZWNobm9sb2dpZXMsIFNpbmdhcG9yZSwgU2luZ2Fwb3JlIiwiY29tcGFueV9uYW1lIjoiSENMIFRlY2hub2xvZ2llcyIsImNvbXBhbnlfbWlkIjoiL20vMDY5OGd2IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiTUNoMDJWQVdBOUtxT05UU0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZZQkNyY0JRVTVWWDA1eFUzbzFXbW8wYlRJMVJUSkhlVkJGUmpSSmRXTjRNM2x3V0hKYVNXOWZPWE14YmpscWJEQXRTMmhYVFZZelptSk9UMmhTTUZGbVluRlZWV3B3VUZVdFZDMWFRVWQwUTJGS1R6aE5VelZ3TkdoMk1WZGtjMjVQUTJ0S056VnNVVTF6Tmw5TFRITXhWalZLUVZGSFVVWmFhRVZyWVdkcE4wNVdibEZvYTA1VFVXaGtaMjR3TlY5VWNXcFNOblUzVkhrMVgyOUxPVXREYTI1Qk1pMUZSSHBzYzNab1dURTFPVVpzUVMxR2Fua3lUQzA0RWhacGJtMURXVTkxVEVVMVN6UjBVV0oxZUZwNlVVUm5HaUpCVDAxWlVuZEJiVkJzVW05WFRVdFRXakY0YTJ0c1Mya3hTMGhZUzB4bldIVjMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18xNSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCaXpMSU5LUyBSZXNvdXJjZXMgUHRlIEx0ZCIsImxpbmsiOiJodHRwczovL3d3dy5iaXpsaW5rc3Jlc291cmNlcy5jb20uc2cvaW5kZXgucGhwL2pvYi1saXN0aW5ncy1wdWJsaWMvODgtc3lzdGVtcy1lbmdpbmVlcnMvMjUwNS1jbG91ZC1zb2x1dGlvbnMtYXJjaGl0ZWN0LXByZXNhbGVzP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Solutions Architect", "company_name": "Esol Pte. Ltd.", "location": "Singapore", "via": "via Monster", "description": "What to expect:\n• Technically responsible for establishing the direction for the IT architecture, automation, implementation and delivering robust infrastructure approaches.\n• Design architect and implement codification on new automation systems with integration to existing Ci/CD environment to deliver business value in accordance to existing DevOps practices\n• Create, evaluates and implements plans and design proposals for high impact IT solutions, involving leading edge technologies and methods considering key factors such as its long-term\n• effectiveness, practicality, technical limitations and criticality\n• Develop and maintain Code to automate infrastructure and automation for compliance, logging, monitoring (CLM) requirements and integration to designate code repository\n• lead and drive cloud operations efficiency with DevOps and continuous improvement together with infrastructure and application requirements\n• Work in a cross-functional service team consisting of software... engineers, DevOps, DevSecOps and other specialists\n\nMinimum qualifications:\n• Disciplines in Computer Science, Computer or Electronics Engineering, Information Technology or related qualifications.\n• Minimum 10 years of design, implementation and consulting experience - must have a minimum of 3+ years hands-on experience as cloud/DevOps related technologies.\n• Must be Certified AWS Solution Architect\n\nPreferred qualifications:\n• Professional certification in SysOps and/or DevOps in AZURE\n• Kubernetes/ Docker added advantage\n• Demonstrated experience and/or familiarity to work with different applications and/or Cloud Services to develop operations solutions to manage an infrastructure.\n• Experience with application security and application compliance\n• Demonstrated experience and/or familiarity with concepts / technologies in the following list will be an added advantage:\n• Shell (/bin/sh), Go, TypeScript, JavaScript, Kotlin, Python\n• Data: MySQL (RDS), CouchDB, Redis\n• Continuous Integration/Delivery: Gitlab CI, Travis, Jenkin, Bamboo, GoCD\n• Container Orchestration: Kubernetes, Docker Compose\n• Configuration and Compliance Automation: Chef, Ansible\n• Deployments: Helm, Kustomize, Fargate\n• IaC: Terraform\n• Hosting: AWS, Azure, GCP\n• Logging: FluentD, ElasticSearch, Splunk\n• Telemetry: Prometheus, Zipkin, Jaegar, Sysdig\n• Security: Harbor, Clair, Vault, Open Policy Agent, Twistlock", "extensions": ["29 days ago", "Full–time"], "detected_extensions": {"posted_at": "29 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2x1dGlvbnMgQXJjaGl0ZWN0IiwiY29tcGFueV9uYW1lIjoiRXNvbCBQdGUuIEx0ZC4iLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Im5DVWNwU3NxMDllVXVlQk9BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTW9uc3RlciIsImxpbmsiOiJodHRwczovL3d3dy5tb25zdGVyLmNvbS5zZy9hbXAvam9iLXZhY2FuY3ktc29sdXRpb25zLWFyY2hpdGVjdC1lc29sLXB0ZS1sdGQtc2luZ2Fwb3JlLTI3NDg5ODM1Lmh0bWw/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Global Solutions Architect", "company_name": "Equinix", "location": "Singapore", "via": "via Bayt.com", "description": "Global Solutions Architect\n\nWho are we?\n\nEquinix is the world’s digital infrastructure company, operating 200+ data centers across the globe and providing interconnections to all the key clouds and networks. Businesses need one place to simplify and bring together fragmented, complex infrastructure that spans private and public cloud environments. Our global platform allows customers to place infrastructure wherever they need it and connect it to everything they need to succeed.\n\nWe are a fast-growing global company with 70+ consecutive quarters of growth. Through our innovative portfolio of high-performance products and services, we have created the largest, most active global ecosystem of nearly 10,000 companies, including 1,800+ networks and 2,900+ cloud and IT service providers in over 26 countries spanning five continents.  \n\nA career at Equinix means you will collaborate on work that impacts the world and be surrounded by endless opportunities to learn new skills and grow in... varied directions. We embrace diversity in thought and contribution and are committed to providing an equitable work environment. that is foundational to our core values as a company and is vital to our success. \n\nThe Global Solution Architect (GSA) builds complex solutions that leverages designs from existing portfolio of reference architectures and identifies unique opportunities to incorporate technology components found in the larger Equinix ecosystems & solutions offers. The GSA will possess a general awareness of and industry technology trends used in those complex solutions development.\n\nThe role is to provide Technology subject matter expertise and the appropriate application digital transformation strategies to help Equinix clients achieve their business goals through a consultative selling. The GSA will support qualified opportunities with a heavy bias towards Demand Creation & Capture activities in the field. Key domain expertise includes Networking, Cloud and Enterprise Architecture.\n\nResponsibilities:\n• Be the primary Global Solutions Architect resource for Equinix’s Singapore-based Enterprise, Global Systems Integrators and Network Service Providers’ accounts.\n• Research, evaluate and stay current on emerging tools, techniques and technologies.\n• Ability to articulate how Equinix’s interconnection-driven strategies and product/services roadmaps can address customers’ digital transformation roadmaps\n• Create partner activation and technology plans based on an understanding of the customer's organizational strategic direction, technical context and business needs\n• Provide technical support for marketing initiatives through participation in proposals and marketing studies\n• Work well in a highly matrix organization with primary interface with Sales, CIO, CTO and CMO organizations\n\nRequirements\n• 10 to 15 years of proven experience in the functional technical domains of Network, Cloud and Enterprise Architecture.\n• Exposure to Enterprise and Service Provider solutions selling and product development experience\n• Innovative thought leader, entrepreneurial, and recognized in the industry through channels such as social media for authoring white papers, or public speaking engagements.\n• Ideal candidate will have a background in pre-sales consulting and solutions selling in building and designing global Enterprise network architectures, content distribution networks, hybrid cloud computing and interconnection, and Enterprise infrastructure solutions for server and storage.\n• Substantial cloud and telecommunications experience required; technical and commercial knowledge of network operator topologies, Global Cloud Service Providers’ IaaS / PaaS / SaaS computing platforms, and IP/BGP routing.\n\nTechnology Domains\n\nCandidates will have a strong technical expertise in one of the following domains:\n• Networking\n• Substantial telecommunications experience required; technical and commercial knowledge of Tier 1/2 ISPs topology and architecture and IP routing is required.\n• Proficient in router and switch features and configuration, BGP and other routing protocols, performance measurement, tuning and scaling, and reliability and security techniques.\n• Experience with Network Peering, CDN’s, fault tolerant designs, and QOS mapping\n• Proficient with common networking telecom concepts: routing and switching protocols, MPLS and IPVN services\n• Cloud Computing\n• Public, Private and Hybrid cloud services design and deployment methodologies and reference architectures\n• Software-Defined and API-driven interconnection solutions, OpenStack, OpenFlow and network automation and virtualization\n• Well-versed with any of the Global Cloud Service Providers’ (CSP) IaaS / PaaS / SaaS solutions stack and use cases\n• Enterprise Infrastructure\n• Must have a thorough understanding of, and experience with, servers, storage, layer 3 networking and enterprise software. Solid understanding of the entire OSI stack\n• On-prem and hybrid Storage Platform technologies\n\nRequired Education\n• Bachelors degree or equivalent industry experience\n• Possesses undergraduate degree in a related field (business, technical, professional\n• Certifications highly regarded\n• Advanced industry certifications in lieu of degree (Example: CCNP, JNCIA-ENT or -Junos, MCSA / MCSE, AWS SA – Associate / Professional)\n\nOther Requirements\n• Candidate will exhibit confidence and influence when presenting verbal and written proposals to prospects, structuring consulting agreements, and be comfortable developing SOWs and related consulting deliverables.\n• Candidate must be comfortable handling all phases of a consulting engagement, and will ideally show potential to attract and manage additional talent over time.\n• Candidate will be comfortable speaking at conferences, acting as an authority in his field, and prospecting from industry events.\n• Demonstrate strong listening and collaboration skills for uncovering unmet customer technology-based needs and translating the requirements into strategic solutions\n• High motivational level and appetite for fast-paced team environment; readily adaptable to changing market and organization requirements\n• Results oriented", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJHbG9iYWwgU29sdXRpb25zIEFyY2hpdGVjdCIsImNvbXBhbnlfbmFtZSI6IkVxdWluaXgiLCJjb21wYW55X21pZCI6Ii9tLzA3YnRucSIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImFSZjZxQzlrcXByMXhSUVBBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVzc0JDb3dCUVU1VlgwNXhVM1JKVTJkWWJVbFRTVGRVT0V3MldWSXlTM1pPZDNSUVJFNVRUalJzUkRoRVdHZzNTalpQVlRWM1NuQkhMVEJOT0V0ZlYzZG9la05GTURodE5sRnhTM1JKU2xjeE0weHBNRmg1Vkc1WVJVSnVPRUpSTlZwMmVVVXliV2xtTlhvNWVWTk1NbmxKWW5oUWNIQlFUMWhEVHpseWVuUnBhMk5zZGpCRk5HRkJZVXBLT0ZFNWRYWVNGbWx1YlVOWlQzVk1SVFZMTkhSUlluVjRXbnBSUkdjYUlrRlBUVmxTZDBGYWIwMUdSRFZyZEdOSE5uQmxkazFTTTFoVVFtMU1hbk52VkhjIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMjYiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQmF5dC5jb20iLCJsaW5rIjoiaHR0cHM6Ly93d3cuYmF5dC5jb20vZW4vc2luZ2Fwb3JlL2pvYnMvZ2xvYmFsLXNvbHV0aW9ucy1hcmNoaXRlY3QtNTc3NDI4OTgvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "MySQL Solution Architect & DBA", "company_name": "Kris Infotech : Technology & Talent - Synced", "location": "Singapore", "via": "via LinkedIn", "description": "Job Description\n• Leads the planning, executing and implementation of multiple projects and roll outs.\n• Project Governance: control on project scope, schedule, budget, risk & issues.\n• Facilitates timely decisions to maintain project schedule and budget.\n• Provides management with regular project updates, creates and maintains trusting\n\nrelationships, identifies and manages project issues, identifies project risks early and assists by\n\nproviding prudent and timely recommendations for risk response.\n• Partners with various functional and technical teams\n• Lead from front on Business Process set-up workshop by demonstrating Domain/industry\n\nexperience on best practices.\n• Communicates effectively with sponsors, stakeholders and team members.\n• Reports on the status, issues, key activities and any changes to the charter of the overall\n\nproject. Identifies and communicates resource conflicts.\n• Provides presentations on project updates, project cycle, and expected results.\n• Builds a... close working relationship with clients/vendors to enhance the image of the T-\n\nSystems.\n• Applies testing knowledge to develop user acceptance criteria, testing activities, and\n\nintegration schedule, to ensure all changes and new functionalities are successfully added to the\n\nsystem landscape.\n• Creates and maintains project documentation charters, PM plans, schedules, status reports,\n\nchange requests etc.\n• Monitors and controls execution phase to ensure that projects are completed on time and\n\nmeets all business and system requirements.\n• Conducts all project management tasks to ensure schedule, cost, and quality goals are\n\nachieved.\n• Develops and maintains standards and procedures for project reporting and documentation\n\nRequirements\n• Suitable candidate shall have 8+ years’ experience on MySQL (Oracle) Implementation + roll\n\nout projects across Asia Pacific countries\n• Candidates with prior Solution architect or DB architect using MySQL will be preferred\n• Shall have strong Functional consulting background especially in Healthcare industry\n• An excellent verbal and written communication skill in the English language\n• Good Knowledge on PMI Project Management Body of Knowledge Processes and ITIL\n\nProcesses\n• Experience on planning, scheduling and driving all party meetings\n• Sensitivity to working across other cultures and respects and values diversity\n• Demonstration of desire to keep abreast of technological changes and recommends service\n\nimprovements and cost savings measures.\n• Proven experience in managing/supporting large complex environments with multiple\n\napplications versions, tools and customers\n• Project Management Professional Certification is required\n• Self-motivated and have the ability to deliver results and meet timelines with minimal direct\n\nsupervision.\n• Good command of Microsoft Excel, Project, Power Point, VISIO is required", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJNeVNRTCBTb2x1dGlvbiBBcmNoaXRlY3QgXHUwMDI2IERCQSIsImNvbXBhbnlfbmFtZSI6IktyaXMgSW5mb3RlY2ggOiBUZWNobm9sb2d5IFx1MDAyNiBUYWxlbnQgLSBTeW5jZWQiLCJjb21wYW55X21pZCI6Ii9nLzExYzcza2x4M3MiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJnQjl5dTRIWDE0cXVRZ0NUQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFc3NDQ293Q1FVNVZYMDV4VW14S1lWQktiR1V4UkdocmIxQk1iMTlSY2poVWIxcGZMVVYzVm1rNGJXbGpTRXhTYWtsMmVsaHFlbXhaWHpKaGNWUmZjVTl6YTNaMWMyRllYMjVSVVZWdlR6ZENRMjFTWXpSUE4wbEhSSFZyYzJaRmVGRnBjRkpLYW5vMFozQnBlakkzYnpOV1prVnZURGRCUzIxVlpTMWtSWG93WVZseVJWZHdPUzEyZW5aeVdrdFJPRGcxZEV0dU9HMXVOVlZJYUV4aVdGbFlSVlZyY0VRNUxXNUlVV1JEUVc5dlJtc3RUR1U1UTJWb09HVldZbVJOYjJ4TFFVVXljbXhJVURWVE5IQTVabE5tVG1VdFJXVndVa1pWV0VaWExYQmllazVFYW5WeVFYWkNaemt0TUV0VWVrWnFVVWREUkZWTGJtOTZVRnBNU25wNWJGTldjRll0VlcweVJsVXpkRWRxY3hJV2FXNXRRMWxQZFV4Rk5VczBkRkZpZFhoYWVsRkVaeG9pUVU5TldWSjNSRzF4VG1weVIxaGlNbU0xVVhnMVNYTnlNR1ZOTVdabldGSmFkdyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzM0IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExpbmtlZEluIiwibGluayI6Imh0dHBzOi8vc2cubGlua2VkaW4uY29tL2pvYnMvdmlldy9teXNxbC1zb2x1dGlvbi1hcmNoaXRlY3QtZGJhLWF0LWtyaXMtaW5mb3RlY2gtdGVjaG5vbG9neS10YWxlbnQtc3luY2VkLTI1MTIyMTE1NTY/cmVmSWQ9ZGZjMGIwMzMtN2M0NC00OTA1LTk5NjAtMTYzN2I4NTdiMjUwXHUwMDI2dHJhY2tpbmdJZD02U1UybnpnVllGcEJFOVRvJTJCWnhVNGclM0QlM0RcdTAwMjZwb3NpdGlvbj0yNFx1MDAyNnBhZ2VOdW09MFx1MDAyNnRyaz1wdWJsaWNfam9ic19qb2ItcmVzdWx0LWNhcmRfcmVzdWx0LWNhcmRfZnVsbC1jbGlja1x1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Solution Architect & Delivery Lead", "company_name": "IOTALENTS PTE. LTD.", "location": "Singapore (+1 other)", "via": "via Learn4Good", "description": "Position: Solution Architect cum Delivery Lead (Ref: BN)\nRoles &\n\nResponsibilities\n\nResponsibilities:\n\nWork with Product Owner(s) to translate business requirements to technical requirements, including establishing delivery timelines and deliverables. Draw up the technical architecture based on the user stories established from the business requirements. Propose technical solution from high level to details for system integration in the complicated application system. Manage day-to-day activities of the team/squad, including creating, prioritising and managing the backlogs of activities.\n\nEnd-to-end project delivery experience in an agile manner. Assess, define, implement and support world-class Agile transformation programs. Manage and coach a team of tech developers\n\nRequirements: A bachelor’s degree in a relevant computer science, engineering, information technology or related field. 10 years of delivery lead experience with hands-on experience in solution architecture, delivering... agile projects (planning, execution and team management) as well as managing a team of tech developers. Possess one or more of the following certifications: (1) Certified Scrum Professional, or (2) SAFe Program Consultant, Lean Methodologies\n\nAble to solve complex development problems and produce the highest quality code while striving to push the technical boundaries of online applications.\n\nExperience with web scripting languages such as PHP, Javascript, or Python. Familiar with AWS components and services, e.g. S3, API Gateway, Lambda Functions, etc. and knowledge in one or more programming languages (e.g., Python, Javascript, Swift). Extensive knowledge and experience with driving and applying user-centered design processes while working collaboratively with customers, along with cross-functional teams including engineering, product management and user research.\n\nPossess a strong Agile delivery track record, and willing to contribute actively within the firm’s Agile community. Experienced in implementing Agile and Lean practices in the context of Software Engineering. Extensive work experience as Scrum Master, with in-depth knowledge of DevOps and strong background in agile tools (eg Jira). Excellent communication (written and oral) and interpersonal skills. Excellent leadership and management skills.\n\nIf Interested, kindly email your updated CV in MS Word format to (Please contact us using the \"Apply for this Job Posting\" box below), along with below details :\n\nTotal years of working experience :\n\nCurrent\n\nLocation:\n\nVisa:\n\nCurrent Salary:\n\nExpected Salary:\n\nNotice Period:\n\nTell employers what skills you have\n\nAgile Methodologies\n\nArchitecture\n\nAWSBusiness Intelligence\n\nCertified Scrum Master CSMEnterprise Software\n\nRequirements Analysis\n\nScrum\n\nSolution Architecture\n\nWeb Services", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2x1dGlvbiBBcmNoaXRlY3QgXHUwMDI2IERlbGl2ZXJ5IExlYWQiLCJjb21wYW55X25hbWUiOiJJT1RBTEVOVFMgUFRFLiBMVEQuIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJwdE82UzdIWjVmejBRSENSQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExlYXJuNEdvb2QiLCJsaW5rIjoiaHR0cHM6Ly93d3cubGVhcm40Z29vZC5jb20vam9icy9zaW5nYXBvcmUvc29mdHdhcmVfZGV2ZWxvcG1lbnQvMjcxMjg4MDY2L2UvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Cloud Solutions Architect (DevOps)", "company_name": "Orange Business Services", "location": "Singapore", "via": "via Jobs", "description": "Orange is currently looking for a senior cloud solutions architect, to join the team in Singapore. The role will have a focus on growing the Orange infrastructure services business, with specific reference to the Cloud and Managed Services portfolio. The role will be supporting countries in APAC.The ideal candidate will possess both pre-sales and post-sales experience in architecting applications on with public cloud solutions such as Azure, AWS, and GCP. The Solutions Architect will work as part of the regional cloud team to meet with customers, act as a subject-matter expert for this portfolio, and subsequently propose, design and implement respective solutions.Primary Duties & Responsibilities · Provide technical expertise in analysing customer requirements, recommending solutions, and assisting sales and other pre-sales consultants with the development of proposals, quotations, and presentations.· Accountable for technical validation of solutions proposed to customers, including... liaising with Orange back-end Engineering, Implementation and Operations teams.· Assist the delivery teams by performing high level and low level design activities, including best practice recommendations on technologies and vendors.· Work with the wider APAC team to assist on opportunities which fall outside primary responsibilities where required.· Technical responsibilities include product selection and sizing, complex solution design and multi-vendor integration, and to facilitate product demonstrations and customer proof of concept engagements.· Travel is not a major part of the role, but is required from time to time.Required Skills & Experience · Minimum of 8 years of experience in IT (preferably 10+), including architecture design/implementation experience with multiple compute, storage, networking and virtualization technologies.· Experience leading devops team to follow best practice· Application architecture experience. Ability to explain how to deploy an application on cloud using some of native services.· Will hold a Bachelor’s degree or higher, and be fluent in spoken and written Mandarin (business level) as well as comfortable in spoken English.· Ability to work closely with customers and deal with them in a professional manner· Excellent verbal and written communication skills, including ability to produce clear and detailed pre-sales and technical documentation.· Strong presentation skills, able to articulate both the technical and business value propositions of proposed solutions.· Previous experience with a Systems Integrator or Consulting organization would be preferred.· Although this is not a ‘hands on’ role, prior technical experience in the following products would be advantageous:o Amazon Web Services (Associate or Professional)o VMWare vSphere (preferably VCP certified)o Cisco LAN & IP Routing (preferably CCNA certified)o Microsoft Technologies (preferably MCSE certified)o Enterprise Storage Technologies (experience with NetApp and/or EMC)o Server Technologies (experience with HP, Dell, Huawei and/or Cisco UCS)o Opensource knowledge includes Openstack, chef, AnsibleWe are making business life easier, every day and all around the worldAs a global IT and communications services provider, Orange Business Services helps companies collaborate more effectively, operate more efficiently and engage better with their customers – connecting their people, sites and machines securely and reliably.Through a unique combination of robust network and IT infrastructure, managed services and professional, reliable people, we do everything we can to offer an outstanding customer experience - helping to change business life for the better.Some facts & figures: We have nearly 20,000 staff in 166 countries & territories Our network, the world's largest, reaches 220 countries and territories, including 88 Russian regional subdivisions and 200 Chinese cities. About our customers: 3,750 multinationals 2/3 of top global 100 companies 70% of Fortune 500 financial services companies 8 million business mobile users Additional Company Information Registration No. 199505973R Company Size 1 - 50 Employees Average Processing Time 11 days Telecommunication Benefits & Others Regular hours, Mondays - Fridays, Business (e.g. Shirts", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDbG91ZCBTb2x1dGlvbnMgQXJjaGl0ZWN0IChEZXZPcHMpIiwiY29tcGFueV9uYW1lIjoiT3JhbmdlIEJ1c2luZXNzIFNlcnZpY2VzIiwiY29tcGFueV9taWQiOiIvbS8wOHp2eXoiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJhMXJZMWFOazFnenR3eVo3QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFb3NDQ3N3QlFVNVZYMDV4VWxsM2VsUXdOMlJ3WVhwaVJVTmxlRTUyY0cxRFJWSjVia1JLZEVORmVWbExXbDh3WmxWNFlqVm1jV1pNWDNJM1FtTkhSVU5VUVdoUU1tdHZhVXQ1VFUweFRtbG1lWFprYkV4MFNEZDZWbVZSYjJKMmRFUTNjakY1T0c5dWRFdDJNbmxFV0hoRmJYQlJNWG96UlhSSVpubDVUVlE0WlhJMGFtZFVTV3hUUkVOQldqZzVYekJFZUdod1luaHpibmMxWVRadmEyc3hWbkl4VWtoR01sVnVlVzFHYVZsUk9YSTFlV0ZZYWtKdFIzWjNNR3M0VHpoQ1ZFdFRSemhYYlVOVU5FdGFOWEF4RWhacGJtMURXVTkxVEVVMVN6UjBVV0oxZUZwNlVVUm5HaUpCVDAxWlVuZENTbmw2VFVvNU9HWmtMVlIxUTFoWU4wSXdTR0ZUTVhwQ2FYWm4iLCJmY3YiOiIzIiwiZmNfaWQiOiJmY180NiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIiwibGluayI6Imh0dHBzOi8vc2cuZmlkYW50by5jb20vam9icy9qb2Itb3BlbmluZy9hcmNoaXRlY3RzLWV4Y2VwdC1sYW5kc2NhcGUtYW5kLW5hdmFsL2Nsb3VkLXNvbHV0aW9ucy1hcmNoaXRlY3QtZGV2b3BzLTI3NTQ2ODIxOD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "IP SOLUTION ARCHITECT", "company_name": "Lakarya LLc", "location": "Singapore", "via": "via Glints", "description": "Lakarya is hiring IP SOLUTION ARCHITECT for one of our clients\n\nRole Description\n\nThe Solution Architect is an exciting position where an engineer can experience the depth and the\n\nbreadth of technology. The candidate will be assigned to a project to design and architect the next\n\ngeneration IP/MPLS network to be the backbone and backhaul for 5G traffic. This is a fantastic\n\nopportunity to be an active contributor to one of the biggest and most complex project in Singapore.\n\nThe scope of this position is the following:\n\n Gather customer requirement\n\n Solution whiteboarding with customer or internals\n\n Liaise with pre-sales to nail down the key elements of the proposal\n\n Oversee the end to end architecture including backhaul and datacenter\n\n Be a single point for any escalation pertaining the design\n\n Leverage on OEM back end team to deliver the HLD, LLD and Acceptance test documents\n\n Review the design documents produced by OEM back-end team to ensure an adequate\n\nquality is... met\n\n Validate the solution in a lab environment whenever required\n\n Handover all the documentation to the TPM and Network Integration team\n\n Present the design document to the customer and carry out any amendments if required\n\n Liaise with PLM for any feature gap\n\n Regularly report design progress to PM and TPM\n\n Actively involved in internal and external design workshops\n\nQualifications\n\n Degree in Computer Science or Telecommunication\n\n At least 10 years of experience in network design or similar role\n\n 10 years in customer fronting role\n\n Be able to present to a different type of audience\n\n The candidate should possess hands on skills on carrier grade routers\n\n Hands on experience in multiple areas such as MPLS, LDP, RSVP-TE , BGP-LU , L3VPN , L2VPN\n\n Ideally has experience in building up complex networks spanning across DC and WAN\n\n Previous experience with WAN SDN Controller is highly desirable\n\n In depth knowledge of IP/MPLS networks\n\n Knowledge of new technology such as Segment-Routing, EVPN and PCEP\n\n Knowledge of datacenters is desirable but not mandatory\n\n He/ She should be a good communicator, proactive and capable to deliver complex concept\n\nin simple manner\n\n He/she should be a fast learner in assimilating new cutting-edge technologies\n\n Prior experience on Nokia 7750 product family is an advantage\n\n Attention to details and meticulosity are important attributes\n\n An industry certification is a good to have but not a must", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJJUCBTT0xVVElPTiBBUkNISVRFQ1QiLCJjb21wYW55X25hbWUiOiJMYWthcnlhIExMYyIsImNvbXBhbnlfbWlkIjoiL2cvMTFmeTFyNGIxcCIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IlkyamcweDNYb2NnZFNFT2hBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhVbk5OWTFkcWIwVlRNakJCWHpCSlVGcDZlRU5zU0c5UWRsTTJibWxMVUZSZlgzVXRTMGh5ZHpKZlUzQjRlWHBZVm5oSllVUnljemgzT1Y5RVNGRXdXbWx2WWpaZk5GTTNjM05xVGxZd2VuUlpObTF2VGtGUFZsVkZjSFpQWkVOS1RFYzBWRmxmUlZac1QyTlRkRkprT0ZWa1VVa3pPRm90YVU5eVQyaExibTl6U0VKdFVIWkdTMmx6T0c5cGEyVlZka3BPY2pOTlJrOVhVMFJSRWhacGJtMURXVTkxVEVVMVN6UjBVV0oxZUZwNlVVUm5HaUpCVDAxWlVuZENOWGRHTjBaV1VsRmhRWGxQWkhFeGMySkNUVVZ3UnpWbVFtdDMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY181NCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBHbGludHMiLCJsaW5rIjoiaHR0cHM6Ly9nbGludHMuY29tL29wcG9ydHVuaXRpZXMvam9icy9pcC1zb2x1dGlvbi1hcmNoaXRlY3QvZjkyODVjNjUtYzFlZC00OWM1LTk2NDQtNmVjM2FlMGU5MmMxP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Salesforce Technical Architect", "company_name": "Accenture", "location": "Singapore", "via": "via Accenture", "description": "About Accenture\n\nAccenture is a global professional services company with leading capabilities in digital, cloud and security. Combining unmatched experience and specialized skills across more than 40 industries, we offer Strategy and Consulting, Interactive, Technology and Operations services—all powered by the world’s largest network of Advanced Technology and Intelligent Operations centres. Our 506,000 people deliver on the promise of technology and human ingenuity every day, serving clients in more than 120 countries. We embrace the power of change to create value and shared success for our clients, people, shareholders, partners and communities. Visit us at www.accenture.com.\n\nClient selected Accenture to implement an integrated marketing platform to centralize and govern marketing communication across 15 markets in APAC&EMEA. We're helping our FS Client to enhance bank’s marketing capabilities with always-on, multi-step, multi-touch point journeys and hyper-personalized... communication.\n\nWe are currently looking for a Technical Architect that has deep telco experience, with good functional and technical knowledge in Salesforce and CloudSense platform. This includes developing a thorough understanding of the Client’s requirements then applying industry best practices and detailed knowledge of the solution to design an optimal solution that supports the business process and meets/exceeds functional requirements. This position builds a trusting relationship with major project stakeholders and leads them to the adoption of the best solution. Specifically, this role guides teams that will successfully deliver the project.\n\nYour Role:\n• This role will define the overarching thought leadership and Technical Architectures, that enable and release the maximum business value of Salesforce technology for our clients\n• Responsible for ensuring solutions align with the Roadmap and Blueprints for each impacted domain\n• Work with clients to shape technical architecture and define and scope projects to address specific needs\n• Evaluate trade offs with technology and feasibility and make choices that fit the constraints of the project\n• Own implementation tasks from initial planning and requirements analysis, through design, development, testing and deployment.\n• Support the development team in executing technical design and customizing the platform, including AMPScript, SSJS, SQL, data extensions, advanced triggers, interactions and automations\n• Develop technical documentation (HLD, LLD), gap analysis between current state and desired future state\n• Communicate concepts, architectures, solution approach options and evaluations through effective diagrams and written materials\n• Solutioning and effort estimation for requirements\n• Defining delivery approach, plan and staffing\n• Define master data management, data migration & data integration strategies\n• Leading and ensuring the successful delivery of Salesforce.com and other CRM implementation engagements\n• Managing resource requirements and project team members\n• Leading business and functional requirements definition and prioritization/scoping of requirements\n• Complete fit gap analysis of functional requirements against Salesforce.com features and functionality\n• Maintaining and coordinate communication with the customer throughout each project\n• Disseminating best practices on solution positioning and delivery\n• Supporting pre-sales activities inclusive of participating in sales calls and proposal development", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTYWxlc2ZvcmNlIFRlY2huaWNhbCBBcmNoaXRlY3QiLCJjb21wYW55X25hbWUiOiJBY2NlbnR1cmUiLCJjb21wYW55X21pZCI6Ii9tLzAxcnAyYyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjZsX3BqYjg1TndTdllIWVVBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhVVk40TUd4WloyaExWRkpOZVVRd2JEaFROR3hvYkVaRWVtRmtiV0paWDJSYVprdHFNRFk0YUhZMGFVWkxUMWRuVlV3NU9EQkVObVJOTkZWb1VtZFBkek5DZDFoM0xVbFhUa1Y1UmxjelJHMTFiRXBTUlY5SlprOUVRbWx1UmpCU1ZVeFNlSFp1ZUd4dWNGWnNVVU41ZWxNMlRrazNWMHQzYW5ObE9USktNa1EyVFZkc1pVTnljaTF4UldodllVMHhSak5uUjFkblJHcFZUbkJSRWhacGJtMURXVTkxVEVVMVN6UjBVV0oxZUZwNlVVUm5HaUpCVDAxWlVuZERNM0ZWYjBRek4xbEdNRkY1WDJabGJsaGFjVXBDWXpSNGJqRm4iLCJmY3YiOiIzIiwiZmNfaWQiOiJmY182MiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBBY2NlbnR1cmUiLCJsaW5rIjoiaHR0cHM6Ly93d3cuYWNjZW50dXJlLmNvbS9zZy1lbi9jYXJlZXJzL2pvYmRldGFpbHM/aWQ9MDA4OTU0MTNfZW5cdTAwMjZ1dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Partner Solutions Architect", "company_name": "Amazon", "location": "Singapore", "via": "via The Muse", "description": "DESCRIPTION\n\nAs a Partner Solutions Architect at AWS, you'll build technical relationships with partners of all sizes and operate as their trusted advisor, ensuring a great partner experience with AWS and most importantly, for our customers.\n\nYou'll manage the overall technical relationship between AWS and our partners, helping them to support our customers by making recommendations on security, cost, performance, reliability and operational efficiency to accelerate our customer's challenging, mission-critical projects. Internally, you will be the voice of the partner, sharing their needs and wants to inform the roadmap of AWS features and partner program improvements. In this role, your creativity will link technology to tangible solutions, with the opportunity to help our partners deliver on our shared goal to transform the experience of citizens interacting with all levels of Government, Education and Health.\n\nYou will participate in the creation and sharing of best practices... technical content and new reference architectures (e.g. white papers, code samples, blog posts) and evangelize and educate about AWS technology (e.g. through workshops, user groups, meetups, public speaking, online videos or conferences).\n\nIf you can educate AWS customers and partners about the art of the possible, while challenging the impossible, come build the future with us. As a public sector Solutions Architect within Amazon Web Services (AWS), you will have the opportunity to help shape and deliver on a strategy to build mind share and broad use of AWS cloud services across our partner ecosystem and within strategic accounts.\n\nBASIC QUALIFICATIONS\n\nA note on qualifications - the qualification list below reflects the typical candidate for a Solutions Architecture role at AWS, many people in these roles have a variety of backgrounds and journeys and we welcome a chance to discuss how your skills might fit in our team.\n\n• Background in any of the following: Cloud Architecture, Systems Design, Software Development, Infrastructure Architecture, Data Engineering or DevOps\n• Technical Degree (Computer Science, Maths, Engineering or equivalent) and/or relevant tech experience.\n• Fluent written and verbal communication skills in English\n• A passion for technology and for learning\n\nPREFERRED QUALIFICATIONS\n\nThe following qualifications are desired but not required:\n\n• Experience designing, building, refactoring or operating large scale and impactful IT systems - either on premises or in the cloud\n• Working knowledge of cloud native architectures\n• Knowledge of a modern programming language (Python, JavaScript, Go, .Net, Java, etc.) and/or scripting, Infrastructure as Code etc.\n• Working knowledge in a technology domain such as distributed internet-scale web or mobile applications, DevOps, Analytics, Machine Learning, high-performance databases (SQL and/or NoSQL), complex networking implementations, highly secured workloads etc.\n• Experience working in a customer-facing role or a role which involved public speaking\n• AWS certification (e.g. AWS Solutions Architect Associate or Professional) or other industry certification", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQYXJ0bmVyIFNvbHV0aW9ucyBBcmNoaXRlY3QiLCJjb21wYW55X25hbWUiOiJBbWF6b24iLCJjb21wYW55X21pZCI6Ii9tLzBtZ2tnIiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiZUpMeDNfVzMtZUhOa2tmOEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXNzQkNvd0JRVTVWWDA1eFZGVmlibGs0Ym1veVNESmFkVVYwYVV4UU56SnRVMnRoVkVGcU5qQjZXRzlqVmw4MGJIaGhWblpITVZoV2NUaEhhbEJuY25RemVERmhTMVJUUTFveGQwTmlYMW93Y1RZNVMwUnhUVVZ4Y0c1QlYydHZORlZxTWs1dWVYRjVSWGRKTW1aUWJrdGhNRE14UWxSVFUzUnBabkZPTFhkSk1USmZlRE5GUkVsMVIyUXlXVmxDWmpVU0ZtbHViVU5aVDNWTVJUVkxOSFJSWW5WNFducFJSR2NhSWtGUFRWbFNkME0xY25sR2MyWnRObnAyUlhGWU5URjNXWEpyVG0xdllrd3hUSGMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY182OSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBUaGUgTXVzZSIsImxpbmsiOiJodHRwczovL3d3dy50aGVtdXNlLmNvbS9qb2JzL2FtYXpvbi9wYXJ0bmVyLXNvbHV0aW9ucy1hcmNoaXRlY3QtMjM0ZWY2P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}], "chips": [{"type": "Title", "param": "job_family_1", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Solution architect", "value": "solution architect"}, {"text": "Solutions architect", "value": "solutions architect"}, {"text": "Architect", "value": "architect"}, {"text": "Cloud architect", "value": "cloud architect"}, {"text": "Technical architect", "value": "technical architect"}, {"text": "Enterprise architect", "value": "enterprise architect"}, {"text": "Senior", "value": "senior"}, {"text": "Consultant", "value": "consultant"}, {"text": "Financial services", "value": "financial services"}, {"text": "Infrastructure architect", "value": "infrastructure architect"}, {"text": "Manager", "value": "manager"}, {"text": "Application architect", "value": "application architect"}, {"text": "Cloud engineer", "value": "cloud engineer"}, {"text": "It architect", "value": "it architect"}, {"text": "Lead architect", "value": "lead architect"}, {"text": "Network architect", "value": "network architect"}, {"text": "Security architect", "value": "security architect"}, {"text": "Senior architect", "value": "senior architect"}, {"text": "Systems engineer", "value": "systems engineer"}, {"text": "Associate director", "value": "associate director"}, {"text": "Deputy", "value": "deputy"}, {"text": "Engineers", "value": "engineers"}, {"text": "Head", "value": "head"}, {"text": "Infrastructure", "value": "infrastructure"}, {"text": "Lab", "value": "lab"}, {"text": "Network engineer", "value": "network engineer"}, {"text": "Presales consultant", "value": "presales consultant"}, {"text": "Public sector", "value": "public sector"}, {"text": "Senior analyst", "value": "senior analyst"}, {"text": "Senior consultant", "value": "senior consultant"}, {"text": "Senior director", "value": "senior director"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Software architect", "value": "software architect"}, {"text": "Solution consultant", "value": "solution consultant"}, {"text": "System architect", "value": "system architect"}, {"text": "System engineer", "value": "system engineer"}, {"text": "Systems analyst", "value": "systems analyst"}, {"text": "Systems architect", "value": "systems architect"}, {"text": "Technical trainer", "value": "technical trainer"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Accounting", "value": "/business/naics2007/5412"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Management", "value": "/business/naics2007/55"}, {"text": "Real Estate", "value": "/business/naics2007/53"}, {"text": "Wholesale", "value": "/business/naics2007/42"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Amazon", "value": "/m/0mgkg"}, {"text": "Microsoft", "value": "/m/04sv4"}, {"text": "EPAM Systems", "value": "/m/0dlnrc"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "IBM", "value": "/m/03sc8"}, {"text": "Salesforce", "value": "/m/07btr5"}, {"text": "EY", "value": "/m/0g9jc"}, {"text": "Publicis Sapient", "value": "/m/02myjp"}, {"text": "Randstad", "value": "/m/08pt1z"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Alibaba Group Holding Limited", "value": "/m/07s6ctl"}, {"text": "Avanade", "value": "/m/094456"}, {"text": "Capgemini", "value": "/m/03vlk0"}, {"text": "Comtel Solutions Pte Ltd", "value": "/g/11dxpztgnb"}, {"text": "DELL", "value": "/m/0py9b"}, {"text": "Ericsson", "value": "/m/02kyh"}, {"text": "HTZ Resources", "value": "/g/11h21p9b4d"}, {"text": "Infinite Computer Solutions Pte Ltd", "value": "/g/11g9mj72yz"}, {"text": "Michael Page", "value": "/m/04cxldw"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "Orange Business Services", "value": "/m/08zvyz"}, {"text": "Recruitment Hub Asia Pte Ltd", "value": "/g/11dxpww_0f"}, {"text": "TEKsystems (Allegis Group Singapore Pte Ltd)", "value": "/g/11b6g4bkv0"}, {"text": "Talent Trader Group Pte Ltd", "value": "/g/11dxpmlc5b"}, {"text": "Tata Consultancy Services", "value": "/m/01psx8"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "VMware", "value": "/m/01t9k5"}, {"text": "Verizon", "value": "/m/07_dn"}, {"text": "A-Speed Infotech Pte Ltd", "value": "/g/11g9mxswl4"}, {"text": "ABeam Consulting", "value": "/g/11bc6whr_f"}, {"text": "Amazon Web Services (AWS)", "value": "/g/11dxprr2xv"}, {"text": "Amazon Web Services Singapore", "value": "/m/0rznzt1"}, {"text": "Aon", "value": "/m/0z7n"}, {"text": "Avaya", "value": "/m/01sqlk"}, {"text": "Azendian Solutions Pte Ltd", "value": "/g/11dxpvcjj2"}, {"text": "Big Cloud", "value": "/g/11c743lwsr"}]}]}