{"search_metadata": {"id": "608279513a218a4c2cead127", "status": "Success", "json_endpoint": "https://serpapi.com/searches/8af24041723841c0/608279513a218a4c2cead127.json", "created_at": "2021-04-23 07:37:53 UTC", "processed_at": "2021-04-23 07:37:53 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28consultant%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=40", "raw_html_file": "https://serpapi.com/searches/8af24041723841c0/608279513a218a4c2cead127.html", "total_time_taken": 2.47}, "search_parameters": {"q": "(consultant) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "40"}, "jobs_results": [{"title": "Quality Engineer / QC Specialist – US MNC / EAST / Contract to Perm", "company_name": "Achieve Career Consultant Pte Ltd", "location": "Singapore", "via": "via Joblum Singapore", "description": "►Basic UP TO S$4.3K + Good Bonuses!!\n►Knowledge of MDSAP and/or ISO13485 requirements\n►Working knowledge of Lean/Six Sigma principles\n►Quality control experience in a regulated environment\n►Certified Lead auditor / Quality Engineer / Reliability Engineer will be advantageousOur client is one of the Leading Manufacturers of science products and are looking for suitable candidates to join their growing business as a QC Specialist.\nRESPONSIBILITIES:\n• Lead and drive internal and/or supplier non-conformances to ensure timely disposition for closure of QNs.\n• Identify and drive continuous Product Quality improvement of internal manufacturing processes for existing products.\n• Perform monitoring and analysis on creeping issues on reported Customer Returned Instrument history and identify continuous Product Quality improvement opportunities.\n• Identify and establish in-process/ outgoing Product QC inspection criteria and provide training to QC Technicians.\n• Maintain KPIs for monitoring of... process and/or product quality, perform analysis, and interpret trends, identifying and activating on appropriate actions as necessary.\n• Maintain and ensure Products CDF are timely updated for Product Safety periodic assessment by certification house.\n• Participate and review Site Process Validation activities to ensure Quality control adequacy.\n• Generate and analyze weekly, monthly Product Quality performance reports for Management review.\nREQUIREMENTS:\n• Bachelor’s degree in Mechanical / Electrical & Electronic Engineering.\n• Min. 2 years of manufacturing quality control experience in a regulated environment.\n• Experience in Process validation activities as Quality function.\n• Experience with either ERP or SAP systems\n• Knowledge of MDSAP and/or ISO13485 requirements.\n• Lead auditor certified will be advantageous\n• Working knowledge of Lean/Six Sigma principles, belt certification will be advantageous\n• Certified Quality Engineer and/or Certified Reliability Engineer will be advantageous\nOTHER INFORMATION:\n• Location: East\n• Working days: Monday – Friday: 8am – 5pm\n• Salary: Basic UP TO S$4.3K + Good Bonuses (Salary will commensurate according to experience & qualifications).\nHOW TO APPLY:\nIf you are a team player, meticulous & organized, and more importantly, believe that YOU CAN MAKE A DIFFERENCE, we would like to hear from you.\nSimply submit your application by emailing a detailed copy of your updated Resume in MS Word Format to Brandon Lee Hong Lee (Reg. No.: R1983786)Email: brandon.lee@achievegroup.asia\nor call your friendly Consultant, at 6590 9918 or for a confidential discussion.\nPlease indicate the below information in your resume:\n• Current & Expected Salary\n• Reason(s) for leaving\n• Notice Period / Availability to commence work\nWe regret only short listed candidate will be notified. All applications will be treated with the strictest confidence.\nBy submitting any application or resume to us, you will be deemed to have read & agreed to the terms of our Privacy Policy, and consented to us collecting, using, retaining and disclosing your personal information to prospective employers for their consideration, and for our marketing EDMs which you may opt out by unsubscribing in the mailer. You may refer and access our website at www.achievegroup.asia/privacy-policy/ for more information.\n\nCessation of Collection of full NRIC Numbers:\nIn compliance with the Personal Data Protection Act and commitment to protect candidates’ personal data, Achieve Group will cease to collect, process or use full NRIC numbers during our screening and job application process.Kindly ensure your resumes provided to us does not contain your full NRIC number and full home address during your job application.\nYOUR SUCCESS IS OUR ACHIEVEMENT", "extensions": ["3 days ago", "$3K–$4.3K a month", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time", "salary": "$3K–$4.3K a month"}, "job_id": "eyJqb2JfdGl0bGUiOiJRdWFsaXR5IEVuZ2luZWVyIC8gUUMgU3BlY2lhbGlzdCDigJMgVVMgTU5DIC8gRUFTVCAvIENvbnRyYWN0IHRvIFBlcm0iLCJjb21wYW55X25hbWUiOiJBY2hpZXZlIENhcmVlciBDb25zdWx0YW50IFB0ZSBMdGQiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjMxRE0xWWhQTTA3SXM3VW9BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9ibHVtIFNpbmdhcG9yZSIsImxpbmsiOiJodHRwczovL3NnLmpvYmx1bS5jb20vam9iL3F1YWxpdHktZW5naW5lZXItcWMtc3BlY2lhbGlzdC11cy1tbmMtZWFzdC82Mjc2NjA/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Cyber Security Consultant at Honeywell", "company_name": "Honeywell", "location": "Singapore (+1 other)", "via": "via BizLINKS Resources Pte Ltd", "description": "Cyber Security Consultant at Honeywell\n\nJob Description\n\nDesign solutions to drive safe living and quality of life The Future Is What We Make It Cyber Security Consultant Purpose of the Job This position is responsible for providing on-site cyber security services associated with industrial Process Control Networks for Honeywell customers in the Oil and Gas; Hydrocarbon Processing; Power Generation; Pulp, Paper & Printing; Continuous Web Solutions; Petrochemicals; Life Sciences; and Metals, Minerals and Mining markets. Services provided include on-site consulting, troubleshooting, network designs, implementation, assessments and other related tasks as identified Responsibilities Assume leadership role in assigned projects ensuring project delivered on time and within budget and to the satisfaction of the customer Keep technically current with the HPS networking and wireless product/systems portfolio, while maintaining expert knowledge on specific designated network disciplines... Maintain cyber security certifications Maintain knowledge of current industry security standards such as IEC-62443, ISO 27000, etc. Develop sound and trusted relationships with internal and external customers by providing accurate and efficient technical/engineering support Respond to customer inquiries, questions and issues by diagnosing problems and providing the most appropriate technical solution in an accurate and timely manner Maintain industrial safety awareness through the completion of pertinent safety certifications. Principal Networks & Contact Links Internal External Supervisory Responsibilities Act like technical lead for junior co-workers during project execution Geographic Scope & Travel Requirements Requires 65“ 85% travel Key Performance Measures Project delivery milestones Billability Sales Leads Education Required Qualification: Bachelor's degree in a computer related field such as Computer Science, Computer information systems, electronics or in lieu of degree Work Experience Required A minimum of 7 years' experience in industrial automation network systems engineering 5+ years working with IT Security 3+ years Industrial Networking 3+ years' experience in Security Projects 1+ years performing audits/assessments Technical Skills & Specific Knowledge Required CISSP Certified Information Systems Security Professional or similar security certification CISCO Certified Network/Design/Security Professional (at least one) “ must currently be certified or in the process of certification Linux/Windows Security Basics Cyber Security Risk Analysis Process Control system design/implementation Excellent troubleshooting skills to resolve complex network and or application or system integration issues CWSP “ Certified Wireless Security Professional or similar experience Fault Tolerant Ethernet (Honeywell product) Experience with virtualization preferably VM Ware Microsoft Certified Systems Engineer Experience performing network services at customer sites. Experience in LAN/WAN architectures & related diagnostic tools Experience designing and optimizing complex LAN environments LAN/WAN and wireless networking principles and protocols including Ethernet, TCP/IP, VLAN, WLAN, Frame Relay, Firewall, DMZ, VPN, IDS, switches, routers, firewalls TCP/IP protocols “ SMTP, SNMP, FTP, HTTP, SSH, SSL Experience Network Security “ Firewall, ACL, IDS, IPS, SIEM Specific experience in Cisco Routers, Switches, or Firewalls Microsoft “ Active Directory, DNS, WSUS, Terminal Server Experience with anti-virus systems, backup & restore solutions, system management Behavioral Competencies Required Result oriented Confident “ ability to work with minimal supervision Open minded- Integrative thinker Influences without authority Effective communicator Customer service orientated. Language Requirements Must have written and oral communication skills at all levels of the organization. About Us The world is changing. And it's a familiar story at Honeywell. Our $36 billion business was founded on a legacy of firsts spanning 130 years. We're building a safer, smarter, and more sustainable world through our technology and software across each of our 930 sites globally. Our impact is seen in every shape and size around the world. Our solutions are felt daily in aerospace, buildings and cities, retail, chemicals and materials, safety, industrial and manufacturing, safety, and supply chains. Discover More We've been innovating for more than 100 years and now we're creating what's next. There's a lot more available for you to discover. Our solutions, our case studies, our #futureshapers, and so much more. Learn more at careers.honeywell.com/us/en/ If you believe what happens tomorrow is determined by what we do today, you'll love working at Honeywell. The future is what we make it. So join us and let's do this together. Honeywell is an Equal Opportunity Employer and we support a diverse workforce. Aboriginal and Torres Strait Islander peoples are encouraged to apply. Finalist 2019 AHRI awards “ Best workplace diversity and inclusion program Qualified applicants will be considered without regard to age, race, creed, color, national origin, ancestry, marital status, affectional or sexual orientation, gender identity or expression, disability, nationality, sex, religion, or veteran status. For more information on how we process your information in the job application process, please refer to Recruitment Privacy Notice. If a disability prevents you from applying for a job through our website, request assistance here. No other requests will be acknowledged. Copyright © 2020 Honeywell International Inc Additional Information JOB ID: HRD113056 Category: Engineering Location: 17 Changi Business Park Central 1,U01-01/09, #02-01/09, #03-01/09, #04-01/09 & #05-01/05,Singapore,SINGAPORE,486073,Singapore Exempt Engineering (GLOBAL) Show more\n\nOriginal Joblink : https://sg.linkedin.com/jobs/view/cyber-security-consultant-at-honeywell-2403730872\n\nGoogle Company: https://www.google.com/search?q=Cyber%20Security%20Consultant%20at%20Honeywell", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDeWJlciBTZWN1cml0eSBDb25zdWx0YW50IGF0IEhvbmV5d2VsbCIsImNvbXBhbnlfbmFtZSI6IkhvbmV5d2VsbCIsImNvbXBhbnlfbWlkIjoiL20vMDFneDY2IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiZkZIdmtHN3RQR3ZDNzJ6MUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFV6bDZOSFZvVTJScFZGZEpUakpsY0MxaFEzSmFTME5sV1VoU2MycHhkbU4xYUVkdFVYUlZNMnA0TVZGS2RGazNSMGhoYzJwUVNHeDBNa2syTkROc1NqUlpZMjR3YlZOamNuaEVOVGhOZEhRM05WWnBPVEp0UzAxcmMyd3dVV0UyVVZGV2MwMTBiV2hmVmtSM01YaFBXR05tVlVoalNVMDBUbU5rYjNKdFlXUk1lRUZuVEhGbllXUnNNVU5hWldnNWMzQnFNVkYzTmxjNU5taG5FaFpWTTIxRFdVbEVVMFpaY1c5MFVWaFNkbkpIYjBSQkdpSkJUMDFaVW5kRWJGZGxWWE5oYkhaZlYxUmxZUzFRUzJOdWFFTjRPRTR3UVc1MyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzExIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJpekxJTktTIFJlc291cmNlcyBQdGUgTHRkIiwibGluayI6Imh0dHBzOi8vd3d3LmJpemxpbmtzcmVzb3VyY2VzLmNvbS5zZy9pbmRleC5waHAvam9iLWxpc3RpbmdzLXB1YmxpYy85NC1zZWN1cml0eS1lbmdpbmVlcnMvNTIzMS1jeWJlci1zZWN1cml0eS1jb25zdWx0YW50LWF0LWhvbmV5d2VsbD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Lead/Senior Consultant VAPT", "company_name": "SearchElect", "location": "Singapore (+1 other)", "via": "via SearchElect", "description": "Key Words: VAPT, Vulnerability Assessment, Penetration Testing, Red Teaming, CRT, OSCP\nRole: Lead/Senior Consultant\nIndustry: Public Sector, Security, Information Technology\nFunction: Vulnerability Assessment, Penetration Testing\nLocation: Singapore\n\nAbout Our Client\n\nOur client is an influential organization working on critical projects across various industry domains. They provide opportunities to any successful candidates to learn and grow their skills and experience in a supportive and dynamic environment with aggressive growth plans and long term job security.\n\nAbout the (Lead/Senior Consultant - VAPT)\n• Our clients are considering applicants with at least 3+ years of experience in Enterprise IT and Cloud Attack Simulation.\n• With preferably OSCP / CRT certification.\n• It would be important that you would be technically hands-on and curious about the inner workings of Enterprise information technologies.\n• Who has great analytical, conceptualisation and problem-solving skills and... has good communications and interpersonal skills to relate to stakeholders' concerns.\n\nAbout You\n\nPlease note: Interested Applicants must be able to work in Singapore and are required to obtain high-security clearance (G50/CAT1).\n\nKey Responsibilities\n• Your key responsibilities would be to lead a team in the conduct of in-depth vulnerability assessment, penetration testing and red teaming of Enterprise IT systems and to provide cybersecurity assurance against sophisticated attackers through attack simulation,\n• You will be working closely with respective stakeholders to facilitate the tests, provide technical consultancy, report vulnerabilities and recommend remediation/mitigation actions and\n• Manage a team of specialists and oversee their Enterprise IT technical skills development, including your own managerial and technical competencies.\n\nIf you are interested to learn more about this opportunity or might be looking to get into this role with transferrable skills, please feel free to send me a copy of your CV to me at:\nDanica Pagsisihan\nSenior Recruitment Consultant\n+65 65898787\ndanica@searchelect.com\nSearchElect Pte. Ltd. adheres to the Singapore Ministry of Manpower Tripartite guidelines on Non-Discriminatory Job Advertisements which you can find more information about. If you feel any part of this job advertisement is discriminatory please immediately raise to our attention via webadmin@searchelect.com. We take these matters seriously and thank you for your cooperation", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJMZWFkL1NlbmlvciBDb25zdWx0YW50IFZBUFQiLCJjb21wYW55X25hbWUiOiJTZWFyY2hFbGVjdCIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiOTBBcGFKeGJ2andBTTF3TkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBTZWFyY2hFbGVjdCIsImxpbmsiOiJodHRwczovL3d3dy5zZWFyY2hlbGVjdC5jb20vam9icy9sZWFkLXNsYXNoLXNlbmlvci1jb25zdWx0YW50LXZhcHQ/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Consultant - Finance & Enterprise Performance - SG", "company_name": "Deloitte SEA", "location": "Singapore", "via": "via Jobs At Deloitte Southeast Asia - Deloitte", "description": "At Deloitte, we offer a unique and exceptional career experience to inspire and empower talents like you to make an impact that matters for our clients, people and community. Whatever your aspirations, Deloitte offers you a highly inclusive, collaborative workplace and unrivalled opportunities to realize your full potential. We are always looking for people with the relentless energy to push themselves further, and to find new avenues and unique ways to reach our shared goals.\n\nWork you will do\n\nAs part of our Finance & Enterprise Performance team, you’ll act as a trusted advisor to CFOs, COOs, CIOs, and key executives. You’ll work in the team to advise, implement and deliver as-a-service solutions, helping our clients develop strategies and capabilities to support enterprise-wide decision-making, improve finance operations, and create impact within their organization. You’ll support large scale financial transformations by leveraging cutting edge technology and be able to take your... career to the next level!\n\nYou’ll work with CFOs of Asian conglomerates, multinational companies, and in the public sector - combining our finance capability with program and change management expertise to implement and embed improvements and deliver sustainable value. You’ll:\n• Deliver large, complex client engagements that identify, design, and implement creative business and technology solutions for large companies.\n• Provide service excellence by identifying key client business issues, determining client needs by supplementing the standard assessment techniques and tools with innovative approaches, evaluating and validating analysis and developing recommendations for the client in the context of the overall engagement.\n• Implement and oversee the quality of deliverables and effectively manage the team and day-to-day relationships to ensure exceptional performance.\n• Participate in the development and presentation of proposals for business development activities.\n• Support smaller engagements or components of large, complex engagements.\n\nEnough about us, let's talk about you\n\nYou are someone with:\n• Tertiary qualification in a relevant accounting, business or finance discipline.\n• Certified Chartered Accountant is a plus.\n• At least 4 - 6 years of working experience in finance organisations or consulting, advising CFOs on Finance transformation, process improvements, financial planning redesign, service delivery model design and implementation, and other critical elements of the Finance function.\n• Expertise in Finance Service Delivery, Finance Operations, FP&A, Finance Strategy, or EPM.\n• Experience developing a vision for the Finance organization and realizing the vision through large scale transformations encompassing finance process redesign, service delivery model development, and technology implementations.\n• Experience with Finance in a Digital world technologies such as process automation through robotics, predictive analytics and visualisation etc.\n• Experience with budgetary responsibilities related to projects or resources.\n• Exceptional interpersonal, team-building, and communication skills.\n• Demonstrated ability to write clearly, succinctly, and in a manner that appeals to a wide audience.\n• Ability to build consensus and foster change in ambiguous settings", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDb25zdWx0YW50IC0gRmluYW5jZSBcdTAwMjYgRW50ZXJwcmlzZSBQZXJmb3JtYW5jZSAtIFNHIiwiY29tcGFueV9uYW1lIjoiRGVsb2l0dGUgU0VBIiwiY29tcGFueV9taWQiOiIvZy8xMWZfZzR4OWRfIiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiclAtNWlBYXJMbUItLXZxUUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFVWZ3pibXRPT1RndGF5MTBTVmhCU1ZkNVNrWllSVGMxUVZoQ1IzUTJXRmMxVVdGNldEZG9ibUZQY21GME1EUllYMUZITVhsVGQxVldMVzQxWWpCVVdtbGhjM1l0UzFaTllVYzRlRGROTkZac1NqTjRUSEp2ZERsb1gyZFJUSE0zWW5OQ1VWOUZReTFtUzB0RlgxWldXa3R6WHpCQ1RUVmxVemxXV0hkRk9XaG1Zakl6YjBSUWFETkVRamxXTUVkQ2QyMVBTMVZSWW0xdGNrdG5FaFpWTTIxRFdVbEVVMFpaY1c5MFVWaFNkbkpIYjBSQkdpSkJUMDFaVW5kRWEwODJjak0xYVVwak5sVkJaMnRVYnpSNlVUSlJWRTVRWW5GQiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzIyIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnMgQXQgRGVsb2l0dGUgU291dGhlYXN0IEFzaWEgLSBEZWxvaXR0ZSIsImxpbmsiOiJodHRwczovL2pvYnMuc2VhLmRlbG9pdHRlLmNvbS9qb2IvU2luZ2Fwb3JlLUNvbnN1bHRhbnQtRmluYW5jZS1cdTAwMjYtRW50ZXJwcmlzZS1QZXJmb3JtYW5jZS1TRy81ODA1NjY1MTAvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "vCISO, CISO-as-a-Service Senior Business Consultant", "company_name": "Horangi", "location": "Singapore", "via": "via Lever", "description": "Horangi is a leading cloud and SaaS cybersecurity firm, and we offer clients a comprehensive suite of security services, including penetration testing, cloud security and cybersecurity risk assessment.\n\nCome and see what we’re doing!\nhttps://www.horangi.com\nhttps://www.horangi.com/services/strategic\n\nThis role is made for you, if you aspire to be a CISO or a CISO-as-a-service consultant, and are looking for an opportunity to utilise your regulatory and compliance accreditations, as well as work experience in the field of GRC and IT security.\n\nWe welcome applicants from a diversity of backgrounds, including business consultancy, banking, FinTech, e-commerce, payment, mobile platforms, cloud or SaaS, with expertise in regulatory compliance and IT governance.\n\nWhat you’ll be doing:\n\n- Lead and perform various types of risk and security assessments (maturity, compliance and risks) and gap analyses, specifically for Singapore and Southeast Asia Countries;\n- Lead the delivery of GRC... security advisory or consulting projects related to industry standards and frameworks, eg: NIST, ISO27001, SOC2, Cybersecurity Agency’s CII Code of Practices, etc;\n- Engage with clients’ senior management and stakeholders, including CISO, CIO, CTO, to provide strategic level advice on cybersecurity domains and risks;\n- Provide consultancy to clients to close security gaps in a practical way;\n- Develop and establish security plans, frameworks, roadmaps, awareness programs, procedures, standards, guidelines tailored to the clients’ needs;\n- Promote Horangi and yourself as a brand in the cybersecurity industry with event participation, speaking engagements, writing blogs and articles, and other types of thought leadership in the information security and cybersecurity space;\n- Support of pre-sales activities;\n- Have an understanding of the IT security marketplace as a whole.\n\nHow To Succeed:\n\n- Possess at least 6 years of working experience related to information security practices\n- Holder of security assessor certificates (with good standing), eg: PCI QSA certification or ISO27001 Lead Auditor is preferred\n- Possess infosec certifications, such as CISA/CISM/CGEIT/CRISC/CISSP\n- Pre-sales security consulting experience is desired\n- Project management experiences is desired\n- Experience in security or enterprise architecture is preferred\n- Experience in risk assessment, technology controls review, policy review with financial services industry, or other specific industries such as FSI, Telecommunications, healthcare, is a bonus\n- Experience in handling regulatory requirements in the financial services industry, such as MAS TRM, PCI-DSS, Privacy (GDPR/PDPA etc) is a bonus\n- Demonstrate excellent skills in structured problem solving techniques, creativity and intelligence in the development of solutions to address customer problems\n- Demonstrate a successful track record in delivering consultancy projects\n- Have good presentation skills with the ability to present to audiences of both business and IT stakeholders\n- Team player\n- Demonstrate commitment to delivering projects within time and in budget and to a high level of client satisfaction\n- Vulnerability Assessment and Penetration Testing experience is a bonus\n- Good working knowledge of security policies and procedures\n- Strong interpersonal and stakeholder management skills\n- Strong understanding of the nature of information security management and solid knowledge of management concepts, familiarity with regulatory requirements from MAS\n- Exposure with cloud computing platforms (SaaS, PaaS, IaaS) and security in big data\n- Expertise in SOC, Cloud Access Security Broker, SIEM and Firewalls is a bonus\n\nJoin us at Horangi, and do the best work of your life. Welcome", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJ2Q0lTTywgQ0lTTy1hcy1hLVNlcnZpY2UgU2VuaW9yIEJ1c2luZXNzIENvbnN1bHRhbnQiLCJjb21wYW55X25hbWUiOiJIb3JhbmdpIiwiY29tcGFueV9taWQiOiIvZy8xMWZtNDF3ZGgzIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoidDF0VlNQZ2VYTVZ2blljY0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFVqbFZiMGh2TWxoTFJWOXNiMEZhU0RKbFR6bERVbU0zYVU4eVFteEdMVXRhUlhkRVoxVjRVbkJLWlZkd05HNHpUVWRNV2s4eE4xSTRVMUZLVjFaYVpEVXhRVlJmVTFWM00yNU9lR0prZDFwaFQxWmFOVXBJY0U5V05YQkhka3hLUVVSeFFrcEhUMGMwWVhKSFMyWkdWVWh3V0ZWamFuaHZjVFJEZWxOMGFrSndOaTF3ZEhwdk5tWkRURnB1ZVhoamRsZGFPVFJ4Tm5kUWREZFJFaFpWTTIxRFdVbEVVMFpaY1c5MFVWaFNkbkpIYjBSQkdpSkJUMDFaVW5kQlpIYzJiVzlCTkRSU01URndSRnBsVTFOSWJtOTNiaTFmTVZsQiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzI5IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExldmVyIiwibGluayI6Imh0dHBzOi8vam9icy5sZXZlci5jby9ob3JhbmdpL2YyZWFkNTFlLTNhMTMtNGYwNC05NTc2LWQyZDg1Njc0MWRhZT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Payroll Consultant", "company_name": "Avensys Consulting Pte Ltd", "location": "Singapore", "via": "via Jobs Guide Hub", "description": "Payroll Consultant Jobs in East at Avensys Consulting Pte Ltd\n\nTitle: Payroll Consultant\n\nCompany: Avensys Consulting Pte Ltd\n\nLocation: East\n\nType: Contract\n\nCategory:\n\nAvensys is a reputed global IT professional services company headquartered in Singapore. Our service spectrum includes enterprise solution consulting, business intelligence, business process automation and managed services. Given our decade of success we have evolved to become one of the top trusted providers in Singapore and service a client base across banking and financial services, insurance, information technology, healthcare, retail and supply chain.\n\nWe are currently looking to hire Payroll Consultant. This is an exciting opportunity to expand your skill set, achieve job satisfaction and work-life balance. More details as below.\n\nJOB TYPE\n\nContract\n\nROLES AND RESPONSBILITES\n\nWork independently in SAP HCM – Payroll and Pension modules\n\nAddressing and highlighting of issues and conduct of client... presentations/meetings.\n\nInvolve in Data migration activities.\n\nWork without detailed supervision in solutioning design, testing, cutover preparation, data migration area.\n\nREQUIREMENT\n\nDeep knowledge of Public Sector particularly typical public sector payroll and pension experience.\n\nKnowledge of integration with other HR upstream process of recruitment, resource deployment, Training and Development, Testing and Certification, Absence, Injury, Allowance and Payroll (deductions) modules\n\nAt least 3 full life cycle implementation experience with 2 as independent functional role.\n\nGood communication skills – written and spoken.\n\nStrong ownership – able to plan, monitor and take corrective action on tasks/activities with minimal supervision, out of the box thinking.\n\nWHAT’S ON OFFER\n\nYou will be remunerated with an excellent base salary and entitled to attractive company benefits. Additionally, you will get the opportunity to enjoy a fun and collaborative work environment, alongside a strong career progression.\n\nTo submit your application, please apply online or email your UPDATED CV in Microsoft Word format to felcy@aven-sys.com Your interest will be treated with strict confidentiality.\n\nCONSULTANT DETAILS\n\nConsultant Name: Felcy Esther\n\nAvensys Consulting Pte Ltd\n\nEA License 12C5759\n\nPrivacy Statement: Data collected will be used for recruitment purposes only. Personal data provided will be used strictly in accordance with the relevant data protection law and Avensys’ privacy policy", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQYXlyb2xsIENvbnN1bHRhbnQiLCJjb21wYW55X25hbWUiOiJBdmVuc3lzIENvbnN1bHRpbmcgUHRlIEx0ZCIsImNvbXBhbnlfbWlkIjoiL2cvMTFnNzAyMmdqZiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6InNWQ0NxaEFHbzZmcnZrbFVBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVvc0NDc3dCUVU1VlgwNXhVVk5hVEU0NWFrUlZZekpKZGpBemJFbGZSVGRKVldwQ1MwaDZOV3RPVkZFdGRsbDRORmc0VjNsUE5UTm9OVVZoTW5STlp6YzRiMEpDWWpGTWQySllSRzl2YVdNM2FFOU9RV2xYUWpneWFERTFXRk5LVFdSaFdHZERjazB6YjNsNk5YWnlZa1JQZGpadVdXOW9iWFpSYmpFelZUTnRlV1ZyU1ZCTVRUaEpTRXhUWlU5R2VYSk1kVGx0YlZGUGFFWTJWR05ZTFdSUWVEWkZZeTF0UnpKd1JGOHhjMjA0V0RadGFHbEVRbXh3WVdGbU0wdHRaa2d3UjJGbFpIQmtjalpFZUdSdVVXaFhFaFpWTTIxRFdVbEVVMFpaY1c5MFVWaFNkbkpIYjBSQkdpSkJUMDFaVW5kRVZXNTJMWFo1WVVKdE9YUkZjV0Z3VlVKRFVYSjBYM0pGWldGUiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzM3IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnMgR3VpZGUgSHViIiwibGluayI6Imh0dHBzOi8vam9ic2d1aWRlaHViLmNvbS9qb2IvcGF5cm9sbC1jb25zdWx0YW50Lz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Application Security Consultant", "company_name": "Sciente Inc", "location": "Singapore", "via": "via SCIENTE", "description": "Exciting opportunity for passionate cyber security practitioners, who want to use their skills and knowledge to make a difference in the world we live in.\n\nThis role will challenge you to ensure software and systems are designed and implemented to the highest security standards.\n\nYou will be required to propose and integrate security practices and processes into software development (both Agile & Waterfall) and how security testings can be integrated and automated as part of software delivery pipelines.\n\nMandatory Skill(s)\n• Degree in Computer Science, Engineering, Information Systems;\n• Has at least 2 years of work experience in the area of application security;\n• Experienced in conducting secure code review, verifying security controls are present, working as intended;\n• Experience in threat modelling - able to prepare threat profile to identify, quantify and address security risks;\n• Familiar with CI/CD and DevOps concepts and how security testing can be integrated and automated as... part of software delivery pipelines;\n• Familiar with secure Web Services, Web and mobile API architecture (such as RESL, SOAP, SSL/TSL, HTTPS);\n• Familiar with common web application vulnerabilities and technical knowledge to address and mitigate vulnerabilities;\n• Knowledge of security best practices, secure coding practice guidelines, IM8, OWASP, CoBIT framework, ISO 27001;\n• Excellent communication and presentation skill.\n\nDesirable Skill(s)\n• Certified Information Systems Auditor (CISA) , Certified Information Systems Security Professional (CISSP);\n• Knowledge of Static Application Security Testing (SAST) or Dynamic Application Security Testing (DAST) tools, e.g. Appscanner, Fortify, Veracode, Appscan, Burp suite, Qualys, Webinspect.\n\nResponsibilities\n• Responsible to propose and integrate security practices and processes into software development to ensure the delivery of applications have vulnerabilities resolved and mitigated;\n• Responsible to develop secure application development practices, standards, guidelines and solutions towards adopting technical best practices and uplifting the Application Security (AppSec) capabilities within the organization;\n• Perform Application Security assessment using a combination of threat modelling, vulnerability research, code scanning, application security testing with recommendation of proper remediation actions;\n• Work closely with DevOps Team to create tools and automation to help test and improve the security in the CI/CD pipeline;\n• Apply & ensure cyber security principles are adhere to during entire system development lifecycle;\n• Lead in threat modelling to identify and resolve security risks;\n• Identify gaps in security and improve security protocols and procedures in application development processes;\n• Disseminate application security findings, standards and approach within the team;\n• Enhance security competency in development teams (e.g. secure coding practices and processes);\n• Provide training to development team on security standards, policies, procedures and quality assurance best practices related to secure coding", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBcHBsaWNhdGlvbiBTZWN1cml0eSBDb25zdWx0YW50IiwiY29tcGFueV9uYW1lIjoiU2NpZW50ZSBJbmMiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImJiaWlBTVFmT0xkemF1VXhBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gU0NJRU5URSIsImxpbmsiOiJodHRwczovL3d3dy5zY2llbnRlLmNvbS9zY2llbnRlLWluYy90ZWNobm9sb2d5LWpvYnMvNTg5MS9hcHBsaWNhdGlvbi1zZWN1cml0eS1jb25zdWx0YW50Lz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "KPMG Singapore", "company_name": "KPMG Singapore", "location": "Singapore (+1 other)", "via": "via KPMG Singapore | KPMG | SG", "description": "At KPMG, your long-term future is every bit as important to us as it is to you. That’s why our aim is to give you experiences that will stay with you for a lifetime. Whether it’s great training and development, working across functional sectors, mobility opportunities or corporate responsibility volunteering activities – you’ll gain a wealth of experiences on which to build a rewarding career. We’re proud of our culture – it’s one that recognises hard work, encourages new ways of thinking and embraces diversity and inclusion. We have an innovative spirit which inspires what we do and how we do it – striving to be better lies at the heart of who we are.\n\nTechnology underpins many of the most influential organisations in the world and presents opportunities for businesses that want to seek out new markets and are prepared to invest in transformational change. The last ten years have seen a rapid emergence of new technology, greater connectivity for organisations and individuals, and a... 24/7 approach to global commerce. However, this has left many organisations behind the curve and struggling to achieve their business aspirations without feeling exposed to risks.\n\nWe believe that by turning traditional thinking on its head, adopting a positive approach to managing risk, will set organisations free to achieve their business aspirations.\nKPMG Cybersecurity professionals assist clients to address their concerns around Confidentiality, Integrity, Availability and Privacy of their technology, business systems, and information assets. Using a holistic view of how Technology and Business integrate, the Cyber team performs technology-risk focused assessments, technology compliance, IT/operational process reviews, and design of information risk & cyber security solutions.\n\nTo join a growing team to assist clients with managing one or more of the following areas:\n• Ethical Hacking – this discipline covers vulnerability assessment, application and network penetration testing, wireless security, mobile security, and system security testing.\n• Cybersecurity Risk & Governance – this discipline covers designing and implementing Cybersecurity frameworks; Cyber maturity assessments; organisational design for Cyber Security; Cloud security; design and rollout of cyber security processes such as Incident Management, Intrusion Detection, and Security Monitoring.\n• Technology Risk and 3rd Party Cyber Risk – this discipline covers IT-Business related consulting over how an organisation manages technology risk and governs its outsourcing. This involves review, re-design and implementation controls over the 3rd party organisation’s IT environment. Topics include system development, project management, business or IT outsourcing, business continuity management, information security, incident management, user access management.\n• Cyber Business Continuity, Disaster Recovery & Crisis Management – this discipline covers building business and technology resilience against cyber-attacks. Creating and testing Cyber Incident Response Plans around typical cyber-attack scenarios. Taking regulatory requirements around BCM and Crisis management and international standards based consulting.\n• Governance Risk and Compliance (GRC) - This discipline covers implementation of IT solutions for use cases such as Access control, Process control, Risk management, Compliance Management, Third party vendor risk management. This discipline also covers the area such as Pre/Post implementation review for large IT projects.\n\nCyber team members regularly interact with C-Suite clients, such as Chief Executive Officer (CEO), Chief Information Security Officer (CISO), Chief Information Officer (CIO), Chief Operating Officer (COO), Chief Risk Officer (CRO) and their direct reports. Hence, a client centric mind-set, understanding of IT within a Business context, and well-developed communication skills are desirable.\n\nThe role involves:\n• Perform application (web and mobile) and infrastructure vulnerability assessment and penetration tests on different platforms and technologies.\n• Conduct source code review to identify software program vulnerabilities and detect malware or malicious embedded code.\n• Conduct social engineering and email phishing attacks to simulate the theft of passwords, infiltrate systems, and download malware/ransomware.\n• Simulate real-time cyber-attacks using red team/blue team exercises.\n• Review and analyse security vulnerabilities to identify false positives.\n• Conduct server/network/middleware security configuration assessments.\n• Prepare a report on identified security vulnerabilities and possible recommendations to remediate the vulnerabilities.\n• Assist in continuously enhancing the existing penetration testing methodologies.\n• Remain up-to-date on the latest cybersecurity threats and vulnerabilities.\n\nThe ideal candidate should:\nBachelor degree in Law, Business, Economics, Information systems, Computer Science or other related field\n• Minimum 3 years of hands-on experience\n• Have some prior experience in conducting vulnerability assessments and penetration tests\n• Be comfortable with working on various platforms and operating systems (e.g. Windows, Linux, Kali)\n• Understand the OWASP testing methodology and have knowledge of penetration testing tools\n• Be able to work as part of a team, and at the same time being an independent self-starter\n• Have strong analytical, problem solving and inter-personal skills\n• Commands excellent written and oral communication skills with the ability to present ideas and results to technical and non-technical audiences\n• Preferably possess professional certifications such as OSCP/CREST and/or GIAC (GXPN, GPEN, GWAPT, etc.)\n\nOnly shortlisted candidates will be contacted by KPMG Talent Acquisition team, personal data collected will be used for recruitment purposes only.\n\nAt KPMG in Singapore we are committed to creating a diverse and inclusive workplace. We believe that diversity of thought, background and experience strengthens relationships and delivers meaningful benefits to our people, our clients and communities. As an equal opportunity employer, all qualified applicants will receive consideration for employment regardless of age, race, gender identity or expression, colour, marital status, religion, sexual orientation, disability, or other non-merit factors. We celebrate the different talents that our people bring and support every staff member in their journey to achieve personal and professional growth. One of the ways we do this is through Take Charge: Flexi-work, our flexible working framework which enables agile and innovative teams to help deliver our business goals", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJLUE1HIFNpbmdhcG9yZSIsImNvbXBhbnlfbmFtZSI6IktQTUcgU2luZ2Fwb3JlIiwiY29tcGFueV9taWQiOiIvZy8xMWR4cHNiOW5yIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoidDlFYko4cHA0bmNubWIwT0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZZQkNyY0JRVTVWWDA1eFZFbEZNRWRVWjE5NVQweFhVV3BRTldwbk9WaG1RM0ZzYlhKR05rdHdMVFJtUlVaTlRsUjJkbkEyUkdGS1ZubHNYMDlpTlVaVVUwRnZUVVJ0VVdKRlEwUjBlVEJNUjBrNGVGQmljbnBTVkROemFVRklVV3B2WDBwMUxWVTRSa3N0ZFdjeFVFSlRYMFpLYVRKSVVVTmllRlJTWTBwR1N6TjJOSHBhTjJRMmVFbFFjakl4ZG1aSk5FdHVWSGRxU0dKbFJYUTNlRWN0VVZoeGRYbDZjWGxoWVRCMFZuZzJZV1JVUTFwUmRrWmZhVW93RWhaVk0yMURXVWxFVTBaWmNXOTBVVmhTZG5KSGIwUkJHaUpCVDAxWlVuZEVNVVpzVm1SdlVrOWtaemg1UVdZNVVYQlBibEU1Y1d4TVpXUjMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY180OCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBLUE1HIFNpbmdhcG9yZSB8IEtQTUcgfCBTRyIsImxpbmsiOiJodHRwczovL2NhcmVlcnMua3BtZy5jb20uc2cvZW4vam9iLzUwNDQ4Mi9jeWJlci1zZWN1cml0eS1ldGhpY2FsLWhhY2tlci1yZWQtdGVhbS1jb25zdWx0YW50P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Senior Technical Consultant", "company_name": "Hewlett Packard Enterprise", "location": "Singapore", "via": "via Hewlett Packard Enterprise Careers - HPE", "description": "Hewlett Packard Enterprise is an industry leading technology company that enables customers to go further, faster. With the industry’s most comprehensive portfolio, spanning the cloud to the data center to workplace applications, our technology and services help customers around the world make IT more efficient, more productive and more secure.\n\nBusiness used to rely on technology, now business is technology, and customer experience is the IT experience. HPE Pointnext services are designed to help accelerate digital transformation by making Hybrid IT simple and powering the intelligent edge. By leveraging HPE’s strength in infrastructure, partner ecosystems and end-to-end lifecycle experience, solutions are optimized supporting unique business demands.\n\nWe are looking for an excellent Technical Consultant who design and implement complex solutions in Hybrid cloud technologies. He/she develop SOW with clear deliverables and manage execution with the team to ensure timely completion... with high quality of delivery and customer satisfaction. He/she possess deep understanding of hybrid cloud technologies with emphasis in VMware suite of products especially on VCF, NSX-T, PKS and Tanzu. Excellent knowledge on automation and dashboard creation.\n\nResponsibilities:\n• Responsible for verifying and implementing the detailed technical design solution to the problem as identified by the Project/Technical Manager.\n• Often responsible for providing a detailed technical design for enterprise solutions.\n• Is often the Principal Consultant who analyzes and develops enterprise technology solutions.\n• Regularly leads in the technical assessment and delivery of specific technical solutions to the customer. Provides a team structure conducive to high performance, and manages the team lifecycle stages.\n• Coordinates implementation of new installations, designs, and migrations for technology solutions in one of the following work domains: networks, applications or platforms.\n• Provides advanced technical consulting and advice to others on proposal efforts, solution design, system management, tuning and modification of solutions.\n• Provides input to the company strategy moving forward.\n• Collects and determines data from appropriate sources to assist in determining customer needs and requirements.\n• Responds to requests for technical information from customers.\n• Develops customer technology solutions using various industry products and technologies.\n• Engages in technical problem solving across multiple technologies; often needs to develop new methods to apply to the situation.\n• Owns and manages knowledge sharing within a community (e.g. team, practice, or project). Ensures team members support knowledge sharing and re-use requirements of project. Contributes significant knowledge to job family community.\n• Proactively encourages membership and contributions of others to professional community and coaches others in area of expertise. Regularly produces internally published material such as knowledge briefs, service delivery kit components and modules, etc. Presents at multi-customer technology conferences.\n• Creates and supports sales activities. Manages bids, or major input into the sales lifecycle. Manages activities and provides qualitative and quantitative information for successful sales. Produces complete proposals for smaller engagements within area of expertise. Actively grows the company portfolio with existing customers through new opportunities and change management.\n\nEducation and Experience Required:\n• Bachelor degree in Engineering, Computer Science or relevant discipine\n• Possess 8 years of professional experience with minimum 4 years of experience in VMware suite of products\n\nKnowledge and Skills:\n• Has sufficient depth and breadth of technical knowledge to design and scope multiple deliverables across a number of technologies.\n• Has demonstrated innovation and communication of new deliverables and offerings.\n• Has led team in the delivery of multiple deliverables across multiple technologies.\n• Ability to develop solutions that enhance the availability, performance, maintainability and agility of a particular customer's enterprise.\n• Has contributed to the design and application of new tools.\n• Ability to re-use existing experience to develop new solutions to take to market.\n• Possesses an understanding, at a detailed level, of architectural dependencies of technologies in use in the customer's IT environment.\n• Frequently uses product and application knowledge along with internals or architectural knowledge to develop solutions. A recognized expert in one or more technologies within own technical community and also at regional level. Holds a vendor or industry certification in at least one discipline area.\n• Ability to work in a multi- technology environment with the ability to diagnose complex technical problems to their root cause. In addition to troubleshooting skills and consulting skills, has ability to summarise prognosis and impact at practice lead level. Ability to adapt a consulting style appropriate to the situation and can identify up-sell opportunities.\n• Be able to demonstrate a broad understanding of market dynamics, an industry area, commercial issues, and technical concerns whilst maintaining depth in core focus area.\n• Ability to present within own area of expertise as part of a customer sales presentation, putting forward domain-specific information within the context of the company sales campaign. Has demonstrated ability to lead others in the gathering of requirements, designs, plans and estimates.\n• Able to produce complete proposals for smaller engagements within own area of expertise.\n• Demonstrates broad knowledge in other technical areas in order to properly manage complex integration efforts. Demonstrates application of technical expertise in successful engagements involving multiple disciplines.\n• Able to independently complete solution implementation or application design deliverables.\n\n1081547", "extensions": ["25 days ago", "Full–time"], "detected_extensions": {"posted_at": "25 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgVGVjaG5pY2FsIENvbnN1bHRhbnQiLCJjb21wYW55X25hbWUiOiJIZXdsZXR0IFBhY2thcmQgRW50ZXJwcmlzZSIsImNvbXBhbnlfbWlkIjoiL2cvMTFiODA0eDl0eSIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Ik1Od2JzRmRBX3FTenIwOFdBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVvc0NDc3dCUVU1VlgwNXhWR05sUmtwbWFVSnhVa294T1hkb1puZEJiazF6WjFoR1FsUnBWRkZWZFcxM016VlNYMlpWVmtkVWFrMWpVREZtTjFkWllWbE1lblI1VFdaU01rUk1XSEpOU2tkdU4ycGxlRWg1Y0RoT2VsVnJjM1E0U0hGRlUydFlTR2RQYjJSSmMwMVRZVXN4U1U1SFRVcFFZVkJTZW5NMlJVOTBZMWx2WWpJNVVHbDNNV3d5VldGUmRtZGpNblZXYmxkamVGcFpObmQyUkdKWlVEbEROa05IV1RGMlFWTk1Na04xWmtoR00zbzJURGxCZGpacGFtUjJSRk5CWlhZMmJHRjRjVGQ0VGxOWk5IWkxFaFpWTTIxRFdVbEVVMFpaY1c5MFVWaFNkbkpIYjBSQkdpSkJUMDFaVW5kQ2JEWjBZM3BFV0Vac1pYSlBZbWMyV0ZSeFJrd3dVMFZFUmxkQiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzU1IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEhld2xldHQgUGFja2FyZCBFbnRlcnByaXNlIENhcmVlcnMgLSBIUEUiLCJsaW5rIjoiaHR0cHM6Ly9jYXJlZXJzLmhwZS5jb20vam9iL0hld2xldHQtUGFja2FyZC1FbnRlcnByaXNlLVNpbmdhcG9yZS1TZW5pb3ItVGVjaG5pY2FsLUNvbnN1bHRhbnQtQ2VudHJhbCUyMFNpbmdhcG9yZS8xNDg3ODIzMTE/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Financial Services Internship", "company_name": "Aventus Consulting", "location": "Singapore", "via": "via GrabJobs", "description": "Financial Services internship | 1-3months\n\nThe Job\n\nThe Financial Services Internship Program is structured to provide a foundation in understanding the Financial Services industry, the financial advisory business, and our Financial consultant career track. Our interns will be given the opportunity to learn about our advisory business by gaining exposure to key aspects of the wealth management division including various investment vehicles, relationship building and client support, Limited slots available.\n\nThe intern’s responsibilities may include:\n\n• Conducting product, market, and client research\n\n• Developing business acumen and understanding of the markets\n\n• Reporting and analysis\n\n• Updating and maintaining databases\n\n• Assisting in business development\n\nSkills and preferred qualifications for the job:\n\n• An entrepreneurial mindset and motivation to succeed\n\n• Confident and an engaging presence\n\n• Concise, inspiring communication skills\n\n• A client-focus mentality\n\n• Strong... interest in becoming a Financial Consultant\n\n• Min Diploma/ “A” level certification\n\n• Possess good communication and interpersonal skills\n\n• Mid-career switches are welcome\n\nRenumeration:\n\n$500/month\n\nWorking hours/Location:\n\n• 5-day work week\n\n• 1-3 months\n\n• Newton", "extensions": ["3 days ago", "Internship"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Internship"}, "job_id": "eyJqb2JfdGl0bGUiOiJGaW5hbmNpYWwgU2VydmljZXMgSW50ZXJuc2hpcCIsImNvbXBhbnlfbmFtZSI6IkF2ZW50dXMgQ29uc3VsdGluZyIsImNvbXBhbnlfbWlkIjoiL2cvMTFkeHEwd2J4ayIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IllxYXdrY0VZUGxzMi1BVFhBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2WUJDcmNCUVU1VlgwNXhVbXBuWVc5TlYzSm9VMWRxTjNSaVVtWXlTMnRQWVZwUVVXcHJPSFUzZGs1YU4wOUdlWEozYURCRk5tTnNTSFJqT0Zka2FrcG1NbDlETTAxVlNqRklkbU4xUWxaaWJua3dRVTFQWjA4M2FrVTNlRmhZVjNONGJqTlBXR2xTVVZSV1dGSkllWGRMTjFCRk5qbHBNM2h5ZFRRemRXSk1iek5UU1hodFdEbEhWM0IwTWpKWGJYUllVVEJ4ZWsxUExYQjVNVGRxTVVSamJFMU9OMGhDV1hoSU1uWlJUSEEzYzI1UVUwRTNPVGwxTjJWakVoWlZNMjFEV1VsRVUwWlpjVzkwVVZoU2RuSkhiMFJCR2lKQlQwMVpVbmREVFY5dmFXZENWV3BOVWxCR01XWXlPRkUyZGxBeVNUSkJXWGRuIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNjMiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gR3JhYkpvYnMiLCJsaW5rIjoiaHR0cHM6Ly9ncmFiam9icy5jby9zaW5nYXBvcmUvam9iL2ludGVybnNoaXAvZmluYW5jaWFsLXNlcnZpY2VzL2ZpbmFuY2lhbC1zZXJ2aWNlcy1pbnRlcm5zaGlwLTIzNTU2MDg/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Business Operations", "value": "GC06"}, {"text": "Human Resources", "value": "GC15"}, {"text": "Accounting and Finance", "value": "GC01"}, {"text": "Sales and Retail", "value": "GC26"}, {"text": "Protective Services", "value": "GC23"}, {"text": "Science and Engineering", "value": "GC27"}, {"text": "Management", "value": "GC18"}, {"text": "Advertising and Marketing", "value": "GC03"}, {"text": "Legal", "value": "GC17"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Customer Service", "value": "GC10"}, {"text": "Social Services and Non-Profit", "value": "GC28"}, {"text": "Art, Fashion and Design", "value": "GC05"}, {"text": "Healthcare", "value": "GC14"}, {"text": "Energy and Mining", "value": "GC21"}, {"text": "Sports Fitness and Recreation", "value": "GC29"}, {"text": "Education", "value": "GC11"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "Consultant", "value": "consultant"}, {"text": "Senior consultant", "value": "senior consultant"}, {"text": "Security consultant", "value": "security consultant"}, {"text": "Recruitment consultant", "value": "recruitment consultant"}, {"text": "Lead consultant", "value": "lead consultant"}, {"text": "Associate consultant", "value": "associate consultant"}, {"text": "Principal consultant", "value": "principal consultant"}, {"text": "Financial consultant", "value": "financial consultant"}, {"text": "Functional consultant", "value": "functional consultant"}, {"text": "Presales consultant", "value": "presales consultant"}, {"text": "Technical consultant", "value": "technical consultant"}, {"text": "Application consultant", "value": "application consultant"}, {"text": "Associate", "value": "associate"}, {"text": "Devops consultant", "value": "devops consultant"}, {"text": "Pre-sales consultant", "value": "pre-sales consultant"}, {"text": "Consultants", "value": "consultants"}, {"text": "Development consultant", "value": "development consultant"}, {"text": "Engineer", "value": "engineer"}, {"text": "Hr consultant", "value": "hr consultant"}, {"text": "It consultant", "value": "it consultant"}, {"text": "Senior", "value": "senior"}, {"text": "Services consultant", "value": "services consultant"}, {"text": "Solution consultant", "value": "solution consultant"}, {"text": "Solutions consultant", "value": "solutions consultant"}, {"text": "Business", "value": "business"}, {"text": "Business consulting", "value": "business consulting"}, {"text": "Consulting", "value": "consulting"}, {"text": "Director", "value": "director"}, {"text": "Education consultant", "value": "education consultant"}, {"text": "Hcm consultant", "value": "hcm consultant"}, {"text": "Infrastructure", "value": "infrastructure"}, {"text": "Investment consultant", "value": "investment consultant"}, {"text": "Manager", "value": "manager"}, {"text": "Project manager", "value": "project manager"}, {"text": "Recruitment consultants", "value": "recruitment consultants"}, {"text": "Sap consultant", "value": "sap consultant"}, {"text": "Software engineer", "value": "software engineer"}, {"text": "Specialist", "value": "specialist"}, {"text": "Support consultant", "value": "support consultant"}, {"text": "Systems consultant", "value": "systems consultant"}, {"text": "Systems engineer", "value": "systems engineer"}, {"text": "Technology consulting", "value": "technology consulting"}, {"text": "Academy", "value": "academy"}, {"text": "Accountant", "value": "accountant"}, {"text": "Architect", "value": "architect"}, {"text": "Assistant director", "value": "assistant director"}, {"text": "Cloud consultant", "value": "cloud consultant"}, {"text": "Consultancy", "value": "consultancy"}, {"text": "Data engineer", "value": "data engineer"}, {"text": "Deputy director", "value": "deputy director"}, {"text": "Electrical engineer", "value": "electrical engineer"}, {"text": "Employee", "value": "employee"}, {"text": "Finance consultant", "value": "finance consultant"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Internship", "value": "INTERN"}, {"text": "Part-time", "value": "PARTTIME"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Accounting", "value": "/business/naics2007/5412"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Engineering Services", "value": "/business/naics2007/5413"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Real Estate", "value": "/business/naics2007/53"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Wholesale", "value": "/business/naics2007/42"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "SingTel", "value": "/m/020zfl"}, {"text": "EY", "value": "/m/0g9jc"}, {"text": "Infosys", "value": "/m/01k8x6"}, {"text": "SearchAsia Consulting Pte Ltd", "value": "/g/11fy260nhz"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "Deloitte SEA", "value": "/g/11f_g4x9d_"}, {"text": "Geco Asia", "value": "/g/11gk72_bt_"}, {"text": "OAKTREE CONSULTING", "value": "/g/11g70jfhtq"}, {"text": "Central Provident Fund Board", "value": "/m/0615qb"}, {"text": "NCS", "value": "/m/0282746"}, {"text": "Trustwave", "value": "/m/0n3xjf5"}, {"text": "Ensign InfoSecurity", "value": "/g/11g4jhymjr"}, {"text": "HCL SINGAPORE PTE. LTD.", "value": "/g/11fy25ngsv"}, {"text": "Horangi", "value": "/g/11fm41wdh3"}, {"text": "LINKBYNET", "value": "/g/11f00s44gb"}, {"text": "NTT", "value": "/m/05mybp8"}, {"text": "RECRUIT EXPRESS PTE LTD", "value": "/g/11g706hzhq"}, {"text": "Randstad", "value": "/m/08pt1z"}, {"text": "Randstad Singapore", "value": "/g/11g70b50mr"}, {"text": "UBS", "value": "/m/031rxp"}, {"text": "Xcellink Pte Ltd", "value": "/g/11c73prcqy"}, {"text": "Alight", "value": "/g/11fj9r012s"}, {"text": "Avanade", "value": "/m/094456"}, {"text": "Avensys Consulting", "value": "/g/11g7022gjf"}, {"text": "CBRE", "value": "/m/090r7m"}, {"text": "Golder", "value": "/m/02qx9bq"}, {"text": "Hitachi Solutions", "value": "/g/121lyvj9"}, {"text": "IBM", "value": "/m/03sc8"}, {"text": "Marsh & McLennan", "value": "/m/053rw"}, {"text": "Mott MacDonald", "value": "/m/043l4j"}, {"text": "NTT Ltd.", "value": "/m/01c3fq"}, {"text": "Qualtrics", "value": "/m/080nnft"}, {"text": "SAP", "value": "/m/01pf4l"}, {"text": "Techcom Solutions Pte Ltd", "value": "/g/11c73vztx3"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "Turner & Townsend", "value": "/m/0cfy6xp"}, {"text": "Thatz", "value": "/g/11dxpx4g1l"}]}]}