{"search_metadata": {"id": "60827b69edb0344a1b2e8003", "status": "Success", "json_endpoint": "https://serpapi.com/searches/c7081df08bfd7344/60827b69edb0344a1b2e8003.json", "created_at": "2021-04-23 07:46:49 UTC", "processed_at": "2021-04-23 07:46:49 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28project+manager%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=200", "raw_html_file": "https://serpapi.com/searches/c7081df08bfd7344/60827b69edb0344a1b2e8003.html", "total_time_taken": 2.6}, "search_parameters": {"q": "(project manager) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "200"}, "jobs_results": [{"title": "Manager - Service Delivery", "company_name": "Sciente Inc", "location": "Singapore", "via": "via SCIENTE", "description": "Our client is seeking a dynamic professional to implement and scale initiatives for a seamless Service Delivery Transformation and improving Customer Experience Services.\n\nMandatory Skill(s)\n• Degree in Information Technology, Computer Engineering, Computer Science or Information System;\n• At least 4 years of in Project Management experience in Digital Consultation / Transformation projects;\n• Strong experience in process improvement and projects for Digitization and Tranformation initiatives;\n• Exposure in Customer Experience (CX), Customer Journey and Managing Customer Research Projects in the service industry;\n• Knowledge of Agile based project management approach;\n• Strong written and verbal communication skills and should be good at presenting/ facilitating;\n• Should be a good team player and ability to work with various project stakeholders.\n\nDesirable Skill(s)\n• PMP Certification;\n• Change Management Experience.\n\nResponsibilities\n• Work with teams for developing and... understanding of customers pain points and proposing solutions to deliver a more seamless and integrated experience;\n• Work alongside user interface and user experience experts to improve customer-facing digital services/applications;\n• Involved in end to end customer experience efforts - Customer research, strategy, vision, design, development, testing;\n• Responsible for re-looking at the back-end processes and coming up with solutions which allows the customers to easily interact;\n• Identify customer pain-points and put together a strategy to prevent and recover the bad experience;\n• Manage and coordinate workflows with project managers and schedules, requirements, goals and assignments as required;\n• Work closely with different teams to understand customers requirements better and providing appropriate solutions accordingly", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJNYW5hZ2VyIC0gU2VydmljZSBEZWxpdmVyeSIsImNvbXBhbnlfbmFtZSI6IlNjaWVudGUgSW5jIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiI4SDFmTHZDZGhlQnNGeFdWQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFNDSUVOVEUiLCJsaW5rIjoiaHR0cHM6Ly93d3cuc2NpZW50ZS5jb20vc2NpZW50ZS1pbmMvdGVjaG5vbG9neS1qb2JzLzYwMzYvbWFuYWdlci0tLXNlcnZpY2UtZGVsaXZlcnkvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Project Manager", "company_name": "CAI", "location": "Singapore", "via": "via Glassdoor", "description": "Project Manager\n\nCAI is a rapidly expanding professional services organization and a globally recognized leader in risk based qualification, headquartered in the United States with overseas offices in Singapore, Malaysia, China, South Korea, Australia, Ireland and Puerto Rico. We work in the pharmaceutical, biotechnology, medical device, nutritional and building commissioning industries to provide industry best practices to our clients. Check us out at www.cagents.com.\n\nThe Project Manager at CAI is integral to the services we provide, from overall project construction management to specific management of the commissioning and qualification activities for a major project. This person is responsible for managing scope, cost, schedule, quality, risk and setting priorities of projects at the client site. The Project Manager is critical in the company’s continued success and growth by providing the services to our clients that are key to our business.\n\nResponsibilities include: -\n·... Developing proposals including manpower forecasts, deliverables, cost estimates, schedules, resourcing and monthly progress reports\n· Manage planning and scheduling of project deliverables, developing work breakdown structure and the development of resource loaded schedules\n· Assigning and controlling project budgets and perform earned value calculations\n· Developing forecast to complete analysis\n· Review subcontractor progress payment request from a percentage completion\n· Construction installation quality control and preparation and close out of punch list items\n· Develop and maintain the overall construction programs and critical path analysis including optimum sequencing philosophy\n· Perform constructability reviews and interactive planning workshops\n· Implementation of site safety induction programmes, organizing all safety related activities\n· Leading / Participating in risk assessments and Process FMEA (failure mode effect analysis) and developing job-hazard assessments\n· Effectively maintaining and developing healthy client relationships\n· Participating in corporate and project presentations\n\nThe successful Project Manager must have:\n· Bachelor degree in Life Science, Mechanical or Chemical Engineering or related discipline\n· PMP certification is preferred (from PMI)\n· Minimum 15 years of project management experience in the pharmaceutical, medical device or biotech industry with experience in design, procurement, construction and risk based commissioning & qualification\n· Experience managing medium to large-sized projects from US 1-10 million for services and US 10-100 million for EPC projects\n· Previous experience in managing construction activities\n· Experience in MEP systems is preferred\n· Knowledge and experience in ASTME2500 and/or risk-based qualification\n· Proficiency in MS Office applications and strong expertise with Microsoft Project\n· Excellent project and people management skills\n· Willing to travel up to 50% of the time\n\nIn return for your skills and knowledge, CAI offers a wide range of benefits including :\n· Medical, dental,disability, company paid life insurance and more\n· Paid time off\n· Continuing education (internal and external", "extensions": ["4 days ago", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJDQUkiLCJjb21wYW55X21pZCI6Ii9nLzExZjAxa2IybHYiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJabXhoREtweVBES3FCVmdKQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFc3NCQ293QlFVNVZYMDV4VTAxMVozbHJhV2hGTUZoaFoyOUpTa3RWYTBWU1N6VkJXVmw2VUhKTE5YTkxXWFl0VVZNd1pYQnZUbGQwVkdsWlgxaHRXbmxFUzNCdU5XZEhlRmxDTjJ0M1RrRlhWbU5UTkVSSFJXWk5hWGMzWWxCdlNVeDJaRXAwWmpkVU5VUlNZbmc1Ym01TVdtdHdVa1p6WVU5T2FEa3lZMVJMYjNWc1VHMVNTVGxmTUVkeFFqSlpUVlVTRm1GdWRVTlpTWEphU1hCSVlYTlJWMWQxY21GWlEwRWFJa0ZQVFZsU2QwUktYM2xYYVZOT1JraGFPVGxHU0hCT1IwWnJUR1pXWHpaRWJGRSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzExIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEdsYXNzZG9vciIsImxpbmsiOiJodHRwczovL3d3dy5nbGFzc2Rvb3Iuc2cvam9iLWxpc3RpbmcvcHJvamVjdC1tYW5hZ2VyLWNhaS1KVl9JQzMyMzU5MjFfS08wLDE1X0tFMTYsMTkuaHRtP2psPTM3NjAzNTY0MThcdTAwMjZ1dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Project Manager (BB-D1526)", "company_name": "TOSHIBA TEC SINGAPORE PTE. LTD.", "location": "Singapore (+1 other)", "via": "via BeBee", "description": "Roles & ResponsibilitiesJob Description: •Manage Quality, Cost, Delivery of assigned Product type •Manage Quality, Cost, Delivery issue with assigned customers •Managing ODM customer account in new printer development to meet project deliverable timeline, resolving development defects and plan for supply chain fulfilment before product is launching •Managing resource allocation, budget allocation with timely reporting to Japan management and action plan to avert risk. •In-dept understanding of all engineering change job flows from customer request to mass production implementation •Managing customer RFQ by formulate project proposal includes project schedule, product cost and NRE investment •Reports on project progress and other project specific information to stakeholders. •Lead new product quotation package deliverables (Selling Price, Specifications, Schedule etc) •Engage new/exist customer to expand business with proposals Requirements: •Bachelor of Engineering or Diploma with 10... years’ experience •More than 5 years in managing development projects from concept till trial manufacturing or NPI •More than 5 years as design team lead (Mechanical, Electrical, Firmware/Software) •Have proven track record in working Cross Function Team (Engineering team and Operation Team) •PMP certification or equivalent project leading experience Interested applicants, please send in your resume stating your date of availability, current and expected salary. We regret that only shortlisted candidates will be notified.Tell employers what skills you haveBusiness AnalysisChange ManagementDevelopmentLeadershipManagementProgram ManagementProject ManagementProject PlanningResource AllocationStrategyPlancustomer AccountlaunchingCost of Quality", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIgKEJCLUQxNTI2KSIsImNvbXBhbnlfbmFtZSI6IlRPU0hJQkEgVEVDIFNJTkdBUE9SRSBQVEUuIExURC4iLCJjb21wYW55X21pZCI6Ii9nLzExZzluOXE1NDciLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJPeWM5RG5WQ29uOFdwdXFmQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFcUVDQ3VJQlFVNVZYMDV4VWsxVFkyMW9TVUl5Ym05YWN6aHNkVmxJV1VwV1dIRktTVzVmUjFKUExYWjBVVk0zY0ZsS00xWlVSemt6Y1d0alJUYzFlamM1ZDJsdFRtNVVSVXBMTFcxbVdFTnVablJETVVoUlZFUk5SMnN6YUV4ak1USjNObmd6VUZKcmVsTlZOV293Y21sM1puVlZNMkUxYUhsSmNIcHNlRTl3Y2xkc1pXbzRURFp0VldWbkxXMVZaVVZRWWpaWVNGZzJUR3BwV25sSmRsZzNURmd3WlhCMGVWTndlVlpMY0RkVE5IcDFiV2g0U1hCMlFVOXhNMVpmZW5aUE1YSkxRbXRhUWxVeE9IRmFOelp2ZDI5aE1rcDJkWE5YZVhvMVdHVnFVRFZqYkc0MGR4SVdZVzUxUTFsSmNscEpjRWhoYzFGWFYzVnlZVmxEUVJvaVFVOU5XVkozUTFFMU1WTnVUVXBWUWpkTFZtRnFkbGR1TFZWdFVIUlZZMEU0ZHciLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18xOCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCZUJlZSIsImxpbmsiOiJodHRwczovL3NnLmJlYmVlLmNvbS9qb2IvMjAyMTA0MjAtYTkwZjFhNGI5M2NjODIxZTk5NjcyNjQ2OTc1ZDE1MjY/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Project Manager", "company_name": "Humanica Ltda.", "location": "Singapore", "via": "via LinkedIn", "description": "Qualifications\n\nMinimum Degree Required: Bachelor’s degree, preferably in Computer Science or Information Technology. PMP certification is a plus.\n\nRequired Skills\n\nAnd Experience\n\nYou will be a key member of our solution delivery team, playing an important role in helping businesses implement technology solutions. You are responsible for coordinating internal resources and client for seamless execution of projects, ensure that projects are delivered on-time, within scope and within budget. Most importantly, you will be developing project scope and objectives, involving all stakeholders and ensuring operational and technical feasibility.\n\nYou will be trained on the functionalities of our award winning solution and is expected to take a hand-on approach, partnering our application consultants, in gathering requirements, performing user testing and conducting train-the-trainers session.\n\nYou need to have a passion in client service and set your sight in delivering a solution that... constantly exceed the clients’ expectation. You should enjoy continual learning and is often excited over new technologies.\n• Proven working experience as a project manager in the information technology section\n• Solid hand-on experience in software development and web technologies a plus.\n• Experience in implementing HCM applications a plus.\n• Ability to speak and write in fluent English\n• Excellent communication skills, written and verbal and ability to liaise effectively with various stakeholders.\n• Team attitude and ability to work with a variety of skillsets and autonomously.\n• Detail-oriented, organized with solid time-management experience and able to work under time pressure.\n• Opportunities to work overseas for short term assignment.\n• Candidate without relevant experience but with keen interest in HCM fields are welcome to apply as Assistant Project Manager", "extensions": ["14 days ago", "Full–time"], "detected_extensions": {"posted_at": "14 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJIdW1hbmljYSBMdGRhLiIsImNvbXBhbnlfbWlkIjoiL2cvMTFnN3lfOF95diIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImJnM1RWWDZKVXcwQ3JGREpBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2WUJDcmNCUVU1VlgwNXhWSEpHZUZSbFFXY3dNa3R6TkRSaWFVbDRaSEUzVVc5cmVEUmphVlZJYUdsdlFqUXdkMnRwVm5wM2RGaHdUVGR3ZDNCV09WcFNiRVZEWmxVNVpsRjZPVXBDVHpObFJtZHJRMjVNTkZOUWFUZDNPWFkxTlMxaWJUbGZPRlZqYWtoR1ZGbHFiMWN5V1ZJNFgyOW1kekZxVm1RdFJsVk5kWGxWWXpaSGFUZDJSRmxYWVU5RFQxQkNTMnhOVHpCV09VOVlTbVIxV0ZoRGJ5MTVRVFowYTFObFdtUjVNVjlQUm1kWmNFNXdVbkpUUkRRMEVoWmhiblZEV1VseVdrbHdTR0Z6VVZkWGRYSmhXVU5CR2lKQlQwMVpVbmRCTTFJelZFY3dkWGxZWDNZM2JUSTFiR2t5U3psd1RGRkNXbUYzIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMjUiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGlua2VkSW4iLCJsaW5rIjoiaHR0cHM6Ly9zZy5saW5rZWRpbi5jb20vam9icy92aWV3L3Byb2plY3QtbWFuYWdlci1hdC1odW1hbmljYS1sdGRhLTI0OTY3ODg2NTQ/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Junior IT Project Manager - up to 6K - banking domain", "company_name": "Optimum Solutions (singapore) Pte Ltd", "location": "Singapore (+1 other)", "via": "via Monster", "description": "Long Term Contract\n\n· Work closely with various project manager/scrum master on coordinating activities across all resources necessary to deliver the Project; within budget and time constraints\n\n· Managing the Project Management Standards (PMS Assurance framework for the Project, complying with the Project Governance Policy and the Project Management Standards, and ensuring staff working on the Project are aware and complying.\n\n· 5+ years of Project management exposure/ PMO experience\n\n· Prior experience working with HR stakeholder / external vendor would be preferred\n\n· Able to understand business requirements and translate into actions/documentations\n\n· Effective interpersonal, communication skills to articulate at different levels of organization hierarchy\n\n· Strong relationship management experience with influencing and negotiation skills.\n\n· Creative mind – be able to suggest ideas and drive innovation\n\n· Able to understand the big picture and the details\n\n· Able to priorities... tasks based on urgency and importance\n\n· Good communication skills – oral and written.\n\n· Strong organizational, time management and administration skills\n\n· Strong analytical, numerical and problem-solving skills\n\n· Strong financial management and commercial acumen\n\n· Strong implementation experience to provide overall integration design recommendation working with client existing technical infrastructure\n\n· Work with vendor team and relevant to ensure right information is provided to various parties to obtain required approvals with solution build\n\n· Work with vendor to ensure end to end Integration solution is discussed and aligned during Design and Build\n\n· Liaise with Design/integration Team to align integration design build\n\n· Liaise with various stream of project team such as Testing to provide inputs for Assembly test, SIT, UAT etc\n\n· Manage and resolve any Integration related risk/issues\n\nInterested applicants please send your profile to [Confidential Information", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJKdW5pb3IgSVQgUHJvamVjdCBNYW5hZ2VyIC0gdXAgdG8gNksgLSBiYW5raW5nIGRvbWFpbiIsImNvbXBhbnlfbmFtZSI6Ik9wdGltdW0gU29sdXRpb25zIChzaW5nYXBvcmUpIFB0ZSBMdGQiLCJjb21wYW55X21pZCI6Ii9nLzExZzcwaGtyYngiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJpTk12WWw4UGp6emZVMkZvQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFcUVDQ3VJQlFVNVZYMDV4VVdKa04zRnhObUZ5T0dwdlgwNDFTSFJsYjFkeE5IRkpXbHB1VjFJMFdGZDZXRXB4U0VaYVpuaFRiRVY2ZERCeFVuWjNiVGN6UW5sSE4yTjNXSGhLVFVkcmJrSXlRelZmVVZoemFURkZNRGd6TWtGQ1dGcFhNV2g2Y25Ka2NVeHNkM2M1YlU1blMxQXROa1ZpU1VwS1dEZHJhVmQyVVdwT1R6WkxiVWhDYkhOa1MyUnRUR1UwUTNob1kyaEpkVXMwU1hsNFVHa3dUVGRCVjJKUFJ6bFRjbUY1ZDNKWFNXUlpiblpEZEVKRFJqaGZlVGt3Wkc1WlZ5MWhiRUpxWmtsUVRVMHdXamxWUjNCUk0zQjJaWFpWVTA5dlNWSXdMV05MVTNKdlp4SVdZVzUxUTFsSmNscEpjRWhoYzFGWFYzVnlZVmxEUVJvaVFVOU5XVkozUVVWVGRtbDVZMkpTWVhWRGVUaHBNVzVsVUVSVWEyMUpiV1psWnciLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18zMiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNb25zdGVyIiwibGluayI6Imh0dHBzOi8vd3d3Lm1vbnN0ZXIuY29tLnNnL2FtcC9qb2ItdmFjYW5jeS1qdW5pb3ItaXQtcHJvamVjdC1tYW5hZ2VyLXVwLXRvLTZrLWJhbmtpbmctZG9tYWluLW9wdGltdW0tc29sdXRpb25zLXNpbmdhcG9yZS1wdGUtbHRkLXNpbmdhcG9yZS0yNzgwMTc2NS5odG1sP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "IT Infrastructure Lead/Operation Manager", "company_name": "Quinnox Solutions", "location": "Singapore (+1 other)", "via": "via Jobs", "description": "The Responsibilities:• Lead a team of Infra Engineers to perform 24x7 managed service for entire IT Infrastructure.• Oversees and directs the day-to-day activities of an organization’s information technology (IT) department, ensuring that systems, services, and infrastructure work reliably and securely.• Monitor and Incident Manage the performance of business-critical systems to prevent delays and outages and quickly resolve ongoing issues.• Ability to engage middle to top management.• Set guidelines, policies and procedures and drive the execution.• Able to manage multiple deadlines - self-starter, able to prioritize appropriately.• Proficient in leading integrated process teams, as well as coordinating and communicating customer requirements.• Be proactive in highlight potential issues or service improvement.• Provide supporting documentation, reports, and other information to management.• Expected to work during off-peak hours on system activities.• Be a mentor to juniors.The... Requirements:• Bachelor degree in Computer Information Systems or related field.• High level understanding of various complementing technologies including System, Network, Security, Databases, Monitoring, Patch management, High Availability, Business Continuity and Automation• Level 3/4 skillset in three or more categories listed below.o CCNA or CCNP Certificationo CCIE Certificationo MCSA/RHCE/AIX V1/OCP/VCP Certificationo MCSE Certificationo PMP or ITSM Certificationo Other Professional Certification (Cloud/Virtualisation/System/Network/Network Security)• At least 5 to 7 years of relevant working experiences.• ITIL Foundation V4 certified. • Relevant professional certifications in supported system preferred.• Process excellent customer service skills.• Positive, resourceful, creative and detail-oriented. • Passionate toward new and existing technologies.• Be effective in interpersonal communication and problem solving.• Sharp technical, analytical, and holistic problem-solving abilities.• Independent, accountable and take ownership.To Apply:Please send your latest CV in word file to sales@quinnox-solutions.comKindly indicate your availability, current and expected remuneration package.We regret that only shortlisted candidates will be notified. For more job opportunities, please visit our career page: http://quinnox-solutions.com/careers/Quinnox Solutions Pte Ltd (License Number: 06C3126)Registered EA Personnel (Reg. No.:R1111100", "extensions": ["5 days ago", "Full–time"], "detected_extensions": {"posted_at": "5 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJJVCBJbmZyYXN0cnVjdHVyZSBMZWFkL09wZXJhdGlvbiBNYW5hZ2VyIiwiY29tcGFueV9uYW1lIjoiUXVpbm5veCBTb2x1dGlvbnMiLCJjb21wYW55X21pZCI6Ii9nLzExZzcwZHRkZ2ciLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJwVEdnYVlzdmxiNXZkd0tZQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdllCQ3JjQlFVNVZYMDV4VkRCalkyWjZTMkpaZWt0TU4zaEJPWFl5TVdJNWFsQkxkV05OTmtWVE56Um9ZVFExVGxoaFJYa3laRzFoWmtod1RqaExNbWRTYTJ3dFgxUm1PRzVXU25KVFp6VllSVFJUYzNaemVsbElibDlGV2pjME9EaHFabGhrWnkxUlp6bFVPWG8yVms5aE0ybDRObXhFYTFaT1NrVXRSVEZMZFd4WmVqQXRRM3BpUkU1NGRuQlFWR3RVY1hGUmRXdGxVRkpuWVVaM1VrOTROR1JvU1dzNFNtSkpPR3R0WTJsRVVERmtORk51UkZsRmVrYzBFaFpoYm5WRFdVbHlXa2x3U0dGelVWZFhkWEpoV1VOQkdpSkJUMDFaVW5kQk1qSndSSHAyV1ZKcFUya3pYMU42TUhFdGJVVk1lRXBtZUVkMyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzM4IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnMiLCJsaW5rIjoiaHR0cHM6Ly9zZy5maWRhbnRvLmNvbS9qb2JzL2pvYi1vcGVuaW5nL2luZm9ybWF0aW9uLXRlY2hub2xvZ3ktcHJvamVjdC1tYW5hZ2Vycy9pdC1pbmZyYXN0cnVjdHVyZS1sZWFkb3BlcmF0aW9uLW1hbmFnZXItMjc2MDM0ODY4P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "IT Project Manager", "company_name": "Geco Asia", "location": "Singapore (+1 other)", "via": "via Geco Asia", "description": "We are looking for a IT Project Manager, who is/are able to fulfill the following requirements:\n\nDuration: 8 Months\n\nRequirements:\n- Must have 8 years of IT Project management experience.\n- Experience of transitioning complex IT projects (change) into service operations (Run) in a complex multi system, multi-site environment.\n- Experience in IT Process Engineering and/or Functional Analysis\n- Ability to interact successfully on different hierarchical levels within the customers and providers organizations\n- Ability to analyze and simplify complex problems and to be able to communicate this to others\n- Proven analysis experience to transform requirements into tasks\n- Customer orientation, good communication skills and ability to deal with demanding stakeholders\n- ITIL certification a plus\n- PM certification a plus\n- Coding experience a plus\n\nMandatory Skills:\n- Experience of transitioning complex IT projects (change) into service operations\n- Experience in IT Process Engineering and/or... Functional Analysis\n- Ability to analyze and simplify complex problems and to be able to communicate this to other\n- Proven analysis experience to transform requirements into tasks\n\nDesired Skills:\n- ITIL certification a plus\n- PM certification a plus\n- Coding experience a plus\n\nDomain:\n- Financial\n\nPlease send your application to applicants@geco.asia with (JOB_002236) in Subject line and highlighting:\n- Your relevant experience\n- Current/expected salary\n- Availability information\n- A latest MS-WORD Resume", "extensions": ["Over 1 month ago", "Contractor"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Contractor"}, "job_id": "eyJqb2JfdGl0bGUiOiJJVCBQcm9qZWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJHZWNvIEFzaWEiLCJjb21wYW55X21pZCI6Ii9nLzExZ2s3Ml9idF8iLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiIzczJ3X0FaUTNhTk1SR2dEQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VVhwdmRXd3piRkpHY0dJelZ6bHFaVzR0UTNoUFNsZE1lRWhTU2pObE5ISXRYeTFEY3pKS1EydEpiVlZuUzFCelJXeHFTbWxYY1daVk1FUlBMV3hNYzNCR2R6SlJNVUpmVDNVeVRUZzVjbE5zY0dGRWRHVTJTM0ZCTXpoMlUwNWhlRVpVTWs1S2IydFVTbUZXUkRKS1Z6bEVNbnBGTVZrd1NHNXhaa1Z0T0dsdllrRXRSMTlpZVRObk1WWTJZM0pQTUZaUGIwbFhRbmgyTjBGUkVoWmhiblZEV1VseVdrbHdTR0Z6VVZkWGRYSmhXVU5CR2lKQlQwMVpVbmRETlhGclNUUmpMVGxrU0RGaFpIUlhWMGhuTVROMlNqaG5hRjlSIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNDUiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gR2VjbyBBc2lhIiwibGluayI6Imh0dHBzOi8vd3d3LmdlY28uYXNpYS9qb2IvaXQtcHJvamVjdC1tYW5hZ2VyLTEvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Project Manager", "company_name": "MONSTAR LAB PTE. LTD.", "location": "Singapore", "via": "via MNC Jobs Singapore | MNC Jobs In Singapore", "description": "Monstar Lab is one of the top digital product development company with 26 offices in 15 countries and most importantly with a team of 1200+ beautiful souls.\n\nWe build innovative digital products that includes mobile apps, web apps, AR/ VR products for our clients such as UOB, NTUC Income, Gardens by the Bay, Shake Shack, Resort World Sentosa and many stealth startups that we can’t talk about publicly.\n\nOur Singapore office is looking for experienced dynamic & energetic Project Managers who are expert facilitators who exercise good judgment, balancing the needs of business, engineering, and user experience. PM’s are expected to be the primary point of contact for important client projects and to facilitate the Monstar Lab software development process. They also help train client Product Owners to prioritize product backlog and smoothly transition product and process management. They work meticulously to prioritize, plan, and deliver industry-leading software with a strong focus on... efficacy and usability.\n\nCandidate requirements\n• 4+ years of strong project management experience preferably in Agile methodologies\n• Strong experience in lean/agile startup methodologies (SCRUM, Kanban), ability to spearhead an iterative approach, prioritize, plan and execute sprints\n• Experienced in at least 2 full project development life cycles, with at least one using agile methodology\n• Work with Product owners, cross-functional teams and end users for project briefs.\n• Analyze, clarify and finalize the specific requirements (user stories) of each project\n• Able to turn user needs & requirements into well-defined, detailed product features & prioritizing the Product backlog\n• Experienced in closely collaborating with engineers and designers as part of small and medium co-located teams\n• Ability to quickly understand a specific client domain and identify the trends and opportunities in that space\n• Ability to facilitate collaborative decision-making in a workshop context\n• Excellent verbal and written communication skills and ability to adapt your communication style for the audience\n\nDesired Skills / Experiences\n• PMP or Agile certification preferred\n• Experience as a designer or engineer a plus\n• Experience leading or supporting user research, customer experience\n• Consulting experience on Digital products\n• Strong analytical, conceptualization and problem solving skills\n• Experience working in Singapore in a similar role a plus\n\nWhat we provide:\n\nOpportunity to build and grow a product from scratch\nGreat benefits and a balanced lifestyle\nTech company culture\n\nminimumYearsExperience : 4\n\n[CANDIDATES WHO REQUIRE WORK PASSES NEED NOT APPLY", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJNT05TVEFSIExBQiBQVEUuIExURC4iLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IlVuck0wYk1vX2xMRjEtWG1BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTU5DIEpvYnMgU2luZ2Fwb3JlIHwgTU5DIEpvYnMgSW4gU2luZ2Fwb3JlIiwibGluayI6Imh0dHBzOi8vc2cubW5jam9iei5jb20vam9icy9wcm9qZWN0LW1hbmFnZXItcGF5YS1sZWJhci0xOTI1Mzc/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Project Manager", "company_name": "PrimeRPO", "location": "Singapore", "via": "via Glassdoor", "description": "We are looking for an experienced Project Manager to manage organization of key client projects. As our project manager, your job will be to coordinate people and processes to ensure that our projects are delivered on time and produce the desired results. You will be the go-to person for everything involving a project's organization and timeline. Project Manager Duties Specific project manager responsibilities include developing detailed project plans, ensuring resource availability and allocation and delivering every project on time within budget and scope. Project Manager Requirements Project managers should have a background in business skills, management, budgeting and analysis. You should be an excellent communicator and comfortable managing multiple tasks. you also need to be a team player and have a problem-solving aptitude. Hospitality Interior Design experience a must!\n\nResponsibilities\n• Coordinate internal resources and third parties/vendors for the flawless execution of... projects Ensure that all projects are delivered on-time, within scope and within budget Developing project scopes and objectives, involving all relevant stakeholders and ensuring technical feasibility Ensure resource availability and allocation Develop a detailed project plan to track progress Use appropriate verification techniques to manage changes in project scope, schedule and costs Measure project performance using appropriate systems, tools and techniques Report and escalate to management as needed Manage the relationship with the client and all stakeholders Perform risk management to minimize project risks Establish and maintain relationships with third parties/vendors Create and maintain comprehensive project documentation\n• Ensure that all projects are delivered on-time, within scope and within budget Developing project scopes and objectives, involving all relevant stakeholders and ensuring technical feasibility Ensure resource availability and allocation Develop a detailed project plan to track progress Use appropriate verification techniques to manage changes in project scope, schedule and costs Measure project performance using appropriate systems, tools and techniques Report and escalate to management as needed Manage the relationship with the client and all stakeholders Perform risk management to minimize project risks Establish and maintain relationships with third parties/vendors Create and maintain comprehensive project documentation\n• Developing project scopes and objectives, involving all relevant stakeholders and ensuring technical feasibility Ensure resource availability and allocation Develop a detailed project plan to track progress Use appropriate verification techniques to manage changes in project scope, schedule and costs Measure project performance using appropriate systems, tools and techniques Report and escalate to management as needed Manage the relationship with the client and all stakeholders Perform risk management to minimize project risks Establish and maintain relationships with third parties/vendors Create and maintain comprehensive project documentation\n• Ensure resource availability and allocation Develop a detailed project plan to track progress Use appropriate verification techniques to manage changes in project scope, schedule and costs Measure project performance using appropriate systems, tools and techniques Report and escalate to management as needed Manage the relationship with the client and all stakeholders Perform risk management to minimize project risks Establish and maintain relationships with third parties/vendors Create and maintain comprehensive project documentation\n• Develop a detailed project plan to track progress Use appropriate verification techniques to manage changes in project scope, schedule and costs Measure project performance using appropriate systems, tools and techniques Report and escalate to management as needed Manage the relationship with the client and all stakeholders Perform risk management to minimize project risks Establish and maintain relationships with third parties/vendors Create and maintain comprehensive project documentation\n• Use appropriate verification techniques to manage changes in project scope, schedule and costs Measure project performance using appropriate systems, tools and techniques Report and escalate to management as needed Manage the relationship with the client and all stakeholders Perform risk management to minimize project risks Establish and maintain relationships with third parties/vendors Create and maintain comprehensive project documentation\n• Measure project performance using appropriate systems, tools and techniques Report and escalate to management as needed Manage the relationship with the client and all stakeholders Perform risk management to minimize project risks Establish and maintain relationships with third parties/vendors Create and maintain comprehensive project documentation\n• Report and escalate to management as needed Manage the relationship with the client and all stakeholders Perform risk management to minimize project risks Establish and maintain relationships with third parties/vendors Create and maintain comprehensive project documentation\n• Manage the relationship with the client and all stakeholders Perform risk management to minimize project risks Establish and maintain relationships with third parties/vendors Create and maintain comprehensive project documentation\n• Perform risk management to minimize project risks Establish and maintain relationships with third parties/vendors Create and maintain comprehensive project documentation\n• Establish and maintain relationships with third parties/vendors Create and maintain comprehensive project documentation\n• Create and maintain comprehensive project documentation\n\nRequirements\n• Great educational background, preferably in the fields of computer science or engineering for technical project managers Proven working experience as a project administrator in the information technology sector Solid technical background, with understanding or hands-on experience in software development and web technologies Excellent client-facing and internal communication skills Excellent written and verbal communication skills Solid organizational skills including attention to detail and multi-tasking skills Strong working knowledge of Microsoft Office PMP / PRINCE II certification is a plus\n• Proven working experience as a project administrator in the information technology sector Solid technical background, with understanding or hands-on experience in software development and web technologies Excellent client-facing and internal communication skills Excellent written and verbal communication skills Solid organizational skills including attention to detail and multi-tasking skills Strong working knowledge of Microsoft Office PMP / PRINCE II certification is a plus\n• PMP / PRINCE II certification is a plus\n• Strong working knowledge of Microsoft Office PMP / PRINCE II certification is a plus\n• Solid organizational skills including attention to detail and multi-tasking skills Strong working knowledge of Microsoft Office PMP / PRINCE II certification is a plus\n• Excellent client-facing and internal communication skills Excellent written and verbal communication skills Solid organizational skills including attention to detail and multi-tasking skills Strong working knowledge of Microsoft Office PMP / PRINCE II certification is a plus\n• Excellent written and verbal communication skills Solid organizational skills including attention to detail and multi-tasking skills Strong working knowledge of Microsoft Office PMP / PRINCE II certification is a plus\n• Solid technical background, with understanding or hands-on experience in software development and web technologies Excellent client-facing and internal communication skills Excellent written and verbal communication skills Solid organizational skills including attention to detail and multi-tasking skills Strong working knowledge of Microsoft Office PMP / PRINCE II certification is a plus", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJQcmltZVJQTyIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiVThWYkZCRTVWUnBVcC1hb0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBHbGFzc2Rvb3IiLCJsaW5rIjoiaHR0cHM6Ly93d3cuZ2xhc3Nkb29yLnNnL2pvYi1saXN0aW5nL3Byb2plY3QtbWFuYWdlci1wcmltZXJwby1KVl9JQzMyMzU5MjFfS08wLDE1X0tFMTYsMjQuaHRtP2psPTM1OTYzNzMzODJcdTAwMjZ1dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Project Manager (BB-63D33)", "company_name": "FUJIFILM Business Innovation Singapore", "location": "Singapore (+1 other)", "via": "via BeBee", "description": "Job DescriptionProject Manager-(210000JG)DescriptionThe Job As a Project Manager, with strong project management capabilities and a proven track record in managing multi-million-dollar projects in Government and Commercial sectors, you will be responsible for: Project Management Support Project and resource scheduling, project tracking (Project deliverables, financials, Operations, documentation, IT team and etc), risk management and quality assurance Oversee and support the implementation of projects, tracking and controlling all project phases and activities Participate in the drafting of solutions for prospective clients together with sales representatives Manage and ensure timely delivery of projects’ operations with various cross functional stakeholders Stakeholder Management Work closely with internal stakeholders to coordinate and evaluate project requirements and develop processes to ensure successful and sustainable execution of the project Maintain professional relationships... with clients to ensure optimal level of client satisfaction What you will bring and develop Degree in Computer Science, Information Technology or equivalent, with PMP/CITPM certification is a must At least 4 to 5 years’ working experience (min 2 years in government projects), with min 3 years’ IT Project Management. Hands-on experience in Electronic Content Management (ECM) software, Open text, EMC Documentum will have an added advantage Ability to provide mentorship and leadership to the team Good communication skills with excellent spoken and written English Result and customer-service oriented Committed and responsible team player with ability to interact with all levels Interested in this exciting opportunity?Submit your application today! * We regret to inform that only shortlisted candidates will be notified. QualificationsRequirements: Degree in Computer Science or equivalent, with PMP/CITPM certification preferred At least 4 to 5 years’ working experience, with minimum 3 years’ IT Project Management experience in a Project Manager or Lead Consultant role [Candidates with Working experience in Electronic Content Management (ECM) software, Open text, EMC Documentum or Enterprise Search Engine will have an added advantage] Ability to provide mentorship and leadership to the team Good communication skills with excellent spoken and written English Result and customer-service oriented Committed and responsible team player", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIgKEJCLTYzRDMzKSIsImNvbXBhbnlfbmFtZSI6IkZVSklGSUxNIEJ1c2luZXNzIElubm92YXRpb24gU2luZ2Fwb3JlIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJhaDRHczZSbjNvZkhuaXFGQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJlQmVlIiwibGluayI6Imh0dHBzOi8vc2cuYmViZWUuY29tL2pvYi8yMDIxMDQxNy01OGM5MmU0ZjczNTA1MDdmZWM4Zjc4ZmFhZjM2M2QzMz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Management", "value": "GC18"}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Advertising and Marketing", "value": "GC03"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Media, Communications and Writing", "value": "GC20"}, {"text": "Transportation and Logistics", "value": "GC30"}, {"text": "Art, Fashion and Design", "value": "GC05"}, {"text": "Construction", "value": "GC09"}, {"text": "Education", "value": "GC11"}, {"text": "Human Resources", "value": "GC15"}, {"text": "Protective Services", "value": "GC23"}, {"text": "Property", "value": "GC24"}, {"text": "Science and Engineering", "value": "GC27"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "Project manager", "value": "project manager"}, {"text": "Program manager", "value": "program manager"}, {"text": "Manager", "value": "manager"}, {"text": "Delivery manager", "value": "delivery manager"}, {"text": "Project director", "value": "project director"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Senior", "value": "senior"}, {"text": "Consultant", "value": "consultant"}, {"text": "Coordinator", "value": "coordinator"}, {"text": "Deputy director", "value": "deputy director"}, {"text": "Director", "value": "director"}, {"text": "Group manager", "value": "group manager"}, {"text": "Operations", "value": "operations"}, {"text": "Scrum master", "value": "scrum master"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Services", "value": "services"}, {"text": "Vice president", "value": "vice president"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Engineering Services", "value": "/business/naics2007/5413"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Entertainment", "value": "/business/naics2007/71"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Management", "value": "/business/naics2007/55"}, {"text": "Real Estate", "value": "/business/naics2007/53"}, {"text": "Research", "value": "/business/naics2007/5417"}, {"text": "Retail", "value": "/business/naics2007/44"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": ".AB4Jjf.qPB6Vc{padding-right:11px}.qfpP8d{padding:7px 0 7px 11px}.S003Ke{flex:none}.ZoN4Lb{color:rgba(0,0,0,.54)}.nAXVG{color:#70757a}.IxQsL{color:rgba(0,0,0,.26)}.xFO1De{color:#fff}.ooFpK{color:rgba(255,255,255,.30)}.mtnwac{color:#4285f4}.WxeeKb{color:#34a853}.hIVRU{color:#f29900}.EXaTMc{color:#fbbc04}.sxn46d{color:#000}.gqMTF{color:#1a73e8}.zpn8Mb{color:#d93025}.dEUPmd{color:#1e8e3e}.PJNo1{color:#fbbc04}Actively Hiring", "value": "e"}, {"text": "Michael Page", "value": "/m/04cxldw"}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Nanyang Technological University", "value": "/m/0l49k"}, {"text": "Jobline Resources Pte Ltd", "value": "/g/11gp2647pn"}, {"text": "Randstad Singapore", "value": "/g/11g70b50mr"}, {"text": "GECO Asia", "value": "/g/11gk72_bt_"}, {"text": "Facebook", "value": "/m/0hmyfsv"}, {"text": "HP", "value": "/m/03mnk"}, {"text": "IoTalents", "value": "/g/11dxq187wm"}, {"text": "NCS Group", "value": "/m/0282746"}, {"text": "National University of Singapore", "value": "/m/01q460"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "OPTIMUM SOLUTIONS (SINGAPORE) PTE LTD", "value": "/g/11g70hkrbx"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Apple", "value": "/m/0k8z"}, {"text": "Avensys Consulting", "value": "/g/11g7022gjf"}, {"text": "BNP Paribas", "value": "/m/02qhk4"}, {"text": "Ceridian", "value": "/m/07f8h6"}, {"text": "Ensign InfoSecurity", "value": "/g/11g4jhymjr"}, {"text": "Humanica Asia Pte. Ltd", "value": "/g/11h1y98c9z"}, {"text": "Kerry Consulting", "value": "/g/11c73vtzc8"}, {"text": "Marsh and McLennan", "value": "/m/053rw"}, {"text": "NSEARCH GLOBAL", "value": "/g/11dxpksll4"}, {"text": "NTT", "value": "/m/05mybp8"}, {"text": "OakTree Consulting", "value": "/g/11g70jfhtq"}, {"text": "Salesforce", "value": "/m/07btr5"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "TEKsystems", "value": "/g/11b6g4bkv0"}, {"text": "Teradyne", "value": "/m/04bzqp"}, {"text": "Toshiba Tec Singapore Pte. Ltd", "value": "/g/11g9n9q547"}, {"text": "Trustwave", "value": "/m/0n3xjf5"}, {"text": "Wood Plc", "value": "/m/07vv9s"}, {"text": "Workiva", "value": "/m/0113m1rd"}, {"text": "A-it Software Services Pte Ltd", "value": "/g/11dxpy_gl_"}, {"text": "ABS Group", "value": "/g/11dxplj1z6"}, {"text": "ACI HR Solutions Ltd", "value": "/g/11c73ryh3p"}, {"text": "AIA", "value": "/m/02r5cgx"}]}]}