{"search_metadata": {"id": "60827aa5033e945f922b263e", "status": "Success", "json_endpoint": "https://serpapi.com/searches/4c1a2e816d6db45d/60827aa5033e945f922b263e.json", "created_at": "2021-04-23 07:43:33 UTC", "processed_at": "2021-04-23 07:43:33 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28product+manager%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=130", "raw_html_file": "https://serpapi.com/searches/4c1a2e816d6db45d/60827aa5033e945f922b263e.html", "total_time_taken": 0.88}, "search_parameters": {"q": "(product manager) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "130"}, "jobs_results": [{"title": "Manager, Product Technology Audit", "company_name": "Grab", "location": "Singapore", "via": "via Glassdoor", "description": "Get to know our Team :\n• Internal Audit is an independent function within Grab that provides an objective assurance and advisory role to Grab’s senior management.\n• We use a systematic, disciplined risk-based approach to evaluate and assess Grab’s risks, processes and internal controls.\n• Reflecting Grab’s entrepreneurial spirit, Internal Audit covers multiple businesses and technology areas.\n\nGet to know the Role :\n• As a Manager of Technology Audit, you are responsible to effectively manage audits and risk advisory activities that cover the associated risks arising from Technology and System activities across the Grab’s businesses.\n• You report directly to the Head of Technology, Systems & Data Analytics Audit, and work in a team of 4 technology auditors who are specialised in the audits of Technology and Systems related activities within the Grab’s businesses.\n• We seek a candidate who brings excellent audit and risk advisory experience to complement the Technology Audit team, in a... fast-paced and dynamic environment.\n• You effectively plan, manage and execute audits, including the design of audit work steps to evaluate the risks associated with governance, financial, operational, regulatory, and business continuity.\n\nThe day-to-day activities :\n• Support the Head of Technology, Systems & Data Analytics Audit as part of the Technology Audit team.\n• Work with the Technology Audit team and partner the other IA teams, focusing on all risks arising from the Technology and System activities across Grab’s businesses.\n• Plan and perform risk-based assessments, understand and evaluate the business environment, related controls and processes.\n• Prepare draft/ final report and participate in the presentation of audit findings.\n• Develop and maintain business relations with Grab’s management, and be the trusted risk advisor on control related matters.\n\nThe must haves :\n• Bachelor's degree in information systems, computer science/engineering, accountancy, finance or equivalent, with professional certification (e.g., CISA, CISM, CISSP) as an added advantage.\n• 10-12 years of technology audit and risk advisory (including Sarbanes-Oxley) experience.\n• Strong knowledge of technology regulatory requirements and expectations within South-East Asia.\n• Excellent command of English.\n• Proficiency in productivity tools (email, calendar, Word, Excel, PowerPoint).\n• Located in Singapore, and ability to travel for work when required.\n\nExperience and knowledge in the following:\n• Excellent technology auditing skills, with strong confidence for interaction with stakeholders.\n• Experience in auditing application security, cybersecurity domains and/or cloud computing will be an added advantage.\n• Experience with the use of data analytics and visualisation tools for audit will be an added advantage", "extensions": ["14 days ago", "Full–time"], "detected_extensions": {"posted_at": "14 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJNYW5hZ2VyLCBQcm9kdWN0IFRlY2hub2xvZ3kgQXVkaXQiLCJjb21wYW55X25hbWUiOiJHcmFiIiwiY29tcGFueV9taWQiOiIvbS8wMTM0Y19wOSIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IkJlUDdGalFnT3VhbXhUOUpBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVzc0JDb3dCUVU1VlgwNXhVbWRPWjBKR1ZGTTBWblJZTVROZlkyazVkSEpxWmpoQ1QyVkJVV0ZGZDNSSlZsZHplV1pKZWxwc1MzQnpla1ZVY0VGc1ZHNW1iMmt4VVhGemRYRnlPVzUzUjNGSmJrRlBWMWhoWW1oWVp6TXRkVFZDVlhkR1pYZFlaamxqWVhoUFNYRnVNVEpIYmxKeFJVVkhWelZPV1hFdE55MUlRbEF4YldWZlJVNVJZbkpqV1cweVFuWVNGbkJZY1VOWlVETjJTR0ZZZEhSUllXMDBXWFYzUkhjYUlrRlBUVmxTZDBKM2FXbFZjMjF2T0hRNGFucEtiWGM1WkhoRU9VWktZWGczU1hjIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBHbGFzc2Rvb3IiLCJsaW5rIjoiaHR0cHM6Ly93d3cuZ2xhc3Nkb29yLnNnL2pvYi1saXN0aW5nL21hbmFnZXItcHJvZHVjdC10ZWNobm9sb2d5LWF1ZGl0LWdyYWItSlZfSUMzMjM1OTIxX0tPMCwzMl9LRTMzLDM3Lmh0bT9qbD00MDI5OTU4NzAwXHUwMDI2dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Production Manager (Flavor)", "company_name": "None", "location": "Singapore", "via": "via Jobs", "description": "Purpose: Overall responsible for the manufacturing activities of flavors, to achieve the required levels of operational efficiency while meeting customer's quality, lead-time requirements and ensure better than industry standards to meet customer satisfaction. Duties & Responsibilities: · Direct control of the whole Flavor production team through efficient production planning, control of raw materials and quality production process. · Support Plant Manager in managing all Flavor production activities. · Ensure good manufacturing practices that adhere to ISO, Food Safety, HACCP and EHS requirements. · Ensure finished products comply with customer specifications and company regulatory requirements and standards. · Ensure efficient and timely execution of the production schedule. · Plan and monitor factory preventive maintenance to make certain that all equipment and machineries are functioning properly. · Plan and monitor factory maintenance activities to assure good housekeeping. ·... Work closely with the QA/QC and Process Industrialization Department to ensure quality of products. · Investigate and find out the root cause with regards to customer complaints and internal rejects. · Work closely with Planning, Purchasing and Research & Development Departments to ensure efficient stocks level of raw materials to meet timely delivery of finished products. · Manage all CAPEX and projects related to Flavor Production. · Initiate reviews of production budget, processes, polices and procedures to improve efficiency, reduce cost and increase productivity whilst maintaining industry standards of quality and safety. · Monitor, study and improve on machine utilization, work & material, production cost performance and initiates cost reduction program. · Make plans for the future expansion in line with business goals to increase the sales of flavor production. · Identify, plan and coordinate developmental training needs for staff to maintain standards of competencies. Job Requirements · Tertiary Education or equivalent in years of similar experience. · At least 5 years relevant experience working in chemical plant with managerial function. · Leadership and Managerial Skills. · Good knowledge of Good Manufacturing Practices, international Certification Standards, such as ISO, etc. · Prior knowledge of Food Safety and HACCP. · Able to communicate effectively with all level of staff. · Good organizational and leadership skills. · Chemical Knowledge. Purpose: Overall responsible for the manufacturing activities of flavors, to achieve the required levels of operational efficiency while meeting customer's quality, lead-time requirements an Skills: Chemical Industry, Continuous Improvement, Leadership, Lean Manufacturing, Management, Managerial Experience, Managerial Skills, Manufacturing, Operational Efficiency, Operations Management, Process Improvement, Product Development, Production, Project Management, Customer Satisfaction Survey, Control, Efficient, Production Scheduling Experience: 5.00-7.00 Years", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9kdWN0aW9uIE1hbmFnZXIgKEZsYXZvcikiLCJjb21wYW55X25hbWUiOiJOb25lIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJPNTdfRWpfaV9abXllLXVlQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnMiLCJsaW5rIjoiaHR0cHM6Ly9zZy5maWRhbnRvLmNvbS9qb2JzL2pvYi1vcGVuaW5nL2NvdW5zZWxvcnMtYWxsLW90aGVyL3Byb2R1Y3Rpb24tbWFuYWdlci1mbGF2b3ItMjc1NzIzOTM1P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Product Manager - Commercial Cards (Cards and Personal Loans)", "company_name": "Citi bank", "location": "Singapore", "via": "via Bayt.com", "description": "You will be responsible for the Commercial Cards product portfolio, including the development of its value proposition strategy and implementing B2B solutions that help businesses realize cost savings, convenience and operation efficiencies. You will need to be familiar with the credit cards/payments landscape and understand competitor strengths and weaknesses to uncover opportunities to drive revenue growth.\n\nResponsibilities\n• Evaluate/enhance product core value proposition to remain competitive yet maximize profitability.\n• Keep updated on industry conditions eg. risk, governance and regulatory requirements that may potentially impact or impede account on-boarding.\n• Streamline and optimize processes with Risk/Asset Operations to shorten credit review and account set-up cycle.\n• Define the scope and map out FATCA/CDD/CIPP/KYC screening and documentation process that Commercial Cards team must adhere to during account on-boarding.\n• Collaborate with Commercial Cards Sales Platform... to provide training and/or selling tools to facilitate effective selling of the Commercial Cards suite of products.\n• Lead regional product enhancement project for Singapore in determining best in class CVP across Commercial Cards offerings.\n• Engage with Decision Management to analyze and better understand customer profiles, business needs and identify account expansion opportunities.\n• Work with internal stakeholders from Regional Product, Legal, Compliance, Tech, Operations and Marketing Teams as part of end to end management of the suite of products.\n• Review, develop, manage all communication channels, materials and collaterals which includes management of inventory for card plastics, welcome packs, card member agreements, statement messages, product page etc.\n• Plan, execute and manage through-the-line marketing initiatives (program proposals, web management requests, client appreciation events etc.)\n• Execute changes to pricing, policy/regulations, system and parameter enhancements when required.\n• Prepare monthly/quarterly business reviews and ensure audit readiness at all times.\n• As part of digitalization roadmap at Citi, he/she will manage the products’ digital marketing channels & platforms, and will be required to work closely with various stakeholders to develop, test and execute the implementation of such initiatives.\n• Must be able to appropriately assess risks when business decisions are made, demonstrating particular consideration for the bank's reputation and safeguarding Citigroup, its clients and assets, by driving compliance with applicable laws, rules and regulations, adhering to Policy, applying sound ethical judgment regarding personal behavior, conduct and business practices, and escalating, managing and reporting control issues with transparency.\n\nQualifications and Skill-set Requirements\n• Sound knowledge and understanding of Cards and Unsecured Lending landscape in Singapore.\n• At least 5 years of Commercial Cards experience or similar role from a related industry, attuned to B2B needs and solutions in the market.\n• Strategic business/financial acumen and ability to identify business opportunities, to improve expense management and business performance.\n• Analytical skills to interpret business reports, identify gaps or opportunities and develop appropriate actions for product enhancement/portfolio growth.\n• Proven experience and ability to influence change/progress and collaborate well amongst stakeholders across teams or functions.\n• Excellent business development, customer service and relationship management skills.\n• Excellent presentation, verbal and written communication skills.\n• Self-driven & highly motivated team player who can multi-task & deliver results under pressure.\n• Meticulous with critical eye for details.\n• Keen learner ready for challenges and stretch responsibilities.\n\n-------------------------------------------------\n\nJob Family Group:\n\nProduct Management and Development\n\n-------------------------------------------------\n\nJob Family:\n\nProduct Management\n\n------------------------------------------------------\n\nTime Type:\n\nFull time\n\n------------------------------------------------------\n\nCiti is an equal opportunity and affirmative action employer.\n\nQualified applicants will receive consideration without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.\n\nCitigroup Inc. and its subsidiaries (\"Citi”) invite all qualified interested applicants to apply for career opportunities. If you are a person with a disability and need a reasonable accommodation to use our search tools and/or apply for a career opportunity review Accessibility at Citi.\n\nView the \"EEO is the Law\" poster. View the EEO is the Law Supplement.\n\nView the EEO Policy Statement.\n\nView the Pay Transparency Posting", "extensions": ["7 days ago", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9kdWN0IE1hbmFnZXIgLSBDb21tZXJjaWFsIENhcmRzIChDYXJkcyBhbmQgUGVyc29uYWwgTG9hbnMpIiwiY29tcGFueV9uYW1lIjoiQ2l0aSBiYW5rIiwiY29tcGFueV9taWQiOiIvbS8wMWRmYjYiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiIyVDRTZlA3OHlQU3BxcV9sQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VVdGMVdVVXRjRjh4Y0VkdE1qSlpaV1IxVTAwNFEzb3dVMnAzTkc5WlRsaENhVEJyYXkxMmNtbFRiblZhWmxWbWFGSXhXVWc0YjAweE5VeHZXbk55Y0Y5NGVYb3dSM0JZY2xWS1VpMUpjR0pTZWxwVVVYSmtNMVJrY2xCeFdWWnVVRUprVUhCRE5XMVpSRWR4ZEc1SVJtcFhUMjlMZEhaeFdrWTNkelpNZW1kZk1XVmZVWFEzVkRoU1VtTlZPRUpYU1U5ck1rcDRhM2RMZFhGbkVoWndXSEZEV1ZBemRraGhXSFIwVVdGdE5GbDFkMFIzR2lKQlQwMVpVbmRCVTJGcVVEZGFaMDl2V2tJME5IQjBla3hmVXpaWVRHUXdRVWgzIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMTkiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQmF5dC5jb20iLCJsaW5rIjoiaHR0cHM6Ly93d3cuYmF5dC5jb20vZW4vc2luZ2Fwb3JlL2pvYnMvcHJvZHVjdC1tYW5hZ2VyLWNvbW1lcmNpYWwtY2FyZHMtY2FyZHMtYW5kLXBlcnNvbmFsLWxvYW5zLTU5NTAyMTM1Lz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "First VP - Cash Management Product Manager - Payables and Receivables - Group Transaction Banking", "company_name": "United Overseas Bank Limited", "location": "Singapore", "via": "via Monster", "description": "Job Responsibilities\nReporting to the Team Head of Payables & Receivables under Cash Product Management at Group Transaction Banking, the position will be part of the cash product management team responsible for the management, planning, and development of payments and collections product solutions for our Transaction Banking business in Asia Pacific.\nAs part of the Group Product Management role, the incumbent will be responsible for carrying out market research to ensure that new product solutions are identified to meet business opportunities for growing our cash revenue. Key areas of product coverage include:\n• Payables and Receivables – Domestic and international payment / collection products e.g. TT, ACH, RTGS, Cheques, Virtual Account\n• Footprint - Extension of our network through partnering local banks and non-bank institution\n• FI products - Enhancement of our product solutions in the area of local currency clearing (SGD) clearing and other product solutions\n\nKey... responsibilities include:\n• Identifying product development opportunities and requirements based on customer needs, competitor benchmarking, and market research. Developing new products and improving existing solutions within the agreed deadlines.\n• Working with various key partners in the bank, you will build business cases and prepare business requirements, review functional specifications, perform user acceptance testing, address day-to-day business process matters and issues, support sales calls and participate in responses to Request For Proposals (RFP) from customers.\n• Working closing with key business partners to ensure end-to-end integrity of final delivered solutions, processes and documentation. These partners include Services Management, Product Developers, Project Management, Technology, Operations, Legal, Compliance, Client Fulfillment and Service.\n• Addressing day-to-day business process matters such as technical support, operational issues, client service support, legal documentation, etc.\n• Ensuring clear understanding of our product capabilities across various customer touch-points – including Sales, Relationship Managers, Branches, Implementation & Customer Service, Call Centre, etc., through proactive communications program, internal training workshops, etc.\n• Providing post-sales support in terms of product documentation, implementation of solutions and necessary training for stakeholders to ensure continued usage of our products and services.\n\nJob Requirements\nRequirements\n• At least 8 years of experience in Cash Management business across Asia Pacific, especially with respect to Network Expansion, FI products, and Payables & Receivables products.\n• Strong interpersonal and communication skills with good spoken and written English and local language. Ability to communicate at all levels of the organization both internally and externally.\n• A highly-motivated self-starter with a strong desire to learn.\n• Ability to keep abreast of changes in the markets, customer requirements, competitors responses and the Bank's abilities and to use this information to identify new business.\n\nBe a part of UOB Family\nUOB is an equal opportunity employer. UOB does not discriminate on the basis of a candidate's age, race, gender, color, religion, sexual orientation, physical or mental disability, or other non-merit factors. All employment decisions at UOB are based on business needs, job requirements and qualifications. If you require any assistance or accommodations to be made for the recruitment process, please inform us when you submit your online application.\nApply now and make a difference", "extensions": ["5 days ago", "Full–time"], "detected_extensions": {"posted_at": "5 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJGaXJzdCBWUCAtIENhc2ggTWFuYWdlbWVudCBQcm9kdWN0IE1hbmFnZXIgLSBQYXlhYmxlcyBhbmQgUmVjZWl2YWJsZXMgLSBHcm91cCBUcmFuc2FjdGlvbiBCYW5raW5nIiwiY29tcGFueV9uYW1lIjoiVW5pdGVkIE92ZXJzZWFzIEJhbmsgTGltaXRlZCIsImNvbXBhbnlfbWlkIjoiL20vMDRnamQxIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiRGtnX0dBYjlKVWtkMzBoVkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRW9zQ0Nzd0JRVTVWWDA1eFVURldlblpPT0daeVNuRjZVVUowV2pseGFVVXlkSEl5TTFCeVFWbE1lR2t5V2tsbWJYSmhSVzlGYkV0emJsQjBVbUZFUXpORE5HMUNjRkU0WVVaRlQxZGpkM28xTVc5d09HcEtXVlI2U2pkQ1VFb3lVV2RxTmxaVVZubG5ialpTU0ZScWJtUm5kbXRRVEhnd1YzcFZSbDlHU2sxTmEzTnpUVk5IWTJod2RGaERiRmx5WW5SVWRIcHlZVFl3UTA5Q2JqaFZZbmQwYVhGVGRFRm9RMmxIU2pJMWFuVlhVRzUwTkRkWE1ubGpSRlIzWkRKMlpsSXhiVWxYTTNFMmVYcFNSekJrYlhBeUVoWndXSEZEV1ZBemRraGhXSFIwVVdGdE5GbDFkMFIzR2lKQlQwMVpVbmREUVdScGFuZFdkMkpGY0MxT2VraG9ZMGhLU1RCeWRrRkNZVjkzIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMjciLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTW9uc3RlciIsImxpbmsiOiJodHRwczovL3d3dy5tb25zdGVyLmNvbS5zZy9hbXAvam9iLXZhY2FuY3ktZmlyc3QtdnAtY2FzaC1tYW5hZ2VtZW50LXByb2R1Y3QtbWFuYWdlci1wYXlhYmxlcy1hbmQtcmVjZWl2YWJsZXMtZ3JvdXAtdHJhbnNhY3Rpb24tYmFua2luZy11bml0ZWQtb3ZlcnNlYXMtYmFuay1saW1pdGVkLXNpbmdhcG9yZS0yNjk1NzcyMS5odG1sP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Readiness Senior Manager (BB-ADB93)", "company_name": "Apple", "location": "Singapore (+1 other)", "via": "via BeBee", "description": "Key QualificationsTeam Leadership- Demonstrated experience in a leadership role- Extensive people management and organisation skills, with the proven ability to lead by example and develop team members to become leaders- Cultivate a positive and motivating work environment by promoting teamwork, diversity, inclusion and focusing on positive employee relationshipsExecutive Communication and Influencing skills- Aptitude to clearly present the thought process, have debates and ability to influence without authority. Presenting to peers and senior executives/management is critical to your successRelationship Management- Outstanding EQ and stakeholder management skills with cross-functional teams of all levels in a matrix organizationStrategic Thinking- Natural End to End thinker, ability to connect the dots and manage project plans, timelines and risks effectively- Capacity to deliver results under extremely tight and high-pressure timelines in a highly ambiguous environmentStrong Problem... solving skills and attention to details- Ability to craft detailed execution plans for strategies with milestones, dependencies, DRIs, timelines and mitigation plan for execution risks.- Sharp eye for details with a “hands-on” and continuous improvement mindset to identify inefficiencies and design improvement solutionsPreferred Qualifications- Experience and knowledge of multiple disciplines within supply chain operations (order to fulfillment, supply/demand planning, logistics, manufacturing, etc.) and product management (localization, certification and new product launches) is a plusDescriptionIn this role, you will quickly build your experience by being exposed to the breadth of Apple Operations and will drive alignment across all Operations teams (e.g. Product Localization Management (PLM), Supply Demand Management (SDM), Logistics, Reseller Operations (RO), Retail Fulfillment Ops (RFO)), as well as other functions (Product Marketing, Sales, IT, Pricing etc at Global, Regional and Country levels. In a nutshell, your role is to bring alignment and clarity in a highly flexible environment, making sure that all the teams are up to date and driving towards the same strategic launch objective.As a leader of the Operations Readiness team, you will provide thought leadership to continuously improve the way we launch new products at Apple, motivate the team to do their life’s best work, foster an inclusive work environment and will tirelessly coach, guide and develop each individual in their growth and career journey. You will be responsible for the success of Apple Hardware’s product launch and will be the key point of contact to the senior leadership team during the launch health reviews and drive risk mitigation under tight timelines. Post launches, you will be expected to devise and lead opportunities for business process improvements and influence internal change management.Education & ExperienceBS/BA degree required. MBA or advanced degree is a plus", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJSZWFkaW5lc3MgU2VuaW9yIE1hbmFnZXIgKEJCLUFEQjkzKSIsImNvbXBhbnlfbmFtZSI6IkFwcGxlIiwiY29tcGFueV9taWQiOiIvbS8wazh6IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiOERQZGV1Uy1qSUdOM1JKaEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXNzQkNvd0JRVTVWWDA1eFVtOUlUVzFUUW5VeWFXRkhiVXRhU2xaUVZYUkJSblpLZUZWV05ERklMV2R1V1c1ZmFHaDJSbFIxVWxremVrWlFiV3AwVjFSeVFWTjFlV05ZTlhwNVJHSktTemc1VFZkdlNrTlJSRkJtTVhOWFMzWlNSRFZHYjI4NU9FWmZkazQ1VkRWM1pVOTFOSHBGU0RWbmVrNVdjVFZ0VTBabVJXRlZZVzEwTjA5cVRtRmhkR1JPWms0U0ZuQlljVU5aVUROMlNHRllkSFJSWVcwMFdYVjNSSGNhSWtGUFRWbFNkMEp1YVhOeVRWRkdRWE5wVlVGbk4ycDNSRGhCU0hkQmNHNDNjbEUiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18zNSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCZUJlZSIsImxpbmsiOiJodHRwczovL3NnLmJlYmVlLmNvbS9qb2IvMjAyMTA0MTctNjg0YmRkZGM2ZTY0Y2FhMTNiMmQ0OWRjMzc1YWRiOTM/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Product Manager (Artificial Intelligence Platforms)", "company_name": "GovTech Singapore", "location": "Singapore", "via": "via LinkedIn", "description": "The Government Technology Agency (GovTech) aims to transform the delivery of Government digital services by taking an \"outside-in\" view, putting citizens and businesses at the heart of everything we do. We also develop the Smart Nation infrastructure and applications, and facilitate collaboration with citizens and businesses to co-develop technologies.\n\nJoin us as we support Singapore’s vision of building a Smart Nation - a nation of possibilities empowered through info-communications technology and related engineering.\n\nWho We Are\n\nGovTech's Data Science and Artificial Intelligence (DSAI) division uses technology and data to help deliver high-quality digital services to citizens and businesses in Singapore. We build software products for government agencies to better understand and use their data to improve operations and decision making.\n\nWhat The Role Is\n\nProduct managers help make sure the right things get done. At a high level, this means establishing a clear vision for what a... product should be and what needs to be done to get there. On a day to day basis, this means handling all the different facets of a project and making sure they are coordinated. And at the core, this means building a foundation of knowledge across user needs, technical constraints, and design goals so you can act as a bridge across all of them.\n\nConcretely This Means\n• Making good product decisions\n• Working with designers to create intuitive user experiences\n• Creating multiple proposals for the many forms a product can take\n• Driving the team toward consensus on what the product should be\n• Understanding users better than anyone else\n• Conducting user studies to understand their needs and problems\n• Analysing data to uncover usage patterns that inform product decisions\n• Researching the industry to understand existing solutions\n• Work closely with the engineering team\n• Translating the product strategy into detailed, actionable plans for business and engineering teams\n• Communicating across teams\n• Explaining technical considerations to non-technical audiences\n• Public-speaking, giving presentations and writing papers\n• Identifying key stakeholders, including government agencies, industry partners and the broader tech community, and convincing them to give their support\n• Coordinating efforts across multiple functions including marketing, legal and finance\n• Keeping things organised\n• Running efficient meetings to keep people updated and make good decisions\n• Prioritising, planning, and tracking what needs to be done\n• Documenting key information and decisions about the product\n\nWhat It Is Like Working Here\n\nWe build products that serve a variety of agency users, who use them to solve highly meaningful problems pertinent to our society, from transportation, to education, to healthcare. The public sector is full of opportunities where even the simplest software can have a big impact on people’s lives. We are here to improve how we live as a society through what we can offer as a government.\n• Rapid Prototyping - Instead of spending too much time debating ideas we prefer testing them. This identifies potential problems quickly, and more importantly, conveys what is possible to others easily.\n• Reliable Productization - To scale an idea, a prototype or a Minimum Viable Product to a software product, we scrutinize and commit to its usability, reliability, scalability and maintainability.\n• Ownership - In addition to technical responsibilities, this means having ideas on how things should be done and taking responsibility for seeing them through. Building something that you believe in is the best way to build something good.\n• Continuous Learning - Working on new ideas often means not fully understanding what you are working on. Taking time to learn new architectures, frameworks, technologies, and even languages is not just encouraged but essential.\n\nWhat We Are Looking For\n\nThe customers for our products are normally agency users, which means that prior public service experience will help. A disciplined approach and strong problem-solving instincts are fundamental to succeed. Your aptitude for completing the tasks and attitude to continuous learning are more valued than any formal certification.\n\nWe Look For People Who\n• Have solid communication and stakeholder management skills\n• Can analyse and use data to solve problems\n• Have an interest in data science and machine learning\n• Have good design sense\n• Have experience writing code\n• Take initiative to make things happen\n• Want to work for the public good", "extensions": ["28 days ago", "Full–time"], "detected_extensions": {"posted_at": "28 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9kdWN0IE1hbmFnZXIgKEFydGlmaWNpYWwgSW50ZWxsaWdlbmNlIFBsYXRmb3JtcykiLCJjb21wYW55X25hbWUiOiJHb3ZUZWNoIFNpbmdhcG9yZSIsImNvbXBhbnlfbWlkIjoiL2cvMTFkeHBrZnNfNiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImdIcWdRbGZfeDUzeGdPaEdBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2WUJDcmNCUVU1VlgwNXhVemhSZFUxT1YxTTRhR3BpT0c5T1h5MWpiR1ZZY21nelVreEdibEZHWW1jMWFURm9aa0ZtY0VSdGNsUnlRWE5zYVV4TWVteExXalp0ZFZRMU1IQkdOVmRVV0ZCalgwWjZWVlJPT0hZNFVERTJSMDh5T1dwd01Hd3RhVFJxWDI1MFlWTlBRVzUzYlVwWlgwTmhkR05MYUdneWFIUXdMVGN3Vm5Ka01Fc3pZbk0zU1U5UllWVjFTUzEwZUhSMVRYVjZaSEYzV1UxYWRFSXhPRWhoYlV3M01rVnhObFp4ZG14V1IzRmxPRXhVYUc1ekVoWndXSEZEV1ZBemRraGhXSFIwVVdGdE5GbDFkMFIzR2lKQlQwMVpVbmRCY1dvMWVEWmlMWFp3TTBaaVExUnJWakEwZFRCeVJVWjVSRjluIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNDIiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGlua2VkSW4iLCJsaW5rIjoiaHR0cHM6Ly9zZy5saW5rZWRpbi5jb20vam9icy92aWV3L3Byb2R1Y3QtbWFuYWdlci1hcnRpZmljaWFsLWludGVsbGlnZW5jZS1wbGF0Zm9ybXMtYXQtZ292dGVjaC1zaW5nYXBvcmUtMjQyNjExMzYwOD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Product Manager", "company_name": "Standard Chartered Bank", "location": "Singapore", "via": "via Laimoon.com", "description": "About Standard Chartered\nWe are a leading international bank focused on helping people and companies prosper across Asia, Africa and the Middle East.\n\nTo us, good performance is about much more than turning a profit. It's about showing how you embody our valued behaviours - do the right thing, better together and never settle - as well as our brand promise, Here for good.\n\nWe're committed to promoting equality in the workplace and creating an inclusive and flexible culture - one where everyone can realise their full potential and make a positive contribution to our organisation. This in turn helps us to provide better support to our broad client base.\n\nThe Role Responsibilities\nStrategy\nOverall trade strategy has digitization of Trade as a key pillar to transform the business over the next 3-5 years. The role is expected to leverage both proprietary channels/capabilities and pioneer innovation/partnerships with 3 rd party platforms/consortiums to transform the doc trade business... working with product managers, fintechs, internal tech, data & operations teams etc.\nBusiness\n\nThis group product manager role in trade digitization initiatives will steer the commercialisation and implementation of the digitization agenda across the Doc trade portfolio. This function within Trade Finance targets to address internal and client communications with regards to new initiatives, enhancements & digital product capabilities in the region and countries. It will ensure the alignment of multiple digitization and change management workstreams working with the Global Products Managers, Regional Trade Heads, Country Heads and relevant internal functions across Digital channels, data , operations, governance etc.\nThe incumbent has joint accountability (with digital channels, trade ops, implementation & product mgmt etc) for commercialisation of the trade digital initiatives and accountability\nProcesses\n• Manage sourcing, shortlisting and identification of digital solutions for Doc trade across client facing /operational efficiency enhancing solutions etc working with DCDA, ops, product, sales, regions\n• Work with DCDA, Product Mgmt, Sales & client to commercialize all relevant Trade Finance digitization, platform/partnership initiatives, enhancements, in order to achieve digital KPIs\n• Project manage the execution of live transactions together with LPMs\n• Working with countries & operations to identify target clients and establish commercialization plan\n• Prepare client briefing decks & lead digital pitch in conjunction with DCDA/Sales/Product mgmt.\n• Conduct training in the context of our digital capabilities\nGovernance\n• Work with DCDA to manage governance for the platforms in the doc trade portfolio\n• Work with DCDA & governance teams to share refreshed governance frameworks with COEs and countries. Ensure renewal of governance approvals for platforms in the portfolio are tracked & followed up.\nRegulatory & Business Conduct\n• Display exemplary conduct and live by the Group's Values and Code of Conduct.\n• Embed the highest standards of ethics, including regulatory and business conduct, across Standard Chartered Bank. This includes ensuring compliance with, in letter and spirit, all applicable laws, regulations, guidelines and the Group Code of Conduct.\n• Lead the Trade Digitisation initiatives to achieve the outcomes set out in the Bank's Conduct Standards [Fair Outcomes for Clients; Effective Financial Markets; Financial Crime Compliance; The Right Environment.] *\n• Effectively identify, escalate, mitigate and resolve risk, conduct and compliance matters\nKey Stakeholders\n• Group & Country product managers\n• Regional Trade CoEs\n• DCDA channels, platforms & Data teams\n• Trade operations\n• Trade Sales\n• RFOs ( Operational Risk, Credit, CFCC, Fraud Risk)\n• Trade COO\n• SC Ventures\n• Trade Technology\n• Global Head of Trade\n• Trade Management Team\n\nOur Ideal Candidate\n• Required 10 years of trade finance/supply chain experience with 3-5 years of strong exposure in digital trade, digitisation & platforms in the Industry leveraging APIs, data/AI, etc with a bank and/or fintech players\n• Any Certifications in Trade finance, Digital Trade, Scrum Product Owner Certifications, Blockchain & cloud technologies, Data models, etc will be advantageous.\nApply now to join the Bank for those with big career ambitions.\n\nTo view information on our benefits including our flexible working please visit our career pages . We welcome conversations on flexible working. Corporate Banking", "extensions": ["11 days ago", "Full–time"], "detected_extensions": {"posted_at": "11 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9kdWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJTdGFuZGFyZCBDaGFydGVyZWQgQmFuayIsImNvbXBhbnlfbWlkIjoiL20vMDJoc3prIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoia2k1OXhveXBEZ3FfMVVreEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZZQkNyY0JRVTVWWDA1eFV6bEVTMDR3ZEZkU2FHUlpUMngxWDBzNFgwZENNRjkwYUZwdlExWkxZVTF0Tm0wM09HUnFhVEpYTUZNelpEaEJMV3htU0dnMlgyVmxiRE5YWkVWc1RtVkRaVzB0TTIwMFoxOHlaMVZ0VnpocVNHVkJNalZsUjBOaE5tVkVjSEpETWpkaWIwVkRXa1ZPTVRrdGFFMVZVVWhIUW5ORU1UVlpYMHRaWTBWU1UyOHdjR2MxTFhaUFZFeFdjRms1YlZndFEyRlBhbUZsWjNCc1kzVkJjWGhLTFRRdFpHUk5VMFYxZGpBMFVURjRUVEZSRWhad1dIRkRXVkF6ZGtoaFdIUjBVV0Z0TkZsMWQwUjNHaUpCVDAxWlVuZEJUM1l3YlhCemNFMVNablk1WDNSM1IwUTNSR2hhWTFGUlZuUjMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY180OSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMYWltb29uLmNvbSIsImxpbmsiOiJodHRwczovL2pvYnMubGFpbW9vbi5jb20vam9icy9leHRlcm5hbHZpZXcvMjU4MTQ4NzY/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "MANAGER", "company_name": "Jkk Technologies Pte. Ltd", "location": "Singapore (+1 other)", "via": "via Jobs | Fidanto", "description": "Show recruiters you're immediatley available for job opportunities Posted On: 3 days ago Total Views: 4 Total Applications : 1 Job Id: 27595965 Permanent Job Job Description· Key responsibilities include using data analytics and determining new strategies to make production processes more efficient· managing team resources and balancing between production requirement and manpower resources; and integrating quality principles and methodology to enhance the organisation’s engineering performance. Besides driving innovative practices,· Manager also reviews manufacturing processes to reduce working capital and optimise inventory levels.· Analyse data for business insights identification.· Determine priorities dynamically and set planning assumptions for work in progress levels by product, cycle time and yield.· Integrate quality principles and methodology to enhance engineering performance.· Manage the innovation practices in the organisation.· Resolve workplace grievances and disputes.·... Design public address system integrate to fire alarm system· Design AV system integrate to video wall systemFacilities Management · Includes issues related to Health, Workplace Safety, Fire Safety, Security and Environment · Develop infrastructure developmental and maintenance plan · Monitor utilities usAs the General Manager (Area Manager), the incumbent is responsible for management of aftersales service of Compressors & Steam Turbines in South East Asian & Oceanian Countries. The incumbent is alsoJob Description: * To manage Integration sections respectively to ramp up and stabilize new technologies/ processes and products in terms of process control modules (PCM) yield, product yield and r- Renewable energy sea transportation expertise - Trouble shooting of logistical supply chains and project planning - Managing projects from tendering , conception through to its completion - LoadiResponsibilities * Manage a multi-institutional research programme and act as a liaison between the research teams and stakeholders * Monitor and track the progress of the programme to ensure a Responsibilities · Fully responsible for lab management, report lab operation to HQ regularly. · Schedule the work activities of laboratory employees，evaluate employees performance appropriately. WILHELM HAUFFMANN & COMPANY PTE. LTD. Wlhelm Hauffman is wholly owned subsidiary of Borden Eagle Singapore Pte. Ltd for Eagle Brand consumer health products () The company main activities are in resProduction Manager Office furniture store looking for production manager able to do uphostery of chairs and sofa. Prefered Applicant with skills or in uphostery industries before. Your Responsibilities: * Be the driving force behind Razer’s global Environment, Sustainability and Governance initiatives, by partnering with relevant departments and stakeholders across the organESSENTIAL DUTIES AND RESPONSIBILITIES include but not limit to the following. Other duties may be assigned. · Manage technical and commercial scope and provide a coherent engineering package to obtaiGive your career a boost with Monster's resume services.Simple body text this will replace with orginal content Toll Free No: +8001-012-339 91-40 66116994", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJNQU5BR0VSIiwiY29tcGFueV9uYW1lIjoiSmtrIFRlY2hub2xvZ2llcyBQdGUuIEx0ZCIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiSmZOU3EyY3FxNzN3ODZfcUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIHwgRmlkYW50byIsImxpbmsiOiJodHRwczovL3NnLmZpZGFudG8uY29tL2pvYnMvam9iLW9wZW5pbmcvbWFuYWdlcnMtYWxsLW90aGVyL21hbmFnZXItMjc1NDg2NTQyP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Product Policy Manager, Feature", "company_name": "TikTok", "location": "Singapore", "via": "via Bayt.com", "description": "TikTok is the leading destination for short-form mobile video. Our mission is to inspire creativity and bring joy. Building a world where people can safely discover, create and connect. The Trust & Safety team at TikTok helps ensure that our global community is safe and empowered to create and enjoy content across all of our applications. What will I be doing?\n- Identify safety risks in product feature domains, e.g. livestream, search, account, comment etc., and leverage policy solution to effectively address the risks\n- Collaborate with Product Policy, Global Public Policy, Product, Operations, Legal, and Public Relations teams to build consensus on global feature policies and processes\n- Streamline cross-functional workflow to optimize policy implementation\n- Provide prompt and professional input from the user safety perspective to support new product feature launches\n- Identify safety risks in product features and leverage policy solution to effectively address the risks;\nWhat... should I bring?\n- 3-5 years of experience in policy development, specifically regarding technology/internet/social media/content\n- Bachelors degree in public policy, politics, law, economics, communications, behavioral sciences or related field\n- Excellent oral and written communications with the ability to translate complex challenges into simple and clear language and persuade between multiple levels\n- Strong analytical reasoning, execution, and project management skills\n- Experience working with international partners across different time zones and cultures Preferred Qualifications\n- Advanced degree in a related field\n- Experience working in the trust and safety industry for tech companies\n- Experience working on live-streaming, account, comment, or search related safety issues TikTok is committed to creating an inclusive space where employees are valued for their skills, experiences, and unique perspectives. Our platform connects people from across the globe and so does our workplace. At TikTok, our mission is to inspire creativity and bring joy. To achieve that goal, we are committed to celebrating our diverse voices and to creating an environment that reflects the many communities we reach. We believe individuals shouldn't be disadvantaged because of their background or identity, but instead should be considered based on their strengths and experience. We are passionate about this and hope you are too", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9kdWN0IFBvbGljeSBNYW5hZ2VyLCBGZWF0dXJlIiwiY29tcGFueV9uYW1lIjoiVGlrVG9rIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJwZ2hSem40Y25WSjc2cUxSQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJheXQuY29tIiwibGluayI6Imh0dHBzOi8vd3d3LmJheXQuY29tL2VuL3NpbmdhcG9yZS9qb2JzL3Byb2R1Y3QtcG9saWN5LW1hbmFnZXItZmVhdHVyZS01ODIwNjg4OC8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Program Manager", "company_name": "Autodesk", "location": "Singapore", "via": "via Glassdoor", "description": "Job Requisition ID #\n\n21WD46508\n\nPosition Overview\n\nAutodesk is seeking a highly motivated and experienced Program Manager to join SPG Engineering and be a part of the Identity Domain. This role will be instrumental in program managing the product management, engineering and experience design efforts as well as engaging with the many product teams across Autodesk who are impacted by our move to a new Identity Platform. You will drive program execution, coordinating issues, tracking schedules and monitoring deadlines. You will play a key role is communicating between the Singapore based team and the senior managers based in the US. You will be joining an energetic and engaged team to support Autodesk’s transition to a new Identity Platform which will support customers and partners (external users) as well as employees and contractors (internal users). We are focused on delivering best in class capabilities to enable Enterprise Single Sign On (SSO), Modern Authorization and an... integrated in-product User Sign In. The strategic value of this initiative is high and our success is critical to the company.\n\nResponsibilities\n• Drive planning and execution for programs within the Identity Domain\n• Coordinate schedules and dependencies across multiple scrum teams\n• Track program issues and action items and drive them to closure\n• Monitor deadlines and hold the team accountable to deliverable commitments\n• Facilitate the Identity Execution Sync Up meeting which engages 3 functions and 5 scrum teams; publish notes and track action items\n• Coordinate the partnerships with internal teams who integrate the solutions delivered by the Identity Domain\n• Monitor dates, track completion and triage issues from our internal product partners\n• Engage the US-based management team with the Singapore-based teams to provide a smooth flow of communication across the ocean\n• Drive communication with internal customers and stakeholders\n• Create and maintain the Identity SharePoint site to share essential information with our internal product partners\n• Manage people and resource through others; part of cross-functional team required to complete the program/project.\n• Manage issues and risks at the project and program level\n\nMinimum Qualifications\n• 8+ years of project/program management experience\n• Bachelor’s degree or equivalent\n• Demonstrated success leading large, complex projects and / or programs across teams or organizations, often working on multiple projects simultaneously\n• Experience as a leader in an agile environment\n• Experience working on programs driving multiple scrum teams to a common goal\n• Demonstrated bias for actions & results, with strength in problem solving & issue-resolution\n• Strong leadership, communication, and influencing skills\n• Comfortable negotiating and driving timely decisions within and across teams\n• Excellent meeting facilitation skills\n• Excellent information radiator who tailors messages to the audience and medium to effectively keep everyone informed\n• Proven ability to collaborate with remote and international teams\n\nPreferred Qualifications\n• Agile certifications\n• PMP or PgMP certification\n• Experience using Jira Issue & Project Tracking Software or similar software\n• Experience using Confluence Wiki\n\n#LI-POST\n\nAt Autodesk, we're building a diverse workplace and an inclusive culture to give more people the chance to imagine, design, and make a better world. Autodesk is proud to be an equal opportunity employer and considers all qualified applicants for employment without regard to race, color, religion, age, sex, sexual orientation, gender, gender identity, national origin, disability, veteran status or any other legally protected characteristic. We also consider for employment all qualified applicants regardless of criminal histories, consistent with applicable law.\n\nAre you an existing contractor or consultant with Autodesk? Please search for open jobs and apply internally (not on this external site). If you have any questions or require support, contact Autodesk Careers ", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9ncmFtIE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJBdXRvZGVzayIsImNvbXBhbnlfbWlkIjoiL20vMDE4bm0zIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoieXd3b25vclRjSXJPME43WEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFZHWXpObkptVDJoc1RYQnRjWEJRVlZWeU1FUkVRMDVTU2kxTFFuUnplSEpKTFdOQ1duUkJTVkUyUTBoRGJXbDZVRFpKWTJ4TmVtOXBSekJDWVVsVVIyTk9WMUozTW5reFQwVkRhRGt6WlVwVldqZ3RaSE5LWjFnMFdGRk9WWEZxWDI5cGQwMUZPVXRtTmxsdVNFVTBjR28wUkVseVV6Vm1SM1V4Y2xNd2FsSjRSRlJyVFZWTFdHeExUekExUm1jd1ZGcFlRWEI0YlVoSGNHcDNFaFp3V0hGRFdWQXpka2hoV0hSMFVXRnRORmwxZDBSM0dpSkJUMDFaVW5kQlRrZHpTVmt5VUhsQllVUmlhVlZvYldoSE9GQjFRbTFpTVUxQiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzY0IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEdsYXNzZG9vciIsImxpbmsiOiJodHRwczovL3d3dy5nbGFzc2Rvb3Iuc2cvam9iLWxpc3RpbmcvcHJvZ3JhbS1tYW5hZ2VyLWF1dG9kZXNrLUpWX0lDMzIzNTkyMV9LTzAsMTVfS0UxNiwyNC5odG0/amw9NDAxMzk0MjcxNFx1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Management", "value": "GC18"}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Business Operations", "value": "GC06"}, {"text": "Advertising and Marketing", "value": "GC03"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Accounting and Finance", "value": "GC01"}, {"text": "Legal", "value": "GC17"}, {"text": "Farming and Outdoors", "value": "GC13"}, {"text": "Human Resources", "value": "GC15"}, {"text": "Sales and Retail", "value": "GC26"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "Product manager", "value": "product manager"}, {"text": "Manager", "value": "manager"}, {"text": "Project manager", "value": "project manager"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Development manager", "value": "development manager"}, {"text": "Director", "value": "director"}, {"text": "Manufacturing manager", "value": "manufacturing manager"}, {"text": "Marketing manager", "value": "marketing manager"}, {"text": "Plant manager", "value": "plant manager"}, {"text": "Production manager", "value": "production manager"}, {"text": "Program manager", "value": "program manager"}, {"text": "Regional", "value": "regional"}, {"text": "Senior", "value": "senior"}, {"text": "Sr. manager", "value": "sr. manager"}, {"text": "Account manager", "value": "account manager"}, {"text": "Admin manager", "value": "admin manager"}, {"text": "Affairs manager", "value": "affairs manager"}, {"text": "Assistant", "value": "assistant"}, {"text": "Brand manager", "value": "brand manager"}, {"text": "Commodity manager", "value": "commodity manager"}, {"text": "Communication", "value": "communication"}, {"text": "Customer", "value": "customer"}, {"text": "Dealer", "value": "dealer"}, {"text": "Devops engineer", "value": "devops engineer"}, {"text": "Engineering", "value": "engineering"}, {"text": "Executive", "value": "executive"}, {"text": "Product specialist", "value": "product specialist"}, {"text": "Production supervisor", "value": "production supervisor"}, {"text": "Risk manager", "value": "risk manager"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Transactional", "value": "transactional"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Internship", "value": "INTERN"}, {"text": "Part-time", "value": "PARTTIME"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Toiletries", "value": "/business/naics2007/3256"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Foods & Beverages", "value": "/business/naics2007/311"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Management", "value": "/business/naics2007/55"}, {"text": "Research", "value": "/business/naics2007/5417"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "Citi", "value": "/m/01dfb6"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "Amazon", "value": "/m/0mgkg"}, {"text": "Binance", "value": "/g/11hcz1r4wl"}, {"text": "Standard Chartered", "value": "/m/02hszk"}, {"text": "United Overseas Bank", "value": "/m/04gjd1"}, {"text": "Apple", "value": "/m/0k8z"}, {"text": "Tata Communications", "value": "/m/04338k"}, {"text": "Workato", "value": "/g/11dxpy_3xd"}, {"text": "BNY  Mellon", "value": "/m/02vps5x"}, {"text": "DBS Bank", "value": "/m/01q7n5"}, {"text": "EPAM Systems", "value": "/m/0dlnrc"}, {"text": "GVT Government Technology Agency (GovTech)", "value": "/g/11gh0528nq"}, {"text": "Grab", "value": "/m/0134c_p9"}, {"text": "Paypal", "value": "/g/122s91_5"}, {"text": "PeopleSearch Pte Ltd", "value": "/g/11c73ngn0w"}, {"text": "Randstad", "value": "/m/08pt1z"}, {"text": "Singapore Airlines", "value": "/m/015f2x"}, {"text": "TEKsystems (Allegis Group Singapore Pte Ltd)", "value": "/g/11b6g4bkv0"}, {"text": "ABBOTT LABORATORIES (SINGAPORE ) PRIVATE LIMITED", "value": "/m/09m57z3"}, {"text": "ADVANCE INTELLIGENCE PTE. LTD.", "value": "/g/11dymfkxss"}, {"text": "AXA", "value": "/m/04mn99"}, {"text": "Adecco Personnel Pte Ltd", "value": "/m/08gz46"}, {"text": "Adidas Group", "value": "/m/01jtml"}, {"text": "Aetna, a CVS Health Company", "value": "/m/0kg8x"}, {"text": "Agency for Science, Technology and Research", "value": "/m/0gmjcg"}, {"text": "Alibaba", "value": "/m/07s6ctl"}, {"text": "Argyll Scott", "value": "/g/11dxpk2374"}, {"text": "Autodesk", "value": "/m/018nm3"}, {"text": "Barry Callebaut", "value": "/m/03clky2"}, {"text": "BioMind", "value": "/g/11dymfr2l6"}, {"text": "CHUBB ASIA PACIFIC PTE. LTD.", "value": "/m/09m8xyh"}, {"text": "Cargobase", "value": "/g/11dxppfsjn"}, {"text": "Cargobase Pte Ltd", "value": "/g/11fy240nxm"}, {"text": "DKSH", "value": "/m/0dj2nh"}, {"text": "Dathena", "value": "/g/11dxprdn6y"}, {"text": "Dyson", "value": "/m/05cskg"}, {"text": "Enggsol Pte Ltd", "value": "/g/11g9mnfmm1"}, {"text": "Ethos BeathChapman", "value": "/g/11c73z0xm0"}, {"text": "Eu Yan Sang", "value": "/m/03cl9hn"}, {"text": "Flintex Consulting Pte. Ltd.", "value": "/g/11h1z41pzb"}, {"text": "GIVAUDAN SINGAPORE PTE LTD", "value": "/g/11f00wn519"}, {"text": "Goldman Sachs", "value": "/m/01xdn1"}, {"text": "GovTech Singapore", "value": "/g/11dxpkfs_6"}]}]}