{"search_metadata": {"id": "608278fe359e9927aed96515", "status": "Success", "json_endpoint": "https://serpapi.com/searches/08082c9133132582/608278fe359e9927aed96515.json", "created_at": "2021-04-23 07:36:30 UTC", "processed_at": "2021-04-23 07:36:30 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28system+analyst%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=20", "raw_html_file": "https://serpapi.com/searches/08082c9133132582/608278fe359e9927aed96515.html", "total_time_taken": 2.28}, "search_parameters": {"q": "(system analyst) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "20"}, "jobs_results": [{"title": "Technical Lead  Business System Analyst  Developers (J2EE)", "company_name": "Jobline Resources Pte Ltd", "location": "Singapore (+1 other)", "via": "via Jobs | Fidanto", "description": "Responsibilities\n\nThe Business System Analyst is responsible to gather, analyse and formalise user’s business requirements and processes . Lead technically for overall project implementation .\nTo provide application architecture design to system implemented on JavaEE environment. Gather, analyse and formalise user’s business requirements and processes, evaluate on feasibility of implementation and manage scope of project.\nDevelop technical design specification and translate technical design into process/program specification. Involve in the design review session.\nAssist in Prepare project documentation such as Requirement Specifications/Use Case Specifications etc Adhere to project scope, update requirement traceability matrix, inform and record out-of-scope issues\nTo review detail technical design provided by deliveryf team.\nTo provide technical guidance to delivery team.\nTo perform code review and address coding issue affecting system performance and security..\nTo provide support in... system performance testing by identifying system performance bottleneck and providing performance tuning advise\nTo provide analysis and resolution of production system reliability and performance issue\nTo front customer technical engagement in technical review meetings, project management committee and project steering committee\nMake changes to configurable items, which include hardware, software, documentation, etc.\nParticipate in Coding and Code Review. Assist in the integration testing, system testing, User Acceptance Test & implementation activities.\nProvide post implementation support (including production support and service requests).Requirements\n\nAbove 7-10 years’ experience in working with Java J2EE .\nMin 4 Years of experience as Technical lead for complex web & web mobile applications.\nIn-depth experience with MVC architecture, J2EE, Java, Webservices,RESTFul services,\nStrong software development skills, good understanding of object oriented concepts & design patterns.\nSelf-motivated with an ability to work in cross platform technologies and to work on more than one project at a time.\nHands on experience in Angular 4/6, JQuery,JSON.\nIn-depth Experience with MySQL, MariaDB and Oracle databases.\nIn depth on Experience with Unix, Linux.\nGood Experience MySQL, Maria DB ,Oracle databases. Ability to handle/Guide team on SQL tuning.\nCertified in Java,J2EE.\nHands on Experience of project initialization, execution with key emphasis on Analysis, Architecture Design and Testing of the application.\nShould be able to propose the solution for new project requirement, and able to present the solution to business users and end customers.\nAble to do in-depth analysis and document the system requirements .\nExtensive working experience in analysing requirements and executing projects related to JAVA/J2EE Technology.\nStrong team player with excellent inter-personal skills.\nAbility to meet deadlines with no compromise on the quality of the work product.Candidates will be offered a Permanent / Direct Contract role, based on assessment", "extensions": ["3 days ago", "$2,882 a year", "Contractor"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Contractor", "salary": "$2,882 a year"}, "job_id": "eyJqb2JfdGl0bGUiOiJUZWNobmljYWwgTGVhZCAgQnVzaW5lc3MgU3lzdGVtIEFuYWx5c3QgIERldmVsb3BlcnMgKEoyRUUpIiwiY29tcGFueV9uYW1lIjoiSm9ibGluZSBSZXNvdXJjZXMgUHRlIEx0ZCIsImNvbXBhbnlfbWlkIjoiL2cvMTFncDI2NDdwbiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IkFLdTJVakhJbGdjOE05NVJBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVvc0NDc3dCUVU1VlgwNXhVWGhLVVU1WlVEWlRZV05qT1hoWVNFSjFTVk10VjAxbWMzTnpWa05aYVZkU2FURk5Ra05TYlhsMldGaGhXbGhFVVdoSmFGUlZkSFpUWVhGQlNVRnRhWEZxVkdkeFRVeDFaMFp1Y0ZGaU9UbHFZbGhmTmpZNVRFSmhOMWxZUVhaUVQwWnJaMHByZUdwYWVIVjRiM0JRTFVGNVMzSjVTa1pTTUhsc2RIaFRUeTFwUVV4T1NuZDZRVUZtUjBveWJHSjJURFJCWlZvMVZIVnZaemxrUkVNM2JsQlROSEJOYVZGS05VUnlhRjlrVDNkR1NraFBNbFo0WjBaeWJGOWpOa2RDZWs5Sk5qbEVFaFpCU0cxRFdVbEVia1J2WmxKMFVXRm5lVXB5WjBKUkdpSkJUMDFaVW5kQk9VVlNaM0JRWDJ0WU5EZEZYelZCYVZOVlJFTklTMlZtTUhKbiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzciLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9icyB8IEZpZGFudG8iLCJsaW5rIjoiaHR0cHM6Ly9zZy5maWRhbnRvLmNvbS9qb2JzL2pvYi1vcGVuaW5nL2J1c2luZXNzLWludGVsbGlnZW5jZS1hbmFseXN0cy90ZWNobmljYWwtbGVhZC1idXNpbmVzcy1zeXN0ZW0tYW5hbHlzdC1kZXZlbG9wZXJzLWoyZWUtMjc3MzYyMjQ3P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Systems Analyst - Manage - Get Help - Software Engineering", "company_name": "M1 Limited", "location": "Singapore", "via": "via Monster", "description": "You will work in a Software Engineering & Architecture team to\n• Deliver rapid, value-driven solutions for complex business requirements\n• Leverage native Salesforce/Vlocity functionality to deliver user requirements quickly with minimal customization\n• Responsible for turning the program design of our Solution Architects and Technical Architects into a configured solution that meets the business needs\n• Work predominantly in Agile scrum teams, building out complex business processes using native Salesforce/Vlocity technology and platform\n• Be involved in all phases of the project lifecycle - from low-level design and development through to integration testing, deployment and post-production support\n\nRequirements\n• Bachelor’s degree in Computer Science or equivalent discipline\n• Certified Salesforce and Vlocity Platform Developer\n• Preferably 4-6 years of working experience in software engineering teams, ideally using Agile development techniques\n• Competent in Java, SOAP APIs, REST... (JSON, XML), data and process modelling tools\n• Hands-on experience in Salesforce (Apex, VisualForce, Lightning, SOQL) and Vlocity (Card, Omniscript, Integration Procedure, XOM) will be an advantage\n• Understanding of best practices in Coding Standards, Deployment, Integration and Security implementations\n• Familiar with deployment/packaging using Metadata API and ChangeSet\n• Proven track record of successful delivery of enterprise projects, preferably in CRM implementations in the telco industry\n• Ability to perform under pressure and tight deadlines\n• Excellent communication and interpersonal skills, comfortable with leading a discussion and doing a technical presentation\n• Candidates with the relevant educational qualification but without prior experience are also welcome to apply", "extensions": ["21 days ago", "Full–time"], "detected_extensions": {"posted_at": "21 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTeXN0ZW1zIEFuYWx5c3QgLSBNYW5hZ2UgLSBHZXQgSGVscCAtIFNvZnR3YXJlIEVuZ2luZWVyaW5nIiwiY29tcGFueV9uYW1lIjoiTTEgTGltaXRlZCIsImNvbXBhbnlfbWlkIjoiL20vMDVuNDg2IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiVkUwSlFoX1hwZE92dzhwS0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFZIaDFXbXR6UkhOQlZVeHZNV0ZCZEdaRU56SlRNbFptVURCUlJFUTNlREpPU0ZKdWNISmliRkY0U25wSExVcEVTVXhYYlhCbmRGbFpjRGQ2YVRaSmRXeG9TbkJqTFVvd1V6Qm5NM1ZpYnpFM01GWlZOamd6V2tsRGRISmhWalZDZUU1WVJVMXdaMHAxVkd4RWJEZHVNbVpSYVc5SlJ5MVROVUpuVERoM1dWbFBMV3huZFhCbE5HSndSbEJFVlhwYVVVWlFNa3hvYVVGTVl6WkJFaFpCU0cxRFdVbEVia1J2WmxKMFVXRm5lVXB5WjBKUkdpSkJUMDFaVW5kRVlXTnVRbkJqYjNrNFJucHdYMEUzY1VKb1RtbFJiMVpFUnpOQiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzE1IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1vbnN0ZXIiLCJsaW5rIjoiaHR0cHM6Ly93d3cubW9uc3Rlci5jb20uc2cvYW1wL2pvYi12YWNhbmN5LXN5c3RlbXMtYW5hbHlzdC1tYW5hZ2UtZ2V0LWhlbHAtc29mdHdhcmUtZW5naW5lZXJpbmctbTEtbGltaXRlZC1zaW5nYXBvcmUtMjc1NjI0NzcuaHRtbD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior IT Analyst", "company_name": "Asia Innovatory Management School", "location": "Singapore", "via": "via Glints", "description": "Job Responsibilities:\n• Manage assigned projects to deliver services in accordance with established objectives\n• Analyse the proposed solutions to identify any enhancement opportunities to resolve any performance gaps\n• Assist in problem resolution and bug fixes\n• Provide root cause analysis and system resolution\n• Assess the impact of new requirements and enhance the system\n• Developing new applications based on user’s requirement\n• Evaluate existing system & business requirement for improvement and efficiency\n• Conduct training and workshop with business users\n\nJob Requirements\n• The Candidate shall possess at least a bachelor’s degree in Information Technology (IT), Computer Engineering, Computer Science, or equivalent.\n• The Candidate shall have a minimum of FIVE (5) years working experience in the IT industry, with exposure to end-to-end software development lifecycle (SDLC), system analysis and design, application development, and operational support and maintenance.\n• Certified... in Amazon Web Services like AWS Certified Cloud Practitioner or better. Please provide verifiable evidence, like YourAcclaim.com, or equivalent.\n• Preferred to be certified in Microsoft Azure platform. Please provide verifiable evidence, like YourAcclaim.com, or equivalent.\n• Preferred to have experience or certification in Google Cloud services. Please provide verifiable evidence, like YourAcclaim.com, or equivalent.\n• Preferred to have working experience with container technology like Docker, Docker Swarm, or Kubernetes.\n• Proficient in C# (NET), or equivalent C-based programming language like PHP, PERL, C++, and C.\n• Proficient in front-end technologies, like HTML5, jQuery, JavaScript, and CSS.\n• Preferred to be experienced with front-end framework like Angular, AngularJS, REACT, or equivalent.\n• Preferred to have working experience with NodeJS.\n• Proficient in SQL technology like MSSQL, MySQL, PostgreSQL, MariaDB, or equivalent and be proficient in writing optimized SQL queries or stored procedures.\n• Preferred to have working experience with NoSQL like MongoDB, CouchDB, DynamoDB, or equivalent.\n• Working experience in Service Oriented Architecture (SOA) by having integrating application using SOAP or REST services before.\n• Preferred to have working experience with chatbot technology like Dialogflow, Google Action, LUIS. WIT.AI, AWS Lex, or equivalent.\n• Preferred to have working experience in continuous integration and continuous delivery like Jenkin, Spinnaker, Bamboo, CodePipeline, or equivalent.\n• Preferred to have working experience with Content Search technology like Alfresco Content Management System, EBSCOHOST Discovery Services, Google Enterprise Search, CloudSearch, Apache Solr/Lucene, or equivalent.\n• Preferred to have working experience with EZProxy access and authentication software.\n• Preferred to have working experience in agile projects using SCRUM, or equivalent", "extensions": ["10 days ago", "Full–time"], "detected_extensions": {"posted_at": "10 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgSVQgQW5hbHlzdCIsImNvbXBhbnlfbmFtZSI6IkFzaWEgSW5ub3ZhdG9yeSBNYW5hZ2VtZW50IFNjaG9vbCIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiLVJyS1NlRUNYSFVOaUs1bEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBHbGludHMiLCJsaW5rIjoiaHR0cHM6Ly9nbGludHMuY29tL3R3L29wcG9ydHVuaXRpZXMvam9icy9zZW5pb3ItaXQtYW5hbHlzdC9lMTcyMGYxNy1iMDM3LTRiNDMtOTdmZC0wNjJiMGQ0N2Q1ODM/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Systems Analyst (Global Service Incident Manager - AP)", "company_name": "VISA", "location": "Singapore", "via": "via Bayt.com", "description": "Job Description and Responsibilities\n\nQualifications", "extensions": ["1 month ago", "Full–time"], "detected_extensions": {"posted_at": "1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTeXN0ZW1zIEFuYWx5c3QgKEdsb2JhbCBTZXJ2aWNlIEluY2lkZW50IE1hbmFnZXIgLSBBUCkiLCJjb21wYW55X25hbWUiOiJWSVNBIiwiY29tcGFueV9taWQiOiIvbS8wMWtxam4iLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJkWUs1di1JeTRra1lWN1BjQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFc3NCQ293QlFVNVZYMDV4VVhSamFqUXpRazlUTXkxelIzbHlkRkJ3UVVGdmJHaDFRM2xOVDNGRWNIZHVOVTFrUkZoRlUxTkdhMVUzYjJGNWR6SndSMDAxTW0wdFdsZGpRV1JPZUZkYVJHd3RTRWxtY1VkUloySkxXRkZYUlhaRVozWnZSalZTTW5sVk4yeHBTSFYyVkcxWVR6UkJhbVphWW01eVNEa3phRmh5WVZkdlZsQldlSGQxUzFaNFYybzBjSFlTRmtGSWJVTlpTVVJ1Ukc5bVVuUlJZV2Q1U25KblFsRWFJa0ZQVFZsU2QwTkNVSE5RYkdkUGVIZHRNSHAzTlVVeE1uRkpVM0pLVm13d1NtYyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzI5IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJheXQuY29tIiwibGluayI6Imh0dHBzOi8vd3d3LmJheXQuY29tL2VuL3NpbmdhcG9yZS9qb2JzL3N5c3RlbXMtYW5hbHlzdC1nbG9iYWwtc2VydmljZS1pbmNpZGVudC1tYW5hZ2VyLWFwLTU5MjE4NDE2Lz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Finance Systems Analyst - Digital Venture", "company_name": "Standard Chartered Bank", "location": "Singapore", "via": "via Neuvoo", "description": "Finance Systems Analyst - Digital Venture-(2100001097)\n\nJob\n\n:Finance\n\nPrimary Location\n\n:Asia-Singapore-Singapore\n\nSchedule\n\n:Full-time\n\nEmployee Status\n\n:Permanent\n\nPosting Date\n\n:08/Apr/2021, 5:13:39 AM\n\nUnposting Date\n\n:10/May/2021, 6:59:00 PM\n\nWe're looking for a Finance Systems Analyst (BA) to work onsite within our Digital Venture office. We're a small, but growing venture, with new and exciting problems to solve. We work in project-based sprints in small, interdisciplinary teams.\n\nAs a Finance Systems Analyst (BA) you'd be able to work on and solve some of the many interesting challenges we are facing, learn new ways of working, and build delightful high quality products for our customers.\n\nJob Description\n\nAs a Finance systems Analyst, you are a key member of our Finance Team responsible for business analysis and requirements gathering. Partnering with the Technology team to drive the design and implementation of the Finance & Treasury systems across Accounting GL, Capital ... Liquidity monitoring, Financial & Regulatory reporting, you will be the glue in a multidisciplinary team, helping to drive alignment across Product, Technology, Operations and Finance, adapting as our needs change and our organisation matures. You will lead by example in an approach that is based on Building, Learning and rapidly Adapting.\n\nThe Role Responsibility:\n• Being a licensed bank, we need to fulfil all the statutory requirements, which includes (but not limited to) capital and liquidity, balance sheet, cash flows, P&L, tax, and treasury. You will work with the CFO to champion the selection and implementation of the finance and treasury systems for the organization, by collaborating with the Technology team.\n• As the Business Analyst, you will also drive alignment with other teams (Technology, Product, Operations and Risk) to ensure finance requirements are laid out\n• Adopt and contribute to a coherent and uniform approach to business analysis, mapping processes into a single, consolidated repository\n• Understand end-to-end flows within our solution design, recognising and calling out up and down stream impacts\n• Own the definition of quality for analysis output for Finance Team’s delivery components\n• Assist with creating proposals for new business opportunities\n• Define, manage and track budgets and work plans\n\nRequired Skills :\n• 5+ years of experience working in a team implementing or supporting financial systems, with specific experience in gathering and defining requirements\n• A degree in a technical discipline (information systems, computer science, etc)\n• Practical experience in agile/SCRUM methodologies alike\n• Demonstrated financial and business process knowledge including accounting, procurement, financial back office functions, vendor management,\n• Ability to drive C-Level conversations on strategic themes within Finance (vision, operating models, organization, processes, systems, business partnering)\n• Experience working across large programs of work converging on requirements related to technology, operations, governance, legal and compliance\n• Proficiency in the usage of the underpinning frameworks and tools for business analysis documentation such as Confluence, Jira etc\n• Experience and knowledge to guide and inform Technology to ensure all aspects of requirements are considered in Technical Design\n• Exceptional attention to detail and strong technical intuition\n• The ability to manage time and schedules to meet aggressive deadlines and influence through persuasive written and verbal communication", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJGaW5hbmNlIFN5c3RlbXMgQW5hbHlzdCAtIERpZ2l0YWwgVmVudHVyZSIsImNvbXBhbnlfbmFtZSI6IlN0YW5kYXJkIENoYXJ0ZXJlZCBCYW5rIiwiY29tcGFueV9taWQiOiIvbS8wMmhzemsiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJsN1R0M0p3QjhQQlNVU0JCQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdllCQ3JjQlFVNVZYMDV4VkRsUGVIUmhTR3hmZHpSUGJVZHRTbUY0VG1kQmJrNUZWRmhOZFZoVlVrNUVkVzFGZDBoNFEwRklOMjVwWVRWcVV6STJlVTEwVkZoZmQybElVemx5VDBsT1oyTmllRWRpZEU0elRFbGhlWGxxYldKd2RUZHlSMU5VYm1VeVp6SkNOVlV5Y1Y5d1psSXRMVEptYURaTFNUbEtOMTlQY1c1U2NVTjJjMDE0UXpGbFN6VkViVVoxVkdwMWMwdFVUWFpyY1d0RVRXZFNUVkV6TjFGNFpUbEpjeTFLVHkxNVJIaENhRnB6UzA1eE5VZE5FaFpCU0cxRFdVbEVia1J2WmxKMFVXRm5lVXB5WjBKUkdpSkJUMDFaVW5kRFVFMTROa0ZEZHpWbWQxOURVRUZXZG5rellrSlNaakpEYmxKbiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzM2IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE5ldXZvbyIsImxpbmsiOiJodHRwczovL3NnLm5ldXZvby5jb20vdmlldy8/aWQ9MWEwNWFhYzU1YjcwXHUwMDI2dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Senior System Analyst", "company_name": "THE JAPAN RESEARCH INSTITUTE, LIMITED", "location": "Singapore (+1 other)", "via": "via MNC Jobs Singapore | MNC Jobs In Singapore", "description": "Roles & Responsibilities\n\nReporting to the Team Leader, the successful candidate will be responsible for managing projects for the company's clients.\n\nResponsibilities\n• Manage end to end delivery of project, define the project scope, detailed project plan and seek stakeholders agreement for sign off\n• Prepare other administrative documents where relevant during project initiation e.g. internal memo, budget application etc.\n• Track project status to ensure delivery is on track\n• Provide regular project updates to stakeholders\n• Prepare business requirement documents and review functional specifications prepared by developers to ensure accuracy\n• Draft UAT test plan, test cases and coordinate actual testing with users and vendors\n• Ensure timely resolution of issues raised by users during testing\n• Prepare for production release\n• Provide on-going maintenance support for existing reporting sytstems ie.e. production issues resolution, DR site setup, DR drill prepation and participation... adhoc regression testing for application as well as answering users' queries etc.\n\nRequirements\n• Degree in Computer Science / Information Technology / Finance\n• At least 5 years of proven experience in project management cum business analysis on MIS / Regulatory / Finance Reporting System projects in banking industry\n• Preferable certified in Project Management i.e. PMP, PRINCE2, and IT Service Management (ITILv3)\n• Preferable with good knowledge of Data Warehouse, IFRS-9 Basel-III, Risk Mangaement, Profitaility Management reporting\n• Experience in working closely with business users as well as the IT developers\n• Effective communicator with good interpersonal and negotiation skills\n• Strong analytical, troubleshooting, problem solving and documentation skills.\n• Proficient in SQL language, SDLC, MS Office\n• Proactive personality and willing to rise up to challenges[CANDIDATES WHO REQUIRE WORK PASSES NEED NOT APPLY", "extensions": ["15 days ago", "Full–time"], "detected_extensions": {"posted_at": "15 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU3lzdGVtIEFuYWx5c3QiLCJjb21wYW55X25hbWUiOiJUSEUgSkFQQU4gUkVTRUFSQ0ggSU5TVElUVVRFLCBMSU1JVEVEIiwiY29tcGFueV9taWQiOiIvZy8xMjE0bWdsbSIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6InpsYzBOTHg5T1lCN3Q3cjhBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVxRUNDdUlCUVU1VlgwNXhVMDloUkRaaVdWb3lRMFpJV0hwVmVHUTBhVzU0TUVWNVpuTllRM1pPY2tFM1l5MWpkazR5UVhkWmFqRTBVV1ZUYjFad1lVWTBUR3gxTUVSd1YxbENRa1I0YzBSR1pqVnhhMHRQTkVkU1pGWkhhMUo0YTBwV05uSkhYeTFFUXpWeVkxaDZSSFk0TmxsUFRrSm5WMnRZZDFCV1MzSXdhSFV4YlZOSFJGVjBjV1ZXUmswNWJsOHpNM05ZV0RsMFRGcHJlWFIwWmtoRmJXNXhWemMzYjNOS2QyNHdkbXAxWkZSa2RXMHpha05TWjA5elozTndTVWRzVTBwMGJIQllWMFJTWDBWV1lscFNVMkpZYm5wd1pISTFkelZRVFVaWmN5MTZSMUpRVVJJV1FVaHRRMWxKUkc1RWIyWlNkRkZoWjNsS2NtZENVUm9pUVU5TldWSjNRUzF3YjNWRU56SnRja1I0VlhKM2RIbzJhMmhLV1dOR2F6UjVVUSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzQ0IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1OQyBKb2JzIFNpbmdhcG9yZSB8IE1OQyBKb2JzIEluIFNpbmdhcG9yZSIsImxpbmsiOiJodHRwczovL3NnLm1uY2pvYnouY29tL2pvYnMvc2VuaW9yLXN5c3RlbS1hbmFseXN0LXNpbmdhcG9yZS0xMDIwNTY/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "SAP Business System Analyst - FICO<h1 style=\"text-align: justify;\"> </h1> <h1 style=\"text-align: justify;\"><st", "company_name": "BizLINKS Resources", "location": "Singapore (+1 other)", "via": "via BizLINKS Resources Pte Ltd", "description": "Our client, a global supply chain fulfillment organisation is looking to roll out SAP in the region including Chian\n\nJob Responsibilities:\n\nSupporting the construction phases of the business application and/or production support of SAP 5.0 implementation and participating in tier II or tier III support, you will:\n• Be involved in trouble shooting and resolution of user reported production issues\n• Works on several key SAP deliverables\n• Prepare documentation, case closure, knowledge transfer; as well as begin to acquire a broad understanding of the entire supply chain\n\nRequirement:\n• Degree in Accounting/Finance and SAP certification in FICO\n• Minimum 1 year of experience in business process and configuration\n• Minimum 3 years SAP implementation experience in FICO\n\nAPPLY for this post\n\nGeneral CV submission", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTQVAgQnVzaW5lc3MgU3lzdGVtIEFuYWx5c3QgLSBGSUNPXHUwMDNjaDEgc3R5bGU9XCJ0ZXh0LWFsaWduOiBqdXN0aWZ5O1wiXHUwMDNlIFx1MDAzYy9oMVx1MDAzZSBcdTAwM2NoMSBzdHlsZT1cInRleHQtYWxpZ246IGp1c3RpZnk7XCJcdTAwM2VcdTAwM2NzdCIsImNvbXBhbnlfbmFtZSI6IkJpekxJTktTIFJlc291cmNlcyIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoidk9kc3dqWEc1bk9nMlBOOUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCaXpMSU5LUyBSZXNvdXJjZXMgUHRlIEx0ZCIsImxpbmsiOiJodHRwczovL3d3dy5iaXpsaW5rcy5jb20uc2cvaW5kZXgucGhwL2pvYi1saXN0aW5ncy1tYWlubWVudS0yNy8xMy1pdC1qb2JzLzIxNS1zYXAtYnVzaW5lc3Mtc3lzdGVtLWFuYWx5c3QtZmljbz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Security System Analyst", "company_name": "Security & Risk Solutions Pte. Ltd.", "location": "GEMINI@SIMS (+1 other)", "via": "via Monster Singapore", "description": "The main responsibility of the Security Systems Analyst is to support the efficient operation of the physical security systems technologies within the APAC region led by the Security Systems Supervisor and its operating within the Security Operations Centre . These technologies include, Electronic Access Control, Video Surveillance Systems, intrusion detection systems, communication systems and other risk-based technologies or solutions.\n\nPrimary activities include:\n\nEnsures that routine maintenance undertaken in the APEC region maintains the systems integrity & reliability of its connectivity to the SCC by acting as 1st line support.\n\nReactively troubleshoots and supervises the remediation of any problems identified with any hardware or software within the APAC security portfolio either internally and via approved contracted companies where required.\n\nResponsible for auditing the documentation and administration of the system ensuring alignment of all configuration, drawings... programming to the company systems standards for the purpose of management, global/regional data compliance and audits.\n\nProvides end user training to SOC operators to efficiently utilise the system to monitor the APAC portfolio\n\nMain responsibilities\n\nProjects Works\n\no Commissions any system changes completed by approved third party contractors\n\no Programmes system configuration in accordance with documentation governed by the TWDC minimum security standards, target operating model, data protection requirements and local legislation\n\no Responsible for ensuring on-boarding to the SCC in an effective manner\n\no Support technical and application integrations across the APAC territory\n\nAudit & Compliance\n\no Regularly tests and validates system effectiveness in its detection and monitoring capabilities\n\no Validates and updates where required site documentation detailing changes, schematics, configuration and installed assets.\n\no Ensures minimal nuisance systems alarms\n\no Confirms with IT department necessary storage, LAN & WAN capacity for operational effectiveness and redundancy capability\n\nService Management\n\no Manages GA case load received from multiple sources and locations and monitors time to resolution\n\no Scheduling of resources to minimise disruption to TWDC business.\n\no Oversees any reactive maintenance to be conducted as required in accordance with procedures set by TWDC.\n\no Monitors service performance against respective Service Level Agreements\n\no Ensures resources comply with necessary procedures and requirements of sites to complete remediation works.\n\no Validates resolutions of third party in accordance with TWDC standards and contractual requirements\n\no Ensure, in cooperation with the approved contracted companies, that sufficient spares are on hand throughout the region, to allow for continued operation of systems should an equipment failure occur;\n\nPeople Management\n\no Daily management of contacting companies and internal stakeholders involved with systems;\n\no Have a full understanding of the functions covered at all sites including areas such as Security, CCTV, Reception and systems Support;\n\no Ensure adequate skill sets of all security staff to efficiently identify faults locally or virtually within the system\n\nSystem Innovation\n\no Respond to changes in the external environment including legislation, technology and trends.\n\nOperations Management\n\no Report on a daily basis with management to ensure effective communication of all systems matters to ensure the delivery of a high standard professional security service;\n\no Ensure all staff are trained to carry out their systems duties in accordance with procedures and policies;\n\no Work in partnership to raise the profile of security and fire prevention by attending meetings with service partners;\n\no Investigate incidents and prepare responses in accordance with policies and procedures;\n\no Understand drivers behind systems failures and to take steps to minimise losses.\n\nOther Duties\n\no Be aware of policy and procedures owned and changed from time to time by APAC;\n\no Be aware of policy and procedures owned and changed from time to time by the client.\n\nAny additional reasonable duties requested by operational management (APAC Contract Manager, APAC Technical Manager, APAC Security System Supervisor, TWDC Security Systems Senior Manager APAC).\n\nOther duties and responsibilities\n\nWork in accordance with:\n\no Security & Risk Solutions(SRS) policies, site procedures and training provided\n\no Customer policies\n\nCarry out any other reasonable request as required by your Line Manager or the Customer.\n\nHealth and Safety responsibilities\n\nEnsure work is carried out in accordance with site/department procedures and training provided.\n\nComply with the Health and Safety Policy, procedures and protocols at all times;\n\nEnsure you have received the required training prior to commencing works;\n\nEnsure that you are working in accordance with the safe system of works, as briefed by your Line Manager;\n\nEnsure that you are fit for work prior to reporting for duty each day;\n\nReport any health and safety concerns to your line manager;\n\nOnce Personal Protective Equipment (PPE) has been issued ensure that you keep it serviceable at all times and report any defects to your line manager;\n\nAlways ensure while at work you are wearing the correct PPE;\n\nIf you are operating machinery/plant/vehicles you must operate safely in accordance with the instruction and training provided;\n\nSet a good example at all times;\n\nJob specific\n\no Reporting immediately to the Contract Manager any action or inaction which compromises safety;\n\no Maintain a healthy and safe place of work, ensuring all posts are in a clean and tidy condition at all times;\n\no Report missing, damaged or unserviceable equipment to the Contract Manager;\n\no Co-operate with APAC and the client so that the company can carry out its statutory duty under Health & Safety policies and all relevant statutory provisions;\n\no Not intentionally or recklessly interfere with or misuse any property, equipment IT hardware or systems in the interest of Health & Safety and Welfare.\n\nRequired skills & Experience\n\nEssential\n\nAbility to meet all vetting requirements;\n\nBackground in Security Systems Management;\n\nWorking knowledge in providing security solutions;\n\nEffective interpersonal & communication skills;\n\nExperience of issue and conflict resolution;\n\nAbility to work under own initiative, making decisions to benefit APAC and client;\n\nExperience with raising work orders;\n\nCompetent on Microsoft Word/Excel/Outlook/PowerPoint;\n\nExperience and good working knowledge of the following:\n\no Computer Networking and IT systems administration;\n\no Video Surveillance (FLIR/Genetec);\n\no Access control (Lenel, Lobby works, Galaxy);\n\no Reporting software (Global Aware);\n\no Mass notification systems (TRIS, ANVIL, 360, EVERBRIDGE).\n\no Control room SOP’s\n\nDemonstrate the ability to think and act quickly in emergencies or under pressure;\n\nHave an ability to deliver succinct and clear verbal and written reports where necessary;\n\nMaintain a high standard of personal presentation;\n\nDemonstrate reliability including the ability to deliver high standards of both punctuality and attendance in order to ensure team effectiveness and availability;\n\nAble to demonstrate an ability to work as part of a team;\n\nAble to deal calmly and confidently with all demands from the public;\n\nAn understanding of the principles of equality and diversity in relation to visitors’ needs;\n\nAn interest in and commitment to the work of SRS for its clients.\n\nDesirable\n\nUnderstanding of the International Standards in IT Security;\n\nExperience with software such as CABS, CONDECO, CARDEX.\n\nAutoCAD, draughtsman\n\nQualifications & Licences\n\nEssential\n\nCertification for Lenel, FLIR, Genetec etc.\n\nDesirable\n\nSystems Certification Licenses\n\nFirst Aid at Work certificate", "extensions": ["1 month ago", "Full–time"], "detected_extensions": {"posted_at": "1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZWN1cml0eSBTeXN0ZW0gQW5hbHlzdCIsImNvbXBhbnlfbmFtZSI6IlNlY3VyaXR5IFx1MDAyNiBSaXNrIFNvbHV0aW9ucyBQdGUuIEx0ZC4iLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6InRfcUo5NW5JOEpzTVhqc2ZBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTW9uc3RlciBTaW5nYXBvcmUiLCJsaW5rIjoiaHR0cHM6Ly93d3cubW9uc3Rlci5jb20uc2cvam9iL3NlY3VyaXR5LXN5c3RlbS1hbmFseXN0LXNlY3VyaXR5LXJpc2stc29sdXRpb25zLXB0ZS1sdGQtc2luZ2Fwb3JlLTI4NzMwMzA/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Outsystem Analyst", "company_name": "None", "location": "Singapore", "via": "via Jobs", "description": "Major duties and responsibilities are listed below: a. Based on the cases assigned, troubleshoot and develop the solution that meets the business needs using the Outsystems Rapid Application Development platform. b. Responsible for ensuring the proposed solution is aligned with the overall architecture design. c. Responsible for complying with the program standards, processes and technical standards defined for the project. d. Responsible for the design and development of all integration points and interfaces with SAP, any selected 3rd party software and other applications/systems. e. Perform the following key maintenance and implementation activities: Propose solutions to fulfil business requirements and recommend potential areas for streamlining. Design, document and develop programs to resolve cases and ensure the developed programs fulfil the business requirements. Plan, identify, define and conduct unit testing to ensure the proposed solution fulfils the business requirements... Provide technical support to the Functional Consultants during system integration and user acceptance testing, implementing code changes if required. Conduct peer code reviews as specified according to project standards. Ensure programs developed pass the required vulnerability assessments and code quality inspections. Deliver all documentations defined for the projects that minimally includes design specifications, program specifications and unit test plan. Provide on-site support where necessary. Troubleshoot any problems reported before and after implementation of solution. f. Ensure optimal system design and configuration of the application functionality. g. Ensure the quality of the deliverables. h. Participate in any quality assurance activities and resolve any risks or areas for improvement identified. i. Perform risk management which includes identification; provide mitigation solutions and management for risks. j. Participate in the change request process which includes performing impact assessment, development and testing. k. Responsible for the timely preparation and reporting of progress status updates to the Project Manager and other management. Pre-requisite: The candidate should possess at least a Degree in Computer Science, Engineering or Equivalent Ability to work independently and efficiently, managing timelines and expectations, and producing high quality deliverables (programs, documentation). Good team player, responsible and conscientious. 1 year Outsystem application development experience or certification in development on the Outsystems platform is required. Minimum 1 year of IT system implementation experience Major duties and responsibilities are listed below: a. Based on the cases assigned, troubleshoot and develop the solution that meets the business needs using the Outsystems Rapid Application Develop Skills: Architectural Design, Business Analysis, Development, Integration, Microsoft Sql Server, Project Management, Requirements Analysis, Sdlc, Software Development, Sql, Troubleshoot, Platform, Microsoft C, outsystems Experience: 5.00-7.00 Years", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJPdXRzeXN0ZW0gQW5hbHlzdCIsImNvbXBhbnlfbmFtZSI6Ik5vbmUiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IlUxLTZEakt4amdQbWlONDJBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9icyIsImxpbmsiOiJodHRwczovL3NnLmZpZGFudG8uY29tL2pvYnMvam9iLW9wZW5pbmcvaW5mb3JtYXRpb24tdGVjaG5vbG9neS1wcm9qZWN0LW1hbmFnZXJzL291dHN5c3RlbS1hbmFseXN0LTI3ODQ5OTQ2Nj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "IT Systems Analyst", "company_name": "TechSearch", "location": "Singapore (+1 other)", "via": "via Jobsingapore24h.com", "description": "We’re looking for a candidate to fill this position in an exciting company.\n\nCoordinate with contractors and relevant parties on complex industrial waste disposal Conduct safety orientation to all employees, contractors and relevant parties Issue PPE and first aid items to relevant parties Inspect and enforce for compliance for in-house safety rules and regulations Involve in 5S activities/ HSE projects Take charge of all safety records & documentations, including safety/ training certifications and NEA tracking O Levels/ Tertiary with 2 years experience in HSE field, preferably in petrochemical/ chemical/ pharmaceutical industries Meticulous in administrative duties Good computer skills, including Word & Excel is a must have Candidates with WSH certification are highly preferred but not a must A strong team player with positive attitude", "extensions": ["Over 1 month ago", "Contractor"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Contractor"}, "job_id": "eyJqb2JfdGl0bGUiOiJJVCBTeXN0ZW1zIEFuYWx5c3QiLCJjb21wYW55X25hbWUiOiJUZWNoU2VhcmNoIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJEUndkSDZ1MzNYSjhVQWs4QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnNpbmdhcG9yZTI0aC5jb20iLCJsaW5rIjoiaHR0cHM6Ly9qb2JzaW5nYXBvcmUyNGguY29tL2l0LXN5c3RlbXMtYW5hbHlzdC1qb2IyNjgxMD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:Google Sans,arial,sans-serif}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Business Operations", "value": "GC06"}, {"text": "Accounting and Finance", "value": "GC01"}, {"text": "Customer Service", "value": "GC10"}, {"text": "Human Resources", "value": "GC15"}, {"text": "Management", "value": "GC18"}, {"text": "Education", "value": "GC11"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Protective Services", "value": "GC23"}, {"text": "Science and Engineering", "value": "GC27"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "System analyst", "value": "system analyst"}, {"text": "Systems analyst", "value": "systems analyst"}, {"text": "Business analyst", "value": "business analyst"}, {"text": "It analyst", "value": "it analyst"}, {"text": "Analyst", "value": "analyst"}, {"text": "Senior", "value": "senior"}, {"text": "Security analyst", "value": "security analyst"}, {"text": "Application analyst", "value": "application analyst"}, {"text": "Engineer", "value": "engineer"}, {"text": "Project manager", "value": "project manager"}, {"text": "Software engineer", "value": "software engineer"}, {"text": "Hris analyst", "value": "hris analyst"}, {"text": "Lecturer", "value": "lecturer"}, {"text": "Manager", "value": "manager"}, {"text": "Senior analyst", "value": "senior analyst"}, {"text": "Soc analyst", "value": "soc analyst"}, {"text": "Sr analyst", "value": "sr analyst"}, {"text": "Support analyst", "value": "support analyst"}, {"text": "Support manager", "value": "support manager"}, {"text": "System", "value": "system"}, {"text": "Systems administrator", "value": "systems administrator"}, {"text": "Technology analyst", "value": "technology analyst"}, {"text": "Test analyst", "value": "test analyst"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Internship", "value": "INTERN"}, {"text": "Part-time", "value": "PARTTIME"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Mining", "value": "/business/naics2007/21"}, {"text": "Research", "value": "/business/naics2007/5417"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Accommodation", "value": "/business/naics2007/721"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Real Estate", "value": "/business/naics2007/53"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "OCBC", "value": "/m/055r27"}, {"text": "Jobline Resources Pte Ltd", "value": "/g/11gp2647pn"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Workato", "value": "/g/11dxpy_3xd"}, {"text": "Avensys Consulting", "value": "/g/11g7022gjf"}, {"text": "Chevron", "value": "/m/01pvx3"}, {"text": "ELITEZ PTE. LTD.", "value": "/g/11dxptfkcf"}, {"text": "ILLUMINA SINGAPORE PTE. LTD", "value": "/m/09mxkxs"}, {"text": "M1 LIMITED", "value": "/m/05n486"}, {"text": "Mantu", "value": "/m/0b6mxkc"}, {"text": "Public Service Division", "value": "/g/11g6__bv10"}, {"text": "Rakuten Asia", "value": "/g/11g7072z1v"}, {"text": "Techcom Solutions", "value": "/g/11c73vztx3"}, {"text": "United Overseas Bank Limited", "value": "/m/04gjd1"}, {"text": "VISA", "value": "/m/01kqjn"}, {"text": "Venture Corporation Limited", "value": "/g/11bc61gglw"}, {"text": "Xilinx", "value": "/m/03dwkc"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "Activate Interactive Pte Ltd", "value": "/g/11dxq192l5"}, {"text": "Aramco", "value": "/m/01qjg2"}, {"text": "Avnet", "value": "/m/0c8xmc"}, {"text": "BGC Group", "value": "/g/11g0j3fjv8"}, {"text": "Bgc Group Pte. Ltd.", "value": "/g/11g9mphr4f"}, {"text": "CONNECT ENERGY SERVICES PTE. LTD.", "value": "/g/11dxptylw6"}, {"text": "Cochlear Ltd", "value": "/m/0kqqgc"}, {"text": "Crédit Agricole Corporate and Investment Bank", "value": "/m/04n1_w"}, {"text": "Ecquaria Technologies Pte Ltd", "value": "/g/11dxq26pxz"}, {"text": "Edwards Lifesciences", "value": "/m/03p20ps"}, {"text": "Equinix", "value": "/m/07btnq"}, {"text": "Experis Singapore", "value": "/g/11dxpnwm3s"}, {"text": "Flintex Consulting Pte Ltd", "value": "/g/11h1z41pzb"}, {"text": "ITCAN Pte Limited", "value": "/g/11dxpstz9t"}, {"text": "Institute of Technical Education", "value": "/m/05_02p"}]}]}