{"search_metadata": {"id": "6082792f8ccee006f93638b2", "status": "Success", "json_endpoint": "https://serpapi.com/searches/c263ea6af145d29b/6082792f8ccee006f93638b2.json", "created_at": "2021-04-23 07:37:19 UTC", "processed_at": "2021-04-23 07:37:19 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28product+manager%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=30", "raw_html_file": "https://serpapi.com/searches/c263ea6af145d29b/6082792f8ccee006f93638b2.html", "total_time_taken": 0.96}, "search_parameters": {"q": "(product manager) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "30"}, "jobs_results": [{"title": "Product Manager", "company_name": "Dathena", "location": "Singapore", "via": "via MNC Jobs Singapore | MNC Jobs In Singapore", "description": "Dathena is a deep-tech company that brings a new paradigm to data privacy and security solutions. In a world of ever-growing information, regulation, and consumer privacy expectations, enterprises around the globe rely on Dathena to identify, classify and control sensitive data, reduce risks, and enhance data protection framework.\n\nLeveraging the power of modern AI technologies, Dathena delivers breakthrough, petabyte-scale solutions with unprecedented accuracy, efficiency and speed that build consumer trust in a digital world and ensure the \"privacy and data security protection journey.\"\n\nFounded in 2016, Dathena continues to grow with its latest round of funding. With offices in Singapore, Bangkok, Geneva, Lausanne, Paris, and New York City, Dathena employs more than 70 people, including the world's top data scientists and information risk experts. For more information, go to www.dathena.io/.\n\nThe Role\n• As a product manager for Dathena you will:\n• As a product manager for Dathena... you will be responsible for designing and defining the new features of our product. You will be the link between the technical and business worlds as you design product features that delights our customers\n• Your will collaborate closely with our Engineering and A.I research teams in developing Dathena's product while ensuring the project are delivered on time respecting the budget, scope and quality.\n• Work closely with UX designer to design the user flows for new features and enhance existing products that meet business needs and delight our customers\n• You will understand and create the functional knowledge (product documents) of your product in order to allow our clients to fully benefit from Dathena's capabilities.\n• Priortize and optimize execution of the product roadmap and develop detailed functional requirements.\n• Collect and analyze feedback from existing customers, stakeholders and other Dathena teams to enhance requirements, features and end-products.\n\nRequired Qualifications\n• 4+ years of relevant experience in Product Management in the software industry\n• 3+ years working in or with lean and agile software delivery teams, UI/UX teams & design professionals following design thinking processes.\n• Ability to be creative, strategic, analytical, and think outside the box to solve problems\n• Strong project management and time management skills. PSPO /CSPO / PSM certification.\n• Interpersonal skills with a keen ability to explain complex concepts across the organization\n• Deep knowledge and understanding of software development best practices, digital data management and delivery, analytics platforms and general web development technologies across multiple platforms and device types.\n• Strong time management and prioritization skills, excellent verbal and written communication, effective stakeholder management and the proven ability to lead through collaboration\n• Excellent attention to detail and a can-do attitude with a relentless focus to get things done.\n•", "extensions": ["14 days ago", "Full–time"], "detected_extensions": {"posted_at": "14 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9kdWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJEYXRoZW5hIiwiY29tcGFueV9taWQiOiIvZy8xMWR4cHJkbjZ5IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoicGRNYkhmQ0w0WW1iaGktb0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVJQkNxSUJRVTVWWDA1eFVYTktka0Z2V25FeWFra3hNM0ZXUzJkWlNHeEJaMncwZEhSdGQyOU9ja05rYUhodU1XRlBSME0wVVdoWE1FWnRla3R3VEc1SlF6a3RSSGRrU1dKNFowY3llVVJNZUU5TFp6TlZRbEo2VGtvMFUyNTFSakUxUjE5YVdsaHFXVFozY2tGRGVGTTNRVkpXUlZWSVJ6VnFVRkZXVlZCdU0xZzFiRFowZWtvemNUQllSalZZTkZoS2RVeFlTbUV6YzI5M1duY3hWV1p2T1hOYWNEUjNFaGRNTTIxRFdVMXlkMDAxY1U4NVVIZFFOWEJ0Tkd0Qk1Cb2lRVTlOV1ZKM1FtYzBOV0paY1VneFgzaHNXRWxNTVRNMmFWSjBNa3BXZFZKbGR3IiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNTkMgSm9icyBTaW5nYXBvcmUgfCBNTkMgSm9icyBJbiBTaW5nYXBvcmUiLCJsaW5rIjoiaHR0cHM6Ly9zZy5tbmNqb2J6LmNvbS9qb2JzL3Byb2R1Y3QtbWFuYWdlci1zaW5nYXBvcmUtMzk2MjI/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Associate Product Manager", "company_name": "Homage", "location": "Singapore", "via": "via Meet Jobs", "description": "About the company\n\nHomage is a Singapore-based company providing on-demand caregiving services through a combination of certified care professionals and proprietary technology.\n\nLocation\nSingapore\nIndustries\nHealthcare Services\nEmployees\n11 – 50\n\nJob description & requirements\n\nLocation: Singapore\n\nType: Full-time\n\nAbout Homage\n\nHomage is a leading technology startup in the healthcare sector operating across Asia Pacific that is transforming the way personalised healthcare is delivered and accessed. At the heart of Homage are the care recipients, families and caregivers we work with and the technology we build transforms their lives and enables wellness and recovery. Here, everyone works on exciting, meaningful projects. We move fast, have fun and help each other out.\n\nWe’re looking for people who are creative, talented, thoughtful, responsible and passionate individuals who share our values and passion for what we do. Your work will directly impact the lives of people receiving care... people delivering care, and the families that are normally left in the dark about the entire caring process. We're looking for strong team players, people who can work with a very diverse team (engineers, care operations, sales folks.) We’re proudly backed by a group of top local investors, including East Ventures Growth, Golden Gate Ventures, HealthXCapital, 500 Startups and SeedPlus.\n\nResponsibilities\n\nHomage is fundamentally changing the way people access and get home care. From visit requests and care services to our patented caregiver-care recipient matching system to automated payments and health reporting and analytics suite, we build products that delight all sets of Homage users – seniors, care givers and local care organizations. The product management team works closely with our engineers to define and deliver products from conception to launch. As part of the product group you bridge the creative, technical and business worlds as you design services that our users love.\n\nIn this role you will collaborate closely with Homagers from Engineering, Care Operations, Sales, Marketing, Account Management and other cross-functional team members to design, test, prioritize, and implement compelling product strategies and features.\n\nResponsibilities include:\n\nPerform a deep understanding of user needs and constantly develops user feedback for product improvement.\nPerform data analysis to inform product requirements, feature design, user experience and roadmap prioritization, helping the team to optimize customer experience, sales, customer success and product-market fit;\nOwn delivery of end to end product initiatives and releases to drive user growth, customer happiness and success\nWork closely with stakeholders across the organization and collaborate on the company’s short- and long-term goals\nPerform UAT testing on features as well as supporting in smoke and regression testing for software releases.\nPreferred qualifications\n\nBachelor's degree and 1-2 years of experience in product, engineering, data or startups preferred\nAbility to analyze metrics that inform the success of products\nStrong attention to detail with excellent organizational skills\nExcellent communication skills and proven ability to work cross functionally\nSelf-motivated, self-directed, and able to thrive in a fast-paced environment\nA natural, deep curiosity that drives you to learn, investigate, and constantly ask why\nA strong execution mentality.\nProduct Management at Homage\n\nWe're looking for associate product managers who live and breathe our users’ experience and customer happiness to join our engineering team. Your work will directly impact the lives of people receiving care, people delivering care, and the families that are normally left in the dark about the entire caring process. We're looking for strong team players with team experience and great communication skills, people who can work with a very diverse team (engineers, care operations, sales folks.)\n\nWe want you to light up and innovate on systems that have traditionally been left behind. The product team is small, lean, and fast! Plus you have a bias toward action and can break down complex problems into steps that drive product development at lightning speed!\n\nRequired skills\n\nProduct Design Product Development Product Launch Product Management Product Strategy User-centered Design User Experience (UX) User Interface (UI)\nCulture\n\nWhat’s it like working at Homage?\n\nWorking at Homage is fast-paced and filled with a sense of teamwork, friendship and mission, where everyone is working hard at building an impactful product that people love and making a real difference in people's lives", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBc3NvY2lhdGUgUHJvZHVjdCBNYW5hZ2VyIiwiY29tcGFueV9uYW1lIjoiSG9tYWdlIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJfNy1JeDczcWhGNmhHRldGQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1lZXQgSm9icyIsImxpbmsiOiJodHRwczovL21lZXQuam9icy9lbi9qb2JzLzI2MDk0LWFzc29jaWF0ZS1wcm9kdWN0LW1hbmFnZXI/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Sr. Product Manager - Singapore", "company_name": "Amazon", "location": "Singapore", "via": "via JobWiz", "description": "Job Description : Amazon Web Services (AWS) is a highly reliable, scalable, low-cost infrastructure platform in the cloud that powers hundreds of thousands of enterprise, government and start-up business and organizations globally. The AWS Marketing Job Description : Amazon Web Services (AWS) is a highly reliable, scalable, low-cost infrastructure platform in the cloud that powers hundreds of thousands of enterprise, government and start-up business and organizations globally. The AWS Marketing Response Center (MRC) team is seeking an exceptionally bright, creative, multitasking and self-motivated individual to join the MRC global team. MRC is an important customer engagement arm in the Marketing organization. Our mission is to learn from customers, understand their needs, and educate them about the benefits of AWS and all the services we offer, in order to help them embark on their cloud journey quickly and easily. It is a critical function within the lead and demand generation... process, with the objective to profile, nurture, and qualify marketing leads generated from various marketing events, campaigns, and activities. MRC OPAS owns Operation, Planning, Analysis and Scale for MRC team globally.MRC OPAS drives operations and planning, conducts business analysis, and reports on programs. OPAS also drives non-linear scale and enablement programs for high performing MRC teams around the world, with the objective of increasing the quality of inbound leads through targeted profiling and lead nurturing activities. MRC OPAS also creates and executes projects to drive strategic focus area to achieve non-liner business growth. MRC OPAS is running a strategic project which leverages artificial intelligence and machine learning (AI/ML) services to transform the traditional customer engagement landscape into a personalized experience that makes it easy to onboard prospects and customers onto the AWS Cloud. MRC OPAS is seeking a talented, self-directed Technical Product Manager to drive the integration and deployment of AI/ML technology used for MRC activities. This role will be responsible for driving the roadmap, defining product requirements, collaborating with engineering and tirelessly championing the needs of customers whom MRC Reps engaged with. Given the breadth of the platform we are building, this role will require coordination across many internal and external teams. You'll work with customers, partners, and operational stakeholders to prioritize roadmap features, and spearhead the definition of new capabilities through expertly crafted narratives and business requirements documents. The ideal candidate will have exceptional problem solving skills, strong business judgment, and demonstrated experience leading cross-functional teams. We are looking for someone with a proven ability to execute both strategically and tactically, and who is excited to take on a new, ambiguous project that will be industry defining. A technical background is required to be able to effectively communicate and work with engineers. Responsibilities for this position include: Creating the product strategy for the new platform that appeals to unique needs and requirements of MRC teams Managing the entire product life-cycle from strategic planning to tactical execution Owning product strategy and roadmap for MRC platform and working with key stakeholders to deliver on MRC vision Authoring product requirements documents Research and identify new opportunities for AWS to innovate on behalf of our customers Being customer obsessed to ensure the safety and security of customer data and information Deploy technologies and processes to increase efficiency and effectiveness of MRC team. Measure and report on the effectiveness of enablement investments and programs, including sharing insights with relevant stakeholders. Lead and manage strategic projects which contribute to MRC business growth. Basic Qualifications : 5+ years of relevant work experience in product management 5+ years of relevant work experience in program and project management Bachelor's Degree in Computer Science, Information Technology, or related field required Knowledge of cloud computing and AWS services, especially artificial intelligence and machine learning Experience executing long term strategic roadmaps and handle demanding priorities Ability to conceptualize, scope and execute projects to strict deadlines. Exceptional written, verbal, and interpersonal communication skills Ability to work in a highly ambiguous environment Experience in gathering data, analysis and presentation (written and oral) Ability to think logically and structure answers Proven success managing time and juggling multiple projects in a high growth environment where priorities shift fast Attention to detail Great organizational skills Preferred Qualifications : Experience with marketing technology products a plus Experience in B2B, high-tech products/services preferred Has AWS SA Professional certification Confident, self-motivated individual with strong, demonstrable bias for action. Post-graduate education / Masters level qualification (MBA from top tier school is a plus) Ability to handle confidential information with discretion, and deal with professionals inside and outside the company Amazon is an equal opportunity employer, and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, disability, age, or other legally protected status.\n\nMonster", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTci4gUHJvZHVjdCBNYW5hZ2VyIC0gU2luZ2Fwb3JlIiwiY29tcGFueV9uYW1lIjoiQW1hem9uIiwiY29tcGFueV9taWQiOiIvbS8wbWdrZyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IlVBN0dHd1luVkd2clBsbjFBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVzd0JDb3dCUVU1VlgwNXhVbmg2ZDJ0WVJtWTRRMlo0YURoeVUwOVFkVTVKZEV0VVExSmxTamxpVW14VFVrSktaR3A0WjFCTVZFMWplWFpwV25kWlZFTjBXazh6UkVkU2MxWkRWSGRrUW1vMGVVWjVOVzFYZGw4MmFEQmlYMnA2VmpndFYxZG9jVEppVVc0eE5HdHpSRmhITm1KUFlUUnNNeTFDYXkxbE5VVm5RMmRrWkZwelFsRkxOMVUyVm5wd2NXMFNGMHd6YlVOWlRYSjNUVFZ4VHpsUWQxQTFjRzAwYTBFd0dpSkJUMDFaVW5kRVZITlFhamhTYjBwTWJsUlVSRzlNV0hWZllubGxORkUxVTNGMyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzIxIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYldpeiIsImxpbmsiOiJodHRwczovL2pvYndpei5zZy9qb2IvQ1ItODEzMjgyODA2P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "DevOps Engineer", "company_name": "Microsec", "location": "Singapore", "via": "via AngelList", "description": "Requirements:\n• At least 2 years of experience in Python, Unix/Linux.\n• Experience of tools like Docker, Kubernetes and Puppet.\n• Basic knowledge of cybersecurity and IoT.\n• Have experience with DevOps and how to build a production environment system\n\nResponsibilities:\n• To Install, configure and test different IoT products and solutions Proof-of-Concepts,\n• To automate and optimize processes, using tools like Docker, Kubernetes and Puppet,\n• To develop Python Scripts to enable tests automation and logs analysis,\n• Manage and monitor the service\n\nOutcome:\n\nThe candidate will be working in a field that’s essential to rapidly growing smart cities and the digital transformation of our world. They will be part of an agile team spanning embedded, frontend and backend systems and get opportunities to learn beyond their knowledge base.\n\nWe offer an industry competitive salary commensurate with experience and Employee Stock Options.\n\nInterested candidates may send their resume to... dipali@usec.io or vishram@usec.io.\n\nMicrosec focuses on Cyber Security and Smart Cities. Their company has offices in Singapore. They have a small team that's between 11-50 employees.\n\nYou can view their website at http://www.usec.io or find them on Facebook and LinkedIn", "extensions": ["4 days ago", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEZXZPcHMgRW5naW5lZXIiLCJjb21wYW55X25hbWUiOiJNaWNyb3NlYyIsImNvbXBhbnlfbWlkIjoiL2cvMTFmMDB3MjF0cyIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImFLQUZZblZVQmx2bVlVV1RBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1SUJDcUlCUVU1VlgwNXhWSFowZUVGNWFUQndkM052WXpsbWVGUnVUa3MyTUVwWFkxQktkVk5uTlRrek5FZHdWVEU1YjNBMVZ6VjBjbmhhVW5OQ1IxbzRMWGRYZFRGbWFtWkZWbFpVVFVsUFN6ZzBiRkkwTW1od2IwcEpUR3hFVDJ4SVNqbHhkRUprVEd0WlJXRklPRU51TUVsdVRXcG9MV2xEYTBkWmVGTmZlbmwzVVRoTE1EbG1XRzUzU1hWSlpGSkhNbkpZV1dVeU5XdHZVMnN3TnpOd2FuQlVVVUZSRWhkTU0yMURXVTF5ZDAwMWNVODVVSGRRTlhCdE5HdEJNQm9pUVU5TldWSjNSRkJWUTNCNU9EZFhablpyWDI5SGFFczVUVUpaYkMxb1RrUlZRUSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzI4IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEFuZ2VsTGlzdCIsImxpbmsiOiJodHRwczovL2FuZ2VsLmNvL2NvbXBhbnkvbWljcm9zZWMtNC9qb2JzLzEzMTk2MDYtZGV2b3BzLWVuZ2luZWVyP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "IT Infra Technical Lead/Operations Manager", "company_name": "Quinnox Solutions Pte Ltd", "location": "Singapore", "via": "via Joblum Singapore", "description": "The Responsibilities:\n• Lead a team of Infra Engineers to perform 24x7 managed service for entire IT Infrastructure.\n• Oversees and directs the day-to-day activities of an organization’s information technology (IT) department, ensuring that systems, services, and infrastructure work reliably and securely.\n• Monitor and Incident Manage the performance of business-critical systems to prevent delays and outages and quickly resolve ongoing issues.\n• Ability to engage middle to top management.\n• Set guidelines, policies and procedures and drive the execution.\n• Able to manage multiple deadlines - self-starter, able to prioritize appropriately.\n• Proficient in leading integrated process teams, as well as coordinating and communicating customer requirements.\n• Be proactive in highlight potential issues or service improvement.\n• Provide supporting documentation, reports, and other information to management.\n• Expected to work during off-peak hours on system activities.\n• Be a mentor to... juniors.The Requirements:\n• Bachelor degree in Computer Information Systems or related field.\n• High level understanding of various complementing technologies including System, Network, Security, Databases, Monitoring, Patch management, High Availability, Business Continuity and Automation\n• Level 3/4 skillset in three or more categories listed below.\no CCNA or CCNP Certification\no CCIE Certification\no MCSA/RHCE/AIX V1/OCP/VCP Certification\no MCSE Certification\no PMP or ITSM Certification\no Other Professional Certification (Cloud/Virtualisation/System/Network/Network Security)\n• At least 5 to 7 years of relevant working experiences.\n• ITIL Foundation V4 certified.\n• Relevant professional certifications in supported system preferred.\n• Process excellent customer service skills.\n• Positive, resourceful, creative and detail-oriented.\n• Passionate toward new and existing technologies.\n• Be effective in interpersonal communication and problem solving.\n• Sharp technical, analytical, and holistic problem-solving abilities.\n• Independent, accountable and take ownership.\nTo Apply:\nPlease send your latest CV in word file to sales@quinnox-solutions.com\nKindly indicate your availability, current and expected remuneration package.\nWe regret that only shortlisted candidates will be notified. For more job opportunities, please visit our career page: http://quinnox-solutions.com/careers/\nQuinnox Solutions Pte Ltd (License Number: 06C3126)\nRegistered EA Personnel (Reg. No.:R1111100", "extensions": ["14 days ago", "$7K–$8K a month", "Full–time"], "detected_extensions": {"posted_at": "14 days ago", "schedule_type": "Full–time", "salary": "$7K–$8K a month"}, "job_id": "eyJqb2JfdGl0bGUiOiJJVCBJbmZyYSBUZWNobmljYWwgTGVhZC9PcGVyYXRpb25zIE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJRdWlubm94IFNvbHV0aW9ucyBQdGUgTHRkIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJzVFdnNDZBQ1p1ZG14ZElhQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYmx1bSBTaW5nYXBvcmUiLCJsaW5rIjoiaHR0cHM6Ly9zZy5qb2JsdW0uY29tL2pvYi9pdC1pbmZyYS10ZWNobmljYWwtbGVhZC1vcGVyYXRpb25zLW1hbmFnZXIvNjA4MzM5P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Product Manager - Fund", "company_name": "Prudential Singapore", "location": "Singapore (+1 other)", "via": "via Monster", "description": "At Prudential, we understand that success comes from the talent and commitment of our people. Together, we have a shared vision in securing the future of our customers and our communities. We strive to build a business that you can shape, an inclusive workplace where everyones ideas are valued and a culture where we can thrive together. Our people stay connected and tuned in to whats happening around us, keeping us ahead of the curve. While focused on the long-term, we look to the future to bring growth, development and benefit to everyone whose lives we touch.\nJob Profile Summary:\nYou will support the Head of Investment & Group to develop and execute the agreed product plan and road map while ensuring customer driven product development aligns with PACS financial targets.\nYou are also expected to support the Investment business through either conducting or lead in providing market intelligence, customer insights through research studies for the purpose of product feasibility study... and contributing to strategic market and business planning.\nJob Description:\n• Support the development of product solutions and propositions, taking into account and balancing regulatory, business, distributor and customer needs, in adherence to internal approval requirements. This includes:\n• Conducting customer insights research and market intelligence analysis.\n• Soliciting product feedback from key stakeholders from agency distribution, partnership distribution and reinsurers to understand target market and suitability\n• Drive product implementation activities, collaborate closely with and influence internal and external stakeholders to ensure timely and effective product launch. This includes the development and/ or review of product specifications and documentations, marketing collaterals and sales aids, as well as involvement in UAT.\n• Provide pre and post product launch support to address product related queries from internal stakeholders, distributors and customers, in a timely and effective manner.\n• Support the BAU activities of the ILP funds business which includes and not limited to corporate actions, model portfolio rebalancing activities, funds documentation and website maintenance.\n• Engage agencies through regular briefings, trainings to drive ILP volumes and clear misperceptions on product and performances.\n• Work with the product modelling team to ensure models reflect product specification and actuarial models.\n• Work with investment team to help deliver funds to grow the business.\n• Prepare approval documents and responsible for PGC and PCA approval.\n• Work with L&D and Corporate Communications and Branding department to ensure training and marketing materials are developed according to consumer needs and intent\n\nWho we are looking for:\nCompetencies & Personal Traits\n• Ability to work in a team effectively while managing tight timelines, and must be comfortable working in a fast-paced environment\n• Strong analytical skills and an ability to understand complex insurance product levers\n• Good spoken, presentation skills and written communication as well as articulate interpersonal and negotiation skills\n• Demonstrate leadership influence and maturity for effective collaboration across departments and divisions.\n• Adaptable and can deal with change and ambiguity\n\nWorking Experience\n• At least 5 years working experience with about 3 years of experience in a product management role dealing with ILPs and funds.\n• Good investment background, with strong knowledge in ILP funds.\n• Conducted agency engagements through briefings, trainings and one on one.\n• Experienced in managing relationships with internal sales stakeholders and external fund partners.\n\nEducation\n• Degree in Marketing / Finance / Economics / Business Administration or related discipline", "extensions": ["7 days ago", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9kdWN0IE1hbmFnZXIgLSBGdW5kIiwiY29tcGFueV9uYW1lIjoiUHJ1ZGVudGlhbCBTaW5nYXBvcmUiLCJjb21wYW55X21pZCI6Ii9nLzExZzhidjJta2QiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJNQmk5aWZuWnk1eXRNM2FIQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdmNCQ3JjQlFVNVZYMDV4VVc1S2JsSnVaM2Q2WlhsdE9YRXdWM0J2WjNveFlsaEhRbUZEZWtWSlRXTmllamRsYkZnMlJIcFJSVFpNWTNGNFEzTklhekZSVlZsNFRHZEVielpqYzFOaWNDMWpWRzluYUhrM1FraFJUMjlPTkRKcGJteDRUVlZwVkU5TmNWRjROSFJzYlRVM1RURkxOSGg2UW1rM1YzUnNRMHc1YzJvNWFHSldSbmt3YzBaa1prdHBWRVJUWkc1Q1JUWkRNV2RGV1VaNU1HdzFlSG96YXpoWlVVaExTVXhTTjBReGVVUXpNbEpEVVdoWlh6RXdFaGRNTTIxRFdVMXlkMDAxY1U4NVVIZFFOWEJ0Tkd0Qk1Cb2lRVTlOV1ZKM1EwRldZVFp1VW5BM2FYVjZNWGt6VkV0UmJsVjBjSEpoV0hCMFp3IiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMzkiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTW9uc3RlciIsImxpbmsiOiJodHRwczovL3d3dy5tb25zdGVyLmNvbS5zZy9hbXAvam9iLXZhY2FuY3ktcHJvZHVjdC1tYW5hZ2VyLWZ1bmQtcHJ1ZGVudGlhbC1zaW5nYXBvcmUtc2luZ2Fwb3JlLTI3NzQwMTQzLmh0bWw/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Product Manager", "company_name": "Randstad Singapore", "location": "Singapore (+1 other)", "via": "via Shortlisted Jobs | Singapore", "description": "about company our client is a South East Asia leading fintech startup that has been founded for more than 10 years. about job • Develop a deep understanding of the needs of the ASEAN market when it comes to Personal Finance and work with the team to build a technical product roadmap objectively with input... read more on Shortlisted Jobs | Singapore", "extensions": ["19 days ago", "$6K–$9K a month", "Full–time"], "detected_extensions": {"posted_at": "19 days ago", "schedule_type": "Full–time", "salary": "$6K–$9K a month"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9kdWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJSYW5kc3RhZCBTaW5nYXBvcmUiLCJjb21wYW55X21pZCI6Ii9nLzExZzcwYjUwbXIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJVd2hGWnBoZFRObkprZk9WQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdmNCQ3JjQlFVNVZYMDV4VVVKdE1ISk5jVlJOU1MxbFVHSlZaVXQyZG5GbE1HUk1jR2N5YWxaUFJWWmZRVkJLZEdsMk1rZHRjbXM1WW1FdFZsbEJSMWxXT1U0eGVWbE5SalZqZUZsUll6QnhObk5qT0VwNVVsTXpNa0Z1VnpoWVNUZ3hkbkoyTmtsdmJUWnRVRVZuZDIxMlpVZEZZMjV0U1dKRFRsQlJhbEJxUlRFMWEycHRaWGRSU0ZaWlZtWnhkMlZVYVdsWFoyazFWMVZET1RoUE5tZzVRVzl0ZVdwMGMweEJaaTB0UlZOVk1XSmpSV2R4YXpoNGFIcEZFaGRNTTIxRFdVMXlkMDAxY1U4NVVIZFFOWEJ0Tkd0Qk1Cb2lRVTlOV1ZKM1JHdHBha294VEhkVlVFcFBhRFpOZFZaM1VVaGZabEp3UjFBMlVRIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNDciLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gU2hvcnRsaXN0ZWQgSm9icyB8IFNpbmdhcG9yZSIsImxpbmsiOiJodHRwczovL3NnLnNob3J0bGlzdGVkam9icy5jb20vam9icy9yYW5kc3RhZC1zaW5nYXBvcmUtcHJvZHVjdC1tYW5hZ2VyLTYzNjYzLz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Technical Product Manager", "company_name": "None", "location": "Singapore", "via": "via Jobs", "description": "Summary Our client is searching for an innovative and motivated Technical Product Manager to lead a technical team locally in Singapore and remotely to bring new products to market with speed. You will work closely with a Head of CRM to guide our product strategy, responsible for solution architecture, DevOps, application development, and communicate broadly with multiple functional groups and stakeholders.You will anticipate bottlenecks, provide escalation and proposal to management, build consensus across different stakeholders. Lead technology decision, remove blockers, guidance, best practices to the developers in technical stacks, performance, security, and architecture design to help identify, prioritize and create opportunities from ideation to launch.Job Responsibilities Able to display strong leadership to the technical team, responsible for the team's efficient and high-quality completion of tasks Being able to mentor the team in AWS microservices architecture, software... development, coding best practices, delivering complex projects using AWS native services Work closely with Head of CRM to understand user needs. Articulate clearly in a PRD that can help the developers to stay on track Define product vision and create an execution plan to bring it to life. Fully own the strategic roadmap, from creation to implementation, to measuring success. Responsible for solution architecture, tech discovery, DevOps, implementation, and maintenance of the product. Work closely with different stakeholders to ensure product yields maximum returns and acquisition Deeply understand our customer base to build the best tool to serve creators. Stay up to date on market trends, creator needs and opportunities. Research new services and features launched by AWS, as well as staying on top of best practices to improve existing AWS solutions already in place Define and implement processes that allow engineers to bring the most value to our customers, leading to a delightful overall customer experience. Establish metrics to measure the team's effectiveness and drive improvements. Implement best practices and able to hands-on for development, product testing. Manage the product backlog through continuous prioritization. Job Requirements Min. 4 years of experience working as a Technical Lead at a software company Experienced in large scale development and project management Possess people leadership and technical coaching skills Experienced in hiring and managing remote team, freelancer and external vendor Played a lead role in at least 3 SaaS project and can detail how their product significantly impacted customer and company growth Ability to articulate a structured product management and launch framework Has managed a product that has launched multiple iterations quickly and with meaningful results Loves to showcase advanced technology to different stakeholders Wants to work on a team with other high-performing peers Be an expert in using metrics to make decisions and drive direction Be autonomous, self-driven Experience with roadmap prioritization in an Agile environment (Scrum, sprints) Problem-solving and analytical experience Ability to juggle multiple projects and tasks. Demonstrated knowledge of project management concepts and techniques required Must have the ability to make decisions and recommendations on technology strategies Ability to communicate effectively with stakeholders in sales, marketing and other business areas as well as with technical teams Creative and comfortable with ambiguity, exploration, and iteration under pressure Empathy for our users and ability to balance the roadmap across internal and customer personas Competent in Agile development methodology and Practices Use of CI/CD in life-cycle Ability to analyze data and articulate user hypotheses in terms of objective measures, and project KPI impact of new features Deep technical knowledge in API development using REST JSON/ XML security standard (e.g. OAUTH2), AWS serverless and microservices architecture Preferably AWS Certified Solutions Architect – Professional Fluent in both English and Chinese", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJUZWNobmljYWwgUHJvZHVjdCBNYW5hZ2VyIiwiY29tcGFueV9uYW1lIjoiTm9uZSIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiaHNxYW45OFVZXzBnM2RPRkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIiwibGluayI6Imh0dHBzOi8vc2cuZmlkYW50by5jb20vam9icy9qb2Itb3BlbmluZy9tYW5hZ2Vycy1hbGwtb3RoZXIvdGVjaG5pY2FsLXByb2R1Y3QtbWFuYWdlci0yNzc4MzY1MTM/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "PwC Digital - Associate Product Manager", "company_name": "PwC", "location": "Singapore", "via": "via Jobsingapore24h.com", "description": "Line of Service:Advisory\nSpecialty/Competency: Advisory - Other\nIndustry/Sector: Not Applicable\nTime Type: Full time\nGovernment Clearance Required: No\nAvailable for Work Sponsorship: Yes\nTravel Requirements: Up to 20%\n\nA career in PwC Digital Products will provide you the opportunity to design and develop products to help our clients lead the next phase of their evolution. We are industry specialists who build products connected to a purpose. Spanning across four strategic areas of transformation, our products tackle the very real challenges our clients face today, and unlock new opportunities for growth in the future. Our team is responsible for designing and executing against the product road map, working with product and customer functions to identify business and technical features and requirements. Our team focuses on leading product strategy, planning, roadmap, and execution to deliver value proposition by defining product requirements, specifications, product timeline, pricing... and go-to-market activities.\n\nTo really stand out and make us fit for the future in a constantly changing world, each and every one of us at PwC needs to be a purpose-led and values-driven leader at every level. To help us achieve this we have the PwC Professional; our global leadership development framework. It gives us a single set of expectations across our lines, geographies and career paths, and provides transparency on the skills we need as individuals to be successful and progress in our careers, now and in the future.\n\nResponsibilities\n\nPwC Professional skills and responsibilities for this management level include but are not limited to\n\nAs a Senior Associate, you’ll work as part of a team of problem solvers, helping to solve complex business issues from strategy to execution.\n• Use feedback and reflection to develop self awareness, personal strengths and address development areas.\n• Delegate to others to provide stretch opportunities, coaching them to deliver results.\n• Demonstrate critical thinking and the ability to bring order to unstructured problems.\n• Use a broad range of tools and techniques to extract insights from current industry or sector trends.\n• Review your work and that of others for quality, accuracy and relevance.\n• Know how and when to use tools available for a given situation and can explain the reasons for this choice.\n• Seek and embrace opportunities which give exposure to different situations, environments and perspectives.\n• Use straightforward communication, in a structured way, when influencing and connecting with others.\n• Able to read situations and modify behavior to build quality relationships.\n• Uphold the firm’s code of ethics and business conduct.\n\nBasic Qualifications\n\nJob Requirements and Preferences:\n\nMinimum Degree Required\n\nHigh School Diploma\n\nMinimum Years Of Experience\n\n3 year(s)\n\nDegree Preferred\n\nPreferred Qualifications:\n\nBachelor Degree\n\nPreferred Fields Of Study\n\nBusiness Administration/Management, Business Analytics, Computer and Information Science, Mathematics, Engineering, Management Information Systems, Operations Management/Research, Statistics\n\nCertification(s) Preferred\n\nScrum Master , Certified Agile Product Owner, TOGAF, PMI and/or certifications in programming, business intelligence/data warehousing\n\nPreferred Knowledge/Skills\n\nDemonstrates thorough abilities and/or a proven record of success in developing and executing a multi-tenant software/data services (SaaS) platform in a “Big Data” Environments including:\n• “Big Data” technologies and systems including HDFS/Hadoop, Spark, Hive, Columnar and noSQL environments;\n• Azure, AWS and GCP services and offerings and experience with use and deployment in SaaS offerings;\n• Managed Services experience supporting “hot” production client environments;\n• Multi-Tenant security and performance compartmentalization environments and their requirements; and,\n• 24 x 7 operational support needs and designing systems to address SLAs.\n\nDemonstrates Thorough Abilities And/or a Proven Record Of Success In Executing Client Engagements And/or Projects Within a Professional Services Environment With Industry Or Functional Domain Knowledge And Also Including The Following Areas\n• Web-based systems architecture, service-based architecture including microservices, enterprise application architecture as well as experience managing expectations when balancing alternatives against business and financial constraints;\n• Current agile methodologies, specifically Scrum;\n• Java, Scala, Spring, Groovy, Maven, Gradle, SOAP and web services, REST APIs and open source software;\n• Statistical Analysis and Techniques;\n• Customer, Product, and Pricing Analysis; and,\n• Business and Operations Analysis within marketing, operations, or risk analysis using quantitative techniques.\n\nDemonstrates Thorough Abilities And/or a Proven Record Of Success In Applying Analytical Modeling And Techniques To Projects, Including In The Following Areas\n• Visualization techniques and tools, i.e. D3/HTML Visualizations, Tableau/Qlikview/Spotfire/etc, Advanced Excel/Access UI, etc.;\n• Advanced analytics techniques, regression, simulation, utilizing R/SAS, SPSS, Java, VBA, etc.; and,\n• Applicable sources of external, internal or new data sources, i.e. SQL, Oracle, NoSQL, Hadoop, MSFT Access, etc.\n\nDemonstrates Thorough Abilities And/or a Proven Record Of Success In Consulting Related Projects, Emphasizing The Leading Of Teams Involved In Full Life-cycle Software And/or Multi-discipline Development, Including The Following Areas\n• Leading and motivating distributed teams;\n• Fostering team commitment to tasks and influence key people inside and outside of the group;\n• Having a flexible communication style based on the audience;\n• Collaborating with cross-functional teams, building relationships and achieving results without a direct reporting relationship;\n• Grasping a range of functional and non-functional requirements to understand an application scope and define the right architecture including solution components and interactions;\n• Actively contributing on multidisciplinary product teams and collaborating with designers, business users, and developers to innovate and drive product development;\n• Being an influential voice on behalf of the customer constantly thinking about their needs and the reflection of those needs in the products we deliver;\n• Producing visual prototype and functional prototypes with agile approaches with release planning, backlog and roadmap requirements creation;\n• Prioritizing new features/development and establishing execution is completed;\n• Effectively collaborating with teams spanning multiple geographies to develop applications;\n• Applying data and analytics to solve questions of business strategy for clients;\n• Creating competitive analyses for potential products, driving appropriate segmentation approaches, and developing preliminary business cases - refining them all as emergent information arises; and,\n• Communicating articulately via storyboards and slideware to all stakeholders (partners, consultants, and clients).\n\nAll qualified applicants will receive consideration for employment at PwC without regard to race; creed; color; religion; national origin; sex; age; disability; sexual orientation; gender identity or expression; genetic predisposition or carrier status; veteran, marital, or citizenship status; or any other status protected by law. PwC is proud to be an affirmative action and equal opportunity employer.\n\nFor positions based in San Francisco, consideration of qualified candidates with arrest and conviction records will be in a manner consistent with the San Francisco Fair Chance Ordinance.\n\nFor positions in Colorado, visit the following link for information related to Colorado’s Equal Pay for Equal Work Act: https://pwc.to/coloradoadvisoryseniorassociate", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQd0MgRGlnaXRhbCAtIEFzc29jaWF0ZSBQcm9kdWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJQd0MiLCJjb21wYW55X21pZCI6Ii9tLzAxMl83OCIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IlB5aU5sTmlpV3pTM191NXpBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVzd0JDb3dCUVU1VlgwNXhVMll6UjJkclZtOUVSbkUxU2s4M2RXUm9MVUV3YjBKalVuUkJkbTFRV1dsaFJqTkZOV3RSWXkxVVdWcE5WbVJFY0UxRFRtMXpNVTVmU0VNM2FXNVVUVnBzVlZsblMyOTFUbkJEYlMxV2MzbzNaa0ZmVDBSNVJuSTBTWFpKWmtSMlJFeHFTVW94WmxnMlgxOHhNRGhmYUhweFdHVkdORFpXVlhoeVdEbHJkREZoWjBOWFEyWVNGMHd6YlVOWlRYSjNUVFZ4VHpsUWQxQTFjRzAwYTBFd0dpSkJUMDFaVW5kRGJtOXVUMjVvVnkxNFowUnpkbWhrYlhBd2NUbHdhbEp2Y0ZsUiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzU5IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnNpbmdhcG9yZTI0aC5jb20iLCJsaW5rIjoiaHR0cHM6Ly9qb2JzaW5nYXBvcmUyNGguY29tL3B3Yy1kaWdpdGFsLWFzc29jaWF0ZS1wcm9kdWN0LW1hbmFnZXItam9iNDQ1MjI/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Product Manager (API Connectivity)", "company_name": "Workato", "location": "Singapore (+1 other)", "via": "via Bayt.com", "description": "Workato is the operating system for today’s fast-moving business. As a high growth company with over 6000 customers, Workato is revolutionizing the integration and automation market with investments from the top 3 SaaS companies - Salesforce, Workday, ServiceNow. Recognized as a leader by both Gartner and Forrester, it is the only AI-based platform that enables both business and IT to integrate their apps and automate workflows across their enterprise with robust security and governance. Some of the world’s top brands including Slack, Grab, Box, Visa, Broadcom run on Workato.\n\nWe are looking for an experienced Product Manager (API Connectivity). You will be responsible for the breadth and quality of connectivity in Workato. This is a demanding role that involves collaboration with multiple stakeholders, both internal and external. You will translate real-world customer challenges into problems that can be addressed by the engineering team. You will also ensure that product features... and innovations are communicated effectively to drive adoption.\n\nSome stuff that we're looking for, culture-wise:\n\nConnection. We deliver exceptional experiences. We build enduring relationships both internally and externally by listening, anticipating needs, doing what is right, and always going above and beyond.\n\nCraftsmanship. We are lifelong learners. We approach our work with curiosity and an open mind. We constantly look for ways to improve our products and ourselves, never settling for good enough.\n\nGrit. We run towards challenges. If something seems unsolvable, it unleashes our persistence, our creativity, and our ability to move through uncertainty to create a solution.\n\nEnergy. We embrace joy. We love what we do and bring our best selves to work each day. We seek to share our optimism and compassion with everyone around us.\n\nWho we are:\n\nMovie actors. Musicians. Athletes. Chefs. Gamers. You name it. We’re a diverse team with diverse interests! At Workato, we’re an open-minded bunch - spreading our mission to help companies focus on things that matter by empowering teams with no-code automation. Workato has also been recognized amongst the “Top 47 Enterprise Startups to Bet Your Career On in 2020” and the “Hottest 13 Productivity Software Startups to Watch in 2020!” by Business Insider.\n\nResponsibilities\n• Shape the product strategy and roadmap to improve the width and depth of Workato’s connectivity\n• Understand the users, market, and competition\n• Communicate the product strategy and requirements to key stakeholders\n• Drive the product life cycle - ideation, design, prioritization, development and delivery\n• Bring teams together to define and implement features\n• Articulate product differentiation and value to internal and external stakeholders\n• Define key metrics and evaluate the quality of connectors\n\nRequirements\nQualifications and Experience\n• Bachelor's degree in a technical field (Computer Science, Engineering or a related discipline)\n• Working knowledge of SaaS applications, Web Service and API, API security and paradigms\n• Experience working with and automating enterprise applications is a plus\n• Well-versed in gathering insights and identifying trends from data (customer interaction, qualitative and quantitative analysis, etc)\n• Hands-on experience building products in a fast-paced environment\n\nAttributes that we are looking for\n• Detail-oriented with superior organizational and time-management skills - balancing multiple projects, deadlines, and requests\n• Driven with a can-do attitude and determination to succeed\n• Strong communication skills - Ability to articulate value, simplify nuanced concepts influence without authority\n\nWhy Workato?\n• Supportive, collaborative, international team environment that supports remote employees (currently all of us!)\n• Long-term prospects for a professional career in a high growth company\n• Flexible Work culture\n• Be part of a community-oriented organization with a history of giving back\n• Best in class technology tools to empower you to do your best work\n• Support for professional development and continuous learning\n• Wellness programs, including fitness challenges and an occasional company day off to recover from Zoom fatigue\n• Company-sponsored team-bonding activities and team celebrations\n• Employee and Customer referral bonuses\n\nAll full-time permanent employees in Singapore will also have the following benefits:\n• Workato Stock Options at one of Silicon Valley’s fastest growing startups\n• Flexible and personalised medical and wellness benefits (protection for hospitalisation and surgical procedures, clinical outpatient visits, accident coverage and more", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9kdWN0IE1hbmFnZXIgKEFQSSBDb25uZWN0aXZpdHkpIiwiY29tcGFueV9uYW1lIjoiV29ya2F0byIsImNvbXBhbnlfbWlkIjoiL2cvMTFkeHB5XzN4ZCIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImNqUkFxYjNhbmNxeTRSWUtBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1SUJDcUlCUVU1VlgwNXhVMEZ0YkZCcE4yNW1TVE5CWmxNeGFHdFdaWEZzUzAxS2VGbFJVVmxWYlRBdFpGSnVVVFkwWVhKUGJERm5kbkJzYnpjMFoyZHlkVjlUVW05YVRrMWFTbEJrUms5YU5VeE9hMjFMZW1sRVdGWTFhbFZuTVhocFdVWm5SM0pmYjFsM2RGTmpPV2hZTFc1VFdtSmFjakpFUTNSbFVtVTNTbTltWm5WNU5tcGxiMDl1TWtSaFFuRkxUMlp6YUZWU1Iwb3lTbDl2Tldwd2RrUnFOMjFuRWhkTU0yMURXVTF5ZDAwMWNVODVVSGRRTlhCdE5HdEJNQm9pUVU5TldWSjNRbE5HUWpoWVJGUnJibVZoWkdkd2RubDRUa3g1VW10U09XeEpadyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzY3IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJheXQuY29tIiwibGluayI6Imh0dHBzOi8vd3d3LmJheXQuY29tL2VuL3NpbmdhcG9yZS9qb2JzL3Byb2R1Y3QtbWFuYWdlci1hcGktY29ubmVjdGl2aXR5LTU3MzgzMjI1Lz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:Google Sans,arial,sans-serif}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Management", "value": "GC18"}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Business Operations", "value": "GC06"}, {"text": "Advertising and Marketing", "value": "GC03"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Accounting and Finance", "value": "GC01"}, {"text": "Legal", "value": "GC17"}, {"text": "Farming and Outdoors", "value": "GC13"}, {"text": "Human Resources", "value": "GC15"}, {"text": "Sales and Retail", "value": "GC26"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "Product manager", "value": "product manager"}, {"text": "Manager", "value": "manager"}, {"text": "Project manager", "value": "project manager"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Development manager", "value": "development manager"}, {"text": "Director", "value": "director"}, {"text": "Manufacturing manager", "value": "manufacturing manager"}, {"text": "Marketing manager", "value": "marketing manager"}, {"text": "Plant manager", "value": "plant manager"}, {"text": "Production manager", "value": "production manager"}, {"text": "Program manager", "value": "program manager"}, {"text": "Regional", "value": "regional"}, {"text": "Senior", "value": "senior"}, {"text": "Sr. manager", "value": "sr. manager"}, {"text": "Account manager", "value": "account manager"}, {"text": "Admin manager", "value": "admin manager"}, {"text": "Affairs manager", "value": "affairs manager"}, {"text": "Assistant", "value": "assistant"}, {"text": "Brand manager", "value": "brand manager"}, {"text": "Commodity manager", "value": "commodity manager"}, {"text": "Communication", "value": "communication"}, {"text": "Customer", "value": "customer"}, {"text": "Dealer", "value": "dealer"}, {"text": "Devops engineer", "value": "devops engineer"}, {"text": "Engineering", "value": "engineering"}, {"text": "Executive", "value": "executive"}, {"text": "Product specialist", "value": "product specialist"}, {"text": "Production supervisor", "value": "production supervisor"}, {"text": "Risk manager", "value": "risk manager"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Transactional", "value": "transactional"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Internship", "value": "INTERN"}, {"text": "Part-time", "value": "PARTTIME"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Toiletries", "value": "/business/naics2007/3256"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Foods & Beverages", "value": "/business/naics2007/311"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Management", "value": "/business/naics2007/55"}, {"text": "Research", "value": "/business/naics2007/5417"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "Citi", "value": "/m/01dfb6"}, {"text": "Binance", "value": "/g/11hcz1r4wl"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "Amazon", "value": "/m/0mgkg"}, {"text": "Standard Chartered", "value": "/m/02hszk"}, {"text": "United Overseas Bank", "value": "/m/04gjd1"}, {"text": "Apple", "value": "/m/0k8z"}, {"text": "Tata Communications", "value": "/m/04338k"}, {"text": "Workato", "value": "/g/11dxpy_3xd"}, {"text": "BNY  Mellon", "value": "/m/02vps5x"}, {"text": "DBS Bank", "value": "/m/01q7n5"}, {"text": "EPAM Systems", "value": "/m/0dlnrc"}, {"text": "GVT Government Technology Agency (GovTech)", "value": "/g/11gh0528nq"}, {"text": "Grab", "value": "/m/0134c_p9"}, {"text": "Paypal", "value": "/g/122s91_5"}, {"text": "PeopleSearch Pte Ltd", "value": "/g/11c73ngn0w"}, {"text": "Randstad", "value": "/m/08pt1z"}, {"text": "Singapore Airlines", "value": "/m/015f2x"}, {"text": "TEKsystems (Allegis Group Singapore Pte Ltd)", "value": "/g/11b6g4bkv0"}, {"text": "ABBOTT LABORATORIES (SINGAPORE ) PRIVATE LIMITED", "value": "/m/09m57z3"}, {"text": "ADVANCE INTELLIGENCE PTE. LTD.", "value": "/g/11dymfkxss"}, {"text": "AXA", "value": "/m/04mn99"}, {"text": "Adecco Personnel Pte Ltd", "value": "/m/08gz46"}, {"text": "Adidas Group", "value": "/m/01jtml"}, {"text": "Aetna, a CVS Health Company", "value": "/m/0kg8x"}, {"text": "Agency for Science, Technology and Research", "value": "/m/0gmjcg"}, {"text": "Alibaba", "value": "/m/07s6ctl"}, {"text": "Argyll Scott", "value": "/g/11dxpk2374"}, {"text": "Autodesk", "value": "/m/018nm3"}, {"text": "Barry Callebaut", "value": "/m/03clky2"}, {"text": "BioMind", "value": "/g/11dymfr2l6"}, {"text": "CHUBB ASIA PACIFIC PTE. LTD.", "value": "/m/09m8xyh"}, {"text": "Cargobase", "value": "/g/11dxppfsjn"}, {"text": "Cargobase Pte Ltd", "value": "/g/11fy240nxm"}, {"text": "DKSH", "value": "/m/0dj2nh"}, {"text": "Dathena", "value": "/g/11dxprdn6y"}, {"text": "Dyson", "value": "/m/05cskg"}, {"text": "Enggsol Pte Ltd", "value": "/g/11g9mnfmm1"}, {"text": "Ethos BeathChapman", "value": "/g/11c73z0xm0"}, {"text": "Eu Yan Sang", "value": "/m/03cl9hn"}, {"text": "Flintex Consulting Pte. Ltd.", "value": "/g/11h1z41pzb"}, {"text": "GIVAUDAN SINGAPORE PTE LTD", "value": "/g/11f00wn519"}, {"text": "Goldman Sachs", "value": "/m/01xdn1"}, {"text": "GovTech Singapore", "value": "/g/11dxpkfs_6"}]}]}