{"search_metadata": {"id": "60827b4b8cd8786cc6b221e3", "status": "Success", "json_endpoint": "https://serpapi.com/searches/10e9617697fe052a/60827b4b8cd8786cc6b221e3.json", "created_at": "2021-04-23 07:46:19 UTC", "processed_at": "2021-04-23 07:46:19 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28solution+architect%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=190", "raw_html_file": "https://serpapi.com/searches/10e9617697fe052a/60827b4b8cd8786cc6b221e3.html", "total_time_taken": 1.37}, "search_parameters": {"q": "(solution architect) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "190"}, "jobs_results": [{"title": "Solution Architect, ICT", "company_name": "Platform&Co Pte Ltd", "location": "Singapore", "via": "via Glassdoor", "description": "Platform&Co is working in partnership with an ICT client to hire a professional Solution Architect to be part of its Pre-Sales team.\n\nThe ideal person will have proven experience in the execution of complex projects by studying and understanding clients’ requirements, identifying gaps (if any) and defining solutions to bridge the gap.\n\nResponsibilities:\n• Provide pre-sales technical consultation and develop reliable solutions to answer customer requirement and win bids/tenders\n• Provide technical support to Sales team for networking solutions\n• Liaise with clients and Sales team to understand the needs of business\n• Ensure compliance to solution architectural design in the implementation of projects\n• Provide architectural guidance to the project team\n• Render consulting and technical support services on project implementation to the project team\n• Explain technical issues and IT solution strategies to stakeholders and other IT professionals\n• Keep accurate record of materials used... expected deliverables, and milestones achieved\n• Ensure that solution milestones are accomplished at the right time\n• Guide the activities of the solution architecture unit to ensure timely completion of projects\n• Review the proposal of vendors and suppliers to ensure that quality inputs are delivered at the least possible cost\n• Identify and mitigate existing business risk or risks associated with solution architecture.\n\nRequirements:\n• Min. 5 years’ experience as network engineer and has worked in a pre-sales environment\n• CCNP/CCNA certified\n• Familiar with Cisco and Aruba technologies\n• Experience in designing campus networks is a must, with good knowledge of data centre solutions.\n• Self-starter, and able to work under pressure and tight deadlines\n• Good interpersonal, communication and presentation skills\n\nIf you are interested in this role, please click apply now or email reachus@platformnco.com with your updated CV in word format.\n\nOnly shortlisted candidates will be responded to, therefore if you do not receive a response\n\nwithin 14 days please accept this as notification that you have not been shortlisted.\n\nPosting Personnel:\n\nLee Ee Fang (R1980370)\n\nPlatform&Co Pte. Ltd.\n\nCo. Registration: 201936542N", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2x1dGlvbiBBcmNoaXRlY3QsIElDVCIsImNvbXBhbnlfbmFtZSI6IlBsYXRmb3JtXHUwMDI2Q28gUHRlIEx0ZCIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiNU9lUkpSbERIdUVocGtQaUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBHbGFzc2Rvb3IiLCJsaW5rIjoiaHR0cHM6Ly93d3cuZ2xhc3Nkb29yLnNnL2pvYi1saXN0aW5nL3NvbHV0aW9uLWFyY2hpdGVjdC1pY3QtcGxhdGZvcm0tcHRlLUpWX0lDMzIzNTkyMV9LTzAsMjJfS0UyMywzNS5odG0/amw9NDAzNzQ2ODY1NFx1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Solution Architect", "company_name": "Sciente Consulting Pte. Ltd.", "location": "Singapore (+1 other)", "via": "via LinkedIn", "description": "Job SummaryWe are looking for a Solution Architect to engineer technical solutions for web & mobile applications in emerging technologies for Investment-related projects.\nMandatory Skill-set\n• Bachelor's Degree in Information Technology, Info Systems, Computer Science or other related disciplines;\n• At least 12 years of technical experience in web and mobile application development and management;\n• Proficient in React, Redux, Java, HTML, SOAP, CSS, XML and Spring Boot;\n• Familiar with Waterfall and Agile models;\n• Meticulous and well-versed in systems limitations and solutioning capabilities;\n• Strong analytical, creative and problem solving skills;\n• Strong stakeholder engagement skills to manage internal and external stakeholders;\n• Strong written and verbal communication skills to interact with business and technical teams;\nDesired Skill-set\n• PMP-certified;\n• TOGAF certified;\n• Certified ScrumMaster;\n• Experience in financial services industry.\nResponsibilities\n• Responsible for... developing and integrating the organizations information systems;\n• Asses the existing systems architecture and recommend solutions to improve it;\n• Lead the development team to deliver application projects and other major initiatives;\n• Work with cross-systems teams to integrate the systems for better efficiency and effectiveness;\n• Define, maintain and comply application design standards to the systems Architecture framework & Enterprise Architecture framework;\n• Provide technical leadership on emerging technologies adoption and identify potential opportunities and benefits for implementation;\n• Assist with solving technical problems when they arise along with managing production support to ensure incident management within SLA;\n• Address technical concerns, ideas and suggestions and groom the development teams to build their capabilities.\nShould you be interested in this career opportunity, please send in your updated resume to apply@sciente.com at the earliest.\n\nWhen you apply, you voluntarily consent to the disclosure, collection and use of your personal data for employment/recruitment and related purposes in accordance with the SCIENTE Group Privacy Policy, a copy of which is published at SCIENTE's website (https://www.sciente.com/privacy-policy).\n\nConfidentiality is assured, and only shortlisted candidates will be notified for interviews.\n\nEA Licence No. 07C5639\n\nWe are looking for a Solution Architect to engineer technical solutions for web & mobile applications in emerging technologies for Investment-related projects.\n\nSkills: Solution Architect, Technical Architect, Solution Architecture\n\nExperience: 10.00-14.00 Years\n\nEducation: Bachelors/ Degree", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2x1dGlvbiBBcmNoaXRlY3QiLCJjb21wYW55X25hbWUiOiJTY2llbnRlIENvbnN1bHRpbmcgUHRlLiBMdGQuIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiI2Mmh3VHpjUHdjd2wtcmhIQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExpbmtlZEluIiwibGluayI6Imh0dHBzOi8vc2cubGlua2VkaW4uY29tL2pvYnMvdmlldy9zb2x1dGlvbi1hcmNoaXRlY3QtYXQtc2NpZW50ZS1jb25zdWx0aW5nLXB0ZS1sdGQtMjQ1OTE0NTkwNz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Cloud Architect", "company_name": "None", "location": "Singapore", "via": "via Jobs | Fidanto", "description": "Design, testing and implementation of Cloud based architectures for Amazon Web Services and Microsoft Azure To setup, manage and maintain servers within Cloud infrastructure Configure and maintain software components such as OS, web servers, etc. Provide consultancy & support to the sales team Develop architecture to satisfy customer requirements and ensure system stability, interoperability, portability, security and scalability Evaluate and recommend technology or solution based on technical capabilities, functionalities, costs vs benefits and risks criteria Define, document and communicate project progress to client stakeholders and project teams Provide support for infrastructure framework by responding to escalated issues, troubleshooting errors and developing technical solutions Participate in after-hours upgrades, troubleshooting, and/or on-call availability as needed 3 to 5 Years of experience in IT industry with Java development background. Having worked on architectural... design, optimizations and performance tuning. Having good understanding of micro services architecture, deployment design, networking architecture. Exposure to cloud is an added advantage. Strong Java development background with frontend and backend web applications Excellent understanding of typical multi-tier architectures: web servers (Apache, Nginx, IIS), caching, application servers, & load balancers RDBMS (MySQL, Oracle, SQL Server), NoSQL Having experience to work on large scale web application Familiarity with loose coupling and stateless systems Understanding of different consistency models in distributed systems Experience with CDN and performance concepts Network experience with route tables, access control lists, firewalls, NAT, HTTP, DNS, IP & OSI Network Knowledge of RESTful Web Services, XML, JSON Strong understanding Jquery, JavaScripts, HTML, CSS Familiarity with the software development lifecycle Work experience with information and application security including public key encryption, SSH, access credentials, & X.509 certificates Excellent Verbal and Written communication skills Experience with Command Line Interface, AWS CloudFormation/Azure Template, Terraform Should have in depth understanding of AWS or Azure services Hands-on experience with AWS or Azure required Certified AWS Solution Architect Or Azure 70-533 will be an added advantage", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDbG91ZCBBcmNoaXRlY3QiLCJjb21wYW55X25hbWUiOiJOb25lIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJiYUU3eE5YdnRFZHV6dE41QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnMgfCBGaWRhbnRvIiwibGluayI6Imh0dHBzOi8vc2cuZmlkYW50by5jb20vam9icy9qb2Itb3BlbmluZy9jb21wdXRlci1zeXN0ZW1zLWVuZ2luZWVyc2FyY2hpdGVjdHMvY2xvdWQtYXJjaGl0ZWN0LTI3NTQzMjczMT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Network Engineer", "company_name": "None", "location": "Singapore", "via": "via Recruit.net", "description": "Roles and Responsibilities Providing daily global level 2/3 administration & support on networking (LAN,WiFi, NAC, WAN, SD-WAN, Internet) Lead and drive on network projects and business expansion projects which support business demands Evaluate and recommend new technologies, co-ordinate with other IT sub-function heads to understand user requirements across geographies and design the IT services to meet the business needs. Monitoring of IT Infrastructure to ensure optimal IT Services delivery Cloud computing migration, operation and maintenance. Support overseas\nemote office IT infrastructure setup. Job requirements Technical know-how and experience in IT solutions such as (but not limited to) and at least operated in more than one of the following:A must to have in-depth experience in architecture design, managing and support the following applications/systems – Cisco & Aruba networking solutions, 802.1x NAC/NAP technologies, MPLS/IPSec/SDN WAN/Internet. Cloud Computing Platforms... exposure preferred (Office365, Azure, AWS,etc) Good knowledge in administrating the following technologies will be a plus – Microsoft Lync/Skype for Business, Linux based Operating Systems, Public & Private Certificates management & monitoring solution such as WhatsUp Gold or SolarWinds. Certifications such as Cisco CCNP/CCDP/CCIE, Aruba, VMware, PMP/ PRINCE2, ITIL V3, AWS Certified Solutions Architect/ Azure Solutions Architect will be an added advantage. Roles and Responsibilities Providing daily global level 2/3 administration & support on networking (LAN,WiFi, NAC, WAN, SD-WAN, Internet) Lead and drive on network projects and business expa Skills: Ccna, Ccnp, Cisco Technologies, Data Center, Firewalls, Geography, Information Technology, Network Security, Networking, Security, Switches, Troubleshooting, Wans, It Services, new technologies , nac, user requirements Experience: 2.00-5.00 Years", "extensions": ["7 days ago", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJOZXR3b3JrIEVuZ2luZWVyIiwiY29tcGFueV9uYW1lIjoiTm9uZSIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoidkpXMm1OdGF0ZXlwNHdwc0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBSZWNydWl0Lm5ldCIsImxpbmsiOiJodHRwczovL3d3dy5yZWNydWl0Lm5ldC9qb2IvbmV0d29yay1lbmdpbmVlci1qb2JzLzBDODBDRkM0MDEwOTY5NzU/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Senior-Lead IT Architect", "company_name": "Ncs Pte. Ltd.", "location": "Singapore (+1 other)", "via": "via Monster Singapore", "description": "Key Roles & Responsibilities\n\nProject Delivery\n• As the face of Application Architect Practice, advocate the value and offerings of the team among the stakeholders to sustain and grow the team.\n• Ability to provide overall leadership in complex project(s) independently.\n• Lead in complex design and manage team of specialists and architects, assigning and managing technical tasks to achieve the end architectural deliverables.\n• Accountable to the produced system-level application architecture that includes high-level design, architectural policies and principles, design and programming guidelines, implementation risks and mitigation measures, software development and integration strategies, software configuration controls, etc.\n• Maintain control over the architecture throughout the entire software development lifecycle by continuously making critical adjustments to the architecture to ensure desired results are achieved.\n• Involve in requirement analysis phase to ensure the... implementation feasibility of functional specifications. Highlight requirement gaps, disproportional construction efforts, technical challenges and any other issues to business analyst teams.\n• Provide thought leadership in the project through established architecture design and development methodologies, leveraging on available IP assets/accelerators to align the technical teams in consistency and best practices in technical delivery in an efficient and effective manner. Additionally, continue to own and enhance the methodologies and IP assets to improve technical delivery excellence in architecture design and delivery.\n• When in project, be the customer’s technical face and key trusted technical advisor to ensure technical excellence within the project scope.\n• As lead architect in complex projects, engage customers to establish architectural decisions, or other technical and technical resources issues.\n\nOrganisation Development\n• Coach, train and mentor Architects in their career path\n• Set up governance and operational structure to grow architect capabilities and also resources management.\n• Create and advocate Community of Practice (CoPs) as a common framework for technology knowledge with the rest of organisation.\n• Encourage and participating in contributing to knowledge repository on experience learnt through project implementation.\n\nBusiness Development\n• Be involved in pre-sales solution activities to review technical solution and estimated effort prepared by proposal team.\n• Help NCS to win mindshare to be speaker or panellist in IT-related trade show or seminar.\n\nThe Ideal Candidate Should Have/ Be\n• Typically 15 years’ experience in technical role with responsibilities that apply in-depth knowledge of architectural principles and design.\n• Experience in developing and deploying complex scalable production applications on Cloud/PaaS platforms and Containers.\n• Working knowledge of DevOps software development tools and methodologies.\n• Broad and deep knowledge in current IT technologies.\n• Proficiency in Java-related technology specification and standards.\n• Certification in appropriate technologies is an advantage.\n• Self-motivated with a positive can-do attitude, creative with excellent presentation, communication, negotiation and interpersonal skills including strong persuasive techniques.\n• Ability to lead, develop and maintain respectful and trusting relationship.\n• Proficient in written and spoken English.\n• Degree in Computer Science / Computer Engineering / Information Technology related field, or IT equivalent.\n• Ability to travel as required", "extensions": ["7 days ago", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3ItTGVhZCBJVCBBcmNoaXRlY3QiLCJjb21wYW55X25hbWUiOiJOY3MgUHRlLiBMdGQuIiwiY29tcGFueV9taWQiOiIvbS8wMjgyNzQ2IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoicG51S1BrTExQRGozRkhIUUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXQ0QkNxSUJRVTVWWDA1eFUwODJTbWwxYTNSZlozZFVXSGRwUVhOSFFXaDRVM2xGVW5CVFNWRTBhM1kyY1dGVGIwSnNPRVJKVFRRMVQwcGlWWFJDUkRSUWVrUnRkMVppVlV4b1lUZGFkSE5pUTNCTGFFcFhZMmcxYTJkMU1sUjRURkZQUms1M1dIcEtWbUpLWjNVMmFXY3pXVXRzZVV4aVUwVk1ORlI2Um05eU0xWnpWMFUxWVVwMVJHNHRjVVpzVVhBeVpubGlaMHhpVDNoUU1UWXRibmwwVTNNeU5GRlJFaE5VU0hWRFdVbDJha1k0TW1WelVWZFFYMEpCR2lKQlQwMVpVbmRFUjJ4SFdFcDNMVlprVjNaSVFYSnZNamxVWjNCMlgwVXRTeTFSIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMjUiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTW9uc3RlciBTaW5nYXBvcmUiLCJsaW5rIjoiaHR0cHM6Ly93d3cubW9uc3Rlci5jb20uc2cvYW1wL2pvYi12YWNhbmN5LXNlbmlvci1sZWFkLWl0LWFyY2hpdGVjdC1uY3MtcHRlLWx0ZC1zaW5nYXBvcmUtMjc3NDk2ODkuaHRtbD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "IP/MPLS SOLUTION ARCHITECT", "company_name": "Mantu", "location": "Singapore", "via": "via LinkedIn", "description": "• Be the Technical Solution Lead to engage customers on their IP/MPLS network challenges & programs and to offer a solution to them during both Pre-Sales and Post-sales phases.\n• Knowledge of IP (unicast and multicast technologies and Clock synchronization) as the role will be responsible for designing and implementing IP/MPLS network for IPTV/Triple Play, Metro-E, CORE and Mobile Backhaul, BNG, CGNAT, AA/DPI environments.\n• Responsible for design validation and POC/Trial/BMT approaches, leads the actual testing & validation with engineers and towards customers.\n• Leads certain IP/MPLS solutioning and domain to create and maintain Test documents, tools and templates for re-usability in POCs, Trials and Projects.\n• Work closely with the TPM and PM to ensure delivery of the IP/MPLS solution/project so as to recognize Sales.\n• Perform role/s and scope under Professional Services such as Network Audit Service work, Customer Resident Engineer/Resident Consultant, network migration/swap and... delivering Customized Training to customers/partners in APAC region.\n• Perform project roles such as Solution/Lead Network Architect or Integration Expert under deployment services to minimally recover cost or to generate services revenue on projects (ION and non-ION) we are supporting in APAC.\n• Support IP/MPLS projects as IPR Solution Architect role championing the High-Level and E2E Architecture and Design\n• Guide and support Domain Architects and Integration Engineers on Low-Level Design and Integration/Testing/MOP where needed.\n• Interface with regional PLMs on product features clarification, EOL/EOS and enhancement during Post-Sales phase as enquired by customers or/and during testing/validation and proposed (upscope) solution as part of project work.\n• Provides mentorship, knowledge transfer and technical support to project team members.\n\nRequirements\n• Bachelor in Telecom/Data/Computer Networking Engineering or equivalent\n• 7-10 years or more experiences in designing or/and implementing IP/MPLS networks and/or IP projects.\n• Good knowledge and strong background in IP technologies, Data Communication, LAN, WAN, MPLS and VPN services.\n• IP Certification and Multi-vendor IOT experiences is advantage.\n• Good business understanding in vendor or/and operator/service provider environment.\n• Strong troubleshooting, problem solving skills and working experiences on test equipments.\n• Clearly communicate (verbal and written) in English.\n• Self-motivated and self-development/learning.\n• Comfortable to meet and discuss solutioning/technology and technical escalation (network outage and resolution) with senior management in both company and customers", "extensions": ["17 days ago", "Full–time"], "detected_extensions": {"posted_at": "17 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJJUC9NUExTIFNPTFVUSU9OIEFSQ0hJVEVDVCIsImNvbXBhbnlfbmFtZSI6Ik1hbnR1IiwiY29tcGFueV9taWQiOiIvbS8wYjZteGtjIiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiMlhwaVYwX1NRRjQ5REdVdkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXNnQkNvd0JRVTVWWDA1eFUxVjJPRVJpU0RWMWJ6SlZTRXhYVVRsbkxWZFZNVEIzY0U1clYwVlZUaTA1YjNObE4yVmtPWHBEUWsxb2IwcE5VbVpUZFc1R2FHRnpNR1l3UkhwVVJqWTFibTV1TURaT1RuRkZiamhJT1VkMGNrNWlaM05LWjNGS2FqTTJRemxHVHpGcVNIcHdlRE54VWtGTWQwNU9aVVEzY1RWUFowOHdjR3BNV21sSmFVVlBaV3RRZG5rU0UxUklkVU5aU1hacVJqZ3laWE5SVjFCZlFrRWFJa0ZQVFZsU2QwRlJaRFJ4ZUZrdFgwTm9PRWxzVUdOUlNsVTVNalJ6WkdRemJVRSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzMyIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExpbmtlZEluIiwibGluayI6Imh0dHBzOi8vc2cubGlua2VkaW4uY29tL2pvYnMvdmlldy9pcC1tcGxzLXNvbHV0aW9uLWFyY2hpdGVjdC1hdC1tYW50dS0yNDkxODU1MDQ1P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Cloud Application Architect", "company_name": "None", "location": "Singapore", "via": "via Singapore", "description": "The Main Responsibilities: Lead technical and design discussions with IT executives to help enterprises speed their adoption of new cloud native technologies and practices Leverage new technology paradigms (e.g., serverless, containers, microservices) Providing deep software development knowledge with respect cloud architecture, design patterns and programming. Migrate monolithic applications to micro services architectures Support the full project lifecycle - to include: strategy, design, implementation and automation, as well as production-readiness and documentation activities. Participate in the definition of application architecture, technology stack; research new technologies, and prototype new ideas. Develop future state cloud blueprints for key systems along with a transition plan and a roadmap, prototype solutions as needed. What We Look For in a Candidate: 5+ years of large scale software development or application engineering with recent coding experience in two or more of... the following languages: Java, JavaScript, C/C++, C#, Objective-C, Node.js, .NET, Python, PHP or Ruby 5+ years of experience as a technical specialist in Customer-facing roles with the ability to perform pre-sales solutioning Proven ability to architect, design and implement cloud-based and/or cloud-native solutions Hands-on experience with containerization platforms and server-less computing like Docker, EKS, Lambda. Experience with migrations to the cloud from both physical and virtual environments Good exposure to Agile software development and DevOps practices such as Infrastructure as Code (IaC), Continuous Integration and automated deployment Knowledge of DevOps methods and CI/CD automation practices Experience in Configuration Management platforms (e.g. Chef, Puppet, Salt, or Ansible) Excellent critical thinking and analytical skills. Certified solution architect, DevOps in public cloud technologies BS level technical degree or equivalent experience; Computer Science or Engineering background preferred EA Licence No.:18S9405 / EA Reg. No.:R1330864To apply please click the Apply button or send us your updated profile to Percept Solutions is undergoing a growth phase and are on the lookout for talent. Applicants are encouraged to follow Percept Solutions on LinkedIn @ https://www.linkedin.com/company/percept-solutions/ to stay up to date on our upcoming roles and events", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDbG91ZCBBcHBsaWNhdGlvbiBBcmNoaXRlY3QiLCJjb21wYW55X25hbWUiOiJOb25lIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJ1QlJOaWFCWEZXX1U3RVhfQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFNpbmdhcG9yZSIsImxpbmsiOiJodHRwczovL3NnLmZpZGFudG8uY29tL2pvYnMvam9iLW9wZW5pbmcvYXJjaGl0ZWN0cy1leGNlcHQtbGFuZHNjYXBlLWFuZC1uYXZhbC9jbG91ZC1hcHBsaWNhdGlvbi1hcmNoaXRlY3QtMjc1NTI5MDkyP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Solution Architect – SAP SuccessFactors", "company_name": "HR PATH APAC SINGAPORE PTE. LTD.", "location": "Singapore", "via": "via Recruit.net", "description": "Job Description & Requirements\n\nLocation: Singapore (SEA)\n\nExperience: 5+ years\n\nSalary/Package: On application\n\nEligibility: Singapore Citizen or Singapore Permanent Resident\n\nLanguage: English, Mandarin (preferred but not required)\n\nWork Area: SAP SuccessFactors Implementation and Consulting Delivery\n\nExpected Travel: 10 -30%\n\nCareer Status: Manager/Executive\n\nEmployment Type: Permanent - Full Time\n\nAbout us\n\nHR Path Company is the Human Resource Solutions Specialist. As a partner of the leading vendors of the market, it carries out HRIS implementation projects and payroll outsourcing for large accounts as well as for SMEs. HR Path supports you in all your HR strategies, in France and internationally.\n• ADVISE: We advise and support companies in the definition of a method for aligning their HR processes with the company’s overall vision and strategy. The creation of synergies by HR is thus a source of added value for the company and its employees\n• IMPLEMENT: According to the... stakes, HR Path in the technical and functional setting up of all HR solutions, Oracle, SAP SuccessFactors, Talentsoft and Workday\n• RUN: We operate the HR solution that supports the digital transformation of your company\n\nThe group, established in 2001, has over 1000 employees, supports more than 1,300 clients and generates over $125M revenue. Headquartered in Paris, HR Path also has international subsidiaries in 18 different countries.\n\nWe are the most experienced SuccessFactors partner in APAC\n\nFor more information, visit https://www.hr-path.com/en/about-us/apac\n\nWhat will you be accomplishing?\n\nWe are currently looking for an experienced Solution Architect with passion for technology and HR to help our clients unlock the potential of their employees and build world class HR processes and practices through the deployment of SAP SuccessFactors software. Not old school, on premise systems, that take years to implement, but fast, fluid, dynamic cloud-based systems that are engaging, easily adopted and drive real personal and organisational productivity.\n\nYou will bring your proven SAP SuccessFactors experience and HR knowledge to actively lead projects and guide clients through requirements gathering and contribute to business process improvement, stakeholder engagement, change management, quality assurance, risk management and user enablement. Though collaboration and effective project delivery you will ensure clients extract the full value from the Workday solution.\n\nThis is a rapidly changing environment, so we are looking for a team that want to embrace the evolution of HR as we develop dynamic technology to support Business and HR best practices.\n\nScope & Responsibilities:\n• Work closely with senior stakeholders to understand their business requirements and contribute to the design and implementation of solutions\n• Deliver advisory services and leading practices in support of technology enabled business change integrator selection, vendor selection, application studies, solution architecture, or program diagnostics\n• Create innovative offerings, staying relevant and in sync with market changes and innovations\n• Responsible for the functional and technical part of a specific domain, as well as the capitalization of the new solutions\n• Delivers documentation aimed at making the consultants more operational (sharing of reference documents, provision of training support, etc.)\n• Provides support to the consultants as part of their requests by email, phone or via the forum\n• Ensures a technical overview on the new solutions\n• Writes setting guides on the new solutions proposed by the editor\n• Participates in internal projects to improve our offers (implementation accelerators, industrialization, tools, etc.)\n• Provides internal or external training in his or her area of expertise\n• Participates in tendering or pre-sales answers on the field of specialty (technical feasibility, costing, demo, etc.)\n• Support internal projects within the area of expertise\n\nWhat else do you need to know?\n• This is an exciting and fast-paced work environment\n• We love working with people who are passionate in their area of expertise, strong technical ability, creative, great interpersonal skills, innovative mindset, well-organised, attention to detail and great sense of humour\n• We are an advocate of work-life balance with a positive and healthy work culture\n• The team is very supportive and works cohesively to continue improving the implementation of Workday in the years to come\n• If you are looking for new challenges and can work independently but effectively in a non-traditional corporate environment, this is the place to be!\n\nRequirements:\n• At least a university degree in HR or IT or any other related discipline\n• Must have a minimum of 5-8 years on SuccessFactors implementation\n• Minimum of 5 end to end SuccessFactors implementation, including hands on design and configuration\n• Must be certified in SuccessFactors modules such as Employee Central particularly in Core HR\n• SuccessFactors certification in Learning Management System, Recruiting, Onboarding is a plus\n• Advanced understanding of HR processes, organisational structures and business functions\n• Advanced knowledge of the architecture, functionality and relation to business processes of the ERP software and knowledge of at least one sub-module of SuccessFactors solution, preferably on Employee Central, Recruiting, Onboarding and basic knowledge of other modules\n• Fluent in English language\n• Excellent presentation and communication skills\n• Demonstrate willingness to learn and challenge business practices\n• You have a forward-thinking and agile mindset\n\nIn addition, the following will also be essential:\n• Successfully combine strong leadership skills with sound technical knowledge and ability to clearly communicate key recommendations to clients\n• Track record of creating enduring client relationships based on trust, successful business development and credible program execution\n• Develop relationships of mutual trust with people inside and outside of their organisation based on respect, integrity, positive regard and an appreciation of the uniqueness of the individual\n\nPerks & Benefits:\n• Competitive compensation package\n• Health and medical benefits\n• Excellent work-life balance\n• Diverse and inclusive work environment\n• Dynamic, exciting and vibrant team culture\n• Comprehensive training programs\n• Opportunities to develop new skills and career progress for our talents", "extensions": ["7 days ago", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2x1dGlvbiBBcmNoaXRlY3Qg4oCTIFNBUCBTdWNjZXNzRmFjdG9ycyIsImNvbXBhbnlfbmFtZSI6IkhSIFBBVEggQVBBQyBTSU5HQVBPUkUgUFRFLiBMVEQuIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJFRzlSVUhvaWxCRlEyck02QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFJlY3J1aXQubmV0IiwibGluayI6Imh0dHBzOi8vd3d3LnJlY3J1aXQubmV0L2pvYi9zb2x1dGlvbnMtYXJjaGl0ZWN0LWpvYnMvMjNDM0NDNjlFRUZFN0JDND91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Technical Architect", "company_name": "LingoAce", "location": "Singapore (+1 other)", "via": "via Glassdoor", "description": "About LingoAce\n\nLingoAce brings language learning to life, combining our expertise of authentic teaching with new-grade technology to deliver the most engaging and effective online classes for the young modern learner. We understand the challenges of learning a new language in a non-immersive environment with traditional passive language-teaching. That’s why we set out to transform the way modern young learners are engaged, with the goal of making language learning fun and fulfilling.\n\nWith a team more than 500 strong, and over 2,500 certified teachers currently in our company, we offer a variety of globally-accredited Chinese syllabi, catering to the diverse proficiencies and cultural backgrounds of learners from over 80 countries.\n\nWe have also recently closed our series B funding round, just months after securing our series A funding. Some of our great partners and backers include: Tiger Global, Sequoia Capital India, Owl Ventures, Shunwei Capital & Decent Capital.\n\nJob... Description\n\nWe are looking for a Technical Architect to design the structure of our IT systems and oversee programs to ensure the proper architecture is implemented. In this role, you should be an excellent communicator who is able to translate complex requirements into functional architecture.\n\nResponsibilities\n• Understand company needs to define system specifications\n• Plan and design the structure of a technology solution\n• Evaluate and select appropriate software or hardware and suggest integration methods\n• Ensure the implementation of agreed architecture and infrastructure\n• Address technical concerns, ideas and suggestions\n• Monitor systems to ensure they meet both user needs and business goals\n\nRequirements\n• Proven experience as a Technical Architect or Project Manager\n• Hands-on experience with software development and system administration\n• Understanding of strategic IT solutions\n• Experience in project management and service-oriented architecture\n• Familiarity with various operating systems (e.g. Windows, UNIX) and databases (e.g. MySQL)\n• Experience in cloud technologies\n• Problem-solving aptitude\n• Organizational and leadership skills", "extensions": ["4 days ago", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJUZWNobmljYWwgQXJjaGl0ZWN0IiwiY29tcGFueV9uYW1lIjoiTGluZ29BY2UiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IlhjdnU4QThuUXllSEdUbWFBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gR2xhc3Nkb29yIiwibGluayI6Imh0dHBzOi8vd3d3LmdsYXNzZG9vci5zZy9qb2ItbGlzdGluZy90ZWNobmljYWwtYXJjaGl0ZWN0LWxpbmdvYWNlLUpWX0lDMzIzNTkyMV9LTzAsMTlfS0UyMCwyOC5odG0/amw9MzcwNDU3NzU3MFx1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Database Partner Solutions Architect", "company_name": "AMAZON WEB SERVICES SINGAPORE PRIVATE LIMITED", "location": "Singapore (+1 other)", "via": "via LinkedIn", "description": "Are you passionate about databases and helping businesses transform using the cloud? We’re looking for a technical advisor to support Software Vendors and Consulting Partners in ASEAN/India.\n\nAbout Amazon Web Services\n\nAt Amazon, our vision is to be earth’s most customer-centric company. In 2006, we launched Amazon Web Services, giving customers access to the same cloud technology we built to serve millions of shoppers on Amazon.com. Amazon Web Services (AWS) is a secure cloud services platform, offering computing power, database storage, content delivery, and other functionality to help businesses scale and grow.\n\nRoles and Responsibilities\n\nAs a Partner Solutions Architect you’ll help build an ecosystem of consulting partners for our database services. This involves engaging with top tier technology companies to integrate AWS database services into their solutions. In this hands on, technical position for you’ll dive deep into a variety of complex problems. As a crafter of scalable... architectures, you’ll help customers build optimized solutions that can scale to deliver outcomes for multiple customers.\n\nDay to day you’ll help companies understand and build complex database architectures. This involves working closely with our Partner Management teams to help partners build in AWS and chose AWS as their preferred platform. Shaping and delivering a strategy to accelerate use of AWS database solutions is a key part of the role.\n\nYou will own the technical engagement with partners and their ultimate success. This includes implementation projects, developing a deep expertise in the AWS technologies. Additionally, you’ll develop a broad know-how around how our services are constructed. As a trusted advisor, you’ll represent Amazon and partner capability within a customer’s environment and drive discussions with executives and technology leaders.\n• Ensure success in building and migrating applications, software and services on the AWS platform\n• Educate customers/partners of all sizes on the value proposition of AWS\n• Participate in deep architectural discussions to ensure solutions are designed for successful deployment in the cloud.\n• Conduct one-to-few and one-to-many training sessions to transfer knowledge to customers considering or already using AWS.\n• Capture and share best-practice knowledge amongst the AWS solutions architect community.\n• Author or otherwise contribute to AWS customer-facing publications such as whitepapers, blogs.\n• Nurture relationships with within partners, enabling them to become cloud advocates.\n• Act as a technical liaison between service engineering team, support team and our partners\n\nCulture\n\nAt Amazon Web Services we don’t mind being called “peculiar.” We have our own way of doing things. We’re obsessed with customers, we see beauty in simplifying the complex, and we’re comfortable being misunderstood. That might sound unorthodox, but our unusual approach and our culture - focused on removing obstacles so builders can build - are part of why our people enjoy working in AWS.\n\nYou will be supported in your career development here at AWS. This includes building your technical consulting and leadership skills. We’re passionate about supporting the needs of our people and their family. Benefits include Medical Cover, Employee Assistance Programs and Global Mobility opportunities. This also includes access to mentorship opportunities.\n\nBasic Qualifications\n• Experience in a similar role as a Solutions Architect, Cloud Architect, Technical Consultant, Technical Lead, Software Architect, Engineering Lead, Sales Engineer, Database Administrator (DBA) etc.\n• Experience working with relational database solutions with architecture level knowledge\n• Knowledge of with one or more of following: - Amazon Aurora, RDS Oracle DB, MS SQL Server, MySQL, or PostgreSQL.\n• Experience building solutions that run in virtualized environments.\n• Demonstrated ability to influence CxO level executives\n• Experience with large application migration or modernisation projects\n\nPreferred Qualifications\n• Experience with non-relational databases, such as columnar data stores, NoSQL, and graph databases\n• AWS implementation or consulting experience\n• AWS Professional Certification", "extensions": ["17 days ago", "Full–time"], "detected_extensions": {"posted_at": "17 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEYXRhYmFzZSBQYXJ0bmVyIFNvbHV0aW9ucyBBcmNoaXRlY3QiLCJjb21wYW55X25hbWUiOiJBTUFaT04gV0VCIFNFUlZJQ0VTIFNJTkdBUE9SRSBQUklWQVRFIExJTUlURUQiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6InF0OEVJbklDZThjdGVjd0VBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGlua2VkSW4iLCJsaW5rIjoiaHR0cHM6Ly9zZy5saW5rZWRpbi5jb20vam9icy92aWV3L2RhdGFiYXNlLXBhcnRuZXItc29sdXRpb25zLWFyY2hpdGVjdC1hdC1hbWF6b24td2ViLXNlcnZpY2VzLXNpbmdhcG9yZS1wcml2YXRlLWxpbWl0ZWQtMjQ5MjAxMTU2OD9yZWZJZD1kY2ZkNDI3Zi01NTcwLTRiYjYtYjhiNS0yNjhkNzc3ZDI1NmRcdTAwMjZ0cmFja2luZ0lkPVFWdmklMkJRZHhJSENQYUYxS1Z2Z2V5ZyUzRCUzRFx1MDAyNnBvc2l0aW9uPTE2XHUwMDI2cGFnZU51bT0wXHUwMDI2dHJrPXB1YmxpY19qb2JzX2pvYi1yZXN1bHQtY2FyZF9yZXN1bHQtY2FyZF9mdWxsLWNsaWNrXHUwMDI2dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}], "chips": [{"type": "Title", "param": "job_family_1", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Solution architect", "value": "solution architect"}, {"text": "Solutions architect", "value": "solutions architect"}, {"text": "Architect", "value": "architect"}, {"text": "Cloud architect", "value": "cloud architect"}, {"text": "Technical architect", "value": "technical architect"}, {"text": "Enterprise architect", "value": "enterprise architect"}, {"text": "Senior", "value": "senior"}, {"text": "Consultant", "value": "consultant"}, {"text": "Financial services", "value": "financial services"}, {"text": "Infrastructure architect", "value": "infrastructure architect"}, {"text": "Manager", "value": "manager"}, {"text": "Application architect", "value": "application architect"}, {"text": "Cloud engineer", "value": "cloud engineer"}, {"text": "It architect", "value": "it architect"}, {"text": "Lead architect", "value": "lead architect"}, {"text": "Network architect", "value": "network architect"}, {"text": "Security architect", "value": "security architect"}, {"text": "Senior architect", "value": "senior architect"}, {"text": "Systems engineer", "value": "systems engineer"}, {"text": "Associate director", "value": "associate director"}, {"text": "Deputy", "value": "deputy"}, {"text": "Engineers", "value": "engineers"}, {"text": "Head", "value": "head"}, {"text": "Infrastructure", "value": "infrastructure"}, {"text": "Lab", "value": "lab"}, {"text": "Network engineer", "value": "network engineer"}, {"text": "Presales consultant", "value": "presales consultant"}, {"text": "Public sector", "value": "public sector"}, {"text": "Senior analyst", "value": "senior analyst"}, {"text": "Senior consultant", "value": "senior consultant"}, {"text": "Senior director", "value": "senior director"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Software architect", "value": "software architect"}, {"text": "Solution consultant", "value": "solution consultant"}, {"text": "System architect", "value": "system architect"}, {"text": "System engineer", "value": "system engineer"}, {"text": "Systems analyst", "value": "systems analyst"}, {"text": "Systems architect", "value": "systems architect"}, {"text": "Technical trainer", "value": "technical trainer"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Accounting", "value": "/business/naics2007/5412"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Management", "value": "/business/naics2007/55"}, {"text": "Real Estate", "value": "/business/naics2007/53"}, {"text": "Wholesale", "value": "/business/naics2007/42"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Amazon", "value": "/m/0mgkg"}, {"text": "Microsoft", "value": "/m/04sv4"}, {"text": "EPAM Systems", "value": "/m/0dlnrc"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "IBM", "value": "/m/03sc8"}, {"text": "Salesforce", "value": "/m/07btr5"}, {"text": "EY", "value": "/m/0g9jc"}, {"text": "Publicis Sapient", "value": "/m/02myjp"}, {"text": "Randstad", "value": "/m/08pt1z"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Alibaba Group Holding Limited", "value": "/m/07s6ctl"}, {"text": "Avanade", "value": "/m/094456"}, {"text": "Capgemini", "value": "/m/03vlk0"}, {"text": "Comtel Solutions Pte Ltd", "value": "/g/11dxpztgnb"}, {"text": "DELL", "value": "/g/11c54ch2jm"}, {"text": "Ericsson", "value": "/m/02kyh"}, {"text": "HTZ Resources", "value": "/g/11h21p9b4d"}, {"text": "Infinite Computer Solutions Pte Ltd", "value": "/g/11g9mj72yz"}, {"text": "Michael Page", "value": "/m/04cxldw"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "Orange Business Services", "value": "/m/08zvyz"}, {"text": "Recruitment Hub Asia Pte Ltd", "value": "/g/11dxpww_0f"}, {"text": "TEKsystems (Allegis Group Singapore Pte Ltd)", "value": "/g/11b6g4bkv0"}, {"text": "Talent Trader Group Pte Ltd", "value": "/g/11dxpmlc5b"}, {"text": "Tata Consultancy Services", "value": "/m/01psx8"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "VMware", "value": "/m/01t9k5"}, {"text": "Verizon", "value": "/m/07_dn"}, {"text": "A-Speed Infotech Pte Ltd", "value": "/g/11g9mxswl4"}, {"text": "ABeam Consulting", "value": "/g/11bc6whr_f"}, {"text": "Amazon Web Services (AWS)", "value": "/g/11dxprr2xv"}, {"text": "Amazon Web Services Singapore", "value": "/m/0rznzt1"}, {"text": "Aon", "value": "/m/0z7n"}, {"text": "Avaya", "value": "/m/01sqlk"}, {"text": "Azendian Solutions Pte Ltd", "value": "/g/11dxpvcjj2"}, {"text": "Big Cloud", "value": "/g/11c743lwsr"}]}]}