{"search_metadata": {"id": "608279f7d5ecf4eef6814115", "status": "Success", "json_endpoint": "https://serpapi.com/searches/5bc6e4939600e6a4/608279f7d5ecf4eef6814115.json", "created_at": "2021-04-23 07:40:39 UTC", "processed_at": "2021-04-23 07:40:39 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28project+manager%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=90", "raw_html_file": "https://serpapi.com/searches/5bc6e4939600e6a4/608279f7d5ecf4eef6814115.html", "total_time_taken": 3.09}, "search_parameters": {"q": "(project manager) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "90"}, "jobs_results": [{"title": "Interior Project Manager", "company_name": "C2 Creative Communications Pte Ltd", "location": "Singapore", "via": "via Singapore Job Mela", "description": "Interior Project ManagerResponsibilities includesMeet potential clients to ensure they are being translated into good design to be implemented on site and understand clients’ needsCo-ordinate layout plan, M&E plan and visuals, prepare project schedule and quotations to clients and submit tenders for the project to clientsArrange submission of plans to local authorities for approval and arrange inspections of building workPrepare quotation, costing estimates report, subcontracts, CCCO, interim valuations and for management’s approval Work closely with project and operation teams and contractors to ensure timely delivery of the project and excellent quality of work doneBeing the key single interface between the company and clients, obtain client feedback and resolve project related issuesIdentify design discrepancies and foresee execution risksEnsuring that all quality and timeline related requirements are metMonitoring construction and renovation projects and achieve all business... objectives and determine and effective strategyRequirementsRecognized qualification in interior design, architecture or equivalent Candidate must possess minimum 5 years’ experience in corporate office design and build project management. Those with PMP Certification have an added advantage.Able to interpret architectural plans and familiar with building and safety regulationsExperience in leading and managing multiple projects within tight timelinesExcellent project, presentation, leadership and people management skillsHighly self-motivated, positive working attitude with a high level of professionalism and integrityGood communication & interpersonal skillsPrepare good layouts, design concepts proposal, material and finishes boards, develop design and construction drawings.Strong design capabilities with a good eye for detailsHave good safety mindset and display good WSH behaviourAbility to assess design feasibility, visualize on-site conditions and foresee execution risksProactive and capable of prioritizing work", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJJbnRlcmlvciBQcm9qZWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJDMiBDcmVhdGl2ZSBDb21tdW5pY2F0aW9ucyBQdGUgTHRkIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJfeTJaUkdkUVF2NVgyWVdKQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFNpbmdhcG9yZSBKb2IgTWVsYSIsImxpbmsiOiJodHRwOi8vd3d3LnNpbmdhcG9yZWpvYm1lbGEuY29tL3NpbmdhcG9yZS1qb2JzL2ludGVyaW9yLXByb2plY3QtbWFuYWdlci05MjAyMT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Assoc Director, Process & Quality Mgt", "company_name": "Singtel Group", "location": "Singapore", "via": "via Singtel Careers", "description": "We have a great opportunity for a talented and self-motivated Associate Director, Process & Quality Management to join our Process & Quality Management team. At NCS, we seek to nurture talents in creating and developing innovative solutions. If you are passionate about new technologies and new ideas, NCS could be a place for you!\n\nSummary:\n\nManage and drive quality assurance and process improvement programs. Lead QA consultants in providing quality assurance services to improve overall delivery quality of NCS projects so as to achieve high level client satisfaction and project profitability.\n\nResponsibilities:\n\nLead and manage organization wide QA programs\n\nPerform the role of Program Manager to strategize, plan, design, implement and monitor the program:\n\n- Plan program including objective, scope, resource, approach, schedule, communication, etc.\n\n- Engage and manage stakeholders from different units (CSU, Core, Next, Regional, Corporate), and mobilize resources across the... organization to deliver the program objectives.\n\n- Drive, monitor and control program execution, and report status to management.\n\n- Lead and guide junior QA staff in the execution of the program.\n\nConsultant/Expert in specialized areas\n\n- Perform role of Project Manager to plan, lead and manage implementation of a specialised process/technique.\n\n- Be the consultant and facilitator to solve complex problem situations (e.g. facilitating Kepner-Fourie IT root-cause analysis) or conduct process study to identify bottle necks, inefficiencies and propose areas for improvement e.g. using Lean Walkthrough technique.\n\nManage QA Processes / Methodologies\n\n- Provide thought leadership and drive adoption of new and changed processes, international standards and industry practices.\n\n- Be the process expert to define, review and advise on process design.\n\n- Drive standardization, process simplification and process automation to improve efficiency and consistency of process practices across NCS, including defining requirements and reviewing design of project delivery systems/tools.\n\n- Manage training on processes/methodologies to enable delivery staff in using the processes / methodologies, including designing courseware, conducting training and building elearning packages for better reach out.\n\n- Work with Regional Offices to localize processes/methodologies for adoption in the Regional Offices. Enable and guide local Quality Management Staff in the Regional Office to establish country-specific processes and ensure compliance in the Regional Office.\n\nIndependent Audit/Review\n\n- Conduct independent audits on projects and operations to verify contractual compliance and operations weaknesses; and make recommendation to close gaps\n\n- Provide independent assessment of risk exposures, governance lapses, and operational issues, and recommend improvements.\n\n- Provide objective report to NCS and client management.\n\n- Work with the stakeholders to ensure that lapses are corrected, and improvement actions taken to close operational gaps.\n\nQA Lead/ QA Practice Lead\n\nQA Lead\n\n- acts as an independent party, following through from solution development to delivery stages to ensure that potential risks are managed/mitigated to attain delivery quality and minimize cost of poor quality.\n\n- as independent QA face to client to gather feedback and manage client satisfaction in delivery quality\n\nQA Practice Lead\n\n- acts as the process and QA expert to lead short-term client project actions in project initiation & planning, process transition & transformation, service improvement to address service performance issues\n\n- acts as a process coach to ensure that large projects have proper project initiation, project planning, and ensure project processes are defined and project system configured to set a right footing for project delivery and enable effective project monitoring and tracking.\n\nThe ideal profile should have / be:\n\n• Degree in Information Systems, Computer Science or equivalent\n\n• More than12 years’ experience in project delivery or QA management; Repeated experience in managing projects, improvement initiatives, process standardization initiatives\n\n• ITIL Expert Certification, CSQA certification, PMP certification, LEAN Six Sigma certification would be advantageous\n\n• Auditing certification a plus\n\n• Skilled in Project/Program management, Process and QA management\n\n• Knowledgeable in ITIL, ITSM, ISO and related standards and tools\n\n• Familiar with Software engineering, Software Development Life Cycle, Agile development\n\n• Familiar with KT/KF problem solving techniques, Process/QA measurement knowledge a plus\n\n• Analytical, influencing skills\n\n• Facilitation, negotiation skills\n\n• Communication, presentation skills\n\n• Consultancy skills\n\n• People/stakeholder management skills\n\nIf you would like to be part of the winning team that does great work, apply today!\n\n#NCSlife", "extensions": ["22 days ago", "Full–time"], "detected_extensions": {"posted_at": "22 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBc3NvYyBEaXJlY3RvciwgUHJvY2VzcyBcdTAwMjYgUXVhbGl0eSBNZ3QiLCJjb21wYW55X25hbWUiOiJTaW5ndGVsIEdyb3VwIiwiY29tcGFueV9taWQiOiIvbS8wMjB6ZmwiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJBRVkyaVJSVHI4VnQ2RXItQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VkVkaFRtOUxjMkZUVkdGV01ucFBMVE5WVkZseWFFeFNSMTl0WjBreFJtOUJNV05aYmt0SVFuY3dWV2hyYzFCWFdXczVaR2xJTURCMk1XZFlORzg0ZWxGdGQzVlliRmN0UzBOdFYyZHpXRzFsWmtKcGNGZFBUSFY2YzNWcU5pMHlVa1ZHWkhwb1JrNUhYMDFMV2xOMVMwbFNVVGgxYkd0TlNYQjFTelZSYVRkMGFrOURMVVJMTVU5T1gwdDRjMXBrTFZWTVdGZGtOVVJOU25KUkVoWXRTRzFEV1ZCTVYxQkpTek5uWjJWNmJFczJkME5SR2lKQlQwMVpVbmRFVW1Oa01IUlBaVGxMTTI1SGMyZFpaMUZ3U1hkd1h6RkZXSFozIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMTEiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gU2luZ3RlbCBDYXJlZXJzIiwibGluayI6Imh0dHBzOi8vZ3JvdXBjYXJlZXJzLnNpbmd0ZWwuY29tL2pvYi9Bc3NvYy1EaXJlY3RvciUyQy1Qcm9jZXNzLVx1MDAyNi1RdWFsaXR5LU1ndC1TaW5nLzU3NTg1MTAxMC8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "PROJECT MANAGER", "company_name": "Ask M&e Pte. Ltd.", "location": "Singapore (+1 other)", "via": "via Monster", "description": "We are looking for a Project Manager to be responsible for handling our company's ongoing projects. You will be working closely with your team members to ensure that all project requirements, deadlines, and schedules are on track. Responsibilities include submitting project deliverables, preparing status reports, and establishing effective project communication plans as well as the proper execution of said plans.\n\nTo be a successful candidate, you will need to have proven experience in project management and the ability to lead project teams of various sizes. A Project Management Professional (PMP) certification is a huge advantage.\nProject Manager Responsibilities:\n• Coordinating with cross-discipline team members to make sure that all parties are on track with project requirements, deadlines, and schedules.\n• Meeting with project team members to identify and resolve issues.\n• Submitting project deliverables and ensuring that they adhere to quality standards.\n• Preparing status... reports by gathering, analyzing, and summarizing relevant information.\n• Establishing effective project communication plans and ensuring their execution.\n• Facilitating change requests to ensure that all parties are informed of the impacts on schedule and budget.\n• Coordinating the development of user manuals, training materials, and other documents as needed to enable successful implementation and turnover of the process or system to the clients.\n• Identifying and developing new opportunities with clients.\n• Obtaining customer acceptance of project deliverables.\n• Managing customer satisfaction within the project transition period.\n• Conducting post-project evaluation and identifying successful and unsuccessful project elements.\n• ERP project oversight.\nProject Manager Requirements:\n• A bachelor’s degree or master's degree in a related field.\n• Project Management Professional (PMP) certification is a plus.\n• Proven experience in project management.\n• Ability to lead project teams of various sizes and see them through to completion.\n• Strong understanding of formal project management methodologies.\n• Experience as a construction project manager, IT project manager, or ERP project manager.\n• Able to complete projects in a timely manner.\n• Understanding of ERP implementation.\n• Experience overseeing a construction project.\n• Budget management experience", "extensions": ["20 days ago", "Full–time"], "detected_extensions": {"posted_at": "20 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQUk9KRUNUIE1BTkFHRVIiLCJjb21wYW55X25hbWUiOiJBc2sgTVx1MDAyNmUgUHRlLiBMdGQuIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiIxTUFGcVNIeE04aDZyRjdIQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1vbnN0ZXIiLCJsaW5rIjoiaHR0cHM6Ly93d3cubW9uc3Rlci5jb20uc2cvYW1wL2pvYi12YWNhbmN5LXByb2plY3QtbWFuYWdlci1hc2stbS1lLXB0ZS1sdGQtc2luZ2Fwb3JlLTI3NTcyMzcxLmh0bWw/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Project Manager", "company_name": "AccionLabs", "location": "Singapore", "via": "via SmartRecruiters Jobs", "description": "Company Description\n\nAccion Labs is a global technology services firm with offering a full range of product life-cycle services in the emerging technology segment. This includes Web 2.0, Open Source, SaaS/Cloud, Mobility, IT Operations Management/ITSM, Big Data and traditional BI/DW.\n\nThrough nine global offices and a rapid-response delivery model, Accion offers a range of engagement models such as turn-key projects, extended-teams, shared-IP development, offshore-leveraged engagements and professional staffing (contract, contract-to-hire & direct perm).\n\nRole: - Project Manager\n\nRequired\n\n· Have managed large transformational Mainframe platform migration / re-hosting projects\n\n· Understanding of Mainframe application related to infra needs\n\n· Knowledge and understanding of UX / Linux\n\n· Should have hands-on experience in projects\n\n· Strong project management skills. PMP certification is an added advantage\n\n· Have run a large complex project of at least 5m++\n\n· Ability in managing and... handling 3P vendors providing application porting services and workload solutions services.\n\n· Experience in contract administrations\n\n· Ability in managing cross-country / regional / virtualization resources in projects\n\n· Managing at CxO level customer\n\nAdditional Information\n\nAll your information will be kept confidential according to EEO guidelines", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJBY2Npb25MYWJzIiwiY29tcGFueV9taWQiOiIvZy8xMWR4cHFtMTZ2IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoia2RXeFRPdGN6UF94aWtlZEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFVYZHFhSFowYUhoc00ybEhXbVF5Yld0b2NVUldYMTh0YURocFJYSkNRMmMzY3pVNWNIWXlRaTFwUnpCSVdXNWhhVWd6YzAxVmJGTnRXa1pOTlhoSFEyczFjbms1U21kRU16Y3ljM0k1Ym5aZk9IbHhNbmRJVFZFM05GaHhRamswYURWNlFXTXRZMVo1Wm5aMlkyODJTVk5hTTNWR1dscFJNbUZRTlRNME1ETXhVVkpxZFRGelNuaExlbEZ3YmpoM1NtbEJkbFZzTjJ4UmRWcEJFaFl0U0cxRFdWQk1WMUJKU3pObloyVjZiRXMyZDBOUkdpSkJUMDFaVW5kRFozUXpSMnB5U2xSMmFYSmtSeTFKZG1OU1dUWmFhbFp0Y0RoMyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzIyIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFNtYXJ0UmVjcnVpdGVycyBKb2JzIiwibGluayI6Imh0dHBzOi8vam9icy5zbWFydHJlY3J1aXRlcnMuY29tL0FjY2lvbkxhYnMyLzk5MTkyMjE0LXByb2plY3QtbWFuYWdlcj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Project Manager", "company_name": "Philips", "location": "Singapore (+1 other)", "via": "via MNC Jobs Singapore | MNC Jobs In Singapore", "description": "Job Title\n\nProject Manager\n\nIn this role, you have the opportunity to\nLead the cross-functional core team to achieve the objectives of complex project. It includes End-to-End management of a project to develop a product, technology, system, solutions, or services. Manage projects ensuring execution is in line with corporate policies, rules, & procedures. Determines project risks, defines corrective action and drives the projects to closure.\nYou are responsible for\n• Prepares and implements project in multi-discipline areas in accordance with agreed conditions on quality, time, cost and staffing.\n• Use appropriate project management tools, communication plans and risk management techniques to create rigor in project planning and execution.\n• Work with cross-functional leaders (Marketing, Development, Quality, PRC, Sourcing, Operation and vendor) to ensure smooth transition from every stage of the project from concept definition, development, verification/validation, and to mass... production.\n• Represents the project team in the business and provides business management with regular project performance status updates, variances to plan and identification of corrective actions\n• Manages internal and external stakeholders. Co-ordination between the different stakeholders, Multi-site teams\n• Work with Quality and Regulatory to ensure the project is fully compliant with the Philips quality system/process and global regulatory agency requirements.\n• Deploys process improvements and makes the project organization efficient and transparent, in line with departmental and project processes.\n• Coaching of team members.\n• Reports on employees' performance to the hierarchical superior of the employees for the purpose of appraisal and makes proposals for training the project members.\n• Other duties as required.\n\nYou are a part of\nOral Health Care Innovation team, a progressive and energetic team that contributes directly to the growth of the Philips OHC business.\nTo succeed in this role, you should have the following skills and experience\n• Bachelor's Degree required. Master's degree in engineering preferred.\n• Over 5 years project management experience in end-to-end product development, in multi-region companies.\n• PMP certification preferred\n• Strong written and verbal communication skills required.\n• Capable of handling complex project, strong problem-solving skills required.\n• Clear thinking and able to make decision based on facts.\n• Strong understanding of financial analysis tools preferred.\n• Capable to presents clearly and informatively, easily maintaining audience attention and responding to their needs; Able to facilitate discussion, progress effectively, and manage audience as needed.\n• Computer-literate with working knowledge of Project Management, Excel, PowerPoint, and Word required.\n• Travel in case needed.\n\nIn return, we offer you\nA path towards your most rewarding career. Philips is growing its marketing capability enterprise wide. Succeeding in this product development role in a complex environment will open many doors for your long term career, in other areas in Philips or otherwise. We also believe that we are at our best as a company when you are at yours as a person. Thus, we offer competitive health benefits, a flexible work schedule and access to local well-being focused activities.\nOur benefits are very competitive and designed around your preferences:\n• We offer a market conform salary\n• A variable bonus based on both Philips results and personal performance\n• Convenient working conditions in office\n• Extensive set of tools to drive your career, such as a personal development budget, free training and coaching\n• Attractive collective health insurance package\n• Opportunity to buy Philips products with discount\n• Healthy work-life balance\n\nWhy should you join Philips?\nWorking at Philips is more than a job. It's a calling to create a healthier society through meaningful work, focused on improving 3 billion lives a year by delivering innovative solutions across the health continuum. Our people experience a variety of unexpected moments when their lives and careers come together in meaningful ways. Learn more by watching this video.\nTo find out more about what it's like working for Philips at a personal level, visit the Working at Philips page on our career website, where you can read stories from our employee blog. Once there,you can also learn about our recruitment process, or find answers to some of the frequently asked questions.\nContact\n\nIf you forgot your password, you can click the Forgot Password button on the Sign In screen to reset it.\nIf you have any other questions regarding the recruitment process please refer to our FAQs. In case of technical difficulties with the website, please send an email to careersite@philips.com.\n(Note: To ensure fairness and legal compliance in our recruitment processes, only technical issues will be monitored through the above inbox. Please do not submit resumes or applications to this email, as they will not be reviewed. Only applications received through the online application process will be considered", "extensions": ["5 days ago", "Full–time"], "detected_extensions": {"posted_at": "5 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJQaGlsaXBzIiwiY29tcGFueV9taWQiOiIvbS8wNXczeSIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IlotRk1ydVhzRkxMY0JxbFJBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVzc0JDb3dCUVU1VlgwNXhWRXBvTjNkc1RISXlaWGhYUVdOcmJYWkVSMjlYTm1aSWN6SnFVelZoV25NdGJqWTJYME5PT0V4cWNsWkNWSE5xYjJKTWVIRm5Ra0ppUm1sR1VtVkhialF3Um5BNGFrWkpNbXAwVmxkbE9XOUJTelJOY1dGalZGQmFWR2xwU0RVemRWcFRWREI2U3pCR05EbENjbVJOYWtrMFNGSlNiRU52TVV0Zk9FVXRTRk5qY0hsWVVVZ1NGaTFJYlVOWlVFeFhVRWxMTTJkblpYcHNTelozUTFFYUlrRlBUVmxTZDBSb1ZXbEdkR3hXT1RKdmNYUkxPV0ZJVDJsVU5uVnhUR0oxY2xFIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMjkiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTU5DIEpvYnMgU2luZ2Fwb3JlIHwgTU5DIEpvYnMgSW4gU2luZ2Fwb3JlIiwibGluayI6Imh0dHBzOi8vc2cubW5jam9iei5jb20vam9icy9wcm9qZWN0LW1hbmFnZXItc2luZ2Fwb3JlLTI5ODc3P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Senior Project Manager", "company_name": "TEKsystems (Allegis Group Singapore Pte Ltd)", "location": "Singapore", "via": "via EFinancialCareers", "description": "Senior Project Manager\n\nYou will be part of a large Infrastructure team responsible for a major cross country migration and be highly involved in running projects from initiation through delivery. We are looking for individuals with infrastructure and applications migration background. You will be responsible for communicating with senior stakeholders, across various delivery teams for Test Environments Management, Production Release Management, Performance testing and Capacity Management, etc.\n\nKey Responsibilities\n\n• Coordinate internal resources in Asia and US and third parties/vendors for the flawless execution of infrastructure and application migration projects\n• Plan project activities, assemble cross-functional teams and other critical resources; and manage the project from start through implementation and close out. Take appropriate actions to measure progress and meet the schedule. Manage and drive project team to achieve objectives.\n• Ensure that all projects are delivered... on-time, within scope and within budget\n• Developing project scopes and objectives, involving all relevant stakeholders and ensuring technical feasibility\n• Ensure resource availability and allocation\n• Develop a detailed project plan to track progress\n• Use appropriate verification techniques to manage changes in project scope, schedule and costs\n• Report and escalate to management as needed\n• Manages project risk through comprehensive mitigation assessment and planning techniques\n• Collaborates and communicates with other project managers and leaders to coordinate cross-project initiatives and activities\n• Identify and eliminate obstacles to solution plans, business goals or implementation\nQualifications\n\n• Minimum 8-14 years of experiences in infrastructure delivery for end to end projects\n• BS or BA in Technical or Business field of study or equivalent experience\n• Preferably someone experienced working in an end user environment focusing on infrastructure and security projects\n• PMP or Scrum Master Certification good to have\n• Must be able to communicate, both verbally and in written form, well to all levels of the organization.\n• Worked closely with application and infrastructure technology teams to gain consensus and approval of each phase of the project lifecycle", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgUHJvamVjdCBNYW5hZ2VyIiwiY29tcGFueV9uYW1lIjoiVEVLc3lzdGVtcyAoQWxsZWdpcyBHcm91cCBTaW5nYXBvcmUgUHRlIEx0ZCkiLCJjb21wYW55X21pZCI6Ii9nLzExYjZnNGJrdjAiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJwYXFGUkZlNkRJdkZ5M2Y1QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFc3NDQ293Q1FVNVZYMDV4VWw5amIxSkVXVVZLWW1ObFVUZEhlRnBpWTA1cGFuaHhUelZNUW0xcVpWOVJNbE5FWXpGUlRtVTJUSEI0T0ZGUFJYaEtORUpHVldORFJrWmlTVGRqWTFGbU1EWkNlRWRPT0ZKRE9UWm1iMEpDY1VoU1lqUnpXR3hsU1hBNFdWcFVRVFo0ZG5FemMyeE9NeTFTUlRVNFNXRjBWV2swWDFZM1QyMVBSMWhaU25CUVFrWlBNM1JOUmt4Wk5EWklkVUpSY2xkWWNXaGllRnBaVVdjMVkyRm5jV1phZVZwVmVEbExhMFZqVlhwcGJFc3RZMTgxTTFGak1HbHZOM1JGYVVGM2RVUkRhbnBtY25aM1ZFVlJjME5IWWtSak1VTjBVV00xUjNoVVNHWmlXbkJKZUVoRU1GWkVaelJ0U1RkQmVUVkdka2hmVTFCSFVISjBkM1ZzYUVaa00xVmlaWGxuZWhJV0xVaHRRMWxRVEZkUVNVc3paMmRsZW14TE5uZERVUm9pUVU5TldWSjNRblp6Wmw5VWIxVjNjMWRmY25jNGIybEJRWEpTTlhsS2MyOXJkdyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzM3IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEVGaW5hbmNpYWxDYXJlZXJzIiwibGluayI6Imh0dHBzOi8vd3d3LmVmaW5hbmNpYWxjYXJlZXJzLnNnL2pvYnMtU2luZ2Fwb3JlLVNpbmdhcG9yZS1TZW5pb3JfUHJvamVjdF9NYW5hZ2VyLmlkMTA4MDY1NTg/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Project Manager", "company_name": "Toshiba Tec Singapore Pte. Ltd", "location": "Singapore (+1 other)", "via": "via Jobs | Fidanto", "description": "Show recruiters you're immediatley available for job opportunities Posted On: 5 days ago Total Views: 54 Total Applications : 5 Job Id: 25852741 Permanent Job Job DescriptionJob Description: • Manage Quality, Cost, Delivery of assigned Product type • Manage Quality, Cost, Delivery issue with assigned customers • Managing ODM customer account in new printer development to meet project deliverable timeline, resolving development defects and plan for supply chain fulfilment before product is launching• Managing resource allocation, budget allocation with timely reporting to Japan management and action plan to avert risk.• In-dept understanding of all engineering change job flows from customer request to mass production implementation• Managing customer RFQ by formulate project proposal includes project schedule, product cost and NRE investment• Reports on project progress and other project specific information to stakeholders.• Engage new/exist customer to expand business with proposals... Requirements: • Bachelor of Engineering or Diploma with 10 years’ experience• More than 5 years in managing development projects from concept till trial manufacturing or NPI• More than 5 years as design team lead (Mechanical, Electrical, Firmware/Software)• Have proven track record in working Cross Function Team (Engineering team and Operation Team)• PMP certification or equivalent project leading experienceInterested applicants, please send in your resume stating your date of availability, current and expected salary. We regret that only shortlisted candidates will be notified.ATS is The Independent Solution Provider for Industrial & Process Automation, IT and Quality worldwide. Founded in 1986, ATS is expert in Control Technologies, SCADA/HMI, Programming Languages, CommunOverview of Responsibility: To manage and ensure the overseas Metro Rail Project meet the projected Profit and Loss, schedule, quality, safety, compliance to the project requirements and enhance goodResponsibilities * Provide overall leadership, governance, organization and management of the project team * Responsible for project team resource planning, recruitment, training & development aESSENTIAL DUTIES AND RESPONSIBILITIES include but not limit to the following. Other duties may be assigned. · Manage technical and commercial scope and provide a coherent engineering package to obtaiKey Responsibilities: * Project team management: leading project teams, organize meeting and follow up action items. * Develop budget, time and resource plans based on technical requirement, proSchool of Chemical and Biomedical Engineering (SCBE) invites applications for the position of Project Manager. Key Responsibilities: * Provide broad-level administrative, management and operationaJob Description The candidate will be responsible for the following: • Managing Client relationships • Managing 4 to 5 design projects concurrently in Chinese Yards • Providing overall leadership · To co-ordinate the Company’s project and other works as and when assigned to you. · To ensure that work is done in accordance with drawings, specifications and management instruction. · To plan, c· Coordinate internal resources and third parties/vendors for the flawless execution of projects. · Ensure that all projects are delivered on-time, within scope and within budget. · Developing projeQUALIFICATIONS To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skills anGive your career a boost with Monster's resume services.Simple body text this will replace with orginal content Toll Free No: +8001-012-339 91-40 66116994", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJUb3NoaWJhIFRlYyBTaW5nYXBvcmUgUHRlLiBMdGQiLCJjb21wYW55X21pZCI6Ii9nLzExZzluOXE1NDciLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJUcnh5c0F1N0Rmb3daMHo3QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFcUVDQ3VJQlFVNVZYMDV4VTBzMGFrZE9RMjU0WkRCMFNtTlVlblF5WTBGbE4yNUxUM055Umt0NU9FdG5OSGhXWkdkTmEyMUtUVTVETTJoVU0xcFpWMlV4WmpCeFFubFlhR1UwTFhWS1YyaEpaRWhhYW1GZkxYQmpTME5STWtaNVRHUmZjRU56TUZKcFRYZG1XR2hoVURab1QwbDVVa0ZXZGxNeE4wcHdabmxaVlRSdmRXRnRXbEZ1TjFrelJrbEtZbnBtT1VweldVaHpNR3N6TkZGdk1USnVXRVpXY25OUGVUTTFXRTVOVWxwR1NWRm5PSFI1TTBKaWJHOTRMVGhWZG05amNXbGpNemQzYVdkR05EbFVlazlITVc1U1dUbHNlV2RETUd4dllrMW1ObGh1UlcxNlFSSVdMVWh0UTFsUVRGZFFTVXN6WjJkbGVteExObmREVVJvaVFVOU5XVkozUVVoUVNrNVZOVTVVVmpCM2JXeHZZVjlGVkVKdVdVaGFaREJ5WnciLCJmY3YiOiIzIiwiZmNfaWQiOiJmY180NCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIHwgRmlkYW50byIsImxpbmsiOiJodHRwczovL3NnLmZpZGFudG8uY29tL2pvYnMvam9iLW9wZW5pbmcvaW5mb3JtYXRpb24tdGVjaG5vbG9neS1wcm9qZWN0LW1hbmFnZXJzL3Byb2plY3QtbWFuYWdlci0yNzc4NDY3MTk/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Project Manager", "company_name": "Aquient", "location": "Singapore (+1 other)", "via": "via Workable For Job Seekers", "description": "Aquient is a purpose-driven consulting firm that helps companies solve business problems and build for the future, with solutions spanning business advisory, customer experience, technology, and analytics.\n\nFounded in 2018 and headquartered in Singapore, Aquient has organically grown to a Salesforce Gold Consulting Partner in less than 9 months and now has a fast growing practice in Manila.\n\nJob Title: Project Manager\n\nABOUT THE POSITION\n\nThe Project Manager confidently owns multiple customer engagements throughout all phases of the project lifecycle and delivers projects on time and within budget. This role plans, initiates, implements, and manages project plans to enable clients to meet their objectives. This Project Manager guides all internal and external communication, identifies areas of opportunity for clients, and motivates stakeholders throughout the project to achieve project completion quickly and efficiently.\n\nRESPONSIBILITIES\n• Work closely with clients to translate... project objectives into achievable timelines while utilising Agile Scrum methodology\n• Ensure Clients are satisfied with the quality of work delivered and the service they receive from Aquient\n• Develop and manage comprehensive Project Plans and Project Timelines for each project\n• Create detailed work plans, schedules, project estimates, resource plans, and status reports to drive projects quickly and efficiently to ensure projects are completed within the expected duration\n• Manage and delegate work to the project team to ensure team meets all timelines\n• Understand client businesses, their overall goals, objectives, pain points, areas of opportunity, definition of success, etc. and seek a clear understanding of how success will be measured in the engagement\n• Manage change orders and highlight new opportunities, collaborating with a Portfolio Director and Sales as appropriate\n• Track all utilization, update and manage accurate utilization/burn reports, and manage capacity to keep team efficiently staffed\n• Review, oversee, and approve all customer invoices with quality and accuracy by auditing for any rate mistakes, hours mistakes, misuse of terms, or any similar errors\n• Provide assistance to clients in the form of generating and analysing reports, building dashboards, providing end-user support, creating account configuration worksheets, providing training, and assistance with IP warming planning, strategy & tracking\n• Coordinate, plan, and facilitate all internal and external meetings\n• Guide and own all customer communications, as well as organize customer on-sites by coordinating logistics, planning agendas, building and deliver presentations, and demonstrating the value of on-site visits to the customer\n• Provide an accurate and timely forecast for project engagement through thorough planning of work\n• Manage conflicts with both internal and external teams and seek satisfactory resolutions\n• Serve as a translator between Aquient and the Customer to define, collect, and own customer requirements for a given initiative\n• Handle customer or project escalations\n• Work with teams to develop a common best practice set of tools and processes for effective people management\n• Perform other duties required and assigned\n\nEDUCATION AND/OR EXPERIENCE\n\nTo perform this job successfully, an individual must have the following education and/or experience:\n\nRequired\n• Experience with managing projects in a Professional Services Consulting firm or Marketing Agency\n• 5+ years of Project Management experience\n• Experience utilizing Agile Scrum methodology\n• Experience managing client facing projects based on a statement of work\n• Current authority to work in Singapore (eg Singapore Citizen, PR, LTVP+)\n\nPreferred\n• PMP and/or CSM Certification preferred\n• Experience in IT consulting and/or marketing consulting preferred\n• Experience in using Financial Force platform for project reporting\n• Experience in using Jira Project Management software\n• Knowledge of Salesforce products and experience of managing Salesforce projects\n\nKNOWLEDGE, SKILLS, AND ABILITIES\n• Excellent communication, presentation, and negotiation skills\n• Possess strong analytical skills to research, organize, present and collect information\n• Possess strong listening skills and a compelling sense of curiosity\n• Solid knowledge of project management methodologies, facilitation methods, and software tools\n• Strong analytical, research, and customer relation skills\n• Strong creative, conceptual, and problem-solving skills\n• Meticulous attention to detail and ability to provide accurate reporting on projects as requested by Senior Leadership, including the CEO.\n• Ability to successfully manage larger internal teams (5-8 people) and identify when additional members can/should be added to a project or rolled off", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJBcXVpZW50IiwiY29tcGFueV9taWQiOiIvZy8xMWd4c2NkM3ZfIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiM3dLbTlkSi1GTTB2QU9RakFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFVWaEJhMUI1YUZSNmNUUXhjMjFwVGtaWlJHTlZTbTh5WjNOVGRVUkROVjh0VFRSaGFtdHlaVXc0ZGs1alVuRnJNV2QwWldvNWRtdDBhSEJEVG1kbVdtNHhkMkp3WjFWR1dWTjZkRzlrZG5CUVYyWjJlVkpQUVRCdE5sOVhNekJyUkhvMllUWkJXRkJQU2kwNGVXUldkRkJNZEdkNFMwMWpNbTFXZFRWd2JWOWxiSE5qYUd3eFZrRkZhSEpITlRaalNXRm1PRWhJVW5WR1dXZEJFaFl0U0cxRFdWQk1WMUJKU3pObloyVjZiRXMyZDBOUkdpSkJUMDFaVW5kRFl6SkhSa2hzVjNKUVduZHhSREJmYUdKcU0xRmZVRkZHZW5WbiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzUwIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFdvcmthYmxlIEZvciBKb2IgU2Vla2VycyIsImxpbmsiOiJodHRwczovL2FwcGx5LndvcmthYmxlLmNvbS9hcXVpZW50L2ovNDYyNEU3OUQ5Qi8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Project Manager", "company_name": "IoTalents", "location": "Singapore (+1 other)", "via": "via Jobs007", "description": "Job Responsibilities\n• Participate in RFI/RFP\n• Work on the project scoping during presales to size up the project management effort, and the write-out on project management section for proposal\n• Manage multiple projects ensuring project Scopes, schedule, resources and outcome are within project milestone timeline and budget\n• Manage project resources and deliver according to scope and schedule\n• Manage procurement and delivery\n• Ensure project signoff timely\n• Manage project financial with prudence\n• Prepare Project Management Life Cycle documentation\n• Conduct Project meetings and ensure ready project minutes timely\n• Update Project Repository folders regularly\n• Closely monitor, anticipate and escalate Project Issues and Risks early to address situation\n• Compliance to PMO Governance Guidelines\n\nJob Requirements\n• 5-10 years project management experience in mid-to-large scale projects\n• Good people handling skills, and able to perform under pressure\n• Delivered at least one... complex Project of minimum SGD 1 million and team size of 10.\n• Experience in working on large Enterprise Networks, Security Base projects preferred with exposure on other IT Infra Projects (e.g. systems, storage, virtualisation, backup).\n• With Security Clearance for Government Projects (G50)\n\nAcademic/Professional Qualifications\n• Diploma or Degree in Information Technology\n• PMP or CITPM certified\n• Agile Scrum Methodology - Advantage\n• ITIL Foundation V3\n• Certified Information Systems Security Professional (CISSP) - Advantage\n• CCNA / CCNP certified", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJJb1RhbGVudHMiLCJjb21wYW55X21pZCI6Ii9nLzExZHhxMTg3d20iLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJTZktIazhyOFVpTVlTMnR2QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VkdSaGJVUXhVWE5vUldwMU1tZGhSM0EyY3pSNlMwOUNZbVYyVGxoU05FdE5aRFpQTlhaS016SnZTWFJhTTJ4SmF6RXhjM2hFWVdWS1dsTXlkbVJ5TlRkU05tbFBiSFZNWkRkRVNrOWlaREpyYldSeWF6WmxVRVJ5Um0xMFozRkdkbUZTVVVka1FVMXpORGg1Um1JelZsSXpYMms0VW5wRldrVkhiVk14VEZGeWMwUjRabWhPVDFSb1RuQjVPR3BhTXpKVE0xOVZla0pXTXpGUkVoWXRTRzFEV1ZCTVYxQkpTek5uWjJWNmJFczJkME5SR2lKQlQwMVpVbmREWVhSS2VYcGxiVWxqVEhKT1RWSTJOMkpmV0VwbmNWQTRha0pCIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNTciLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9iczAwNyIsImxpbmsiOiJodHRwczovL2pvYnMwMDcuaW8vam9icy9mdWppdHN1LXNpbmdhcG9yZS9wcm9qZWN0LW1hbmFnZXJfNzc/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "IT Project Manager (Infrastructure, Cloud, Security)", "company_name": "Randstad Singapore", "location": "Singapore (+1 other)", "via": "via Randstad Singapore", "description": "• Concrete project timeline\n• Exposure to wide range of technology\n• Exposure to Cloud (AWS / Azure) or Cyber Security is necessary\n\nAbout the company\n\nOur client is a renowned global commercial multinational corporation that has a well-established presence of more than 50 years. This is an exciting opportunity to join them as an IT Project Manager to roll out infrastructure transformation projects like Data Centre, Network, Cloud and Cyber Security across APAC.\n\nAbout the job\n\nReporting to the Head of Infrastructure, your role involves:\n• Managing end to end project lifecycle for infrastructure projects (Cloud, Cyber Security, Networks, System) from setting up a project and initiation to delivery and close\n• Guiding the project delivery teams throughout the lifecycle to provide continuity of technical governance from inception through design, build, test, piloting, migration and implementation.\n• Overseeing the adherence to schedules, budget, manpower and technical quality targets... \u2028\n• Managing the documentation of scope, changes, issues and risks that affect implementation \u2028\n• Providing technical guidance on the infrastructure requirements that are integrated with the on-site hardware and connection back via WAN to the data centre\n• Supporting the demand process in solution assessment and selection, overseeing the design process for approved projects while supporting the implementation process by driving consistency and standards into the new or enhanced applications.\n• Establishing service level management practices to ensure that the level of service from internal and external service providers are defined. This includes managing IT Incident, Problem, and change management processes\n\nSkills and experience required\n\nAs a successful applicant, you will have:\n• Bachelor’s Degree in Computer Science/Information Technology or equivalent.\n• PMP / PMI / Prince2 or equivalent certification.\n• Exposure to Cloud (AWS / Azure) or Cyber Security is required for this role.\n• At least 6 years of experience in managing Infrastructure such as WAN implementation, compute and storage implementation, On-Premise to Cloud migration\n• At least 2 end to end rollouts of projects that are worth SGD 350,000 each. (This is relatively important as the value of the upcoming projects will be worth at least similar or higher)\n• Excellent communication skills and experience in translating business requirements into technical specifications.\n\nWhats on offer\n\nThis is an excellent stable opportunity to engage in a global role for a renowned MNC which is a leader in its industry. You will have the opportunity to enhance your project leadership experience through high-value projects with exposure to latest technologies.\n\nTo apply online please use the 'apply' function, alternatively you may contact Josh LIM at 6510 3660 or josh.lim(at)randstad.com.sg\n\n(EA: 94C3609 / R1766249)\n\nskills\nlifecycle, implementation, project manager, project management, IT project manager, infrastructure project manager, pmi, pmp, prince2, cloud, aws, azure, IT security, cyber security, network, system, wan, lan\n\nqualification\n•PMP / PMI / Prince2 or equivalent certification.\n•Exposure to Cloud (AWS / Azure) or Cyber Security is required for this role.\n•At least 6 years of experience in managing Infrastructure such as W\n\nworking hours\nFull-Time\n\neducational requirements\nAssociate Degree/Diploma", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJJVCBQcm9qZWN0IE1hbmFnZXIgKEluZnJhc3RydWN0dXJlLCBDbG91ZCwgU2VjdXJpdHkpIiwiY29tcGFueV9uYW1lIjoiUmFuZHN0YWQgU2luZ2Fwb3JlIiwiY29tcGFueV9taWQiOiIvZy8xMWc3MGI1MG1yIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoib1hzcjM0dUk1ZDYwUjdzdEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZZQkNyY0JRVTVWWDA1eFUyTTVia0ZwVFdOS1pXZEVWbGg0VWtGTk1rdDZaR2h1TldSbU5FaEpiVmxpVkd0SlpIcHhTWGhyWmtseFpsVlNiVzl6TlhvMGMyZHRUbVpJY0hCcmFUZGtabFZ4Ym5WUk5WOU5kbkZFWTJkTmFrd3RSaTE2WjNweWJURmlNV0ZJV1c5ZlowcHdWWGxrTlRWcWVVeGxNRUl0ZVV3M1VFcDVaVGszU2sxUWFrRnNUelo0YkVWNU1rVm5aMjlPUjA1NGVGZGxRVzFWVld4eFlYaHZTVUZaYzJ4cGRIVmxSMWhZU3prNU0yWmtXbWRCRWhZdFNHMURXVkJNVjFCSlN6Tm5aMlY2YkVzMmQwTlJHaUpCVDAxWlVuZENjVE5zTUU5MlpIYzBZMjUwVkZKSFNqWm5VMnBUYnpCb01uRjMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY182NSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBSYW5kc3RhZCBTaW5nYXBvcmUiLCJsaW5rIjoiaHR0cHM6Ly93d3cucmFuZHN0YWQuY29tLnNnL2pvYnMvaXQtcHJvamVjdC1tYW5hZ2VyLWluZnJhc3RydWN0dXJlLWNsb3VkLXNlY3VyaXR5X3NpbmdhcG9yZV8zNjQ1NzA3MS8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Management", "value": "GC18"}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Advertising and Marketing", "value": "GC03"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Media, Communications and Writing", "value": "GC20"}, {"text": "Transportation and Logistics", "value": "GC30"}, {"text": "Art, Fashion and Design", "value": "GC05"}, {"text": "Construction", "value": "GC09"}, {"text": "Education", "value": "GC11"}, {"text": "Human Resources", "value": "GC15"}, {"text": "Protective Services", "value": "GC23"}, {"text": "Property", "value": "GC24"}, {"text": "Science and Engineering", "value": "GC27"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "Project manager", "value": "project manager"}, {"text": "Program manager", "value": "program manager"}, {"text": "Manager", "value": "manager"}, {"text": "Delivery manager", "value": "delivery manager"}, {"text": "Project director", "value": "project director"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Senior", "value": "senior"}, {"text": "Consultant", "value": "consultant"}, {"text": "Coordinator", "value": "coordinator"}, {"text": "Deputy director", "value": "deputy director"}, {"text": "Director", "value": "director"}, {"text": "Group manager", "value": "group manager"}, {"text": "Operations", "value": "operations"}, {"text": "Scrum master", "value": "scrum master"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Services", "value": "services"}, {"text": "Vice president", "value": "vice president"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Engineering Services", "value": "/business/naics2007/5413"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Entertainment", "value": "/business/naics2007/71"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Management", "value": "/business/naics2007/55"}, {"text": "Real Estate", "value": "/business/naics2007/53"}, {"text": "Research", "value": "/business/naics2007/5417"}, {"text": "Retail", "value": "/business/naics2007/44"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": ".AB4Jjf.qPB6Vc{padding-right:11px}.qfpP8d{padding:7px 0 7px 11px}.S003Ke{flex:none}.ZoN4Lb{color:rgba(0,0,0,.54)}.nAXVG{color:#70757a}.IxQsL{color:rgba(0,0,0,.26)}.xFO1De{color:#fff}.ooFpK{color:rgba(255,255,255,.30)}.mtnwac{color:#4285f4}.WxeeKb{color:#34a853}.hIVRU{color:#f29900}.EXaTMc{color:#fbbc04}.sxn46d{color:#000}.gqMTF{color:#1a73e8}.zpn8Mb{color:#d93025}.dEUPmd{color:#1e8e3e}.PJNo1{color:#fbbc04}Actively Hiring", "value": "e"}, {"text": "Michael Page", "value": "/m/04cxldw"}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Nanyang Technological University", "value": "/m/0l49k"}, {"text": "Jobline Resources Pte Ltd", "value": "/g/11gp2647pn"}, {"text": "Randstad Singapore", "value": "/g/11g70b50mr"}, {"text": "GECO Asia", "value": "/g/11gk72_bt_"}, {"text": "Facebook", "value": "/m/0hmyfsv"}, {"text": "HP", "value": "/m/03mnk"}, {"text": "IoTalents", "value": "/g/11dxq187wm"}, {"text": "NCS Group", "value": "/m/0282746"}, {"text": "National University of Singapore", "value": "/m/01q460"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "OPTIMUM SOLUTIONS (SINGAPORE) PTE LTD", "value": "/g/11g70hkrbx"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "ACI HR Solutions Ltd", "value": "/g/11c73ryh3p"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Apple", "value": "/m/0k8z"}, {"text": "Avensys Consulting", "value": "/g/11g7022gjf"}, {"text": "BNP Paribas", "value": "/m/02qhk4"}, {"text": "Ceridian", "value": "/m/07f8h6"}, {"text": "Ensign InfoSecurity", "value": "/g/11g4jhymjr"}, {"text": "Humanica Asia Pte. Ltd", "value": "/g/11h1y98c9z"}, {"text": "Kerry Consulting", "value": "/g/11c73vtzc8"}, {"text": "Marsh and McLennan", "value": "/m/053rw"}, {"text": "NSEARCH GLOBAL", "value": "/g/11dxpksll4"}, {"text": "NTT", "value": "/m/05mybp8"}, {"text": "OakTree Consulting", "value": "/g/11g70jfhtq"}, {"text": "Salesforce", "value": "/m/07btr5"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "TEKsystems", "value": "/g/11b6g4bkv0"}, {"text": "Teradyne", "value": "/m/04bzqp"}, {"text": "Toshiba Tec Singapore Pte. Ltd", "value": "/g/11g9n9q547"}, {"text": "Trustwave", "value": "/m/0n3xjf5"}, {"text": "Wood Plc", "value": "/m/07vv9s"}, {"text": "Workiva", "value": "/m/0113m1rd"}, {"text": "A-it Software Services Pte Ltd", "value": "/g/11dxpy_gl_"}, {"text": "ABS Group", "value": "/g/11dxplj1z6"}, {"text": "AIA", "value": "/m/02r5cgx"}, {"text": "ASEAN CABLESHIP PTE. LTD.", "value": "/g/11b7dsfph2"}]}]}