{"search_metadata": {"id": "60827ada3d69193004c4a7ee", "status": "Success", "json_endpoint": "https://serpapi.com/searches/d3f793a984d58787/60827ada3d69193004c4a7ee.json", "created_at": "2021-04-23 07:44:26 UTC", "processed_at": "2021-04-23 07:44:26 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28consultant%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=150", "raw_html_file": "https://serpapi.com/searches/d3f793a984d58787/60827ada3d69193004c4a7ee.html", "total_time_taken": 3.63}, "search_parameters": {"q": "(consultant) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "150"}, "jobs_results": [{"title": "SAP Consultants (FIORI, MM, SD, ABAP, BRS)", "company_name": "THATZ International Pte Ltd", "location": "Singapore (+1 other)", "via": "via JobsCentral", "description": "Are you the right person we are looking for as our team player to support our business growth? As part of our Next-Generation ICT Engagement and Consultancy (Thatz 2.0) growth roadmap, we are seeking keen candidates to join us on our journey as we scale towards greater heights.\n\nFounded since 1998, Thatz International has now evolved into the Next-Generation ICT Engagement and Consultancy establishment.\n\nThatz 2.0 offers leading edge ICT & Digital Solutions, as well as, world class Services to organizations, companies or institutions seeking to further their operations or businesses excellence.\n\nA BizSafe3 and TAFEP pledge company, Thatz International has been recognized through various achievements such as Singapore SME1000 since Year 2013 and Total Defense Award since Year 2012. The Founder has also been recognized with the inaugural Teochew Entrepreneur Award 2016.\n\nJoin Thatz now to maximize your true potential to the fullest by excelling in your CAREER!\n\nARE YOU THATZ ONE?\n\nSAP... Consultants (FIORI, MM, SD, ABAP, BRS)\n\nPrimary Responsibilities:\n\nA) SAP FIORI Consultant\n• Responsible for technical and functional development and support of the SAP FIORI applications.\n• Provide collaboration with SAP functional and business users to develop the FIORI screens and functions, participate in implementation projects and provide post Go-Live support.\n• Propose UX solution, develop the FIORI screens and functions, perform requirement analysis and design, as well as document the technical design.\n• Fix bugs.\n• Perform testing and assist users in UAT.\n• Perform cutover activities and provide post implementation support.\n\nB) SAP MM Consultant\n• Support Day to Day Incidents and Service Requests to Customers under SAP MM Modules and customization.\n• Support Change Requests/Enhancements/Projects when it is required.\n• Support any System Issues/Configurations/Customizations related with SAP MM Modules.\n• Resolve issues and maintain system documentation.\n• Deliver the solution/change within required timeline base on Service Level Agreement.\n• Evaluate changes and solution proposal; adhere to the function of Template design.\n• Communicate properly to Business and understand urgency and business impact of each issue.\n\nC) SAP SD Consultant\n• Implement SAP SD modules for SAP rollout and implementations, including conduct user requirements study, perform fit/gap analysis, design solutions, create blueprint and functional specifications.\n• Configure and test systems, as well as perform data migration.\n• Conduct User Acceptance Testing (UAT) and user training.\n• Facilitate knowledge transfer from Project to Support team members.\n• Resolve issues and maintain system documentation.\n• Change request handling including feasibility study & solution design and functional specification & configuration.\n\nD) SAP Consultant (ABAP and BRS)\n• Planning, design, development, testing and release of custom objects.\n• Develop technical architecture, strategy and guidelines documents.\n• Provide Development Effort Estimates.\n• Technical Specification and Unit Testing Document.\n• Coding complex developments.\n• Participate in project quality management tasks, such as peer and quality reviews of specifications, design documents, and code reviews.\n• Responsible for analysing high-level business processes and requirements.\n• Assist in testing to validate and provide operating controls to ensure development requirements are satisfied.\n• Define and develop technical standard.\n\nJob Requirements:\n\nA) SAP FIORI Consultant\n• Degree in Information Technology or Computer Science or related disciplines and at least 5 years of JAVA/ABAP experience and at least 2 years of FIORI experience.\n• Proficient in FIORI development such as standard Fiori 2.0 extension, customised Fiori, SAP UI5 and SAP OData.\n• Proficient in ABAP development such as reports, adobe forms, Webdynpro programs, user exit, BADI.\n• Good knowledge in Logistics management modules covering Project Systems, Contracts and Material Management of SAP.\n• Strong analytical and trouble shooting skills.\n• Good communication and inter-personal skills.\n• Able to work independently and as a team.\n• SAP Certified Application Associate or Professional will be preferred.\n• Locals preferred.\n\nB) SAP MM Consultant\n• Degree in Information Technology or Computer Science or related disciplines, must proficient in SAP MM Module with 5-10 years of experience in Support or Project Implementation.\n• Good understanding of programming concepts and experience with structured design, development, and implementation of SAP.\n• Experience with unit and integration testing\n• Strong in business process (sales environment) & technical skills (configuration).\n• Strong knowledge of info structure creation, configuration and updated rules.\n• Good analytical and problem-solving skills.\n• Good documentation skills using MS Office applications\n• Able to communicate well at all levels.\n• Strong interpersonal skills; ability to work well on cross functional project teams and foster team commitment to tasks.\n• Locals preferred.\n\nC) SAP SD Consultant\n• Degree in Information Technology or Computer Science or related disciplines, with at least 5 years of experience in manufacturing industry, minimum 4-5 complete SAP SD implementations.\n• Proficient in SAP Sales & Distribution (SD) and ECC 6.0.\n• Strong in business processes & technical skills (SAP SD configuration).\n• Strong knowledge of info structure creation, configuration, updated rules and Order-to-Cash processes in a sales and manufacturing environment.\n• Experience in SAP integration with sub-system.\n• Experience with software unit and integration testing.\n• Able to deliver the project on time and successfully.\n• Good understanding of programming concepts and experience with structured design, development, and implementation of new computing architectures.\n• Good analytical and problem solving skills.\n• Good documentation skills using MS Office applications\n• Able to communicate well at all levels.\n• Strong interpersonal skills; ability to work well on cross functional project teams and foster team commitment to tasks.\n• Knowledge in WM / QM / Vistex system is preferable, but not mandatory.\n• SAP certification in SD module will be advantageous.\n• Locals preferred.\n\nD) SAP Consultant (ABAP and BRS)\n• At least 5+ years of experience in the SAP development is required.\n• Proficient in ABAP, including Reporting, Interface, Conversion, Enhancement & Forms (RICEF).\n• Have good technical business process of SAP SD, MM, PP & FI/CO modules.\n• Experience in web-service development, OData & Fiori and S/4 HANA.\n• Excellent interpersonal and communication skills\n• Locals preferred.\n\nKey objective of this role:\n\nTo deliver awesome user experience through result oriented yet friendly service disposition ...we call it Thatz Way!\n\nAs a people developer, we embrace Thatz Delight for:\n• Annual Increment based on your job performance\n• Company events and annual awards\n• Community and sustainability support\n\nAs an advocate for fair employment, we strive to do our best to render objective and merit based considerations for all applications, and we shall communicate with you personally when short-listed. For those who are not short-listed, your profile will be kept for other opportunities where suitable.\n\nBest wishes to your job search!\n\nFeel free to recommend this position to your friend(s) or relative(s) who may meet our needs and be rewarded.\n\nFor more information about THATZ and other job listings, please visit: www.thatz.com\n\nPlease like our Facebook: www.facebook.com/thatz.international\n\nLinkedIn: www.linkedin.com/company/thatz-international-pte-ltd\n\nOur Software Product: www.thatzcontact.com and https://yummydurian.com\n\nSTAY SAFE AND HEALTHY! TAKE CARE", "extensions": ["6 days ago", "$4.5K–$6.5K a month", "Contractor"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Contractor", "salary": "$4.5K–$6.5K a month"}, "job_id": "eyJqb2JfdGl0bGUiOiJTQVAgQ29uc3VsdGFudHMgKEZJT1JJLCBNTSwgU0QsIEFCQVAsIEJSUykiLCJjb21wYW55X25hbWUiOiJUSEFUWiBJbnRlcm5hdGlvbmFsIFB0ZSBMdGQiLCJjb21wYW55X21pZCI6Ii9nLzExZHhweDRnMWwiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJIZTczQ2dZaVRSZDNOcUJaQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFb3dDQ3N3QlFVNVZYMDV4VVhsT1JteEtaMVphVmtwSFFYcHRYemxJYzE5Nk9TMXBPRTAzY0hkdVptTkNURlZHWlZrMmRISk5RV2hXTjFsaFRXWXhVblZTTXpCVVgzZHdiWFJyWjBONVRHOVNNMHBYYlVwb1kzQlJabUpuY2xjNFJtUmthbVJoVmxOU2JqRkdSRVYwUld4b1kwVnVhVFl5VGtwWlpEaHpUMXBuYUZKVGQwZHdhSFIzV1c5TmRXSTRYMVIwWVdsQ05GOVVTM0U1ZVdoM1NtVjZSVU5rZW5SRmIxOTNOVGRrT0ZWeGRWcFlaUzFUVjB0VFVucGhTMEV4UVRNMWRWbDZSREUxWXkwNU9IcGlSMnhtRWhjelNIRkRXVTlUWWt0alEwZDNZbXRRZUhCbFdXbEJjeG9pUVU5TldWSjNRMU5pTm1jeVR6ZGhZV2RmUzB0UUxUVm5OaTF2TWxsaVVVUTBVUSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzYiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9ic0NlbnRyYWwiLCJsaW5rIjoiaHR0cHM6Ly9qb2JzY2VudHJhbC5jb20uc2cvam9iL3NhcC1jb25zdWx0YW50cy1maW9yaS1tbS1zZC1hYmFwLWJycy1qM3MyNjE2Z3gzdGt0cXd3aDQzP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Microsoft Azure Consultant", "company_name": "Technopals Pte. Ltd.", "location": "Singapore (+1 other)", "via": "via Monster Singapore", "description": "Overall Purpose:\n\nThe Senior Solution Specialist Cloud Computing is end to end accountable to provide seamless Cloud computing services across all regions supporting Company’s operations and the digital transformation in a cost effective way.\n\nThe role is accountable for plan, build and run (third level support for operations) of enterprise computing solution for Cloud providing a technology strategy and roadmap, managing the solutions lifecycle, design and architecture of new solutions and provide third level support and problem solving to Operations team when requested. Also will be accountable for managing the technical cloud environment, orchestrating or partners, managing our cloud contract, knowledge map, inventory and capacity management.\n\nThe role is accountable for delivering projects and services to the entire enterprise with a level of budget responsibility and team member leadership, both direct and indirect.\n\nMain accountabilities (Main Responsibilities):\n\n· Delivery... projects aligned with the strategy and roadmap for Cloud computing services domain.\n\n· Accountable to technically lead highly engaged teams of internal and external resources in different locations, cultures and countries, delivering the enterprise mission and vision and adhering to enterprise commitments/values\n\n· End to end technical accountability for plan, build and run and the successful delivery of technology projects and services as measured through value, cost, quality (service levels) and schedule. This includes the full lifecycle of the solutions, projects and services, including strategy, planning, architecture, design, operations, maintenance and decommissioning\n\n· Ensure compliance with and participate in continuous improvement of organizational standards, practices and methodologies\n\n· Define, track, measure and report on critical success factors and key performance indicators\n\n· Partner for success across the Information Technology ecosystem and with our business partners and our suppliers\n\n· Efficiently plan and manage projects and services budgets, according to enterprise investments and strategies\n\n· Deliver projects, platform or service analysis, design, and build on compute technologies for Cloud as necessary in a self-motivated manner and consistent with Engineering Release Plan and project deliverables\n\n· Drive benchmarking exercises to ensure Company’s IT remains within the top tier of best practices\n\n· Accountable for technical solutions that meet the needs of our business units in a cost-efficient manner\n\n· Ensure security standards and policies are implemented\n\n· Efficiently plan and manage projects and services capacity and demand by following the Information Technology and/or enterprise demand processes\n\n· Ensure positive partner/customer experience through satisfaction surveys\n\n· Proactively lead through organizational change and the evolutions needed in the IT Way/Competencies\n\n· Implement best practices and continuous improvement programs\n\n· Drives continuous financial performance improvement in Cloud Services Domain\n\n· Lead communication on service performance\n\n· Collaborate with enterprise stakeholders, providing advice and assistance to coordinate and operationalize the integrated strategic and operational plans for innovative technologies, methodologies and processes.\n\nKnowledge and Experience:\n\nExperience (including number of years):\n• Experience within the trading and food industry (desired)\n• Experience in a large, complex organization\n• 5+ years of wide-ranging and deep experience IT and at least 5 in Cloud Technologies including but not limited to Microsoft Azure and Cloud Automation Tools.\n• 5+ years of technical team leadership experience with increasing levels of accountability (desired)\n• Proven experience in Architecture of new solutions in Cloud\n• Proficiency in security (highly desired).\n• Recognized record of accomplishment for completing complex cross-functional environments.\n• Strong understanding of infrastructure convergences and business benefits provided (highly disered).\n• Experience in solution architecture, program management, engineering, vendor management, project management and technical operations.\n• Proven experience delivering technology projects and services, with excellent customer quality, cost and outcome measures\n• Excellent oral, written, and interpersonal communication and presentation skills\n• Ability to work with a range of technical staff, architect and operational and business partners to develop joint solutions\n• Ability to facilitate problem solving among groups with varying needs and priorities\n• Understanding of ITIL frameworks, Agile and lean principles\n• Excellent analytical skills\n• Ability to multi-task and prioritize work\n\nLanguages: Fluent English both written and spoken mandatory.\n\nOther skills and competencies:\n\nIT skills:\n\n§ Knowledge of ITIL process\n\n§ Knowledge in Agile Methodology (Scrum and Scale Agile Framework highly desired)\n\n§ Experience in managing IT organization transformation projects across different regions and cultures\n\n§ Demonstrated capacity to manage external partner in different countries\n\n§ Cloud knowledge and Architecture skills (highly desired)\n\n§ Automation or Orchestration experience (highly desired)\n\nBusiness skills:\n\n§ Ability to work with virtual teams (good phone and video conference call skills) in multi regions, culture and location\n\n§ All work done in English (must have an excellent level both spoken and written)\n\n§ Have excellent communication skills\n\n§ Ability to deal with stakeholders at all levels (desired)\n\n§ Business oriented (focus in value to the business)\n\nBehavior skills:\n\n§ Excellent customer facing/customer service skills\n\n§ Demonstrated leadership and team-management skills in multi-cultural, regions environment\n\n§ Excellent interpersonal skills and ability to communicate effectively at all levels (written and verbal)\n\n§ Ability to work positively with a wide range of individuals\n\n§ Ability to work in fast-paced, reactive, and challenging trading environments\n\n§ Business oriented\n\n§ Sense of ownership\n\n§ Sense of urgency\n\n§ Collaboration approach and solution driven mentality\n\n§ Autonomy with responsibility\n\nCertifications:\n\n§ AZ-900 (Microsoft Azure Fundamentals)\n\n§ (Microsoft Azure Architect Technologies) & (Microsoft Azure Architect Design)\n\nOr\n\n§ (Microsoft Azure Architect Technologies) & (Microsoft Azure Architect Design) Or\n\n§ (Microsoft Azure Architect Technologies) & (Microsoft Azure Architect Design)\n\nOr\n\n§ (Microsoft Azure Architect Design & (Microsoft Azure Architect Technologies", "extensions": ["7 days ago", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJNaWNyb3NvZnQgQXp1cmUgQ29uc3VsdGFudCIsImNvbXBhbnlfbmFtZSI6IlRlY2hub3BhbHMgUHRlLiBMdGQuIiwiY29tcGFueV9taWQiOiIvZy8xMWR4cHZreW5wIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiVE9YU1pYbm1JVnQ4WXdxcUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZjQkNyY0JRVTVWWDA1eFV6VTFlWEZXTUdoeGNtaFBVMjFKYmxGVmNXNDROaTFXWmsxQmQxbGFXVGd0YldSSlNtbDNURmxqV25WUFdFUjNObnBaTjJONFlVMU9WbGRmV0c1cVMxbGtOemxvTWpCSWJrWTBVMFZVTlhaRE1sRXRXRmwwT1RrM2MxZG9lVWc0YWtOMk9VVkNhalpvTFZvd2VXZEpiSE5qV0hwUVZVcDNSakpoYmtscFgzVnllaTB3ZEU4eloxTjNNbXhMVldJeGVHZFlOMGh5V1ZRM2VHRjRSbEJMZUVoNmVVNDJNbkF6WjJ4NlNYcDBZbVJGRWhjelNIRkRXVTlUWWt0alEwZDNZbXRRZUhCbFdXbEJjeG9pUVU5TldWSjNSRUYxYzFCaGNGWnFZalZhY0hwVVJta3hWbDlZZUhONFRsUjJadyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzEzIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1vbnN0ZXIgU2luZ2Fwb3JlIiwibGluayI6Imh0dHBzOi8vd3d3Lm1vbnN0ZXIuY29tLnNnL2FtcC9qb2ItdmFjYW5jeS1taWNyb3NvZnQtYXp1cmUtY29uc3VsdGFudC10ZWNobm9wYWxzLXB0ZS1sdGQtc2luZ2Fwb3JlLTI3NzUwMDI1Lmh0bWw/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Machine Safety Consultant (remote support for projects at Indo)", "company_name": "JMC Talent Search Pte. Ltd.", "location": "Singapore (+1 other)", "via": "via Joblum Singapore", "description": "• Working location: Jakarta (MNC company)\n• Industry: Automation\n• At least 5 year(s) of working experience in the related field\n• Required to have Safety Certification TUV FSEngineer\n• Attractive Remuneration with good benefits (depending on experience)\nMachine Safety Specialist/ Consultant will provide leadership for Safety Services offerings, as well as delivering safety assessments, verification, validation and remediation.\nResponsible for proposing and delivering safety consulting services.\nMachine Safety Certification from TUV Rheinland (or other equivalent organizations) is highly desireableREQUIREMENTS:\n- BS Degree in Engineering or equivalent experience.\n- Safety Certification TÜV FSEngineer is required.\n- Preferably 5 years experience in machine safety consulting or discrete manufacturing safety engineering\n- Knowledge and firsthand experience in working with safety legislation, e.g. OSHA, IEC, ISO, EN Safety standards (61508, 62061, 13849, etc.), or equivalents.\n... Experience in LOTO & Harzadous Energy Control\nCompetency:\n1. Demonstrated ability to propose and present consulting projects. Strong understanding of machine safety in a manufacturing environment required.\n2. Demonstrated understanding of discrete manufacturing processes, automation design and integration.\nSuccessful candidate should possess strong capability in driving a disciplined process, holding individuals and themselves accountable for results.\n3. Self-started and capable of working with minimal supervision.\n4. Excellent verbal and written communication skills.\n5. Demonstrates time management skills and the ability to manage multiple priorities.\n6. Understanding of financial statements and ability to generate financial justification and ROI calculations for projects required.Customer/Partner Focus: comprehending the needs and requirements of customers or business partners to provide them with strategic value.\nEnergy, passion, commitment, and integrity.\nStrong knowledge of the industrial services marketplace is required.\nStrong commercial skills must be present to interact at all levels of the organization.\nAbility to understand the technology in order to provide the most effective support.\nAbility to convey concepts and ideas to the team, while fostering a sense of ownership and innovation.\nAbility to communication and interact effectively across all levels of the organization.\nAbility to present and communicate effectively to a large audience.\nAbility to develop relationships of trust and confidence with CSM business groups and key stakeholders within Sales, Control Products and Solutions, and Architecture and Software.\nDemonstrates good judgment in selecting methods and techniques for obtaining solutions.\nDue to pandemic period, candidates will be required to work remotely until further notice when needed to travel for clients' visits.\nSalary will commensurate with experience. Attractive salary package + benefits will be offered\n\nInterested candidates, please submit your detailed resume (attached with recent photograph) stating your current & expected salary and availability in MS WORD format to jenny.lee@jmcsg.com", "extensions": ["15 days ago", "Full–time"], "detected_extensions": {"posted_at": "15 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJNYWNoaW5lIFNhZmV0eSBDb25zdWx0YW50IChyZW1vdGUgc3VwcG9ydCBmb3IgcHJvamVjdHMgYXQgSW5kbykiLCJjb21wYW55X25hbWUiOiJKTUMgVGFsZW50IFNlYXJjaCBQdGUuIEx0ZC4iLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IkNaXzhkUFpTUTI2UjNObW1BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9ibHVtIFNpbmdhcG9yZSIsImxpbmsiOiJodHRwczovL3NnLmpvYmx1bS5jb20vam9iL21hY2hpbmUtc2FmZXR5LWNvbnN1bHRhbnQtcmVtb3RlLXN1cHBvcnQtZm9yLzYwNDUxNT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Talent Acquisition Consultant [Internship]", "company_name": "SearchAsia Consulting Pte Ltd", "location": "Singapore (+1 other)", "via": "via Glints", "description": "Job Description\n\nHave you ever wondered what the hiring process for companies was like?\n\nAre you open to networking and establishing connections between firms and talents in the legal industry?\n\nDo you want to make an impact and change someone’s course of life?\n\nJoin us and discover more on the behind-the-scenes of a legal recruitment firm!\n\nIn this 3-month internship, together with a team of other recruiters, you are responsible for the end to end recruitment cycle process.\n\nA hands-on experience and steep learning curve guaranteed!\n\nWhat can you take away from us?\n• How to source for the right talent using both traditional and creative recruiting methods and resources\n• How to provide staffing solutions and manage talent pipeline to meet the needs of the business units\n• A more comprehensive understanding of the legal industry\n• Improved interpersonal and networking skills\n• How to be resourceful and efficient as we manage, prioritize and close talent searches against a timeline\n• A... real insight into, and personal experience with corporate life – life as a legal recruitment consultant\n\nResponsibilities of a legal recruiter:\n\nRecruitment\n• To actively source for potential candidates for different legal placements via many channels\n• Communicating with professionals in the legal industry who hold managerial roles and above\n\nAdministrative\n• Posting of job advertisements\n• Data entry and documentations\n• Updating and maintenance of documents\n\nOur Preferred Skills:\n• Driven, resourceful and self-motivated\n• Ability to work creatively and calmly under pressure\n• Excellent verbal and written communication skills\n• A detail-oriented, data-driven mentality\n• A cheerful and positive mindset\n• Well-versed in Microsoft Office\n\nRequirements:\n• Minimum ‘A’ Level Certification\n• Minimum 3 months commitment\n\nJoin our team of highly passionate, driven and warm staff at Recruit Legal today!\n\nInterested applicants may contact Claire at legal@searchasia.com.sg\n\nClaire Lin\n\n@ Lin Xiuxin\n\nEA License No:. 16S8107\n\nEA Personnel Registration No:.R1103711\n\nwww.recruit-legal.com", "extensions": ["28 days ago", "$1K–$1.5K a month", "Internship"], "detected_extensions": {"posted_at": "28 days ago", "schedule_type": "Internship", "salary": "$1K–$1.5K a month"}, "job_id": "eyJqb2JfdGl0bGUiOiJUYWxlbnQgQWNxdWlzaXRpb24gQ29uc3VsdGFudCBbSW50ZXJuc2hpcF0iLCJjb21wYW55X25hbWUiOiJTZWFyY2hBc2lhIENvbnN1bHRpbmcgUHRlIEx0ZCIsImNvbXBhbnlfbWlkIjoiL2cvMTFmeTI2MG5oeiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IlYtVFJWbXVlS0VWd0tNZVRBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVvd0NDc3dCUVU1VlgwNXhVbWxFV25wd09VNXhjVFpRWVZSRE9GcGlWVXBCTlRCaGQxaEtOWFZxU1dWb2NXNUplRWhWVDBOcWNsaFBlVFZzVlhwTFRGRm5NV1JKUlRjelVuZHVhMkppTVZkeGRTMVlhbWRJUW5Nd05qVlNXRkJVU1hkNlV6UjBVWFU1ZWs0M1JXSkVhRXRUWDFsbk5rdHdhbnBZYUhrelFVdHNhVnBMVURoSFoweElRV1V4ZFV0dGRuaHZjV2xNUkVwbFoyWktRVVZ4ZDNwclluVmFka0ZHWWpoRVRFb3hMVzU2Y2w5dFltVmhXbGM0ZDJkalEzaGlNbWw1VGxwMFNrdDFNbU5rYjJOeVNIbzFFaGN6U0hGRFdVOVRZa3RqUTBkM1ltdFFlSEJsV1dsQmN4b2lRVTlOV1ZKM1EzQndSRGRwWkZKVWIzRjVTelkwZGtkeVJFOXhUWEpOTkRsWVVRIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMjciLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gR2xpbnRzIiwibGluayI6Imh0dHBzOi8vZ2xpbnRzLmNvbS9zZy9vcHBvcnR1bml0aWVzL2pvYnMvdGFsZW50LWFjcXVpc2l0aW9uLWNvbnN1bHRhbnQtaW50ZXJuc2hpcC80YTk4M2MxMi1hZmJiLTQwODUtOGIzZi1jY2Q4ZGZjMTkzODA/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Senior Consultant, IT Security", "company_name": "Singtel Group", "location": "Singapore", "via": "via Singtel Careers", "description": "Job Title\n\nRole Description\n• Primary duties and responsibilities\n• Key deliverables\n\nRequirements\n• Education\n• Knowledge, Skills and Abilities\n\nSecurity Consultant\n• Deploy, manage and support network cyber security devices in LAN, WAN and Internet network infrastructure at customer\n• Maintain, identify and recover faults in cyber security devices\n• Provide technical support and consultation for cyber security devices\n• Perform diagnostics, trouble shooting and repair cyber security devices both in workshop and in the field\n• Perform annual preventive maintenance on network security devices\n• Mobile phone 27X7 standby and respond to fault-calls and perform corrective actions\n• Diploma/Degree in Networking/ IT /Engineering, Electrical & Electronics Engineering or relevant field\n• Good knowledge in the field of data networking, Internet Protocols and network security\n• Previous experience in similar security and technical maintenance field preferred but not necessary\n• Certification... in CISSP, CCNA, CCNP an advantage", "extensions": ["20 days ago", "Full–time"], "detected_extensions": {"posted_at": "20 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQ29uc3VsdGFudCwgSVQgU2VjdXJpdHkiLCJjb21wYW55X25hbWUiOiJTaW5ndGVsIEdyb3VwIiwiY29tcGFueV9taWQiOiIvbS8wMjB6ZmwiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiItWXZucjFDOWtBNEVJMzYwQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUlCQ3FJQlFVNVZYMDV4VkVWWlNubENiR2RYY21kQlVHSjJZV0pZZDBVeE16TjZVbTlzYlhWSk4zaGFja1p0TXpCMFN6bEtWWE5QWW5SVmJsRlpiblpGWnpZM2QwdHhjMnA1V0hWb1dYUm9NMDFJY2xGUkxXaHBWVzFXV0Vsb01YRlpRWFk0WW1GZmFGaDBSWFUwYlc1UFpsUjZhbkZ3YUhaQ2JHUkdRa0pMVlVkaGFtRjVkM0JHYWs5MmNtSjVWbUZQV21KUmEzZGhaMnBwY2pCVVVUUlNOVWxTVG5aUkVoY3pTSEZEV1U5VFlrdGpRMGQzWW10UWVIQmxXV2xCY3hvaVFVOU5XVkozUkVndFNta3labUp1VG5CQ01YUlpSV0ZwWlRoV1ZEUjFjVkZKWnciLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18zNSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBTaW5ndGVsIENhcmVlcnMiLCJsaW5rIjoiaHR0cHM6Ly9ncm91cGNhcmVlcnMuc2luZ3RlbC5jb20vam9iL1Nlbmlvci1Db25zdWx0YW50JTJDLUlULVNlY3VyaXR5LVNpbmcvNTc5MzAwMTEwLz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "GRC Security Consultant", "company_name": "LINKBYNET", "location": "Singapore", "via": "via Jobs", "description": "Company Description Passionate about cybersecurity and helping customers protect and modernize their digital infrastructure? We are looking for a GRC (Governance Risk and Compliance) and Security Consultant to join our team in Singapore. S/he will have expertise 1- GRC with exposure to regulatory projects (Payment Act, PDPA, GDPR, PCI-DSS, AML/KYC, MAS TRM) 2- Cybersecurity domain knowledge with CISM and or CISSP certification and practical expertise in protecting sensitive data with relevant and proven security measures and controls and processes 3- Project Management expertise (PMP or Prince 2 certified) Portfolio: consulting, solution integration and (Security Operating Center) managed services . Why LINKBYNET? LINKBYNET is celebrating its 21th birthday this year. Proud of a ~25% CAGR growth since its inception, it is now a 100M euro revenue multi-national company (HQ in France) with more than 800 clients and almost 1000 Linkies. Established in Asia since 2014, we are providing... managed services in Singapore, Hong-Kong SAR, mainland China and Vietnam. We help our clients consolidate/modernize their data-centers, migrate to the hybrid (public/private) cloud, adopt security best practices and build (DevOps-based) software factories. Our ITIL-certified teams manage clients infrastructure from Vietnam, China, Mauritius, France and Montreal. We are looking for a professional individual with +5 years of consulting experience with domain knowledge and expertise in GRC and Cybersecurity in order to: 1- Formulate infosec objectives and roadmap 2- Establish policies, processes and procedures in line with local and international regulations 3- Verify the security compliance posture against the regulations and standards and derive a security implementation plan for remediation 4- Develop security awareness and culture 5- Establish a risk management framework and conduct risk assessment with relevant risk rating matrix 6- Participate in operations and projects initiatives and activities from a cybersecurity perspective 7- Lead in the incident and crisis management response activities Job Description We are looking for a professional individual with +5 years of consulting experience with domain knowledge and expertise in GRC and Cybersecurity. 1- Formulate infosec objectives and roadmap 2- Establish policies, processes and procedures in line with local and international regulations 3- Verify the security compliance posture against the regulations and standards and derive a security implementation plan for remediation 4- Develop security awareness and culture 5- Establish a risk management framework and conduct risk assessment with relevant risk rating matrix 6- Participate in operations and projects initiatives and activities from a cybersecurity perspective 7- Lead in the incident and crisis management response activities Qualifications · BSc/MSc in Computer Science or equivalent · +5 years of experience in the Cybersecurity area · Previous experience in a customer facing role such as consultant · Experience in regulatory projects with expertise in MAS TRM, PS act, PDPA, GDPR, PCI-DSS, AML/KYC · Able to lead, influence, train, coordinate Licenses/Certifications required · Security certifications · ISMS lead auditor · ISMS risk assessment/audit/implementation · CISM/CISSP/OSCP/WSCP/CEH · PMP/Prince2 · Scrum Master Critical knowledge & skills including tools, software applications, language, etc. · JIRA/CONFLUENCE · AWS/AZURE · SAP Commerce · MIRAKL · ADOBE CMS · FLUENT or any order fulfillment system · API knowledge (design, build, run) · Good English skills Additional Information The company places a lot of importance and truly embodies values like innovation, humility, collaboration, sense of excellence and respect of commitments. Linkbynet positions itself as a premium customer and people-centric IT services company", "extensions": ["8 days ago", "Full–time"], "detected_extensions": {"posted_at": "8 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJHUkMgU2VjdXJpdHkgQ29uc3VsdGFudCIsImNvbXBhbnlfbmFtZSI6IkxJTktCWU5FVCIsImNvbXBhbnlfbWlkIjoiL2cvMTFmMDBzNDRnYiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImdGYmhtWXZGak1XVENjcnZBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1SUJDcUlCUVU1VlgwNXhVWFY2Tm5WMFNtRjFRMDQ1ZVVGNGIzbG1WelpTYkZGa01XMXlORlJMVGtWS1lXazBSamg0ZUdGbVVsUldSUzFGVldGaGNsQjBUVkU1WWpobFEzSlRkR3B3TTJGclExQm9aVkZXVnpkTWREbDRSMEpZYkhwd2NIY3RRbGxRYmtkRFYzUk5VMmwyU25kTlQxOXRVRTh5YkhOQ2RqRjVRbUV3Ylhrd01uaFVYelEwVm1GcFlUTk1lWHA2Y2xVNGVFRTBibm96TjNsdlVIWkVSamQzRWhjelNIRkRXVTlUWWt0alEwZDNZbXRRZUhCbFdXbEJjeG9pUVU5TldWSjNRbTAwUlZGcmVUSllOMWczVlc1YVpHODVhRmRpVGpoMmJXa3RVUSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzQzIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnMiLCJsaW5rIjoiaHR0cHM6Ly9zZy5maWRhbnRvLmNvbS9qb2JzL2pvYi1vcGVuaW5nL2NvdW5zZWxvcnMtYWxsLW90aGVyL2dyYy1zZWN1cml0eS1jb25zdWx0YW50LTI3MzY2MjE1Nj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior Network Consultant", "company_name": "Ad Astra Consultants", "location": "Singapore", "via": "via LinkedIn", "description": "About Our Client:\n\nOur client is a global leader in next-generation digital services and consulting. They enable clients in 46 countries to navigate their digital transformation. With over three decades of experience in managing the systems and workings of global enterprises, They expertly steer their clients through their digital journey.\n\nArea of responsibilities:\n• Discovery and Design Workshop\n• Finalize the Baseline, Architecture, Design and Migration Strategy\n• Enterprise Data Network (administration, patching, upgrade and migration activities), Design, Preparing of HLD/LLD, Implementation Team leading, Service Level management, demand, incident, change management.\n• Provide network WAN/LAN design, implementation, consulting, Cisco, Aruba, Juniper or equivalent\n• Network audit Identify the gaps and suggest the remedial solution. Supporting in RFP/RFI response.\n• Handling Client discussions for due diligence, business information gathering etc.\n• Site Network Build & Transform\n•... Migration\n• Support Hyper care and Handover\n• Writing solutions / estimates for RFPs.\n• Experience in running operations with ITIL processes / Project Management - PMP\n\nTechnical skills (Required - Mandatory):\n• Deployment\n• Cisco Switching NX-OS/Cisco Routing\n• VMware NSX-V/T\n• Network Automation/Python/Ansible\n• F5 /Citrix Load Balancing\n• Cisco Switching & Routing\n• As Built, LLD, Testing & Acceptance Testing Documentation Skills\n\nTechnical skills (Required - Nice to have):\n• F5 Load Balancing, Network Security & Design Skills\n• VMware NSX-V/T\n• Certification: CCNP/CCDA equivalent, F5 Certified Technical Specialist\n\nSoft skills:\n• Excellent Analytical and troubleshooting skill.\n• Excellent in Verbal, written communication.\n• Creative thinking in implementing Service improvements (automation, incident reduction, etc.).\n• Willingness and flexibility to learn new technologies, scale up quickly and adapt to different roles as the situation demands.\n• Experienced in running operations following ITIL processes\n\nPlease note that only selected candidates will be contacted", "extensions": ["5 days ago", "Full–time"], "detected_extensions": {"posted_at": "5 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgTmV0d29yayBDb25zdWx0YW50IiwiY29tcGFueV9uYW1lIjoiQWQgQXN0cmEgQ29uc3VsdGFudHMiLCJjb21wYW55X21pZCI6Ii9nLzExYzczeDIycjYiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJkSk9DbFA3bUc4dlZyNW43QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdmNCQ3JjQlFVNVZYMDV4VTFaQlYyTkdXbWcxY21kTkxWbzFhMDl3YkVGRWFtaG5RVWx3WW1ScFdIaE5Za051YjJscVRqZFJYMWRLZUdKc1RTMUNTSFF6VW5wUk5sSk9hVU0yTUVWSk1HeHRaa1ZRTFdwUlRIaGxTelpWTFMxZlpIWTJORXhTUmpCblJtVnhMV05zVW5aWmFrOXZTemhXUVZOTlpIQlpNamQxZERoVWN6QkxiR1ExYlZjM1gwaExiMkp2Y1dGaFVucHdReTFuVjBNMVRtaHpTSE5uVWxZMFJITjNSRmRpTkZCcE9VWjRaREpDYUhGc1FXcFZFaGN6U0hGRFdVOVRZa3RqUTBkM1ltdFFlSEJsV1dsQmN4b2lRVTlOV1ZKM1FqaFNjRFJLTVRCUFRsVmlSV1pCUlVwYVYwaFJjMjF2TmpoMVp3IiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNTEiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGlua2VkSW4iLCJsaW5rIjoiaHR0cHM6Ly9zZy5saW5rZWRpbi5jb20vam9icy92aWV3L3Nlbmlvci1uZXR3b3JrLWNvbnN1bHRhbnQtYXQtYWQtYXN0cmEtY29uc3VsdGFudHMtMjQ4OTg3NDc3Mz9yZWZJZD00NjFlMDdjYi1iNzBiLTRjNzYtYWVjZS0yOGI2MWQ3MjNkMTBcdTAwMjZ0cmFja2luZ0lkPXZqNUdSQ1JZN1AwbGlIYVdMUnlwOXclM0QlM0RcdTAwMjZwb3NpdGlvbj0yXHUwMDI2cGFnZU51bT0wXHUwMDI2dHJrPXB1YmxpY19qb2JzX2pvYi1yZXN1bHQtY2FyZF9yZXN1bHQtY2FyZF9mdWxsLWNsaWNrXHUwMDI2dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "#sgunitedjobs It Security Consultant", "company_name": "GREEN LIGHT PROFESSIONAL SERVICES (SINGAPORE) PTE. LTD.", "location": "Singapore (+1 other)", "via": "via MNC Jobs Singapore | MNC Jobs In Singapore", "description": "Green Light is seeking IT Security Consultants that have experience in owning entire System Security Plans.\n\nThe IT Security Consultant reviews the proposed security design and implementation methodology covering the activities in the System lifecycle. All aspects including, but not limited to, network, data, applications, mobile applications, etc\n• System Security Plan;\n• Implementation methodology\n• System security design and definition of security controls;\n• Testing and verification of security controls and configuration;\n• Security code-review of custom applications (e.g., buffer overflows, code injection, etc.);\n• Risk Assessment; and\n• Vulnerability assessment and penetration testing.\n• Network Access Control (NAC)\n• Web Application Firewall (WAF)\n• DoS protection appliance solution\n• Identity Management System (IdMS)\n• Privileged Identity Management (PIM)\n• Single Sign-On (SSO) Service\n• Cryptography\n• Security Information and Event Monitoring (SIEM)\n• System Compliance... Management\n• Endpoint Protection\n• Mobile Device Management (MDM)\n• Disaster recovery planning (DRP)\n• Physical security\n\nMinimum accepted security certifications Certified Information Systems Security Professional (CISSP), Certified Information Systems Auditor (CISA) or equivalent).\n\nPlease apply via this portal", "extensions": ["7 days ago", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiIjc2d1bml0ZWRqb2JzIEl0IFNlY3VyaXR5IENvbnN1bHRhbnQiLCJjb21wYW55X25hbWUiOiJHUkVFTiBMSUdIVCBQUk9GRVNTSU9OQUwgU0VSVklDRVMgKFNJTkdBUE9SRSkgUFRFLiBMVEQuIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJwZVoyem1DU0Y2T2Q2Z2RZQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1OQyBKb2JzIFNpbmdhcG9yZSB8IE1OQyBKb2JzIEluIFNpbmdhcG9yZSIsImxpbmsiOiJodHRwczovL3NnLm1uY2pvYnouY29tL2pvYnMvc2d1bml0ZWRqb2JzLWl0LXNlY3VyaXR5LWNvbnN1bHRhbnQtc2luZ2Fwb3JlLTE1Mjg5MT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior Electrical Engineer (Healthcare Facility Project)", "company_name": "GMP TECHNOLOGIES (S) PTE LTD", "location": "Singapore", "via": "via JobsCentral", "description": "Responsibilities\n• Provide technical support and assistance to the Project team on the facility infrastructure and installed systems.\n• Attend and participate in relevant meetings (design planning, interface, technical clarification, as per planned schedule to provide technical inputs as needed)\n• Support and input to the consultants’ technical & design proposal to meet healthcare facility operation needs and minimising Electrical services disruption.\n• Coordinate internally for design and interface coordination through the various transition phases of the project.\n• Review and input to proposed work plans and schedules to achieve control, compatibility and coordinated objective to avoid and minimise operation disruptions.\n• Assist in the management of the appointed maintenance agent and specialist system vendors in their maintenance scope and planned program including breakdown investigations, inspections and audit.\n\nRequirements\n• Minimum Degree in Engineering... (Electrical/Power/Technology or related discipline)\n• Minimum 8 years of experience in either Electrical projects for facilities or in-house Electrical Engineer role.\n• Possesses good writing and presentation skills.\n• Positive work attitude and ability to work with all levels of staffs.\n• Experience in Electrical installation works will be an advantage.\n• Possesses BCA Green Mark certification and/or related experiences will be advantageous.\n\nWe regret that only shortlisted candidates will be notified.\n\nTo apply, please click \"Apply Now\" or visit www.gmprecruit.com and search for job reference:18101\n\nGMP Technologies (S) Pte Ltd | EA Licence: 11C3793 | EA Personnel: Lim Zi Cheng | Registration No: R2089949", "extensions": ["7 days ago", "$5K–$7.2K a month", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time", "salary": "$5K–$7.2K a month"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgRWxlY3RyaWNhbCBFbmdpbmVlciAoSGVhbHRoY2FyZSBGYWNpbGl0eSBQcm9qZWN0KSIsImNvbXBhbnlfbmFtZSI6IkdNUCBURUNITk9MT0dJRVMgKFMpIFBURSBMVEQiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImowQW52c1lxOTlsOV9TblBBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9ic0NlbnRyYWwiLCJsaW5rIjoiaHR0cHM6Ly9qb2JzY2VudHJhbC5jb20uc2cvam9iL3Nlbmlvci1lbGVjdHJpY2FsLWVuZ2luZWVyLWhlYWx0aGNhcmUtZmFjaWxpdHktcHJvamVjdC1qM3E1dmg2eXY2NjVwanQ4NHk4P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Solution Consultant", "company_name": "TraceLink, Inc.", "location": "Singapore", "via": "via Glassdoor", "description": "Â:TraceLink is seeking a full-time, experienced “Solution Consultant” to join our team. TraceLink has built the world's largest cloud-based network dedicated to protecting patients, ensuring compliance and growing profits across global life sciences. The TraceLink Life Sciences Cloud is our network, platform and community that links people, processes and information everywhere from ingredient to patient.\nBusinesses across the globe, including 16 of the top-20 pharmaceutical companies, trust us to help them manufacture and deliver safe, secure medicines to the patients who need them anywhere in the world. We need game changers ready to break down business barriers, master new technologies and become trusted advisors for some of the largest and fasting growing companies on the planet.\n\nThe Opportunity:\n\nThe Solution Consultant plays a critical role in mapping TraceLink’s solutions to our customer’s requirements and creating the business case for TraceLink’s solutions with our customers... This position is a highly visible within the organization and you will routinely interact with TraceLink Senior Management, Sales, Product Management, Engineering and Services organizations as well as with our prospects’ senior leadership.\nÂ:Responsibilities:\n• Act as subject matter experts as it relates to TraceLink solutions\n• Prepare sales presentations and product demonstrations for both technical, business and executive management audiences\n• Prepare materials and lead Solution Workshops as part of the sales process\n• Lead supply chain business process discovery sessions\n• Develop Solution Maps and Blueprints as part of the TraceLink sales process\n• Quantitatively model the benefits of TraceLink’s solutions\n• Understand and deliver the value proposition of TraceLink’s solutions\n• Respond to Customer Request for Proposals and Information (RFP/RFI)\nÂ:Qualifications:\n• 5+ years’ of experience in related discipline (pre-sales consulting for Enterprise software, or Life Sciences supply chain position)\n• Strong presentation and written communication skills to all levels\n• Experience with supply chain business processes, such as contract manufacturing, third party logistics providers, and distribution operations.\n• Experience with ERP and supply chain solutions such as SAP/ERP, SAP/WM, SAP OCR/All, WMS, Oracle/JD Edwards, JDA a plus\n• Experience with systems integration technologies for data exchange\n• Strong aptitude for explaining and applying advance technologies\n• APICS CPIM, CSCP certification a plus\n• Travel 30%-50", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2x1dGlvbiBDb25zdWx0YW50IiwiY29tcGFueV9uYW1lIjoiVHJhY2VMaW5rLCBJbmMuIiwiY29tcGFueV9taWQiOiIvZy8xMWM3M2c5M3F0IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiM0FfOWNhd21BUFI5UVYzUUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZjQkNyY0JRVTVWWDA1eFUwNVphRmx2ZFhsbmNHbzJWbE5aUTJocmMyRTRSV3hwVUZFeWQyeHhVMDlwZDFkUWMyNDRVWGM0Y0d4MlUzUlFiSEE1Y2tSdmVGUXhTR2xMVFdocGMxTnVlVVpvVUV4Qk9XMWxWblpzTVhwS05sRnpiR0ptZFc1U05uQktPVzlUUzBad1JrdHRZVzVOVmpndFZWQnBkVWhMYVhwSGVGcFFkV0ZmU0hsbFpscHBSRWRzVWpJeE16QlFiV3c0ZEd3elYxTmxOV1p6T1VWR1psSkxha3RHUVZFd2QxOHpRV1pVVm01aGNGaHRkR1YzRWhjelNIRkRXVTlUWWt0alEwZDNZbXRRZUhCbFdXbEJjeG9pUVU5TldWSjNRMDExTUc5d1duRmhZbUpRUkU1Q1pESkxWR3RFVnpBeFFYbFlRUSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzY5IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEdsYXNzZG9vciIsImxpbmsiOiJodHRwczovL3d3dy5nbGFzc2Rvb3Iuc2cvam9iLWxpc3Rpbmcvc29sdXRpb24tY29uc3VsdGFudC10cmFjZWxpbmstaW5jLUpWX0lDMzIzNTkyMV9LTzAsMTlfS0UyMCwzMy5odG0/amw9NDA2NjYyOTg2MFx1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Business Operations", "value": "GC06"}, {"text": "Human Resources", "value": "GC15"}, {"text": "Sales and Retail", "value": "GC26"}, {"text": "Accounting and Finance", "value": "GC01"}, {"text": "Protective Services", "value": "GC23"}, {"text": "Science and Engineering", "value": "GC27"}, {"text": "Management", "value": "GC18"}, {"text": "Advertising and Marketing", "value": "GC03"}, {"text": "Legal", "value": "GC17"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Social Services and Non-Profit", "value": "GC28"}, {"text": "Art, Fashion and Design", "value": "GC05"}, {"text": "Healthcare", "value": "GC14"}, {"text": "Energy and Mining", "value": "GC21"}, {"text": "Sports Fitness and Recreation", "value": "GC29"}, {"text": "Customer Service", "value": "GC10"}, {"text": "Education", "value": "GC11"}, {"text": "Media, Communications and Writing", "value": "GC20"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "Consultant", "value": "consultant"}, {"text": "Senior consultant", "value": "senior consultant"}, {"text": "Security consultant", "value": "security consultant"}, {"text": "Lead consultant", "value": "lead consultant"}, {"text": "Recruitment consultant", "value": "recruitment consultant"}, {"text": "Associate consultant", "value": "associate consultant"}, {"text": "Principal consultant", "value": "principal consultant"}, {"text": "Technical consultant", "value": "technical consultant"}, {"text": "Financial consultant", "value": "financial consultant"}, {"text": "Functional consultant", "value": "functional consultant"}, {"text": "Application consultant", "value": "application consultant"}, {"text": "Devops consultant", "value": "devops consultant"}, {"text": "Pre-sales consultant", "value": "pre-sales consultant"}, {"text": "Presales consultant", "value": "presales consultant"}, {"text": "Sales consultant", "value": "sales consultant"}, {"text": "Solutions consultant", "value": "solutions consultant"}, {"text": "Associate", "value": "associate"}, {"text": "Business", "value": "business"}, {"text": "Consultants", "value": "consultants"}, {"text": "Development consultant", "value": "development consultant"}, {"text": "Hr consultant", "value": "hr consultant"}, {"text": "It consultant", "value": "it consultant"}, {"text": "Manager", "value": "manager"}, {"text": "Services consultant", "value": "services consultant"}, {"text": "Cloud consultant", "value": "cloud consultant"}, {"text": "Consulting", "value": "consulting"}, {"text": "Director", "value": "director"}, {"text": "Education consultant", "value": "education consultant"}, {"text": "Engineer", "value": "engineer"}, {"text": "Hcm consultant", "value": "hcm consultant"}, {"text": "Infrastructure", "value": "infrastructure"}, {"text": "Investment consultant", "value": "investment consultant"}, {"text": "Project manager", "value": "project manager"}, {"text": "Recruitment consultants", "value": "recruitment consultants"}, {"text": "Sap consultant", "value": "sap consultant"}, {"text": "Senior", "value": "senior"}, {"text": "Solution consultant", "value": "solution consultant"}, {"text": "Specialist", "value": "specialist"}, {"text": "Systems consultant", "value": "systems consultant"}, {"text": "Systems engineer", "value": "systems engineer"}, {"text": "Technology consulting", "value": "technology consulting"}, {"text": "Academy", "value": "academy"}, {"text": "Accountant", "value": "accountant"}, {"text": "Architect", "value": "architect"}, {"text": "Business analyst", "value": "business analyst"}, {"text": "Business consulting", "value": "business consulting"}, {"text": "Consultancy", "value": "consultancy"}, {"text": "Consulting engineer", "value": "consulting engineer"}, {"text": "Data engineer", "value": "data engineer"}, {"text": "Electrical engineer", "value": "electrical engineer"}, {"text": "Employee", "value": "employee"}, {"text": "Finance consultant", "value": "finance consultant"}, {"text": "Gastroenterologist", "value": "gastroenterologist"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Internship", "value": "INTERN"}, {"text": "Part-time", "value": "PARTTIME"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Accounting", "value": "/business/naics2007/5412"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Engineering Services", "value": "/business/naics2007/5413"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Real Estate", "value": "/business/naics2007/53"}, {"text": "Retail", "value": "/business/naics2007/44"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "SingTel", "value": "/m/020zfl"}, {"text": "EY", "value": "/m/0g9jc"}, {"text": "Deloitte SEA", "value": "/g/11f_g4x9d_"}, {"text": "Infosys", "value": "/m/01k8x6"}, {"text": "SearchAsia Consulting Pte Ltd", "value": "/g/11fy260nhz"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "Geco Asia", "value": "/g/11gk72_bt_"}, {"text": "OAKTREE CONSULTING", "value": "/g/11g70jfhtq"}, {"text": "Central Provident Fund Board", "value": "/m/0615qb"}, {"text": "NCS", "value": "/m/0282746"}, {"text": "Trustwave", "value": "/m/0n3xjf5"}, {"text": "Avanade", "value": "/m/094456"}, {"text": "LINKBYNET", "value": "/g/11f00s44gb"}, {"text": "Mott MacDonald", "value": "/m/043l4j"}, {"text": "NTT", "value": "/m/05mybp8"}, {"text": "Randstad", "value": "/m/08pt1z"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "UBS", "value": "/m/031rxp"}, {"text": "Xcellink Pte Ltd", "value": "/g/11c73prcqy"}, {"text": "Alight", "value": "/g/11fj9r012s"}, {"text": "CBRE", "value": "/m/090r7m"}, {"text": "Ensign InfoSecurity", "value": "/g/11g4jhymjr"}, {"text": "FireEye", "value": "/m/05b_8h7"}, {"text": "Golder", "value": "/m/02qx9bq"}, {"text": "HCL SINGAPORE PTE. LTD.", "value": "/g/11fy25ngsv"}, {"text": "Hitachi Solutions", "value": "/g/121lyvj9"}, {"text": "Horangi", "value": "/g/11fm41wdh3"}, {"text": "IBM", "value": "/m/03sc8"}, {"text": "Management Development Institute of Singapore", "value": "/m/02qtp8x"}, {"text": "Marsh & McLennan", "value": "/m/053rw"}, {"text": "NTT Ltd.", "value": "/m/01c3fq"}, {"text": "Qualtrics", "value": "/m/080nnft"}, {"text": "Quinnox Solutions", "value": "/g/11g70dtdgg"}, {"text": "RECRUIT EXPRESS PTE LTD", "value": "/g/11g706hzhq"}, {"text": "Randstad Singapore", "value": "/g/11g70b50mr"}, {"text": "SAP", "value": "/m/01pf4l"}, {"text": "Techcom Solutions Pte Ltd", "value": "/g/11c73vztx3"}, {"text": "Timeo-Performance", "value": "/g/11c73zg8s5"}, {"text": "Turner & Townsend", "value": "/m/0cfy6xp"}]}]}