{"search_metadata": {"id": "60827abd2f542e40d8fc2f85", "status": "Success", "json_endpoint": "https://serpapi.com/searches/c7dcaa33902ef0c8/60827abd2f542e40d8fc2f85.json", "created_at": "2021-04-23 07:43:57 UTC", "processed_at": "2021-04-23 07:43:57 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28product+manager%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=140", "raw_html_file": "https://serpapi.com/searches/c7dcaa33902ef0c8/60827abd2f542e40d8fc2f85.html", "total_time_taken": 1.01}, "search_parameters": {"q": "(product manager) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "140"}, "jobs_results": [{"title": "Technical Product Manager", "company_name": "Argyll Scott", "location": "Singapore", "via": "via WhatJobs", "description": "Job description\n\nYou will be crafting and handling the execution of your product road map for your channel partners alongside with your peers in the product management teams and engineering team.\n\nRole:\n\nAct as Technical Product Owner, Product Manager or Technical Project Manager to understand the business value of engineering decisions and how they affect the life cycle of the product Translate technical requirements to user stories Communication of user stories with strong articulation skills Look after feature testing and validation Work with team that is cross functional and cross geographical locations Handle priorities between requests and technical needs Handle documentations, validation and testing of features build by the team\n\nRequirement:\n\nTechnical Product Owner, Product Manager of Technical Project Manager experience More than 10 years of relevant experience Agile methodology and (SCRUM) experience Proactive and excellent communicator across spoken, presenting and written... Strong analytical skills with excellent problem-solving abilities Strong planning and prioritisation skills working in cross functional and matrix management environment Strong technical (IT) understanding to be able to work with development teams for feature developments Certifications in Certified Scrum Product Owner (CSPO) or Professional Scrum Product Owner (PSPO) will be preferred but not mandatory\n\nArgyll Scott Interim Pte Ltd\nEA License No. 16S8140\nTan Yi Yun\nEA Reg No: R1103437", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJUZWNobmljYWwgUHJvZHVjdCBNYW5hZ2VyIiwiY29tcGFueV9uYW1lIjoiQXJneWxsIFNjb3R0IiwiY29tcGFueV9taWQiOiIvZy8xMWR4cGsyMzc0IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiRnZTV0RJUkx1czBTMTd5c0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFUyOWpTbWhpY3pOSFZuUndSVFF3ZFVKNlQxSk9ia3BGTjBSd05tbGxOazlEU25WdVRtTTFTbm8xU1hGblkwOWpWek0zZVhsT01IcEROa1ZyY3pKQmJXbzRYMmcxZVRaUWVubDBNV1ZNWVU1MFJHUnlNRFJOVW1scFVXeEJZM2hYUTA1b2JVODRZalkyYmtaTGNYVk9ZMll6WnpGUk9WWk5UMGRPVDJSRGVsZzRUMHh2WVdNd1VXNTJlUzFVWWpOaFdWTjJTRkJpVGpCNFdqSlJFaFoyV0hGRFdVczJhVXhPUjNWMFVXRnZja3RNVVVKUkdpSkJUMDFaVW5kQ1QxTmtVSG94TkVJMWRGaExjbE52VW5ScFZGTnhkamRoV0ZoMyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzciLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gV2hhdEpvYnMiLCJsaW5rIjoiaHR0cHM6Ly9lbi1zZy53aGF0am9icy5jb20vam9iLWZvci1UZWNobmljYWwtUHJvZHVjdC1NYW5hZ2VyLWluLVNpbmdhcG9yZS1jb29wMTc1ODE3OTQ/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Assistant Manager, Group Product Development and Management", "company_name": "Eu Yan Sang", "location": "Singapore", "via": "via LinkedIn", "description": "This role will be responsible for providing the Head of Group Product Development and Management the analytics, data and information necessary to drive the strategic objectives on category review. You will work collaboratively with stakeholders across all markets in developing and implementing group NPD strategies and standards to ensure EYS meets current profitability objectives and achieve sustainable product life cycle management.\n\nKEY ROLES AND RESPONSIBILITIES\n\nStrategic Development\n• Develop strategy and plans to drive growth within the region with a focus on category/ subcategory development based on actionable insights.\n• Recommend tailored category plans in line with overall market strategy.\n• Ensure needs for growth in focused categories are represented in NPD pipeline.\n• Champion the flow of group product pipeline and group product portfolio to different markets.\n• Partner the country Product, Manufacturing and Marketing departments to prioritize product pipeline, support... and lead cross-functional teams in the development, design & delivery of new products.\n• Recommend winning commercial propositions for the category/subcategory and effectively communicating these to BUs.\n\nProduct Lifecycle Management\n• Provide thought-leadership of the newest trends in health & wellness/ TCM that EYS can make use of and commercialise.\n• Manage product lifecycle from conceptualisation, pricing, time-integrated plans for product introduction to measuring ROI of product post-launch.\n• Incorporating consumer learning into brand strategy and providing insight regarding to brand opportunities. Drives a culture of consumer curiosity, insight generation and analytical thinking.\n\nMarket Intelligent and Insight\n• Active involvement in analysing key information about consumer, industry, stakeholders and competitive landscape to find white space for category expansion.\n• Leverage global Insights and other data sources to identify and size high growth category opportunities.\n• Analyse market data and distil implications into actionable insights.\n• Work with external insight expertise to lead research for focused category opportunities and provide guidance on consumer expected product experience for high growth opportunities.\n• Stay abreast of competitor activity within focused categories.\n\nOther Supporting Role\n• Collaborate with cross functional teams and BUs to continuously improve best practice innovation.\n• Support the efficient execution of commercial project and being equally comfortable with developing business cases to get the project up and running.\n• Supports Head, Group Product Development and Management, in preparation of reports and Board presentation\n\nEDUCATION\n• Minimum Degree in Food Science/ Nutrition/ Life Sciences or business background with relevant experience on consumer goods, like VDS, nutritional food and/or personal care product.\n\nSKILLS, KNOWLEDGE AND RELEVANT EXPERIENCE\n• 3 to 4 years of experience in innovation/ NPD launches/ brand/ category management role in a regional level, preferably with experience in consumer health industry (nutrition. OTC, health food industries etc).\n• Prior experience in project management or product life cycle management is preferred.\n• Scientific knowledge is essential and a keen ability to quickly learn and understand key TCM principles and terminology is preferred.\n• A natural leader that understands how to influence decisions and drive toward resolution, regardless of their role\n• An analytic problem solver that enjoys generating ideas, but is equally committed to seeing them through, designing and implementing plans that transform those ideas into tangible results.\n• Recognizes stakeholders needs and will change course when the situation requires it; thrives in independent environments and has unwavering tenacity.\n• Proactive team player with a high degree of flexibility and adaptability in a dynamic environment", "extensions": ["9 days ago", "Full–time"], "detected_extensions": {"posted_at": "9 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBc3Npc3RhbnQgTWFuYWdlciwgR3JvdXAgUHJvZHVjdCBEZXZlbG9wbWVudCBhbmQgTWFuYWdlbWVudCIsImNvbXBhbnlfbmFtZSI6IkV1IFlhbiBTYW5nIiwiY29tcGFueV9taWQiOiIvbS8wM2NsOWhuIiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiT2RQcHFrcGVpY0FhZTl6NUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFZFMXZkM1l5WkZwVVMyTkJXREkxWW5OUldGUnFjazVNYTBGeGFGWm9XRlZ2WlVodVFUbGpXVVJ4WVc5YVFqUmhNemRDZVRSRFdFWnVWVWxSZGs4eFVIUTNUbU5hTUZoRk9ISnpha0phY0VsVU0yVlFXSFJwYlMxaFZGbHVNbUZCUTFaQlEzWldjbnBSVVVjMmFXOHlZVEpNTkVWU1FqTlRjM2R5U0Vkbk5FNU5WV1p1WVVaQmRsaDFjM2hCYlRGU2JUTkJPR1pxUTJabWQwZG5FaFoyV0hGRFdVczJhVXhPUjNWMFVXRnZja3RNVVVKUkdpSkJUMDFaVW5kQlFqbG1kM1ZhWVhCUlYwRXhSV1p4VmxwUlgzWklkazFIWDJoQiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzE1IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExpbmtlZEluIiwibGluayI6Imh0dHBzOi8vc2cubGlua2VkaW4uY29tL2pvYnMvdmlldy9hc3Npc3RhbnQtbWFuYWdlci1ncm91cC1wcm9kdWN0LWRldmVsb3BtZW50LWFuZC1tYW5hZ2VtZW50LWF0LWV1LXlhbi1zYW5nLTI0NTI1NzA3MjY/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Production and Engineering Manager", "company_name": "Barry Callebaut", "location": "Singapore", "via": "via Jobs At Barry Callebaut", "description": "About the role\n• Provide management of plant improvement projects to meet GMP / Safety / Quality / Production as well as CAPEX costing and submission requirements.\n• Management of overall Production team/lines and Maintenance team operations covering Utilities, Facilities, Buildings & Grounds, Plant operating equipment, Contractors management, and Maintenance Cost budget expenditure control.\n\nKey responsibilities include\n• Production\n• Ensure a safe, healthy, and positive environment, lead by example in competitive, output, quality, and budget environment supporting relevant KPI and be accountable of site level.\n• Support equipment improvement teams for the short and long term, FMEA, machine knowledge leaders, safety, and quality with RCA (Root cause analysis)\n• Optimize resources and Lead a team of multi-skilled managers and focus on performance and improvements and aligns with functional departments.\n• Assure proper commissioning procedure for SLA during change or start-up.\n•... Guarantees maximum use of MAXIMO with knowledge, follow-up, work order flow in line with the process-driven organization.\n• Assure reliability in the stream by nominating or associating assets with roles or tasks.\n• Benchmarking of preventive maintenance to be the best in class and solid SLA with cost tracking, visibility, improvements, and correct allocation of resources.\n• Develop the skills and talents of the team through performance and development management. Install multi-functional teams and creates asset awareness on the floor.\n• Manage stakeholder relationships and execute regional and corporate projects including legal compliance and risk management.\n• Maintenance and Engineering\n• Main lead in coordinating with respective department managers for identifying improvement needs for plant operation requirements; thereafter preparation and submission of CAPEX Budget for management review.\n• Preliminary feasibility studies follow up with preparation and compilation of Capital Expenditure Cost Breakdown; Project descriptions and justifications; Quotations; for IP-CAPEX submission.\n• Management of plant and process upgrading projects. Coordinating with functional managers to address and meet Quality; Safety; Production and Maintainability requirements.\n• Plan & organized resources including subcontractor management for detailed project implementation; taking proactive steps to minimized disruption to Production and Operation activities.\n• Identify critical infrastructure; propose solutions and improvement works to provide redundancy and sustaining plant operations from unnecessary disruptions.\n• Lead Project / A&A works to ensure that it is completed within the given timeline and budget.\n• Manage CAPEX projects (start, push through, succeed, learn, cost, time, quality-wise) and set-up “service level agreements (SLA)” with maintenance and operations.\n• Direct the development and implementation of new technology and improved facilities and operational processes within the subsidiary of business following best market practice and according to corporate objectives, strategy and business needs, and best market practice. Achieve success by working together with local site members, corporate members, and contractors\n• Assure best practices implemented and recognized/shared\n• Follow, review, adjust the master plan\n• Encourage automation initiatives\n• Support the production department in achieving the quality target by ensuring all the key equipment and instruments are maintained. Maintain zero non-conformance for all the plant audit by keeping the maintenance schedule and records up-to-date.\n• Maintain a high motivation level of team members by providing an excellent working environment, training, upgrades, job rotation, and coaching leadership style.\n• Optimize spare parts control, utilization, and spending, common practice with group expectations. Implement site housekeeping on buildings, roads, clothes, cleaning, lift trucks, with stream leaders. Compliant with the electrical and mechanical local, group, and governmental legislation. Energy expert/officer for improvement and continuation (boiler steam, chillers, gas, electricity, water, air). Report and Benchmark with other sites and HQ.\n• Ensure sustainability of infrastructure safeguarding: maintenance program, projects.\n• Evaluate existing preventive maintenance plans and integrate them into the site plan.\n• Supports 100% MAXIMO system. Is back-up to safeguard continuity and use.\n• Assure proper spare parts system and controls the performance on all aspects.\n• Energy Management\n• Manage energy consumption related to Factory Cost and Savings.\n• To project, forecast, and prepare Energy Budget and KPI base on the projection of increased activities / new installation of equipment.\n• Monitoring of the overall consumption of Electricity, Gas, Water. Driving team members to share and present data to effectively identify abnormal energy consumption resulted from leakages or losses.\n• Identify Energy Control Measures (ECM) project and perform a detailed feasibility study targeting at reducing energy consumptions / effective usage of energy to achieve cost savings.\n• Liaise with Authorities (NEA) for any matters pertaining to compliance with the Energy Conservation Act.\n• Preventive Maintenance\n• Responsible for developing, driving an effective maintenance program to sustain plant operations.\n• Provide mentoring; coaching and challenge team members is on alternative and better ways of working to improve operational efficiencies.\n• Prepare, monitor, and control the maintenance budget expenditure; Approval of purchase requisition, categorization of cost center expenditure for spares and maintenance services.\n• Motivate and drive the maintenance team towards maximizing equipment performance and runtime; identifying gaps in the maintenance regime and fine-tune the areas for improvements.\n• Driving team members to identify critical spares and inventories; study critical service providers’ requirements to target minimal disruption to plant operations.\n• Monitoring of the preventive maintenance schedule progress; work with functional managers to synchronize maintenance service along with Production / Operations pre-plan stoppages to achieve minimum disruption to plant operations.\n• Main Lead in the Major shutdown for coordinating a detailed program and liaise with functional managers, contractors, authorities in the execution of the servicing work.\n• Quality / Safety\n• Implementation of effective quality and safety compliance system.\n• Cooperate with QA/EHS lead to implement and maintain the Quality / EHS requirements.\n• Participate in reviewing Product / Service complaints; root cause analysis and support improvement/modification work to address; eliminate and prevent a recurrence.\n• Participation in FSSC22000, customer, and local audit to fulfill and maintain quality standards and requirements.\n• Participate in HACCP / EHS team to discuss; update; improve and finally communicate any changes to the Quality / EHS system.\n• Maintaining and ensure CCP / audit documentation pertaining to the Maintenance regime have fully complied.\n• Follow up the complaints and implement the corrective actions.\n\nAbout you\n• Degree in Electrical/Mechanical Engineering\n• Minimum 10 years’ experience in the management of production routines (Machines and People), projects, maintenance of the building, facilities, utilities preferably in the manufacturing plant or food manufacturing industry\n• Singapore Certified Energy Manager (SCEM)\n• Proven track record of managing both Project and Engineering teams within the food manufacturing industry\n• Demonstrate an understanding of project management and engineering from a technical and operational point of view.\n• Ability to coach, lead and motivate the team\n• Experience in lean, TPM, six sigma, or similar Continuous Improvement environments.\n• Experience in Project-, Portfolio Management & Leadership.\n• Master all elements of change management, including requirements, structures, and implementation barriers at site organizational levels.\n• Passion for growth!! Someone that wants to grow in the career (Someone to be prepared for a Plant Manager position", "extensions": ["8 days ago", "Full–time"], "detected_extensions": {"posted_at": "8 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9kdWN0aW9uIGFuZCBFbmdpbmVlcmluZyBNYW5hZ2VyIiwiY29tcGFueV9uYW1lIjoiQmFycnkgQ2FsbGViYXV0IiwiY29tcGFueV9taWQiOiIvbS8wM2Nsa3kyIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiMWlrU1k4WHRhZk00ZnNqNkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZZQkNyY0JRVTVWWDA1eFZFOUlXVlJmYjJKSGRFTlhVRVZuVnpsRVdIUXllVEI0Vm0xUlRsOWlNbVJOYmtoUE9XRlhTMHBIZUdwb1MwSmxhMTg1Y0U0elowaGxkM1U0ZWt0MlNTMXFXRVZzY0hwR1pYVkNkMWh2WDJaRVREQTNYMGRNVTJZMFEyRjNNMXBCUlZWVlNVaHhRVkowWTA0MU1VWXRlRkpmU0daME4ySXllbGsyYjNkamFuTkZRemxmYjFGVFMwODBVRFJzU2tKc2RITnRaelJ1WW1Wa2RuY3hiakZvWmtFMllrNU5lRzlrYlMwM1owZFdWRk5KRWhaMldIRkRXVXMyYVV4T1IzVjBVV0Z2Y2t0TVVVSlJHaUpCVDAxWlVuZERURzVPVW5vMFJXNUVjekZQYmxNM1lVd3lVM1I2WDFKbVJWSm4iLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18yMyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIEF0IEJhcnJ5IENhbGxlYmF1dCIsImxpbmsiOiJodHRwczovL2pvYnMuYmFycnktY2FsbGViYXV0LmNvbS9qb2IvU2luZ2Fwb3JlLVByb2R1Y3Rpb24tYW5kLUVuZ2luZWVyaW5nLU1hbmFnZXItMDEtNzU4MDkxLzcwNjEzMzUwMC8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "First Line Manufacturing Manager (Food/Nutrition)", "company_name": "Recruit Express", "location": "Singapore (+1 other)", "via": "via Glassdoor", "description": "First Line Manufacturing Manager (Food/Nutrition) #HML\nDescription\n• Responsible to implement safety and environment practices in the workplace\n• Constantly monitor the products packed are within quality norms\n• Support market needs by producing the required quantity and type of product according to the agreed production programme\n• Constant monitoring of usages of materials, water, energy and manpower\n• Increases productivity through optimum organization of labor, improves and rationalizes work method, minimize plant downtimes\n• Establishes and updates manufacturing instructions to ensure correct operation procedures are used by operators\n• Ensure staffs are well trained and motivated with high standard of discipline and morale\n• Ensures all industrial safety or health precautions in plant are maintained and additional necessary safety measures are installed and implemented to achieve zero accident rates\n\nRequirements:\n• Min Diploma or Degree in Food Science, Applied Science, Food... Technology, Biochemistry or Chemical Process Technology\n• At least 2 years of relevant experience with good attitude to work and ability to interact with people\n• Green Belt (DMAIC) certification will preferred\n• Demonstration of leadership ability by leading a project within a factory environment\n• Demonstration of Leadership skills in positively confronting inappropriate behavior and using everyday coaching to ensure involvement of the workforce\n\nFor interested applicants, please send in a copy of your most recent and updated resume to michelle.lee@recruitexpress.com.sg\n\nSubject heading: Manufacturing mgr\n\nMichelle Lee Ser Min\nRecruit Express Pte Ltd\n(R1440070)\nEA Licence No. 99C4599\n\nIndustry\n\nHealthcare / Pharmaceutical / Life Science / Medical Device\n\nSpecialization\n\nEngineering\nHealthcare - Nurse / Allied Healthcare\nHealthcare - Pharmaceutical / Life Science / Medical Device / Clinical Research / Regulatory Affairs\n\nLocation\n\nWest\n\nEmployment Type\n\nPermanent\n\nSalary\n\nNegotiable\n\nIf you meet the requirements of this role, please email a detailed resume in Word document to Michelle Lee Ser Min.\nCEI Registration No.: R1440070\nEmail: michelle.lee@recruitexpress.com.sg\nTel: 67363280\n• All information will be treated with strictest confidence. We regret that only short-listed applicants will be notified", "extensions": ["12 days ago", "Full–time"], "detected_extensions": {"posted_at": "12 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJGaXJzdCBMaW5lIE1hbnVmYWN0dXJpbmcgTWFuYWdlciAoRm9vZC9OdXRyaXRpb24pIiwiY29tcGFueV9uYW1lIjoiUmVjcnVpdCBFeHByZXNzIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiItSngzYXNWOGM1VTJGdGdvQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEdsYXNzZG9vciIsImxpbmsiOiJodHRwczovL3d3dy5nbGFzc2Rvb3Iuc2cvam9iLWxpc3RpbmcvZmlyc3QtbGluZS1tYW51ZmFjdHVyaW5nLW1hbmFnZXItZm9vZC1udXRyaXRpb24tcmVjcnVpdC1leHByZXNzLUpWX0lDMzIzNTkyMV9LTzAsNDdfS0U0OCw2My5odG0/amw9NDA1ODUwNzYzM1x1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Live user product manager", "company_name": "TikTok", "location": "Singapore", "via": "via Bayt.com", "description": "1. Combining the local conditions and community ecology in each country, and algorithm cooperation to build a model for the distribution of live content in various countries to achieve the highest distribution efficiency\n2. Develop content discovery, growth, and distribution strategies for vertical live content based on the country’s development goals and content ecology\n3. Cooperate with relevant local teams to promote the rapid growth of live;\n4. Produce high-quality demand and promote the implementation of the plan, coordinate resources from all parties, promote close cooperation with other relevant departments, and promote the coordinated development of live\n1. Have more than 3 years of working experience in live and content Internet products.\n2. In-depth research on mainstream live and content products at home and abroad, and in-depth understanding and thinking about social community products is preferred;\n3. Fluent in English communication and can be used as a working language... overseas study background is preferred;\n4. Possess excellent product thinking and solution capabilities, clear logic and strong data analysis capabilities;\n5. Have ownership and be responsible for the results; have good cross-cultural understanding, strong communication skills, teamwork spirit, and able to withstand greater work pressure", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJMaXZlIHVzZXIgcHJvZHVjdCBtYW5hZ2VyIiwiY29tcGFueV9uYW1lIjoiVGlrVG9rIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJaT2puVk04LTV6X214N05mQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJheXQuY29tIiwibGluayI6Imh0dHBzOi8vd3d3LmJheXQuY29tL2VuL3NpbmdhcG9yZS9qb2JzL2xpdmUtdXNlci1wcm9kdWN0LW1hbmFnZXItNTkxMzMzMjMvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "First VP / VP , Product Manager - Deposits & Wealth Management (Funds), Personal Financial Services", "company_name": "United Overseas Bank", "location": "Singapore", "via": "via Laimoon.com", "description": "Posting Date: 14-Apr-2021\n\nLocation: SG\n\nCompany: United Overseas Bank Limited\n\nAbout UOB\nUnited Overseas Bank Limited (UOB) is a leading bank in Asia with a global network of more than 500 branches and offices in 19 countries and territories in Asia Pacific, Europe and North America. In Asia, we operate through our head office in Singapore and banking subsidiaries in China, Indonesia, Malaysia and Thailand, as well as branches and offices.\nOur history spans more than 80 years. Over this time, we have been guided by our values - Honorable, Enterprising, United and Committed. This means we always strive to do what is right, build for the future, work as one team and pursue long-term success. It is how we work, consistently, be it towards the company, our colleagues or our customers.\n\nAbout the Department\nThe Retail function provides Personal and Business Banking customers with financial solutions tailored to their needs. We help them manage their money wisely and meet their financial... goals through an extensive range of products and services. These include deposit, insurance, secured and unsecured loans, investment and wealth advisory services.\n\nPersonal Financial Services\nWe design and provide products and services that empower our customers to enjoy greater banking convenience while they extract more value from their money. In particular, we are focused on promoting and developing healthy saving and investment practices across generations.\n\nJob Responsibilities\nThe role is responsible for managing different aspects of the mutual funds business that impact the product's profitability. These include development and implementation of strategic business initiatives, product development and due diligence, marketing, training and sales support.\n\nKey responsibilities include:\n\n1. Sales enablement\n• Drive new business initiatives for unit trust to boost topline\n• Develop professional quality resources to empower platform and enhance overall customer experience\n• Redesign customer engagement journey for both platform and online sales\n• Collaborate with stakeholders (S&D, Marketing, Segment, Training) to provide solutions to customer segment needs\n\n2. Product Management & Product Risk Governance\n• Identify product ideas/gaps and work with product providers to avail suitable solutions and position investment themes\n• Establish process to ensure proper product risk guidance is provided to customers\n• Conduct regular and adequate company and fund due diligence\n• Monitor, evaluate and understand fund performance, asset class risks, concentration risks etc\n• Work closely with product providers for product and marketing support\n\n3. Project Management and Product Support\n• Own and lead projects with minimal supervision, including logical project planning to ensure deliverables meet objectives\n• Provide timely and accurate data reporting\n• Plan and provide product training to support sales teams and new hires\n• Ad hoc requirements from other areas in product support\n\n4. Branch Network Support\n• Ensure fund launches & campaign promotions are executed on time\n• Conduct product training\n• Ensure Ops/systems readiness prior to fund launch or changes\n• Provide timely assistance to branch queries\n• Provide timely updates to platform on any funds updates\n\nJob Requirements\n• Degree in Accountancy/Finance related discipline is preferred.\n• Deep knowledge and understanding of mutual funds business particularly key business drivers.\n• Sound understanding of business guidelines, operational and regulatory requirements and issues.\n• Strong understanding of consumer behavior and digital marketing drivers.\n• Strong people and stakeholder management skills.\n• Ability to write and articulate well.\n• Proficient in MS Office particularly Powerpoint and Excel.\n\nBe a part of UOB Family\nUOB is an equal opportunity employer. UOB does not discriminate on the basis of a candidate's age, race, gender, color, religion, sexual orientation, physical or mental disability, or other non-merit factors. All employment decisions at UOB are based on business needs, job requirements and qualifications. If you require any assistance or accommodations to be made for the recruitment process, please inform us when you submit your online application.\n\nApply now and make a difference.\n\nretail banking", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJGaXJzdCBWUCAvIFZQICwgUHJvZHVjdCBNYW5hZ2VyIC0gRGVwb3NpdHMgXHUwMDI2IFdlYWx0aCBNYW5hZ2VtZW50IChGdW5kcyksIFBlcnNvbmFsIEZpbmFuY2lhbCBTZXJ2aWNlcyIsImNvbXBhbnlfbmFtZSI6IlVuaXRlZCBPdmVyc2VhcyBCYW5rIiwiY29tcGFueV9taWQiOiIvbS8wNGdqZDEiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJmTUdSbDhlM1FFRWIyMHpEQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdllCQ3JjQlFVNVZYMDV4VVY5d00wSXRZbUo1Y3pObllVZHdhMTlEVDBaMFEybGthelpmYmxoTWFtdE9iVE5FYVZWWWIwSnVTa1ptZHpkTVFXaDJiVGxmV1dvM1lrWTNMV3BVYURCTlprdHBXR00yTlhKWWRYRjNUMHB4YUZnM2FqbDZjRlppVGxNemRXRTBVRGxxTW5OSWMwUkdiVUp6T0ZSaVdrdDVUbk5uTms1ek5XTkRNbnB0WTI1Zk4xaDBObTFDU3pnemQxZDJVR014YlZFMFkwUjRObkZNV0cxRVdUZHpWekkxWldzM2QyRTBja2t5WTFVdGVXcHZFaFoyV0hGRFdVczJhVXhPUjNWMFVXRnZja3RNVVVKUkdpSkJUMDFaVW5kQ1NFWkRWbEl3WjNSNWVuY3RRWFptUzBGa1dEUjNjVUpRTFc5MyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzQxIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExhaW1vb24uY29tIiwibGluayI6Imh0dHBzOi8vam9icy5sYWltb29uLmNvbS9qb2JzL2V4dGVybmFsdmlldy8yNTk4NTc5Nz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Technical Product Manager Intern(6month full time)", "company_name": "PayPal", "location": "Singapore", "via": "via Jobs", "description": "Who we are: Fueled by a fundamental belief that having access to financial services creates opportunity, PayPal (NASDAQ: PYPL) is committed to democratizing financial services and empowering people and businesses to join and thrive in the global economy. Our open digital payments platform gives PayPal’s 375 million active account holders the confidence to connect and transact in new and powerful ways, whether they are online, on a mobile device, in an app, or in person. Through a combination of technological innovation and strategic partnerships, PayPal creates better ways to manage and move money, and offers choice and flexibility when sending payments, paying or getting paid. Available in more than 200 markets around the world, the PayPal platform, including Braintree, Venmo and Xoom enables consumers and merchants to receive money in more than 100 currencies, withdraw funds in 56 currencies and hold balances in their PayPal accounts in 25 currencies.Job Description Summary: We are... looking for a driven, enthusiastic Product Management who can work with Compliance Platforms product team on challenging assignments. The assignments may involve one/more of the following:Job Description:\nDeep diving into industry trends\nAnalyzing end customer problems through data analysis, investigations and first hand studies\nCreating solutions to end customer problems detailing out workflows, user experience and system interactions\nContributing to business cases through analysis of options, point of view creation\nWorking with product engineering teams on potential new features or prototypesDesirable background may include prior exposure like\nExperience with new ventures e.g. business or tech roles with startups, new initiatives within large orgs, business consulting/analyst role in greenfield projects, entrepreneurial experience will be a plus.\nKnowledge or familiarity with FinTech or RegTech industry, companies or trends\nData analysis\nUser experience research or User experience designRequired Skills\nSoftware Development background\nBasic data analysis using excel\nGood communication and presentation skillsWe're a purpose-driven company whose beliefs are the foundation for how we conduct business every day. We hold ourselves to our One Team Behaviors which demand that we hold the highest ethical standards, to empower an open and diverse workplace, and strive to treat everyone who is touched by our business with dignity and respect. Our employees challenge the status quo, ask questions, and find solutions. We want to break down barriers to financial empowerment. Join us as we change the way the world defines financial freedom.PayPal provides equal employment opportunity (EEO) to all persons regardless of age, color, national origin, citizenship status, physical or mental disability, race, religion, creed, gender, sex, pregnancy, sexual orientation, gender identity and/or expression, genetic information, marital status, status with regard to public assistance, veteran status, or any other characteristic protected by federal, state or local law. In addition, PayPal will provide reasonable accommodations for qualified individuals with disabilities", "extensions": ["28 days ago", "$5K a month", "Full–time"], "detected_extensions": {"posted_at": "28 days ago", "schedule_type": "Full–time", "salary": "$5K a month"}, "job_id": "eyJqb2JfdGl0bGUiOiJUZWNobmljYWwgUHJvZHVjdCBNYW5hZ2VyIEludGVybig2bW9udGggZnVsbCB0aW1lKSIsImNvbXBhbnlfbmFtZSI6IlBheVBhbCIsImNvbXBhbnlfbWlkIjoiL2cvMTIyczkxXzUiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJSNHhRbGp6YXIwLUhKT2RxQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFc3NCQ293QlFVNVZYMDV4VTBSaGRYVXRabGs0U2tkVU5rTnBWemxqTUdkWVkxVkdPRzkyWlRkTGFrSnJUVlpxTWpadFFVTnZNVFJqVmxOcE5rUnJPVVZ3U1cwM2Jtb3RhVmhFVEhGVE5IUmxOMDVWV1ZWaFMydzJkRlJPYTB4NlUzVk5ZMHByVGt0UVVURjZUVlZ3WVZJelFuSXhNMnhvV0VneFpDMDRTR04yY0VOWU9YWmxkVGRuTUhCelZGSmtjbFlTRm5aWWNVTlpTelpwVEU1SGRYUlJZVzl5UzB4UlFsRWFJa0ZQVFZsU2QwTTRURUZUYUZoa1pVWlhhRWRoWTBndE16WmxXVzlNVG10VllVRSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzQ5IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnMiLCJsaW5rIjoiaHR0cHM6Ly9zZy5maWRhbnRvLmNvbS9qb2JzL2pvYi1vcGVuaW5nL21hbmFnZXJzLWFsbC1vdGhlci90ZWNobmljYWwtcHJvZHVjdC1tYW5hZ2VyLWludGVybjZtb250aC1mdWxsLXRpbWUtMjYwNTA4NjAxP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Digital Product Manager, Manulife Bank", "company_name": "The Manufacturers Life Insurance Co (Phils) Inc( Manulife Philippines )", "location": "Singapore", "via": "via LinkedIn", "description": "Are you looking for unlimited opportunities to develop and succeed? With work that challenges and makes a difference, within a flexible and supportive environment, we can help our customers achieve their dreams and aspirations.\n\nJob Description\n\nThe Manulife Bank Digital Engagement team is seeking a highly motivated Digital Product Manager. The Digital Product Manager leads our digital strategy and offerings for our public websites, manulifebank.ca & banquemanuvie.ca, from the ideation phase to the deployment and ongoing management.\nWorking in a fast-paced environment, where every day brings new opportunities and challenges, the digital product owner is invited to bring forth innovative ideas to improve the manulifebank.ca digital experience, helping our customers to reach their dreams and aspirations.\nAs part of the Product Management team, the Digital Product Manager deeply understands our customers and partners, and acts as the bridge between teams. The collaborative nature of this... role brings together internal players from Strategy, Research, User Experience, Analytics, Product, Marketing, Sales, IT, Compliance and Finance (to name a few).\nThe Product Manager's responsibilities include, but are not limited to:\nIdeation -- Generate ideas and identify opportunities to enhance the website experience, increase lead generation and conversions; Develop business cases in conjunction with internal business stakeholders\nDevelopment -- Use an human centered design (HCD) approach to product development as you work closely with Analysts and Technology teams;\nOngoing site management – Lead the squad in maintaining site performance against the Bank digital KPIs, maintain market relevance, own and update product roadmaps, produce, review and share product dashboards and reports, lead search engine optimization efforts.\nAct as the Product Owner on an Agile squad, establishing the vision, setting the direction, gathering requirements, managing competing priorities, and launching new digital services\n\nDesired Qualifications\n\n5-7 years of relevant work experience\nPost-secondary education preferably related to Digital Technology, Business or Digital Marketing\nDigital marketing experience (SEO, Multivariate testing, campaign management, web analytics etc)\nExperience with Adobe Experience Manager, Adobe Target & Adobe Analytics\nKeen eye for design\nKnowledge of UX best practices\nDetailed knowledge of customer's needs in the financial services vertical\nKnowledge of mortgages and loans and their origination and servicing\nProven track record of delivering digital projects, working within innovative environments and leading execution across functional teams and business units\nHighly effective communicator who can clearly articulate business needs between technical and non-technical resources as well as present strategy and vision to senior management\nStrong relationship development and management skills\nExperience as a Product Owner on an Agile team\n\nNice To Have\n\nSalesforce experience\nExperience implementing Accessibility for Ontarians with Disabilities Act (AODA) Experience in delivering banking calculators (mortgage, savings etc.)\nCertified Agile Product Owner (Ex. CSPO or any similar certification)\nIf you are ready to unleash your potential, it's time to start your career with Manulife/John Hancock.\n\nAbout Manulife\n\nManulife Financial Corporation is a leading international financial services group that helps people make their decisions easier and lives better. With our global headquarters in Toronto, Canada, we operate as Manulife across our offices in Canada, Asia, and Europe, and primarily as John Hancock in the United States. We provide financial advice, insurance, and wealth and asset management solutions for individuals, groups and institutions. At the end of 2019, we had more than 35,000 employees, over 98,000 agents, and thousands of distribution partners, serving almost 30 million customers. As of September 30, 2020, we had $1.3 trillion (US$943 billion) in assets under management and administration, and in the previous 12 months we made $31.2 billion in payments to our customers. Our principal operations are in Asia, Canada and the United States where we have served customers for more than 155 years. We trade as 'MFC' on the Toronto, New York, and the Philippine stock exchanges and under '945' in Hong Kong.\nManulife is an Equal Opportunity Employer\nAt Manulife /John Hancock , we embrace our diversity. We strive to attract, develop and retain a workforce that is as diverse as the customers we serve and to foster an inclusive work environment that embraces the strength of cultures and individuals. We are committed to fair recruitment, retention, advancement and compensation, and we administer all of our practices and programs without discrimination on the basis of race, ancestry, place of origin, colour , ethnic origin, citizenship, religion or religious beliefs, creed, sex (including pregnancy and pregnancy-related conditions), sexual orientation, genetic characteristics, veteran status, gender identity, gender expression, age, marital status, family status, disability, or any other ground protected by applicable law.\nIt is our priority to remove barriers to provide equal access to employment. A Human Resources representative will work with applicants who request a reasonable accommodation during the application process . All information shared during the accommodation request process will be stored and used in a manner that is consistent with applicable laws and Manulife/John Hancock policies . To request a reasonable accommodation in the application process, contact recruitment@manulife.com (mailto:recruitment@manulife.com", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEaWdpdGFsIFByb2R1Y3QgTWFuYWdlciwgTWFudWxpZmUgQmFuayIsImNvbXBhbnlfbmFtZSI6IlRoZSBNYW51ZmFjdHVyZXJzIExpZmUgSW5zdXJhbmNlIENvIChQaGlscykgSW5jKCBNYW51bGlmZSBQaGlsaXBwaW5lcyApIiwiY29tcGFueV9taWQiOiIvbS8wYjZuMjBqIiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiVWtKTGxFUXVkTldZaXhUbEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRW9zRENzd0NRVTVWWDA1eFZEVmFVVTlzWmxsT0xYazJlVmxHUVVWNGJXdG1hM0JDZUdOZlZTMUJSME5tVWxsSlRpMXdYMDkzTVU1WFdXcEpUWGw0U2prelZFczRZazlOVjFVMmQxVldaVGR1Y3pkdU16WllWekYyVUVkcmVVRjJUWHBKU1V0Wk1FNW1lV0ZWU201Zk1VTlZaVFkwZWxGM1kyTklMVE0xT1dOMFRWTndNa3hwTm5SSWJWSTFZekJTUW5wU0xYTnlSMjl1V2tOcllUUkljakpCUlV4RWN5MUpaemxGWkhSd2JWWlRibk5DT1dKTVEyeHJlV2h4UzFoMGR6UlpTblpxWm10a2RGSlBhaTFwWDJORFFrVm5hVFpWT0dzek4xaG1ZMmRhTUhKRWJuQk1NMDV2YjNaUE5uRk1UMGRXV2xkRVpEZFVZVmxqZEVKaWNHbzFTV1JsT0ZsWlVqVkJibVZFYWxCVFVGSkhUMkpIVFhaek5ERkxlVXBUUTJKdk5HczFlbXRKYjFCSmIxZFFjRkZxWTNSeGFuVXpSVXB2VDBaWVRXTktNRVpLTkY4MlVHOXFhVTUyTlVKbU1Fd1NGblpZY1VOWlN6WnBURTVIZFhSUllXOXlTMHhSUWxFYUlrRlBUVmxTZDBGWlkxWXdUMk5pYkU5T2JFNVNXR3hoYms5U1lqY3pkakJuWkZFIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNTciLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGlua2VkSW4iLCJsaW5rIjoiaHR0cHM6Ly9zZy5saW5rZWRpbi5jb20vam9icy92aWV3L2RpZ2l0YWwtcHJvZHVjdC1tYW5hZ2VyLW1hbnVsaWZlLWJhbmstYXQtdGhlLW1hbnVmYWN0dXJlcnMtbGlmZS1pbnN1cmFuY2UtY28tcGhpbHMtaW5jLW1hbnVsaWZlLXBoaWxpcHBpbmVzLTI1MDczMDAzNDY/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Product Policy Manager, Japan", "company_name": "TikTok", "location": "Singapore", "via": "via Bayt.com", "description": "TikTok is the leading destination for short-form video. Our mission is to inspire creativity and bring joy. Our Trust & Safety team's commitment is to keep our online community safe. We have invested heavily in human and machine based moderation to remove harmful content quickly and often before it reaches our general community. Your wellbeing is very important to us. As part of this commitment, you will have access to our especially designed wellbeing programmes to support your physical and psychological health and wellbeing. The Trust & Safety Policy team develops and reviews our community policies to promote a positive and safe environment for all of our Users and Content Creators to enjoy and express themselves. As a Product Policy Manager for Japan you will become an expert on the policy, media and technology landscape of Japan and what makes it unique.\nYou will be part of a global and regional team, ensuring that our Policies fit the legal and cultural environments of Japan... What will I be doing?\n- Organize and articulate ambiguous and complex ideas or issues into clear documentation and analysis\n- Craft and implement content policies for the Japanese market with local insights which are in line with global Trust and Safety policies\n- Act as an escalation point of contact for Japan, align all stakeholders and respond to emergency content safety-related cases.\nWhat should I bring with me?\n- Experience in policy, policy enforcement, or public policy, specifically in technology/social media/content\n- Deep interest in content management and online community development\n- Native language skills in Japanese and fluency in English is required as you will be covering the Japanese market. TikTok is committed to creating an inclusive space where employees are valued for their skills, experiences, and unique perspectives. Our platform connects people from across the globe and so does our workplace. At TikTok, our mission is to inspire creativity and bring joy. To achieve that goal, we are committed to celebrating our diverse voices and to creating an environment that reflects the many communities we reach. We believe individuals shouldn't be disadvantaged because of their background or identity, but instead should be considered based on their strengths and experience. We are passionate about this and hope you are too", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9kdWN0IFBvbGljeSBNYW5hZ2VyLCBKYXBhbiIsImNvbXBhbnlfbmFtZSI6IlRpa1RvayIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoibVFpWFpOdXRYblM5YUlKU0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCYXl0LmNvbSIsImxpbmsiOiJodHRwczovL3d3dy5iYXl0LmNvbS9lbi9zaW5nYXBvcmUvam9icy9wcm9kdWN0LXBvbGljeS1tYW5hZ2VyLWphcGFuLTU5MTEyNjI2Lz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "PROJECT MANAGER", "company_name": "Rockwell Automation", "location": "Singapore", "via": "via Glassdoor", "description": "Job Description\n\nPosition Summary\n\nIn accordance with sound and accepted project management principles, the project manager directs, coordinates and manages various product developments through all phases of engineering product design, testing and release for mass production and subsequent support. Provides specific personnel administration responsibilities including technical staff coordination and resource allocation, plus assistance in providing performance feedback, staff coaching and skill development planning. Project management responsibilities include scheduling/planning and implementing engineering project management across multiple functional areas, coordination outside development resources and factored product acquisitions, and providing continuation engineering for existing products. Develops systems and presents updates on progress while ensuring the meeting of commitments. Assists in the development of business and marketing strategies, optimizing the performance of new... and existing product lines to achieve established business financial objectives. Provides for in depth understanding of SBU's business practices (finance, portfolio plans, strategy, etc.).\n\nScope\n\nGeographical Coverage: Global\n\nNumber of Direct Reports: NA\n\nAnnual Business Revenue: NA\n\nOthers: Nil\n\nPrincipal Duties and Responsibilities\n\nFunctional Expertise\n• Provide project management of internal and external product developments with minimal direction, requiring planning, resourcing, scheduling, project cost forecasting/monitoring, , reporting and providing technical coordination guidance across multiple functional areas. Ability to manage multiple human resources and project finances.\n• Develops, maintain and track detailed project plans and project schedules, resulting in meeting committed Time to Market goals.\n• Defines project team's resource requirements, which support the project's goals with respect to time, budget and quality through negotiation with functional managers.\n• Provides in depth and advance knowledge in the project management discipline. Responsible for financial, applied technology, & schedule performance of assigned projects within cost limitations & established standards.\n• Develops project investigation and implementation schedules-facilitates work breakdown structures. Manages product cost estimates.\n• Identifies, manages and mitigates project risks, resulting in proactive contingency planning as required.\n• Provides clear and timely project progress assessment and updates, ensuring constant organization and stakeholder alignment, up to Senior Management levels.\n\nLeadership\n• Provide project related technical, interpersonal, motivational leadership and performance management of teams throughout all phases of the project including resource allocation, task planning, progress tracking and recognition.\n• Applies interpersonal skills required to lead, motivate and resolve conflict within a project team environment so that scheduled activities are performed in a cost effective and timely manner. Leadership skills are recognized with business unit .\n• Independently identifies, manages and mitigates project risks, resulting in proactive contingency planning as required. Demonstrates bias for action and issue resolution.\n• Takes accountability for meeting deadlines and budget requirements.\n\nInterpersonal\n• Ensure team member goals align with project objectives, facilitate team decisions within guidelines, and effectively communicate business issues/directions to team and management. Plan, schedule and organize product development projects, using the input and skills of team members.\n• Provides performance feedback assessment and coaching for team to Business/Functional managers. Holds teams accountable for deliverables.\n• Business/Functional Manager or Program Manager and occasionally senior management review progress.\n• Develops an effective working relationship within SBU and across RA on a global basis.\n\nBusiness\n• Prepare project level financial documents and project funding requirements. Maintains and reports on financial and schedule metrics throughout each phase .\n• Networks and partners with customers/vendors and coordinates efforts to resolve complex problems, responds and delivers timely and cost-effective quality solutions. Responsible for understanding and measuring customer requirements for the projects under development .\n• Knows and applies business metrics to assigned product developments and projects, tracking performance relative to business goals.\n• Ensures thorough familiarity with company policies and procedures. Appropriately applies policies and procedures in compliance with government laws. Policies and procedures include, but not limited to: Standards of Business Conduct, Intellectual Property, Control Environment, Information Protection, ISO 9000 & 14000, government regulations (e.g. health, safety, quality and environmental), and functional policies published on the Rockwell Automation Information Network.\n\nRequirements\nEducation and Experience\n• BS Degree in Engineering discipline or equivalent experience (MS and/or MBA desirable); Other P.M. professional certification preferred .\n• Typically 10+ combined year's experience in product development and project management. Proven ability to lead multiple teams, partner with management to resolve conflicts and obtain resources for projects. Effectively communicates and gives presentations (internally and externally). Proven ability to direct resources, plan project activity and balance financial budgets .\n• Has successfully led numerous product development project teams and has a clearly recognizable knowledge of detailed product development processes, either within RA or related industry .\n• Preferably has experiences in Functional Safety Product Development projects that involves IEC61508 certification and/or involve engagements with TUV Rheinland. Candidates with FS Engineer (TÜV Rheinland) certificate will have an added advantage.\n• Preferably attended training related to Secure product development lifecycle and managed one or more secure industrial automation and control systems product development projects that have attained certification related to IEC-62443-4-1/-2.\n\nThe above statements are intended to describe the general nature and level of work being performed by people assigned to the job. They are not intended to be an all-encompassing list of all responsibilities, duties and skills required of personnel so classified. Reasonable accommodation to essential functions of the job will be made if appropriate", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQUk9KRUNUIE1BTkFHRVIiLCJjb21wYW55X25hbWUiOiJSb2Nrd2VsbCBBdXRvbWF0aW9uIiwiY29tcGFueV9taWQiOiIvbS8wNDdia2QiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJ4MWNCT1RaQzZDel8weGUwQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdllCQ3JjQlFVNVZYMDV4VWxvMmN6aDROVzFYWVdOemJtWlpSMmx3VGt0T1NXUnhRMnREWTFSbVJEZFpaVTlXZEVGQlRUUXdhbGs0VUV0WVZFWTRlalk0ZVZaRllteFJWM05wTUc5Nk5tZGtWbWRYWTJSZmFraENMVmxZWVVnMk5FeHlOVlU1UzJaTlRFWnpVV2hEU25WMFdISlhOR3BwTFVKdVVVUktNbXR3ZGw5ZldWTlBhMEZ6ZW1sWVVYVmhTWE5xWVVGZmNFaHBNVkpMWVVkSE1EaGZkbE5WUzBGRmNHVkhPVlZzVnpkaU1XRmFTV0pvVlhac1puUlJFaFoyV0hGRFdVczJhVXhPUjNWMFVXRnZja3RNVVVKUkdpSkJUMDFaVW5kRVUzSm9abFZxUkhaVE1uSXpjMGROYjJsRE1ubGhNMDlZU21sUiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzY5IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEdsYXNzZG9vciIsImxpbmsiOiJodHRwczovL3d3dy5nbGFzc2Rvb3Iuc2cvam9iLWxpc3RpbmcvcHJvamVjdC1tYW5hZ2VyLXJvY2t3ZWxsLWF1dG9tYXRpb24tSlZfSUMzMjM1OTIxX0tPMCwxNV9LRTE2LDM1Lmh0bT9qbD00MDEzNjYwNzU0XHUwMDI2dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:Google Sans,arial,sans-serif}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Management", "value": "GC18"}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Business Operations", "value": "GC06"}, {"text": "Advertising and Marketing", "value": "GC03"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Accounting and Finance", "value": "GC01"}, {"text": "Legal", "value": "GC17"}, {"text": "Farming and Outdoors", "value": "GC13"}, {"text": "Human Resources", "value": "GC15"}, {"text": "Sales and Retail", "value": "GC26"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "Product manager", "value": "product manager"}, {"text": "Manager", "value": "manager"}, {"text": "Project manager", "value": "project manager"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Development manager", "value": "development manager"}, {"text": "Director", "value": "director"}, {"text": "Manufacturing manager", "value": "manufacturing manager"}, {"text": "Marketing manager", "value": "marketing manager"}, {"text": "Plant manager", "value": "plant manager"}, {"text": "Production manager", "value": "production manager"}, {"text": "Program manager", "value": "program manager"}, {"text": "Regional", "value": "regional"}, {"text": "Senior", "value": "senior"}, {"text": "Sr. manager", "value": "sr. manager"}, {"text": "Account manager", "value": "account manager"}, {"text": "Admin manager", "value": "admin manager"}, {"text": "Affairs manager", "value": "affairs manager"}, {"text": "Assistant", "value": "assistant"}, {"text": "Brand manager", "value": "brand manager"}, {"text": "Commodity manager", "value": "commodity manager"}, {"text": "Communication", "value": "communication"}, {"text": "Customer", "value": "customer"}, {"text": "Dealer", "value": "dealer"}, {"text": "Devops engineer", "value": "devops engineer"}, {"text": "Engineering", "value": "engineering"}, {"text": "Executive", "value": "executive"}, {"text": "Product specialist", "value": "product specialist"}, {"text": "Production supervisor", "value": "production supervisor"}, {"text": "Risk manager", "value": "risk manager"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Transactional", "value": "transactional"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Internship", "value": "INTERN"}, {"text": "Part-time", "value": "PARTTIME"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Toiletries", "value": "/business/naics2007/3256"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Foods & Beverages", "value": "/business/naics2007/311"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Management", "value": "/business/naics2007/55"}, {"text": "Research", "value": "/business/naics2007/5417"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "Citi", "value": "/m/01dfb6"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "Amazon", "value": "/m/0mgkg"}, {"text": "Binance", "value": "/g/11hcz1r4wl"}, {"text": "Standard Chartered", "value": "/m/02hszk"}, {"text": "United Overseas Bank", "value": "/m/04gjd1"}, {"text": "Apple", "value": "/m/0k8z"}, {"text": "Tata Communications", "value": "/m/04338k"}, {"text": "Workato", "value": "/g/11dxpy_3xd"}, {"text": "BNY  Mellon", "value": "/m/02vps5x"}, {"text": "DBS Bank", "value": "/m/01q7n5"}, {"text": "EPAM Systems", "value": "/m/0dlnrc"}, {"text": "GVT Government Technology Agency (GovTech)", "value": "/g/11gh0528nq"}, {"text": "Grab", "value": "/m/0134c_p9"}, {"text": "Paypal", "value": "/g/122s91_5"}, {"text": "PeopleSearch Pte Ltd", "value": "/g/11c73ngn0w"}, {"text": "Randstad", "value": "/m/08pt1z"}, {"text": "Singapore Airlines", "value": "/m/015f2x"}, {"text": "TEKsystems (Allegis Group Singapore Pte Ltd)", "value": "/g/11b6g4bkv0"}, {"text": "ABBOTT LABORATORIES (SINGAPORE ) PRIVATE LIMITED", "value": "/m/09m57z3"}, {"text": "ADVANCE INTELLIGENCE PTE. LTD.", "value": "/g/11dymfkxss"}, {"text": "AXA", "value": "/m/04mn99"}, {"text": "Adecco Personnel Pte Ltd", "value": "/m/08gz46"}, {"text": "Adidas Group", "value": "/m/01jtml"}, {"text": "Aetna, a CVS Health Company", "value": "/m/0kg8x"}, {"text": "Agency for Science, Technology and Research", "value": "/m/0gmjcg"}, {"text": "Alibaba", "value": "/m/07s6ctl"}, {"text": "Argyll Scott", "value": "/g/11dxpk2374"}, {"text": "Autodesk", "value": "/m/018nm3"}, {"text": "Barry Callebaut", "value": "/m/03clky2"}, {"text": "BioMind", "value": "/g/11dymfr2l6"}, {"text": "CHUBB ASIA PACIFIC PTE. LTD.", "value": "/m/09m8xyh"}, {"text": "Cargobase", "value": "/g/11dxppfsjn"}, {"text": "Cargobase Pte Ltd", "value": "/g/11fy240nxm"}, {"text": "DKSH", "value": "/m/0dj2nh"}, {"text": "Dathena", "value": "/g/11dxprdn6y"}, {"text": "Dyson", "value": "/m/05cskg"}, {"text": "Enggsol Pte Ltd", "value": "/g/11g9mnfmm1"}, {"text": "Ethos BeathChapman", "value": "/g/11c73z0xm0"}, {"text": "Eu Yan Sang", "value": "/m/03cl9hn"}, {"text": "Flintex Consulting Pte. Ltd.", "value": "/g/11h1z41pzb"}, {"text": "GIVAUDAN SINGAPORE PTE LTD", "value": "/g/11f00wn519"}, {"text": "Goldman Sachs", "value": "/m/01xdn1"}, {"text": "GovTech Singapore", "value": "/g/11dxpkfs_6"}]}]}