{"search_metadata": {"id": "608279732c08442d8787075c", "status": "Success", "json_endpoint": "https://serpapi.com/searches/f625402fbfe08201/608279732c08442d8787075c.json", "created_at": "2021-04-23 07:38:27 UTC", "processed_at": "2021-04-23 07:38:27 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28consultant%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=50", "raw_html_file": "https://serpapi.com/searches/f625402fbfe08201/608279732c08442d8787075c.html", "total_time_taken": 1.92}, "search_parameters": {"q": "(consultant) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "50"}, "jobs_results": [{"title": "Infrastructure – DC Senior Network Consultant", "company_name": "Infosys", "location": "Singapore", "via": "via NodeFlair", "description": "JD ID DC Network TF– Senior Consultant –Singapore\nRole (L1/L2/L3/Service Lead/Tech Lead/Architect) Senior Consultant\nPosition Infrastructure – DC Senior Network Consultant\nDepartment / PU CISNWT\nAcademic Background Bachelor of Engineering / Technology / Science\nOverall Experience (in yrs.) 10 + Yrs.\nLocation Singapore\nDC Network TF– Senior Consultant –Singapore\n\nRequired\nTechnical skills (Required - Mandatory) Deployment\nCisco Switching NX-OS/Cisco Routing\nVMware NSX-V/T\nNetwork Automation/Python/Ansible\nF5 /Citrix Load Balancing\nCisco Switching & Routing\nAs Built, LLD, Testing & Acceptance Testing Documentation Skills\n\nTechnical skills (Required - Nice to have) F5 Load Balancing, Network Security & Design Skills\nVMware NSX-V/T\nCertification: CCNP/CCDA equivalent, F5 Certified Technical Specialist\nLanguage skills needed Role (L1/L2/L3/Service Lead/Tech Lead/Architect)\nPeople skills Lead for 5-8 team members\nSoft Skills\n• Experience in running operations with ITIL processes / Project... Management - PMP\n• Excellent Analytical and troubleshooting skill.\n• Excellent in Verbal, written communication.\n• Creative thinking in implementing Service improvements (automation, incident reduction, etc.).\n• Willingness and flexibility to learn new technologies, scale up quickly and adapt to different roles as the situation demands.\n• Experienced in running operations following ITIL processes.\n• Experienced in writing RFPs solutions and presentations during client visits.\n\nRole (L1/L2/L3/Service Lead/Tech Lead/Architect) Skill Level\n• Discovery and Design Work Shop\n• Finalize the Baseline, Architecture, Design and Migration Strategy\n• Enterprise Data Network (administration, patching, upgrade and migration activities), Design, Preparing of HLD/LLD, Implementation Team leading, Service Level management, demand, incident, change management.\n• Provide network WAN/LAN design, implementation, consulting, Cisco, Aruba, Juniper or equivalent\n• Network audit Identify the gaps and suggest the remedial solution. Supporting in RFP/RFI response.\n• Handling Client discussions for due diligence, business information gathering etc.\n• Site Network Build & Transform\n• Migration\n• Support Hyper care and Handover\nExpert\n• Writing solutions / estimates for RFPs.\n\nSenior Consultant\n\nAll aspects of employment at Infosys are based on merit, competence and performance. We are committed to embracing diversity and creating an inclusive environment for all employees. Infosys is proud to be an equal opportunity employer.\n\nAt Infosys, we recognize that everyone has individual requirements. If you are a person with disability, illness or injury and require adjustments to the recruitment and selection process, please contact our Recruitment team for adjustment only on Infosys_ta@infosys.com or include your preferred method of communication in email and someone will be in touch.\n\nPlease note in order to protect the interest of all parties involved in the recruitment process, Infosys does not accept any unsolicited resumes from third party vendors. In the absence of a signed agreement any submission will be deemed as non-binding and Infosys explicitly reserves the right to pursue and hire the submitted profile. All recruitment activity must be coordinated through the Talent Acquisition department", "extensions": ["7 days ago", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJJbmZyYXN0cnVjdHVyZSDigJMgREMgU2VuaW9yIE5ldHdvcmsgQ29uc3VsdGFudCIsImNvbXBhbnlfbmFtZSI6IkluZm9zeXMiLCJjb21wYW55X21pZCI6Ii9tLzAxazh4NiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Ilo5anJIV0ZzRWFFRTZDZzhBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVzc0JDb3dCUVU1VlgwNXhVM2RmTUdSb2RVUmZNRWN4YUZSWlNXUTFRemh2V0dWM1YxZENWbE10UWt4Q1FqaHJORGRCYmxSV1FrTjVhREZCYzNWM1IwTXpNWFpwTkZSUU5IWnBVVkp6VVZwUVRqbEJhREZGYkdjNU5HRXhUekpWV0ZoUWFFVlVNRFk1TmpKTWJ6bGlORUYyUjBWNllYSnVaekZaWVhGZk56bFRaVXBaU2xsaVpsRlpjbk5DVGxkUmNrY1NGbVJJYlVOWlNXVmpUVTVoWkMxblUwWTFjbmwzUTFFYUlrRlBUVmxTZDBOQ0xVODRSSFIxZVY5eVUyZEdaUzFZTjNCeU1sUkJPRGMyY2tFIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBOb2RlRmxhaXIiLCJsaW5rIjoiaHR0cHM6Ly93d3cubm9kZWZsYWlyLmNvbS9qb2JzL2xpc3RpbmdzLzEyNDc1P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "AWS Consultant (AP CoC Cloud Advisory)", "company_name": "IBM", "location": "Singapore", "via": "via IBM Global Careers", "description": "Introduction\nAs an IBM Application Architect, you directly help clients transform their business and solve complex problems. You will define the scope and vision for projects that deliver customized solutions using your knowledge of IBM platforms. You are a technical leader, serving as a liaison among business partners, technical resources, and project stakeholders.\n\nYour Role and Responsibilities\nAWS Consultants are hands on technical specialists with a real passion for helping customers create and deploy cutting-edge solutions in AWS. They help IBM create & deliver the next generation of AWS-based Solutions for our most strategic customers.\nThe role holder will be able to build and deploy secure, reliable and highly available technology solutions that deliver real customer value. They will be a strong advocate for automation, able to quickly develop scripts and AWS CloudFormation templates need to deliver rapid, consistent and highly effective solutions to customers in AWS.\n\nPrimary... Responsibilities:\n• Foster senior level client relationships and engage with senior level stakeholders to drive solution success\n• Customer facing delivery of AWS cloud solutions\n• Contribute best practices, lessons learned, and intellectual property (IP) to the IBM community with a focus on continuous improvement\n• Mentoring, supporting peers and sharing knowledge\n\nQualifications and Experience\n• You should have 3+ years of experience using AWS and hands on practical expertise in one or more of the following:\n• AWS EKS & Containers – experience with Docker, Kubctl, shell scripting, Pod design & configuration, operations and monitoring\n• AWS Advanced Networking – exposure to Direct Connect configuration, Border Gateway Protocol (BGP), Virtual Extensible LAN (VXLAN) and Ethernet VPN (EVPN), AWS Transit Gateway, VNets, Subnets, Network Security Groups (SGs), Enterprise Scale architecture, Network automation with Python scripting\n• AWS Security – experience with AWS CloudWatch and CloudTrail, AWS Security Hub, AWS IAM Policies, AWS Active Directory Services, RBAC, DevSecOps, Conditional Access and MFA, Compliance frameworks including HIPPA/HITRUST/NIST/PCI\n• AWS DevOps – expertise with AWS DevOps (AWS CodePipeLine, CodeBuild, CodeDeploy, CodeStar), Github, Terraform, CloudFormation Templates, YAML, PowerShell, Python or other scripting language, CI/CD, Unit/UI Testing\n• Demonstrated excellence with consulting skills and presenting complex development topics to both business executive and technical personnel\n• Proven track record of building deep technical relationships with customers and helping to build innovative cloud solutions in large or highly strategic accounts\n• AWS Solutions Architect – Professional qualification preferred; certification is expected within 12 months of joining\nKyndrylSales_AsiaPacific\n\nRequired Technical and Professional Expertise\nAs above\n\nPreferred Technical and Professional Expertise\nAs above", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBV1MgQ29uc3VsdGFudCAoQVAgQ29DIENsb3VkIEFkdmlzb3J5KSIsImNvbXBhbnlfbmFtZSI6IklCTSIsImNvbXBhbnlfbWlkIjoiL20vMDNzYzgiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJiUUljUmNoZ0w1YlJ4VkF5QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFc3NCQ293QlFVNVZYMDV4VTJONk1VaDVSbkJhUjNGemRqWkxhbGRMWVdWcmRFWnhhVGhOTlhGVGNXOWtUbmRUWkU5TVZuTnFTelpqVWtsU2VuRlhSSGcxUzJWUE0xUnFOek41TUZWbFJVZFBOMmh2Y1RZemFHb3hkV2xaZDNORllqQmlhbUZWTUZsc2VqTTVkVkptUkMxWFdVaDNVVTFSZEhCUU1sTldNR2xWWjJOdk1tZDRiR2huTkVaaWFHZGlZMHNTRm1SSWJVTlpTV1ZqVFU1aFpDMW5VMFkxY25sM1ExRWFJa0ZQVFZsU2QwUkhNbkV4WWtoVFVtOW1lRzlUUm5CQk1taFllV3h5YUdsdmEyYyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzE1IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIElCTSBHbG9iYWwgQ2FyZWVycyIsImxpbmsiOiJodHRwczovL2NhcmVlcnMuaWJtLmNvbS9qb2IvMTIxMDc4MzEvYXdzLWNvbnN1bHRhbnQtYXAtY29jLWNsb3VkLWFkdmlzb3J5LXNpbmdhcG9yZS1zZy8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "IT Technology Senior Consultant", "company_name": "SAP", "location": "Singapore", "via": "via LinkedIn", "description": "Requisition ID: 269580\nWork Area: Information Technology\nExpected Travel: 0 - 10%\nCareer Status: Professional\nEmployment Type: Regular Full Time\n\nCompany Description\n\nSAP started in 1972 as a team of five colleagues with a desire to do something new. Together, they changed enterprise software and reinvented how business was done. Today, as a market leader in enterprise application software, we remain true to our roots. That’s why we engineer solutions to fuel innovation, foster equality and spread opportunity for our employees and customers across borders and cultures.\n\nSAP values the entrepreneurial spirit, fostering creativity and building lasting relationships with our employees. We know that a diverse and inclusive workforce keeps us competitive and provides opportunities for all. We believe that together we can transform industries, grow economics, lift up societies and sustain our environment. Because it’s the best-run businesses that make the world run better and improve... people’s lives.\n\nSummary\n\nAs a member of the Secure Workstation Services Team in Workplace Delivery, you and your fellow colleagues are responsible for delivering, managing and supporting the secure administrative workstation environment across all SAP environments. The team utilizes the latest Windows 10 operating system, Microsoft security toolsets and Microsoft Endpoint Management services to provide next level security for administrators accessing SAP's most critical infrastructure services. As a senior team member, you will be a subject matter expert in one or more topics (Windows OS hardening, supply logistics, Patching, deployment, etc) while supporting the day to day operations during the Asia Pacific time zone.\n\nThe ROLE\n• The position requires great analytical and communication skills in combination with a genuine service-oriented approach with the ability to anticipate changes and recommend service improvements\n• Workplace Delivery provides the key services and infrastructure to support SAP's digital transformation globally. We are a diverse and global team focused on using the latest technology to deliver extraordinary results.\n\nROLE REQUIREMENT\n• Bachelor’s degree in Science, Technology, Engineering, and Mathematics (STEM) disciplines or similar work experience\n• Security + certification or equivalent\n• Microsoft 365 Certified: Enterprise Administrator Expert or equivalent\n• Minimum 5 years experience configuring and delivering Microsoft Windows devices to end users, with recent experience hardening the Windows 10 operating system\n• Minimum 5 years experience deploying Microsoft Windows with System Center Configuration Manager or Microsoft Intune (Microsoft Endpoint Manager)\n• Powershell, Advanced Level\n• Microsoft Windows OS troubleshooting, Expert Level\n• Previous experience working in a large organization supporting users across mulitple time zones and countries\n\nWhat You Get From Us\n\nSuccess is what you make it. At SAP, we help you make it your own. A career at SAP can open many doors for you. If you’re searching for a company that’s dedicated to your ideas and individual growth, recognizes you for your unique contributions, fills you with a strong sense of purpose, and provides a fun, flexible and inclusive work environment – apply now.\n\nSAP'S DIVERSITY COMMITMENT\nTo harness the power of innovation, SAP invests in the development of its diverse employees. We aspire to leverage the qualities and appreciate the unique competencies that each person brings to the company.\n\nSAP is committed to the principles of Equal Employment Opportunity and to providing reasonable accommodations to applicants with physical and/or mental disabilities. If you are in need of accommodation or special assistance to navigate our website or to complete your application, please send an e-mail with your request to Recruiting Operations Team (Americas: Careers.NorthAmerica@sap.com or Careers.LatinAmerica@sap.com, APJ: Careers.APJ@sap.com, EMEA: Careers@sap.com).\n\nSuccessful candidates might be required to undergo a background verification with an external vendor.\n\nAdditional Locations", "extensions": ["14 hours ago", "Full–time"], "detected_extensions": {"posted_at": "14 hours ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJJVCBUZWNobm9sb2d5IFNlbmlvciBDb25zdWx0YW50IiwiY29tcGFueV9uYW1lIjoiU0FQIiwiY29tcGFueV9taWQiOiIvbS8wMXBmNGwiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJ1YjY5RWVNVFhWZVZOQll0QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFc3NCQ293QlFVNVZYMDV4VVVWdFZtRXlhM2RIYm1kTFgza3daMUU0YkV0NFgxQmFSRTlWV1dOaVlYaHlOaTF5VjJ4S2RreFZhbkJmWjBsdlZVUlRaREl5V25rMFkybFJNakJsU25ocll6TjZSRzVVVGtNeGRuaFBOV2RUY0VaWFRtaDJRMU53VWpOVmRHdEJkVEl5ZDNKWWIwNWtNVE4wZEVWU1NWWmpNemwzUWs5Q2FsRTVTMkZoTWpSamFEaFFlamdTRm1SSWJVTlpTV1ZqVFU1aFpDMW5VMFkxY25sM1ExRWFJa0ZQVFZsU2QwSlpXRlZGYUcwMGVFdE1TRlJKUkdaMVkwZFZja1ZKU1hCU1dGRSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzIzIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExpbmtlZEluIiwibGluayI6Imh0dHBzOi8vc2cubGlua2VkaW4uY29tL2pvYnMvdmlldy9pdC10ZWNobm9sb2d5LXNlbmlvci1jb25zdWx0YW50LWF0LXNhcC0yNTE1NzI4MTcyP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Senior Consultant, Third Party Risk Management (Asia Pacific)", "company_name": "VISA", "location": "Singapore", "via": "via Bayt.com", "description": "Job Description and Responsibilities\n\nQualifications", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQ29uc3VsdGFudCwgVGhpcmQgUGFydHkgUmlzayBNYW5hZ2VtZW50IChBc2lhIFBhY2lmaWMpIiwiY29tcGFueV9uYW1lIjoiVklTQSIsImNvbXBhbnlfbWlkIjoiL20vMDFrcWpuIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiWkZZQ1JNM3VsdWd6YkJ3S0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXNzQkNvd0JRVTVWWDA1eFZIcFpUSFIwY2paRVFta3hRMmxrUWxkWFpWSnJSV2RGTVZrd1ZWSnJXbDlZTVRGdk1WVnRlV0l6YjBoUk1VSXhhbmRCWVZGVFl6QkxVSFJ2YlMxaFVYWllSVTVhWVVwUmJWWnpNbTkxWkRGbVEzZ3lSblJZZEV4clptVm1ZelJGVUZkclpsOUxNR3RQU1hSb1VVSmtZMFJ3ZFd0d01UazFlR2hqVG1KUFFVZGFRVmg1YUdFU0ZtUkliVU5aU1dWalRVNWhaQzFuVTBZMWNubDNRMUVhSWtGUFRWbFNkMEZsZDFkWk9IVlpZemxRWjFWWGNVVlZNVWhuZVZBNVptSlRjRUUiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18zMSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCYXl0LmNvbSIsImxpbmsiOiJodHRwczovL3d3dy5iYXl0LmNvbS9lbi9zaW5nYXBvcmUvam9icy9zZW5pb3ItY29uc3VsdGFudC10aGlyZC1wYXJ0eS1yaXNrLW1hbmFnZW1lbnQtYXNpYS1wYWNpZmljLTU5NTE1MDg2Lz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "QC Engineer(MDSAP/ISO13485/Six Sigma)/Medical MNC/East/S$4.3K higher)", "company_name": "Achieve Career Consultant Pte Ltd", "location": "Singapore (+1 other)", "via": "via Joblum Singapore", "description": " S$4,300 Higher (12 months contract/perm)\n 5 days work week\n Experience in Process validation activities as Quality function\n Certified Quality Engineer and/or Certified Reliability Engineer\n 2 years of manufacturing quality control in a regulated environmentOur client is a manufacturer of products for the life science research and clinical diagnostics markets is looking for suitable candidates to join their growing business as QC Engineer\nRESPONSIBILITIES:\n• Lead and drive internal and/or supplier non-conformances to ensure timely disposition for closure of QNs.\n• Identify and drive continuous Product Quality improvement of internal manufacturing processes for existing products.\n• Perform monitoring and analysis on creeping issues on reported Customer Returned Instrument history and identify continuous Product Quality improvement opportunities.\n• Identify and establish in-process/ outgoing Product QC inspection criteria and provide training to QC Technicians.\n• Maintain KPIs for... monitoring of process and/or product quality, perform analysis, and interpret trends, identifying and activating appropriate actions as necessary.\n• Maintain and ensure Products CDF are timely updated for Product Safety periodic assessment by certification house.\n• Participate and review Site Process Validation activities to ensure Quality control adequacy.\n• Generate and analyze weekly, monthly Product Quality performance reports for Management review.\nREQUIREMENTS:\n• Bachelor’s Degree in Mechanical or relevant engineering.\n• Minimum 2 years of manufacturing quality control in a regulated environment\n• Experience in Process validation activities as Quality function.\n• Experience with ERP systems a plus, SAP preferred.\n• Knowledge of MDSAP and/or ISO13485 requirements. Lead auditor certified.\n• Hand-on experience of statistical tools application. Lean/ Six Sigma Green Belt\n• Certified Quality Engineer and/or Certified Reliability Engineer\nOTHER INFORMATION:\n• Location : East\n• Working hours : Monday – Friday, Office Hours\n• Salary : S$4,300 higher / Negotiable (Salary will commensurate according to experience & qualifications).\n• The Company strives to achieve employee satisfaction and provides conducive working environment, attractive incentives and remuneration to all staff.\nHOW TO APPLY:\nSimply submit your application by emailing a detailed copy of your updated Resume in MS Word Format to Charles Seah (Reg. No.: R1871814)\nEMAIL: ascend6@achievegroup.asia\nor call your friendly Consultant, Charles Seah, at 6590 9945 or whatsapps 8207 8458 for a discussion. I will be glad to\nassist you!\nPlease indicate the below information in your resume:\n• Current & Expected salary\n• Reason(s) for leaving\n• Availability to commence work\nBy submitting any application or résumé to us, you will be deemed to have agreed and consented to us collecting, using,\nretaining and disclosing your personal information to prospective employers for their consideration.\nWe regret only shortlisted candidate will be notified. All applications will be treated with the strictest confidence.\n\nYOUR SUCCESS IS OUR ACHIEVEMENT", "extensions": ["3 days ago", "$3.5K–$4.3K a month", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time", "salary": "$3.5K–$4.3K a month"}, "job_id": "eyJqb2JfdGl0bGUiOiJRQyBFbmdpbmVlcihNRFNBUC9JU08xMzQ4NS9TaXggU2lnbWEpL01lZGljYWwgTU5DL0Vhc3QvUyQ0LjNLIGhpZ2hlcikiLCJjb21wYW55X25hbWUiOiJBY2hpZXZlIENhcmVlciBDb25zdWx0YW50IFB0ZSBMdGQiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Ijh3N3ZRdmsxVjdKYjFELUFBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9ibHVtIFNpbmdhcG9yZSIsImxpbmsiOiJodHRwczovL3NnLmpvYmx1bS5jb20vam9iL3FjLWVuZ2luZWVyLW1kc2FwLWlzbzEzNDg1LXNpeC1zaWdtYS1tZWRpY2FsLzYyNzY2Mj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Technology Recruitment Consultant", "company_name": "Randstad Singapore", "location": "Singapore (+1 other)", "via": "via Randstad Singapore", "description": "about the company\n\nRandstad is a global leader in the HR services industry, with offices in over 38 different markets. At Randstad, you have the unique opportunity to impact lives and careers, while growing your own career as a recruitment consultant.\n\nWe offer a structured career development plan, attractive salary package and an engaging Learning & Development program.\n\nabout the job\n• Build up your specialist vertical in the field of high demand talents in technology.\n• Responsible for business development, speaking to key stakeholders to understand their hiring plans and manage the end to end hiring processes.\n• Manage the recruitment process for clients through sourcing, screening and qualifying candidates, briefing and preparing candidates, organising interviews and negotiating remuneration packages to ensure clients needs and expectations are met in a timely manner.\n• Provide advice to candidates and clients when required on salary levels, training requirements and career... progression opportunities to facilitate the recruitment process.\n• Set to achieve and overachieve sales targets set monthly and quarterly.\n\nskills and experience required\n• Minimum of 1 year of relevant experience in a technology recruitment agency environment or equivalent\n• Passion for results and creating a personal brand in recruitment\n• Strong business development, jobs qualifications and candidate management skills\n• CEI certification\n\nIf you are looking to join an established leader in recruitment, and have excellent recruitment skills, this is an excellent opportunity for you. To apply online, please click on the appropriate link. Alternatively please contact Nyx Han at 6517 1620 to discuss more on the opportunity.\n\nEA(94C3609/R1218227)\n\nskills\nno additional skills required\n\nqualification\nno additional qualifications required\n\nexperience\n1 year\n\nworking hours\nFull-Time\n\neducational requirements\nBachelor Degree", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJUZWNobm9sb2d5IFJlY3J1aXRtZW50IENvbnN1bHRhbnQiLCJjb21wYW55X25hbWUiOiJSYW5kc3RhZCBTaW5nYXBvcmUiLCJjb21wYW55X21pZCI6Ii9nLzExZzcwYjUwbXIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJGblgxTHVIb2cyRW9RQUttQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdllCQ3JjQlFVNVZYMDV4VVcxTFptdENXR2RCUXpsS1pFNWtVME5VVEZkRFNYRkpiR1ZvVTBWa2Ewd3hOM0UyUVRJNFJqaDFWV3RsY0dGeFZuUkVOREJtVm1sS2RHOTFaelpKVldkWE9WVjNla04zY2pKb1ZuUXhUVGwwY0dweGJUWktURFZUVnkxck5UVkJRVTloYnpZNFZrTTVVMnhSUjBNdFpqVlJhbTlwZWw5bE0wTnNkMXBHVGxwZmEwbEllSGwyWmtWVFFsbFdNSFpDV0dGUk0zbHJkMHcyU0VObE1qTTRjRWgyWWtObFFscGFaMXBGY2tWdGVpMDRFaFprU0cxRFdVbGxZMDFPWVdRdFoxTkdOWEo1ZDBOUkdpSkJUMDFaVW5kQlVXOTJaa1EyTWxSeGJWQmZlSEZIUVZsUE5YTkpZV0kzTWpaUiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzQyIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFJhbmRzdGFkIFNpbmdhcG9yZSIsImxpbmsiOiJodHRwczovL3d3dy5yYW5kc3RhZC5jb20uc2cvam9pbi1vdXItdGVhbS9qb2Itc2VhcmNoL3RlY2hub2xvZ3ktcmVjcnVpdG1lbnQtY29uc3VsdGFudF9zaW5nYXBvcmVfMzY1MjgwOTcvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "High Jewelry Consultant, Singapore", "company_name": "Tiffany & Company", "location": "Singapore", "via": "via Tiffany & Co.", "description": "Overview\n\nTiffany & Co. … the name instills images of True Love, Romance and The Blue Box. Since 1837, the masterpieces of Tiffany & Co. have defined style and celebrated the world’s great love stories. Tiffany & Co.’s rich heritage of celebrated artists, milestones and magnificent jewelry sets the foundation upon which our employees stand. Tiffany employees are passionate, kind and professionally committed. We continually educate ourselves about new merchandise collections, cultures and the evolving luxury market. Our respect and love for the brand creates a workplace like no other. For us, it is a dream to be associated with a company that is forever aligned with exquisite craftsmanship, timeless design and a dedicated commitment to corporate sustainability.\n\nResponsibilities\n\nGrow and develop the High Jewelry business in Singapore\n\n- Maximize high ticket sales opportunities through intensified clienteling efforts and events participation\n\n- Strengthen and cultivate relationships... with new high jewelry customers to meet own individual (High Jewelry) sales plan\n\n- Optimize own customer engagement opportunities relating to key business initiatives\n\n- Consistently, accurately and appropriately capture all customer data\n\n- Work with Marketing on CRM program for our top Tiffany Registered customers\n\n- Participate in discussion with Market Director and HJ Manager on HJ business Development Strategy as needed\n\nCustomer Development and Prospecting\n\n- Prospect right networks to cultivate new high jewelry clients\n\n- Build, Understand and know your assigned portfolio client list, delicately execute client discovery depending on client relationship,\n\n- Provide weekly report on outreach contacts made to date and any sales update during High Jewlery Meetings and CRM team\n\n- Develop a strong knowledge of store High Jewelry/UHNW Business\n\nDevelop Own HJ Selling Capabilities\n\n- Work with HJ sales teams or retail team to provide expertise sharing (as needed)\n\n- Provide sound advise to retail team when being consulted\n\n- Provide technical knowledge and expertise in store and at events (as needed) to elevate client experience.\n\n- Provide support to resolve customer complaints and special situations as they arise, in-store and outside the store\n\nBe a High Jewelry Ambassador\n\n- Represent Singapore in all High Jewelry related Global meetings/events\n\n- Demonstrates professionalism and champions customer focus as the High Jewelry Ambassador for Singapore.\n\nQualifications\n\n5+ years of retail/relevant business development experience in luxury industries preferred\n\nPossess the passion for Tiffany & Company brand to share knowledge on a range of products, stones, history and services to convey Tiffany & Company heritage and values\n\nSolid knowledge base on gemstone, jewelry and timepieces - GIA Certification is a plus\n\nDriven, energetic and independent\n\nThrives in meeting new people\n\nPossess a full understanding of the Singapore marketplace and client demographic, an established client book – highly desirable\n\nStrong negotiation skills with excellent verbal and written communication and interpersonal skills\n\nProficient in MS Office, computer knowledge\n\n#LI-SK1", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJIaWdoIEpld2VscnkgQ29uc3VsdGFudCwgU2luZ2Fwb3JlIiwiY29tcGFueV9uYW1lIjoiVGlmZmFueSBcdTAwMjYgQ29tcGFueSIsImNvbXBhbnlfbWlkIjoiL20vMDRnM3p5IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiTE80SlYtZ0swZ0VFTm05TEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZZQkNyY0JRVTVWWDA1eFVUZGhNbWxvUVY5bVMwSkthbFpNWVRoSE4zQm1lRnB1VlZKU1RIWmhNVEZPWTJzeWFXSmpXRUZNUlVNM2FFZElRMHA1VkZacU5WZEZXREpQUW5KRGRtVmhiamRwWlRacFZHMU1ZVXh4Ym1KNmVsSmxhRWwwTmpOdWEzazVRVE0wYW5OMU5YaG5NR1ZsWVZSS01HSTFVblJJU2tSaE1GbERkemxyUjFRNVdFWjZhMXBuVEZwRFRVNWZObWQzU1UxT1QzbDVRamR5WTBKVE9GWTRWM0F4ZVRoWVpDMW9jbk5NV1c1VVJUQmlUV3gzRWhaa1NHMURXVWxsWTAxT1lXUXRaMU5HTlhKNWQwTlJHaUpCVDAxWlVuZEVkR2czVFRWM1NsZFVXblJLYUdkYVduSjRXbGRTVFRFelpIWkIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY181MCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBUaWZmYW55IFx1MDAyNiBDby4iLCJsaW5rIjoiaHR0cHM6Ly9qb2JzMi10aWZmYW55LmljaW1zLmNvbS9qb2JzLzQzNjcwL2hpZ2gtamV3ZWxyeS1jb25zdWx0YW50JTJDLXNpbmdhcG9yZS9qb2I/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Talent Acquisition Consultant (Basic Salary up to S$3200 +Incentive)", "company_name": "Celecti Pte. Ltd.", "location": "Singapore (+1 other)", "via": "via NTU-JobsCentral", "description": "# 5-day work week\n\n#Easily accessible by public transports & Downtown & East-West MRT (3 mins walk)\n\n#Attractive renumeration package (Basic Salary up to S$3200 + Sales Incentive)\n\n#Excellent learning opportunities\n\n#Good career prospect, with opportunity to lead a team\n\nAs a client-centric recruitment firm, we provide customized methodologies to address the unique aspects of every assignment and job order. As a Recruitment Consultant, you are to provide a holistic approach to recruitment and ensure that our clients recruitment needs are met. Simultaneously, you are to provide an opportunity for someone who is in need of a livelihood. Join us in this purposeful job as a Talent Acquisition Consultant. We are expanding, and we invite you to be part of our growing team to make a difference in a person’s life and the organization.\n\nPRIMARY JOB DUTIES:\n\nCandidates Management:\n• To source, search and qualify suitable applicant for job role\n• Conduct interview, assess attitude & aptitude... conduct reference check on shortlisted applicant\n\nClients Management:\n• Business Opportunities Development: i) profile target market segments to support organization business needs ii) identify potential customers' needs\n• Customer Acquisition Management: i) to source for potential customers ii) generate leads based on targeted customer characteristics\n• Customer Relationship Management: i) engage customers to ensure services meet customers' needs ii) to build positive relationships with customers\n• To provide advises to clients on economic outlook, salary compensation, and labour market sentiment\n\nJOB REQUIREMENTS:\n• Min. Dip/’A’/Degree in any disciplines\n• Enjoy working in a team-based environment\n• An added advantage for applicant who is CEI certified, but is not a requirement\n\nAre you searching for a meaningful career or a career progression? Be part of our growing team, email your detailed resume in MS Word format to [Click Here to Email Your Resume]. Attention to Ms Lim.\n\nPersonal Data Protection\n\n\"By submitting your curriculum vitae or disclosing your personal information in connection with your job application, you are deemed to have read and agreed to the terms of our Privacy Policy, and consented to the collection, use and disclosure of your personal data by us, in accordance with our Privacy Policy. Please access our website at www.celecti.com.sg for a copy of our Privacy Policy.”", "extensions": ["2 days ago", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJUYWxlbnQgQWNxdWlzaXRpb24gQ29uc3VsdGFudCAoQmFzaWMgU2FsYXJ5IHVwIHRvIFMkMzIwMCArSW5jZW50aXZlKSIsImNvbXBhbnlfbmFtZSI6IkNlbGVjdGkgUHRlLiBMdGQuIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJlaFFIUlRUU0Nka2xIY2k4QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE5UVS1Kb2JzQ2VudHJhbCIsImxpbmsiOiJodHRwczovL250dS5qb2JzY2VudHJhbC5jb20uc2cvdmlld1NpbXBsZVByb2ZpbGUucGhwP2ppZD04ODk4NzFcdTAwMjZ1dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Salesforce Consultant", "company_name": "None", "location": "Singapore", "via": "via Jobs", "description": "At PwC South East Asia Consulting, we help businesses to work smarter and grow faster. We partner with our clients to build effective organisations, innovate and grow, reduce costs, manage risk and regulation and, leverage talent. Our aim is to support businesses in designing, managing and executing lasting beneficial change.PwC's South East Asia Consulting practice provides a comprehensive range of professional services and experience to deliver large scale, cross territory transformation projects, wherever our clients need us to be – from strategy through to execution.About the Role As an Associate / Senior Associate, you'll work as part of a team of problem solvers with extensive consulting and industry experience, helping our clients solve their complex business issues from strategy to execution. Specific responsibilities include but are not limited to: Listen to customer requirements, review existing and future Business Processes and translate all this input after full... understanding in a realistic and actionable solution designs that can be developed and implemented Prepare efforts estimates to build this solution after studying RFPs, requirements, and related customer documents while working in team with developers, project managers, and other Salesforce consultants Gain customer acceptance by explaining or demonstrating how Salesforce can help better meet their strategic, tactical, and financial goals You will be involved in delivering end-to-end salesforce implementation engagements, including discovery, build, test, training and adoption, and support. Professionally document the solution that was implemented Use a broad range of tools and techniques to extract insights from current industry or sector trends. Keep up-to-date with developments in the area of Salesforce. Demonstrate critical thinking and the ability to bring order to unstructured problems. Working in a team environment with people from multiple backgrounds and skill sets Uphold the firm's code of ethics and business conduct. About you Minimum 1 - 3 years of professional services or similar industry experience An interest in upskilling for a digital world and technology trends, an openness to learning new tools and adapting how you work Experience with the Salesforce platform (configuration or development) with one or more Salesforce certifications preferred. This includes, but not limited to: Salesforce Certified Platform App Builder, Salesforce Certified Administrator, Salesforce Certified Sales Cloud Consultant and/or Salesforce Certified Service Cloud Consultant Ability to design the data model, user interface, business logic, and security for custom applications using the configurable aspects of Salesforce You have experience or have understanding of agile methodologies in delivering platform implementations You are comfortable with business analysis and translating business requirements to functional user stories Excellent communication and listening skills in English Ability to work creatively and flexibly, both independently and as part of a team You follow the latest trends in technology, use best practice development principles and you want to work in an environment where that is the norm. You like diving into a product to understand how it works and consistently share your knowledge with others. Most of all, you have a strong desire to build new applications that you can be proud of, and that provide a real value to your users", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTYWxlc2ZvcmNlIENvbnN1bHRhbnQiLCJjb21wYW55X25hbWUiOiJOb25lIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJQWmNEQXVGQktUQjdodHB2QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnMiLCJsaW5rIjoiaHR0cHM6Ly9zZy5maWRhbnRvLmNvbS9qb2JzL2pvYi1vcGVuaW5nL3NhbGVzLXJlcHJlc2VudGF0aXZlcy1zZXJ2aWNlcy1hbGwtb3RoZXIvc2FsZXNmb3JjZS1jb25zdWx0YW50LTI3NTQ1MTA2Mz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "RISK Principal Consultant", "company_name": "VERIZON COMMUNICATIONS SINGAPORE PTE. LTD.", "location": "Singapore", "via": "via GrabJobs", "description": "RISK Principal Consultant for Network Security role is a strong consulting lead role and has the responsibility to work directly with a team of senior consultants and consultants in order to successfully deliver/lead consulting projects in Verizon RISK Team portfolio for Verizon Enterprise Solutions.\n\nAs a Principal Consultant, the role requires sound consulting, technical, documentation and pre-sales skills in the Information Security and IT solutions. Oftentimes this staff would be required to orchestrate between multiple departments to ensure a right solution is brought to a customer.\n\nAs a Principal Consultant, the role requires minor supervision and is required to take a lead role to drive new revenue business on behalf of Verizon’s RISK team.\n• Utilizes knowledge of Incident Response and Computer Forensics fundamentals.\n• Utilizes excellent senior level relationships in the Industry (especially BFSI, ITES/BPO, Manufacturing, Retail) through excellent delivery of consulting... solutions and projects.\n• Ensures that the established revenue targets on a quarterly / annual basis for all established targets are met or exceeded.\n• Ensures correct and timely delivery of consulting projects for Verizon’s customers in India.\n• Works on proposal development and effort estimations for new opportunities. Develops customer ready presentations and proposals.\n• Shows continued self-improvement in the product discipline to further understand industry, and products.\n• Effectively manages communication and administrative activities through the delivery of high quality and informative content on any requested report or any deal specific updates requested by management.\n• Engages at executive levels within each account.\n• Creates Partnerships: Provides a trusted partnership for our clients which will create increased customer satisfaction and a streamlined way of doing business with Verizon.\n\nYou’ll need to have:\n• Bachelor’s degree or four or more years of work experience.\n• Eight or more years of relevant work experience in Incident Response and Computer/Digital Forensics domain.\n• Experience in consulting solutions and dealing complex projects within the large enterprise industry/sector (especially BFSI, ITES/BPO, Manufacturing, Retail is a plus)\n• Ability to coach, mentor and train others within Verizon and ability to educate the customer on the benefits of a proposed solution.\n• CISSP/CISM/CISA certification.\n• CHFI/GCFA/PCI QSA certification.\n• ISO 27001 LA/LI certification.\n• Ability to lead cross-functional teams and ensure cohesive efforts toward a shared goal.\n• Knowledge of customer's environments and ability to intelligently and strategically discuss Verizon IT solutions/service delivery capabilities as they relate to our security services and client needs.\n• Ability to prioritize from multiple projects and the ability to clearly communicate project requirements/timelines.\n• Strong written and oral skills and ability to work in complex sales environments, utilizing resources across multiple organizations to achieve sales results.\n• Sales acumen, sales opportunity management and helping sales teams to meet or exceed team sales targets.\n• Willingness to travel up to approximately 25% of the time", "extensions": ["28 days ago", "$12.5K–$20.5K a month", "Full–time"], "detected_extensions": {"posted_at": "28 days ago", "schedule_type": "Full–time", "salary": "$12.5K–$20.5K a month"}, "job_id": "eyJqb2JfdGl0bGUiOiJSSVNLIFByaW5jaXBhbCBDb25zdWx0YW50IiwiY29tcGFueV9uYW1lIjoiVkVSSVpPTiBDT01NVU5JQ0FUSU9OUyBTSU5HQVBPUkUgUFRFLiBMVEQuIiwiY29tcGFueV9taWQiOiIvZy8xMWYwMWZoNjJ3IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiUHh1VnNLV2RZTzZCQ3Vvd0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXJZQ0N2Y0JRVTVWWDA1eFVYbzFTa2hwZWxCRVV6VkhlRWREYWtVM1QwSjZUMGRtVEVSRllrSXpSRzlVUkhWeWVYRkZTa2xaVDNWa1dVdHpPV3BEVTFoeldYVmtWamcxVTFVd1dXVmlURGRUUmpGb1lYZExlSFZmTVZKUGNVOW5OREpvVW5wRk56WXpVRTB0WHpkUVMxRmtPRXhDY2pWV2IycHNRWFJDZFhSS1MxRkVRWFYyT0MxTVdUTXRkWEZ1ZUhZd1ZXSldXR00yU2xGM1psZG9ZbGRLUlRjdFdrZFZUalJWVFZOSVVUVjRZbEJrTm5kRVlsUkxjM1JVY0ZkaVZHNXFjMHBDYlZNME4wWkpkbEI0U21vNVNITktNWEZGZFhsWFRIcERiVEF0U0ZReVRVaHZWbkpRV2pkSVZrMUVVbnBMT0RkSWR6TldTMEZEWnhJV1pFaHRRMWxKWldOTlRtRmtMV2RUUmpWeWVYZERVUm9pUVU5TldWSjNRM2RwZUdGRGRtcDRkVXB3VmxGRmNGWXpUMVJNZFdvMVdGSm5RUSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzY4IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEdyYWJKb2JzIiwibGluayI6Imh0dHBzOi8vZ3JhYmpvYnMuY28vc2luZ2Fwb3JlL2pvYi9mdWxsLXRpbWUvb3RoZXJzL3Jpc2stcHJpbmNpcGFsLWNvbnN1bHRhbnQtMTkwNjA4OT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Business Operations", "value": "GC06"}, {"text": "Human Resources", "value": "GC15"}, {"text": "Sales and Retail", "value": "GC26"}, {"text": "Accounting and Finance", "value": "GC01"}, {"text": "Protective Services", "value": "GC23"}, {"text": "Science and Engineering", "value": "GC27"}, {"text": "Management", "value": "GC18"}, {"text": "Advertising and Marketing", "value": "GC03"}, {"text": "Legal", "value": "GC17"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Social Services and Non-Profit", "value": "GC28"}, {"text": "Art, Fashion and Design", "value": "GC05"}, {"text": "Customer Service", "value": "GC10"}, {"text": "Healthcare", "value": "GC14"}, {"text": "Energy and Mining", "value": "GC21"}, {"text": "Sports Fitness and Recreation", "value": "GC29"}, {"text": "Education", "value": "GC11"}, {"text": "Media, Communications and Writing", "value": "GC20"}, {"text": "Personal Care and Services", "value": "GC22"}, {"text": "Admin and Office", "value": "GC02"}, {"text": "Animal Care", "value": "GC04"}, {"text": "Cleaning and Facilities", "value": "GC07"}, {"text": "Construction", "value": "GC09"}, {"text": "Entertainment and Travel", "value": "GC12"}, {"text": "Farming and Outdoors", "value": "GC13"}, {"text": "Installation, Maintenance and Repair", "value": "GC16"}, {"text": "Property", "value": "GC24"}, {"text": "Restaurant and Hospitality", "value": "GC25"}, {"text": "Transportation and Logistics", "value": "GC30"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "Consultant", "value": "consultant"}, {"text": "Senior consultant", "value": "senior consultant"}, {"text": "Security consultant", "value": "security consultant"}, {"text": "Lead consultant", "value": "lead consultant"}, {"text": "Recruitment consultant", "value": "recruitment consultant"}, {"text": "Technical consultant", "value": "technical consultant"}, {"text": "Associate consultant", "value": "associate consultant"}, {"text": "Principal consultant", "value": "principal consultant"}, {"text": "Financial consultant", "value": "financial consultant"}, {"text": "Functional consultant", "value": "functional consultant"}, {"text": "Presales consultant", "value": "presales consultant"}, {"text": "Application consultant", "value": "application consultant"}, {"text": "Associate", "value": "associate"}, {"text": "Development consultant", "value": "development consultant"}, {"text": "Pre-sales consultant", "value": "pre-sales consultant"}, {"text": "Solutions consultant", "value": "solutions consultant"}, {"text": "Business", "value": "business"}, {"text": "Consultants", "value": "consultants"}, {"text": "Devops consultant", "value": "devops consultant"}, {"text": "Hr consultant", "value": "hr consultant"}, {"text": "It consultant", "value": "it consultant"}, {"text": "Manager", "value": "manager"}, {"text": "Services consultant", "value": "services consultant"}, {"text": "Solution consultant", "value": "solution consultant"}, {"text": "Consulting", "value": "consulting"}, {"text": "Director", "value": "director"}, {"text": "Engineer", "value": "engineer"}, {"text": "Hcm consultant", "value": "hcm consultant"}, {"text": "Infrastructure", "value": "infrastructure"}, {"text": "Investment consultant", "value": "investment consultant"}, {"text": "Project manager", "value": "project manager"}, {"text": "Recruitment consultants", "value": "recruitment consultants"}, {"text": "Sales consultant", "value": "sales consultant"}, {"text": "Sap consultant", "value": "sap consultant"}, {"text": "Senior", "value": "senior"}, {"text": "Specialist", "value": "specialist"}, {"text": "Support consultant", "value": "support consultant"}, {"text": "Systems consultant", "value": "systems consultant"}, {"text": "Systems engineer", "value": "systems engineer"}, {"text": "Technology consulting", "value": "technology consulting"}, {"text": "Accountant", "value": "accountant"}, {"text": "Architect", "value": "architect"}, {"text": "Beauty consultant", "value": "beauty consultant"}, {"text": "Business consulting", "value": "business consulting"}, {"text": "Cloud consultant", "value": "cloud consultant"}, {"text": "Consultancy", "value": "consultancy"}, {"text": "Data engineer", "value": "data engineer"}, {"text": "Education consultant", "value": "education consultant"}, {"text": "Electrical engineer", "value": "electrical engineer"}, {"text": "Employee", "value": "employee"}, {"text": "Field engineer", "value": "field engineer"}, {"text": "Finance consultant", "value": "finance consultant"}, {"text": "Gastroenterologist", "value": "gastroenterologist"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Internship", "value": "INTERN"}, {"text": "Part-time", "value": "PARTTIME"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Accounting", "value": "/business/naics2007/5412"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Engineering Services", "value": "/business/naics2007/5413"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Real Estate", "value": "/business/naics2007/53"}, {"text": "Retail", "value": "/business/naics2007/44"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "SingTel", "value": "/m/020zfl"}, {"text": "EY", "value": "/m/0g9jc"}, {"text": "Geco Asia", "value": "/g/11gk72_bt_"}, {"text": "Deloitte SEA", "value": "/g/11f_g4x9d_"}, {"text": "SearchAsia Consulting Pte Ltd", "value": "/g/11fy260nhz"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "Infosys", "value": "/m/01k8x6"}, {"text": "OAKTREE CONSULTING", "value": "/g/11g70jfhtq"}, {"text": "Central Provident Fund Board", "value": "/m/0615qb"}, {"text": "NCS", "value": "/m/0282746"}, {"text": "Trustwave", "value": "/m/0n3xjf5"}, {"text": "Ensign InfoSecurity", "value": "/g/11g4jhymjr"}, {"text": "HCL SINGAPORE PTE. LTD.", "value": "/g/11fy25ngsv"}, {"text": "NTT Ltd", "value": "/m/01c3fq"}, {"text": "RECRUIT EXPRESS PTE LTD", "value": "/g/11g706hzhq"}, {"text": "Randstad", "value": "/m/08pt1z"}, {"text": "Randstad Singapore", "value": "/g/11g70b50mr"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "UBS", "value": "/m/031rxp"}, {"text": "Xcellink Pte Ltd", "value": "/g/11c73prcqy"}, {"text": "Alight", "value": "/g/11fj9r012s"}, {"text": "CBRE", "value": "/m/090r7m"}, {"text": "CYBER SECURITY AGENCY OF SINGAPORE", "value": "/g/11b90jy2t9"}, {"text": "Golder", "value": "/m/02qx9bq"}, {"text": "Hitachi Solutions", "value": "/g/121lyvj9"}, {"text": "Horangi", "value": "/g/11fm41wdh3"}, {"text": "IBM", "value": "/m/03sc8"}, {"text": "LINKBYNET", "value": "/g/11f00s44gb"}, {"text": "Marsh & McLennan", "value": "/m/053rw"}, {"text": "Mott MacDonald", "value": "/m/043l4j"}, {"text": "NTT", "value": "/m/05mybp8"}, {"text": "Quinnox Solutions", "value": "/g/11g70dtdgg"}, {"text": "SAP", "value": "/m/01pf4l"}, {"text": "Techcom Solutions Pte Ltd", "value": "/g/11c73vztx3"}, {"text": "Timeo-Performance", "value": "/g/11c73zg8s5"}, {"text": "TraceLink", "value": "/g/11c73g93qt"}, {"text": "Turner & Townsend", "value": "/m/0cfy6xp"}, {"text": "Thatz", "value": "/g/11dxpx4g1l"}]}]}