{"search_metadata": {"id": "60827b74654a8c3a444eb078", "status": "Success", "json_endpoint": "https://serpapi.com/searches/586417950c22518f/60827b74654a8c3a444eb078.json", "created_at": "2021-04-23 07:47:00 UTC", "processed_at": "2021-04-23 07:47:00 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28programmer%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=200", "raw_html_file": "https://serpapi.com/searches/586417950c22518f/60827b74654a8c3a444eb078.html", "total_time_taken": 2.28}, "search_parameters": {"q": "(programmer) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "200"}, "jobs_results": [{"title": "SENIOR SOFTWARE ENGINEER (FULL STACK)", "company_name": "Collins Aerospace", "location": "Singapore", "via": "via Collins Aerospace", "description": "Date Posted:\n2021-01-28-08:00\n\nCountry:\nSingapore\n\nLocation:\n39 Changi North Crescent, Singapore\n\nPosition Title:\n\nSenior Software Engineer (Full Stack Developer – Java, .Net)\n\nPosition Grade:\n\nP3/ P4\n\nDepartment:\n\nInnovation Hub Singapore\n\nReview by\n\nBonar Asido Sihombing\n\nJob Summary\n\n(Description of general\n\npurpose of the job)\n\nWe are looking for a highly skilled application programmer who is comfortable with both front and back end programming. Full Stack Developers are responsible for designing the application architecture, exploring best fit technology, developing the front end and back end components, and ensuring the applications performance, among other duties.\n\nFull Stack Developers will be required to see out a project from conception to final product, as a sole contributor, or part of a developer team, that requiring good organizational skills and attention to detail. This role will also be responsible for the integration with different application frameworks and... platforms within the organization’s Industry 4.0 digital solution ecosystem, as well as supporting exploration of new technology and innovation solution.\n\nRoles and\n\nResponsibilities\n\n(Essential roles, responsibilities an d activities a candidate can expect to assume in this\n\nposition)\n• Works with application development team, business unit process experts, and outsource technology partner to design and develop software applications.\n• Works with application development team, business unit process experts, and outsource technology partner to design and develop software applications.\n• Evaluate and implement best fit frameworks and integrated development environment required to provide required development infrastructure\n• Provide expertise to identify and translate system requirements into software design artefacts.\n• Creates architecture designs (at conceptual and logical level) of large and complex systems in the enterprise with the aim to make the systems sustainable and future-proof after they have been realized\n• Ensure the efficiency, security, and support of the organization's goals in the solution.\n• Create methods for compliance architecture, such as data storage, metadata management, and change control.\n• Synchronize IT systems in development plan with business needs\n• Develop well designed, efficient, testable and high-quality code\n• Develop front end application architecture - UI.\n• Develop back end applications.\n• Setting up apps servers and databases for functionality.\n• Ensure applications performance (responsiveness) and friendliness - UX.\n• Seeing through a project from conception to finished product.\n• Design and develop APIs.\n\nCompetencies\n\n(Essential competencies\n\nrequired for this position)\n\nSelection at least 3 and max 5 Rank by importance (1 being most important)\n\nType of Competencies\n\nRank\n\nAdaptability\n\n2\n\nAnalytical Skills\n\n4\n\nBusiness Judgment\n\nCommunication\n\n3\n\nCustomer Focus\n\nDeveloping Talent\n\nFocus on Results\n\n1\n\nForward Thinking\n\nListening\n\nStrategic Leadership\n\nTeamwork\n\nDimension and\n\nScope\n\n(Describe how the\n\nposition fits into the organization as a whole as well as the level of\n\naccountability)\n\nSupervisory responsibility: (if any)\n\nNo\n\nBudgetary Responsibility: Yes / No Yes\n\nOther financial metrics impacted by this position (eg. Revenue, bookings, etc) No\n\nQualification and\n\nEducation\n\nRequirements\n\n(Education and Work experience that a candidate should have when applying for position)\n\nMinimum Education required (specific field or equivalent):\n• Degree in Computer Science/ Computer Engineering/Information technology.\n• A passion for Enterprise systems integration, sustainability and future-proof\n\nMinimum years of experience in role:\n• Minimum 4 years of working experience in full software development lifecycle\n• Extensive practical Enterprise Architecture experience, certified with a recognised EA framework, e.g. TOGAF\n• Experience within Solution Design & Architecture\n• Experience with Software Development Project Management\n• Experience on Secure Software Development, secure code quality control, and application and system integration vulnerability assessment.\n• Experience with Application Development and Software Assurance in a highly regulated industry\n• Robust knowledge within Security Architecture\n• Experience working within mobile, cloud and infrastructure solutions environments\n• Proficiency with server side languages such as .Net, Node JS, Java, PHP, Python, etc.\n• Proficiency with database technology such as Ms SQL, Oracle, MySQL and MongoDB.\n• Proficiency with fundamental front end languages such as HTML, CSS and JavaScript (e.g Angular JS, React and Amber).\n• Experience with mobile apps development\n• Experience with Cloud services and cloud API services (Google Cloud, Azure, Amazon)\n• Strong communication and interpersonal skills.\n• Great individual performer as well as contributor in a team\n• Good problem solving skills.\n\nPreferred Skills (if any):\n• Demonstrated Excellent level of analytical ability, communication and interpersonal skills required to build relationships with team members to solve problems and resolve issues.\n• Experiences in full software development lifecycle\n• Extensive practical Enterprise Architecture experience, certified with a recognised EA framework, e.g. TOGAF\n• Experience within Solution Design & Architecture\n\nGeneral role in supporting ACE, EH&S, Ethics &\n\nCompliance and\n\nQuality initiatives\n\nACE:\n• Support the Continuous Improvement programs and ACE activities within the company\n• Minimum ACE Associate certification under ACP\n\nEH&S:\n• Support and participate in the EH&S programs and activities within the company\n• Report all incidents (injuries, illnesses, near misses, spills etc), hazardous conditions, and emergencies to his/her supervisor\n• Responsible for performing a risk assessment of work activities, taking corrective and preventive actions\n• Comply with EH&S regulations/policies/programs/rules and use Personal Protective Equipment (PPE)\n• Participate in audits and inspections as and when required\n• Attend EH&S training programs and takes personal responsibility for safety\n\nEthics & Compliance:\n• Understand and carry out work performance in compliance with the UTC Code of Ethics, its Supplements and governing policies and the International Trade Policies and Procedures\n\nQuality:\n• Provide a quality product/service that satisfies our customers’ needs and expectations the first time, every time\n• Emphasize a total quality management process which provides accuracy, and strict compliance with agency regulations and customer requirements, giving the highest degree of confidence; understanding that meeting the requirements of the next employee in the work flow process is just as important as meeting the needs of external customer.\n\nOthers\n\nThis job description is not necessarily a complete list of all job functions, requirements or working conditions. The Company reserves the right to modify essential job functions, job roles & responsibilities and job qualification at any time.\n\nRaytheon Technologies is An Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status, age or any other federally protected class.\n\nPrivacy Policy and Terms:\n\nClick on this link to read the Policy and Terms", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTRU5JT1IgU09GVFdBUkUgRU5HSU5FRVIgKEZVTEwgU1RBQ0spIiwiY29tcGFueV9uYW1lIjoiQ29sbGlucyBBZXJvc3BhY2UiLCJjb21wYW55X21pZCI6Ii9tLzBrdjYxeTEiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiI4WU44RmVLUDZyQ21ja3dHQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdllCQ3JjQlFVNVZYMDV4VWkxUlVFdG9OekF0TTB4YU1WOUdSa1IwUldKZlRISmlOVmRoUlZSVVVYZFVMVGhmTXpOS00xbFdhSFJvU1UxSWIzZDFja2R1TW01UWJIRk9OR05IVms5WlMyNXlOVWMxZVY5VVlsRjRhSFYyWlVKbGJHRlZUblV5YVVSdVZHdE1SMHhGVUVaSVgyUnVURTV1VlhWUVJVcFZORzB6TVhkeVl5MXJhMWx6VHpGM1FuQXhXakZSTmxSdGVGVklVR1poTUdjd2NHOXBZMTh4TlVKbWJYUjRaMjFIYm1kUE5WcHFVRmRMYlZwSFJGcEZFaFprV0hWRFdVMXFiRWc0VTBkelVWZFBlbTlpVVVOM0dpSkJUMDFaVW5kRFUzVjZhVzB3Um5SSlluTTFYMDVmTlRRMlQycHRjMlpOT0RKMyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzciLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQ29sbGlucyBBZXJvc3BhY2UiLCJsaW5rIjoiaHR0cHM6Ly9qb2JzLmNvbGxpbnNhZXJvc3BhY2UuY29tL2pvYi9zaW5nYXBvcmUvc2VuaW9yLXNvZnR3YXJlLWVuZ2luZWVyLWZ1bGwtc3RhY2svMTczOC8xODgyNTE2OT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "CNC Programmer (BB-B8FAF)", "company_name": "SnapHunt Pte Ltd", "location": " (+1 other)", "via": "via BeBee", "description": "Join a precision engineering solutions providerA chance to accelerate your careerSupervise and oversee the automation & programming teamOur client is a leading provider of precision engineering solutions and they build products that cater to specific needs and enhance the general manufacturing process.The JobYou will be responsible for :Using robotics/automation to develop new programming processesImplementing robotics process and liaising with production unit to ensure full understanding of future robotics processGenerating relevant programmes and selecting appropriate tools to ensure smooth manufacturing of productsAnalysing and monitoring production output and machining issues as well as conducting test runs to ensure efficiency in machining processProviding relevant inputs for manufacturing processPlanning, designing and installing relevant programmes to support production operationsMonitoring and controlling any changes that is made to the existing programmesAssisting in... overseeing progress of production teamThe ProfileYou have a Trade Certification with at least 5 years of working experience in the Precision Engineering field.You have an understanding of the production procedure and tools, ideally within the Engineering Field.You have a working knowledge of Unigraphic.You possess leadership skills with experience managing a teamYou are performance driven and thrive in fast-paced environments.Ref: 20918086", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDTkMgUHJvZ3JhbW1lciAoQkItQjhGQUYpIiwiY29tcGFueV9uYW1lIjoiU25hcEh1bnQgUHRlIEx0ZCIsImNvbXBhbnlfbWlkIjoiL2cvMTFjNzR0NjF3OCIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IkJydGZZMHU1X2FBalNtUklBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2WUJDcmNCUVU1VlgwNXhVazkwZUVGV1dVcFZNRTVZWVZaWVVuZENOMjVSWmsxYU9YQkNibUpoVDBWdWFuVjJkRzlRYjAwM1pHeEZObUZQYm1FM1NFRnNWazFWTmtOVFZqUkhUbTg0VURjM2MwaG1SVEZrUWpkSlRGQjRTbE5UWTFrd1ZIWmZXa2xRWnpSQ01FSnRiRFY1YlROVVRVcEtlR1o0YzJNemFWaFBTV1pXUkU4dGFFMDViVTlXZHkxWFVsOXpTMkpZWW5SQmVXb3RURXhxUTNseGNsWjRkak5aTFVnMVQwWmFUWGx1ZDNNNWJWZFJPRWxpY0d4SkVoWmtXSFZEV1UxcWJFZzRVMGR6VVZkUGVtOWlVVU4zR2lKQlQwMVpVbmREYldNeldXVndVRE4yUlV4ME1VaG9Vell3Tm1OUVZHdDRUMHhSIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMTUiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQmVCZWUiLCJsaW5rIjoiaHR0cHM6Ly9zZy5iZWJlZS5jb20vam9iLzIwMjEwNDE3LWZiY2I4ZGMxZDkzZmY1YzFhMDQzZDJlYTdjMmI4ZmFmP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Online Programmer", "company_name": "Ubisoft", "location": "Singapore", "via": "via Bayt.com", "description": "Company Description\n\nCREATOR OF WORLDS\n\nUbisoft’s 19,000 team members, working across more than 40 locations around the world, are bound by a common mission to enrich players’ lives with original and memorable gaming experiences. Their dedication and talent has brought to life many acclaimed franchises such as Assassin’s Creed, Far Cry, Watch Dogs, Just Dance, Rainbow Six, and many more to come. Ubisoft is an equal opportunity employer that believes diverse backgrounds and perspectives are key to creating worlds where both players and teams can thrive and express themselves. If you are excited about solving game-changing challenges, cutting edge technologies and pushing the boundaries of entertainment, we invite you to join our journey and help us Create the unknown.\n\nOpening its doors in July 2008, Ubisoft Singapore features the largest AAA studio in Southeast Asia and is home to a culture that celebrates serious fun and diversity. As proud innovators of naval gameplay and water... technology, we’re super excited to be the lead studio in bringing a brand-new IP to you – Skull and Bones! Our other notable works include every Assassin’s Creed game since Assassin’s Creed II, with our latest Viking adventure being Assassin’s Creed Valhalla.\n\nJob Description\n\nYOUR DAILY ADVENTURE\n\nOnline Programmers are key in delivering the enjoyable connected experience players have come to expect from the Ubisoft gaming experience. Online Programmers face multiple challenges in developing, integrating and maintaining high-end service platforms. They are critical in ensuring that millions of players are simultaneously immersed in a seamless and rich game experience they can enjoy with their friends regardless of where and how they connect.\n\nWHAT YOU WILL DO\n• Assist with investigation, design and implementation of class-leading online features.\n• Implement practical and timely solutions that meet the game design and technical requirements.\n• Integrate online solutions into the game client.\n• Implement code that is modular, self-contained, and defensive and observes the technical constraints on the system.\n• Work as a key part of an agile development team, taking responsibility for organizing and planning their own work.\n• Help define good programming practices and coding standards, and ensure they are enforced within the engineering team through regular peer code reviews.\n• Identify potential issues within the code, raise flags and propose solutions.\n• Keeps abreast of changes related to online gaming within the industry.\n\nQualifications\n\nWHAT YOU BRING\n\nBachelor degree in Engineering or Computer Science and have at least 3 years of professional experience\n• Excellent general programming skills and ideally solid knowledge of C++ and/or C#\n• Knowledge about server and database programming, distributed systems and online services\n• Experiences working with Docker and Kubernetes\n• Interest in the video game market and online gaming\n\nAdditional Information\n\nWHAT YOU’LL ENJOY\n\nCheck out our list of perks and benefits here: https://www.ubisoftsingapore.com/\n\nJOIN THE SQUAD\n\nMaking games is serious business, but it's very important for us to have fun while creating awesome worlds so that we can convey the same sense of joy to millions of players in the world.\n\nCome on board and experience #LifeAtUbi for yourself, we are always on the lookout for talents who thrive in bringing their A-game to work. If this sounds like you, shoot us your resume, portfolio, and anything else to show that you’re serious about fun!\n\nWe are an equal-opportunity employer and value diversity at our company. We do not discriminate on the basis of race, ethnicity, religion, gender, sexual orientation, age or disability status", "extensions": ["24 days ago", "Full–time"], "detected_extensions": {"posted_at": "24 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJPbmxpbmUgUHJvZ3JhbW1lciIsImNvbXBhbnlfbmFtZSI6IlViaXNvZnQiLCJjb21wYW55X21pZCI6Ii9tLzAycWR5aiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IlBqRFQwQUwtM2FaaFV5WXhBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVzc0JDb3dCUVU1VlgwNXhVbXhhYkd4SVZGRkJSM2x1WkZWdFgwNVFaMkpFTmtkb1VHbHZZbTFhU2tOSFdIRkdlVmhUUm0wMldsSlpNelZ5TW5KWVNFTjNhVmwyY21WVFUxZFlVSGxQV0RCdFREQTNhamx0VEVSVU4wSmlhMlpZVkdaNFNqaHFNV0o1VkRkV1ZuVjVkVEJvUjAwNE9HaFJibmRwYzFwUFMzUTVSRTloUkVwbFEyWm9WWGQxUTA5UVQxb1NGbVJZZFVOWlRXcHNTRGhUUjNOUlYwOTZiMkpSUTNjYUlrRlBUVmxTZDBGV1VpMVphalpIYlZKNVJXTlJkeTFFU0RSalFWbEVXV052V2xFIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMjIiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQmF5dC5jb20iLCJsaW5rIjoiaHR0cHM6Ly93d3cuYmF5dC5jb20vZW4vc2luZ2Fwb3JlL2pvYnMvb25saW5lLXByb2dyYW1tZXItNTkyOTMxNDEvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Senior Software Engineer", "company_name": "Talent Trader Group Pte. Ltd.", "location": "Singapore", "via": "via Monster Singapore", "description": "Responsibilities:\n• Assist in the development of the system functionality and specific system solution to meet the business requirement under application group.\n• Provide application support, maintenance and enhancement of existing systems\n• Involve in system analysis, design and development of application improvement or changes.\n• Develop and design technologies\n\nRequirements:\n• Diploma/ Degree in Computer Science, IT or equivalent\n• Knowledge in software development life cycle (SDLC)\n• Proficient in SQL queries, Python, C++\n• Knowlege in low power wireless networking technologies, IOT frameworks and IOT cloud architecture\n\nInterested candidates who wish to apply for the advertised position, please email us an updated copy of your resume.\nEmail Address : [Confidential Information]\n\nEA License No.: 13C6305\nRegistration ID : R1770654\n\nFor candidate who applied for the advertised position is deemed to have consented to us that we may collect, use or disclose your personal information... for purpose in connection with the services provided by us", "extensions": ["7 days ago", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgRW5naW5lZXIiLCJjb21wYW55X25hbWUiOiJUYWxlbnQgVHJhZGVyIEdyb3VwIFB0ZS4gTHRkLiIsImNvbXBhbnlfbWlkIjoiL2cvMTFkeHBtbGM1YiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IkVDTHJuU3hISmkyakQzWFVBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVvc0NDc3dCUVU1VlgwNXhVVWxaWmpsZlJFWTBiRnBSWTB0TmIzUm1SM3AzYVRCT2Eyb3pWRTExZDFCV1psOTZja3BvWWt0V1MzcDJVRWRmUTJkR1JWcEpZMGxDVVZaeFltZzRTRGhyWjNoTFREUkdPWGgzUVVJMU0yZE5UbVpRYzIxS1pIRjVWMlowTm1OT1ZWSnhTVU5pV0Y5eVdWRlZNMGhCUjJoT1duZEVNMGRSU1U5Vk15MWlhazVoUkVaQ01FRm5SRVZrTFRWRGFFVjNiMEUzTjJFMk0xcFBhVVIwU1hodldqWk9hWGRhUjNocWFtNDVSWEpPUjFKNFMxQjRNa05aU0RCaGJVSlJWVXRUU1hWSGFtTm9FaFprV0hWRFdVMXFiRWc0VTBkelVWZFBlbTlpVVVOM0dpSkJUMDFaVW5kQ0xWUjZVa0kzZFhaWlJ6WlZWMk54UjFGbmFsQkJjRE5rTURKbiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzI5IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1vbnN0ZXIgU2luZ2Fwb3JlIiwibGluayI6Imh0dHBzOi8vd3d3Lm1vbnN0ZXIuY29tLnNnL2FtcC9qb2ItdmFjYW5jeS1zZW5pb3Itc29mdHdhcmUtZW5naW5lZXItdGFsZW50LXRyYWRlci1ncm91cC1wdGUtbHRkLXNpbmdhcG9yZS0yNzc0ODEyOS5odG1sP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Software Developer (.net)", "company_name": "Capita Singapore", "location": "Singapore (+1 other)", "via": "via Jobs", "description": "MAIN RESPONSIBILITIES Proposed creative ways to configuration our product software to meet customer’s needs Be the Subject Matter Expert for all software enquiries and support queries from other departments Attend software demo and discussion with customers for software deployment and integration. Proposed creative ways to configuration our product software to meet customer’s needs Support software vender to integrate with Glory products. Conduct integration training and support troubleshooting. Plan and train relevant parties on software related matters Perform comprehensive testing to validate software performance and stability before installation Perform system (hardware and software) integration certification test on our partners’ application before actual deployment Perform field installation and training when necessary Attend / analyze and troubleshoot field problems that are related to software Create / update documents such as software configuration, test data, user guides and... etc New requirement drafting based on Customers’ needs Modify software script / tools to meet customers’ need or enhance internal operations JOB REQUIREMENTS Experienced in Hands on Programming in C#.NET Windows Platform API Integration Willing to learn mindset Team Player and Good Communicator Involvement of the role would be 60% Development, 20% Support 20% Demo", "extensions": ["23 days ago", "$40M a month", "Contractor"], "detected_extensions": {"posted_at": "23 days ago", "schedule_type": "Contractor", "salary": "$40M a month"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBEZXZlbG9wZXIgKC5uZXQpIiwiY29tcGFueV9uYW1lIjoiQ2FwaXRhIFNpbmdhcG9yZSIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiRFczRTZPVFJ0c0NTb3E4LUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIiwibGluayI6Imh0dHBzOi8vc2cuZmlkYW50by5jb20vam9icy9qb2Itb3BlbmluZy9pbmZvcm1hdGlvbi10ZWNobm9sb2d5LXByb2plY3QtbWFuYWdlcnMvc29mdHdhcmUtZGV2ZWxvcGVyLW5ldC1jZW50cmFsLXNpbmdhcG9yZS0yNjQwMjE0OTA/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Senior/Executive Engineer (Software Developer-Test Automation)", "company_name": "Land Transport Authority", "location": "Singapore", "via": "via WhatJobs", "description": "Categories: InfoComm, Technology, New Media Communications\n\nYou will be involved in the design and to develop hardware and software solutions to automate the end-to-end testing activities of the integrated e-payment system. You will develop solutions to test the various fare system projects from the planning stage right up to project completion. With a good understanding of the testing lifecycle, you will identify feasible test cases and automate them such as to be able to effectively optimize the test efforts and improve on test efficiency.\n\nTo carry out your job role well, you need to be interested and constantly kept up to date with evolving technologies and innovate feasible solutions to continually improve on test effectiveness and efficiency through automation. This job would also appeal to someone who is inquisitive to find out the root causes of defects and to devise automation means to mitigate the recurrence of similar defects through regression testing. As part of the job... you will be able to learn about the various ticketing systems deployed at Singapore’s public transport and provide valuable contribution to ensure the smooth rollout of new systems and enhancements.\n\nRequirements:\n\n• Tertiary qualification in Information Technology or Engineering\n• At least 3 years of relevant experience in developing solutions involving devices (UI-based or embedded) and/or back-office systems using J2EE, .NET and Selenium/Robot frameworks;\n• Savviness with technology and daring to try innovative automation solutions;\n• Good written and verbal communication skills;\n• Able to work well both independently as well as in a team;\n• Certification in software development or automation frameworks would be an advantage;\n• Experience in micro-payments or Automatic Fare Collection systems using Smart Cards would be an advantage", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IvRXhlY3V0aXZlIEVuZ2luZWVyIChTb2Z0d2FyZSBEZXZlbG9wZXItVGVzdCBBdXRvbWF0aW9uKSIsImNvbXBhbnlfbmFtZSI6IkxhbmQgVHJhbnNwb3J0IEF1dGhvcml0eSIsImNvbXBhbnlfbWlkIjoiL20vMDI4MXNyIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiX3BBeWR3ZVV3Z2t3LWQ5WUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRW9zQ0Nzd0JRVTVWWDA1eFZESllibGhzTTNOWGVrRnNOVzB4UWs5MlkyWndVMWw2UVZwRlNIRnFPVzR4UkdsU1QxWXhUelZXYWt4TVlUQjBjVzU2Y25kWll6ZHZRMFpvUmpKa2FFcElSVUZSWjNaT1kwRk9OR3h5WlV4Sk5sVlBhR1Z4Y1ZGdmRsUm5MVzE0VUhsM2RGRm1PUzEyWkVGTWVEUmlkbDlSU1UxWk1EWTNRMGhDZFVSZlRuTXhiaTFUVUhSMWRIbE5OMlEwU1daM1MyaGFRMjFqVVUxNVdFaDFTeTFpTjA4M2FXNWhYMVp1TjFOa1QxRlZkMTlDYW5vMUxXeHhRVk5FWVdSMGNGTXpiWE5JVGtaRUVoWmtXSFZEV1UxcWJFZzRVMGR6VVZkUGVtOWlVVU4zR2lKQlQwMVpVbmRDY2tVNGVHWkhObUZqVDJONVUyMDJVMXBDYUVGM2N6TlRZVVJuIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNDAiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gV2hhdEpvYnMiLCJsaW5rIjoiaHR0cHM6Ly9lbi1zZy53aGF0am9icy5jb20vam9iLWZvci1TZW5pb3ItRXhlY3V0aXZlLUVuZ2luZWVyLVNvZnR3YXJlLURldmVsb3Blci1UZXN0LUF1dG9tYXRpb24taW4tU2luZ2Fwb3JlLWNvb3AxNzU4MDk4Mj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Fullstack Java Software Engineer (based in Vietnam)", "company_name": "Zühlke Group", "location": "Singapore", "via": "via LinkedIn", "description": "The Zuhlke Opportunity.\nThrive in an environment where you can express your passion and enthusiasm for software development and be inspired by your colleagues’ enthusiasm. As a Fullstack Software Engineer based in our Vietnam office, you will cooperate with interdisciplinary teams in projects and experience how technology and team spirit unite to create innovative solutions. Your job will involve working closely with clients to develop, test, and ship software that meets their needs. You will efficiently and competently solve complex software challenges. Continuous further development and active knowledge exchange mean that you will be working with the latest methods and tools to stay up to date with the latest trends.\n\nAs part of the pioneer team, you will have the unique opportunity to be onboarded by our high performing Singapore-based colleagues for three months. On top of experiencing the sights and sounds of another vibrant city, you will also receive mentorship within teams who... have diverse technical knowledge. And of course, this is only to kickstart your long term success upon your return home.\n\nOur reputation is fundamental to our business, so our culture emphasizes quality, reliability, and respect. We value learning new technologies and skills thus, we invest in a generous local training budget to attend conferences, participate in certified courses, and our annual technical camp is a lot of fun.\n\nYour Talent.\n• You have a degree in computer science or an equivalent related field (bachelor's/master's).\n• You have proven expertise in the JavaScript ecosystem and used frameworks like ReactJS and Angular where you apply your in-depth knowledge in JavaScript and/or TypeScript.\n• You leverage your development workflow with tools like npm, webpack and Node.js.\n• You have multiple years of experience with state-of-the-art web architectures and enjoy developing modern web applications.\n• You value high quality code and you want to satisfy your thirst for knowledge of the latest technologies every day.\n• You have professional experience in Java stack of between 3-7 years.\n• You have a thorough knowledge of build and deployment of Full Stack applications, including practice with automated testing frameworks like Selenium, Jasmine or similar tools.\n• Having hands-on experience in native Android or iOS development is a plus\n• You have professional experience working in an agile development environment. Ideally, you are a certified Scrum developer or master.\n• You have strong communication skills and like making decisions.\n\nLife at Zuhlke.\nAt Zuhlke Asia you get the best of both worlds. You can leverage on the benefits of working in a stable, large, highly reputable company with a long history of success while enjoying the freedom and autonomy of working in a fast-growing start-up environment. Zuhlke offers you networked innovation power and the security of a long-running, international success story. We support your personal development with specialised workshops and active knowledge sharing among experts", "extensions": ["23 hours ago", "Full–time"], "detected_extensions": {"posted_at": "23 hours ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJGdWxsc3RhY2sgSmF2YSBTb2Z0d2FyZSBFbmdpbmVlciAoYmFzZWQgaW4gVmlldG5hbSkiLCJjb21wYW55X25hbWUiOiJaw7xobGtlIEdyb3VwIiwiY29tcGFueV9taWQiOiIvZy8xaGhfcmcyMTYiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiIwN09iTUdhS0s4aDJoa2g2QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VkZwSFNIaEphVVZDVVdsWFV6SXpXSEJaZVdJeGFrMWhRbkZoWTJacVRsTmZhM05LVW1Kd2RWTlNObFF3U200d1VESTVObTVhY21kNE0zYzNiVmh6UlhkU1RIQlJhRWxWTFdKcFgxQklkMUE1YzBKVmRrUnRZbU5vYm0xM2VIRlpNRjlrVVU0d2QwVnJja1ZYYVVnMGVGOTZPVTlNUWpGcVNVeGhhREIyTlVWbU5raFZUMGhoUTNka2IzaFhXR00yZVVac1UzSmZNbWh6WVRGQkVoWmtXSFZEV1UxcWJFZzRVMGR6VVZkUGVtOWlVVU4zR2lKQlQwMVpVbmREVVRZNVFVWjZUMnhGUTBsRFltSlhSVmhQU0hvMk5VeFRSa2QzIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNDciLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGlua2VkSW4iLCJsaW5rIjoiaHR0cHM6Ly9zZy5saW5rZWRpbi5jb20vam9icy92aWV3L2Z1bGxzdGFjay1qYXZhLXNvZnR3YXJlLWVuZ2luZWVyLWJhc2VkLWluLXZpZXRuYW0tYXQteiVDMyVCQ2hsa2UtZ3JvdXAtMjQ3MjE0NTA5NT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior Software Engineer (Cloud Security)", "company_name": "Horangi Cyber Security", "location": "Singapore", "via": "via NodeFlair", "description": "Horangi is looking for experienced senior software engineers to join our team. You will be part of an engineering team building scalable systems capable of detecting real time threats and adversarial activities within our customer’s cloud environment.\n\nYour team will build a rule-based and behavior-based analysis engine that monitors real-time events and log streams from multiple cloud providers to identify real threats faster, thereby reducing time to remediation. You will plan detection based on real-world data and well-understood scenarios, and codify threat detection rules that can be rapidly deployed.\n\nWhat you can look forward to\n• You will design and develop stream processing infrastructure and application\n• You will build a scalable system that can handle events at scale\n• You will work with AWS technologies like Amazon Kinesis, DynamoDB and EventBridge\n• You will help build a framework for our threat detection engine and a repeatable process of building rules\n• You will learn... to encode security insights into automation\n• You will continuously monitor system health and optimize performance\n\nHow to Succeed\n• You have at least 5 years experience in backend engineering. Python is your lingua franca\n• You are experienced with designing and building products with AWS and serverless technologies\n• You are a strong communicator. Explaining complex technical concepts to non-technical audiences is not a problem for you\n• You possess strong computer science fundamentals: data structures distributed systems, networking and graph algorithms\n• You write high quality code, that can be safely co-authored in a fast grown organization\n• You have a good understanding of how various cloud services work across all major cloud providers. Relevant cloud certification is a strong bonus\n• You have a bachelor’s degree in Computer Science, Engineering or related field, or equivalent training, fellowship, or work experience\n\nBonus points if you have\n• You have experience building real-time stream processing systems\n• You have prior experience in cybersecurity or intelligence fields\n• You have knowledge of CI/CD & DevOps tools\n• Contributed to open source projects\n\nAt Horangi, we pride ourselves as Cloud Security Champions in Asia backed by a team of global cybersecurity experts and trusted by Industry Leaders such as Gojek, MoneySmart, PropertyGuru and Tiket.com.\n\nWe built our Cloud Security product using AWS technology and cloud best practices to provide the security, performance and reliability of our platform as we ship rapidly in our agile software development. We adopt an event-driven architecture and embrace serverless technologies that are backed with 100% infrastructure as code. We build our app using reliable tools and frameworks that our team knows and trusts, including Python, Docker, TypeScript, React and GraphQL.\n\nHorangi has a positive, diverse, and supportive culture, and we look for people who are curious, inventive, and work to be a little better every single day. We work in a fast-paced, dynamic and get-things-done culture. Horangi is always looking to hire collaborative, humble and highly driven individuals who want to make a difference.\n\nJoin us at Horangi, and do the best work of your life. Welcome", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgRW5naW5lZXIgKENsb3VkIFNlY3VyaXR5KSIsImNvbXBhbnlfbmFtZSI6IkhvcmFuZ2kgQ3liZXIgU2VjdXJpdHkiLCJjb21wYW55X21pZCI6Ii9nLzExZm00MXdkaDMiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiIwX0xzRWpfc1pwWlg5aXRMQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFb3NDQ3N3QlFVNVZYMDV4VkhBeE5tdEVlbnBMU0V0MlpuSlJUREpSUzJwUU1EUlNkVlpGWjFsaFdXUTJVVnB3VTFJMWVqVm1NazVxWVRKT01rNWhVVmhUYWs1S1dtWktOR0ZqYVVoR1puSm9jazF6ZEZobWVtWTRNblJMUkZsM1ZYazROams0VjJ0V1VVNVNOM0IyVFZWdFFtbDVaV1UyWlRWMVRFaFhVbGhLWDBaQldrSlZNVmMzZUZBMFVtZDFjRTUzTldzeFNFWTJZMDFtTlVOb1VsQkZlRmxmYjNOVVpVOVRWMDgwUlRacGJVNUhlaTFvTld4M2JERjJkVXBTVGxaTExWSm5VVlJVVWpNelYxbENTekJVRWhaa1dIVkRXVTFxYkVnNFUwZHpVVmRQZW05aVVVTjNHaUpCVDAxWlVuZENaMFZUZGtsVlpVcE5VM2RTZDBadVprRjVkUzB4TnpRNFJGbDMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY181NSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBOb2RlRmxhaXIiLCJsaW5rIjoiaHR0cHM6Ly93d3cubm9kZWZsYWlyLmNvbS9qb2JzL2xpc3RpbmdzLzkyMTc/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Junior Software Developer", "company_name": "Credit Agricole Group", "location": "Singapore", "via": "via Bayt.com", "description": "Summary of the position:\n\nThis position if Java developer requires a sound technical knowledge to ensure that the delivered solution answers the business’ needs – enhancements, maintenance tasks and bug fixes intended for the application servicing Distressed Assets and Operation business line.\n\nThe team is in-charge of the support and maintenance of back-office applications which process and manage client information - mandates, signatories, client relationships, and payment requests\n\nMain responsibilities:\n\n· Study, evaluate, understand and provide feedback on functional specifications.\n· Develop solutions following defined standards and high quality\n· Provide detailed estimation for development of solutions\n· Implement solutions using TDD\n· Perform non-functional testing\n· Prepare documentation for design and implementation\n· Enable and support functional and user acceptance testing\n· Join and lead workshops to prepare detailed estimates\n· Join and lead grooming sessions to prepare... technical design\n· Ensure Code quality, delivery and maintenance\n· Perform Unitary test and Code/Peer Reviews\n· Support Production – L3\n· Handle Technical test activities (including Integration\n\nMain duties details:\n\nTechnical Analysis, Development and Testing\n\n· Good understanding of JavaEE\n\n· Good knowledge on Spring framework.\n\n· Good understanding on Relational Database Systems, JPA, Hibernate\n\n· Good knowledge of Web technologies such as Aurelia/Durandal, Angular, Bootstrap, JSPM, Gulp, Knockout, jQuery\n\n· Good knowledge on automated unit testing (Junit, TestNG).\n\n· Good knowledge on several Application Servers (Websphere, JBoss, Tomcat)\n\n· Strong knowledge on source code management system such as SVN, Git.\n\n· Practical knowledge on Jenkins, Maven/Gradle, Sonar, Cucumber\n\n· Strong knowledge on JMS systems such as WebSphere MQ, HornetQ.\n\n· Must have hands-on experience on using Aurelia, Angular, Bootstrap, Spring technologies\n\n· Knowledge on cloud-based solutions such as DockerAssist Technical Leader\n\nMaintenance and support\n\n· Provide L3 technical support for applications under responsibility\n\n· Analyse and resolve tickets raised by end-users in production environment\n\n· Analyse enhancement requests as prioritized by business for live applications under responsibility and provide IT inputs\n\n· Build and repository management\n\n· Release Deployment management\n\n· Assist L1/L2 support to improve support quality over time\n\nTechnical Documentation\n\n· Prepare and maintain technical documents (PAD, GAD, Code Checklist and other standard documents)\n\nCo-ordination and communication\n· Coordinate with other developers and business analysts as needed to deliver solutions on time and with good quality", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJKdW5pb3IgU29mdHdhcmUgRGV2ZWxvcGVyIiwiY29tcGFueV9uYW1lIjoiQ3JlZGl0IEFncmljb2xlIEdyb3VwIiwiY29tcGFueV9taWQiOiIvbS8wMjh2Ym0iLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJfWWZPekxKTmY0TGpPN0dSQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdllCQ3JjQlFVNVZYMDV4VkdsWVFYSnlaa2h6ZUhwWlpVMTBWVk5tUTBoSVFrdFJjWFJDTVd0a1ZWWlBlbGR2V2s5MFdVcGFOMnhJYmpVeVVWZHJWelZ2TlRSa0xVNVNUVU5MVGpZd1QwMWtNRE5FV2pWSWVuVktkRk5hUW5ndFVWVm1RMHB5YTA5bU1rbGlWR1p0VUZCNGFXaGFYMVJxUzBwRFJucDNTekJ1YzFCT1owZzNiMkl5TlZCdlNVVTVTRFpQYlRWR1ptaGFhbnBYU1ROaVJXcDRWbnBGTmxob0xYcFhUM1JrTVRoRmRYRjNiR2hyWlRVMlFtdFJFaFprV0hWRFdVMXFiRWc0VTBkelVWZFBlbTlpVVVOM0dpSkJUMDFaVW5kQlVtZGthSEpvZUZCbVgwbFpUMW95Y0dOMlJuRXdkRUpRWkRkUiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzYzIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJheXQuY29tIiwibGluayI6Imh0dHBzOi8vd3d3LmJheXQuY29tL2VuL3NpbmdhcG9yZS9qb2JzL2p1bmlvci1zb2Z0d2FyZS1kZXZlbG9wZXItNTkwMzg2NDcvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Software Developer - Node-js - PHP", "company_name": "Dindinn Corporation Pte. Ltd.", "location": "Singapore (+1 other)", "via": "via Monster Singapore", "description": "We are inviting individuals who share our values of constantly doing things that make sense, willing to face challenges, making necessary sacrifices, and adapt to changes.\n\nYou will work directly with the product owner of a cool startup and a team of software developers. You will be a team player to embrace challenges and innovate new solutions with cutting edge technologies. You will be an expert knowledge source to implement required Amazon Web Services (AWS).\n\nTherefore, a commitment to overcome difficult challenges, create sophisticated designs and produce quality products with precision are must have qualities.\n\nPrimary Responsibilities\n• Assist the team to support and maintain all software components.\n• Strong team player who is able to communicate well, and excited to learn new technologies in a fast phase environment.\n• Assist AWS infrastructure in running the required services.\n• Have strong knowledge in Linux systems and server management.\n• Able to efficiently configure AWS... Elastic Beanstalk , Cloudwatch , IAM , Route 53,Elasticache, Redis and others.\n• Adopts best development practices and modern tools such as Git, VM, Vagrant, Docker and etc.\n• Ensure good documentation practices.\n• Benchmark and optimize performance as necessary.\n• Promote infrastructure best practices like security, release management, monitoring.\n• Design infrastructure that is resilient, secured and build highly available platform.\n• Facilitate the building and releasing of features by the engineering team.\n• Build tools and processes that increase the productivity of other engineers and ensure an efficient release pipeline.\n• Promote and nurture good team practices such as TDD, system security, code reviews, and pair programming.\n• Bring vision to the team in the form of new technology recommendations, ideas and approaches.\n• Provide Level 3 Support and create/integrate support infrastructure.\n• Automate deployments according to best practices.\n• Provide quality codes by testing and using up to date technologies.\n• Learn needed technologies and assist team when in need of assistance.\n\nSecondary Responsibilities\n• Strong Node.js knowledge (mandatory).\n• Able to understand PHP and codes designed in Laravel framework.\n• Able to smoothly integrate third party services when needed, and handle curl operations.\n• Understands how the following technologies work: JWT, SSL, WebSocket.\n• Able to implement database solutions for new or existing features using MySQL / PostgreSQL (mandatory)\n• Have expert knowledge on caching using Redis or Memcached.\n• Strong in JavaScript language and experienced in non-relational database is a plus.\n• Assist a team of software engineers when additional help is required.\n\nQualifications\n• At least 3-5 years of experience in web development is preferred", "extensions": ["24 days ago", "Full–time"], "detected_extensions": {"posted_at": "24 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBEZXZlbG9wZXIgLSBOb2RlLWpzIC0gUEhQIiwiY29tcGFueV9uYW1lIjoiRGluZGlubiBDb3Jwb3JhdGlvbiBQdGUuIEx0ZC4iLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Ii1tbmlHbnd4UEZ4YzVwaHZBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTW9uc3RlciBTaW5nYXBvcmUiLCJsaW5rIjoiaHR0cHM6Ly93d3cubW9uc3Rlci5jb20uc2cvYW1wL2pvYi12YWNhbmN5LXNvZnR3YXJlLWRldmVsb3Blci1ub2RlLWpzLXBocC1kaW5kaW5uLWNvcnBvcmF0aW9uLXB0ZS1sdGQtc2luZ2Fwb3JlLTI3NTIxNTY5Lmh0bWw/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}], "chips": [{"type": "Title", "param": "job_family_1", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Software engineer", "value": "software engineer"}, {"text": "Programmer", "value": "programmer"}, {"text": "Programmer analyst", "value": "programmer analyst"}, {"text": "Senior", "value": "senior"}, {"text": "Cnc programmer", "value": "cnc programmer"}, {"text": "Engineer", "value": "engineer"}, {"text": "Analyst programmer", "value": "analyst programmer"}, {"text": "Science", "value": "science"}, {"text": "Software programmer", "value": "software programmer"}, {"text": "Assistant", "value": "assistant"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Electrical engineer", "value": "electrical engineer"}, {"text": "Executive", "value": "executive"}, {"text": "Java engineer", "value": "java engineer"}, {"text": "Java programmer", "value": "java programmer"}, {"text": "Lecturer", "value": "lecturer"}, {"text": "Manager", "value": "manager"}, {"text": "Operator", "value": "operator"}, {"text": "Project officer", "value": "project officer"}, {"text": "Senior programmer", "value": "senior programmer"}, {"text": "Senior system", "value": "senior system"}, {"text": "Senior technical", "value": "senior technical"}, {"text": "Sr. programmer", "value": "sr. programmer"}, {"text": "Systems programmer", "value": "systems programmer"}, {"text": "Technical", "value": "technical"}, {"text": "Trainee", "value": "trainee"}, {"text": "Trainer", "value": "trainer"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Mining", "value": "/business/naics2007/21"}, {"text": "Rental", "value": "/business/naics2007/532"}, {"text": "Wholesale", "value": "/business/naics2007/42"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "EPAM", "value": "/m/0dlnrc"}, {"text": "VISA", "value": "/m/01kqjn"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "Citi bank", "value": "/m/01dfb6"}, {"text": "TikTok", "value": "/g/11fy265933"}, {"text": "Ubisoft", "value": "/m/02qdyj"}, {"text": "Cognizant", "value": "/m/03bf9h"}, {"text": "HCL SINGAPORE PTE. LTD.", "value": "/g/11fy25ngsv"}, {"text": "Oracle", "value": "/m/05njw"}, {"text": "Credit Agricole Group", "value": "/m/028vbm"}, {"text": "Mindteck (India) Limited", "value": "/m/0cqj8w1"}, {"text": "Nanyang Technological University", "value": "/m/0l49k"}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Zühlke Group", "value": "/g/1hh_rg216"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Avensys Consulting Pte Ltd", "value": "/g/11g7022gjf"}, {"text": "Avnet", "value": "/m/0c8xmc"}, {"text": "GlobalTix Pte Ltd", "value": "/g/11dxpqdhrf"}, {"text": "Government Technology Agency", "value": "/g/11gh0528nq"}, {"text": "J.P.Morgan", "value": "/m/01hlwv"}, {"text": "Optimum Solutions (Singapore) Pte Ltd", "value": "/g/11g70hkrbx"}, {"text": "Razer Inc.", "value": "/m/075hc0"}, {"text": "Realtek Malaysia", "value": "/m/05wrm7"}, {"text": "Realtek Singapore Private Limited", "value": "/g/11g9n26trs"}, {"text": "Success Human Resource Centre Pte Ltd", "value": "/g/11g709_209"}, {"text": "TECHNOPALS PTE. LTD.", "value": "/g/11dxpvkynp"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "UST", "value": "/m/08kb8g"}, {"text": "UrbanFox", "value": "/g/11ghs7y0w6"}, {"text": "Adecco GS", "value": "/m/08gz46"}, {"text": "Alphanova Pte. Ltd.", "value": "/g/11f8h_czps"}, {"text": "BioMind", "value": "/g/11dymfr2l6"}, {"text": "Biqmind", "value": "/g/11g21fzhrb"}, {"text": "BitTitan", "value": "/g/11dxpksv89"}]}]}