{"search_metadata": {"id": "6082792bf55d777a2c912bec", "status": "Success", "json_endpoint": "https://serpapi.com/searches/b96cfa3548ecad69/6082792bf55d777a2c912bec.json", "created_at": "2021-04-23 07:37:15 UTC", "processed_at": "2021-04-23 07:37:16 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28solution+architect%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=30", "raw_html_file": "https://serpapi.com/searches/b96cfa3548ecad69/6082792bf55d777a2c912bec.html", "total_time_taken": 1.3}, "search_parameters": {"q": "(solution architect) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "30"}, "jobs_results": [{"title": "Solution Architect | Financial Services | Digital", "company_name": "Publicis Sapient", "location": "Singapore (+1 other)", "via": "via NodeFlair", "description": "Publicis Sapient is looking for a results-driven Solution Architect with a specialization in cloud-native computing platform consulting, design, and delivery experience to deliver & support digital business transformation in Financial Services. You will provide technical consultancy from pre-sales to project delivery, including systems architecture, translation of business requirements and software platform guidance. You’ll assess, identify and implement disruptive technology applications that will take established companies into the future.\n\nYour Impact\n• Lead the architecture definition and technical consultation of digital transformation programs\n• Work with different technology vendors to build a best of breed technology architecture\n• Collaborate with business development and client engagement teams to assist in pre-sales opportunities like RFP responses, proposal delivery, architecture assessments and technical qualifications\n• Advise our clients and partners to optimize the... recommended product suite in defining, building and deploying end to end solutions\n• Lead the translation of the client’s business requirements into systems design\n• Drive the development of prototypes and technology demonstrators within microservice architecture, cloud-native solutions\n• Estimate time frames, quality and quantity of resources required to successfully implement projects and help develop project plans and risk assessment\n• Establish measurable criteria concerning deliverability, performance, maintenance, design and costs\n\nQualifications\nYour Skills & Experience\n• 7+ years of technical experience within architecture development, integration of backend systems and development\n• In-depth knowledge of integration approaches and architectures\n• Deep understanding of the cloud-native solution, microservices-architecture and at least one or more of the following areas: API orchestration architecture, mobile-front end architecture, customer engagement architecture\n• Ability to bridge the gap between technology and business\n• Self-driven, curious and a fast-learner, and able to take responsibility for personal growth and development\n• Possess strong problem-solving skills and ability to prioritize and manage multiple tasks\n• Strong interpersonal and stakeholder management skills with the ability to coordinate between technical and business teams\n• Knowledge of backend technologies – Node.JS, Java, SQL, or NoSQL, Spring boot, Kafka, Spark, Kong\n• Relevant experience in systems integration and development, package analysis and implementation\n• Experience designing cloud solutions - IaaS / PaaS offerings (e.g. AWS, Google Cloud, Microsoft Azure)\n• Excellent collaborator, working in fully agile product or software delivery teams regionally\n• Excellent written and verbal communication skills, as well as presentation skills\n• Bachelor’s Degree in Computer Science (or related field)\n\nSet Yourself Apart With\n• In-depth knowledge of digital banking architectures and architecture approaches\n• Experience with at least one digital banking implementation or comes from the digital or architecture function of a bank or digital bank\n• Learning mindset with developer or architect certification is a plus\n• Consulting experience and a passion for technology\n\nAdditional Information\n\nBenefits of Working Here\n• Career growth and training opportunities\n• A collaborative, agile and diverse regional team\n• Comprehensive insurance and medical benefits\n• “Plugged” into a global organization with a start-up mindset", "extensions": ["29 days ago", "Full–time"], "detected_extensions": {"posted_at": "29 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2x1dGlvbiBBcmNoaXRlY3QgfCBGaW5hbmNpYWwgU2VydmljZXMgfCBEaWdpdGFsIiwiY29tcGFueV9uYW1lIjoiUHVibGljaXMgU2FwaWVudCIsImNvbXBhbnlfbWlkIjoiL20vMDJteWpwIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiMjJVbUJyUllya1lpMlN1SEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZZQkNyY0JRVTVWWDA1eFUxbFpUR1JpVlRocmFGQk9VWFl4ZW5sb1owUkRVMjg0YWpWVWJWbFlNVVJ2ZVhCSGFuSlNSMnAyWWtoR2NYWmhVWE5SY0hKYWRVNDVlWFpTZW10RGVFaEZhMWR4WTA1MlVDMUJUM04yYW13MWNFcFFhRTh4YzNodlNXbDVZM0ZJYlhSb04wWnlWV0U0U0ROMVNraEpSeTFtY0d4M1ZqUTFiREJMWnpWa1QwdDNhMVJDY3pOdlRUVnZNM2hZTWt4UVlXTkpkMWd4V21GckxVbG1NbFpHVVRSZlZqTklkV1JLZEdSNlNGSktUWGRSRWhaTVNHMURXVXhxVVVVMVN6UjBRV0Z1Y0ZwZlVVRm5HaUpCVDAxWlVuZEJValZOWkc5cmVHNUhjR3RNZURad2VVOUdXWEJwUWtONlJqTkIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY183IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE5vZGVGbGFpciIsImxpbmsiOiJodHRwczovL3d3dy5ub2RlZmxhaXIuY29tL2pvYnMvbGlzdGluZ3MvMTAwNjI/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Consultant/Senior Consultant/ Solution Architect- GCP Architect", "company_name": "HCL SINGAPORE PTE. LTD.", "location": "Singapore (+1 other)", "via": "via LinkedIn", "description": "Provide expert solutions in field of Big Data and cloud (AWS, GCP), GCP Must have\n• Develop the security features on different data platforms with Engineering of Big Data Analytics Technology.\n• Provide engineering solution and framework to support the security and access in different environments and data-driven business activities at large scale\n• Ensuring good quality and performance of product features\n• Automate everything to remove the toil\n• Prepare and produce releases of software components\n• Experimentation to assess new solution paths of enabling data access in various environments\n• Collaborative work with remote teams\n\nRequirements\n• Bachelor’s degree in Software Engineering or Computer Science\n• Expertise in GCP Certification required\n• 4-8 years of proven software development experience with Big Data full stack engineering\n• Collaborate with cross-functional teams to define, design, and ship new features\n• Design and build applications using Java and related technology... on GCP\n• Solid hands-on experience of Java/J2EE and framework such as Spring, Kubernetes, etc.\n• Knowledge of build tools Maven, Gradle and DevOps environment using tools such as Git (Bitbucket), Continuous Integration (Jenkins) and Continuous Deployment (Fastlane)\n• Code with security and data protection\n• Experience in problem solving and root-cause analysis on any errors during the process of Software Development Life Cycle (SDLC) implementation and provide audit and compliance support when required\n• Experience in automated testing is an advantage\n• Good to have working with code quality tools such as Sonar, Fortify or NexusIQ will be advantageous\n• Tech stack: GCP, Hadoop, Spark, Hive, Java, Spring, Spring boot, Spring Webservices, Spring Cloud, Spark, Microservices, Kafka, Jenkins, git, Maven, Kubernetes, OpenShift, AWS and Linux\n• Professional, adaptable and innovative with a focus on delivery\n• Self-motivated team player who demonstrates initiative and flexibility\n• Customer-focused attitude, sensitivity to the changing and often escalated needs of the business\n• Strong organizational skills, with the ability to handle and prioritize multiple tasks", "extensions": ["13 hours ago", "Full–time"], "detected_extensions": {"posted_at": "13 hours ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDb25zdWx0YW50L1NlbmlvciBDb25zdWx0YW50LyBTb2x1dGlvbiBBcmNoaXRlY3QtIEdDUCBBcmNoaXRlY3QiLCJjb21wYW55X25hbWUiOiJIQ0wgU0lOR0FQT1JFIFBURS4gTFRELiIsImNvbXBhbnlfbWlkIjoiL2cvMTFmeTI1bmdzdiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6InNLT0s3cjZkZU1nWmdLVmNBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVvc0NDc3dCUVU1VlgwNXhVMkUyWDJ4ZmJFWlVOa3BNY2xaTWFIWk1WVFZPU2xSU1lXRmZNakpKYkdVeWNHaHhiV1Y2VkdsM2R6VTRlVkV3WW5oblF6VjVORzQwWHpadVVscFlaa3Q0UlhoamVWSlRkVnBrYlRoaGJITk1iV0phTkRaQlgyNWlZV3hFUTNGaU4zSjBZa3hVV214V1RFWnJVWFIyTldwcGNVNWxiMXBuU1dsTU1WUnlUV3RsUTBkTmJuWTBUVEk0ZEhwNlUxOWljbkp0YmsxWmVteDZSR3ROWW1ONGRWbEJkekZzYWtWaVUxUmtVRGQ2VkhoU2RUTk5UbTlGVXpGR2NYWmFlWFZxYUZVNVpEVnVFaFpNU0cxRFdVeHFVVVUxU3pSMFFXRnVjRnBmVVVGbkdpSkJUMDFaVW5kRFdFZHhaek5KTFU5YVRuWnpVVWR0UjFGMmRqbFFOM1U1TkZsMyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzE0IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExpbmtlZEluIiwibGluayI6Imh0dHBzOi8vc2cubGlua2VkaW4uY29tL2pvYnMvdmlldy9jb25zdWx0YW50LXNlbmlvci1jb25zdWx0YW50LXNvbHV0aW9uLWFyY2hpdGVjdC1nY3AtYXJjaGl0ZWN0LWF0LWhjbC1zaW5nYXBvcmUtcHRlLWx0ZC0yNTE1NzkwMDU4P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Cloud Architect", "company_name": "Techgig", "location": "Singapore", "via": "via Mendeley", "description": "About Job\n\nCTC Undisclosed Job Location Singapore Experience 10 - 13 yrs\n\nDescription\n\nView Full Description\nIntroduction\nAs an IBM Application Architect, you directly help clients transform their business and solve complex problems. You will define the scope and vision for projects that deliver customized solutions using your knowledge of IBM platforms. You are a technical leader, serving as a liaison among business partners, technical resources, and project stakeholders.\n\nYour Role and Responsibilities\nIBM is the largest technology and consulting employer in the world, serving clients in 170 countries. In this new era of Cognitive Business, IBM is helping to reshape industries by bringing together our expertise in Cloud, Analytics, Security, Mobile, and the Internet of Things. We are changing how we create. How we collaborate. How we analyse. How we engage. IBM is a leader in this global transformation.\n\nIBM Global Business Services (GBS) is a team of business, strategy and... technology consultants enabling enterprises to make smarter decisions and providing unparalleled client and consumer experiences in cognitive, data analytics, cloud technology and mobile app development. With global reach, outcome-focused methodologies and deep industry expertise, IBM GBS empowers clients to digitally reinvent their business and get the competitive edge. We outthink ordinary. Discover what you can do at IBM. We are hiring.\n\nAs Cloud Solution Architect you will be the Senior Technical leader and subject matter expert engaged in the solutioning and delivery of our Cloud-related projects . Working in partnership with the wider project team, you will be responsible for the overall technology strategy and architecture/design for Cloud solutions for your clients. You will also be responsible for the direction of technical resources on the project to implement solutions for your clients.\n\nYou will also work on optimising resources to meet project constraints taking into account such concerns as Client budget, skills availability, and complexity of the project/solution. From a client perspective you will deal with teams focused on designing, migrating, building, managing, transforming and expanding their services on Cloud. Your role will also be to build trusted and ongoing relationships with key buyers and influencers including cloud developers, CIO's/CTO's and technology procurement.\n\nKey Skills and Experience required:\nExpert level skills in Cloud to guide technical client side architects on Cloud strategy and solution best practices. This will aid clients to identify high value Cloud entry points (e.g. new applications, transforming existing applications or simply starting a Cloud sandbox that IBM helps them operationalize.)\nExpert level skills in guiding IBM project technical resources to design and implement Cloud solutions\nExpert level skill in Cloud technology, including hybrid Cloud solutions\nDeep understanding of Public Cloud as a PaaS offering including automation of deployment and containers.\nDeep understanding of the current state of the art for infrastructure automation, continuous integration/deployment, SQL/NoSQL/NewSQL, networking, and cloud-based delivery models.\nDeep experience in designing and implementing highly available and scalable Cloud solutions\nExperienced skill level with contemporary engagement methods, including Proof of Concepts.\nExperienced level skills with Design Thinking, Agile and DevOps methods.\nBusiness case modelling skills (i.e. Cloud total cost of Ownership vs Business as Usual purchases)\nAbility to position Cloud technology against industry solution requirements.\nSignificant experience within any of the major Industries or Government\nExcellent verbal, written and presentation skills;\nSelf-driven, detail-orientation\nAbility to work collaboratively and productively with globally dispersed teams\nAbility to manage ambiguity, yet producing tangible results\nAbility to effectively manage challenging situations without loss of focus when under pressure\n\nDesired:\nAt least 3 year experience architecting and solutioning leveraging a major Cloud platform.\n10 years of experience in infrastructure / development consulting\nCloud Certification\nCloud native solutions\nTOGAF or equivalent architecture certification\nProficiency in programming languages such as: Shell, Java, C, Ruby, Python\nKnowledge of networking systems and architectures (DNS, TCP, UDP etc)\nLead first of a kind and complex solution development\nProvide end-to-end solution approach guidance and coaching.\nCreate and use intellectual capital to solve diverse client issues in an innovative way\nProvide training to technical solutioners and sales teams\nProficiency in Infrastructure as Code implementation\nExperience in Network and Infrastructure migration to Cloud", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDbG91ZCBBcmNoaXRlY3QiLCJjb21wYW55X25hbWUiOiJUZWNoZ2lnIiwiY29tcGFueV9taWQiOiIvZy8xMWM3M2Z4Z3d0IiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoid0oxY3RueU82dldHOGt0RUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFUwUllVMUpqU21SWGFVZE9TV0ZUU2pkRFRtSXdTakZ6TjBOU01EbEhjMlpmTlRKNVNuTmZPSFZ0VWpndFRtSnRWV1pOTVVnNGRsSm5VamxLV1VGUGNsRk1OM2RQVG1zdFltWmljbDlPTkd4NGFrMVJUMDF4UzNwMmRVTnlZbXRtVkZKR1dsbFRWa0ZsU0hKcWFVUkVXbkZoVW5SdWExRm5WekJZWmpKNlJYbDFjRkEwTUdKbU1EZEdkRUpWY0hOc1lrOW9UWGRvTVhoelIySlJFaFpNU0cxRFdVeHFVVVUxU3pSMFFXRnVjRnBmVVVGbkdpSkJUMDFaVW5kQlNXeDJkMU5UVEc5RldHVlpXVkV3UVZKcFExVllPRXBNU25kQiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzIxIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1lbmRlbGV5IiwibGluayI6Imh0dHBzOi8vd3d3Lm1lbmRlbGV5LmNvbS9jYXJlZXJzL2pvYi9jbG91ZC1hcmNoaXRlY3QtMjM3NTY2OD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Cloud Solution Architect", "company_name": "S & I SYSTEMS PTE LTD", "location": "Singapore (+1 other)", "via": "via Learn4Good", "description": "Location: null\nRoles &\n\nResponsibilities\n\nThe Job Develop solutions for large and complex sales opportunities. Develops and delivers outstanding Solution presentations and demonstrations. Leads all aspects of the technical sales process and advises internal and external stakeholders on overall architect solutions. Facilitation of client understanding through presentations demonstrations and benchmarks. Leading contributor individually and as a team member, providing direction and mentoring to others. Create presentations and design architecture diagrams to present solutions to customer executives.\n\nUtilizing specialist knowledge of business processes and the Microsoft product suite (including related applications and technologies) to support the development and expansion of the solution footprint to meet clients’ articulated business strategy. Formulation of high-quality bids and proposals Scoping the client solution to enable accurate estimation of the effort. Providing knowledge... transfer to the delivery teams to ensure a smooth handover from sales to delivery.\n\nIdentifying, planning, and implementing Microservices architecture to web-based application Designing web based, scalable applications for enterprise usage. Work hands-on with development team to prepare/review detailed Technical Design, do code reviews, ensure delivery as per committed estimates with high Quality. Presenting at client events/Microsoft conferences The Profile\n\nTechnical:\n\nDeep understanding of cloud computing technologies, business drivers, and emerging computing trends Skilled Solution Architect with expertise in .NET, Micro-services, Azure, Containerization, overall Technology & Architecture. Understanding of common database technologies such as SQL Database/Server, Mongo\n\nDB, NoSQL database Deep technical experience in enterprise mobile, identity, and access control, & security solutions Working knowledge with AGILE development, SCRUM and Application Lifecycle Management (ALM) with One or more of the following programming languages:\n\nPower\n\nShell, Bash, .NET, C++, Java, JSON, PHP, Perl, Python, Ruby on Rails, HTML, CSS, JavaScript, Responsive Web Design Solid understanding of modern DevOps practices, including automation, continuous delivery, continuous deployment, and continuous integration methodologies. Deep understanding of cloud-based Business Continuity and Disaster Recovery practices Understanding of cloud governance technologies for cost management and control Non-Technical:\n\nBuilding customer/partner relationships Proven track record of building deep technical relationships with senior executives Proven track record of driving decisions collaboratively, resolving conflicts & ensuring follow-through. Presentation skills with a high degree of comfort with both large and small audiences Prior work experience in a consulting/architecture position within a software & services company Problem-solving mentality leveraging internal and/or external resources.\n\nExceptional verbal and written communication. Qualifications: 7+ years of architecture experience in infrastructure, databases, or application development 5+ years of design, implementation, or consulting experience with distributed applications 3+ years relevant experience in technology/software sales, pre-sales, or consulting Bachelor's Degree or equivalent experience Microsoft Azure Certification such as Azure Solutions Architect Expert, MCSA Cloud Platform AWS Certifications is a plus\n\nTell employers what skills you have.NETAgile Application Development\n\nALMC Programming\n\nCloud Computing\n\nEnterprise Architecture\n\nEnterprise Software\n\nIntegration\n\nPerlPre-sales\n\nPython\n\nScrum\n\nSOASoftware Development\n\nSolution Architecture\n\nWindows Azuresales opportunities\n\nDevelop solutionssolution presentation", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDbG91ZCBTb2x1dGlvbiBBcmNoaXRlY3QiLCJjb21wYW55X25hbWUiOiJTIFx1MDAyNiBJIFNZU1RFTVMgUFRFIExURCIsImNvbXBhbnlfbWlkIjoiL2cvMTFmeTIxODl6ZCIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Ik5nbkExMWVTNk1BSXJpNV9BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2WUJDcmNCUVU1VlgwNXhVMWRSZWpabk9HTnlOaTFTYTFBeGRtOVZRVzF0YW1kbWRIWmFSMDUxWm1Sd01VTnNRWEE1WmxaTVdXOTJiRXRqWW5oRFZXcE1TWEZHZVdoeFRtVkNSWEZ1T1hwWVEyRnhXR1ZOZEZCMlFWVXhWMlp5TnpsSGVESnRTekpNTm1kQlRtWjJkME5SYWt4dlQxRkZWVmxzWlZrM2VsVk9MVk4wTlhabFVtbFBiek01VVVGcmF6WldWWEZRVnpWRWNXUldlbEZqVTJGYVNtOUpaa0pNZWpSSU4yaDNTRlJMTVcxcmIwUmtVVjlGUlRrNEVoWk1TRzFEV1V4cVVVVTFTelIwUVdGdWNGcGZVVUZuR2lKQlQwMVpVbmRETTBKdFRGVTRWR0ZvYmtrM1JrcHZSVkV5WVZkcWEwdFBNREZCIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMjkiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGVhcm40R29vZCIsImxpbmsiOiJodHRwczovL3d3dy5sZWFybjRnb29kLmNvbS9qb2JzL3NpbmdhcG9yZS9zb2Z0d2FyZV9kZXZlbG9wbWVudC8yNzEzNjE0OTgvZS8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Solution Architect", "company_name": "Sciente Inc", "location": "Singapore", "via": "via SCIENTE", "description": "Our client in a well-established industry is seeking a Solution Architect to be responsible for the end-to-end architecture of their enterprise systems in their digital transformation journey.\n\nMandatory Skill(s)\n• Degree in Information Technology, Computer Engineering, Computer Science or Information System;\n• Minimum 7 years of design and implementation experience with distributed applications with at least 3 years in a hands-on tech lead/system architect capacity;\n• Experience in designing and developing enterprise-scale applications;\n• Proficient in conceptualizing and deriving common architectural designs across multiple services;\n• Good understanding of .Net/J2EE development, Service Oriented Architectures, Web Services, RESTful APIs and public websites;\n• Solid Agile development experience and has experience architecting large enterprise-wide systems;\n• Confident, good team player and strong stakeholder management experience;\n• Interest in exploring new cutting edge... technologies;\n• Strong business acumen, strategic and analytical thinking, root cause analysis, and creative problem solving ability.\n\nDesirable Skill(s)\n• TOGAF certified;\n• PMP-Certified.\n\nResponsibilities\n• Provide technical expertise and establish the direction for the IT architecture, standards and design for the organisation;\n• Create, evaluate and implement high-level plans and design proposals for IT solutions;\n• Translate business requirements into application architectural specifications;\n• Evaluate and recommend the use of leading edge technologies and methods, considering their practicality, technical limitations and criticality;\n• Design the architecture blueprint of the organisation's architecture set-up using multiple models;\n• Manage technical project delivery - perform code reviews and ensure performance tuning and scalability;\n• Document all solution architecture design and analysis work;\n• Comprehend business strategies and requirements and develop necessary designs and plans to ensure projects and solutions satisfy those needs;\n• Act as a consultant to IT team and business users in the development of enterprise business architecture vision and related IT solutions to ensure that the business and IT are in alignment;\n• Subject Matter Expert in addressing problems related to system and application design, performance, integration, security;\n• Developing and communicating guiding principles, governance structures related to the selection of architectural components;\n• Manage the technical project delivery; perform code reviews and collaborate with vendors to resolve technical challenges;\n• Guide application operations, propose new solution methodologies and mentor the team raising the collective technical competencies", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2x1dGlvbiBBcmNoaXRlY3QiLCJjb21wYW55X25hbWUiOiJTY2llbnRlIEluYyIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiQlE3QUYzLTZPQmFhbmI4MUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBTQ0lFTlRFIiwibGluayI6Imh0dHBzOi8vd3d3LnNjaWVudGUuY29tL3NjaWVudGUtaW5jL3RlY2hub2xvZ3ktam9icy81Nzc1L3NvbHV0aW9uLWFyY2hpdGVjdC8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Security & Solution Architect", "company_name": "Propine", "location": "Singapore (+1 other)", "via": "via Glints", "description": "Work should be challenging.\n\nYour work should challenge the status quo.\n\nYou should be defining the future, not being dependent on it.\n\nYou don’t like it safe, and prefer to swim in the deep end, while figuring things out.\n\nYou want to be an avant-garde.\n\nIf this resonates with you, then you’ll fit right in here at Propine.\n\nPropine is re-inventing capital markets using blockchain technology. We’ve worked with Monetary Authority of Singapore (MAS), to become the first licensed custodian for digital assets in the world.\n\nWe are re-imagining the issuance and life cycle management of capital market products like equities, debt, structured products and funds using blockchain technology, to reduce friction and increasing value accrual for both issuers and investors.\n\nThis role requires you to have a ‘do-whatever-it-takes’ mindset and learn to operate just outside the limit of your comfort zone. If this excites you, but also makes you a bit nervous, then you might be the right... fit.\n\nSeniority: Mid-senior/Senior Level\n\nPosition Title: Security and Solutions Architect\n\nJob description:\n\nYou will partner closely with the leadership team and work directly with the CEO, CTO and Engineering Team. You will communicate and collaborate across the organization to:\n\nDrive Secure Development And Deployment\n\n· Design and deploy overall solution architecture to meet current and future business and product requirements\n\n· Align technical architecture and roadmap with product design\n\n· Work with engineering teams to clarify and enforce rigorous adherence to architecture(s) and technical standards\n\n· Drive Software Engineering security best practices, including specifications, hands on coding, and partnering with engineering teams for delivering a secure product on deployment\n\n· Participate in processes such as security reviews on source code to identify and assess risks to the infrastructure, services and customers; provide recommendations for risk reduction to leadership and engineering teams\n\n· Develop our DevSecOps practices to deliver a secure and reliable production platform\n\nManage and Monitor Security Threats\n\n· Develop our risk program, perform IT security risk assessments and implement ways to minimise threats\n\n· Monitor security vulnerabilities and hacking threats in network and host systems\n\n· Implement an effective process for monitoring and reporting of security incidents\n\n· Develop strategies and oversee the investigation of reported security breaches\n\n· Perform penetration and network vulnerability tests on internal infrastructure\n\n· Recommend solutions on discovered vulnerabilities\n\nAudits and Compliance\n\n· Conduct internal security audits encompassing smart contracts, web applications, infrastructure and endpoints.\n\n· Keep abreast of the trends affecting crytocurrency security\n\n· Liaise with external auditors to enable certification audits\n\n· Comply with cyber and tech compliance requirements as they are released from time to time by MAS\n\n· Support Compliance and Legal with enterprise standards, processes and policies\n\nRequirements for this role\n\n· A degree in Computer Science, Software Engineering, Cyber Security or related fields\n\n· Minimum 5 years of experience in software engineering\n\n· Minimum 3 years of experience in a cybersecurity role\n\n· Fluent and written English is a must\n\n· Foundation level blockchain/cryptocurrency knowledge is a must\n\n· Ability to understand business requirements and translate them into technical solutions\n\n· Possess excellent communication, sharp analytical abilities with proven design skills, able to think critically of the current system in terms of growth and stability.\n\n· Experience with modern web technologies and AWS stack\n\n· Experience with cloud platform security including IAM, WAF, KMS, logging/monitoring.\n\n· Knowledge of CI/CD practices and security challenges\n\n· Experience across common vulnerability classes\n\n· Experience with SAST/DAST tools\n\n· Experience in implementing an automated security scanning solution for cloud infrastructure as code, experience using Sentinel policies for Terraform is preferred.\n\n· Demonstrable understanding of modern architectural patterns such as containerization, microservices, API gateways etc.;\n\n· Experience with prioritising and managing security risks\n\n· Good knowledge of operational security best practices\n\n· Must have experience developing security plans, processes and controls\n\n· Experience conducting internal audits, reviewing security reports and prioritising remediation activities\n\n· Proven ability to communicate across roles to drive security mindset across company\n\n· Experience interfacing with external auditors\n\n· Experience working with startups preferred", "extensions": ["25 days ago", "Full–time"], "detected_extensions": {"posted_at": "25 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZWN1cml0eSBcdTAwMjYgU29sdXRpb24gQXJjaGl0ZWN0IiwiY29tcGFueV9uYW1lIjoiUHJvcGluZSIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiaGZkb0twUE9nY2FMeXJCRUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBHbGludHMiLCJsaW5rIjoiaHR0cHM6Ly9nbGludHMuY29tL29wcG9ydHVuaXRpZXMvam9icy9zZWN1cml0eS1hbmQtc29sdXRpb24tYXJjaGl0ZWN0LzEyYmNmMGY0LWVhNzUtNGQ2Mi04M2E1LTJkZTNhOTlmYmNkOT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Solutions Architect", "company_name": "None", "location": "Singapore", "via": "via Jobs", "description": "Job Description: Analyze business requirements to develop technical Avaya solutions and their framework. Design, test, and inspect customer data and voice topology, help with modeling, analysis, and planning. Works with appropriate parties to resolve discrepancies between proposed systems and enterprise quality and security standards. Manage multiple technology vendors providing integration analysis and test plans. Provides technical and administrative direction for personnel performing software development tasks, makes recommendations, and approval of major systems installations. Designs and develops computer software possessing a wide range of capabilities, including numerous engineering, business, and records management functions. Write functional and non-functional requirements/specifications documents Determine the production direction and roadmaps. Acts as an advisor and proposes changes to the ETA based on analysis of requirements and new technology This is a regional role so... the candidate must be willing to travel around 30% of employment time. Job Requirements: Minimum Bachelor degree or equivalent Avaya Professional Design Specialist (APDS) or Avaya Certified Solution Specialist (ACSS) certified More than 5 years of Experience in Customer Engagement Solution Architecture. Strong Skills in Applications development mainly within Web communication and customer engagement technology. Require experience in Cognitive simulation applications. Integration of user-facing elements developed by front-end developers with server-side logic. Basic understanding of front-end technologies, such as JavaScript, HTML5, and CSS3 Excellent knowledge of software and application design and architecture Experience with Java SE 7/8 and open-source programming. Experience with Python, with at least a single web framework in-depth knowledge. Experience with Mobile development Excellent knowledge of UML and other modeling methods, TOGAF certified is a Bonus. Basic understanding of front-end technologies, such as JavaScript, HTML5, and CSS3 Good to have 2-3 Avaya or other vendors with communication background, experienced in the techniques that lead to, the production and design of complex Avaya Communication systems. Including, requirements discovery and analysis, formulation of solution context, identification of solution alternatives and their assessment, technology selection, and design configuration. Strong communications and relationship skills. Skilled in socializing technical architectures among customer organization within Business, IT and operations Strong negotiation and problem-solving skills are also required. The architect must work with the PMO team to make decisions in a timely manner to keep projects on track. Knowledge of all phases of software development including design, coding, testing, debugging, implementation, and support of large-scale, business-centric and process-based applications. Design with the Ability to integrate multiple data sources and databases into one system for advanced analytics and data management solutions. Knowledge with different database technology MSQL, PostgreSQL, Oracle, Cache. Knowledge with Customer engagement technology via Voice, Video communications and data network requirements for optimal performance, Data Network & Video certificates are a bonus Job Description: Analyze business requirements to develop technical Avaya solutions and their framework. Design, test, and inspect customer data and voice topology, help with modeling, analy Skills: Analysis, Cloud Computing, Data, Enterprise Architecture, Enterprise Software, Integration, Job Descriptions, Microsoft Works, Scheduling, Soa, Software Development, Solution Architecture Experience: 5.00-7.00 Years", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2x1dGlvbnMgQXJjaGl0ZWN0IiwiY29tcGFueV9uYW1lIjoiTm9uZSIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiYVNXRHpsOXFmb1VXcHY1b0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIiwibGluayI6Imh0dHBzOi8vc2cuZmlkYW50by5jb20vam9icy9qb2Itb3BlbmluZy9pbmZvcm1hdGlvbi10ZWNobm9sb2d5LXByb2plY3QtbWFuYWdlcnMvc29sdXRpb25zLWFyY2hpdGVjdC0yNzU3Mjg1MDA/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Solutions Architect Manager, Google Cloud", "company_name": "Google", "location": "Singapore", "via": "via Google Careers", "description": "The Google Cloud Platform team helps customers transform and evolve their business through the use of Google’s global network, web-scale data centers and software infrastructure. As part of an entrepreneurial team in this rapidly growing business, you will help shape the future of businesses of all sizes use technology to connect with customers, employees and partners.\n\nIn this role, you will use your knowledge and leadership to manage a team of high performing Solutions Architects who use their skills in product management, industries, software and cloud computing to design solutions and take them to market. You will help drive awareness of our solutions at leading industry conferences and Google events. Your enthusiasm, technical and business depth, and excellent presentation skills will help decision makers understand the benefits of our Google Cloud Platform to drive growth and customer success.\n\nGoogle Cloud helps millions of employees and organizations empower their employees... serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers & developers see the benefits of our technology come to life", "extensions": ["11 days ago", "Full–time"], "detected_extensions": {"posted_at": "11 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2x1dGlvbnMgQXJjaGl0ZWN0IE1hbmFnZXIsIEdvb2dsZSBDbG91ZCIsImNvbXBhbnlfbmFtZSI6Ikdvb2dsZSIsImNvbXBhbnlfbWlkIjoiL20vMDQ1YzdiIiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiRENUZk1fRzNyZXhVdFpQN0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXNzQkNvd0JRVTVWWDA1eFZETlJZa0pUZW00MVQySjNWVmRTYWtKVVlVTlhSbUp6VjJSZmFtZDNUUzFRV25KalRHTlRZWE5NTWpGbWMwWmplbFIxVjJka1NHZzFReTF3VDI1cVNFcGZSR2RmYjFWVGJFMUpMWFpQU1c5cVVVeFNZMnh4WWpZeFdVRkdaRWRTYldwTmIzZDNUMmxMWDFSaFZXVkxSMjlQTlVWVFZHdHNWMjk2WldaRGFXY3liVEZNYTNZU0ZreEliVU5aVEdwUlJUVkxOSFJCWVc1d1dsOVJRV2NhSWtGUFRWbFNkMFJ1Y0c5RFpVWkhSakZzYUZwT1R6RldZMWxYZGxaQ1VHRTRhVkUiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY180OSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBHb29nbGUgQ2FyZWVycyIsImxpbmsiOiJodHRwczovL2NhcmVlcnMuZ29vZ2xlLmNvbS9qb2JzL3Jlc3VsdHMvMTI3MzQ1NTkwNjE1ODQzNTI2LXNvbHV0aW9ucy1hcmNoaXRlY3QtbWFuYWdlci1nb29nbGUtY2xvdWQvP3BhZ2U9MTZcdTAwMjZ1dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "AWS Architect (AP CoC Cloud Advisory)", "company_name": "IBM", "location": "Singapore", "via": "via Laimoon.com", "description": "Introduction\n\nAs an IBM Application Architect, you directly help clients transform their business and solve complex problems. You will define the scope and vision for projects that deliver customized solutions using your knowledge of IBM platforms. You are a technical leader, serving as a liaison among business partners, technical resources, and project stakeholders.\n\nYour Role and Responsibilities\n\nThe AWS Architect is at the leading edge of digital transformation with customers using AWS, helping shape the conversation with senior executives and building / creating new digital transformation opportunities. The role holder will have a real passion for AWS as a technology platform and will have practical hands on experience of designing and delivering enterprise scale solutions for customers using AWS.\n\nThe role holder will be able to lead discussions with customer technical decision makers and translate business requirements into secure, reliable and highly available technology... solutions that deliver real customer value. They will also need to be adept at managing constant business change, rapidly evolving requirements, adjustments in strategic direction, and keeping current on emerging technology solutions.\n\nPrimary Responsibilities:\n• Building deep technical relationships with senior executives and designing innovative solutions for large or highly strategic accounts\n• Technical leadership, design and delivery of enterprise scale solutions that deliver high levels of performance, security, scalability, maintainability and reliability\n• Driving a culture of IP development and reuse\n\nQualifications and Experience\n• 5+ years of leading consultative/complex technical sales and deployment projects, architecture, design and implementation\n• Demonstrated excellence with consulting skills and presenting complex development topics to both business executive and technical personnel\n• Proven track record of building deep technical relationships with senior executives and helping to build innovative cloud solutions in large or highly strategic accounts\n• AWS Solutions Architect – Professional qualification preferred; certification is expected within 12 months of joining\n\nThe role holder is expected to be a subject matter expert in one or more of the following:\n• Cloud infrastructure solutions (i.e. Windows and Linux IaaS, SAP, BCDR, Security, Management, Storage, Networking, OSS, containers and Infra as a code technologies)\n• Cloud application development solutions (e.g. PaaS, Serverless, API Management);\n• Container orchestration (e.g. Kubernetes, Cloud Foundry, EKS);\n• Continuous integration technologies (e.g. Jenkins, Spinnaker, AWS Code* Services, Chef, Puppet);\n• Web application server technologies, cloud application design, software architecture and practices; (design/development/deployment, Agile, SCRUM, ALM)\n• Experience with scalable architectures using AWS API Gateway, API management, serverless technologies, container orchestration (e.g. EKS, Kubernetes, Cloud Foundry etc.), API management, microservice frameworks (AWS Lambda) etc.\n\nRequired Technical and Professional Expertise\n\nAs above\n\nPreferred Technical and Professional Expertise\n\nAs above\n\nAbout Business UnitIBM Services is a team of business, strategy and technology consultants that design, build, and run foundational systems and services that is the backbone of the world's economy. IBM Services partners with the world's leading companies in over 170 countries to build smarter businesses by reimagining and reinventing through technology, with its outcome-focused methodologies, industry-leading portfolio and world class research and operations expertise leading to results-driven innovation and enduring excellence.\n\nYour Life @ IBMWhat matters to you when you’re looking for your next career challenge?\n\nMaybe you want to get involved in work that really changes the world? What about somewhere with incredible and diverse career and development opportunities – where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust – where everyone has a voice? What about all of these? If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible.\n\nImpact. Inclusion. Infinite Experiences. Do your best work ever.\n\nAbout IBMIBM’s greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries.\n\nLocation StatementFor additional information about location requirements, please discuss with the recruiter following submission of your application.\n\nBeing You @ IBMIBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, pregnancy, disability, age, veteran status, or other characteristics. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status", "extensions": ["2 days ago", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBV1MgQXJjaGl0ZWN0IChBUCBDb0MgQ2xvdWQgQWR2aXNvcnkpIiwiY29tcGFueV9uYW1lIjoiSUJNIiwiY29tcGFueV9taWQiOiIvbS8wM3NjOCIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IllfNDlCYno4WGswZ3JXZElBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVzc0JDb3dCUVU1VlgwNXhVbTF5V1ZocVUzTmZOVEJyWjJaUlFsaDNlRTVZU1dJeE1GZDRhMUl3TUZGM1dFRjFSbkJDY3psRlIwMUlkbGRmUm1sT1EybFJhSGxyWmtKRUxXTjVXRE5PWm04MFRXSk5OVWxRZW5kNE0yOTRNbEJTT1daUGNGY3lTbkEyYUZGb0xXcEhWRnBpWlRnMFdFVkZXak5HTFhCc1FWbGtTRGhGVm5Jd2RGWm5OakphUTB0dlRGUVNGa3hJYlVOWlRHcFJSVFZMTkhSQllXNXdXbDlSUVdjYUlrRlBUVmxTZDBORFJreDVYM2x2TkRJeVgxWlRXRmQ0UWpabE9YVk5aa1p5UmxFIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNTciLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGFpbW9vbi5jb20iLCJsaW5rIjoiaHR0cHM6Ly9qb2JzLmxhaW1vb24uY29tL2pvYnMvZXh0ZXJuYWx2aWV3LzI2MTEzMzg0P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Solutions Architect", "company_name": "Joe Booth, Big Cloud", "location": "Singapore", "via": "via Big Cloud", "description": "Are you an expert in Solution Architecture with strong stakeholder management skills?\n\nDo you want to apply your skills and grow within one of the top companies in the world?\n\nOne of the most well-known logistics companies in the world is looking to bring on a Solution Architect. You will lead and guide the infrastructure team, with a strong focus on technical transformation.\n\nYou will also consult other user groups in APAC on solutions through training and helping strategy and business leaders understand, apply, monetize and operationalize existing, new, and emerging technologies.\n\nWhat you need:\n• Bachelor’s degree or equivalent in Computer Science, Computer Engineering, Information Systems, or similar discipline.\n• 5+ years’ experience of development/ architecture experience.\n• Java programming skills.\n• Experience with PHP, open-source technologies.\n• Experience of developing web and ecosystem applications.\n• Cloud experience; ideally Microsoft Azure.\n\nWould be nice:\n• Agile... background.\n• Large-scale software development project experience.\n• TOGAF certification", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2x1dGlvbnMgQXJjaGl0ZWN0IiwiY29tcGFueV9uYW1lIjoiSm9lIEJvb3RoLCBCaWcgQ2xvdWQiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Ik1JTDNtX0FKTm9QUG1JeDdBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQmlnIENsb3VkIiwibGluayI6Imh0dHBzOi8vYmlnY2xvdWQuZ2xvYmFsL2pvYi9zb2x1dGlvbnMtYXJjaGl0ZWN0Lz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}], "chips": [{"type": "Title", "param": "job_family_1", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Solution architect", "value": "solution architect"}, {"text": "Solutions architect", "value": "solutions architect"}, {"text": "Architect", "value": "architect"}, {"text": "Cloud architect", "value": "cloud architect"}, {"text": "Technical architect", "value": "technical architect"}, {"text": "Enterprise architect", "value": "enterprise architect"}, {"text": "Senior", "value": "senior"}, {"text": "Consultant", "value": "consultant"}, {"text": "Financial services", "value": "financial services"}, {"text": "Infrastructure architect", "value": "infrastructure architect"}, {"text": "Manager", "value": "manager"}, {"text": "Application architect", "value": "application architect"}, {"text": "Cloud engineer", "value": "cloud engineer"}, {"text": "It architect", "value": "it architect"}, {"text": "Lead architect", "value": "lead architect"}, {"text": "Network architect", "value": "network architect"}, {"text": "Security architect", "value": "security architect"}, {"text": "Senior architect", "value": "senior architect"}, {"text": "Systems engineer", "value": "systems engineer"}, {"text": "Associate director", "value": "associate director"}, {"text": "Deputy", "value": "deputy"}, {"text": "Engineers", "value": "engineers"}, {"text": "Head", "value": "head"}, {"text": "Infrastructure", "value": "infrastructure"}, {"text": "Lab", "value": "lab"}, {"text": "Network engineer", "value": "network engineer"}, {"text": "Presales consultant", "value": "presales consultant"}, {"text": "Public sector", "value": "public sector"}, {"text": "Senior analyst", "value": "senior analyst"}, {"text": "Senior consultant", "value": "senior consultant"}, {"text": "Senior director", "value": "senior director"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Software architect", "value": "software architect"}, {"text": "Solution consultant", "value": "solution consultant"}, {"text": "System architect", "value": "system architect"}, {"text": "System engineer", "value": "system engineer"}, {"text": "Systems analyst", "value": "systems analyst"}, {"text": "Systems architect", "value": "systems architect"}, {"text": "Technical trainer", "value": "technical trainer"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Accounting", "value": "/business/naics2007/5412"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Management", "value": "/business/naics2007/55"}, {"text": "Real Estate", "value": "/business/naics2007/53"}, {"text": "Wholesale", "value": "/business/naics2007/42"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Amazon", "value": "/m/0mgkg"}, {"text": "Microsoft", "value": "/m/04sv4"}, {"text": "EPAM Systems", "value": "/m/0dlnrc"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "IBM", "value": "/m/03sc8"}, {"text": "Salesforce", "value": "/m/07btr5"}, {"text": "EY", "value": "/m/0g9jc"}, {"text": "Publicis Sapient", "value": "/m/02myjp"}, {"text": "Randstad", "value": "/m/08pt1z"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Alibaba Group Holding Limited", "value": "/m/07s6ctl"}, {"text": "Avanade", "value": "/m/094456"}, {"text": "Capgemini", "value": "/m/03vlk0"}, {"text": "Comtel Solutions Pte Ltd", "value": "/g/11dxpztgnb"}, {"text": "DELL", "value": "/g/11c54ch2jm"}, {"text": "Ericsson", "value": "/m/02kyh"}, {"text": "HTZ Resources", "value": "/g/11h21p9b4d"}, {"text": "Infinite Computer Solutions Pte Ltd", "value": "/g/11g9mj72yz"}, {"text": "Michael Page", "value": "/m/04cxldw"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "Orange Business Services", "value": "/m/08zvyz"}, {"text": "Recruitment Hub Asia Pte Ltd", "value": "/g/11dxpww_0f"}, {"text": "TEKsystems (Allegis Group Singapore Pte Ltd)", "value": "/g/11b6g4bkv0"}, {"text": "Talent Trader Group Pte Ltd", "value": "/g/11dxpmlc5b"}, {"text": "Tata Consultancy Services", "value": "/m/01psx8"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "VMware", "value": "/m/01t9k5"}, {"text": "Verizon", "value": "/m/07_dn"}, {"text": "A-Speed Infotech Pte Ltd", "value": "/g/11g9mxswl4"}, {"text": "ABeam Consulting", "value": "/g/11bc6whr_f"}, {"text": "Amazon Web Services (AWS)", "value": "/g/11dxprr2xv"}, {"text": "Amazon Web Services Singapore", "value": "/m/0rznzt1"}, {"text": "Aon", "value": "/m/0z7n"}, {"text": "Avaya", "value": "/m/01sqlk"}, {"text": "Azendian Solutions Pte Ltd", "value": "/g/11dxpvcjj2"}, {"text": "Big Cloud", "value": "/g/11c743lwsr"}]}]}