{"search_metadata": {"id": "60827aba1d986e7c8c16a7bf", "status": "Success", "json_endpoint": "https://serpapi.com/searches/766c2551831875c8/60827aba1d986e7c8c16a7bf.json", "created_at": "2021-04-23 07:43:54 UTC", "processed_at": "2021-04-23 07:43:54 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28solution+architect%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=140", "raw_html_file": "https://serpapi.com/searches/766c2551831875c8/60827aba1d986e7c8c16a7bf.html", "total_time_taken": 1.32}, "search_parameters": {"q": "(solution architect) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "140"}, "jobs_results": [{"title": "Solutions Architect", "company_name": "Pan-united Corporation Ltd.", "location": "Singapore (+1 other)", "via": "via Monster", "description": "Job Responsibilities:\n• Define clear project goals and lead architecture initiatives from inception to completion\n• Collaborate with business users to create architecture in alignment with business need\n• Champion the adoption of reusable architecture assets to improve efficiency\n• Produce documentation to aid in the understanding of existing architecture solutions\n• Conduct architectural evaluation, design, analyze and provide solutions to improve existing systems\n• Research on emerging technologies and propose for changes if needed\n• Provide guidance and training to development team on new technologies\n• Work closely with project team to implement new solutions\n• Act as a technical subject matter expert for business users\n• Liaise with relevant teams to resolve technical problem\n\nJob Requirements:\n• Bachelor Degree in Information Technology, Software Engineering, Computer Science, or equivalent\n• Proven experience in engineering and software architecture design\n• Good understanding... of:\n\n- Building enterprise applications using Java, Angular, Hibernate and Spring\n\n- Designing architecture solutions based on microservice technology principles with repeatable processes that are high in performance, security and scalability\n\n- Building Restful web services leveraging on Open API specifications and API Gateway\n\n- Docker-based container, Kubernetes or other container schedulers\n\n- Cloud infrastructure\n• Good communication and analytical skills\n• Strong interpersonal and collaboration skills\n• Ability to demonstrate technical concepts to non-technical audiences\n• Preferably with Java Programming experiences and project management professional certification", "extensions": ["1 month ago", "Full–time"], "detected_extensions": {"posted_at": "1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2x1dGlvbnMgQXJjaGl0ZWN0IiwiY29tcGFueV9uYW1lIjoiUGFuLXVuaXRlZCBDb3Jwb3JhdGlvbiBMdGQuIiwiY29tcGFueV9taWQiOiIvbS8wY3FmZnQzIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiQmROOHdKSXJKMkRtcS15WUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRW9zQ0Nzd0JRVTVWWDA1eFVsQmtWbGxKU0dsWGRYWXRaVUpuTURrekxUSTFSbFZuUTFvNWNFdHpSSFUxUW5aclFuTkRaVGQyYWt4dVJITmtNWGx5TnpscWJuUmFRMFl6UWxkZk5EbFdPRUZFWjJsQ1VVODRkbmhKVkVOR1RVOUZUVmxhYjJwM05HUkRZV1Z0YWtSdk4zbzFhRVJNVjFKclgzQjJkbGRDZDBwVE9GTTFOaTFtZFVSMFNXbE9Za2hOTkRkclNUYzFiVGRNYVhWclExbGtTSGw0TjJaMVQwbzFUbko1UzBVd1VXMUxTVlZXWldwM1FrRm1VbWcxTVZKV1lVdG5iVkZ5VkZSbmVGcERlRkZoVG5OaEVoWjFibkZEV1V0SGVrbHZiV3RmVVdGaU9IQnhiMEYzR2lKQlQwMVpVbmRDZUZOZlowSnhiSFkwUVhvM1dHdElWMGRWT1RJNVgxRnBhRXBSIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNb25zdGVyIiwibGluayI6Imh0dHBzOi8vd3d3Lm1vbnN0ZXIuY29tLnNnL2FtcC9qb2ItdmFjYW5jeS1zb2x1dGlvbnMtYXJjaGl0ZWN0LXBhbi11bml0ZWQtY29ycG9yYXRpb24tbHRkLXNpbmdhcG9yZS0yNzQ1NzQ5Ny5odG1sP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "SOC Solutions Architect", "company_name": "Ensign InfoSecurity", "location": "Singapore (+1 other)", "via": "via Glassdoor", "description": "Ensign is hiring !\n\nDuties & Responsibilities\n• Lead the pre-sales, development, integration and advisory of cyber security solution architectures/ design to meet client needs\n• Specific focus on SOC technologies (Network/Endpoint DLP, Data Classification, SIEM, SOAR, EDR)\n• Design, develop and integrate cyber security architectures which are highly scalable, reliable and fault-tolerant according to business requirements\n• Develop appropriate methodologies, frameworks and approaches to address project objectives and increase security maturity\n• Recommend security solutions to clients, using a defensible methodology\n• Proactively manage stakeholder communication related to deliverables, risks, changes and dependencies.\n\nRequirements\n\nPossess any of following work experience:\n• 3 to 5 years of experience with cyber security solutions implementation\n• 3 to 5 years of experience with solutions design for SOCs and/or process implementation work with cyber security technology teams\n• 2 to 3... years of experience with enterprise systems and network implementation\n• Familiar or keen in consulting, including both internal and client facing experiences\n\nCapable of demonstrating the following:\n• Comfortable with managing ambiguity\n• Excellent presentation and briefing skills\n\nIn possession of:\n• Professional certifications, such as Microsoft Certified, Red Hat Linux Certified, TOGAF, CISSP, CISM or SANS certifications Bachelors’ degree in a Science, Technology, Engineering or Mathematics (STEM) Discipline\n\nCandidates will need to be able to:\n• Travel up to 20% of the year\n• Be subjected to security investigations and may need to meet eligibility requirements for access to classified information\n\nMore experienced candidates will be considered for more senior roles", "extensions": ["16 days ago", "Full–time"], "detected_extensions": {"posted_at": "16 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTT0MgU29sdXRpb25zIEFyY2hpdGVjdCIsImNvbXBhbnlfbmFtZSI6IkVuc2lnbiBJbmZvU2VjdXJpdHkiLCJjb21wYW55X21pZCI6Ii9nLzExZzRqaHltanIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJpNGxBU0ZqOE5vYWN0VG1aQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdllCQ3JjQlFVNVZYMDV4VkZoTlVHaG5Oak5wTFc5UVRtNW9lRWR5VG10VlZtRkVjRU5xY1Vka1RtbzVhbHBCV0daak5rUlpNMnRTUWt0TFpYQkllblpLYUVGaVYzSjZTa3QxT0RrNFJVSmZRWHBpTjFKeVZDMVRTMDluVXpNdFNHSm9UekpSV21ob1NVWldWakJQVFhabmJrVnhlblJDWjNGNVRIVkVWRWd5ZVV0TE4zYzJOVFJ1WVY5SVJXeGhSbmQ1TTBGb2NHeENPV1JPTmxod0xYTkhiSFl4UzA0dFFuaHpjMVl4WlhwUU4xSmpWRVpUZG1kVVRqSkZFaFoxYm5GRFdVdEhla2x2Yld0ZlVXRmlPSEJ4YjBGM0dpSkJUMDFaVW5kQlowOVBYMDlMYVZwb1JqUlpkM2c1V2psdWFVTmFhbWd0UzBGMyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzE1IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEdsYXNzZG9vciIsImxpbmsiOiJodHRwczovL3d3dy5nbGFzc2Rvb3Iuc2cvam9iLWxpc3Rpbmcvc29jLXNvbHV0aW9ucy1hcmNoaXRlY3QtZW5zaWduLWluZm9zZWN1cml0eS1KVl9JQzMyMzU0MTBfS08wLDIzX0tFMjQsNDMuaHRtP2psPTM2NTcyNTA1NjFcdTAwMjZ1dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Solutions Architect (BB-9D28D)", "company_name": "AON SINGAPORE CENTER FOR INNOVATION, STRATEGY AND MANAGEMENT PTE. LTD.", "location": "Singapore", "via": "via BeBee", "description": "Roles & ResponsibilitiesResponsibilities: Proposal of detailed system design, system architecture and technology stack Contribute and execute to the technology roadmap together with the technical leadership team Proposal of proof of concepts for the team to follow through and execute to modernize and improve existing applications Able to present with clarity the pros and cons of design decisions with focus on areas of scalability, performance and cost. Collaborate with teams of experienced data scientists, analysts, developers and business experts to build high-performing web applications Assist in troubleshooting and support of existing applications whenever required Requirements: AWS certified Solutions Architect – Associate/Professional Very passionate and knowledgeable on areas of scalability and performance. Understands various patterns of traditional and modern system architectures. Experienced in drawing solution architecture diagrams that details the interactions between the... various components of the system. Understands security considerations of various architecture topologies Working experience using an agile development process (eg. Scrum, Kanban, Scrumban) Good hands-on experience in full stack web application development (eg. Front end, API, database) Working experience in single page web application development experience in Angular, CSS, JavaScript and Typescript Good experience in .NET Core C# and ASP.NET Core Web API Experience in Entity Framework ORM and writing SQL Knowledgeable in areas of databases and data warehousesTell employers what skills you have.NETAngular JSASP.NETAWSCloud ComputingData Warehouse ArchitectureEnterprise ArchitectureEnterprise SoftwareIntegrationSOASoftware DevelopmentSoftware Solution ArchitectureSolution ArchitectureSystem DesignTechnical Leadershipproof of conceptstechnology roadmap", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2x1dGlvbnMgQXJjaGl0ZWN0IChCQi05RDI4RCkiLCJjb21wYW55X25hbWUiOiJBT04gU0lOR0FQT1JFIENFTlRFUiBGT1IgSU5OT1ZBVElPTiwgU1RSQVRFR1kgQU5EIE1BTkFHRU1FTlQgUFRFLiBMVEQuIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJhVjVaeXlGNUdqcktjbERLQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJlQmVlIiwibGluayI6Imh0dHBzOi8vc2cuYmViZWUuY29tL2pvYi8yMDIxMDQxNy0zZDI2MmRkOTQ3MzAxNzE2MDdlZjBmZmQwZDI5ZDI4ZD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Cloud Solution Architect, Cloud Data Warehouse", "company_name": "ByteDance", "location": "Singapore", "via": "via Neuvoo", "description": "Responsibilities\n\nAbout ByteDanceFounded in 2012, ByteDance is a technology company operating a range of content platforms that inform, educate, entertain, and inspire people across languages, cultures, and geographies. With a suite of more than a dozen products, including TikTok, Douyin, Toutiao, Helo, and Resso, ByteDance now has a portfolio of applications available in over 150 markets and 75 languages. Team IntroductionIn Data Platform Singapore, our mission is to create a PB-level analytical database product that empowers efficient and real-time data-driven decision-making, based on ClickHouse. Our internal use cases have been grown to tens of thousands of instances and supporting ByteDance's global customers as well as internal products. Based on this unique ground, we will be building a cloud-native and high-performance enterprise data warehouse (or analytical database, these two concepts are becoming one), with challenges that are exciting and unprecedented, and we vision this... database to be the fastest analytical database in this world. As a Customer Solution Architect, you will:- Work with the sales team and industrial solution team, to own a critical piece of the customer onboarding phase, including engaging with customers, pre-sales support, designing solutions, and providing technical support to deliver great results.- Deep dive into customer business scenario, understanding requirements and constraints, serving as a trusted technical advisor for our customers to convert the requirement into a deliverable technical solution- Proactively communicate with customers to understand their needs or potential needs, help them to understand the value of the product, and work closely with the product team to explore the boundary of the product. Qualifications- 5+ years of customer-facing technical experience in managing complex customer environments and worked on cases where big data processing is a key component.- A consistent track record of successfully managing client relationships and technical projects with excellent work ethic, leadership, and project management skills.- Prior experience working with tools in any of the following areas: Database, Enterprise SaaS, Data warehouses/pipelines- Have prior experience working with tools like Hadoop, Hive, Kafka, Spark, and Flink- Capability to be hands-on in solving technical issues. Understand cloud, Linux, and container technologies.- Excellent verbal and written social, presentation, and interpersonal skills, with the ability to effectively explain complex technical concepts to stakeholders with an array of experience levels and technical competencies", "extensions": ["29 days ago", "Full–time"], "detected_extensions": {"posted_at": "29 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDbG91ZCBTb2x1dGlvbiBBcmNoaXRlY3QsIENsb3VkIERhdGEgV2FyZWhvdXNlIiwiY29tcGFueV9uYW1lIjoiQnl0ZURhbmNlIiwiY29tcGFueV9taWQiOiIvZy8xMWdobmZyMHN2IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiNWF5NUxscHhYbkJLbUp4S0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFVqRnFaa2xTUWtaM1pqRlRiR0p6Um1SbWMwVmZaV05TZUdsV2RIcGZlRWgwVkRadmRHZENSVEUxVUdKeExWUnNjRlJNU1haSlRWRnllbkJaU1dwdU0yMUNTSEoxUVdzeVpGTlFiR2RMZEZSWWRHSTBUbGh4WkZGU1ExVlFSRVZ1V0RNM2FWTXhaMlIwWjFSTldtUldZVlZhYjJkMmNYWkNlbUpMZFY5WVVIWXRiMVpwYTNrMGVUQlJWVWREZUdKelFXbzRNWG96VUVkM2MzTm5FaFoxYm5GRFdVdEhla2x2Yld0ZlVXRmlPSEJ4YjBGM0dpSkJUMDFaVW5kRExYcDZTVVo1V0dkU05FdEhUbk5XY2tvd1dHSnNRVVJzZFVSbiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzI3IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE5ldXZvbyIsImxpbmsiOiJodHRwczovL3NnLm5ldXZvby5jb20vdmlldy8/aWQ9Y2ZmNDlmNThmMzM1XHUwMDI2dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "System Engineers", "company_name": "OakTree Consulting", "location": " (+1 other)", "via": "via Jobs", "description": "Job Description Responsibilities:• Design cloud system based on client’s requirement by utilizing cloud services and tools such as AWS, Microsoft Azure or Google Cloud.• Work on cloud platform setup, implementation and administration• Integrate or deploy third party projects into system• Administrate, configure and troubleshoot applications in Linux or Windows environment. Requirements:• Good Diploma/Degree in IT or related fields.• Minimum 2 years’ experience designing and configuring any Linux distribution and/or Window servers.• Experience with system customization and development.• Experience setting up cloud platform such as AWS, Azure, GCP etc.• Ability to communicate value, progress of projects to required stakeholders.• Proficient in one of server-side scripting languages such as Python.• Experience in DevOps, CI/CD techniques such as GIT, Jenkins, Bamboo, SonarQube.• Experience in infrastructure automation tool such as Ansible, Terraform takes a big advantage.• Experience in... containerization such as Docker and Kubernetes orchestration is a plus.• AWS certified solution architect is a plus.• GCP certified engineer is a plus. Please submit resumes to [Click Here to Email Your Resume] with the following details in MS Word format: - Position applying for- Current remuneration- Expected remuneration- Notice period John Goh Meng Chye EA License No : 06C4642EA Reg No : R1102621", "extensions": ["2 days ago", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTeXN0ZW0gRW5naW5lZXJzIiwiY29tcGFueV9uYW1lIjoiT2FrVHJlZSBDb25zdWx0aW5nIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJydU1kSEdhSWpoT3lNNFhhQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnMiLCJsaW5rIjoiaHR0cHM6Ly9zZy5maWRhbnRvLmNvbS9qb2JzL2pvYi1vcGVuaW5nL2NvbXB1dGVyLXN5c3RlbXMtZW5naW5lZXJzYXJjaGl0ZWN0cy9zeXN0ZW0tZW5naW5lZXJzLTI3NzQ1MzU3MD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Solution Architect", "company_name": "Newbridge Alliance Pte. Ltd.", "location": "Singapore", "via": "via Monster Singapore", "description": "An exciting opportunity is waiting for you in the newly set up Digital team, who will spearhead the digital transformation efforts of the retail group.\n\nYou will be working on Commercial and Operational digital applications and projects that will transform our business and bring customer experience to greater heights.\n\nYou will be working in squads with fellow enthusiasts, re-imagining how we serve our connected customers.\n\nAs a digital disrupter, you’ll recreate and redefine our business to generate a lasting competitive advantage, focusing on building the applications for existing / new digital products.\n\nYou will be responsible for the below areas:\n\n· Work with Product Owner(s) to translate business requirements to technical requirements, including establishing delivery timelines and deliverables.\n\n· Draw up the technical architecture based on the user stories established from the business requirements.\n\n· Propose technical solutions from high level to details for system... integration in the complicated application system.\n\n· Manage day-to-day activities of the team/squad, including creating, prioritizing, and managing the backlogs of activities.\n\n· End-to-end project delivery experience in an agile manner.\n\n· Assess, define, implement and support world-class Agile transformation programs.\n\n· Manage and coach a team of tech developers.\n\nRequirements:\n\n· A bachelor’s degree in relevant computer science, engineering, information technology, or related field.\n\n· 10 years of the delivery lead experience with hands-on experience in solution architecture, delivering agile projects (planning, execution, and team management) as well as managing a team of tech developers.\n\n· Possess one or more of the following certifications: (1) Certified Scrum Professional, or (2) SAFe Program Consultant, Lean Methodologies\n\n· Able to solve complex development problems and produce the highest quality code while striving to push the technical boundaries of online applications.\n\n· Experience with web scripting languages such as PHP, Javascript, or Python", "extensions": ["7 days ago", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2x1dGlvbiBBcmNoaXRlY3QiLCJjb21wYW55X25hbWUiOiJOZXdicmlkZ2UgQWxsaWFuY2UgUHRlLiBMdGQuIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJId29xMnBIOUZJM0pNMVJwQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1vbnN0ZXIgU2luZ2Fwb3JlIiwibGluayI6Imh0dHBzOi8vd3d3Lm1vbnN0ZXIuY29tLnNnL2FtcC9qb2ItdmFjYW5jeS1zb2x1dGlvbi1hcmNoaXRlY3QtbmV3YnJpZGdlLWFsbGlhbmNlLXB0ZS1sdGQtc2luZ2Fwb3JlLTI3NzQ3NjIxLmh0bWw/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Enterprise Architect", "company_name": "Jobs via eFinancialCareers", "location": "Singapore", "via": "via LinkedIn", "description": "Summary Of Role\n\nDo you have a passion for architecting complex IT solutions? We are seeking a talented Solutions Architect to join our growing Multi-Service Integration organization. In this role, you will be an integral part of the client service team, solutioning large, multi-tower engagements across multiple business units.\nA solution architect is responsible for the design of one or more applications or services within an organization, and is typically part of a solution development team. He or she must have a balanced mix of technical and business skills, and will often work with an enterprise architect or technical architects for strategic direction. The main focus is on the technical decisions being made regarding the solution and how they impact the business outcomes.\nYou will craft top-notch solutions for our clients' transformation and outsourcing requirements. You will define and drive business-IT solutions that use innovative business processes, architectural and... technical frameworks to provide client partners with viable, high value solutions to complex business problems. Our solutions are typically a combination of Digital, BPO, applications development, applications management and infrastructure services. This elite opportunity requires prior professional experience as a solution architect, with a consistent track record of running and winning deals.\n\nFocus Of An Enterprise Architect\n• How technology can be used to solve a given business problem\n• Which framework, platform, or tech-stack can be used to create a solution\n• How the application will look, what the modules will be, and how they interact with each other\n• How things will scale for the future and how they will be maintained\n• Figuring out the risk in third-party frameworks/platforms\n• Finding a solution to a business problem.\nRole Responsibilities:\n• Drive solutioning for complex deals involving multiple service lines and technical disciplines as part of RFI, RFP and informal deal processes.\n• Lead a multi-functional team of tower authorities across their respective domains.\n• Work closely with clients, intermediaries and internal Cognizant technical domain authorities to build high impact solutions\n• Define solution vision and direction building on commonalities and benefits across lines of business and technologies\n• Envision a transformation roadmap that aligns with the strategic and tactical direction of the partner client\n• Drive the translation of complex business initiatives into creative and innovate business-technology solutions and ensure consistency across traditional solution boundaries\n• Work with Business Stakeholders and Project Managers to understand inefficiencies in clients' existing business processes and applications and recommend solutions\nSkills & Experience:\n• 15+ years of experience in IT Consulting or in an enterprise architect role with a minimum of 2 years of experience in at least two of the following: Infrastructure Services, BPO, Digital, Applications Development and Maintenance\n• Strong knowledge in Banking & Financial Services domain. Specific experience in wealth and institutional banking will be an advantage\n• Must have demonstrated good consulting/ architecture experience in one or more digital areas (cloud, AI/ML, Analytics, IoT, Blockchain)\n• Proven experience planning, designing, and implementing large scale business-IT solutions\n• Proficient in Agile and DevOps methodologies and tools\n• Experience in multiple technology platforms and domains is desirable\n• Certified in TOGAF 9 or similar is desirable\n• Ability to present complex delivery and technical concepts to the clients during white-boarding and orals sessions\n• Ability to articulate the value of technical capabilities to C-suite audience\n• Excellent communication and presentation skills, both verbal and written\n• Ability to operate with ambiguity and program manage the solution build process\n• Strong leadership skills, decision-making and problem solving abilities.\n• Degree in Computer Science, Information Technology or related Engineering subjects", "extensions": ["7 days ago", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJFbnRlcnByaXNlIEFyY2hpdGVjdCIsImNvbXBhbnlfbmFtZSI6IkpvYnMgdmlhIGVGaW5hbmNpYWxDYXJlZXJzIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiI0c01oU19VV2tGVHU3bk1UQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExpbmtlZEluIiwibGluayI6Imh0dHBzOi8vc2cubGlua2VkaW4uY29tL2pvYnMvdmlldy9lbnRlcnByaXNlLWFyY2hpdGVjdC1hdC1qb2JzLXZpYS1lZmluYW5jaWFsY2FyZWVycy0yNTE1OTQ3MDUyP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Solution Architect APJ", "company_name": "FireEye", "location": "Singapore", "via": "via Neuvoo", "description": "Solution Architect APJ\n• Singapore, Singapore\n• Full-time\n\nCompany Description\n\nFireEye is the intelligence-led security company. Working as a seamless, scalable extension of customer security operations, FireEye offers a single platform that blends innovative security technologies, nation-state grade threat intelligence, and world-renowned Mandiant® consulting. With this approach, FireEye eliminates the complexity and burden of cyber security for organizations struggling to prepare for, prevent, and respond to cyber attacks. Learn more about FireEye's world-class solutions and global footprint at https://www.fireeye.com/company.html.\n\nJob Description\n\nThe Validation Security Instrumentation & Effectiveness (SIE) team is a multi-functional field engineering team offering unparalleled solutions and support to our customers with the Validation Security Instrumentation Platform (SIP). The team spans both pre-sales and post-sales activities to ensure the highest level of technical support... and expertise across the Validation offering. Come be part of a fast-paced team that focuses on delivering cutting edge solutions to solve immediate customer needs and challenges. The SIE team tackles a constantly evolving set of new challenges across diverse enterprise environments and technologies.\n\nThe Validation Team is currently seeking a Solutions Architect to join our team. Are you able to keep moving and stay on target with minimal guidance and input? Do you need to know how everything works and fits together? Does the concept of leaving a problem unsolved grind at you? Can you help drive an enterprise deployment through multiple technical and organizational challenges? If so, we are looking for highly qualified individuals to join our team and continue delivering world class expertise, implementation, and support.\n\nJob Description\n• Consulting with customers to help architect their Validation SIP deployment\n• Responding to technical questions and challenges escalated from customers, engineering teams, and support\n• Act as a subject matter expert across the Validation offering\n• Delivering technical material and presentations to Executives\n• Interface with the engineering team to augment features being developed in the product\n• Travel to customer sites to help with enablement and acceleration of the customer experience\n• Build deep relationships with senior technical individuals inside the customers to create Validation advocates\n• Work with the team to identify recurring problems and ways we can automate the solution to help scale and expand our offerings\n• Capture and share best-practice knowledge\n• Building out customer use cases and content\n\nQualifications\n• 10+ years of experience in Cyber Security\n• Expert in functionality across the security stack: SIEM, NGFW, Proxy, IDS/IPS, DLP, EDR, A/V, WAF, Orchestration Solutions\n• Strong communication skills\n• Strong background in Linux Administration\n• Strong networking background\n• Experience scripting and working with APIs (preferably Python and REST APIs)\n• Experience consulting with enterprise organizations and building out enterprise wide architecture plans\n• Red team/penetration test experience in a consulting role working with Blue teams\n• Experience working with and analyzing Threat Intelligence\n• Administration experience with Enterprise Windows Environments\n• PowerShell scripting experience\n• SOC or Blue Team work\n• Experience with cloud deployment environments (AWS/Azure/GCP)\n• Development experience Privacy Policy", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2x1dGlvbiBBcmNoaXRlY3QgQVBKIiwiY29tcGFueV9uYW1lIjoiRmlyZUV5ZSIsImNvbXBhbnlfbWlkIjoiL20vMDViXzhoNyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IkhfN0k5dTVhWVg5bklVM3VBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhVa3M1VDJWWE1qbDJlSE5OU0V0aU0zbElSaTAxZURsdlVuRlFha1UwZWw5UmFGWjFiMFZUUW5KbFZIWk9WbEJWWmpSRGJDMVdaVGN6TTJKSk5XcE5kRUZxYXpsbFkxbzNUM05vTWtWcVgwTllhMk4yZWtwS1RGZFFiMlZGZFUxUmQxbHpURzlzY0hsSVl6aG9ZWG95WVdOSk1VaHlOMDB3Y0VWZlVXYzNVR1ZIZVhWUGFrTkRTR2t4VkRkT05qWnBjVnBIYUVKd0xXaDBkVWgzRWhaMWJuRkRXVXRIZWtsdmJXdGZVV0ZpT0hCeGIwRjNHaUpCVDAxWlVuZENkakY2VFdrd1ZUbGZTbWhCVlhGUlJ6SkpPV2xaVGtSMGNVVjMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY180OSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBOZXV2b28iLCJsaW5rIjoiaHR0cHM6Ly9zZy5uZXV2b28uY29tL3ZpZXcvP2lkPTkwMGE0Zjk3NDA2YVx1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Solution Architect Consultant", "company_name": "Career Edge Asia Pte Ltd", "location": "Singapore", "via": "via Glassdoor", "description": "Location: Central / East\nSalary Range: $6K – $8K + AWS + 3-4VB\n2 Perm roles\n• Responsible for developing Enterprise software services and platforms which include governance and implementing best development practices\n• Coordinate with pre-sales on technical proposals and evaluation of application architecture solution\n• Provide on-going application support and be involved in all phases of the development life cycle from requirements gathering to production deployment\n• Responsible in all matters related to application architecture, solutioning, design and implementation of enterprise systems, web applications or software\n• Maintain technical standards and stay abreast of latest technology with R&D team on conceptualized design and prototype into solution for end user’s business case\n\nRequirements\n• Degree in IT Software architect engineering or equivalent\n• Min. 5 year(s) of relevant Java programming / . Net / C# experience\n• Experience in JEE servers such as WebLogic, WebSphere... JBoss or Tomcat\n• Software Architecture knowledge – OOP, CSSLP and Enterprise Architecture Certified\nCompetitive remuneration package will be offered to the shortlisted candidate.\nInterested candidates, please send your updated CV in MS Words format stating your last drawn salary, expected salary, notice period and reason for leaving last / past employment(s) and email to recruit21@caed.com.sg for priority processing.\n\nAttn: Jace Tay (Registration No.: R1331152)\n\nCAREER EDGE ASIA PTE LTD\nEA Licence Number: 13C6678\nTo find out more job opportunities, visit Career Edge Asia at www.caed.com.sg for all job listings.\nEmail: recruit@caed.com.sg", "extensions": ["16 days ago", "Full–time"], "detected_extensions": {"posted_at": "16 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2x1dGlvbiBBcmNoaXRlY3QgQ29uc3VsdGFudCIsImNvbXBhbnlfbmFtZSI6IkNhcmVlciBFZGdlIEFzaWEgUHRlIEx0ZCIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiZnVacWpReHBPUzJ1T1ltTUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBHbGFzc2Rvb3IiLCJsaW5rIjoiaHR0cHM6Ly93d3cuZ2xhc3Nkb29yLnNnL2pvYi1saXN0aW5nL3NvbHV0aW9uLWFyY2hpdGVjdC1jb25zdWx0YW50LWNhcmVlci1lZGdlLWFzaWEtcHRlLUpWX0lDMzIzNTkyMV9LTzAsMjlfS0UzMCw1MC5odG0/amw9MzY1NzMwNDc1MFx1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Technical Architect, Cloud", "company_name": "Avanade Inc.", "location": "Singapore", "via": "via Jobs | Fidanto", "description": "As a Cloud Architect, you will lead the Azure cloud projects to interact with customer stakeholders to gather inputs, plan, design, and enablement of Azure services. You are expected to possess architect level expertise for Azure offerings, while being able to plan and advice customer stakeholders and technical teams on components, services and dependencies of Azure services such as Azure AD, hybrid deployment etc. You will apply expertise in technical and consulting knowledge in advising clients and designing systems to support customer needs. In addition, this role assists with customer relationships, proposal development change requirements and marketing/PR initiatives. Additionally, you will be responsible for people, project and program management, typically for projects of moderate-to-large size and complexity. Key Role Responsibilities: Day-to-day, you will: * Lead in all phases of Avanade projects (Plan, Analyze, Design, Build and Test) * Assist in advising clients on an... overall IT plans including efficiently spending on existing and new technologies and integrating technology solutions in ways that create value for the organization * Work and interact directly with clients to ensure smooth and successful design and implementation of Avanade solutions * Help establish partnership with cross-functional technology and design teams to integrate technology, operations, and solution requirements into solution strategies * Oversee ongoing development of infrastructure solutions within designated computing environments * Define information technology operations, processes, procedures and toolsets to manage and maintain requirements specified for a solution * Manage change plan implementation to ensure successful project delivery and deployment * Lead partnership with and team utilization efforts of off-shore resources * Manage, evaluate performance of, provide feedback to, coach, and provide career guidance to Analyst and Consultant level team members Key Role Skill & Capability Requirements: Technical Requirements: * Extensive experience in several of the following areas: Azure Services such as Storage, Networking, Compute, Azure Kubernetes Service, Azure AD, Azure Site Recovery, Azure Backup, Azure Security, Monitoring, Azure Resource Manager (ARM) template management and deployment, VM Scale sets etc. * Experience with Infrastructure as Code (preferably utilizing HashiCorp Terraform) * Experience leading technology infrastructure projects * Experience with designing large Azure infrastructure rollout and migration projects * Experience with Singapore Government Commercial Cloud is a plus Non-Technical Requirements: * Experience consulting to external clients on complex projects, including in leadership roles * Experience working with global teams on projects * Experience working with off-shore teams to facilitate project work * Demonstrated excellence in communicating and presenting complex information to technical and non-technical stakeholders, both verbally and in written form * Experience making use of service brokering in project work * Strong commercial awareness and financial intelligence (e.g., P&Ls, how decisions impact cost, profit, etc.) * Solid written and spoken English skills Preferred Certifications: * Mandatory certification in Azure Architect Expert (70-533 & 70-534) * Highly preferred to be certified in Office 365 (70-346 & 70-347) * Highly preferred to be certified in ITIL V3 Preferred Education Background: You will likely possess a bachelor’s degree (or equivalent) in Computer Science, Computer Engineering, MIS, Information Technology, or similar degree; equivalent combination of education and experience may substitute for degree. Preferred Years of Work Experience: You will likely have 7+ years of relevant systems engineering and/or infrastructure experience Preferred Years of Management Experience: 2+ years managing teams Scope of Work: Nature of Work: Creates and implements work plans for assigned projects, programs, and/or clients against established operational objectives; supports translation of group strategy into objectives and work plans. Scope of Work: Provides operational leadership for work efforts requiring significant coordination. Complexity: Complex problems that consistently span work domains, requiring considerable judgment of contextual factors. Discretion: Wide latitude in approach to work, including ability to reshape work plans, guided by professional best practices and domain expertise. Organizational Impact: Work efforts have significant impact on near- and medium-term Avanade and/or client operations. If client-facing, should contribute to client-relationship and sales outcomes. Supervision Received: Works independently, with occasional validation of work efforts against strategic and operational objectives. Significant latitude in judgment & approach. Supervision Provided: Mentors and manages work efforts of more junior colleagues and team members as required by various workstreams; may formally supervise work of project teams. If managing team(s) of more junior employees full-time, then refer to the People & Business Leadership leveling criteria. Often serves as Career Advisor. Knowledge Applied: Applies advanced knowledge of learned occupation / discipline and strong business operational acumen. Accountabilities & Metrics: * Accountable for managing integration of collective work products to align with operational objectives * Accountable for chargeability and training targets * Accountable for project and annual goals * Accountable for people management responsibilities\n\nEmployment Transparency\nAvanade® Is An Equal Opportunity Employer. Avanade prohibits discrimination and harassment against any employee or applicant for employment because of race, color, age, religion, sex, national origin, gender identity or expression, sexual orientation, disability, veteran, military or marital status, genetic information or any other protected status.\n\nThe EEO is the Law poster is available here\n\nand poster supplement is available here\n\nThe Pay Transparency Policy is available here\n\nAvanade is committed to working with and providing reasonable accommodations to individuals with disabilities. If you need a reasonable accommodation due to a disability for any part of the employment process, please send an e-mail to Avanade at careers@avanade.com or call (206) 239-5610 and let us know the nature of your request and your contact information.\n\nBy using this site, you agree that we can place Cookies on your device. See our Job Applicant Data Privacy Statement and Cookies statement", "extensions": ["2 days ago", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJUZWNobmljYWwgQXJjaGl0ZWN0LCBDbG91ZCIsImNvbXBhbnlfbmFtZSI6IkF2YW5hZGUgSW5jLiIsImNvbXBhbnlfbWlkIjoiL20vMDk0NDU2IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoib1g1Q2RRQnFYMnlIT0hPX0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFZGWmtNalJtTjFSQlYwcDNPVFJHVDBveGEyUnBTbkJ0ZDBkUFVUQXRXV3RGTjIweGRsVTVOSGhuZWtWNFZVNURRMGxIU0RsdVptcG9Ubkp0ZW5GaWJYUkNTbXM1U0ZKeE9FVlZZVXRKYXpCMVJXcGtXamxKZEhKT2IyTnNiRmg1WDJWbVZVVlhWVGh0UVZneldsWXlUMDQ0YVhoalRISkpkRGxhY2pocU9HUldTVzltU0Vkd01FNU1OMUEwUjNWUlNFNVVTMnhoZG5ndFMzZG5FaFoxYm5GRFdVdEhla2x2Yld0ZlVXRmlPSEJ4YjBGM0dpSkJUMDFaVW5kRFpVVlllWGxtZUd4alpscFFSSEJYV1hKUU9GaHNZMHhGYTA1QiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzYxIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnMgfCBGaWRhbnRvIiwibGluayI6Imh0dHBzOi8vc2cuZmlkYW50by5jb20vam9icy9qb2Itb3BlbmluZy9jb21wdXRlci1uZXR3b3JrLXN1cHBvcnQtc3BlY2lhbGlzdHMvdGVjaG5pY2FsLWFyY2hpdGVjdC1jbG91ZC0yNzc0NDc4OTc/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}], "chips": [{"type": "Title", "param": "job_family_1", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:Google Sans,arial,sans-serif}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Solution architect", "value": "solution architect"}, {"text": "Solutions architect", "value": "solutions architect"}, {"text": "Architect", "value": "architect"}, {"text": "Cloud architect", "value": "cloud architect"}, {"text": "Technical architect", "value": "technical architect"}, {"text": "Enterprise architect", "value": "enterprise architect"}, {"text": "Senior", "value": "senior"}, {"text": "Consultant", "value": "consultant"}, {"text": "Financial services", "value": "financial services"}, {"text": "Infrastructure architect", "value": "infrastructure architect"}, {"text": "Manager", "value": "manager"}, {"text": "Application architect", "value": "application architect"}, {"text": "Cloud engineer", "value": "cloud engineer"}, {"text": "It architect", "value": "it architect"}, {"text": "Lead architect", "value": "lead architect"}, {"text": "Network architect", "value": "network architect"}, {"text": "Security architect", "value": "security architect"}, {"text": "Senior architect", "value": "senior architect"}, {"text": "Systems engineer", "value": "systems engineer"}, {"text": "Associate director", "value": "associate director"}, {"text": "Deputy", "value": "deputy"}, {"text": "Engineers", "value": "engineers"}, {"text": "Head", "value": "head"}, {"text": "Infrastructure", "value": "infrastructure"}, {"text": "Lab", "value": "lab"}, {"text": "Network engineer", "value": "network engineer"}, {"text": "Presales consultant", "value": "presales consultant"}, {"text": "Public sector", "value": "public sector"}, {"text": "Senior analyst", "value": "senior analyst"}, {"text": "Senior consultant", "value": "senior consultant"}, {"text": "Senior director", "value": "senior director"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Software architect", "value": "software architect"}, {"text": "Solution consultant", "value": "solution consultant"}, {"text": "System architect", "value": "system architect"}, {"text": "System engineer", "value": "system engineer"}, {"text": "Systems analyst", "value": "systems analyst"}, {"text": "Systems architect", "value": "systems architect"}, {"text": "Technical trainer", "value": "technical trainer"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Accounting", "value": "/business/naics2007/5412"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Management", "value": "/business/naics2007/55"}, {"text": "Real Estate", "value": "/business/naics2007/53"}, {"text": "Wholesale", "value": "/business/naics2007/42"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Amazon", "value": "/m/0mgkg"}, {"text": "Microsoft", "value": "/m/04sv4"}, {"text": "EPAM Systems", "value": "/m/0dlnrc"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "IBM", "value": "/m/03sc8"}, {"text": "Salesforce", "value": "/m/07btr5"}, {"text": "EY", "value": "/m/0g9jc"}, {"text": "Publicis Sapient", "value": "/m/02myjp"}, {"text": "Randstad", "value": "/m/08pt1z"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Alibaba Group Holding Limited", "value": "/m/07s6ctl"}, {"text": "Avanade", "value": "/m/094456"}, {"text": "Capgemini", "value": "/m/03vlk0"}, {"text": "Comtel Solutions Pte Ltd", "value": "/g/11dxpztgnb"}, {"text": "DELL", "value": "/g/11c54ch2jm"}, {"text": "Ericsson", "value": "/m/02kyh"}, {"text": "HTZ Resources", "value": "/g/11h21p9b4d"}, {"text": "Infinite Computer Solutions Pte Ltd", "value": "/g/11g9mj72yz"}, {"text": "Michael Page", "value": "/m/04cxldw"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "Orange Business Services", "value": "/m/08zvyz"}, {"text": "Recruitment Hub Asia Pte Ltd", "value": "/g/11dxpww_0f"}, {"text": "TEKsystems (Allegis Group Singapore Pte Ltd)", "value": "/g/11b6g4bkv0"}, {"text": "Talent Trader Group Pte Ltd", "value": "/g/11dxpmlc5b"}, {"text": "Tata Consultancy Services", "value": "/m/01psx8"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "VMware", "value": "/m/01t9k5"}, {"text": "Verizon", "value": "/m/07_dn"}, {"text": "A-Speed Infotech Pte Ltd", "value": "/g/11g9mxswl4"}, {"text": "ABeam Consulting", "value": "/g/11bc6whr_f"}, {"text": "Amazon Web Services (AWS)", "value": "/g/11dxprr2xv"}, {"text": "Amazon Web Services Singapore", "value": "/m/0rznzt1"}, {"text": "Aon", "value": "/m/0z7n"}, {"text": "Avaya", "value": "/m/01sqlk"}, {"text": "Azendian Solutions Pte Ltd", "value": "/g/11dxpvcjj2"}, {"text": "Big Cloud", "value": "/g/11c743lwsr"}]}]}