{"search_metadata": {"id": "60827a66cace961e3dfb77cf", "status": "Success", "json_endpoint": "https://serpapi.com/searches/06856db2a146d437/60827a66cace961e3dfb77cf.json", "created_at": "2021-04-23 07:42:30 UTC", "processed_at": "2021-04-23 07:42:30 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28product+manager%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=110", "raw_html_file": "https://serpapi.com/searches/06856db2a146d437/60827a66cace961e3dfb77cf.html", "total_time_taken": 1.54}, "search_parameters": {"q": "(product manager) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "110"}, "jobs_results": [{"title": "Insurance Product Manager (Digital)", "company_name": "Ethos BeathChapman", "location": "Singapore", "via": "via Laimoon.com", "description": "involved in the process of end to end product development, including monitoring post product launches. Your key role is to perform as a effective conduit between the business team and technology team when designing and delivering new insurance products in the regional marketplace.\n\nKey Responsibilities\n• Drive the end-to-end product development of insurance products; from conceptualisation , design, technical development, testing and roll out, to post-launch improvements and iterations.\n• Work closely with business stakeholders to design the right product and system architecture to support the business initiatives in targeted markets.\n• Effectively manage multiple stakeholders expectations and project time-lines.\n• Work with the technology and design teams to deliver comprehensive and customer-centric insurance solutions; including but not limited to customer policy administration, billing, claims management etc.\n\nKey Requirements:\n• Good educational qualifications with strong GPA... scores. Bachelor's degree or above in computer science, engineering, finance or related disciplines.\n• At least 2 years' experience in product development in insurtech/insurance companies for direct/digital distribution channels.\n• Strong understanding of at least 1-2 Southeast Asian online markets would be highly desirable.\n• Strong presentation and communication skills in English and Mandarin.\n• Self-driven, entrepreneurial, positive attitude and collaborative team player.\n• Take ownership in a lead role, enjoy working with dynamic stakeholders in a fast-paced working culture.\nInsurance", "extensions": ["8 days ago", "Full–time"], "detected_extensions": {"posted_at": "8 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJJbnN1cmFuY2UgUHJvZHVjdCBNYW5hZ2VyIChEaWdpdGFsKSIsImNvbXBhbnlfbmFtZSI6IkV0aG9zIEJlYXRoQ2hhcG1hbiIsImNvbXBhbnlfbWlkIjoiL2cvMTFjNzN6MHhtMCIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImhFYURQUmk2a3Q3cVJwWThBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2WUJDcmNCUVU1VlgwNXhWRkpqTmtkaU1GSmlZWEZMVmpoMFlXNDBWbk5qYVZsM2EzQkxhRXN5ZDI1bGMwRkZOWFF5YkRkYVltTkNVRkV6WDFwVWRtSmxMVlp0TFVKUGRsWlpjRWRYZG1aeFdrRnFWWEF6WWxkVmF6UldTRFV6Uld0M2MxQmxOVFV5Y0RWNFpsSm1OemxUUlVaRVNqUTVWSEJWZVVsUGFqZEJPV3hHWW1aMlUySXhjRXN0VDA5WU1WWjRObTVVTlRGWE1FOXBRVEpSTUVkR1N6aG5abkUxYjJ4dlgyUTRVbWxhUWxkd1JtdG9MVFZDZVhsWkVoWmFNM0ZEV1UxeFVVTnpURW90WjFOWmJVcGhRVVIzR2lKQlQwMVpVbmRCZG5KNldXNXJjVmQ2ZW04MFoxQjVkekZqWTBkQk9VSmlZVXBSIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMYWltb29uLmNvbSIsImxpbmsiOiJodHRwczovL2pvYnMubGFpbW9vbi5jb20vam9icy9leHRlcm5hbHZpZXcvMjU3MDM4MjM/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Area Marketing Manager, Digital (BB-3FDC9)", "company_name": "ABBOTT LABORATORIES (SINGAPORE ) PRIVATE LIMITED", "location": "Singapore", "via": "via BeBee", "description": "Roles & ResponsibilitiesPrimary Function· Develop, enhance or implement existing and new online products that complement Abbott’s Flash Glucose Monitoring ecosystem in partnership with ADC market teams.Core Job Responsibilities:List the primary tasks or activities this job performs· Partner with the markets under the guidance of the Area Marketing Director, to align and implement digital product strategies that align to the Area/ global direction, brand roadmaps and business plans.· Lead the implementation and localization efforts for centrally developed complimentary digital products for flash glucose monitoring, including cloud solutions and mobile apps and technical updates to websites.· Highlight and prioritise areas for enhancements to the customer experience in the connected ecosystem for flash glucose monitoring.· Translate existing unmet needs into digital product designs and functionalities to be scoped and built by a cross functional team.· Act as a mediator between end... users and technical teams, communicating end user needs into new product features to be designed.· Own and lead metrics of key digital products, including outline action steps for markets in test –to-learn program implementation.· Provide relevant input into an effective Area budget aligned to areas of brand and business growth potential.· Progress product development using Agile and DevOps models· Provide strategic input into the design of the technology stack as it relates to dotcom sites and their relationships to various products including appropriate CMSs, offsite analytics (cookies, SDK, SSO integrations), onsite analytics input and social media integrations. Provide strategic input to IT, marketing and CRM counterparts on systems integrations needs.· Partner with the Area, markets and global team to identify appropriate digital vendor partnerships.· Providing real-time marketing support that will lead to better outcome controls, including risk mitigation and action, and opportunity identification.· Partner with the Area marketing team to build effective alignment processes with other departments such as finance, regulatory, scientific affairs to ensure marketing strategies are realised. Maintain strong interdepartmental communication and liaison within ADC (locally and internationally).· Act as the Digital products subject matter expert and create content for a user-friendly digital learning agenda that is aligned to the needs of the business and brand.· Ensure all business activities comply with the relevant Acts, legal demands, safety and ethical standards. Review complaints and suggestions relating to assigned products.· Establish a productive work environment by creating trust and respect within the affiliate. Develop an atmosphere of confidence and strength, and create opportunities to recognize and reward outstanding individual and team performance.Knowledge / Education Required:Identify the knowledge, expertise, educational level required to perform this job successfully (product/industry knowledge, technical/business acumen, degree, professional certification etc)· Post-graduate or tertiary qualifications for Marketing or Business Management, Digital Marketing, Digital Product Development from a reputable university· Or, significant digital experience with tertiary qualifications.· AGILE training with SCRUM/Kanban exposure is highly desirableExperience Required:Describe the on the job experience level required to perform this job (management experience)8-10 years of digital marketing or digital media management experience gained at a country, regional or global level for a reputable consumer brand.Accountability- Achieve Affiliate’s sales, margin and market share- Deployment of digital marketing and media strategies and tactics(as detailed) across the Asia Pacific region- Oversight of the management and activation of new product launch plans to achieve affiliate’s sales, margin and market share- Brand custodianship of ADC brandsTell employers what skills you haveDigital MarketingDigital StrategyMarketingOnline AdvertisingOnline MarketingProduct StrategiesSEOSocial MediaSocial Media MarketingmonitoringPartnershipEcoSYSTEMSBusiness plandigital productsFlash, Multimedia-Tool", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBcmVhIE1hcmtldGluZyBNYW5hZ2VyLCBEaWdpdGFsIChCQi0zRkRDOSkiLCJjb21wYW55X25hbWUiOiJBQkJPVFQgTEFCT1JBVE9SSUVTIChTSU5HQVBPUkUgKSBQUklWQVRFIExJTUlURUQiLCJjb21wYW55X21pZCI6Ii9tLzA5bTU3ejMiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJiZDkzZTVUWTJoOVNJcUNaQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFc3NDQ293Q1FVNVZYMDV4VWpRMFMxWXhiVmd3TUdKb05sTlNTRzlzWVVReWJ6RkpjRTF2YzJGallYaEpOVGN3UkVoUmEyTmxXbEo1WjFkM1MzUk9TRWxRUVZab1psaEJUVlkzWm5kUWNUWkZOV3BNWTFFMWFVaE9XVkZxWVc1bWRrSjFlbWRUU3pWVU5sa3dTV0V4ZW1wbmExZFpha3d6VEhVM1JrWlRjeTAzWHpsdlVsVlBXREZKY0hsTFVtcFNTVFJYWkVwalFWbDBjbmw1WDJwV2VVcG9ORlZpYUVWdmVVWkhVSEpZTjJvNWNWOTVObGhOTTBSc1ozbHdRMk5IVTJSNlRWVnFRVXBUY0Rnd1ptdDRXV1pYTkZFMVZ6WjNZbFl3T1d0M1IyODBkbVpIVFVOYVkxRXhWWEJKY2tSRFFqVk5lR2N6VmtkRWFXNUhSSGRTYkRZMmFTMXRjMWhQUWt0NU0xOXdPVkJTVFJJV1dqTnhRMWxOY1ZGRGMweEtMV2RUV1cxS1lVRkVkeG9pUVU5TldWSjNRV1ZLVkhrNGNYQk1OMGN5ZG5GaFUwZG9TWFp0UjAxbFkwOHlkdyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzE0IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJlQmVlIiwibGluayI6Imh0dHBzOi8vc2cuYmViZWUuY29tL2pvYi8yMDIxMDQxNy1mMTZhMmM4ZTEwZWExMmQ1MDNlNWUyN2UwNzczZmRjOT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Product Manager (Web Application)", "company_name": "None", "location": "Singapore", "via": "via Jobs | Fidanto", "description": "Product Manager Looking for an experienced product strategist and communicator who is passionate about coming up with product solutions to drive business goals. This role will require you to be able to distil, document and evangelise company's web based product vision while working in an agile and fast-paced environment, using the latest and best practices across product planning, customer experience, product discovery, and product development. Lead ideation, development, launch, and iteration of approaches to improve revenue and user experience for our web services across desktop, mobile and apps Conduct market and competitor analysis to assess market needs and ensure products are competitive Gain a deep understanding of the user experience, identify and fill product gaps and generate new ideas that grow market share, improve customer experience and drive growth Influence stakeholders to build cross-functional buy-in and commitment to a shared product vision Develop and implement... product roadmaps Think multi-platform across online, mobile, video, social and events Test and measure everything and integrate quantitative and qualitative analysis into all product and management decisions Work closely with the Product Design and UX team Get a better understanding of our consumers and their usage of our products. Keep an ear out to our users through social networks, conversations with the sales team, to continuously make improvements and get new ideas. Manage the entire product lifecycle, from identifying user needs, planning the business case to creating products and services that are valuable, usable and feasible Work closely with the Client Service, Business Development & Marketing team to communicate product benefits, positioning and targets Conduct regular brainstorming sessions across the organisation on product features and performance Act as the key liaison for training needs as emerging products are launched Requirements At least Bachelor degree, MBA beneficial 4 years of product management experience, especially web-based products In-depth knowledge of web standards in design and usability Agile or Scrum certification preferred Expertise in product development tools (like JIRA, Confluence) preferred Expert on modern forms of product planning, customer discovery, product discovery, product development process and execution Strong analytical, business, project management, and organizational skills Exceptional influencing skills Entrepreneurial and commercially minded, highly creative Only Singaporeans and PRs need to apply Product Manager Looking for an experienced product strategist and communicator who is passionate about coming up with product solutions to drive business goals. This role will require you to be ab Skills: Agile, Business Strategy, Competitive Analysis, Confluence, e-commerce, Jira, Marketing Strategy, Product Design, Product Development, Product Management, Product Marketing, Product Planning, Project Management, Scrum, Social Media, Strategic Planning, Usability, Usability Design, Web Based, Agile Development Experience: 5.00-7.00 Years", "extensions": ["12 days ago", "Full–time"], "detected_extensions": {"posted_at": "12 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9kdWN0IE1hbmFnZXIgKFdlYiBBcHBsaWNhdGlvbikiLCJjb21wYW55X25hbWUiOiJOb25lIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJQNkhadElNVUZEQWRjSGdrQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnMgfCBGaWRhbnRvIiwibGluayI6Imh0dHBzOi8vc2cuZmlkYW50by5jb20vam9icy9qb2Itb3BlbmluZy9pbmZvcm1hdGlvbi10ZWNobm9sb2d5LXByb2plY3QtbWFuYWdlcnMvcHJvZHVjdC1tYW5hZ2VyLXdlYi1hcHBsaWNhdGlvbi0yNzIwMjIzNzg/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "LaserJet New Product Introduction Program Manager", "company_name": "Hp R&d Singapore Pte. Ltd.", "location": "Singapore", "via": "via Monster", "description": "HP is the world’s leading personal systems and printing company, we create technology that makes life better for everyone, everywhere. Our innovation springs from a team of individuals, each collaborating and contributing their own perspectives, knowledge, and experience to advance the way the world works and lives.\n\nWe are looking for visionaries, like you, who are ready to make a purposeful impact on the way the world works.\n\nAt HP, the future is yours to create!\n\nIf you are our LaserJet New Product Introduction Program Manager in Singapore, you will have a chance to:\n• Manage and lead a program involving multiple functions and project teams to drive the development and implementation process for a product and solution offering.\n• Develop and direct development of schedules, critical deliverables, budget, resource allocation plan, and other support requirements for assigned program.\n• Manage activities of supporting project teams and internal development partners; ensures progress... against established plan and makes determinations based on analysis of business information to alter or update schedule and resource allocation to meet product requirements and development schedule.\n• Communicate program progress, escalations, and issue analysis to product stakeholders; collaborates with management and internal marketing, development, and manufacturing partners to recommend and implement changes to product, processes, or business practices to resolve escalated issues, produce solutions, and ensure adherence to budgets and established product roadmaps and schedules\n• Drive innovation and integration of new technologies and quality initiatives into projects and activities in the manufacturing and/or engineering organization.\n\nAre you a high performer? We are looking for an individual with:\n• Bachelor's or Master's degree in Business Management, Engineering, Computer Sciences, or equivalent\n• PMP/PMI certification preferred\n• Typical 6-10 years’ experience\n• Ability to lead and drive alignment cross functional teams through product development to deliver products on time with high quality and targeted financial goals.\n• Extensive experience with using project and program planning tools and software packages to create, manage, and track project results.\n• Excellent analytical and problem solving skills.\n• Demonstrated business acumen and successful experience managing all aspects of programs, including communicating with stakeholders and directing matrixed teams and resources.\n• Ability to effectively communicate program plans, proposals, and results, and negotiate options at senior management levels.\n\nHP is a Human Capital Partner – we commit to human capital development and adopting progressive workplace practices in Singapore", "extensions": ["15 days ago", "Full–time"], "detected_extensions": {"posted_at": "15 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJMYXNlckpldCBOZXcgUHJvZHVjdCBJbnRyb2R1Y3Rpb24gUHJvZ3JhbSBNYW5hZ2VyIiwiY29tcGFueV9uYW1lIjoiSHAgUlx1MDAyNmQgU2luZ2Fwb3JlIFB0ZS4gTHRkLiIsImNvbXBhbnlfbWlkIjoiL2cvMTFuMDlneHh6cSIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IkUxVTY2QUZvNWRxV1U1V3NBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVvc0NDc3dCUVU1VlgwNXhWRzVuTkVscE1rRXhZa0ZrV1ZOVWNWQmhkVmgzTVZwWmFIY3hTSE5vT1haeU15MUpVRkpaUjFNMFZqa3RZVlZUTVVaVWIwdzRXa1ZUZW5WVlZqUkxkRU5SWkdjemRrMVJUMGxLWlMxUFRsVllYMVJrVnpsVFVqTnNTRXhxUlRCQlNUWmhZamRSTjBsMk5HTk9jWEl0YWs5emJYUldjRUl6TFdGdFdYZE1PRE5xY2tOck5qTkllV3hKZGpObmF6aERia1prZVVsRE5YQnFhakY0YjJwaFJWSnJVbEJYWkhwWE1pMUpabU5YYWpaNWFISXhWMnRVT0ZOYWVUUTFWMnRvYlc1dFIyVkVFaFphTTNGRFdVMXhVVU56VEVvdFoxTlpiVXBoUVVSM0dpSkJUMDFaVW5kRU9IZHhVbkYzUW5FNVpEUXdabVZQWDE5WE9VaHhOVk51UkhsUiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzI0IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1vbnN0ZXIiLCJsaW5rIjoiaHR0cHM6Ly93d3cubW9uc3Rlci5jb20uc2cvYW1wL2pvYi12YWNhbmN5LWxhc2VyamV0LW5ldy1wcm9kdWN0LWludHJvZHVjdGlvbi1wcm9ncmFtLW1hbmFnZXItaHAtci1kLXNpbmdhcG9yZS1wdGUtbHRkLXNpbmdhcG9yZS0yNzYyODI1Ny5odG1sP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "(Senior) Manager, Product Development", "company_name": "Tessa Therapeutics Ltd", "location": "Singapore (+1 other)", "via": "via LinkedIn", "description": "This role is responsible for coordinating outsourced works and assisting all members of Product Development in aligning their product development activities with corporate goals and priorities, project timelines and budgets. He/she tracks and documents scientific progress of both internal and external projects, monitors scope, status, schedule and budget, and he/she also follows up closely with stakeholders to ensure that projects are on track. This position establishes timely and efficient communication for sharing operational updates of Product Development activities with Project teams and Project Managers, and ensuring problems are rapidly identified and resolved to deliver on commitments.\n\nJob Description\n• Provide administrative and logistic support for all Product Development activities in the department\n• Responsible for department’s and Projects’ budgets, activity tracking, and setup and maintenance of a documentation system for efficient information sharing\n• Work with... scientists and directors to file development reports to document all completed activities and serve as the key person to manage a retrievable report system\n• Assist department members in sourcing and procuring materials or technologies by conducting suppliers and/or capability survey, initiate contact and track projects progress with relevant external parties and keep up with new industrial trends for Product Development of Cell Therapies\n• Supports Product Development outsourced work as well as assay technology transfers by establishing contracts and scopes management with contract research organizations, contract development and manufacturers, service/supply vendors.\n• Ensure communications for Product Development activities and progress with Tessa colleagues is effective and transparent, with timely updates on critical tasks to project managers to help them update project timelines accurately\n• Develop and maintain positive relationships with collaboration partners ensuring positive team environment and alignment with Tessa’s strategies\n• Collaborate with QA and Regulatory Affairs departments to ensure GxP data quality and timely records retrieval in accordance to Tessa’s Quality Policies\n• Flag potential quality problems and communicate any deviations and escalate issues as appropriate\n• Participate in future hiring and resource planning for Product Development department\n\nRequirements\n• Bachelor’s degree in Life Sciences\n• More than 10 years track record in managing multiple projects in life science industry\n• Data analysis skills using basic statistics are required.\n• Basic knowledge of GMP, GCP, and CMC & QA guidelines are highly desired.\n• PMP certification or with strong project management skills desired\n• Highly developed inter-personal skills and verbal/written communication\n• Strong problem solving and critical thinking skills\n• Ability to manage situations with internal and external collaborations and help teams focus on making progress through objective and clear communication style", "extensions": ["7 days ago", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiIoU2VuaW9yKSBNYW5hZ2VyLCBQcm9kdWN0IERldmVsb3BtZW50IiwiY29tcGFueV9uYW1lIjoiVGVzc2EgVGhlcmFwZXV0aWNzIEx0ZCIsImNvbXBhbnlfbWlkIjoiL2cvMTFmcDFtMXp2ciIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Im1JR2tQVm1zNGUzZUhyUWVBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVvc0NDc3dCUVU1VlgwNXhVMFZGVW1wdWNYTjZSV2x4ZFZGQkxXUnRaRnA1UTJKaExXUlBkM2RhV1ZCR1RUQmZXRzB3UkdaamVYaEViRTQxWHpSMlZrVnNVbVJqUlZFeFIwOTNWekZhTkZRME1VbGpSbWQ2YUhsSGRtbFhZVlJEUWpWRlVGQmhhMEl5WlZSWU4xQjBTMUV4VDI5MlRIVlZVQzFOYWxkQlNuZERNbWRZZEhsM1gyTTFZV1o0ZDJacU5HZHhPWE14UzJkbFpEbGtha0ZJVmtGV1NrTjBTR1I1TjFFeFYxRk9UekpNVmxkV2VHcFZkRk5pTjA5UFdtWnZNa2xRZFV4eVQxaFhTSFUzVkdsUVNuUTJFaFphTTNGRFdVMXhVVU56VEVvdFoxTlpiVXBoUVVSM0dpSkJUMDFaVW5kRU9DMW9PRWxSTm05NmVHZFRTM0pYTnpsaWJrVjNiRzF3U1RCQiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzMxIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExpbmtlZEluIiwibGluayI6Imh0dHBzOi8vc2cubGlua2VkaW4uY29tL2pvYnMvdmlldy9zZW5pb3ItbWFuYWdlci1wcm9kdWN0LWRldmVsb3BtZW50LWF0LXRlc3NhLXRoZXJhcGV1dGljcy1sdGQtMjQ4ODMxMzIwMz9yZWZJZD00NjdjMzRlYi0xMzI1LTRjNjAtOTM3Ni0yMDY4ZTVmMTkxNDNcdTAwMjZ0cmFja2luZ0lkPWg2dGZVejVnaGNobGhrenJjR1hiU1ElM0QlM0RcdTAwMjZ1dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Product Manager, Comments & DM, Trust & Safety", "company_name": "TikTok", "location": "Singapore", "via": "via Bayt.com", "description": "TikTok is the leading destination for short-form mobile video. Our mission is to inspire creativity and bring joy; building a world where people can safely discover, create and connect. The Trust & Safety team at TikTok helps ensure that our global community is safe and empowered to create and enjoy content across all of our applications. As a product manager on our Trust & Safety team, you will work with teams of engineers, data scientists, operations, product policies and various relevant internal teams to build safety product features and strategies. You will be working on in-app safety features, technical strategies to improve the safety of our search product. You will also work on project management to deliver major Trust and Safety product changes. Travel between our global offices is expected. Responsibilities\n- Safeguard the content ecosystem of our short-video platforms and be devoted in creating a better online environment for the sake of product safety, creativity, and... interaction via continuously improving our product features and strategies;\n- Take both quantitative and qualitative approaches to understand user interactions on comments section and direct message to identify harmful trends in the online community, draft relevant product strategies, provide proper user guidance, and reduce the impacts of harmful contents and ill-behaved users on our platforms;\n- Distill and abstract key learnings from past experience, dive deep into finding the balance point between business growth and community safety, and extend the values of T&S.\n- 2+ years' experience in online product/strategies, and experience in safety/risk management/anti-spam/recommendation is preferred;\n- Be able to quickly identify underlying issues, conduct root cause analysis, and - make the call on the feasibility and potential of different solutions;\n- Be capable of project management and coordination, collaborate closely with key partners (R&D, Product Design, etc.), and ensure all product schemes are rolled out effectively and efficiently;\n- Data-savvy, strong at data analytics, and familiarity with sql is a plus", "extensions": ["29 days ago", "Full–time"], "detected_extensions": {"posted_at": "29 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9kdWN0IE1hbmFnZXIsIENvbW1lbnRzIFx1MDAyNiBETSwgVHJ1c3QgXHUwMDI2IFNhZmV0eSIsImNvbXBhbnlfbmFtZSI6IlRpa1RvayIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiSVZjeGEyd3RfTE10VXNUbUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCYXl0LmNvbSIsImxpbmsiOiJodHRwczovL3d3dy5iYXl0LmNvbS9lbi9zaW5nYXBvcmUvam9icy9wcm9kdWN0LW1hbmFnZXItY29tbWVudHMtZG0tdHJ1c3Qtc2FmZXR5LTU5MjQzMTE3Lz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Digital Wealth Product Manager, Digital Business, Global Consumer Financial Services", "company_name": "OCBC Bank", "location": "Singapore", "via": "via Laimoon.com", "description": "The candidate being sought is to replace the product owner for Digital Wealth in the Digital Business team. He / she should have strong domain knowledge of wealth management as well as mobile and digital technologies and landscape. This has to be coupled with strong engagement and collaboration skills with product managers and partners.\n\nRoles & Responsibilities:\n- Define strategy, roadmap and drive delivery of KPIs for Digital Wealth franchise\n- Manage and drive digital projects/capability builds under Digital Wealth agenda covering all asset classes and platforms\n- Lead and coach team to achieve business objectives-deliver cost and revenue objectives\n- Evaluate solutions proposed by IT, vendors / partners and make necessary recommendations\n- Engage business units and support partners to foster collaboration and teamwork to meet the business objectives of the unit\n- Influence and drive initiatives and collaborations with BOS\n- Conduct / manage user acceptance test, develop rollout... plan and complete implementation activities\n- Support smooth rollout of enhancements, manage pre and post-implementation activities, train frontline teams and develop processes with operations teams\n- Work closely with IT/ops team to resolve project and implementation issues\n\nQualifications\nRequirements:\n- Possess university degree and > 10 years' of work experience in a retail bank\n- Familiar with digital and mobile technologies development and digital wealth trends\n- Proven experience in online/mobile banking product development and project management\n- Hands-on experience in developing user requirements, business analysis and managing user testing\n- Knowledge in retail wealth management products\n- Leadership and team management skills and experience\n- Strong interpersonal and communication skills\n- Ability to build strong partnerships with internal business partners and inter-department associates\n- Work well under tight timeline and pressure and able to multi-task\n• LI-JT\n\nCorporate Banking", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEaWdpdGFsIFdlYWx0aCBQcm9kdWN0IE1hbmFnZXIsIERpZ2l0YWwgQnVzaW5lc3MsIEdsb2JhbCBDb25zdW1lciBGaW5hbmNpYWwgU2VydmljZXMiLCJjb21wYW55X25hbWUiOiJPQ0JDIEJhbmsiLCJjb21wYW55X21pZCI6Ii9tLzA1NXIyNyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Im1LeGp3ZGVRUXZMZVRZejdBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhVbTUyVGt4MmRXRmxlREJrVWxKWmNFdDFiVkpPUWsxSVozRk1TRzlTV2xOWU5YVlVYM2Q1UTJObk5qVkJURkpOYkRkSVpFZ3RVbWMyV20xcE4zVldaRlkyU1hwMmFWTlpXVlZITlc5Sk5qbEVNRFJEYzFaYWVsQlViVVJTVkV4Wk1EaDJYMFowYjJKRE5VcDFORkJ3V1RSNGJFVldWa2RJVEZGamRGRjJhMWN4ZW5OS1pqQjVUbUpOTUhSNmJtdFVVRk00YjNreVJWWkpkVEozRWhaYU0zRkRXVTF4VVVOelRFb3RaMU5aYlVwaFFVUjNHaUpCVDAxWlVuZERTMjB0WWtOQ1JDMVRhVzF1Y3pacmN6VkROWGxJVUdsMU5uWlIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY180MyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMYWltb29uLmNvbSIsImxpbmsiOiJodHRwczovL2pvYnMubGFpbW9vbi5jb20vam9icy9leHRlcm5hbHZpZXcvMjU5ODU4Nzg/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Senior Product Development Manager - Sensory - Flavors", "company_name": "Ysq International Pte. Ltd.", "location": "Singapore (+1 other)", "via": "via Monster", "description": "POSITION INTRODUCTORY;\n\nThe Sr. Product Development Manager for Sensory & Flavors, requires creativity, in addition to an above-average sense of taste and smell. He / She to have a good memory for scents. Ability to combine essential oils, plant extracts and aroma chemicals to create both artificial and natural flavors.\n\nHave the knowledge to conduct tests at the same time know / set up the processes of systematic testing in a laboratory environment on how flavors perform in various products. Engineer flavors that will end up in a variety of products.\n\nRESPONSIBLITIES;\n• Motivation, patience, and a willingness to experiment are also important. The Sr. Flavorist must have the ability to create/modify flavors.\n• Provide timely responsiveness to ongoing testing enquiries and processes.\n• Certified Flavorist with the ability to create aspiring flavors or the relevant experience.\n• Keep track of all test results, comments and ensure that they are recorded without any errors.\n• Ensure... proper data management is maintained in the database of the creations, ingredients, and supplies.\n• Assist to resolve related issues where necessary.\n• Provide knowledge support for product pricing, product costing etc.\n• Attend to all matters pertaining to lab processes, testing procedures and results.\n• Other related duties as assigned by Head of Flavors/Senior R&D Manager.\n\nREQUIREMENTS;\n• Bachelor's/Undergraduate degree/Diploma in any science discipline, food engineering, food science, chemistry, or biology with at least 6 years relevant working experience as Senior/Flavorist in any flavor industry\n• Highly responsible and reliable with exceptional attention to details.\n• Experience in working within tight deadlines independently in a fast pace environment.\n• Able to maintain confidentiality for all work-related matters.\n• Creativity and scientific proficiency with a sensitive and distinctive palette", "extensions": ["15 days ago", "Full–time"], "detected_extensions": {"posted_at": "15 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgUHJvZHVjdCBEZXZlbG9wbWVudCBNYW5hZ2VyIC0gU2Vuc29yeSAtIEZsYXZvcnMiLCJjb21wYW55X25hbWUiOiJZc3EgSW50ZXJuYXRpb25hbCBQdGUuIEx0ZC4iLCJjb21wYW55X21pZCI6Ii9nLzExZHltYnkzOHgiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJvUTVKSVA1dXptbTIzU0tyQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFb3NDQ3N3QlFVNVZYMDV4VTJ0U1gwcHJkM3A2UVVwSFdHOWlVWFppU0drd2FuSldSelV4TlZKUWEwTlNSRXd4Y1VzeWRVNWtXV1l6TmpkYVJIRlVSbU5MZURGbExXMTFibmhGZUhOTFVUQkZTWFV5WVY5MFV6VkxOV2s0YTBRM1JtOWtjbFExWDFodVpIQnNaSFkwZG5OS1pqWlZZMVptU3pKdE4xRnhabGhsTm5vM04xTmZjRFppYnkxT1psaEpZeloyVHkwNGNubGlaMWRGYjNkVGRHVmZhbmxwYkdwNU4zWkZaRzQyWjNOaGVUbHdjVTgwVTJKWmMxaHdiR3hoYlV0c1kwbzNSVVl5WjA5bU5GVmtORzlJRWhaYU0zRkRXVTF4VVVOelRFb3RaMU5aYlVwaFFVUjNHaUpCVDAxWlVuZERha1UzTlV0MlRHRm1laTEwU0ZaWFNtMW1WbXRWU1RaVlVrdG4iLCJmY3YiOiIzIiwiZmNfaWQiOiJmY180OSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNb25zdGVyIiwibGluayI6Imh0dHBzOi8vd3d3Lm1vbnN0ZXIuY29tLnNnL2FtcC9qb2ItdmFjYW5jeS1zZW5pb3ItcHJvZHVjdC1kZXZlbG9wbWVudC1tYW5hZ2VyLXNlbnNvcnktZmxhdm9ycy15c3EtaW50ZXJuYXRpb25hbC1wdGUtbHRkLXNpbmdhcG9yZS0yNzYyMzUxMy5odG1sP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Senior Product Manager", "company_name": "EPAM Systems", "location": "Singapore", "via": "via LinkedIn", "description": "EPAM is committed to providing our global team of more than 41,150 EPAMers with inspiring careers from day one. EPAMers think creatively and lead with passion and honesty. Our people are the source of our success. We value collaboration, work in partnership with our customers, and strive for the highest standards of excellence. In today’s market conditions, we’re supporting operations for hundreds of clients around the world remotely. No matter where you are located, you’ll join a dedicated, diverse community that will help you discover your fullest potential.\nStriving for excellence is in our DNA. Since 1993, we have been helping the world’s leading companies imagine, design, engineer, and deliver software and digital experiences that change the world. We are more than just specialists, we are experts.\n\nDescription\n\nWe are seeking a highly motivated Senior Product Manager with experience in deep tech and digital consulting. You will be working very close to the business partners... user experience team and actively participating in to drive product development on behalf of our clients. As a Product Manager, you will guide products from the idea stage to full production and help to develop new ideas based on your industry experience and your contact with customers. Your primary focus will be delivering products that are valued by our clients.\n\nWe are looking for a goal-oriented, proactive individual who is comfortable with working in a fast-paced environment with an ability to drive a product from an early design concept to delivery. You must have expertise in business with a big-picture vision and the drive to make that vision a reality. You must enjoy spending time with customers to understand their problems and enjoy working with technical teams to develop innovative solutions. You'll need to be able to speak truth to power, supporting your decisions with data.\n\nAs technology-focused Senior Product Manager, you will work closely with clients and Business Unit Managers to understand product vision and goals and jointly work with developers and designers to prioritize, plan, and deliver software.\n\nWe Value\nValue the individuals – We encourage and motivate people to grow. We perceive our people as a source of our success;\nStrive for excellence – We strive for the highest standards of excellence and continuously learn. We take pride in our engineering and accomplishments;\nAct as a team – We treat one another with respect and encourage the best ideas to come from anywhere within the organization. We value our diversity;\nFocus on Customers – We build long term customer relationships, as we strive to always understand our customers' business and needs;\nAct with integrity – We operate legally, honestly and ethically. We take responsibility for our actions.\n\nResponsibilities\n• Act as a liaison between customer product management organization and EPAM\n• Work with leadership to align product vision with company strategy and business objectives\n• Work with business stakeholders to define the key personas and product capabilities\n• Identify and track strategic product objectives and key results (OKRs)\n• Develop and maintain long-term product roadmap of product releases, initiatives and capabilities\n• Work closely with business and technology teams to define a value-driven product release plan\n• Recommend and specify requirements for product capabilities supported by market research and on-going interaction with both customers and non-customers\n• Research and document the buyer's journey\n• Develop market-specific launch criteria for new product capabilities\n• Manage product milestones and communicate them to the stakeholders\n\nRequirements\n• Minimum qualification of Polytechnic Diploma in Computer Science, Software Engineering or related majors\n• 8+ years of experience as a software Product Owner or Product Manager\n• Deep tech, UX and experience consulting experience\n• Proven record of launching product (or key product functionalities) to the market\n• Previous experience and success working with Agile product development teams\n• Excellent interpersonal, communication and presentation skills\n• Ability to advocate: for the right thing in the face of the objection, for the user\n• Ability to influence decision making across a wide variety of roles and levels in the organization\n• Ability to work independently as well as part of a team\n• Ability to manage client expectations effectively\n• Ability to deal with ambiguity and thrive in a rapidly changing business environment\n• Ability to perform impact analysis, identify changes to business processes, perform testing, and effectively communicate with business\n• Product Management related certification is a plus\n• Active contributor in the product management community is a plus\n• Prior participation in complex product and service development that crosses upon multiple channels, digital and physical spaces in any role is a big plus\n\nWe offer\n• Friendly team and enjoyable working environment\n• Work-life balance and flexible schedule\n• Online training library, mentoring, career development and potential partial grant of certification\n• Unlimited access to LinkedIn learning solutions\n• Referral bonuses\n• Compensation for sick leave and paid time off\n• Opportunities for self-realization", "extensions": ["1 month ago", "Full–time"], "detected_extensions": {"posted_at": "1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgUHJvZHVjdCBNYW5hZ2VyIiwiY29tcGFueV9uYW1lIjoiRVBBTSBTeXN0ZW1zIiwiY29tcGFueV9taWQiOiIvbS8wZGxucmMiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJIVG02VGNBYWFqRG9zdHIxQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VVVndGFVTlBSazFMUVRkNE5rUnZWVWwyVkhBelJrODNkUzF4TFRGRVNXRnVNREV0WjFKNllUZHZiSEV6VEd0U2RsTlFha2xIVjJjM2FuQk1aRVUzWkhGdVFqbGpRV3hEVmpJMmFYcERNamxIVldKdGIyOXNTMjVIV0ZoV05WOVFhR2hoZFhOWFYwMVJhRkpyU1VoMk0weEdkVTlpV0ZWbWQwVkdOMTlvVFZOTmJHRnFVMWRaWDFjeU5raFBWRUkxU0d0dVRrcHFlWEozTTNaQkVoWmFNM0ZEV1UxeFVVTnpURW90WjFOWmJVcGhRVVIzR2lKQlQwMVpVbmRDYkVVME9IVm1ZM3BwWld4NGJXZ3hTV3BPT1hCT1ZtSm9TR3AzIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNTYiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGlua2VkSW4iLCJsaW5rIjoiaHR0cHM6Ly9zZy5saW5rZWRpbi5jb20vam9icy92aWV3L3Nlbmlvci1wcm9kdWN0LW1hbmFnZXItYXQtZXBhbS1zeXN0ZW1zLTI0NzM1OTg5NTU/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "ASSISTANT PRODUCTION MANAGER", "company_name": "None", "location": "Singapore", "via": "via Jobs", "description": "1. General Management of a Cake Manufacturing facility.2. General Management of production staff including job scheduling, annual leave management, employment, placement and training of new members, staff personal hygiene and health, ensuring work safety and complying with and attaining a high SFA hygiene standard.3. Able to handle SFA inspection and ensuring products pass relevant SFA specified requirements. Maintaining and complying with acceptable Good Manufcturing Practice.4. Ensuring that we comply with HACCP or ISO22000 certification requirements and keeping relevant documents and records.5. PRODUCT DEVELOPMENT-To ensure a continuous new products development and if accepted to implement good manufacturing practice and achieve maximum productivity.6. Ensuring production admin are kept efficient and support marketing and logistics according to Company established practice.7. Be able to handle backend computer admin and ensuring a smooth operation.8. Ensuring that ingredients used... are up to standard and to continuously look for new and cheaper ingredients to reduce production costs.9. Upkeep of machinery to prevent frequent breakdowns.10. Ensuring all cold room storage equipment are in good working condition and to arrange for periodic servicing and checks.11. Be able to constantly look for ways to increase productivity and introduce machine to reduce labor cost", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBU1NJU1RBTlQgUFJPRFVDVElPTiBNQU5BR0VSIiwiY29tcGFueV9uYW1lIjoiTm9uZSIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiOWpvOGV4TnJDckQ2bjlYa0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIiwibGluayI6Imh0dHBzOi8vc2cuZmlkYW50by5jb20vam9icy9qb2Itb3BlbmluZy9tYW5hZ2Vycy1hbGwtb3RoZXIvYXNzaXN0YW50LXByb2R1Y3Rpb24tbWFuYWdlci0yNzU0MzkyNjI/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Management", "value": "GC18"}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Business Operations", "value": "GC06"}, {"text": "Advertising and Marketing", "value": "GC03"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Accounting and Finance", "value": "GC01"}, {"text": "Sales and Retail", "value": "GC26"}, {"text": "Farming and Outdoors", "value": "GC13"}, {"text": "Human Resources", "value": "GC15"}, {"text": "Science and Engineering", "value": "GC27"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "Product manager", "value": "product manager"}, {"text": "Manager", "value": "manager"}, {"text": "Marketing manager", "value": "marketing manager"}, {"text": "Project manager", "value": "project manager"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Development manager", "value": "development manager"}, {"text": "Director", "value": "director"}, {"text": "Manufacturing manager", "value": "manufacturing manager"}, {"text": "Plant manager", "value": "plant manager"}, {"text": "Production manager", "value": "production manager"}, {"text": "Program manager", "value": "program manager"}, {"text": "Regional", "value": "regional"}, {"text": "Senior", "value": "senior"}, {"text": "Sr. manager", "value": "sr. manager"}, {"text": "Account manager", "value": "account manager"}, {"text": "Admin manager", "value": "admin manager"}, {"text": "Assistant", "value": "assistant"}, {"text": "Brand manager", "value": "brand manager"}, {"text": "Commodity manager", "value": "commodity manager"}, {"text": "Communication", "value": "communication"}, {"text": "Customer", "value": "customer"}, {"text": "Dealer", "value": "dealer"}, {"text": "Devops engineer", "value": "devops engineer"}, {"text": "Executive", "value": "executive"}, {"text": "Operation manager", "value": "operation manager"}, {"text": "Product specialist", "value": "product specialist"}, {"text": "Production supervisor", "value": "production supervisor"}, {"text": "Risk manager", "value": "risk manager"}, {"text": "Senior engineer", "value": "senior engineer"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Service manager", "value": "service manager"}, {"text": "Transactional", "value": "transactional"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Internship", "value": "INTERN"}, {"text": "Part-time", "value": "PARTTIME"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Toiletries", "value": "/business/naics2007/3256"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Foods & Beverages", "value": "/business/naics2007/311"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Management", "value": "/business/naics2007/55"}, {"text": "Research", "value": "/business/naics2007/5417"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "Citi", "value": "/m/01dfb6"}, {"text": "Amazon", "value": "/m/0mgkg"}, {"text": "Binance", "value": "/g/11hcz1r4wl"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "Standard Chartered", "value": "/m/02hszk"}, {"text": "United Overseas Bank", "value": "/m/04gjd1"}, {"text": "Tata Communications", "value": "/m/04338k"}, {"text": "Workato", "value": "/g/11dxpy_3xd"}, {"text": "Apple", "value": "/m/0k8z"}, {"text": "BNY Mellon", "value": "/m/02vps5x"}, {"text": "DBS Bank", "value": "/m/01q7n5"}, {"text": "EPAM Systems", "value": "/m/0dlnrc"}, {"text": "Grab", "value": "/m/0134c_p9"}, {"text": "Microsec", "value": "/g/11f00w21ts"}, {"text": "PeopleSearch Pte Ltd", "value": "/g/11c73ngn0w"}, {"text": "Randstad", "value": "/m/08pt1z"}, {"text": "Singapore Airlines", "value": "/m/015f2x"}, {"text": "TEKsystems (Allegis Group Singapore Pte Ltd)", "value": "/g/11b6g4bkv0"}, {"text": "ABBOTT LABORATORIES (SINGAPORE ) PRIVATE LIMITED", "value": "/m/09m57z3"}, {"text": "ACA Pacific Technology (S) Pte Ltd", "value": "/g/11dxprtc3c"}, {"text": "ADVANCE INTELLIGENCE PTE. LTD.", "value": "/g/11dymfkxss"}, {"text": "AXA", "value": "/m/04mn99"}, {"text": "Adecco Personnel Pte Ltd", "value": "/m/08gz46"}, {"text": "Adidas Group", "value": "/m/01jtml"}, {"text": "Adisseo", "value": "/g/120rsbhk"}, {"text": "Aetna, a CVS Health Company", "value": "/m/0kg8x"}, {"text": "Agency for Science, Technology and Research (A*STAR)", "value": "/m/0gmjcg"}, {"text": "Alibaba", "value": "/m/07s6ctl"}, {"text": "Argyll Scott", "value": "/g/11dxpk2374"}, {"text": "Autodesk", "value": "/m/018nm3"}, {"text": "Barry Callebaut", "value": "/m/03clky2"}, {"text": "BioMind", "value": "/g/11dymfr2l6"}, {"text": "CHUBB ASIA PACIFIC PTE. LTD.", "value": "/m/09m8xyh"}, {"text": "Cargobase", "value": "/g/11dxppfsjn"}, {"text": "Cargobase Pte Ltd", "value": "/g/11fy240nxm"}, {"text": "Continental AG", "value": "/m/05f_fl"}, {"text": "DKSH", "value": "/m/0dj2nh"}, {"text": "Dathena", "value": "/g/11dxprdn6y"}, {"text": "Dyson", "value": "/m/05cskg"}, {"text": "Eaton", "value": "/m/01qj3l"}, {"text": "Enggsol Pte Ltd", "value": "/g/11g9mnfmm1"}, {"text": "Ethos BeathChapman", "value": "/g/11c73z0xm0"}, {"text": "Eu Yan Sang", "value": "/m/03cl9hn"}, {"text": "Flintex Consulting Pte. Ltd.", "value": "/g/11h1z41pzb"}]}]}