{"search_metadata": {"id": "608279e4272aa54ac3ce123c", "status": "Success", "json_endpoint": "https://serpapi.com/searches/69d7b647493ebbd1/608279e4272aa54ac3ce123c.json", "created_at": "2021-04-23 07:40:20 UTC", "processed_at": "2021-04-23 07:40:20 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28data+analyst%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=80", "raw_html_file": "https://serpapi.com/searches/69d7b647493ebbd1/608279e4272aa54ac3ce123c.html", "total_time_taken": 1.15}, "search_parameters": {"q": "(data analyst) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "80"}, "jobs_results": [{"title": "Business Intelligence Lead for Commodity MNC", "company_name": "None", "location": "Singapore", "via": "via Jobs | Fidanto", "description": "Business Intelligence Lead for Commodity MNC Minimum 10 years of overall IT related experience with exposure on full software development life cycle, change management and/or systems support. Minimum 5 years of experience as a project manager/business analyst with focus in data modelling & data analysis, systems and business process analysis Microsoft Power BI certified useful but not a must Our client is a renowned and global MNC. For this role, you are the Business Intelligence Lead role tasked to manage, align and order the data / reporting / analytic requirements against the business priorities, while coordinating the development of these requirements with the IM Data Analytics team and overseeing the implementation of solutions. The role will involve … Interpreting/ acting upon multiple reporting and analytical requests to ensure that data sets, data ingestion, curation and any system development is coordinated Acting as the lynch pin and coordinator between the Business and IM... Data Analytics. Operating as part of the DA Hub and therefore ensuring the Commodity Trading is continually up-to-date with DA developments across the group, and also that DA has continuous sight of Commodity Trading requirements Being the CommodityTrading business expert in the knowledge of datasets (and where they are used), software capabilities, AAAP architecture and existing DA solutions The role holder is required to manage and implement the technical project delivery of overhauling the firm's commodity Trading end reporting and analytics across all Trading functions to enable automated self-service reporting and dashboards underpinned by a dedicated data warehouse, BI software, infrastructure and business processes. The role holder will manage stakeholder's expectation with agreed project prioritization and timeline to support continuous business improvement initiatives. Champion the use of Business Intelligence Software across all functions. The Business Intelligence Lead role reports to the Senior Business Technology Manager/Director, Diamond Trading and is based in Singapore.Key Responsibilities/Activities Business Intelligence (BI) Enablement Define, Design, Develop the necessary core reporting architecture to enable appropriate automated Business Intelligence software solutions with emphasise on Power BI/ ThoughtSpot. Work with the necessary key stakeholders in the Group IM teams to ensure delivery roadmap. Procure, budget and maintain the necessary BI Licences (Tableau) to relevant users in Digital Sales and key stakeholders. Ensure appropriate Information Security policies are implemented. Develop Training program for key BI software to ensure role holder is software superuser. Gain the necessary accreditations where appropriate. Provide the necessary training program and support for key users within Diamond Trading to ensure appropriate user adoption. Reporting Requirements Collaborate with the data/ reporting owners to fully define, document and gain functional sign off for reporting requirements. Analyse all complex data, business logic, processes and identify requirements for business enhancement in project. Perform assessment on all reporting requirements and develop long term strategy for various reporting solutions. Align multiple requirements to ensure data and development is optimised for maximum benefit Data Architecture Prepare architecture for data, prepare strategies and provide business object solutions as per requirements. Manage all data for transactional sources to enable effective reports/Dashboards. Plan and maintain development roadmap for dedicated AAAP architecture and data warehouse (DDMS) with the Group IM Power BI Reporting Delivery Deliver a development pipeline of automated Power BI Reporting & Dashboards prioritized by working with Senior Diamond Trading Management within scope of resources available. Manage full development cycle including Proof of Concept, Creation of Reports/dashboards, user testing and roll out PowerApps Delivery Deliver a development pipeline of automated PowerApps to support data and business process prioritized by working with Senior Diamond Trading Management within scope of resources available. Manage full development cycle including Proof of Concept, Creation of Power APPs, user testing and roll out Maintaining Tableau Reporting Delivery Maintain pipeline of automated Tableau Reporting & Dashboards prioritized by working with Senior Diamond Trading Management within scope of resources available. Manage migration of existing Tableau portfolio to a Microsoft Power BI platform including Proof of Concept, Creation of Reports/dashboards, user testing and roll out Ad Hoc / Support Manage the resolution of BI reporting issues by engaging with respective data, process, system owners and vendors to address issues impacting day to day operations of stakeholders. Work closely with the Trading analysts from operations, sales & commercial and finance to support their ad hoc analytical BI reporting requirements. People Management Line Management of report and data experts / in-business analytics developers. Manage recruitment cycle for further contractor recruitment for final sign off by Head of Function as required. Management of ad-hoc external Power BI Developer. Qualifications: Bachelor's degree holder in IT related discipline. Microsoft Power BI certified is useful but not a must Tableau Desktop I, II and III certifications and working experience using other BI tools are highly advantageous. Experience Minimum 10 years of overall IT related experience with exposure on full software development life cycle, change management and/or systems support. Minimum 5 years of experience as a project manager/business analyst with focus in data modelling & data analysis, systems and business process analysis Skills Excellent understanding of MS SQL scripting, DAX, M, Tableau Desktop. Power BI and Thoughtspot. Python, MS Excel formula/macros Strong understanding of the Microsoft Azure Advanced Analytics tech stack Ability to learn and work with Data Discovery Views (DDVs) and develop a strong understanding of the firm's Azure Advanced Analytics Platform (AAAP) Working knowledge, and advanced data knowledge on Salesforce, inventory applications (such as Dynamics AX) , Sales Planning System (SPS), SAP Business One, auction software and web integration is an advantage. Stakeholder Management – able to foster strong relationships at all levels both internally and externally. Understands and adheres to key Information Security Best Practice. Project Management – experience running BI project delivery ideally agile and waterfall style Project portfolio prioritization and road mapping Strong communication skills – able to tailor to non-technical users and multi-cultural team. Requirement Gathering Detail oriented. Data Modelling. To apply, please send your cv in word doc to resume@cap-cg.com . Please also include details on your current salary, expected salary and notice period in your cv.We regret to inform that only shortlisted candidates will be notified.Posted by:CAP Consulting (EA license: 14C7175)Caroline Poh (EA Registration: R1105649)Ad revised on 6 April 2021", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJCdXNpbmVzcyBJbnRlbGxpZ2VuY2UgTGVhZCBmb3IgQ29tbW9kaXR5IE1OQyIsImNvbXBhbnlfbmFtZSI6Ik5vbmUiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IlRhZThQMHBZcFI4amFHWmhBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9icyB8IEZpZGFudG8iLCJsaW5rIjoiaHR0cHM6Ly9zZy5maWRhbnRvLmNvbS9qb2JzL2pvYi1vcGVuaW5nL2J1c2luZXNzLWludGVsbGlnZW5jZS1hbmFseXN0cy9idXNpbmVzcy1pbnRlbGxpZ2VuY2UtbGVhZC1mb3ItY29tbW9kaXR5LW1uYy0yNzU0MzUyNjg/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Senior Data Analyst", "company_name": "DBS Bank Limited", "location": "Singapore", "via": "via Laimoon.com", "description": "Business Function\nGroup Technology and Operations (T&O) enables and empowers the bank with an efficient, nimble and resilient infrastructure through a strategic focus on productivity, quality & control, technology, people capability and innovation. In Group T&O, we manage the majority of the Bank's operational processes and inspire to delight our business partners through our multiple banking delivery channels.\nResponsibilities\n• Leverage on data analytics knowledge & experience to facilitate FO to uncover the business pattern.\n• Able to articulate clearly the business objective and the corresponding technical work to accomplish this.\n• Documenting and communicating the results of your efforts.\n• Expect incumbent to provide FO support on Tableau / UAT, as business is embarking on self-service journey for business intelligence platform.\n• Managing users requests and user roles.\n• Handling confidential data and information according to guidelines.\n• Developing dashboards for analysis... using Tableau from multiple production systems.\n• Managing and designing the reporting environment, including data sources, security, and metadata.\n• Supporting initiatives for data integrity and normalization.\n• Assessing tests and implementing new or upgraded software and assisting with strategic decisions on new systems.\n• Troubleshooting the reporting database environment and reports.\n• Evaluating changes and updates to source systems.\n• Training end users on new reports and dashboards.\n• Providing technical expertise on data storage structures, data mining, and data cleansing\nRequirements\n• Bachelor's degree in Computer Science, Finance, Business Administration or equivalent\n• Strong background in quantitative thinking and statistical data analysis.\n• 6-8 years of experience with SQL-based RDBMS\n• General 2-3 years of experience with Hadoop & NoSQL & any open stack ETL & query Tools\n• Good understanding of Data Analysis in relation to Business Process modelling\n• Expert in SQL queries & PL/SQL scripting\n• Experience in Data Modelling, Data Warehouse, ETL tools\n• Business Intelligence and Self-Service Reporting tools\n• Experience developing financial or accounting-related BI applications or dashboards\n• Experience with other leading BI tools a plus (Tableau)\n• Experience with other programming or scripting languages (e.g. Unix, SQL Script, JAVA)\n• Proficient in Microsoft Excel\n• Basic understanding of trading systems (Bloomberg, Reuters and FIX protocol)\n• Ability to prioritize and manage multiple concurrent tasks\n• Excellent time management, scheduling, and organizational skills\n• Ability to manage multiple tasks in a fast-paced environment\n• Ability to work effectively under tight timelines and schedules\n• Ability to work independently and as a contributing team member\n• Ability to sense the importance or impact of issues and situations and take appropriate actions\n• Must be flexible, innovative, and self-motivated\n• Must have the flexibility to work extra hours to meet corporate and departmental goals\nApply Now\nWe offer a competitive salary and benefits package and the professional advantages of a dynamic environment that supports your development and recognises your achievements. Technology", "extensions": ["8 days ago", "Full–time"], "detected_extensions": {"posted_at": "8 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgRGF0YSBBbmFseXN0IiwiY29tcGFueV9uYW1lIjoiREJTIEJhbmsgTGltaXRlZCIsImNvbXBhbnlfbWlkIjoiL20vMDFxN241IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoieWtHY1NJNUp1RU1CbWZ1ekFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZjQkNyY0JRVTVWWDA1eFUyaDNjVE5KUVVGQ1pWZE5lR1V3VFUxRmIwRjJObmt6TjNCVVdreERibU16VXpWbE1tUllTRkpwT0hoZmNFeG5TVmxKT1hGYVJUZE9XRkJCZEMxUGMxRlZRMkYzVDBOMlltWXRaRlJhUkdWdVJ6STViM1ZDYkROUVdVVkxla2x2Y25aNGJVd3RhWFpDYTJKTVZrZHVlWEJtY0dKQ0xUUkRhVkEzWjNSSmJGWm5RbUV0U0dodVEzUnhjakpxYTFJeWQzSllUelJIVjBkQk1XVmtiek5OTVRGTGMxbGZWaTFYUm1RMVpqbHZjRnBCRWhjMVNHMURXVTl5T0VwaExVTTVVSGRRT1UxaFJqaEJZeG9pUVU5TldWSjNRM1JxU2tWaE1XWTFkRm93WWtvNVZWUlpibk5pZEdsSlFXdzRVUSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzExIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExhaW1vb24uY29tIiwibGluayI6Imh0dHBzOi8vam9icy5sYWltb29uLmNvbS9qb2JzL2V4dGVybmFsdmlldy8yNTkyNjA5NT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Project Officer - Data Analytics and Software Development", "company_name": "Nanyang Technological University", "location": "Singapore (+1 other)", "via": "via Monster", "description": "Job Description :\nA Project Officer position is available in the School of Electrical & Electronic Engineering.\nJob Responsibilities\n• Undertake software development for machine learning based parameter estimation\n• Develop a simulation test-bed\n• Help other staff and the Principal Investigator work on demos and final report\n\nJob Requirements\n• Bachelor degree in either electrical engineering, software engineering, or computer science, specialized in data analytics and software development\n• Expert knowledge on software development and machine learning based data analysis techniques\n• Good programming skills, e.g., matlab, python or C/C++/Java\n• Any past experience in large-scale traffic systems will be a plus\n\nWe regret only shortlisted candidates will be notified.Hiring Institution: NTU", "extensions": ["25 days ago", "Full–time"], "detected_extensions": {"posted_at": "25 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE9mZmljZXIgLSBEYXRhIEFuYWx5dGljcyBhbmQgU29mdHdhcmUgRGV2ZWxvcG1lbnQiLCJjb21wYW55X25hbWUiOiJOYW55YW5nIFRlY2hub2xvZ2ljYWwgVW5pdmVyc2l0eSIsImNvbXBhbnlfbWlkIjoiL20vMGw0OWsiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJ6RC1HbEluOTJsR25uV0NzQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFcUlDQ3VJQlFVNVZYMDV4VTBvM2QybENVbkE1VGpCVmR6UnBURFp5UTBoeWMwVnNTMHh4Y2xCeVRuUmhTWE13WldKblZrRk5Za1pJY1Vac1ZXRXRNVUl0Um0xSlZISnFiVTFIWlZsVlNUTTBSME5qVTA5WFRETmlkREl0Y1VveE5WaDRaQzFWYWt0dVNYZHpiVFZMYTNvNVZGWkxOamR2WXpWS1NDMVJhMmR2Tm1KdVpFWmFOVUoxTVVRNFIySmpMV010T0dOWGNqUkZRa0pxZVhGSVRHdHVUMjFJTm1kMmFUUkdUa0oyYmpOUVoyb3hibFoyUldkblV6VlZaMDVXZUVGb1RFNUNSbFp1VVRCclFsTXpWRlZZY2tGa2VHNUhXRlJDUWtkRGNsWXRNRzFWWVY4elp4SVhOVWh0UTFsUGNqaEtZUzFET1ZCM1VEbE5ZVVk0UVdNYUlrRlBUVmxTZDBRdGNtZHVhVGw1TXpNeGRWOWlhelZyZWtRd1JHNVpYMlZLYzJjIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMTgiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTW9uc3RlciIsImxpbmsiOiJodHRwczovL3d3dy5tb25zdGVyLmNvbS5zZy9hbXAvam9iLXZhY2FuY3ktcHJvamVjdC1vZmZpY2VyLWRhdGEtYW5hbHl0aWNzLWFuZC1zb2Z0d2FyZS1kZXZlbG9wbWVudC1uYW55YW5nLXRlY2hub2xvZ2ljYWwtdW5pdmVyc2l0eS1zaW5nYXBvcmUtMjY3Mjc2MTkuaHRtbD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Sales Operations Analyst", "company_name": "MoneyOwl", "location": "Singapore (+1 other)", "via": "via Glassdoor", "description": "About Us\n\nMoneyOwl is a financial adviser and fund management company licensed by the MAS. We aim to empower consumers to live life to the full by helping them make wise money decisions easily and confidently.\n\nWe are Singapore’s 1st Bionic Financial Adviser! To be Bionic means to have the best of both worlds – humans and technology.\n\nBoth our dedicated client advisers and technology platforms come together to journey with our customers in every stage of their life.\n\nJob Description\n• Manage sales data and provide metrics and insights to support the decision-making and strategic planning of the sales and marketing teams\n• Analyse sales data and provide important visualisation and dashboards that communicates complex data clearly\n• Manage CRM (Hubspot) to add value by increasing sales team’s productivity with leads, transactions, and time management, often in collaboration with the Technology team\n• Maintain clean and robust data in the CRM platform\n• Define and refine structured sales... processes for efficiency including improving sales conversions, shorten sales cycles, and maximize wins\n• Play a key role in sales and operations planning, including project management to align diverse functions in the organisation for key projects\n• Serve as a valued business partner to the sales leaders\n\nQualifications\n\nRequirements\n• Degree in Business Administration, Finance, Economics, Computer Science or related qualifications\n• Minimum 3- 5 years of relevant working experience\n• In-depth working and administrative experience with Hubspot is required\n• Advanced Excel knowledge working with large data-sets (utilise complex formulas and can manipulate and transform data).\n• Ability to develop new ideas and creative solutions, as well as demonstrate skill and passion for problem solving and operational excellence\n• Meticulous and committed, with strong quantitative and qualitative analytical abilities.\n• An agile team player and a good communicator\n• Experience using AWS QuickSight or similar visualization software, and an understanding of SQL to retrieve queries is a plus\n• Project management certification or experience would be an advantage", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTYWxlcyBPcGVyYXRpb25zIEFuYWx5c3QiLCJjb21wYW55X25hbWUiOiJNb25leU93bCIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiSzY0NEpVa21RNDZLdlRTWUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBHbGFzc2Rvb3IiLCJsaW5rIjoiaHR0cHM6Ly93d3cuZ2xhc3Nkb29yLnNnL2pvYi1saXN0aW5nL3NhbGVzLW9wZXJhdGlvbnMtYW5hbHlzdC1tb25leW93bC1KVl9JQzMyMzU5MjFfS08wLDI0X0tFMjUsMzMuaHRtP2psPTQwNjYwMTcwMzBcdTAwMjZ1dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Project Manager ( Exp. in Govt Projects/ Business Intelligence/Analytics Projects ) (BB-4EB2A)", "company_name": "PEOPLE PROFILERS", "location": "Singapore (+1 other)", "via": "via BeBee", "description": "Job Description: ·Industry : Enterprise Software Solutions /BI/BA ·Must be PMP /CITPM certified ·Monday to Friday 9am to 6pm Job Scope Direct and coordinate the supply and implementation delivery existing and new projects.To ensure project tasks are monitored, tracked and completed on time, and also in liaison with the customer on potential timeline and deliverable changes etc.Manage internal team members and external partners when required as part of a project team and work process.Undertake and be responsible for the commercial P&L of the projects and ensure that all projects are within projected budget and required timeline.Manage and oversee all work and services which are to be executed or provided for this project, and all other matters including contract administration, monitoring of progress, installation and testing of equipment, technical personnel training, logistic support, documentation preparation and operation start-up RequirementsDiploma or Degree with At least five... (5) years of relevant experience in project management MUST be PMP /CITPM certified Experience in handling Government Projects, preferably Data Warehouse / Business Intelligence/Analytics projects.Experience in public sector projects would be an advantage. Good supervisory, people management and communications skills. Track records of managing successful delivery and implementation of IT projects.Good verbal and written communication skills are vital. Ability to write Project Management proposals (i.e. Implementation Plans, Communication Plans, User Requirement Specifications, Minutes, etc).Excellent presentations and communication skills. Monday to Friday 9am to 6pm JOB ID:7X3RWX All Successfulcandidates can expect a very competitive remuneration package and acomprehensive range of benefits. We regret that onlyshortlisted candidates will be notified People Profilers Pte Ltd 11 Collyer Quay, The Arcade, #13-01, Singapore 049317 EA Licence Number: 02C4944 EA Registration Number: R1108448 EAPersonnel: Tan Lili Gesse", "extensions": ["20 hours ago", "Full–time"], "detected_extensions": {"posted_at": "20 hours ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIgKCBFeHAuIGluIEdvdnQgUHJvamVjdHMvIEJ1c2luZXNzIEludGVsbGlnZW5jZS9BbmFseXRpY3MgUHJvamVjdHMgKSAoQkItNEVCMkEpIiwiY29tcGFueV9uYW1lIjoiUEVPUExFIFBST0ZJTEVSUyIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiSzNQNk5qRGlldUtZN2pUNEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCZUJlZSIsImxpbmsiOiJodHRwczovL3NnLmJlYmVlLmNvbS9qb2IvMjAyMTA0MjItZDU2MjJmYzE5OWQ2OWFlZDkzYmZlZTVjOTYyNGViMmE/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Performance Data Analyst â   Client Reporting Unit", "company_name": "Citi bank", "location": "Singapore", "via": "via Bayt.com", "description": "• Manage daily and monthly functions of performance reporting; ensure that the end-to-end process such as downloading and maintenance of financial data is handled properly.\n• Ensure the integrity of data in the performance systems so that performance reports can be generated to our clients\n• Check the integrity of data use in the performance systems and generate timely monthly return for client RRG report, which is sent to the client within 10 business day every month.\n• To undertake daily and monthly reviews of performance data and provide support to bankers/counsellors enquiries\n• To be able to take up the coordination on the end-to-end operations such as providing updates to both global and regional teams and peers on metrics and global releases\n• Other responsibilities include handling of enquiries or gathering feedback from bankers/counsellors on performance reporting and participate in initiatives to continue to improve our service level in client reporting\n• Participation in... User Acceptance Testing, initiate and formulate test scripts, conducting end-to-end testing\n• Production Checkout for Performance-related items for Regional and Global Release enhancements, ensuring that enhancements are promoted smoothly.\n• Provide training to junior analysts; guide the team in the day-to-day reviews of performance analysis and reconciliation\n\nQualifications:\n• Good degree from a recognized university in Finance or equivalent\n• At least 3- 4 years' experience in Banking or related areas\n• Basic knowledge of banking products and investment instruments\n• Knowledge of Visual Basic, MS Access and SQL would be advantage\n• Resourceful, proactive and possess strong interpersonal skills.\n• Team player who is committed to work under minimal supervision.\n\n-------------------------------------------------\n\nJob Family Group:\n\nCustomer Service\n\n-------------------------------------------------\n\nJob Family:\n\nInstitutional Client Management\n\n------------------------------------------------------\n\nTime Type:\n\nFull time\n\n------------------------------------------------------\n\nCiti is an equal opportunity and affirmative action employer.\n\nQualified applicants will receive consideration without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.\n\nCitigroup Inc. and its subsidiaries (\"Citi”) invite all qualified interested applicants to apply for career opportunities. If you are a person with a disability and need a reasonable accommodation to use our search tools and/or apply for a career opportunity review Accessibility at Citi.\n\nView the \"EEO is the Law\" poster. View the EEO is the Law Supplement.\n\nView the EEO Policy Statement.\n\nView the Pay Transparency Posting", "extensions": ["15 days ago", "Full–time"], "detected_extensions": {"posted_at": "15 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQZXJmb3JtYW5jZSBEYXRhIEFuYWx5c3Qgw6IgICBDbGllbnQgUmVwb3J0aW5nIFVuaXQiLCJjb21wYW55X25hbWUiOiJDaXRpIGJhbmsiLCJjb21wYW55X21pZCI6Ii9tLzAxZGZiNiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Im1JNXUtZ3pBcU5ZSEVzOGFBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1SUJDcUlCUVU1VlgwNXhVMGwwWms0M1JWRTFUUzF5U0ZoNk0xYzRZemg1TldKTk1XRTBMV2g1Y0ZocFdGZE5UM28xY0V0eGRtRk1PVzFTWW0wMVFqWjRhRlpXWW1GRWFYYzBlR2RGV21ablgxSTJOVlpOTFVsaGJWOUtOVk5oY1dST05HcGtPRTlIYWtwR1dtMDBjaTB0TUVKemFVRjROMnAzZWxOaU1HbDNWRzlYV1VSTk1YUnhMVTVQV1ZwdWVIZGFMVUZ3VTE5NlNsWkpabGcyWm5od2FsOU5OVXhCRWhjMVNHMURXVTl5T0VwaExVTTVVSGRRT1UxaFJqaEJZeG9pUVU5TldWSjNRM2MzVERkVkxVMW1hamN6WkdaVmRsVnFjbU5UT1dSblRYWndkdyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzM2IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJheXQuY29tIiwibGluayI6Imh0dHBzOi8vd3d3LmJheXQuY29tL2VuL3NpbmdhcG9yZS9qb2JzL3BlcmZvcm1hbmNlLWRhdGEtYW5hbHlzdC0lQzMlQTItY2xpZW50LXJlcG9ydGluZy11bml0LTU5MzczMTUyLz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior Data Scientist", "company_name": "AIR LIQUIDE INDUSTRIAL SERVICES PTE LTD", "location": "Singapore (+1 other)", "via": "via Singapore", "description": "Roles & Responsibilities Missions We are looking for a Senior Data Scientist who will support our business with insights gained from analyzing company data. The ideal candidate is adept at using large data sets to find opportunities for business optimization and using models to test the effectiveness of different courses of action. They must have strong experience using a variety of data mining/data analysis methods, using a variety of data tools, building and implementing models, using/creating algorithms and creating/running simulations. They must have a proven ability to drive business results with their data-based insights. They must be comfortable working with a wide range of stakeholders and functional teams. The right candidate will have a passion for discovering solutions hidden in large data sets and working with stakeholders to improve business outcomes.Competencies and Profile Master or Bachelor Degree graduate in Statistics, Mathematics or Computer Science 5 - 7 years of... relevant work experience in data science field Strong problem solving skills with an emphasis on product development. Experience using statistical computer languages (R, Python, SLQ, etc.) to manipulate data and draw insights from large data sets. Experience working with and creating data architectures. Knowledge of a variety of machine learning techniques (clustering, decision tree learning, artificial neural networks, etc.) and their real-world advantages/drawbacks. Knowledge of advanced statistical techniques and concepts (regression, properties of distributions, statistical tests and proper usage, etc.) and experience with applications. Excellent written and verbal communication skills for coordinating across teams. A drive to learn and master new technologies and techniques. Experience visualizing/presenting data for stakeholders. Ability to work as part of a distributed team. Ability to utilize and lead interns on projects. Specific Training or Certification; Data Science, R or Python. **We thank you for your interest in Air Liquide. Interested applicants are encouraged to send in a detailed resume, including reason for leaving for past employment. Please be informed that only shortlisted candidates would be notified.**Requirements - Air Liquide Asia is the OHQ office of the Air Liquide Group, the world leader in industrial, medical and specialty gases and related services. The Company has a strong and growing presence in Asia, with a 4400 employee population over 15 countries in Asia. We are inviting applications for the following positions: Additional Company Information Registration No. 198801540G Company Size 1 - 50 Employees Benefits & Others Medical, Regular hours, Mondays - Fridays, Casual (e.g. T-shirts", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgRGF0YSBTY2llbnRpc3QiLCJjb21wYW55X25hbWUiOiJBSVIgTElRVUlERSBJTkRVU1RSSUFMIFNFUlZJQ0VTIFBURSBMVEQiLCJjb21wYW55X21pZCI6Ii9nLzExaGc1NXkxcmIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJERUZzMkNORlVVX3NWWno0QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFcmNDQ3ZjQlFVNVZYMDV4VVcxb1N6WmFTM0ozU3pSNlZFUmxOalpmYkRkNlpFRmlRbFJUZWpNNWRHUTFSVTlHVGpOTE0xQkxVSEJuUjBobFduWTRkRXByUWpGVFVITkxTakoyY21saFZETnpYelJqY0RWWU1GTlFWVXd3WWw5MlZ6VmpXWEZQVkU5YU5uVnhkeTAxYzFwRWRYaGZPVEV6YXpaT2JuVjRlUzFvU2tsd2JscHpjVEpSUlVwNk4xWkxNbnBQZVRZMGNraEJhVWRJWVhwMGJUaExZMmh4V2xabGVIWlZkMHBwTm01eWNWSmZSa053UVUxTVUxbFNTbVJzV0RoR0xVYzJlbmh3YzNSbE9XSjBSMEZGYWxGU1JXWTJjakJmUmpCbWNrcEtOMHB4WjBKTGJrSmFTRFoxU0VrNU5GbG5OV1ZNYXkxV2FEUk1XUklYTlVodFExbFBjamhLWVMxRE9WQjNVRGxOWVVZNFFXTWFJa0ZQVFZsU2QwRnpVVEZKWldkdmFIUjZabVJaU0VWTGJVUlNRMHhCZVhCV1MyYyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzQzIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFNpbmdhcG9yZSIsImxpbmsiOiJodHRwczovL3NnLmZpZGFudG8uY29tL2pvYnMvam9iLW9wZW5pbmcvZGF0YS13YXJlaG91c2luZy1zcGVjaWFsaXN0cy9zZW5pb3ItZGF0YS1zY2llbnRpc3QtMjc1NTE4MTQ5P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Data Analytic, BA&I IBOR Transition Team", "company_name": "ClearanceJobs", "location": "Singapore", "via": "via LinkedIn", "description": "About Standard Chartered\n\nWe are a leading international bank focused on helping people and companies prosper across Asia, Africa and the Middle East.\n\nTo us, good performance is about much more than turning a profit. It's about showing how you embody our valued behaviours - do the right thing, better together and never settle - as well as our brand promise, Here for good.\n\nWe're committed to promoting equality in the workplace and creating an inclusive and flexible culture - one where everyone can realise their full potential and make a positive contribution to our organisation. This in turn helps us to provide better support to our broad client base.\n\nThe Role Responsibilities\n\nBusiness\n• The IBOR transition is a key strategic project Bank wide, out team the - Analytic and Business Insight team, ensure the production and delivery of quality IBOR transition data for Senior management for key decision making prioritisation and risk management. As well our team delivers regulatory... reporting to the PRA and local regulators worldwide. The role in question will support the team delivery.\nProcesses\nShare Responsibility\n• The Role holder will partly engage key stakeholders across divisions on MI requests around the IBOR transition project, and as part of our overall process will apply data cleansing strategies to enrich the source data for a better analytics and insight for the business and client outreach.\n• As part of the Data quality Assessment and Remediation process Identify critical data quality issues that would impact downstream reporting by:\n• Perform data/ database reconciliations and committee presentations generation, provide in-depth analysis, and succinct explanations of results obtained to key business stakeholders\n• Collaborate and provide day-to-day support to all relevant business units, Group Finance, Treasury, Operation\n• Engage stakeholders to raise the bar on quality delivery, collaboration and innovation.\nRisk Management\n• Keep track of emerging regulatory expectations in terms of IBOR transition and evaluate the present state of infrastructure and processes of the organization against this. Data Strategy, Architecture and Transformation to derive the data strategy roadmap\n• Defines data requirements and performs data inventory analysis to qualify risk issues in data sources and attributes\n• Training and communications efforts by the IBOR Central Team.\nGovernance\nCoordinate with Business and Functional leads and update the programme central team on any key issues and Risk\n• Ensure information is correctly communicated and where necessary issue are escalated to management in a timely manner\n• Share ideas and best practice information with colleagues. Thinks beyond current boundaries of the role and contributes ideas.\nRegulatory & Business Conduct\n• Display exemplary conduct and live by the Group's Values and Code of Conduct.\n• Take personal responsibility for embedding the highest standards of ethics, including regulatory and business conduct, across Standard Chartered Bank. This includes understanding and ensuring compliance with, in letter and spirit, all applicable laws, regulations, guidelines and the Group Code of Conduct.\n• Lead to achieve the outcomes set out in the Bank's Conduct Principles: Fair Outcomes for Clients; Effective Financial Markets; Financial Crime Compliance; The Right Environment.\n• Effectively and collaboratively identify, escalate, mitigate and resolve risk, conduct and compliance matters.\nKey Stakeholders\nGB/CB/Lending/CF/Loan Syndication/Agency Business/FM Stream Leads\n• Group and Country Business Heads, COOs and their representatives\n• IBOR Project Managers supporting the workstreams\n• Functions stakeholders - Legal, Compliance, Operational Risk. Finance, IMO, GLS etc\n• The broader IBOR Programme team.\nOther Responsibilities\n• Leverage the opportunity provided by Corporate Social Responsibility to enhance the Group's internal and external reputation and indirectly influence the bottom line.\n• Promote the Group's brand and Here for good with clients and regulators.\n• Perform other responsibilities assigned under Group, Country, Business or Functional policies and procedures.\n• Maintain effective communication with key stakeholders and staff.\nOur Ideal Candidate\n\nAdditional Qualifications\n\nThe candidate must be a self-motivated, proactive and resourceful with an excellent network with ability to work in a fast-paced environment against an uncertain regulatory back-drop.\n• Data analytics, Interested Rate Products.\n• Banking domain involving one or more of the following: Product Control, Market Risk, Middle Office, Data\n• Good knowledge of Rate products\n• Experience in implementation of projects ideally through multi-country operations teams\n• Experience as the key liaison with stakeholders to define and execute processes - BAU and Change\n• Experience in software design and development\n• CFA, FRM or CQF certification will be consider a plus\n• stakeholder management skills, able to converse in appropriate levels of detail with Business Heads, COOs/CIOs, Frontline, Middle Office/Operations Risk, Legal & Compliance (L&C), etc.\n• Desirable Experience in any of the following : SAS, SQL, Python, R, VBA, Tableau and MSTR.\n• R Exp & Python Exp is Preferred\n• Bank Exp in Risk/Product Control Preferred\n• Min 3 yrs overall exp preferred.\nI ntrinsic traits\n• Attention to detail\n• Curiosity\n• High degree of responsibility\n• Self-motivated, and works well in teams\n• Very structured and very disciplined\n• Good written and verbal communication skills\n• Able to challenge/ question\n\nApply now to join the Bank for those with big career ambitions.\n\nTo view information on our benefits including our flexible working please visit our career pages . We welcome conversations on flexible working", "extensions": ["7 days ago", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEYXRhIEFuYWx5dGljLCBCQVx1MDAyNkkgSUJPUiBUcmFuc2l0aW9uIFRlYW0iLCJjb21wYW55X25hbWUiOiJDbGVhcmFuY2VKb2JzIiwiY29tcGFueV9taWQiOiIvZy8xMWZ5MXBmdDl2IiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiTlE3aFlEelNwOW5KWnpxM0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVJQkNxSUJRVTVWWDA1eFZFdHJXRXQyTkhCbVQzVnVia3BhZGxoZldqZEtUV1JyTm10V1gxaElTR3hTZG1aelEzZExjVkpKTkcxUWFqUnNPQzE1T1VzdFpWbGZlRWRuVUY5aGJFdGpialkzTFVzemFUSk9YMmhaY1MwMWRpMWFhVVJvVGxWUk5HdEZXbTl4U2swdE9YZzJlbXhLTkVKa1MzTlBlSHA0VVZBME1rNVdZM1l3UW5oalJUUkhhbGxDZWpWdkxWbHpUbGhNTkVsS1NVWTFSV3RZUkhkS2FFNW5FaGMxU0cxRFdVOXlPRXBoTFVNNVVIZFFPVTFoUmpoQll4b2lRVTlOV1ZKM1JFNUljV1ZmYXpkQlJtbHBWbFJCT0U5YVVUWmZVRlYzVW1kM1p3IiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNTAiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGlua2VkSW4iLCJsaW5rIjoiaHR0cHM6Ly9zZy5saW5rZWRpbi5jb20vam9icy92aWV3L2RhdGEtYW5hbHl0aWMtYmEtaS1pYm9yLXRyYW5zaXRpb24tdGVhbS1hdC1jbGVhcmFuY2Vqb2JzLTI1MDcxMTM3NzE/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "IBOR Data Analytics", "company_name": "Standard Chartered", "location": "Singapore", "via": "via Monster", "description": "About Standard Chartered\nWe are a leading international bank focused on helping people and companies prosper across Asia, Africa and the Middle East.\nTo us, good performance is about much more than turning a profit. It%26#39;s about showing how you embody our valued behaviours - do the right thing, better together and never settle - as well as our brand promise, Here for good.\nWe%26#39;re committed to promoting equality in the workplace and creating an inclusive and flexible culture - one where everyone can realise their full potential and make a positive contribution to our organisation. This in turn helps us to provide better support to our broad client base.\nThe Role Responsibilities\nBusiness\nInformed\n• The IBOR transition is a key strategic project Bank wide, out team the - Analytic and Business Insight team, ensure the production and delivery of quality IBOR transition data for Senior management for key decision making prioritisation and risk management. As well our team delivers... regulatory reporting to the PRA and local regulators worldwide. The role in question will support the team delivery.\n\nProcesses\nShare Responsibility\n• The Role holder will partly engage key stakeholders across divisions on MI requests around the IBOR transition project, and as part of our overall process will apply data cleansing strategies to enrich the source data for a better analytics and insight for the business and client outreach.\n• As part of the Data quality Assessment and Remediation process Identify critical data quality issues that would impact downstream reporting by:\n• Perform data/ database reconciliations and committee presentations generation, provide in-depth analysis, and succinct explanations of results obtained to key business stakeholders\n• Collaborate and provide day-to-day support to all relevant business units, Group Finance, Treasury, Operation\n• Engage stakeholders to raise the bar on quality delivery, collaboration and innovation.\n\nRisk Management\nInformed\n• Keep track of emerging regulatory expectations in terms of IBOR transition and evaluate the present state of infrastructure and processes of the organization against this. Data Strategy, Architecture and Transformation to derive the data strategy roadmap\n• Defines data requirements and performs data inventory analysis to qualify risk issues in data sources and attributes\n• Training and communications efforts by the IBOR Central Team.\n\nGovernance\nShare responsibility\n• Coordinate with Business and Functional leads and update the programme central team on any key issues and Risk\n• Ensure information is correctly communicated and where necessary issue are escalated to management in a timely manner\n• Share ideas and best practice information with colleagues. Thinks beyond current boundaries of the role and contributes ideas.\n\nRegulatory %26amp; Business Conduct\n• Display exemplary conduct and live by the Group%26rsquo;s Values and Code of Conduct.\n• Take personal responsibility for embedding the highest standards of ethics, including regulatory and business conduct, across Standard Chartered Bank. This includes understanding and ensuring compliance with, in letter and spirit, all applicable laws, regulations, guidelines and the Group Code of Conduct.\n• Lead to achieve the outcomes set out in the Bank%26rsquo;s Conduct Principles: Fair Outcomes for Clients; Effective Financial Markets; Financial Crime Compliance; The Right Environment.\n• Effectively and collaboratively identify, escalate, mitigate and resolve risk, conduct and compliance matters.\n\nKey Stakeholders\n• GB/CB/Lending/CF/Loan Syndication/Agency Business/FM Stream Leads\n• Group and Country Business Heads, COOs and their representatives\n• IBOR Project Managers supporting the workstreams\n• Functions stakeholders %26ndash; Legal, Compliance, Operational Risk. Finance, IMO, GLS etc\n• The broader IBOR Programme team.\n\nOther Responsibilities\n• Leverage the opportunity provided by Corporate Social Responsibility to enhance the Group%26rsquo;s internal and external reputation and indirectly influence the bottom line.\n• Promote the Group%26rsquo;s brand and Here for good with clients and regulators.\n• Perform other responsibilities assigned under Group, Country, Business or Functional policies and procedures.\n• Maintain effective communication with key stakeholders and staff.\n\nOur Ideal Candidate\nThe candidate must be a self-motivated, proactive and resourceful with an excellent network with ability to work in a fast-paced environment against an uncertain regulatory back-drop. Additional qualifications:\n• Data analytics, Interested Rate Products.\n• Banking domain involving one or more of the following: Product Control, Market Risk, Middle Office, Data\n• Good knowledge of Rate products\n• Experience in implementation of projects ideally through multi-country operations teams\n• Experience as the key liaison with stakeholders to define and execute processes %26ndash; BAU and Change\n• Experience in software design and development\n• CFA, FRM or CQF certification will be consider a plus\n• stakeholder management skills, able to converse in appropriate levels of detail with Business Heads, COOs/CIOs, Frontline, Middle Office/Operations Risk, Legal %26amp; Compliance (L%26amp;C), etc.\n• Desirable Experience in any of the following : SAS, SQL, Python, R, VBA, Tableau and MSTR.\n• R Exp %26amp; Python Exp is Preferred\n• Bank Exp in Risk/Product Control Preferred\n• Min 3 yrs overall exp preferred.\n\nIntrinsic traits\n• Attention to detail\n• Curiosity\n• High degree of responsibility\n• Self-motivated, and works well in teams\n• Very structured and very disciplined\n• Good written and verbal communication skills\n• Able to challenge/ question\n\nApply now to join the Bank for those with big career ambitions.\nTo view information on our benefits including our flexible working please visit our . We welcome conversations on flexible working", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJJQk9SIERhdGEgQW5hbHl0aWNzIiwiY29tcGFueV9uYW1lIjoiU3RhbmRhcmQgQ2hhcnRlcmVkIiwiY29tcGFueV9taWQiOiIvbS8wMmhzemsiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJhY2VIUzhUYW8yWU9PWVVPQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdmNCQ3JjQlFVNVZYMDV4VTJWdU5rTmxjWE56YTNGd2NWVTJRbnBvVEc5cWFHcERVMnhUT1hKeWRWa3pZMWR4Y1VGNVJscGFaVXhWYmpsa2JWRndNREZRZEd4NFVsaEdUbWQwUW5oeFdFdEthemhmWVV0VGRsZHdlbEJMZFd3NWVtcFNRa3hKZVZOWGJERXhiM2g1ZUVSc1UyNUpSM05RZEVGUWJIcEdYM052ZG10R1kyMDJNMFpGYWpoa09XUmhPR1pEYjI1Wk1taHlURzVGVHpoM1lrbHRRV2xwVlhSRVNVbGZkVzkxTlV4NGJXVnhRbXh5U0RaMVMyVkpFaGMxU0cxRFdVOXlPRXBoTFVNNVVIZFFPVTFoUmpoQll4b2lRVTlOV1ZKM1EzRkJaa2hNYTBKMFpWVjFRbDlzWlhaUk1VSjNWV2hrZDI4eFVRIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNTgiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTW9uc3RlciIsImxpbmsiOiJodHRwczovL3d3dy5tb25zdGVyLmNvbS5zZy9hbXAvam9iLXZhY2FuY3ktaWJvci1kYXRhLWFuYWx5dGljcy1zdGFuZGFyZC1jaGFydGVyZWQtc2luZ2Fwb3JlLTI3MDgwMjc5Lmh0bWw/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Assistant VP, Data Analyst, Group Retail Operations", "company_name": "United Overseas Bank", "location": "Singapore", "via": "via Laimoon.com", "description": "Posting Date: 15-Apr-2021\n\nLocation: Raffles Place, Singapore, SG\n\nCompany: United Overseas Bank Limited\n\nAbout UOB\nUnited Overseas Bank Limited (UOB) is a leading bank in Asia with a global network of more than 500 branches and offices in 19 countries and territories in Asia Pacific, Europe and North America. In Asia, we operate through our head office in Singapore and banking subsidiaries in China, Indonesia, Malaysia and Thailand, as well as branches and offices.\nOur history spans more than 80 years. Over this time, we have been guided by our values - Honorable, Enterprising, United and Committed. This means we always strive to do what is right, build for the future, work as one team and pursue long-term success. It is how we work, consistently, be it towards the company, our colleagues or our customers.\n\nAbout the Department\nThe Technology and Operations function is comprised of five teams of specialists with distinct capabilities: business partnership, technology, operations... risk governance and planning support and services. We work closely together to harness the power of technology to support our physical and digital banking services and operations. This includes developing, centralising and standardising technology systems as well as banking operations in Singapore and overseas branches.\n\nJob Responsibilities\nWe are looking for an individual with data engineering and analytics experience to join Group Retail Banking and Channels Technology & Operations to help Group Retail Operations organize and wrangle valuable information from big data. The individual should be a self-starter, energetic and have a passion for both problem-solving and telling compelling stories using data. He/she will also work closely with Operation Centers to provide data analytic and insights for transformation initiatives.\n• Design data driven solutions independently to enable Group Retail Operations in identifying process and operational improvement opportunities\n• Design, develop and maintain scalable and flexible data models and pipelines\n• Implement processes and systems to monitor data quality, ensuring production data is always accurate and available for key stakeholders and business processes\n• Ensure regular interaction with key stakeholders to understand their business objectives. Proactively recommend how you think data & analytics could help them achieve their goals.\n• Collaborate with Operation Centers to create, design and push end-user and usage analytics through digital platforms\n• Identify and collect measurements of success of each transformation to prepare and deliver usage/metrics reports to stakeholders with the use of slide presentations, product demonstrations, email newsletters or white papers.\n\nJob Requirements\n• Bachelor's Degree, preferably in a quantitative field such as Computer Science, Data Analytics, Statistics or Mathematics\n• At least 3 years of hands-on technical experience in data engineering and/or analytics\n• Experience in big data tool (R, Hadoop etc) or data visualization & interactive dashboarding (eg Qlik, Tableau) would be an added advantage\n• Experience in agile approach, actively driving test and learn with data driven insights\n• High attention to details, meticulous and able to work in an ambiguous environment with minimal supervision\n• Proven ability to work creatively and analytically in a problem-solving environment\n• Strong communication / inter-personal skills\n• Assertive in stakeholder's management\n• Strong understanding of Consumer Banking Products\n\nBe a part of UOB Family\nUOB is an equal opportunity employer. UOB does not discriminate on the basis of a candidate's age, race, gender, color, religion, sexual orientation, physical or mental disability, or other non-merit factors. All employment decisions at UOB are based on business needs, job requirements and qualifications. If you require any assistance or accommodations to be made for the recruitment process, please inform us when you submit your online application.\n\nApply now and make a difference.\n\nTechnology", "extensions": ["5 days ago", "Full–time"], "detected_extensions": {"posted_at": "5 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBc3Npc3RhbnQgVlAsIERhdGEgQW5hbHlzdCwgR3JvdXAgUmV0YWlsIE9wZXJhdGlvbnMiLCJjb21wYW55X25hbWUiOiJVbml0ZWQgT3ZlcnNlYXMgQmFuayIsImNvbXBhbnlfbWlkIjoiL20vMDRnamQxIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiVndZdUpGT3Y2TC1waXlZdEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZjQkNyY0JRVTVWWDA1eFVsRTRjbnByVGtkaVNuVTBMVlI0Tm1aeVVITnBXV2Q1ZEV4aGNsb3dVa0pNYW5sWWFYbGFNV0pQV0cweFdWSkphMk5qUWt4WVpYWndTVmwyUmpaNU5VTndhRWhEVURRMVlsUkJVR014V0ZOWlpVdzRVWEV4VEZjd2MydzJWM1YzZGpSTWFFeDFaVXBDVFhkcFUyOUlRMDlrTVd4eGJESkRRVXhhVUVGVVVXcFVVeTFVYzFneWFXWlJUM2cyTlZoTVJYbDJZbGQ2UmtoaE0yeEZhUzFQYWpWNFpHZEROWE5KVDBSbldXcHdjMDUzRWhjMVNHMURXVTl5T0VwaExVTTVVSGRRT1UxaFJqaEJZeG9pUVU5TldWSjNRemxEUkhKTVIzaDVOMlpJWkdwNGRFczNXa0ZqUlhCaFJUTXladyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzY1IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExhaW1vb24uY29tIiwibGluayI6Imh0dHBzOi8vam9icy5sYWltb29uLmNvbS9qb2JzL2V4dGVybmFsdmlldy8yNjAxMzYxNj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Business Operations", "value": "GC06"}, {"text": "Science and Engineering", "value": "GC27"}, {"text": "Management", "value": "GC18"}, {"text": "Accounting and Finance", "value": "GC01"}, {"text": "Advertising and Marketing", "value": "GC03"}, {"text": "Admin and Office", "value": "GC02"}, {"text": "Human Resources", "value": "GC15"}, {"text": "Legal", "value": "GC17"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Sales and Retail", "value": "GC26"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "Data analyst", "value": "data analyst"}, {"text": "Business analyst", "value": "business analyst"}, {"text": "Analyst", "value": "analyst"}, {"text": "Associate", "value": "associate"}, {"text": "Senior", "value": "senior"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Data scientist", "value": "data scientist"}, {"text": "Insights analyst", "value": "insights analyst"}, {"text": "Operations analyst", "value": "operations analyst"}, {"text": "Project manager", "value": "project manager"}, {"text": "Project officer", "value": "project officer"}, {"text": "Administrators", "value": "administrators"}, {"text": "Builder", "value": "builder"}, {"text": "Business", "value": "business"}, {"text": "Cloud consultant", "value": "cloud consultant"}, {"text": "Control analyst", "value": "control analyst"}, {"text": "Data engineer", "value": "data engineer"}, {"text": "Executive", "value": "executive"}, {"text": "Intelligence analyst", "value": "intelligence analyst"}, {"text": "It analyst", "value": "it analyst"}, {"text": "Performance manager", "value": "performance manager"}, {"text": "Product analyst", "value": "product analyst"}, {"text": "Research analyst", "value": "research analyst"}, {"text": "Research assistant", "value": "research assistant"}, {"text": "Senior analyst", "value": "senior analyst"}, {"text": "Senior associate", "value": "senior associate"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Solution architect", "value": "solution architect"}, {"text": "Support analyst", "value": "support analyst"}, {"text": "Systems analyst", "value": "systems analyst"}, {"text": "Technology consulting", "value": "technology consulting"}, {"text": "Unit", "value": "unit"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Internship", "value": "INTERN"}, {"text": "Part-time", "value": "PARTTIME"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Accounting", "value": "/business/naics2007/5412"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Mining", "value": "/business/naics2007/21"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Travel", "value": "/business/naics2007/5615"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "DBS Bank", "value": "/m/01q7n5"}, {"text": "SingTel", "value": "/m/020zfl"}, {"text": "United Overseas Bank", "value": "/m/04gjd1"}, {"text": "Nanyang Technological University", "value": "/m/0l49k"}, {"text": "GovTech Singapore", "value": "/g/11gh0528nq"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "Bank of Singapore", "value": "/m/0r3vczm"}, {"text": "Binance", "value": "/g/11hcz1r4wl"}, {"text": "Citi", "value": "/m/01dfb6"}, {"text": "Cognizant Singapore, Cognizant Technology Solutions", "value": "/m/03bf9h"}, {"text": "Dyson", "value": "/m/05cskg"}, {"text": "EPAM Systems", "value": "/m/0dlnrc"}, {"text": "Ernst & Young", "value": "/m/0g9jc"}, {"text": "Goldman Sachs Services Private Limited", "value": "/g/11g9mm5tzn"}, {"text": "PEOPLE PROFILERS", "value": "/g/11dxq43n_6"}, {"text": "PwC Singapore", "value": "/g/11dxpz2lh8"}, {"text": "Sciente International", "value": "/g/11c73gj19n"}, {"text": "AIR LIQUIDE INDUSTRIAL SERVICES PTE LTD", "value": "/g/11hg55y1rb"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Accounting and Corporate Regulatory Authority", "value": "/m/09g7_b3"}, {"text": "Agency for Integrated Care", "value": "/g/11c73jd3yt"}, {"text": "Amazon", "value": "/m/0mgkg"}, {"text": "Amazon Web Services Singapore", "value": "/m/0rznzt1"}, {"text": "BeathChapman Pte Ltd", "value": "/g/11f01b3y2c"}, {"text": "Big Cloud", "value": "/g/11c743lwsr"}, {"text": "Bloomberg", "value": "/m/027sm6"}, {"text": "Burpple", "value": "/g/11dxps5yv5"}, {"text": "CPF Board", "value": "/m/0615qb"}, {"text": "ClearanceJobs", "value": "/g/11fy1pft9v"}, {"text": "Comfort Transportation Pte Ltd", "value": "/g/11f01gw2xt"}, {"text": "Credit Agricole Group", "value": "/m/028vbm"}, {"text": "DYSON OPERATIONS PTE. LTD.", "value": "/g/11fy29mc6g"}, {"text": "Deloitte", "value": "/m/02spfd"}, {"text": "Direct Search Asia", "value": "/g/11fy260nhz"}, {"text": "EngageRocket", "value": "/g/11c73p5x97"}, {"text": "Epson Singapore", "value": "/g/11dxpfq_tf"}, {"text": "Expedia Group", "value": "/m/03gq420"}, {"text": "GLOBALFOUNDRIES Singapore", "value": "/m/05pcrz0"}, {"text": "Goldman Sachs", "value": "/m/01xdn1"}, {"text": "Google", "value": "/m/045c7b"}, {"text": "Ideallss", "value": "/g/11g70fpjm5"}, {"text": "IoTalents", "value": "/g/11dxq187wm"}, {"text": "JAC Recruitment", "value": "/g/121g71_s"}]}]}