{"search_metadata": {"id": "60827ec14b91eb45de74e941", "status": "Success", "json_endpoint": "https://serpapi.com/searches/4cab5260b288ef37/60827ec14b91eb45de74e941.json", "created_at": "2021-04-23 08:01:05 UTC", "processed_at": "2021-04-23 08:01:05 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28consultant%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=220", "raw_html_file": "https://serpapi.com/searches/4cab5260b288ef37/60827ec14b91eb45de74e941.html", "total_time_taken": 2.77}, "search_parameters": {"q": "(consultant) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "220"}, "jobs_results": [{"title": "Messaging Consultant - Singapore", "company_name": "NTT Ltd.", "location": "Singapore", "via": "via LinkedIn", "description": "In a constantly changing world, we work together with our people, clients and communities to enable them to fulfill their potential to do great things. We believe that by bringing everyone together, we can solve problems using innovative technology that can create a world that is sustainable and secure. At NTT, we encourage you to remain continuously curious, as that is what keeps you fast, flexible and relevant. No two days will be the same but that is what will help you grow and realize your full potential. The power is in your hands to do great things. It’s time to lead the change, be the authentic you, to solve difficult challenges, to set the pace of change and to unleash your potential. Want to be a part of our team?The MS Engineer (L3) is responsible for providing a service to clients by proactively identifying and resolving technical incidents and problems. Through preemptive service incident and resolution activities, as well as product reviews, operational improvements... operational practices and quality assurance this role will maintain a high level of service to clients. Their primary objective is to ensure zero missed service level agreement (SLA) conditions. The MS Engineer (L3) is responsible for managing tickets of high complexity, conducts advanced and complicated tasks, and provides resolution to a diverse range of complex problems. This position uses considerable judgement and independent analysis within defined policies and practices. Applies analytical thinking and deep technical expertise in achieving client outcomes, while coaching and mentoring junior team members across functions. Radford reference: \"Performs IT functions such as design, analysis, evaluation, testing, debugging and implementation of applications programs supporting the company infrastructure business processes and operations and/or network-based (cloud) product systems. Analyzes, installs, acquires, modifies and supports operating systems, database or utilities software. Plans, conducts and directs the analysis of business problems with automated systems solutions. Analyzes, designs, acquires and implements projects for LAN and/or WAN systems. Plans, designs, acquires and implements telecommunications voice/wire systems. At higher job levels, may contribute to the development, testing, evaluation or design of system or infrastructure architecture used throughout the IT solution set.\" Working at NTT Key Roles and Responsibilities: Ensure that assigned infrastructure at the client site is configured, installed, tested and operational Perform necessary checks, apply monitoring tools and respond to alerts Identify problems and errors prior to or when it occurs and log all such incidents in a timely manner with the required level of detail Assist in analysing, assigning and escalating support calls Investigate third line support calls assigned and identify the root cause of incidents and problems Report and escalate issues to 3rd party vendors if necessary Provide onsite technical support to clients and provide field engineering services to clients Conduct monthly random review of incidents and service requests, analyse and recommend improvement in quality Provide continuous feedback to clients and affected parties and update all systems and/or portals as prescribed by NTT Proactively identify opportunities for work optimisation including opportunities for automation of work Knowledge, Skills and Attributes: Ability to communicate and work across different cultures and social groups Ability to plans activities and projects well in advance, and takes into account possible changing circumstances Ability to maintain a positive outlook at work Ability to work well in a pressurised environment Ability to work hard and put in longer hours when it is necessary Ability to apply active listening techniques such as paraphrasing the message to confirm understanding, probing for further relevant information and refraining from interrupting Ability to adapt to changing circumstances Ability to place client at the forefront of all interactions, understanding their requirements and creating a positive client experience throughout the total client journey Academic Qualifications Advanced diploma, degree or relevant qualification in IT/Computing (or demonstrated equivalent work experience) Advantageous Certifications: Up to date and relevant ITIL certification Cisco Certified Internetwork Expert\n• Routing and Switching (CCIE-R/S) Cisco Certified Network Professional\n• Wireless (CCNP-W) Juniper Networks Certified Support Professional\n• Enterprise Routing and Switching (JNCSP-ENT) JNCIA Security Certified Partner SE\n• WAN Optimization Riverbed Certified Solutions Professional\n• WAN Optimization (RCSP-W) F5 Certified Technology Specialist Local Traffic Management (F5-CTS-LTM) 301a LTM Specialist Architect Setup and Deploy Security domain Cisco Certified Internetwork Expert\n• Security (CCIE-S) Juniper Networks Certified Internet Associate\n• Intrusion Detection and Prevent (JNCIA-IDP) Check Point Certified Security Administrator (CCSA) Check Point Certified Security Administrator NG with Application Intelligence (CCSA-NG AI) Check Point Certified Security Expert (CCSE) Certified Partner SE\n• Security Certified Partner SE\n• Web Security VMware Certified Professional vSphere Cisco Certified Internetwork Expert\n• Certification\n• Data Center (CCIE-DC) MCSA+VCP, RHCE or equivalent EMC Technology Architect, VNX Solutions Specialist Version 8.0 (EMCTA_VNX_SS_V8) Blue Coat Certified Proxy SG Professional (BCCPSGP) Blue Coat Certified Proxy SG Troubleshooting (BCCPSGT) Cisco Certified Internetwork Expert\n• Voice (CCIE-V) Cisco Certified Network Associate\n• Video (CCNA-VID) ACIS\n• Avaya Communication Manager 5.2.1 (ACIS – 6006) Genesys Certified Composer Routing 8 Developer (GCD8-DCR) Genesys CIM8 Troubleshooting for Support (GCS8-CCTS) Genesys eServices 8 Consultant (GCP8-CESV) Genesys Inbound Voice 8 Consultant (GCP8-CIV) Genesys SIP Server 8 Consultant (GCP8-SIP) Genesys Voice Platform 8.5 Consultant (GCP8-CVP) Genesys Workforce Management 8.5 Consultant (GCP8-WFM) Cisco Qualified Specialist\n• Cisco IP Contact Center Express Representative (CQS-IPCCER) Cisco Qualified Specialist\n• Cisco IP Contact Center Express Specialist (CQS-IPCCE) Cisco Qualified Specialist\n• Cisco IP Telephony Design Specialist (CQS-DS) Cisco Certified Internetwork Expert\n• Certification\n• Collaboration (CCIE-COLLA) Genesys Certified Composer Routing 8 Developer (GCD8-DCR) Genesys Composer using Voice Applications 8 Developer (GCD8-DCV) Required Experience: Solid years of work experience Solid experience required in in Engineering function within a medium to large ICT organisation Solid experience of Managed Services Excellent working knowledge of ITIL processes Excellent experience working with vendors and/or 3rd parties What will make you a good fit for the role? Additional Job Description Standard career level descriptor for job level:\n• Have wide-ranging experience\n• Uses professional concepts and company objectives to solve complex issues in creative ways\n• Networks with others outside own area of expertise\n• Exercises judgment in selecting methods, techniques and evaluation criteria to obtain results\n• May coordinate others’ activities\n• Typically requires significant related experience with a Bachelor’s or equivalent degree", "extensions": ["9 days ago", "Full–time"], "detected_extensions": {"posted_at": "9 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJNZXNzYWdpbmcgQ29uc3VsdGFudCAtIFNpbmdhcG9yZSIsImNvbXBhbnlfbmFtZSI6Ik5UVCBMdGQuIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJlanNVVzBJeTF4RWt5VEsyQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExpbmtlZEluIiwibGluayI6Imh0dHBzOi8vc2cubGlua2VkaW4uY29tL2pvYnMvdmlldy9tZXNzYWdpbmctY29uc3VsdGFudC1zaW5nYXBvcmUtYXQtbnR0LWx0ZC0yNTAzNzI2NTc2P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Consultant, EUC & Svc Desk", "company_name": "Singtel Group", "location": "Singapore", "via": "via Singtel Careers", "description": "NCS is a leading information and communications technology (ICT) and communications engineering services provider across the Asia-Pacific region. We are headquartered in Singapore and a wholly owned subsidiary of the Singtel Group. We have in-depth domain knowledge and unique capabilities that create business value for customers. We offer a broad range of services, including consulting, systems development and integration, business process outsourcing, infrastructure management and solutions, and technology solutions.\n\nAs a Consultant, EUC & Service Desk, the broad area of your job responsibilities will cover the following:\n• Create, test, and manage software packages for client software and applications\n• Able to do scripting to package software or applications that cannot be done through standard formats\n• Ensure the software package includes software configurations as defined by the customer\n• Ensure package delivered is able to automatically detect missing software or system files... required for normal operations and able to automatically trigger recovery of the required files to ensure no further disruptions to the end users\n• Ensure software package is deployable via the SCCM infrastructure\n• Familiar with packaging tools such as, but not limited to Admin Studio\n• Develop and document the packaging standards, naming standards, software packaging lifecycle management, testing methodologies and processes, and test plans for software packaging for approval by the customers\n• Manage the customers’ requirement and seek customers’ approval for all software packages deployment, creates and updates work instructions\n• Document standards and procedures\n• Able to administer and support day to day Mcafee operations, including AV, harddisk encryption and anti-spyware.\n• Build and automate reports for agent health, scan results, etc\n• Provide incident response and reports as and when required\n• Develop, prepare and maintain processes and documentation and reports on a periodic basis or as and when required\n\nIdeal candidate should possess the following:\n• Diploma / Degree in equivalent discipline\n• Having 3 - 4 Years of experience of Software Packaging experience using AdminStudio, InstallShield, or equivalent\n• Relevant experience in SCCM infrastructure, deployment of Software packages and scripting\n• Proficient in as SCCM architecture, Mcafee endpoint security and deployment applications\n• Good to have ITIL certification", "extensions": ["13 days ago", "Full–time"], "detected_extensions": {"posted_at": "13 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDb25zdWx0YW50LCBFVUMgXHUwMDI2IFN2YyBEZXNrIiwiY29tcGFueV9uYW1lIjoiU2luZ3RlbCBHcm91cCIsImNvbXBhbnlfbWlkIjoiL20vMDIwemZsIiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiWXVhWDlYYWF2Y0o5Um96S0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVJQkNxSUJRVTVWWDA1eFVUZ3hWMTkxTmtwS2QweE9kR0Z1VTA1RWMyWklNak4zUjI1b2JFWTBUVEUyTlRKQ1oxQnhiMHR0VDJSTWQwbFZNME56VW1Zd1dWWTNiVnBPVDFSd1VURmpMVmh2YmxaQmVucHVNamRNYUVoVU1EZzNTMlZLVWpkdFJtbGpjVVZHVlhsVlJFNU5ibE4zU1UxM0xUUXpMVlZMU0UxUGVHODNVblJ3Tm1SSVZXMWxha0ZwYmtKaldHdEtZalpVV0doU09FcEpWa1U1TUZKNlYyeG5FaGQzTXpaRFdWQjJSME5rU0ZNMVRtOVFiMlkyT1cxQmN4b2lRVTlOV1ZKM1EyeGpWV2hYY0c0NU9HMDNSbkZJYkZseldVVTBSa2swYldKcFFRIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMTEiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gU2luZ3RlbCBDYXJlZXJzIiwibGluayI6Imh0dHBzOi8vZ3JvdXBjYXJlZXJzLnNpbmd0ZWwuY29tL2pvYi9Db25zdWx0YW50JTJDLUVVQy1cdTAwMjYtU3ZjLURlc2stU2luZy81NzY1NDU2MTAvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "SAP Consultant, Contract Management (BB-DC979)", "company_name": "ROCHE DIAGNOSTICS ASIA PACIFIC PTE LTD", "location": "Singapore (+1 other)", "via": "via BeBee", "description": "Roles & ResponsibilitiesThe positionYou are responsible to support global and regional business operations by designing and implementing high performing, high quality global and regional ERP solutions in a timely manner, which allows business to drive processes effectively and efficiently from end-to-end. You provide consulting and support services in the area of SAP Contract Lifecycle Management, with focus on but not limited to: Contract and Instrument Lifecycle Management, Sales and Distribution, Integration of a Configure-Price-Quote (CPQ) solution into SAP ERP, Service Management related to the Contract Lifecycle Management domain, Workflows and API integration. You also work closely with the global and the Asia Pacific user community with the aim to optimize business processes and solutions. You are responsible to ensure delivery of proposed solutions; support for development of business possibilities; contribute to high productivity and motivation of working team with the use... of communication skills and cooperation. You standardize, harmonizes and innovate to simplify business process (e.g. using SAP MDM, Workflow, UI5, Fiori, etc.). You define and develop programs and interfaces using BAPI, IDOC, BDC, Smart Forms or SAP Script, user exits, screens/Reports/Interfaces. You work in a global team with colleagues being located in North America and Europe. This role will be reporting into the Head of SAP Commercial Contract Management in Mannheim, and will base in Singapore, regional office for Asia Pacific. Who you are Youare someone who influences your own development, pursues your interests across functions and geographies, and understands that a job title is not the final definition of who you are, but a starting point. You should ideally possess a Bachelor’s Degree in Business Administration, IT or equivalent with 4 or more years of experience in SAP SD. Ideally, you also have a certification in SAP SD. You have technical skills in all areas of ABAP workbench (including ABAP OO for complex custom build solutions). Certification in PMP, SCRUM, S/4 HANA is a plus. You have hands-on experience using integration with non-SAP systems via webservices / OData / ALE / IDOC / RFC / EAI / API / middleware. You have a track-record of delivering business change and process improvement initiatives using SAP solutions. You have the experience in organizing and facilitating meetings with business stakeholders to understand their needs and the business processes; have presented solutions to both technical and non-technical users; have conducted trainings / knowledge sharing sessions with business stakeholders. In addition, you have strong project management skills in managing mid-size projects and budget. You have the ability to resolve incidents or change requests independently as per SLA. You ensure high quality of solutions provided, as indicated for example in documentations. You should have the ability to manage ambiguity while coping with challenging business needs and project goals. With excellent communication and presentation skills, you must be able to communicate fluently in both written and spoken English. You should be able to work flexibly outside of normal working hours or on call arrangements to provide support as well as to be able to travel occasionally.Tell employers what skills you haveBusiness OperationsConsultingIntegrationProject ManagementRESTful WebServicesSAPSAP HANAService ManagementStakeholder ManagementERP systemLifecycle management", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTQVAgQ29uc3VsdGFudCwgQ29udHJhY3QgTWFuYWdlbWVudCAoQkItREM5NzkpIiwiY29tcGFueV9uYW1lIjoiUk9DSEUgRElBR05PU1RJQ1MgQVNJQSBQQUNJRklDIFBURSBMVEQiLCJjb21wYW55X21pZCI6Ii9nLzExajNseW5mOHYiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJfTUZTc2ZPNFp4SzFKbE9sQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFcmNDQ3ZjQlFVNVZYMDV4VVRoWldGOU9kV1kyYVhsb05sVmxhMFpIUTFWS2JtaHVSelJwYVd4bGRsVk5jSFpsUVhBMmQwZzJTbDlUZGtaVGVqUlJhbEpXVm1aWFlrVm5VbTloTW05Tk1tWXRVSFUzWkZOemVWVjNTbVYxZFd0Qll6ZGZRbGR2YUVoMVZuVllObGRrVldSQ2VHOUlNMk4xUjFoUlJqSTVlRU5MVFZKVFJGOW5ObEZpVDJSQlYxaE5URk4yZDFFdFgwRlhPVkZ1ZFhsTVFucEVjV0V6VHpoVFNrSlZWVTA1WnpSdFRISllURzVRZDNScGRHRjRZMnBuTFc1bFZISjFSMEpVZWpsbE0xWjBUMFZCZG0wM1dFMTFNSFZXZVY5WVJta3hXRUp2TjBka1VWWmxXbTlZVWtWMGNsUnNkbUpHZUdKQmJuVkhkeElYZHpNMlExbFFka2REWkVoVE5VNXZVRzltTmpsdFFYTWFJa0ZQVFZsU2QwSlRNV2xXTkVwSlYzWjJVbVZvVDFaMFUzQnZiRTl1VGpjd1JYYyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzE4IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJlQmVlIiwibGluayI6Imh0dHBzOi8vc2cuYmViZWUuY29tL2pvYi8yMDIxMDQxNy0yZWQxNDUzMmNkOWRjOTEyNTRkZTU2NmU1ZjBkYzk3OT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Technical Consultant", "company_name": "None", "location": "Singapore", "via": "via Singapore", "description": "Duties and Responsibilities: To develop and add-ons functionality and reports for Microsoft Dynamics NAV Solution Understand the business processes, design document and apply to Microsoft Dynamics NAV efficiently Perform Business requirement analysis and provide professional advises Install and Support users on Microsoft Dynamics NAV Solution Handle RTC Report designing from NAV 2009 & latest BC version, SQL Server 2014 – 2017, SSRS and Web Services. Requirements: Minimum of 3 years Dynamics NAV Development experience Certification in Dynamics NAV, preferably: Microsoft Dynamics NAV 2013 or later C/SIDE Development Microsoft Dynamics NAV 2013 or later Installation & Configuration Experience developing for both Classic and Web Client Experience developing RTC Three Tier Environment SQL setup and configuration for NAV 2013/2015/2016/2017/2018/BC Dynamics NAV Web Services .NET Experience (Basic) SSRS Strong understanding of the SDLC Navision 2018 Extension AL Development SQL... Certification Knowledge about Configuring SQL/Dynamics NAV on Azure Environment", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJUZWNobmljYWwgQ29uc3VsdGFudCIsImNvbXBhbnlfbmFtZSI6Ik5vbmUiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjQ2OFBHcjc3NHE3YUVtaFFBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gU2luZ2Fwb3JlIiwibGluayI6Imh0dHBzOi8vc2cuZmlkYW50by5jb20vam9icy9qb2Itb3BlbmluZy9jb3Vuc2Vsb3JzLWFsbC1vdGhlci90ZWNobmljYWwtY29uc3VsdGFudC0yNzUzMzU0NzM/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Senior Industrial Hygiene Consultant", "company_name": "Golder Associates", "location": "Singapore", "via": "via Glassdoor", "description": "Senior Industrial Hygiene Consultant\n- (21000029)\n\nAt Golder, we thrive on challenges.\n\nGolder is not just a place to work, it is a promise of a living, dynamic environment where people collaborate, innovate, build enduring relationships, excel, and grow professionally in a strong culture of ownership.\n\nA rewarding opportunity has arisen for an Senior Industrial Hygiene Consultant to join our Environmental Team based in Singapore to help deliver multidisciplinary project for an array of local and international clients.\n\nKey duties and responsibilities include:\n• Manage projects that involve the collection of workplace environmental and exposure data relating to ventilation, air, and noise, asbestos, mold, bio-hazards, and chemicals, among others\n• Analysis of workplace environmental and exposure data to identify potential health and safety risks and recommend corrective action plans\n• Conduct EHS and IH audits\n• Client relationship management\n• Business development and marketing\n•... Preparation of high-quality deliverables including proposals and reports\n• Coordinate contract and project management, including management of suppliers and sub-contractors\n• Mentor junior staff\n\nSkills, Qualifications, and Experience\n• Tertiary qualification in Environmental Science / Engineering, Chemistry / Chemical Engineering, or related fields with at least 10 years of relevant professional experience\n• Certified Industrial Hygienist\n• Certified Asbestos management and surveyor\n• Scientific expertise in the management of environmental and occupational hazards\n• Strong analytical and problem-solving skills\n• Keen attention to detail\n• Effective written and spoken communication and interpersonal skills (i.e., English and another language)\n• Proven knowledge of local workplace health and safety regulations\n• Ability to engage with clients directly\n• Ability to integrate into projects built with a team of professionals\n• Strong organizational skills and proactive attitude\nYour benefits at Golder will include:\n• Competitive benefits and remuneration packages\n• Deepen your expertise in a dynamic work environment\n• Innovative and collaborative multidisciplinary projects\n• On the job training, mentoring and coaching\n• Global projects and travel opportunities\n\nRenowned for technical excellence, Golder is a leading, global employee-owned engineering and consulting firm with over a half century of successful service to its clients. With over 165 offices worldwide, Golder’s 6,500+ professionals are driven by a passion to deliver results, offering unique specialized skills to address the ever-evolving challenges that earth, environment and energy present to clients across the infrastructure, mining, oil and gas, manufacturing and power sectors.\n\nAt Golder, we care about our people – we operate with integrity and embrace diversity. Our ownership structure affords us the opportunity to invest in our careers and take pride in something we truly own.\n\nAll qualified applicants are encouraged to apply for this role.\n\nPlease note: Golder does not accept unsolicited resumes from recruiters or employment agencies.\n\n#LI-AM1\n\nPrimary Location SG-SG-Singapore\nSchedule Full-time\nEmployee Status Regular\nJob Posting Mar 10, 2021, 2:51:41 PM", "extensions": ["15 days ago", "Full–time"], "detected_extensions": {"posted_at": "15 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgSW5kdXN0cmlhbCBIeWdpZW5lIENvbnN1bHRhbnQiLCJjb21wYW55X25hbWUiOiJHb2xkZXIgQXNzb2NpYXRlcyIsImNvbXBhbnlfbWlkIjoiL20vMDJxeDlicSIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6InVMU3dmVDFFYnhieDIzRkVBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2Y0JDcmNCUVU1VlgwNXhWRWhLUm1OaFRWbzRiMGhyWmxsT2VIVkRPVll3VlZOcVgweHJVRkV3TURobWN6bEdUekpPUVdGa1JESmpkMHhEYWtwd2RqQXhORWc1UTE5SlJXSmZlbmRxU1VjeE1XMHRWek5HYjFaNFoxUldXVEo2WjBVelRrdFpWWGQwTTAxclUwdDBaVmhhUkVKT09HVkRiVjlXYlVJM2VVTXRabWswVjNkMWJqZFJORTAwVGxKSldrZDZRVnBXU1hKVU1sTTNRakF4T1ZGWU1VUTRlV0ZGWlRGZldXcHJhRWRhTTE5R05qVkhXa2RHWkc5bkVoZDNNelpEV1ZCMlIwTmtTRk0xVG05UWIyWTJPVzFCY3hvaVFVOU5XVkozUXpKbGNqTnlkRzVTVVdWMlNYWklNbFZsWlZadVMwZElSVjg1WnciLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18yOSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBHbGFzc2Rvb3IiLCJsaW5rIjoiaHR0cHM6Ly93d3cuZ2xhc3Nkb29yLnNnL2pvYi1saXN0aW5nL3Nlbmlvci1pbmR1c3RyaWFsLWh5Z2llbmUtY29uc3VsdGFudC1nb2xkZXItYXNzb2NpYXRlcy1KVl9JQzMyMzU5MjFfS08wLDM2X0tFMzcsNTQuaHRtP2psPTQwMjgzNjY3NjlcdTAwMjZ1dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Presales Consultant", "company_name": "CHASSasia Singapore", "location": "Singapore (+1 other)", "via": "via LinkedIn", "description": "Job Description:\n• Support Sales teams to understand customer technical and process requirements and assist in the qualification of prospect.\n• To position and present company services and offerings.\n• Prepare and deliver technical presentations of the solutions offering.\n• Confer with customers and Product team to assess technical needs\n• Provide answers to technical and process questions in a Request for Information (RFI), Request for Proposal (RFP), and Request for Quote (RFQ)\n• Liaise with implementation teams to ensure accurate and timely resolution of technical and process solutions\n• Demonstrate strong business acumen and deep understanding of client’s IT related business goals and challenges to ensure proper translation of the client’s needs into technology solutions.\n• Build and maintain technical relationships in assigned accounts as appropriate to identify and drive additional opportunities.\n\nRequirements:\n• Minimum 3 to 5 years of relevant experience in SI environment.\n•... Degree in technology / IT / Engineering discipline.\n• Possess strong foundation of cloud and infrastructure framework with hands-on experience in virtualization, back-ups and recovery, storage, server consolidation, firewall management, cloud and collaboration platforms, O365, Azure, etc.\n• Possess any certification of the above technologies", "extensions": ["2 days ago", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcmVzYWxlcyBDb25zdWx0YW50IiwiY29tcGFueV9uYW1lIjoiQ0hBU1Nhc2lhIFNpbmdhcG9yZSIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiejlnOUtjSDVaRlFYVnNEeEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL3NnLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvcHJlc2FsZXMtY29uc3VsdGFudC1hdC1jaGFzc2FzaWEtc2luZ2Fwb3JlLTI0OTUwMTM5NTY/cmVmSWQ9Y2U1NmE0NTEtMmM3MC00YTc4LWI4OTgtOTFkYzljYzBkMTlkXHUwMDI2dHJhY2tpbmdJZD01WGUxcGtDT25mSkFEcyUyQllVT2RGbmclM0QlM0RcdTAwMjZwb3NpdGlvbj03XHUwMDI2cGFnZU51bT0wXHUwMDI2dHJrPXB1YmxpY19qb2JzX2pvYi1yZXN1bHQtY2FyZF9yZXN1bHQtY2FyZF9mdWxsLWNsaWNrXHUwMDI2dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Senior Risk & Safety Consultant", "company_name": "Bureau Veritas", "location": "Singapore", "via": "via WhatJobs", "description": "Location: Midlands/ South, Greater London, GB\n\nAn award-winning employer, our people are trusted and responsible, believing in what they do with a clear commitment to contribute to transforming the world we live in and shaping a world of trust. Bureau Veritas operates in a wide range of sectors, delivering Testing, Inspection and Certification services to some of the world’s biggest household names. With more than 400,000 global clients and a reputation for quality, we are at the forefront of service and innovation.\n\nOur people are at the heart of everything we do, which is why we have worked hard to create a supportive and engaging working environment, which is open and inclusive and individuals are given the opportunity to fulfil their potential and really leave their mark.\n\nSenior Risk & Safety Consultant\n\nWe are looking for a Senior Consultant to join our specialist Risk & Safety team. This role will lead on a range of risk, and health and safety projects to agreed quality, costs... and timescales.\n\nProjects will include the design and implementation of complex H&S Management Systems, Inspections, Auditing, DSEAR service delivery and leading and providing support on other Risk & Safety Projects when required. Our client portfolio will provide you with a real diversity of exposure to different industries and the opportunity to really influence and set H&S standards for global, household names.\n\nMake an impact doing work you can be proud of at Bureau Veritas. Contribute to a global mission to enhance standards with integrity and help us create a brighter future for our next generations, and a safer society for us all.\n\nResponsibilities include:\n\nProvide high quality technical consultancy to clients Keep abreast of current legislation, relevant national and international standards and guidelines and technical developments within the relevant field To respond to requests for client work and proposals Be exemplar in client management and relationship building Contribute to delivery of projects on time and to budget; to manage resources in the delivery of the projects; to undertake regular project reviews To follow all financial procedures in the delivery of projects Ensure the use of the Consulting Group technical tools and methodologies in delivery of projects to the standard set Support compliance with BVS QHSE and external quality/certification requirements Contribute to a rolling forecast to provide visibility of future workload Monitor individual utilisation versus targets and actively manage optimal utilisation Delivery against Key personal and divisional KPIs Support junior members of staff in delivery of consultancy services and ensure their compliance with site safety practices where site work is undertaken To support team working Ensure full implementation and use of the competency framework Support as required in the definition of the current and future market, market drivers and service offerings of the Consulting Group Marketing the relevant services of the company\n\nCandidate requirements include:\n\nLevel 6 health and safety qualification, such as the NEBOSH Diploma Experience interpreting and implementing complex safety management systems either on a global scale, or in medium/ high risk industries Significant experience in a H&S role operating under an established Health and Safety Management System Liaison with a broad range of stakeholders at all levels of an organisation Extensive knowledge of UK H&S regulations and experience in practical implementation Strong analytical and report writing skills Positive approach to the challenges of change and see change as an opportunity Ability to prioritise and schedule objectives to optimise time, cost and quality Strives to improve performance and uses innovative methods to get there\n\nOnly Bureau Veritas can offer:\n\nStructured development programmes, from apprentice to chartered engineer, to help you fulfil your potential, including face to face and e-learning programmes The opportunity to deliver excellence for high profile clients, including some of the world’s most recognised brands A long list of awards recognition including Top Employer nine years in a row and continued success in the RoSPA Occupational Health and Safety Awards\n\nPlus:\n\nComprehensive financial package including competitive salary and allowances, defined contribution pension, 25 days holiday plus Bank Holidays, various insurances including Private Health Insurance and other flexible benefits to suit individual requirements\n\nPlease be aware that all roles within Bureau Veritas UK&I may require a DBS, Credit or Security Clearance Check.\n\nBureau Veritas is an equal opportunity employer. No job applicant or employee shall receive less favourable treatment because of their gender, marital or civil partnership status, sexual orientation, colour, race, ethnic origin, religion, disability or age.\n\nBureau Veritas operates a strict Code of Ethics that ensures the proper conduct of our day-to-day business", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgUmlzayBcdTAwMjYgU2FmZXR5IENvbnN1bHRhbnQiLCJjb21wYW55X25hbWUiOiJCdXJlYXUgVmVyaXRhcyIsImNvbXBhbnlfbWlkIjoiL20vMDNjcDA4YyIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImNVbVc5WlJpejZsYVB5WWZBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1SUJDcUlCUVU1VlgwNXhVMU10ZHpSTWRtNXFNVTVUYmpGMlpFSm1VemxyY3psVFNUZFdPRmhyYW1KUE0zbDZObXN5YVY5ak5sSjBVSEJsZEdWek1VZEtZV3h6TkVFdGNYYzRSRVJGZDFsTk5VVnFhV0pIYmtKV2JHWnFkVmN3YW5vMk9UUjBiVlJ3V2paTmJtTlpiVFpUYzBKYU9UZE9kV1ppVUUxdVNEaEtRbmwyYzBwWFpVNVRXVGRMZDNweVVFRkNNekJUYUVZNVJWOUtaVzkxYVdSRGVqVjZWVFpCRWhkM016WkRXVkIyUjBOa1NGTTFUbTlRYjJZMk9XMUJjeG9pUVU5TldWSjNRVkZoT0hsSWQzSmpWRzkwTFVjNVdXMTBSVTlyTlRGT2JFRTJVUSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzQzIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFdoYXRKb2JzIiwibGluayI6Imh0dHBzOi8vZW4tc2cud2hhdGpvYnMuY29tL2pvYi1mb3ItU2VuaW9yLVJpc2stU2FmZXR5LUNvbnN1bHRhbnQtaW4tU0ctY29vcDE3NTkyMDkxP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Salesforce Consultant (BB-AE930)", "company_name": "JOBSTER PRIVATE LTD.", "location": "Singapore (+1 other)", "via": "via BeBee", "description": "Roles & Responsibilities Permanent Role Working hours: Monday to Friday, 830am to 6pm Responsibilities: Responsible to work with Salesforce platform and related cloud technologies, designing and implementing the key technical components of the Salesforce solution. He/she will share implementation best practices and partner with the Technical Architect to conduct design/code reviews during major project milestones. Design and develop custom solutions on the Salesforce platform including application integration and data migration Involved in developing business requirements, specifications, process flows, application design, application configuration, testing and deployment Design and implement business technology solutions focused on Salesforce platform Works directly with clients to lead projects, facilitates business process analysis sessions, develops and delivers key components of Salesforce solution Contribute the growth of the Salesforce practice through though-leadership... development of solution accelerators, reusable assets Deliver presentations to internal and external stakeholders on Salesforce capabilities and integration with other applications The ideal candidate should possess: Degree in Computer Science, Business or equivalent years of professional experience in a relevant field Experience with hands-on technical development/ programming, preferably with the Salesforce platform 2+ years in post-qualification IT experience in software development and implementation Understanding of system and data integration architecture and a strong understanding of relational databases (MySQL, SQL Server, Oracle, etc.) Strong software engineering foundation Strong in documentation, process analysis and design, requirement gathering and impact analysis Experience and understanding of software development methodologies, e.g. Agile, Waterfall Ability to work both independently and as part of a team with professionals at all levels Excellent oral/written communication to liaise with internal and external stakeholdersTell employers what skills you haveAgile & Waterfall MethodologiesData MigrationLeadershipManagementMicrosoft TechnologiesMySQLNew Business Certified Certified ImplementationSQL ServerdesignedplatformDesign codeapplication integrationImplementation of best practicestechnical components", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTYWxlc2ZvcmNlIENvbnN1bHRhbnQgKEJCLUFFOTMwKSIsImNvbXBhbnlfbmFtZSI6IkpPQlNURVIgUFJJVkFURSBMVEQuIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiI3RWkxMWtoNDNHUHI4MUd1QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJlQmVlIiwibGluayI6Imh0dHBzOi8vc2cuYmViZWUuY29tL2pvYi8yMDIxMDQxNy01MTM1MjdmZGMyMTFlN2NhM2EyMmI0NjU2YWRhZTkzMD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Devops Consultant", "company_name": "None", "location": "Singapore", "via": "via Jobs", "description": "Key Responsibilities: · Responsible for delivering platform enhancements as per client requirements · Determine technical standards and specifications and lead the design and build · Review the current architectural landscape and make appropriate recommendations · Researches new technologies and products for their applicability to business processes Degree in IT related discipline 10 Years of experience in IT Hands on AWS (Amazon WebServices) experience. Good understanding of Container platforms, Microservices and app functions is must. Responsible for DevOps pipelines, building, managing code deployments, fixes, updates and related processes. Below are the required skill set: Docker Kubernetes Elastic Kubernetes Service Fargate CICD Pipeline tools Jenkins ECR (Elastic Container Registry) ECS(Elastic Container Service) Knowledge on Terraform Following certifications would be an added advantage: AWS Certified Developer Associate AWS Certified SysOps Administrator Key Responsibilities... · Responsible for delivering platform enhancements as per client requirements · Determine technical standards and specifications and lead the design and build · Review the cu Skills: Amazon Web Services, Aws, Business Process, Devops, Information Technology, Restful Webservices, Platform, new technologies , Client Requirements Experience: 5.00-7.00 Years", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEZXZvcHMgQ29uc3VsdGFudCIsImNvbXBhbnlfbmFtZSI6Ik5vbmUiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Ik5YZG5oVFNNeG5tUVlvVkRBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9icyIsImxpbmsiOiJodHRwczovL3NnLmZpZGFudG8uY29tL2pvYnMvam9iLW9wZW5pbmcvaW5mb3JtYXRpb24tdGVjaG5vbG9neS1wcm9qZWN0LW1hbmFnZXJzL2Rldm9wcy1jb25zdWx0YW50LTI3NTczMzI3Mj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Financial Services Consultant", "company_name": "Crown Organization, a branch representing Manulife Financial Advisers", "location": "Singapore", "via": "via LinkedIn", "description": "Fresh grad or looking for career switch!!!\n\nWe're hiring as we are expanding our team. We want you to know this is not just another job as you embark a rewarding career with us. If you are seeking a fulfilling and challenging opportunity, come aboard and be a part of Crown's Organization team today. We actively seek those who have an endless desire to learn, and always look to improve yourself!\n\nRoles and Responsibilities:\n• To provide holistic financial planning to client.\n• Provide financial advice to client through a systematic process to understand client financial needs and future goals.\n• Conduct regular reviews with client to re-evaluate their current situation and future goals.\n• Build meaningful and maintain a long term client relationship.\n• Be Hardworking & Responsible for your work.\n\nRemuneration Package and Benefits:\n• Structured Training and ongoing training programs\n• 1-1 Mentorships\n• Salary up to $6,000* exclude incentive+ Bonus + Commission*\n• High earning... potential\n• Work-life balance; flexible working hours\n• Incentive Overseas trips\n• Industry and company recognition\n• Sponsorship of CFMAS papers, M5, M9, M9A\n\nJob Requirements:\n• Singaporean and/or Singapore Permanent Resident (PR)\n• At least 21 years old (based on MAS requirements)\n• Min Diploma in Singapore polytechnic or equivalent OR GCE “A” level certification\n• Possess Good interpersonal and communication skills\n• Willingness to learn\n• Motivated, self-directed & driven", "extensions": ["2 days ago", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJGaW5hbmNpYWwgU2VydmljZXMgQ29uc3VsdGFudCIsImNvbXBhbnlfbmFtZSI6IkNyb3duIE9yZ2FuaXphdGlvbiwgYSBicmFuY2ggcmVwcmVzZW50aW5nIE1hbnVsaWZlIEZpbmFuY2lhbCBBZHZpc2VycyIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiNURHb1VHZVR3bDR6ZzRGNkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL3NnLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvZmluYW5jaWFsLXNlcnZpY2VzLWNvbnN1bHRhbnQtYXQtY3Jvd24tb3JnYW5pemF0aW9uLWEtYnJhbmNoLXJlcHJlc2VudGluZy1tYW51bGlmZS1maW5hbmNpYWwtYWR2aXNlcnMtMjQ5MzEzMzI1MD9yZWZJZD00ZjQ4ODNlNy0xOTBkLTQ5YjctODU3NC1kYzM2NDFhNGQxNTRcdTAwMjZ0cmFja2luZ0lkPUNrMHRkbVBkYkE3RGRjMjdMam1XemclM0QlM0RcdTAwMjZwb3NpdGlvbj0yXHUwMDI2cGFnZU51bT0wXHUwMDI2dHJrPXB1YmxpY19qb2JzX2pvYi1yZXN1bHQtY2FyZF9yZXN1bHQtY2FyZF9mdWxsLWNsaWNrXHUwMDI2dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Business Operations", "value": "GC06"}, {"text": "Human Resources", "value": "GC15"}, {"text": "Sales and Retail", "value": "GC26"}, {"text": "Accounting and Finance", "value": "GC01"}, {"text": "Protective Services", "value": "GC23"}, {"text": "Science and Engineering", "value": "GC27"}, {"text": "Management", "value": "GC18"}, {"text": "Advertising and Marketing", "value": "GC03"}, {"text": "Legal", "value": "GC17"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Customer Service", "value": "GC10"}, {"text": "Social Services and Non-Profit", "value": "GC28"}, {"text": "Art, Fashion and Design", "value": "GC05"}, {"text": "Healthcare", "value": "GC14"}, {"text": "Energy and Mining", "value": "GC21"}, {"text": "Sports Fitness and Recreation", "value": "GC29"}, {"text": "Education", "value": "GC11"}, {"text": "Personal Care and Services", "value": "GC22"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "Consultant", "value": "consultant"}, {"text": "Senior consultant", "value": "senior consultant"}, {"text": "Security consultant", "value": "security consultant"}, {"text": "Recruitment consultant", "value": "recruitment consultant"}, {"text": "Lead consultant", "value": "lead consultant"}, {"text": "Associate consultant", "value": "associate consultant"}, {"text": "Principal consultant", "value": "principal consultant"}, {"text": "Associate", "value": "associate"}, {"text": "Financial consultant", "value": "financial consultant"}, {"text": "Functional consultant", "value": "functional consultant"}, {"text": "Presales consultant", "value": "presales consultant"}, {"text": "Technical consultant", "value": "technical consultant"}, {"text": "Application consultant", "value": "application consultant"}, {"text": "Devops consultant", "value": "devops consultant"}, {"text": "Pre-sales consultant", "value": "pre-sales consultant"}, {"text": "Solution consultant", "value": "solution consultant"}, {"text": "Consultants", "value": "consultants"}, {"text": "Development consultant", "value": "development consultant"}, {"text": "Engineer", "value": "engineer"}, {"text": "Hr consultant", "value": "hr consultant"}, {"text": "It consultant", "value": "it consultant"}, {"text": "Senior", "value": "senior"}, {"text": "Services consultant", "value": "services consultant"}, {"text": "Solutions consultant", "value": "solutions consultant"}, {"text": "Business", "value": "business"}, {"text": "Business consulting", "value": "business consulting"}, {"text": "Consulting", "value": "consulting"}, {"text": "Director", "value": "director"}, {"text": "Education consultant", "value": "education consultant"}, {"text": "Hcm consultant", "value": "hcm consultant"}, {"text": "Infrastructure", "value": "infrastructure"}, {"text": "Investment consultant", "value": "investment consultant"}, {"text": "Manager", "value": "manager"}, {"text": "Project manager", "value": "project manager"}, {"text": "Recruitment consultants", "value": "recruitment consultants"}, {"text": "Sap consultant", "value": "sap consultant"}, {"text": "Software engineer", "value": "software engineer"}, {"text": "Specialist", "value": "specialist"}, {"text": "Support consultant", "value": "support consultant"}, {"text": "Systems consultant", "value": "systems consultant"}, {"text": "Systems engineer", "value": "systems engineer"}, {"text": "Technology consulting", "value": "technology consulting"}, {"text": "Academy", "value": "academy"}, {"text": "Accountant", "value": "accountant"}, {"text": "Architect", "value": "architect"}, {"text": "Beauty consultant", "value": "beauty consultant"}, {"text": "Cloud consultant", "value": "cloud consultant"}, {"text": "Consultancy", "value": "consultancy"}, {"text": "Data engineer", "value": "data engineer"}, {"text": "Electrical engineer", "value": "electrical engineer"}, {"text": "Employee", "value": "employee"}, {"text": "Finance consultant", "value": "finance consultant"}, {"text": "Financial services", "value": "financial services"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Internship", "value": "INTERN"}, {"text": "Part-time", "value": "PARTTIME"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Accounting", "value": "/business/naics2007/5412"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Engineering Services", "value": "/business/naics2007/5413"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Real Estate", "value": "/business/naics2007/53"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Wholesale", "value": "/business/naics2007/42"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "SingTel", "value": "/m/020zfl"}, {"text": "EY", "value": "/m/0g9jc"}, {"text": "Infosys", "value": "/m/01k8x6"}, {"text": "SearchAsia Consulting Pte Ltd", "value": "/g/11fy260nhz"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "Deloitte SEA", "value": "/g/11f_g4x9d_"}, {"text": "Geco Asia", "value": "/g/11gk72_bt_"}, {"text": "OAKTREE CONSULTING", "value": "/g/11g70jfhtq"}, {"text": "Central Provident Fund Board", "value": "/m/0615qb"}, {"text": "NCS", "value": "/m/0282746"}, {"text": "Trustwave", "value": "/m/0n3xjf5"}, {"text": "Ensign InfoSecurity", "value": "/g/11g4jhymjr"}, {"text": "HCL SINGAPORE PTE. LTD.", "value": "/g/11fy25ngsv"}, {"text": "Horangi", "value": "/g/11fm41wdh3"}, {"text": "LINKBYNET", "value": "/g/11f00s44gb"}, {"text": "NTT", "value": "/m/05mybp8"}, {"text": "RECRUIT EXPRESS PTE LTD", "value": "/g/11g706hzhq"}, {"text": "Randstad", "value": "/m/08pt1z"}, {"text": "Randstad Singapore", "value": "/g/11g70b50mr"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "UBS", "value": "/m/031rxp"}, {"text": "Xcellink Pte Ltd", "value": "/g/11c73prcqy"}, {"text": "Alight", "value": "/g/11fj9r012s"}, {"text": "Avanade", "value": "/m/094456"}, {"text": "Avensys Consulting", "value": "/g/11g7022gjf"}, {"text": "CBRE", "value": "/m/090r7m"}, {"text": "Golder", "value": "/m/02qx9bq"}, {"text": "Hitachi Solutions", "value": "/g/121lyvj9"}, {"text": "IBM", "value": "/m/03sc8"}, {"text": "Marsh & McLennan", "value": "/m/053rw"}, {"text": "Mott MacDonald", "value": "/m/043l4j"}, {"text": "NTT Ltd.", "value": "/m/01c3fq"}, {"text": "Qualtrics", "value": "/m/080nnft"}, {"text": "SAP", "value": "/m/01pf4l"}, {"text": "Techcom Solutions Pte Ltd", "value": "/g/11c73vztx3"}, {"text": "TraceLink", "value": "/g/11c73g93qt"}, {"text": "Turner & Townsend", "value": "/m/0cfy6xp"}, {"text": "Thatz", "value": "/g/11dxpx4g1l"}]}]}