{"search_metadata": {"id": "60827ad7629a01461a930f29", "status": "Success", "json_endpoint": "https://serpapi.com/searches/ea50bba1bd1c4a70/60827ad7629a01461a930f29.json", "created_at": "2021-04-23 07:44:23 UTC", "processed_at": "2021-04-23 07:44:23 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28programmer%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=150", "raw_html_file": "https://serpapi.com/searches/ea50bba1bd1c4a70/60827ad7629a01461a930f29.html", "total_time_taken": 2.59}, "search_parameters": {"q": "(programmer) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "150"}, "jobs_results": [{"title": "Junior Software Developer (RPA) (BB-CE896)", "company_name": "ALTROCKS TECH PTE. LTD.", "location": "Singapore (+1 other)", "via": "via BeBee", "description": "Roles & ResponsibilitiesScope of work: Develop Robotic Process Automations with UiPath/AA/Blueprism; Identify and create reusable automation components; Develop customizations utilizing .Net and third party APIs; Implement Bot throughput logging, auditing, and exception handling; Support User Acceptance Testing with business and IT. Required Experience and Skills: Bachelor’s degree in IT, Software engineering or a related field. 2+ years of professional experience in to IT Must have experience in Object oriented programming with Microsoft .Net (VB and C#) or VBA, Java, C#, IIS, JavaScript, RPA. Familiar or certified with UiPath, Blue prism or AA. Familiarity with web service interaction (REST/SOAP); Excellent communication skills with ability to manage multiple priorities Ability to work on own and in a team-oriented environmentTell employers what skills you haveAuditingC#C++HTMLInformation TechnologyJavaJavaScriptMySQLProcess AutomationSoftware DevelopmentSQLSoftware... developingUATcustomizationMicrosoft .NETscopes of work", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJKdW5pb3IgU29mdHdhcmUgRGV2ZWxvcGVyIChSUEEpIChCQi1DRTg5NikiLCJjb21wYW55X25hbWUiOiJBTFRST0NLUyBURUNIIFBURS4gTFRELiIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoia0tJbnRpQ2ZYLU1ycFJXNkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCZUJlZSIsImxpbmsiOiJodHRwczovL3NnLmJlYmVlLmNvbS9qb2IvMjAyMTA0MTctZjUwY2E3M2M2YTA4ZWFmOTJlZDJjZGU3YTE2Y2U4OTY/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Trainee software Developer-Pega", "company_name": "Collabera Technologies Pte. Ltd.", "location": "Singapore", "via": "via Monster", "description": "Role : Traineesoftware Developer(Pega)\n\nLocation : Singapore\n\n5 weeks of Training on Pega Development will be provided by Collabera, after the training we will give you fulltime Role for software engineer\n\nWe are looking for fresh graduates who want to develop their career as Pega Developer.\n\n· Fresh graduate (Degree/Diploma) IT related OR 1 to 4 years of experience candidates\n\n· It is going to be 12 month contract with possible extension/conversion.\n\n· 5 weeks of Training on Pega Development will be provided by Collabera\n\n· We are going to invest in training so you have to sign a bond with us for 12 months.\n\n· Can start immediately after training\n\nResponsibilities:\n\n· Analyze, design and support implementation of business-specific solutions and/or frameworks.\n\n· Responsible for implementing technical solutions using Pega 7.\n\n· The Pega Developer will analyze the application architecture of a new Pega implementation and technical integration with internal/external systems, support the... development of SDLC deliverables including architecture document, interface control documents, and detailed design documents. The Pega Developer will work with the team and client to document functional designs and work alongside the build team to capture design detail in the SDLC deliverables.\n\n· Ability to create reusable components that can be leveraged across the enterprise for providing top-notch customer experience.\n\n· Ability to translate complex business requirement into functional technical requirements into well designed, well performing solutions using Pega 7.\n\n· Assist with planning and execution of unit, integration and user acceptance testing.\n\n· Provide regular updates team lead and project manager on project progress and outstanding issues", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJUcmFpbmVlIHNvZnR3YXJlIERldmVsb3Blci1QZWdhIiwiY29tcGFueV9uYW1lIjoiQ29sbGFiZXJhIFRlY2hub2xvZ2llcyBQdGUuIEx0ZC4iLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IkRFMlpVMkVfeEIyajRTNnBBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTW9uc3RlciIsImxpbmsiOiJodHRwczovL3d3dy5tb25zdGVyLmNvbS5zZy9qb2IvdHJhaW5lZS1zb2Z0d2FyZS1kZXZlbG9wZXItcGVnYS1jb2xsYWJlcmEtdGVjaG5vbG9naWVzLXB0ZS1sdGQtc2luZ2Fwb3JlLTI1ODI1Nzc/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Software Engineer", "company_name": "Career Edge Asia Pte Ltd", "location": "Singapore", "via": "via Glassdoor", "description": "5 working days, Mon – Fri , Normal office hours\nSalary Range: $4k +AWS+VB\n\nResponsibilities\n• Responsible to troubleshoot and configure applications in Linux or Windows environment\n• Responsible to design Cloud base on client request\n• Troubleshoot and resolve issues in all the cloud environments\n• Manage and suppport cloud platform set up and deploy 3rd party projects into system\nRequirements\n• Minimum Diploma in IT or Related\n• Minimum 2 years experience in Linux distribution / Window servers.\n• Proficient in cloud platform such as AWS, Azure, GCP etc.\n• Proficient in server-side scripting languages such as Python.\n• AWS / GCP Certified is a plus\n\nCompetitive remuneration package will be offered to the shortlisted candidate.\n\nInterested candidates, please send your updated CV in MS Words format stating your last drawn salary, expected salary, notice period and reason for leaving last / past employment(s) and email to recruit21@caed.com.sg for priority processing.\n\nAttn: Jace Tay... (Registration No.: R1331152)\n\nCAREER EDGE ASIA PTE LTD\n\nEA Licence Number: 13C6678\n\nTo find out more job opportunities, visit Career Edge Asia at www.caed.com.sg for all job listings.\n\nEmail: recruit@caed.com.sg\n\nMore Information\n• Salary Offer $3k – $4k +AWS+VB", "extensions": ["16 days ago", "Full–time"], "detected_extensions": {"posted_at": "16 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciIsImNvbXBhbnlfbmFtZSI6IkNhcmVlciBFZGdlIEFzaWEgUHRlIEx0ZCIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoicnVEbWkzbWNDWHdUQzh1X0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBHbGFzc2Rvb3IiLCJsaW5rIjoiaHR0cHM6Ly93d3cuZ2xhc3Nkb29yLnNnL2pvYi1saXN0aW5nL3NvZnR3YXJlLWVuZ2luZWVyLWNhcmVlci1lZGdlLWFzaWEtcHRlLUpWX0lDMzIzNTkyMV9LTzAsMTdfS0UxOCwzOC5odG0/amw9MzY1NzMwMzk2NFx1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Software Engineer (Web, Frontend, Backend, Full-Stack)", "company_name": "Surer", "location": "Singapore", "via": "via LinkedIn", "description": "Get a more meaningful career with us 🚀 Surer is an InsurTech startup that will revolutionise the way the General Insurance industry manages their entire workflow, from an agent advising their clients (the end policyholder) to how the Insurer distributes their products. And as a Software Engineer, you get to be a part of the revolution! We are building delightful experiences for insurance intermediaries and some of the biggest insurers out there, and this role at Surer only means you design, build, and ship for them! At Surer, you can take on big responsibilities to solve some of today's greatest problems in the Insurance industry. It does not matter if you're stronger in frontend, backend, or both; as long as you're passionate about and skilled at building web products, there's a place for you! Responsibilities We are looking for a talented and self-driven Software Engineer who has the nous to think out-of-the-box and make use of the great flexibility we provide to our team - to make... a big difference for the Insurance industry and empower the parties within this ecosystem. Your day to day task will be focused on working directly with our CTO and the founding team and be on the leading front to develop new features, suggest better processes, re-engineering and testing of functionalities. In summary, you will: Design, develop, test, deploy, maintain and improve our full-stack web software Coding: consistently write production-ready code that is testable, easily understood by other developers, and accounts for edge cases and errors, with scalability and performance in mind. Testing: write unit tests as well as higher-level tests in accordance with it. Debugging: proficient at debugging systematically to diagnose all issues located to a single service Collaborate closely with our product designer, product owner, and other engineers based on Agile principles and work with tool sets such as JIRA (or similar issues management systems) while keeping an eye out for emerging technology trends and developments. Technical documentation Experience and Skill Sets Must have: Bachelor’s Degree in Information Technology, Computer Science or equivalent Preferably at least 1 year of experience in software development, working on business applications, however fresh grads will be considered as well Knowledge or experience in full stack web application development with a variety of languages including but not limited to .Net Core, Javascript, HTML and CSS Knowledge or experience in the concept of web development such as HTTP, HTTPS protocols, backend code integration with frontend code via RESTful APIs Experience in dealing with Git repo Value high quality code and you want to satisfy your thirst for knowledge of the latest technologies every day Strong understanding of good software engineering practices (version control, code reviews, testing, refactoring etc.) Able to understand and communicate ideas clearly with team members Nice to Have: Knowledge or experience in DevOps and in using the surrounding ecosystem of tools Knowledge or experience in working in an agile development environment and familiar with being in a SCRUM team Good grasp of security principles, and develops with a security-first mindset CI/CD practices Familiar with frameworks such as jQuery, Bootstrap Able to work independently as well as in a team Able to multitask in a demanding, fast paced environment and work with minimal supervision to meet deadlines Knowledge or experience in TDD (Test Driven Development) and/or BDD (Behaviour Driven Development) Knowledge or experience in building Microservices Knowledge or experience in Domain Driven Design (DDD) What you can get out of us Exposure to a fast-paced, yet fun, startup culture Work directly with the founding team and have autonomy to make certain decisions Opportunity to develop industry-changing products Gain knowledge and experience in the InsurTech and FinTech industry Flat team structure with no office politics You will be engaged in conversations about the business to have a broader perspective of the value of your work as an engineer We are a young startup and so have many interns in the team - they will look to you for guidance, which is an opportunity to hone your leadership skills --- About Surer Surer is a cloud-based, web platform with a market-first technology in the region, that helps all parties in the General Insurance industry automate processes and drive network collaborations, enabling them to provide better service and support to their clients. Launched in August 2020 in Singapore, Surer was founded by a group of professionals with years of experience in the Insurance industry who are passionate about solving inefficiencies within the General Insurance industry as it was a problem they had faced as well. Surer is certified by the Singapore FinTech Association as an InsurTech service provider and is one of the portfolio companies funded by Antler, a global early-stage venture capital firm that invests in the defining technology companies of tomorrow. Visit https://surer.sg/ for more information or read about us in the media at https://surer.sg/category/in-the-news/. About the founders Founded by Gordon, Derren and Renfred, we have held positions to grow the business in highly successful startups like PropertyGuru and Carousell, successfully founded and exit-ed from a VendTech startup, ShakeSalad, while also having careers in major insurance companies like AIG, MSIG and QBE. One of us is even an Asian Games Gold Medalist", "extensions": ["8 days ago", "$3.5K–$5K a month", "Full–time"], "detected_extensions": {"posted_at": "8 days ago", "schedule_type": "Full–time", "salary": "$3.5K–$5K a month"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciAoV2ViLCBGcm9udGVuZCwgQmFja2VuZCwgRnVsbC1TdGFjaykiLCJjb21wYW55X25hbWUiOiJTdXJlciIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiMG5MOWNySlZud1VwMU5MdkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL3NnLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvc29mdHdhcmUtZW5naW5lZXItd2ViLWZyb250ZW5kLWJhY2tlbmQtZnVsbC1zdGFjay1hdC1zdXJlci0yNTA0MDM0NTk4P3JlZklkPTE2MWY2ZWYzLWI3ZjAtNGY5Yy1hOTc5LTA1NzU1ZWZhYmZmOFx1MDAyNnRyYWNraW5nSWQ9ZTRMVFNxVjBSQ20zaWp6N3Bpd0dZdyUzRCUzRFx1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Android Software Engineer, TikTok Live", "company_name": "TikTok", "location": "Singapore", "via": "via Bayt.com", "description": "TikTok is the leading destination for short-form mobile video. Our mission is to inspire creativity and bring joy. TikTok has global offices including Los Angeles, New York, London, Paris, Berlin, Dubai, Mumbai, Singapore, Jakarta, Seoul and Tokyo. TikTok Live client team focus has been focusing on delivery engaging and the best live streaming experience to global users. Our team develop creative and interesting features for streamers and viewers to express themselves and interact with others instantly. We are looking for passionate mobile software engineers to join us in this fast growing industry. Responsibilities:\n1. Design, implement the new-user features of our mobile application.\n2. Collaborate with the design and product teams to create a world-class mobile experience.\n3. Optimize mobile applications and user experience on the Android platforms.\n4. Promote robust and maintainable code, clear documentation, and deliver high quality work on a tight schedule.\n1. BS/MS degree in... Computer Science or equivalent majors with experience in native Android development.\n2. Proficiency in Java or Kotlin.\n3. Ability to understand and debug large and complex codebases.\n4. Good team communication and collaboration skills.\n5. Promote robust and maintainable code, clear documentation, and deliver high quality work on a tight schedule.\n6. Livestream knowledge is a plus but not mandatory", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIFNvZnR3YXJlIEVuZ2luZWVyLCBUaWtUb2sgTGl2ZSIsImNvbXBhbnlfbmFtZSI6IlRpa1RvayIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoicm5KMDNXOXZwTEhtb0dIV0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCYXl0LmNvbSIsImxpbmsiOiJodHRwczovL3d3dy5iYXl0LmNvbS9lbi9zaW5nYXBvcmUvam9icy9hbmRyb2lkLXNvZnR3YXJlLWVuZ2luZWVyLXRpa3Rvay1saXZlLTU4MjA2ODgzLz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Lead Software Engineer, IT - Channels (POS GI) (20000267)", "company_name": "The Great Eastern Life Assurance Co Ltd", "location": "Singapore (+1 other)", "via": "via Jobs", "description": "Lead Software Engineer, IT - Channels (POS GI) (20000267) The Great Eastern Life Assurance Co Ltd Posted on 5-Apr-21 Lead Software Engineer, IT - Channels (POS GI) (20000267) The Great Eastern Life Assurance Co Ltd Job DescriptionJob Purpose Responsible for building and maintain Java applications, include managing Java/Java EE application development while providing expertise in the full software development lifecycle, from concept and design to testing.Commitment to collaborative problem solving, translate business function/ requirement into technical design and product quality are essential. The Job Contribute in all phases of the development lifecycle. Developing high-volume, low-latency applications and delivering high-availability and performance. Translate application design and use cases into functional applications. Design, build, and maintain efficient, reusable, and reliable application coding. Identify bottlenecks and bugs, and propose solutions to these problems. Prepare... and produce releases of software components. Takes accountability in considering business and regulatory compliance risks and takes appropriate steps to mitigate the risks. Maintains awareness of industry trends on regulatory compliance, emerging threats and technologies in order to understand the risk and better safeguard the company. Highlights any potential concerns /risks and proactively shares best risk management practices. Our Requirements Proficient in Java, with a good knowledge of its ecosystems. Solid understanding of object-oriented programming. Familiar with various design and architectural patterns. Skill for writing reusable Java libraries. Knowledge of concurrency patterns in Java. Familiarity with concepts of MVC, JDBC, and RESTful services. Familiar and experienced with SQL, especially Oracle PL-SQL, packages and stored procedures. Experienced in Spring Framework, Hibernate (ORM), and Jasper report will be an added advantage. Implementing automated testing platforms and unit tests. Basic understanding of JVM, its limitations, weaknesses, and workarounds. Analyze and perform evaluation on defect raised by user to further advice. Provide support for SIT/ UAT. Ability to work in a fast paced, team-oriented environment with minimum direction and management oversight. Recognized University degree in relevant discipline. Preferable tertiary qualification in IT and insurance industry certified (eg. LOMA). Minimum 8 years’ experience in application developer position. Preferably with GENERAL insurance domain knowledge. Experienced in RESTful web-service, automation testing and performance tuning will be an added advantage High level of integrity, takes accountability of work and good attitude over teamwork. Takes initiative to improve current state of things and adaptable to embrace new changes. To all recruitment agencies: Great Eastern does not accept unsolicited agency resumes. Please do not forward resumes to our email or our employees. We will not be responsible for any fees related to unsolicited resumes. Additional Information Senior Executive Qualification Bachelor's Degree, Post Graduate Diploma, Professional Degree Founded in 1908, Great Eastern is a market leader and a well-established trusted brand in Singapore and Malaysia. With S$82.5 billion in assets and over 4 million policyholders, the Group also operates in Indonesia and Brunei and has a presence in China as well as a representative office in Myanmar. The Great Eastern Life Assurance Company Limited and Great Eastern General Limited have been assigned the financial strength and counterparty credit ratings of \"AA-\" by Standard and Poor's since 2010, one of the highest among Asian life insurance companies. We are a LIFE company and our purpose is to empower generations to live healthier and better so that they can live life to the fullest. Be it celebrating life’s simple moments or commemorating life’s major milestones, every day, in many ways, we inspire those around us to live great and celebrate life", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJMZWFkIFNvZnR3YXJlIEVuZ2luZWVyLCBJVCAtIENoYW5uZWxzIChQT1MgR0kpICgyMDAwMDI2NykiLCJjb21wYW55X25hbWUiOiJUaGUgR3JlYXQgRWFzdGVybiBMaWZlIEFzc3VyYW5jZSBDbyBMdGQiLCJjb21wYW55X21pZCI6Ii9tLzAycW5mcDciLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiIyOGJJNlB6ZUo0UnZMMXMxQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFcllDQ3ZjQlFVNVZYMDV4VTFReFRUVndORTFDWlRSalFtOHhWMUJPVm5wS1JGaG5UMlpDWmpkb1VEaFNkV2g0WlRWa1ZFWmpXakpPTVZWS1VWUXRSbk00ZFZkMFZXNXVSV0pRVFhCMVZtczBkVXRIZEhOVlMxOUJjbTgyUW1wMU1FVlVRbVZ4WjBkcGNXNVRVRmxFY0hOd1QyOVZOVkp5Tlhod1lpMUVOMFZGTTNoMmJYaGxOa2xQVmxSRlkyaDJYeTFvT1ZWWFdYTTRhMG81VXpsNmFFMU1WSE5oVG1ocGNGUkplblpuVGxKaGJ6UmFWbEZhV1RkZlYwNVZMVXA2UVRST1ZWQjNhSEIzTlVOVmQwSnJZbGxqWVdWck5VUXdOME4xT1hoYU1tWm9Rako0YjFoSFlWbHBUUzF2UVVOWk1qaGFaMHhJWmtwdFVUbHJXUklXTWxoeFExbEtVRXhHTkMxWmMwRlhkV3h3WVVsQ2R4b2lRVTlOV1ZKM1JFUnBaRE5IWkMwM1lUaHhXWGRMV1RGSFdUWjZjbVpJTFRGc2R3IiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMjciLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9icyIsImxpbmsiOiJodHRwczovL3NnLmZpZGFudG8uY29tL2pvYnMvam9iLW9wZW5pbmcvc29mdHdhcmUtZGV2ZWxvcGVycy1hcHBsaWNhdGlvbnMvbGVhZC1zb2Z0d2FyZS1lbmdpbmVlci1pdC1jaGFubmVscy1wb3MtZ2ktMjAwMDAyNjctMjc1NTE1ODkwP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Software Developer (RPA) (BB-1A4C4)", "company_name": "ALTROCKS TECH PTE. LTD.", "location": "Singapore (+1 other)", "via": "via BeBee", "description": "Roles & Responsibilities Be responsible to code & configure process automation components of a RPA solution in collaboration with team • Understand given process nature, then prepare process design documents (PDD), also propose and write technical design document (TDD) Raise alerts to management if needed through the life of the project Develop customizations utilizing .Net and third party APIs; Collaborate with other team members, subject-matter-experts, process-owners and other stake-holders Identify and create reusable automation components; Implement Bot throughput logging, auditing, and exception handling; Support User Acceptance Testing with business and IT. Required Experience and Skills: Bachelor’s degree in IT, Software engineering or a related field. 4+ years of extensive experience in RPA development using any RPA tools Must have experience in Object oriented programming with Microsoft .Net (VB and C#) or VBA, Java, C#, IIS, JavaScript, RPA. Familiar or certified with... UiPath, Blue prism or AA. Familiarity with Microsoft SQL Server; Familiarity with web service interaction (REST/SOAP); Excellent communication skills with ability to manage multiple priorities Advantage to have knowledge on other RPA tools such as Blue Prism and Automation Anywhere Ability to work on own and in a team-oriented environmentTell employers what skills you haveC#C++JavaJavaScriptManagementMySQLProcess AutomationProcess DesignSoftware DevelopmentSQLTDDTechnical DesignXMLOracle AlertscustomizationMicrosoft .NET", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBEZXZlbG9wZXIgKFJQQSkgKEJCLTFBNEM0KSIsImNvbXBhbnlfbmFtZSI6IkFMVFJPQ0tTIFRFQ0ggUFRFLiBMVEQuIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJiTV9lQW8tamh3Vzl5c2Q0QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJlQmVlIiwibGluayI6Imh0dHBzOi8vc2cuYmViZWUuY29tL2pvYi8yMDIxMDQxNy00YTQzZGY3MmQxYWFiMmQwM2U3NmMzZDk5OTgxYTRjND91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior Software Developer", "company_name": "Singtel", "location": "Singapore", "via": "via Laimoon.com", "description": "Singtel, Asia's leading communications technology group, provides an extensive range of telecommunications and digital services to millions of consumers and businesses across Asia, Australia, Africa and the USA. With over 140 years of innovation behind us, we continue to push boundaries in our networks and services, to enrich lives and transform businesses.\n\nOur core values - Customer Focus, Challenger Spirit, Teamwork, Integrity, and Personal Excellence - shape the way we work. We are passionate about making a difference and have an open and inclusive culture where everyone is empowered to do their best. Our diverse business means you will enjoy unique opportunities and rewarding experiences to learn and grow your career in a dynamic industry.\n\nJoin us and experience what it's like to be with an Employer of Choice*. Together, let's create a brighter digital future for all. *Awarded at the HR Fest Awards 2020\n\nWe are seeking for a hands-on full stack developer, who will be part of the... software development team of the Group Enterprise 5G/IOT product house, contributing on the software development for 5G business services platform and application suite. Singtel is building a unique 5G platform completely homegrown and in this position you will work with the 5G product team, to:\n• Build the 5G platform in a completely scalable fashion that can process millions of messages concurrently and can scale upto million concurrent enterprise application connections.\n• Contribute to designing and developing the platform in an infrastructure agnostic fashion so that the platform can work with any network backend in a plug and play fashion.\n• Bring in your experience in building scalable and repeatable platforms to make every component of the platform modular by design with industry grade security.\n• Design and implement RESTful APIs to expose platform features as microservices.\n• Build and deploy performant modern web applications in React, Redux, Webpack, ES6, and Flow\n• Architect efficient and scalable backend systems\n• Write unit, functional and end-to-end tests for the platform\n• Write high-quality code (Ruby on Rails, Go, Java etc) that communicates with upstream backend services via HTTP APIs\n• Identify and resolve performance and scalability issues\n• Participate in code reviews\n• In depth understanding of the whole web stack, web protocols, and web performance optimisation techniques\n• In-depth understanding of web frameworks (such as Rails, Django, Spring etc)\n• Detailed knowledge of minimum one modern JavaScript framework: React, Ember, Angular, etc\n• Proficient understanding of the HTTP protocol\n• In depth knowledge of Relational, No-SQL databases, and message queues/brokers\n• Understand at least one backend MVC framework - Java and Spring Boot are strongly preferred\n• Build micro-services and understand different patterns to approach the designs.\n• Worked on cloud platforms preferably PCF and used tools such as Docker.\n• Experience in designing and delivering APIs and security models\n• Excellent understanding of\n• Message queue systems (Kafka)\n• Monitoring and logging tools (ELK, Splunk)\n• Front-end frameworks (React, Vue JS, Bootstrap, jQuery)\n• Web app frameworks (Django, Drupal etc.)\n• Databases and storage/caching (Postgres, MongoDB, Redis)\n• Contribute to software development and associated new technology selection and adoption. Focus areas include developing API driven features on big data, machine learning, auto scaling micro-services, scalable data storage/retrieval.\n• Work on architecture and software development across platform components like customer onboarding, data management, application lifecycle etc along with development of 5G applications, collaborating with multiple teams within the SingTel Group.\n• Participate on common platform functionality, and consistent, best-practice platform and application design.\n• Adopt industry standard coding practises to develop the platform to ensure scalability, security and stability\n• Participate on the move to a full SaaS deployment and management\n• Train Pre-sales team and solution architecture team to use the Singtel 5G platform and act as SME on the platform.\n• Collaborate with Business development and partnership team to develop integration adapters for third party technology and applications.\n• Participate in technical partnership conversations and due diligence\n\nThe succcessful candidate should possess:\n• MInimum a Degree in Computer Science or equilavent\n• Knowledge of Backend Programming Language like Java (J2EE and J2SE 1.8 or higher) and Python. Additional knowledge on Scala would be preferable\n• Knoledge of Front End Programming Language like HTML, CSS, Drupal, Bootstrap, Angular, JQuery. Additional knowledge on Reactjs would be preferable.\n• Knowledge of Database Technologies like Cassandra, MongoDB and Elasticsearch (At least 2). SQL databases like Postgres, MySQL\n• Knowledge of Source code Management and Build like GIT, Maven, Ant and Scrum/Task Management with JIRA, Confluence\n• Knowlecge of Messaging using Kafka, Any Pub/Sub library\n• KNowledge of Dev Ops & Containerization like Docker, Jenkins and has done scalable deployment with Kubernetes\n• Experience with Machine Learning Libraries like MLib, DL4J, H20, Tensorflow (Atleast one)\n• Has deploy project using Big data Platforms like Spark (Core and Streaming) or Hadoop and File systems like HDFS\n• Familiar with Integration methods like REST API's, messaging, WSDL, SDK's and API Documentation lusing Swagger or similar\n• Experience developing complex, enterprise grade, configurable, scalable software products.\n• A background in systems level thinking and design. Combined with the ability to translate technical strategy and architectures into concrete, minimal viable products, with the right tradeoffs and phasing.\n• Broad and deep knowledge of relevant technologies, including messaging, relational and NoSQL databases, data modelling, analytics, IoT, and interfaces. Exposure and experience with Artificial intelligence will be a plus.\n• Deep understanding of the architectural principles for cloud based platforms that include SaaS, PaaS, multi-tenancy, infrastructure as code, and continuous availability.\n• Experience working in an agile environment\n• Strong written and verbal communication skills.\n• Ability to collaborate effectively across various cross-functional teams and groups.\n\nWe believe in the strength of a vibrant, diverse and inclusive workforce where backgrounds, perspectives and life experiences of our people help us innovate and create strong connections with our customers. We strive to ensure all our people practices are non-discriminatory and provide a fair, performance-based work culture that is diverse, inclusive and collaborative.\n\nTechnology", "extensions": ["4 days ago", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgRGV2ZWxvcGVyIiwiY29tcGFueV9uYW1lIjoiU2luZ3RlbCIsImNvbXBhbnlfbWlkIjoiL20vMDIwemZsIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiVWZSbDdyVEtad0xqeko1QkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXNzQkNvd0JRVTVWWDA1eFV6RXpaa1IzWkhKS1gzQklMVWwyVURsdk9WbGtjR2hZUms5RlZVRjVOa3BKT1ZwUGRUbFNhakZrTTAxVVZEVk5SWFpzTURWUk5XdG9aMnhyTkdwRVpqSXhiVFJ2YjFoRmRuUTNhWEpZWVdWcE1HcHBkV2swTjNrM2IwcEtXblZ3VG0xMllXbDJZMWhyTFRkdmNuRlhPVWRsZVVkbWNWWjNWVE5EUVd0YVpVSnpjMWRVVVhFU0ZqSlljVU5aU2xCTVJqUXRXWE5CVjNWc2NHRkpRbmNhSWtGUFRWbFNkMEl6YVdoRFlqQkhaVTlEWnpacVZ6bDRRV2t5Y0c1dWVIZFNabEUiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18zOCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMYWltb29uLmNvbSIsImxpbmsiOiJodHRwczovL2pvYnMubGFpbW9vbi5jb20vam9icy9leHRlcm5hbHZpZXcvMjU3MzU2NTI/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Backend Software Engineer - Senior or Junior", "company_name": "Osim International Pte. Ltd.", "location": "Singapore (+1 other)", "via": "via Monster Singapore", "description": "OSIM is looking for talented BACKEND SOFTWARE ENGINEER (Senior or Junior)who are interested in creating IoT products in an open and flexible agile environment. Depending on your personal capability, you can be either a Tech Leader or Key Team member. We will reward the right person competitively for their service.\n\nWhat are you waiting for!!! If you are able to:-\n\nWork closely with fellow Backend Engineers, Frontend Engineer, Product Owner, UI/UX Designers to define, refine, and implement features on the IoT and AI related product lines.\n\nWork closely with Electronic Engineer on the interface between backend and Communication Daughter Cards (CDC), define interfaces (e.g. REST API andcommunication data structure).\n\nWork closely with DevOps to build frameworks and tools, define standards (e.g. REST API) and improve overall efficiency of the development (e.g., CI/CD) and hygiene of the codebase (i.e., Git).\n\nWork closely with QAs to make sure the key API and UI are covered by automation... testing and manual testing.\n\nWork on complex engineering problems to improve the scalability, security, and reliability of our platform.\n\nHave hands-on programming and architecture design skills with demonstrated willingness and capability to learn new technologies quickly.\n\nThe right talent will have:-\n\n1 ~ 7 years of backend software engineer relevant working experience.\n\nBe able to use programming languages to solve complex problems in a given time with clean code style and modularized code structure. Prefer Python and C#.\n\nExperience of cloud services, (e.g. AWS, Azure), backend frameworks (e.g. .Net Core and Flask), relational database (e.g. MySQL), CI/CD flow (Docker, Circle CI, Travis).\n\nStrong understanding of system performance and scaling, Demonstrated ability to design, build, and deliver complex, successful REST servicesand/or customer experiences efficiently and with quality.\n\nExperience of working in an Agile team, preferably in roles exposed to full cycle scrum product development.\n\nBe able to own the product with proactive and responsible attitudes.\n\nAdditional Advantage:\n\nAI (NLP or CV) knowledge and experience\n\nIoT product knowledge and experience\n\nEntrepreneur experience\n\nBeing able to review the CDC code in C language", "extensions": ["4 days ago", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJCYWNrZW5kIFNvZnR3YXJlIEVuZ2luZWVyIC0gU2VuaW9yIG9yIEp1bmlvciIsImNvbXBhbnlfbmFtZSI6Ik9zaW0gSW50ZXJuYXRpb25hbCBQdGUuIEx0ZC4iLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjZmYmVZVzFuVzBYZU55enpBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTW9uc3RlciBTaW5nYXBvcmUiLCJsaW5rIjoiaHR0cHM6Ly93d3cubW9uc3Rlci5jb20uc2cvYW1wL2pvYi12YWNhbmN5LWJhY2tlbmQtc29mdHdhcmUtZW5naW5lZXItc2VuaW9yLW9yLWp1bmlvci1vc2ltLWludGVybmF0aW9uYWwtcHRlLWx0ZC1zaW5nYXBvcmUtMjczMzM4ODUuaHRtbD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Microsoft Dynamics Developer", "company_name": "Cognizant", "location": "Singapore", "via": "via Learn4Good", "description": "Cognizant hiring a Microsoft Dynamics 365 developer / Architect for Singapore location, find the below job description.\n\nJob Description:\n• Overall 5+ years’ experience in implementing large packaged CRM applications\n• Microsoft Dynamics CRM certified (Microsoft Power Apps + Dynamics 365 Developer - MB-400)\n• Well versed with the overall technical architecture of Dynamics 365\n• Must have 4+ years hands-on development experience in Dynamics project, specifically developing web services, C#, ASP.NET, Javascript and successfully integrate with Dynamics 365\n• Should have worked complete life cycle of at least 2-3 projects.\n• Must have good knowledge on Sales, Service, Marketing modules\n• Experience with deployment of Dynamics CRM solution on hand-held devices preferred\n• Well versed with different versions of .NET Framework, WPF, C# programming, CRM SDK, SQL Server\n• Experience in designing and deploying custom reports/Dashboards with Dynamics 365\n• Experience in CRM Portals, USD & Field... service\n\n#LI-CTSAPAC\n\nEmployee Status : Full Time Employee\n\nShift : Day Job\n\nTravel : No\n\nJob Posting : Apr 07 2021", "extensions": ["2 days ago", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJNaWNyb3NvZnQgRHluYW1pY3MgRGV2ZWxvcGVyIiwiY29tcGFueV9uYW1lIjoiQ29nbml6YW50IiwiY29tcGFueV9taWQiOiIvbS8wM2JmOWgiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJITG5XV0ExNUxfaVNaNG1tQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VkVGQmRrRTJWRWhqZEVSWE0xRmhOamRmUldWeVkycENTVTF3Y0ZOUVZFMUNZV290UVVNeVkxSk1UREZIVXpFMlltcERRbEpJY0dad2FsaE5OMnBrVjJGUVlsUlhSMWh1TFZSbVpTMHRhMjl6YlRnek1TMVFWVkJUVms5SmNVSjBaM0o0YTFNNFgzVndiVmN6WkRsb1EwaFBjbFZOY0VNMldsWmxORGh0WlVGWkxXczBUa1ZtTlRaMU0wbGtMWEZ5WVdzMVJUTm1Ua3BUU3pWQkVoWXlXSEZEV1VwUVRFWTBMVmx6UVZkMWJIQmhTVUozR2lKQlQwMVpVbmRCVjAxS1FtbEZlVlp3U2paZmEzbExPVWRtZGsxVk1HaHJVbGxSIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNTAiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGVhcm40R29vZCIsImxpbmsiOiJodHRwczovL3d3dy5sZWFybjRnb29kLmNvbS9qb2JzL3NpbmdhcG9yZS9zb2Z0d2FyZV9kZXZlbG9wbWVudC8yNjk0MjgzMjMvZS8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}], "chips": [{"type": "Title", "param": "job_family_1", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Software engineer", "value": "software engineer"}, {"text": "Programmer", "value": "programmer"}, {"text": "Programmer analyst", "value": "programmer analyst"}, {"text": "Senior", "value": "senior"}, {"text": "Cnc programmer", "value": "cnc programmer"}, {"text": "Engineer", "value": "engineer"}, {"text": "Analyst programmer", "value": "analyst programmer"}, {"text": "Science", "value": "science"}, {"text": "Software programmer", "value": "software programmer"}, {"text": "Assistant", "value": "assistant"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Electrical engineer", "value": "electrical engineer"}, {"text": "Executive", "value": "executive"}, {"text": "Java engineer", "value": "java engineer"}, {"text": "Java programmer", "value": "java programmer"}, {"text": "Lecturer", "value": "lecturer"}, {"text": "Manager", "value": "manager"}, {"text": "Operator", "value": "operator"}, {"text": "Project officer", "value": "project officer"}, {"text": "Senior programmer", "value": "senior programmer"}, {"text": "Senior system", "value": "senior system"}, {"text": "Senior technical", "value": "senior technical"}, {"text": "Sr. programmer", "value": "sr. programmer"}, {"text": "Systems programmer", "value": "systems programmer"}, {"text": "Technical", "value": "technical"}, {"text": "Trainee", "value": "trainee"}, {"text": "Trainer", "value": "trainer"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Mining", "value": "/business/naics2007/21"}, {"text": "Rental", "value": "/business/naics2007/532"}, {"text": "Wholesale", "value": "/business/naics2007/42"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "EPAM", "value": "/m/0dlnrc"}, {"text": "VISA", "value": "/m/01kqjn"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "Citi bank", "value": "/m/01dfb6"}, {"text": "TikTok", "value": "/g/11fy265933"}, {"text": "Ubisoft", "value": "/m/02qdyj"}, {"text": "Cognizant", "value": "/m/03bf9h"}, {"text": "HCL SINGAPORE PTE. LTD.", "value": "/g/11fy25ngsv"}, {"text": "Oracle", "value": "/m/05njw"}, {"text": "Credit Agricole Group", "value": "/m/028vbm"}, {"text": "Mindteck (India) Limited", "value": "/m/0cqj8w1"}, {"text": "Nanyang Technological University", "value": "/m/0l49k"}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Zühlke Group", "value": "/g/1hh_rg216"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Avensys Consulting Pte Ltd", "value": "/g/11g7022gjf"}, {"text": "Avnet", "value": "/m/0c8xmc"}, {"text": "GlobalTix Pte Ltd", "value": "/g/11dxpqdhrf"}, {"text": "Government Technology Agency", "value": "/g/11gh0528nq"}, {"text": "J.P.Morgan", "value": "/m/01hlwv"}, {"text": "Optimum Solutions (Singapore) Pte Ltd", "value": "/g/11g70hkrbx"}, {"text": "Razer Inc.", "value": "/m/075hc0"}, {"text": "Realtek Malaysia", "value": "/m/05wrm7"}, {"text": "Realtek Singapore Private Limited", "value": "/g/11g9n26trs"}, {"text": "Success Human Resource Centre Pte Ltd", "value": "/g/11g709_209"}, {"text": "TECHNOPALS PTE. LTD.", "value": "/g/11dxpvkynp"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "UST", "value": "/m/08kb8g"}, {"text": "UrbanFox", "value": "/g/11ghs7y0w6"}, {"text": "Adecco GS", "value": "/m/08gz46"}, {"text": "Alphanova Pte. Ltd.", "value": "/g/11f8h_czps"}, {"text": "BioMind", "value": "/g/11dymfr2l6"}, {"text": "Biqmind", "value": "/g/11g21fzhrb"}, {"text": "BitTitan", "value": "/g/11dxpksv89"}]}]}