{"search_metadata": {"id": "60827ad4fe41d0b380d45ea5", "status": "Success", "json_endpoint": "https://serpapi.com/searches/ef5a87a7026315d0/60827ad4fe41d0b380d45ea5.json", "created_at": "2021-04-23 07:44:20 UTC", "processed_at": "2021-04-23 07:44:20 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28product+manager%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=150", "raw_html_file": "https://serpapi.com/searches/ef5a87a7026315d0/60827ad4fe41d0b380d45ea5.html", "total_time_taken": 1.81}, "search_parameters": {"q": "(product manager) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "150"}, "jobs_results": [{"title": "Sr. Product Manager, AWS Professional Services", "company_name": "Amazon", "location": "Singapore", "via": "via Jobs", "description": "Job Description :AWS Professional Services helps Customers achieve their desired business outcomes through the innovative use of the AWS platform. To ensure Customers have a seamless experience with accelerated time-to-value, AWS Professional Services builds and maintains Customer Solutions and Packaged Offerings. These Solutions and Offerings can be technology specific and/ or industry specific. We are looking for Sr. Product Managers who will build, launch, maintain, and enhance AWS Professional Services Solutions across Asia Pacific and Japan (APJ).Part technologist, part industry expert, part program manager, part product management – this multi-faceted hands-on role is based in Singapore with APJ coverage. This is an individual contributor role that will lead cross-functional efforts. In addition to building and launching AWS Professional Services Solutions, you'll also oversee the localization of Solutions for non-English speaking market segments.It is always Day 1 at Amazon. As... such, we're looking for candidates who embrace the entrepreneurial spirit – they understand the customer deeply, build and launch Solutions, localize them when needed, and iterate the Solution based on feedback.A great candidate will have hand-on skills with Cloud Architecture or Data Analytics, have experience in curating and launching professional services offerings at scale across APJ, would have worked in one or more industry verticals, possess excellent business acumen, have a proven track record of high-caliber program management, and have strong communication skills. Most of all, they will have a keen willingness to learn and demonstrate the Amazon Leadership Principles.Responsibilities· Responsible for end-to-end lifecycle of Solutions from build, launch, maintain, enhance, and retire.· Distill customer needs for both technical and industry Professional Services Solutions through direct customer engagement, market segment analysis, and input from other AWS teams.· Build end-to-end outcome-oriented AWS Professional Services Solutions including: Delivery kit (code, diagrams, documentation); Sales kit (proposal, pitch deck, statement of work); Delivery and Sales enablement content· Develop and execute Solution launch plans through collaboration with other AWS functions.· Measure Solution adoption and impact including customer feedback.· Capture and publish customer references.· Work with internal teams and external vendors to localize Solutions for non-English speaking market segments (you do *not* need to be an expert in non-English languages!)· Contribute to Enterprise programs working closely with AWS Business Development, Sales, Solution Architecture, Professional Services teams.· Solution delivery is not a core part of the role. However, the Sr. Product Manager will guide delivery resources from time-to-time, primarily post-launch.· Where relevant, work with members of the AWS Partner Network (APN) to co-develop Solutions.· This is an individual contributor role.· Approximately 25% travel expected (only after Covid-19 travel restrictions lift).Basic Qualifications :· 15+ years of experience in technical product management or professional services for a technology consulting/ software development organization.· Proven track record in analysis of customer needs across market segments.· Led and delivered Cloud programs (e.g., Cloud migrations, developed Cloud native applications).· Must have hands-on skills with Cloud Architecture and/ or Data Analytics.· Experience with Agile delivery, engagement leadership and product lifecycle management.· Understanding of distributed systems and operating at Cloud scale.· Regional experience across Asia Pacific and Japan. Must be comfortable working with a globally dispersed organization.· Excellent written and verbal communication skills.Preferred Qualifications :· All of the basic qualifications.· A minimum of 5 years' experience working with customers from an industry vertical (preferred verticals include Financial Services, Telco, Manufacturing, Oil and Gas, Media & Entertainment).· Exposure to Lean product management/ Design Thinking.· AWS certified or equivalent. Associate level or Professional level (preferred", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTci4gUHJvZHVjdCBNYW5hZ2VyLCBBV1MgUHJvZmVzc2lvbmFsIFNlcnZpY2VzIiwiY29tcGFueV9uYW1lIjoiQW1hem9uIiwiY29tcGFueV9taWQiOiIvbS8wbWdrZyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjBZTDFGTFZKZUVLTU5RSW1BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVzd0JDb3dCUVU1VlgwNXhVVzloYW1OTVptMVRSemRCVXpFMFVGWkRhbEZ0ZW1kQ2NtZG9NekY1VldzM01WWkRkV3BMVVVZdFQzZFpVbU5yYjFSUlEyUkNNQzF3UjFaMU9VVkpXR3BSWm5sNk1taFNPRWRUZDFoRFFVRmhiV3QwZUZKR1NXbHFOMUpMVWt4S1VubFRjMUE0Um1GTE4ybFRURFJTVVVKQ1JXVk9OVFprVkdoNllteG9URUZOWmxaWmRsVVNGekZZY1VOWlRVOUdRbG95YXpWT2IxQmZUVU56TmtGRkdpSkJUMDFaVW5kQ1lUbDFOVzluV0ZCTU1EbFBhbWhvZW5WdmFUQjBaMXBzTlVoQiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzciLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9icyIsImxpbmsiOiJodHRwczovL3NnLmZpZGFudG8uY29tL2pvYnMvam9iLW9wZW5pbmcvaW5kdXN0cmlhbC1wcm9kdWN0aW9uLW1hbmFnZXJzL3NyLXByb2R1Y3QtbWFuYWdlci1hd3MtcHJvZmVzc2lvbmFsLXNlcnZpY2VzLTI3NTIyMTE2MT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Trade Product Development Manager", "company_name": "OCBC Bank", "location": "Singapore", "via": "via Laimoon.com", "description": "Key Responsibilities:\n• Support digital development of trade finance products and services.\n• Enhance existing product features / processes for better efficiency and value proposition\n• Develop product commercialisation plan to increase the business performance\n• Work closely with sales and RMs to keep pulse of customers' evolving needs\n• Keep close to market development especially in the digital arena to evaluate the benefits to the bank\n\nQualifications\nOther Requirements:\n• Up to 5 years working experience. Non - banking experience can be considered.\n• Experience related to project management / MIS / data analytics will be an advantage.\n• Strong inter-personal and communication skills\n• Team player , self-motivated, keen to learn and inquisitive\n• Proficient in Microsoft Excel\nCorporate Banking", "extensions": ["7 days ago", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJUcmFkZSBQcm9kdWN0IERldmVsb3BtZW50IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJPQ0JDIEJhbmsiLCJjb21wYW55X21pZCI6Ii9tLzA1NXIyNyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Ik1pZHgtc25TeGM5S2JtRHVBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1SUJDcUlCUVU1VlgwNXhVVU13U0ZGWWJrbGFXbVZ0Y1VNdFJqazNjVXgyVTA5TU9GaGljR0ZzWjBKR2VGUXlOVzE2VDNCNlVWSXRSMk5OVlZwV05rNHpMWE5LVEZnek1Ga3pWVWhpTjJjNVRHdHRVazlKUTNaWmVtdGZVWEpsTFZGSGQwdE1kRE4yY0hwUFJsbE9XVzlvY20weE1VTmxYMmxFVDFWR01FTnNMVFp2TkZCV1gxcE9SMUJ3TWtGUVNFWnVXRmhMV0c5SVgyWXhZbkpPUWs1S1FuSTNZak5CRWhjeFdIRkRXVTFQUmtKYU1tczFUbTlRWDAxRGN6WkJSUm9pUVU5TldWSjNRMU5JTUdzMWVtY3lNa05PU0ZKQk1YZEphMWhWV0hCTFdtY3RRUSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzE1IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExhaW1vb24uY29tIiwibGluayI6Imh0dHBzOi8vam9icy5sYWltb29uLmNvbS9qb2JzL2V4dGVybmFsdmlldy8yNTk1NDUyNj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior Product Manager-Payment", "company_name": "Binance", "location": "Singapore", "via": "via Bayt.com", "description": "Binance is the global blockchain company behind the world’s largest digital asset exchange by trading volume and users, serving a greater mission to accelerate cryptocurrency adoption and increase the freedom of money.\n\nAre you looking to be a part of the most influential company in the blockchain industry and contribute to the crypto-currency revolution that is changing the world?\n\nResponsibilities:\n• As a Product Manager of Binance Pay, responsible for Pay Products(Web and App), merchant management platform and backend administrative system.\n• Work closely with business development, technical team, risk, compliance team, big data team and etc.\n• Deliver world class crypto payment solution.\n\nRequirements:\n• Product design skill set including prototyping using wireframe and sequence diagram tools, good user story writing skill.\n• Good knowledge about product development life cycle and have experience involved at various stages, UI/UX design, test case review, production support and... operational process optimization.\n• 5 years+ payment and e-Payment product experience.\n• Extensive market research and analysis capability to ensure product's competitive edge.\n• Data analytical skill. Able to design product performance dashboard, and optmize the product using data driven approach.\n• Good understanding of the risk and compliance risk/issue in payment product.\n• Good knowledge about payment reconciliation and settlement.\n• Able to survive in fast-pacing environment.\n• Self-driven and looking for quick career growth.\n\nBetter to Have:\n• Knowledge about the cryptocurrency industry.\n• Knowledge about technical implementation limitations.\n• Good coordination skill to manage the development.\n• Deep insight into marketing and business development activities", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgUHJvZHVjdCBNYW5hZ2VyLVBheW1lbnQiLCJjb21wYW55X25hbWUiOiJCaW5hbmNlIiwiY29tcGFueV9taWQiOiIvZy8xMWhjejFyNHdsIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiZnFISU9qOGxwU3VNU0hYc0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVJQkNxSUJRVTVWWDA1eFUxWjViRnB0TkRodGIwSlBXV2xtUjFjMFUyTmlRemhGZEZVM2VuRlpSa0o0YlhSdFYxaGxNbHB3TVMxV1UxbDRNa04yYzNsRllTMW5ORXBJV2poSVdGOHhaMWsyUzJKRFJrOHlWSGMyUVdSS1VIaEZWVEZOTTFaWVVWOVZSVUowTW0xYUxXbzNha0pIVlRsMmFHZ3plVmhoTTJkYVVqZG9UbWQ1TFVsUWNXNURObVJyWm1sWU5EZzFhVVJUWkdaRVVtZHhRbE0wTTI5QldYWlJFaGN4V0hGRFdVMVBSa0phTW1zMVRtOVFYMDFEY3paQlJSb2lRVTlOV1ZKM1EyazBYMnR6YUZwelFYcGtXa1ZXTm5aTWMxbHVNVmQxZEc1WWR3IiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMjIiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQmF5dC5jb20iLCJsaW5rIjoiaHR0cHM6Ly93d3cuYmF5dC5jb20vZW4vc2luZ2Fwb3JlL2pvYnMvc2VuaW9yLXByb2R1Y3QtbWFuYWdlci1wYXltZW50LTU5MTk4MTQ5Lz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Project Manager (Integrated Digital Product Centre), I2R", "company_name": "Agency for Science, Technology and Research", "location": "Singapore (+1 other)", "via": "via LinkedIn", "description": "TheIntegrated Digital Product Centre translates research outcomes by co-creating with the industry products and solutions that leverage A*STAR digital technologies for commercial applications, economic development, and public benefit.\nThe project manager will drive multiple translation projects, in partnership with internal technical teams and external service/equipment providers, from conceptualization to completion, within budget, schedule and scope.\n\nResponsibilities\n• Conceptualise, plan, direct and manage projects in partnership with internal R&D and engineering teams, and external commercial service/equipment providers, with the aim to translate A*STAR digital R&D technologies into commercial products.\n• Work strategically and independently across multiple simultaneous projects covering different technological areas and industry sectors.\n• Acquire manpower and budget resources for carrying out the projects by securing collaboration agreements with industry partners and/or... obtaining funding from internal and external funding agencies.\n• Define project objectives, purpose, scope, as well as shared expectations with internal and external stakeholders.\n• Manage project schedule, manpower resources and budget to ensure that project requirements, milestones and deliverables are met.\n• Manage the relationships with all internal and external stakeholders, understand their needs and expectations, and resolve conflicts and issues.\n• Define, monitor, and mitigate project risks by working with the project team and stakeholders to create and implement plans to respond to and resolve the risks.\n• Actively monitor project progress and resolve problems to keep projects moving forward. Report and escalate issues as needed.\n• Ensure project deliverables meet or exceed quality standards, and that project management process and procedures adhere to internal governance and policies.\n• Carry out progress reporting and status updates to internal and external management.\n• Create and maintain comprehensive project documentation.\n• Upon project closure, evaluate project outcomes and implement future improvements.\n\nJob Requirements\n• Minimum Bachelor's degree in Electrical Engineering, Communication Engineering, Computer Science, Information Technology, or related field.\n• Good technical background, with an excellent knowledge and skills in a wide range of infocomm and digital technologies.\n• 8-10 years of experience in the ICT sector, with at least 5 years of proven track record in a project management role.\n• PMP certification is preferred though not compulsory.\n• Experience in Agile and DevOps methodologies, as well as knowledge of major commercial cloud platforms (e.g. Amazon Web Services, Azure and AliCloud).\n• Ability to understand both technical and business issues and interface effectively between technical teams and industry.\n• Solid organizational skills including attention to detail and multi-tasking.\n• Excellent written, verbal communication and presentation skills.\n• Ability to effectively prioritize and execute tasks while under pressure.\n\nTheIntegrated Digital Product Centre translates research outcomes by co-creating with the industry products and solutions that leverage A*STAR digital technologies for commercial applications, economic development, and public benefit. The project m\n\nExperience: 8.00-10.00 Years", "extensions": ["7 days ago", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIgKEludGVncmF0ZWQgRGlnaXRhbCBQcm9kdWN0IENlbnRyZSksIEkyUiIsImNvbXBhbnlfbmFtZSI6IkFnZW5jeSBmb3IgU2NpZW5jZSwgVGVjaG5vbG9neSBhbmQgUmVzZWFyY2giLCJjb21wYW55X21pZCI6Ii9tLzBnbWpjZyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Ik9PX1NJak5QX0lUVTk5bzZBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVyY0NDdmNCUVU1VlgwNXhVazlxTVRZMlZEWnliMFpzTkRGMFRWaFJlbXRvWkhwQmNtMXZhRTgwWkRWeVMyVllSamR6Y21saE9UTlRaak5QWVRCTldrcHpUWGhKT1dGdVQyTlhaMnBCWWpjM1MyTTRWbXBzYkVKcFVuQkVkVVpYYUU1UmEwWnVkRVZGVEZsaGRUUmtXbXN4VURnM1lubEdkbGsyVm5FeVZHTnlVbE5pZFhsMWJrZEJXRWhSWkZsclpFaHVZVGN4ZEhwUlgwTktYMUJ5VUVVeWRreGxlbGcyTkRkTUxYQXlaa2hmY0dadGF6azVUVWhVUlRNNFkxaERNMWRrTXpKbFdtTjBOR1JaU1RSeVVVRnBhRVJZUkMxVGJHb3RORnBUTVZsbFQyWkNXbm96YUZwaGN5MUZNbWQ2VVdKNGFuQm9lVE4yZW1Ka1ZSSVhNVmh4UTFsTlQwWkNXakpyTlU1dlVGOU5RM00yUVVVYUlrRlBUVmxTZDBKa1RqWTJTblpTZVRkd2NqRmlSSE5xWmsxRE5sbFRiRkpaU21jIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMjkiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGlua2VkSW4iLCJsaW5rIjoiaHR0cHM6Ly9zZy5saW5rZWRpbi5jb20vam9icy92aWV3L3Byb2plY3QtbWFuYWdlci1pbnRlZ3JhdGVkLWRpZ2l0YWwtcHJvZHVjdC1jZW50cmUtaTJyLWF0LWFnZW5jeS1mb3Itc2NpZW5jZS10ZWNobm9sb2d5LWFuZC1yZXNlYXJjaC0yNTA1NjM3MDg4P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Information Technology - Technical Product Manager (SAP)", "company_name": "Singapore Airlines", "location": "Singapore", "via": "via Jobs | Fidanto", "description": "We’re looking for a Technical Product Manager (SAP) who will take a key role in our team.The successful candidate will join the Information Technology Division, Cloud & Platforms department and will be responsible for the following: • Set the technology roadmap and standards for our SAP platform and applications. • Responsible for setting and maintaining operational procedures, processes and controls and working with SAP Basis support. • Responsible for security, configuration, patching, review of SAP GRC SOD/SAT rules and violations and working with security/audit teams (both internal and external). • Managing licence audits with SAP audit team. • Managing inventory and re-certification of servers, software versions, system IDs, etc. • Managing admin user access/reviews, planning complex system changes. • Review system architecture design changes and new implementation. • Managing server resource utilization and costs and system performance optimization. • Run and manage various... upgrade projects to the core SAP platform and support business users with application changes/migrations. • This role is an individual contributor role. Requirements • University degree in an IT related discipline. • More than five years of experience working with SAP BASIS in multiple roles, such as team lead or manager. • Good general IT knowledge covering servers, storage, networks, browsers, printers, basic UNIX admin tasks, basic Windows OS admin tasks, etc. • Ability to manage vendors, project teams and users to ensure standards & timely delivery. • Ability to engage and lead multiple support teams to resolve incidents or issues. • Good communication and interpersonal skills, and ability to resolve conflicts", "extensions": ["25 days ago", "Full–time"], "detected_extensions": {"posted_at": "25 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJJbmZvcm1hdGlvbiBUZWNobm9sb2d5IC0gVGVjaG5pY2FsIFByb2R1Y3QgTWFuYWdlciAoU0FQKSIsImNvbXBhbnlfbmFtZSI6IlNpbmdhcG9yZSBBaXJsaW5lcyIsImNvbXBhbnlfbWlkIjoiL20vMDE1ZjJ4IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoidWFRdXVLeU50TjhQbWhIQkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZjQkNyY0JRVTVWWDA1eFZFcEtWbGd4WmxsVE9VTXdOSGR6U2tSd2FWVkxTakYyWVVnNGN6QmxVMDk0Y25CUU1IaEpRMEZvZEVobWVrTTJSRVJuZW1GdFJVdDBaVTlOTURoZk9EQldibDloZWxCWFdHTTBTVjlMVTBZdGJVRTRjQzB6TTFKVFltVjBOWGd4TURKMmJFRlNTVTloY2pCMmJVYzRWMTlXT1daUlRqaElVMDE0VlRJNVYxVnBlamsyUm5WU1gxQmtYMXBGY0hOWVozTnpWVzkyY3pKV1ptWnpRMUp6ZVdkNk5XZ3hlV05TVVdwR2IxbGplbUUwRWhjeFdIRkRXVTFQUmtKYU1tczFUbTlRWDAxRGN6WkJSUm9pUVU5TldWSjNRekphWVcxeVJ6aFVhMEkyZHpSSU9HWldkbVJvVlZSS1dYQjRVUSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzM2IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnMgfCBGaWRhbnRvIiwibGluayI6Imh0dHBzOi8vc2cuZmlkYW50by5jb20vam9icy9qb2Itb3BlbmluZy9tYXJrZXQtcmVzZWFyY2gtYW5hbHlzdHMtYW5kLW1hcmtldGluZy1zcGVjaWFsaXN0cy9pbmZvcm1hdGlvbi10ZWNobm9sb2d5LXRlY2huaWNhbC1wcm9kdWN0LW1hbmFnZXItc2FwLTI2MTM3OTI1MD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Digital Channels and Data Product Manager- Assistant Vice President", "company_name": "Citi", "location": "Singapore", "via": "via Laimoon.com", "description": "Responsibilities:\n• Commercialize Citi's Digital Channels and Data products for Singapore.\n• Successfully launch Digital capabilities and drive adoption across Singapore user base.\n• Partner closely with Global product managers, country product managers and functional partners, including Technology, Testing, Marketing, Legal, Compliance, other Product organizations, Channel Readiness, Client Operations, Activations, and Implementations to ensure buy-in on strategies and approach, and to deliver on time, high quality product offerings.\n• Conduct market and client analysis, using tools including client interviews, user feedback, customer experience monitoring and competitive intelligence.\n• Design and manage product communications including external and internal feature announcements, reference materials, press releases, and adoption campaigns, in partnership with marketing & countries.\n• Define and Measure quantitative and qualitative Key Performance Indicators to demonstrate progress... towards business objectives.\n• Management of investment prioritization in Singapore for Digital Channels and Data.\n• Work closely with compliance and legal partners to rollout new products in accordance to MAS guidelines.\n\nQualifications:\n• Total 5-7 years' experience with 3+ years' relevant product management experience, preferably with a background in enterprise products. Previous UI/UX research, API product commercialization will be ce a plus.\n• Experience working with external clients. Previous experience in Client Service operations a plus\n• Team player with ability to evidence leadership and build consensus while working within a matrix organization. Demonstrated ability to proactively solicit input and involve others in decisions and plans that affect them.\n• Excellent verbal, digital, and written communication skills. Strong presentation skills.\n• Proven experience launching products to market.\n• Experience with Design Thinking, Lean Product/UX methodologies, Agile/Scaled Agile Framework, JIRA a plus.\n• Experience in successful implementation of large, customer experience projects while managing cross functional stakeholders.\n• Excellent project manager, a self-starter with attention to detail and highly organized. Demonstrated ability to self-direct work efforts, meet deadlines, and produce consistent high-quality work.\n• Passion for the customer and their experience.\n\nEducation:\n• Bachelors/University degree or equivalent experience\n\nThis job description provides a high-level review of the types of work performed. Other job-related duties may be assigned as required.\n\nJob Family Group:\nImplementation\n\nJob Family:\nBuild Management\n\nTime Type:\nFull time\n\nCiti is an equal opportunity and affirmative action employer.\n\nQualified applicants will receive consideration without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.\n\nCitigroup Inc. and its subsidiaries (\"Citi\") invite all qualified interested applicants to apply for career opportunities. If you are a person with a disability and need a reasonable accommodation to use our search tools and/or apply for a career opportunity review Accessibility at Citi .\n\nView the \" EEO is the Law \" poster. View the EEO is the Law Supplement .\n\nView the EEO Policy Statement .\n\nView the Pay Transparency Posting Corporate Banking", "extensions": ["12 days ago", "Full–time"], "detected_extensions": {"posted_at": "12 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEaWdpdGFsIENoYW5uZWxzIGFuZCBEYXRhIFByb2R1Y3QgTWFuYWdlci0gQXNzaXN0YW50IFZpY2UgUHJlc2lkZW50IiwiY29tcGFueV9uYW1lIjoiQ2l0aSIsImNvbXBhbnlfbWlkIjoiL20vMDFkZmI2IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoieFhqb1NOeGtBc194Z3ZYQkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXN3QkNvd0JRVTVWWDA1eFUzbDVjMDF0UW5kNlRWOUJiMDEzV0MxTGFrVTRSR1pRWDFWS00wMXpVa295Wlc1VVVrZ3hSMWRhTkdwTlgzZGliV1k1UVRGeFNXVjBVMXBpZGpWc2JIQnlha1UxUW5SdU1FNDJibVZXY1RSSGJqaFlNbVkzWTFwSE9IUm1aWFZKYlRkeVlUTlRjbGx6U1VrMU5tVXdZMlpQU2t4aVNHSnZTSGREVlhaelQzVlFNVFpDTWswU0Z6RlljVU5aVFU5R1Fsb3lhelZPYjFCZlRVTnpOa0ZGR2lKQlQwMVpVbmRFUmxKcFkwSmxPVlJuWkVvMVl5MDVZV0pmY25VMldsTmZMVVpSIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNDMiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGFpbW9vbi5jb20iLCJsaW5rIjoiaHR0cHM6Ly9qb2JzLmxhaW1vb24uY29tL2pvYnMvZXh0ZXJuYWx2aWV3LzI1NjEyOTYzP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Product Marketing Manager, Branding", "company_name": "TikTok", "location": "Singapore", "via": "via Bayt.com", "description": "TikTok is the leading destination for short-form mobile video. Our mission is to inspire creativity and bring joy. TikTok is looking for a product marketing professional with background in brand marketing to work with our teams to support go-to-market strategy for our ads products. Sitting as part of the Brand team in the Product Strategy & Operations organisation, the role involves close collaboration with both in-market sales and headquarter product teams in a high growth environment. An ability to self-motivate, prioritise and influence partners are key skills. Candidates should be a team collaborator, have basic advertising experience and a keen willingness to learn. This is a full-time position based in Singapore. Responsibilities:\n- Be the product expert on features of branding advertising products; promote product operation plans focusing on revenue and performance\n- Build product expertise to investigate, triage and resolve issues with TikTok advertising solutions\n- Define... processes to support sales teams in complex investigations to improve advertiser experience on the platform\n- Monitor and analyze advertiser reports for feedback, product-related trends and quality\n- Communicate known issues to the sales team and their customers\n- Monitor, research and analyze the data of the market by industry to understand opportunities to build product adoption and go-to-market activations in-region.\n- Bachelor's degree or above.\n- 2-3 years of hands on and in-depth experience running digital video brand campaigns is a must\n- Experience in FMCG or brand-focused advertiser, agency or digital advertising preferred.\n- Experience putting together pitches, proposals, and B2B communications that bring different advertising products to life\n- Ability to build project plans and collaborate with team to ensure execution - Familiar with SEA Internet advertising, especially brand advertising - Fluency in English is a must", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9kdWN0IE1hcmtldGluZyBNYW5hZ2VyLCBCcmFuZGluZyIsImNvbXBhbnlfbmFtZSI6IlRpa1RvayIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiMTdRRmdQYkJfV181VHl2YkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCYXl0LmNvbSIsImxpbmsiOiJodHRwczovL3d3dy5iYXl0LmNvbS9lbi9zaW5nYXBvcmUvam9icy9wcm9kdWN0LW1hcmtldGluZy1tYW5hZ2VyLWJyYW5kaW5nLTU4MzQyMDMwLz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Product Manager | Regional Private Bank | Central, Singapore", "company_name": "PeopleSearch Pte Ltd", "location": "Singapore", "via": "via Singapore", "description": "Job Description You will be responsible for: Work closely with the Investment Products Team in Head Office, and be a part of a strong wealth management business franchise which services the banking needs of high net worth clients. Assist Head of Private Banking in providing strategic investment services, customized financial solutions and execution of the market trades covering bonds, equities, funds and structured products. Analyse business needs and competitors' trends, so as to issue business requirements in system enhancement projects that aim at offering a best-in-class trading platform in the market. Conduct the due diligence on new investment products and performance reviews of the existing ones in the product shelf, and be a contact person in driving the relationship with business counterparts. Assist the Head OfficeInvestment Products team to generate and distribute investment strategies, ideas and articulate investment concepts to RMs and respectively their high net worth... clients. Have an oversight on the dealing infrastructure / processes / systems for the investment products, and be responsible for all sales documentations, product agreements, and service level agreements. Liaise effectively with the respective stakeholders including the Head OfficeInvestment Products team, Technology, Operations, Compliance and Risk Management to ensure smooth operations processes. Identify changes in regional market practice and regulatory requirements to develop and improve systems, frameworks and tools Requirements University graduate with 5to 7years of product manager experience in bonds, equities, funds or structured products. Sound understanding of economics, market practices and investment products in the wealth management business. Holder of the existing CMFAS certification (e.g. M1, M2, M5, M6, and M7) is a mandatory requirement of this job. Superior communication and organization skills, with the ability to interact with senior stakeholders, with good verbal and written communication skills in English. Fluency in Chinese is advantageous, as the job requires to communicate with key stakeholders in North Asia Excellent team player with strong interpersonal and communication skills to work well with all levels of counterparts. Willingness to work under a dynamic environment, multi-tasking with tight and short assignment / project deadlines. Job Description You will be responsible for: Work closely with the Investment Products Team in Head Office, and be a part of a strong wealth management business franchise which services the banking needs of high net worth clients. Assist Experience: 0.00-50.00 Years", "extensions": ["20 days ago", "Full–time"], "detected_extensions": {"posted_at": "20 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9kdWN0IE1hbmFnZXIgfCBSZWdpb25hbCBQcml2YXRlIEJhbmsgfCBDZW50cmFsLCBTaW5nYXBvcmUiLCJjb21wYW55X25hbWUiOiJQZW9wbGVTZWFyY2ggUHRlIEx0ZCIsImNvbXBhbnlfbWlkIjoiL2cvMTFjNzNuZ24wdyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Imc2WmhXSVRCQUpUUkRPNUdBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2Y0JDcmNCUVU1VlgwNXhVVlpuYzJKMlNsUnFSbGcwVHpRMGJuSkpaMUZ4YWxKRFUxbEpUVzFGV2t4QlpXZDRNelJTWkhjeFFrMVRMVTFRVjJacVZrRlNYMmQzYTA1b2VFWm9OazlCWlVremFEVjRlbVkzWmtoTmVWTk5iVWQ1WmpObE9YcENUWEl5WlhadmFrRlhNVzVKZG1WcFFqazJMVFJuTW01dGVGZHVNMmRaTFZwMk9HbFpURkJpU0c0dFFWbHdkMWRITURkUU16TmpVVGRqUmxKdlVuTktVWFJRUldGSVRYVmxNVWxQVWxob1oySlRhMGRMU1ZwbkVoY3hXSEZEV1UxUFJrSmFNbXMxVG05UVgwMURjelpCUlJvaVFVOU5XVkozUkhKcFNXaEpWRlZEYlhBdGNsaE9iM2hDUVRSTlVqaFlUblk0WnciLCJmY3YiOiIzIiwiZmNfaWQiOiJmY181NSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBTaW5nYXBvcmUiLCJsaW5rIjoiaHR0cHM6Ly9zZy5maWRhbnRvLmNvbS9qb2JzL2pvYi1vcGVuaW5nL2luZm9ybWF0aW9uLXRlY2hub2xvZ3ktcHJvamVjdC1tYW5hZ2Vycy9wcm9kdWN0LW1hbmFnZXItcmVnaW9uYWwtcHJpdmF0ZS1iYW5rLWNlbnRyYWwtc2luZ2Fwb3JlLTI2NjU1MzAzOT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Product Manager", "company_name": "Workato", "location": "Singapore (+1 other)", "via": "via Bayt.com", "description": "Workato is the operating system for today’s fast-moving business. As a high growth company with over 6000 customers, Workato is revolutionizing the integration and automation market with investments from the top 3 SaaS companies - Salesforce, Workday, ServiceNow. Recognized as a leader by both Gartner and Forrester, it is the only AI-based platform that enables both business and IT to integrate their apps and automate workflows across their enterprise with robust security and governance. Some of the world’s top brands including Slack, Grab, Box, Visa, Broadcom run on Workato.\n\nWe are looking for an experienced Product Manager. You will be responsible for the success of a set of core product features. This role involves collaboration with multiple stakeholders, both internal and external. You will translate real-world customer challenges into problems that can be addressed by the engineering team. You will also ensure that product features and innovations are communicated effectively... to drive adoption.\n\nWorkato has a positive, diverse, and collaborative culture—we look for people who are curious, inventive, smart, hardworking, and work to be a little better every day. Workato has also been recognized amongst the “Top 47 Enterprise Startups to Bet Your Career On in 2020”, the “Hottest 13 Productivity Software Startups to Watch in 2020!”, and the “Top 15 startups helping even non-programmers build simple apps, ahead of an expected software developer shortage” by Business Insider.\n\nResponsibilities\n• Shape the product strategy and roadmap for one of more key areas\n• Understand the users, market, and competition\n• Communicate the product strategy and requirements to key stakeholders\n• Drive the product life cycle - ideation, design, prioritization, development, and delivery\n• Bring teams together to define and implement product features\n• Articulate product differentiation and value to internal and external stakeholders\n• Define key metrics and measure the performance of the product features\n\nRequirements\nQualifications and Experience\n• Bachelor's degree in a technical field (Computer Science, Engineering or a related discipline)\n• 2+ years of product management experience with SaaS products.\n• Experience in one or more of the following areas: Product management, program management, engineering, computer science.\n• Well-verse in gathering insights and identifying trends from data (customer interaction, qualitative and quantitative analysis, etc)\n• Hands-on experience building products in a fast-paced environment\n\nSkills\n• Detail oriented with superior organizational and time-management skills - balancing multiple projects, deadlines, and requests.\n• Driven with a can-do attitude and determination to succeed.\n• Strong communication skills - Ability to articulate value, simplify concepts and influence without authority\n\nWhy Workato?\n• Supportive, collaborative, international team environment that supports remote employees (currently all of us!)\n• Long-term prospects for a professional career in a high growth company\n• Flexible Work culture\n• Be part of a community-oriented organization with a history of giving back\n• Best in class technology tools to empower you to do your best work\n• Support for professional development and continuous learning\n• Wellness programs, including fitness challenges and an occasional company day off to recover from Zoom fatigue\n• Company-sponsored team-bonding activities and team celebrations\n• Employee and Customer referral bonuses\n\nAll full-time permanent employees in Singapore will also have the following benefits:\n• Workato Stock Options at one of Silicon Valley’s fastest growing startups\n• Flexible and personalised medical and wellness benefits (protection for hospitalisation and surgical procedures, clinical outpatient visits, accident coverage and more", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9kdWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJXb3JrYXRvIiwiY29tcGFueV9taWQiOiIvZy8xMWR4cHlfM3hkIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiOU9CZk5BeTc5Tk92Y01OZkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVJQkNxSUJRVTVWWDA1eFZITm9TVFZ2UVdkRmQzRXRSVEJGZFRVMU1VMXlkaTA1Y3pWME1XdzFPR3RFTjJRNGEyeEVkVmhoYkRWcVRYUjBhVkZyVm1Oc1p6WndjbVpMUzBsMk1WRmxkemxYT0dwSk5qaDBiVEpGVGtRNFRXaHFaMlJpU0cxcWQyUjZTMmRzYVUxRU9ERjNNRzltTm5wSloycGxha3Q2UkVkaWFuRkNNMFI0YzBoaVlVa3dhMGRXUlRCUlRVWTRhR0ZDVUZSVFNpMU1MVEpPTjJaelJreFJFaGN4V0hGRFdVMVBSa0phTW1zMVRtOVFYMDFEY3paQlJSb2lRVTlOV1ZKM1EwUk1XR3N5WjA1T1VERnNlV1ZCUlZGVFZtaEViMGgxZFZoVFVRIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNjMiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQmF5dC5jb20iLCJsaW5rIjoiaHR0cHM6Ly93d3cuYmF5dC5jb20vZW4vc2luZ2Fwb3JlL2pvYnMvcHJvZHVjdC1tYW5hZ2VyLTU3MTAzNTA3Lz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Manager, Underwriting", "company_name": "Aetna, a CVS Health Company", "location": "Singapore", "via": "via LinkedIn", "description": "Job Description\n\nJob Group Summary\n\nUnderwriting directly helps our company achieve financial and strategic goals. As the financial professionals who identify and calculate risk, underwriters are charged with increasing revenues, earnings and membership while protecting the company from loss.\n\nFamily Summary/Mission\n\nSupport Aetna's ability to achieve its financial and strategic goals through effective Underwriting. Underwriting primarily includes identifying, evaluating, and managing risk in order to maximize revenue, membership and earnings.\n\nPosition Summary/Mission\n\nTo directly manage the underwriting function to ensure underwriting decisions are consistent, technically sound, commercially aware and within the company’s binding authorities.\n\nFundamental Components & Physical Requirements\n• Implement all necessary processing and underwriting of AGB’s insurance within the authority agreed by insurers, including the provision of nonstandard new business quotations, renewal review and... underwriting, medical underwriting and working with the business development team to support business growth.\n• Prepare large new and renewal group quotations to underwrite profitable business for the region within company underwriting guidelines and though negotiations with Underwriters and the Underwriting Director.\n• Report underwriting issues to the Underwriting Director, assist with product reviews and conduct training on medical underwriting and underwriting principles and practices.\n• Underwrite international health insurance business within the agreed underwriting requirements to ensure the profitability of the account and to achieve a consistent loss ratio target.\n• Devise and document appropriate underwriting practices, prepare policy wordings, other documentation and technical claims mandates outlining practices.\n• Contribute to the design of new healthcare products.\n• Monitor their effectiveness and amend as necessary.\n• Co-ordinate the premium and claims bordereau production process with Finance.\n• Analyze and report on the underwriting performance of the business and make recommendations to achieve/ maintain profitability.\n• Keep up to date with changes in the law or the requirements of any regulatory body that may affect the conduct of the business. Recommend changes as necessary.\n• Monitor and report on the performance and decision making of any third-party suppliers that may affect underwriting performance.\n• Maintain an awareness of the marketplace in general and competitor activity, products, and pricing in particular.\n\nBackground Experience Desired\n• 3-5 years experience in an Underwriting management/supervisor position\n• Strong communicator with a track record in Sales/broker/client negotiations\n• Commercially aware with the ability to make balanced decisions and influence key internal stakeholders\n• Experience underwriting Group health/medical insurance, ideally with some international market exposure\n• Keen attention to detail and ability to work well under pressure\n• Detailed knowledge of health insurance pricing, rating methodologies, and risk considerations\n• Proficient with Excel, organizing, and analyzing data\n\nEducation And Certification Requirements\n\nDegree or equivalent experience.\n\nPrimary Location (City, State)\nSGP-Singapore\nAdditional Locations\nSGP-Singapore\nEEO Statement\nAetna is an Equal Opportunity, Affirmative Action Employer\nReq#\n75599BR", "extensions": ["7 days ago", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJNYW5hZ2VyLCBVbmRlcndyaXRpbmciLCJjb21wYW55X25hbWUiOiJBZXRuYSwgYSBDVlMgSGVhbHRoIENvbXBhbnkiLCJjb21wYW55X21pZCI6Ii9tLzBrZzh4IiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiLTVRSmlVVW0zS09kUEVwUkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRW93Q0Nzd0JRVTVWWDA1eFZFeE5ja1pzV1hSQ2NXUlZlV3hYU0U4NWVHNUhNM1pSYUhZMGFVZE9RWEZNUzNOdlZVSklkVEZ5UTA5ek5FVm9OMlp1U0VSbVVHMVZOMmxITjJad09VRlVTMGQxVFhCTmFGbEtMVjlFT0ZkSGFXbEpOakY1UTNaeFVVbGFVRFZ3ZUU1QlVITnhjblpVU0V4bFIzUkNXRk5uVUcxM1VsUXRWVGhXZW5sNk0yeENiRFpxT0dFeFNUUXpXVEJ5TFZSUFNWUjRTVTVSWm1Kbk4zRndTQzFvZVd0V1ptRnRZbDlWUldGME5HMXlSbFpwWDNJdFJGUmFkVU5WVW14alQyNW1ORTAwWlhWSEVoY3hXSEZEV1UxUFJrSmFNbXMxVG05UVgwMURjelpCUlJvaVFVOU5XVkozUVZaSVMwVkdiMmswZFRaMlFqVktlRU5yUTFkdGJYZDFkM2hPVVEiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY183MCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL3NnLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvbWFuYWdlci11bmRlcndyaXRpbmctYXQtYWV0bmEtYS1jdnMtaGVhbHRoLWNvbXBhbnktMjUwNTkzNzQ5MD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Management", "value": "GC18"}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Business Operations", "value": "GC06"}, {"text": "Advertising and Marketing", "value": "GC03"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Accounting and Finance", "value": "GC01"}, {"text": "Legal", "value": "GC17"}, {"text": "Farming and Outdoors", "value": "GC13"}, {"text": "Human Resources", "value": "GC15"}, {"text": "Sales and Retail", "value": "GC26"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "Product manager", "value": "product manager"}, {"text": "Manager", "value": "manager"}, {"text": "Project manager", "value": "project manager"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Development manager", "value": "development manager"}, {"text": "Director", "value": "director"}, {"text": "Manufacturing manager", "value": "manufacturing manager"}, {"text": "Marketing manager", "value": "marketing manager"}, {"text": "Plant manager", "value": "plant manager"}, {"text": "Production manager", "value": "production manager"}, {"text": "Program manager", "value": "program manager"}, {"text": "Regional", "value": "regional"}, {"text": "Senior", "value": "senior"}, {"text": "Sr. manager", "value": "sr. manager"}, {"text": "Account manager", "value": "account manager"}, {"text": "Admin manager", "value": "admin manager"}, {"text": "Affairs manager", "value": "affairs manager"}, {"text": "Assistant", "value": "assistant"}, {"text": "Brand manager", "value": "brand manager"}, {"text": "Commodity manager", "value": "commodity manager"}, {"text": "Communication", "value": "communication"}, {"text": "Customer", "value": "customer"}, {"text": "Dealer", "value": "dealer"}, {"text": "Devops engineer", "value": "devops engineer"}, {"text": "Engineering", "value": "engineering"}, {"text": "Executive", "value": "executive"}, {"text": "Product specialist", "value": "product specialist"}, {"text": "Production supervisor", "value": "production supervisor"}, {"text": "Risk manager", "value": "risk manager"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Transactional", "value": "transactional"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Internship", "value": "INTERN"}, {"text": "Part-time", "value": "PARTTIME"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Toiletries", "value": "/business/naics2007/3256"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Foods & Beverages", "value": "/business/naics2007/311"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Management", "value": "/business/naics2007/55"}, {"text": "Research", "value": "/business/naics2007/5417"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "Citi", "value": "/m/01dfb6"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "Amazon", "value": "/m/0mgkg"}, {"text": "Binance", "value": "/g/11hcz1r4wl"}, {"text": "Standard Chartered", "value": "/m/02hszk"}, {"text": "United Overseas Bank", "value": "/m/04gjd1"}, {"text": "Apple", "value": "/m/0k8z"}, {"text": "Tata Communications", "value": "/m/04338k"}, {"text": "Workato", "value": "/g/11dxpy_3xd"}, {"text": "BNY  Mellon", "value": "/m/02vps5x"}, {"text": "DBS Bank", "value": "/m/01q7n5"}, {"text": "EPAM Systems", "value": "/m/0dlnrc"}, {"text": "GVT Government Technology Agency (GovTech)", "value": "/g/11gh0528nq"}, {"text": "Grab", "value": "/m/0134c_p9"}, {"text": "Paypal", "value": "/g/122s91_5"}, {"text": "PeopleSearch Pte Ltd", "value": "/g/11c73ngn0w"}, {"text": "Randstad", "value": "/m/08pt1z"}, {"text": "Singapore Airlines", "value": "/m/015f2x"}, {"text": "TEKsystems (Allegis Group Singapore Pte Ltd)", "value": "/g/11b6g4bkv0"}, {"text": "ABBOTT LABORATORIES (SINGAPORE ) PRIVATE LIMITED", "value": "/m/09m57z3"}, {"text": "ADVANCE INTELLIGENCE PTE. LTD.", "value": "/g/11dymfkxss"}, {"text": "AXA", "value": "/m/04mn99"}, {"text": "Adecco Personnel Pte Ltd", "value": "/m/08gz46"}, {"text": "Adidas Group", "value": "/m/01jtml"}, {"text": "Aetna, a CVS Health Company", "value": "/m/0kg8x"}, {"text": "Agency for Science, Technology and Research", "value": "/m/0gmjcg"}, {"text": "Alibaba", "value": "/m/07s6ctl"}, {"text": "Argyll Scott", "value": "/g/11dxpk2374"}, {"text": "Autodesk", "value": "/m/018nm3"}, {"text": "Barry Callebaut", "value": "/m/03clky2"}, {"text": "BioMind", "value": "/g/11dymfr2l6"}, {"text": "CHUBB ASIA PACIFIC PTE. LTD.", "value": "/m/09m8xyh"}, {"text": "Cargobase", "value": "/g/11dxppfsjn"}, {"text": "Cargobase Pte Ltd", "value": "/g/11fy240nxm"}, {"text": "DKSH", "value": "/m/0dj2nh"}, {"text": "Dathena", "value": "/g/11dxprdn6y"}, {"text": "Dyson", "value": "/m/05cskg"}, {"text": "Enggsol Pte Ltd", "value": "/g/11g9mnfmm1"}, {"text": "Ethos BeathChapman", "value": "/g/11c73z0xm0"}, {"text": "Eu Yan Sang", "value": "/m/03cl9hn"}, {"text": "Flintex Consulting Pte. Ltd.", "value": "/g/11h1z41pzb"}, {"text": "GIVAUDAN SINGAPORE PTE LTD", "value": "/g/11f00wn519"}, {"text": "Goldman Sachs", "value": "/m/01xdn1"}, {"text": "GovTech Singapore", "value": "/g/11dxpkfs_6"}]}]}