{"search_metadata": {"id": "60827956a3f4ef496a7058cc", "status": "Success", "json_endpoint": "https://serpapi.com/searches/e9e31971bc6ec651/60827956a3f4ef496a7058cc.json", "created_at": "2021-04-23 07:37:58 UTC", "processed_at": "2021-04-23 07:37:58 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28data+scientist%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=40", "raw_html_file": "https://serpapi.com/searches/e9e31971bc6ec651/60827956a3f4ef496a7058cc.html", "total_time_taken": 0.89}, "search_parameters": {"q": "(data scientist) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "40"}, "jobs_results": [{"title": "Data Engineer (Data Analytics)", "company_name": "SMRT Corporation Ltd", "location": "Singapore (+1 other)", "via": "via NodeFlair", "description": "We are looking for an experienced data engineer to join our rapidly growing data team. You will be joining the team at an early stage of data warehouse developmment and your contributions will influence key design choices for the data warehouse. The role will require you to work with data owners to build data ingestion pipelines, construct data models for the warehouse and to maintain the operational stability of processes created. You will also work with data end users to expose data as required by decision support tools. Overall, you will strive for excellence by aligning the data systems created with business goals presented.\n\nResponsibilities\nThe duties and responsbilities are listed below. The list is not comprehensive and related duties and responsbilities may be assigned from time to time.\n• Understand the data landscape to formulate and complete end-to-end data strategy that includes data gathering, data processing, analysis, ongoing scaled deliverables, and presentations to... faciitate decision-making and forward planning\n• Identify opportunities for data acquisition, work with system owners to automate data connection\n• Analyse and organize raw data, combine raw information from different sources, build data systems and data pipelines, perform extract transform and load (ETL) to prepare data for prescriptive and predictive modeling\n• Build algorithms and prototypes, explore ways to enhance data quality and reliability\n• Develop analytical tools and programs\n• Collaborate with data scientists and data users on several projects\n\nQualifications & Work Experience\n• Tertiary qualificaion with experience in data engineering or in a similar role\n• Experience in enterprise scale data management and/or integration\n• Hands-on experience working with Azure Data Factory & SQL Server Integration Service with SAP, IBM or Microsoft SssA and/or PaaS data sources\n• Data engineering certification is a plus\n• Experience in building a data system front-end is a plus\n\nSkills\nTechnical skills include:\n• Strong analytical skills with the ability to collect, clean, organize, analyse and disseminate significant amounts of information with attention to details and accuracy\n• Ability to understand and explain complex data and effective working as a liaison between technical and non-technical groups\n• Technical expertise with data models, data mining, and segmentation techniques\n• Hands-on experience with SQL database design\n• Advanced knowledge of SQL is required and familiarity with other languages (C#,/.NET, Python, Java, JavaScript) is a plus\n• Great numerical and analytical skills, experience with data visualization tools such as Power BI, Tableau, Qliksense, etc., would be an advantage\n\nGeneric skills include:\n• Detail-oriented, with excellent organizational skills and experience\n• Critical thinker and problem-solving skills\n• Team player\n• Good time management skills\n• Great interpersonal and communication skills", "extensions": ["1 month ago", "Full–time"], "detected_extensions": {"posted_at": "1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEYXRhIEVuZ2luZWVyIChEYXRhIEFuYWx5dGljcykiLCJjb21wYW55X25hbWUiOiJTTVJUIENvcnBvcmF0aW9uIEx0ZCIsImNvbXBhbnlfbWlkIjoiL20vMDJnaGJqIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiSTF0VzYxRVVoWVNmRlNWOUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZZQkNyY0JRVTVWWDA1eFVsVndNMmRGV0VjNFFrOVhWbkF4VDFvNVIwRjVTMGhwU25JNFZVeHdNRGc0TVZaYWJXMTVOMkk1Tm1kNVYydFVOWEkyY1V0Q2EwbDBUMFJtVlhGWFdHcGZTVWQ0YkY5aVNXMVZhVWg2UjFOc05UUlBlbkJGYkZoRVUxOVlRekJTUjA5cU5UWlNOM1YzVUZkTmRFWkpURFF0VlZSV0xXUnlkRWxwUkhoQk1XY3pkRlk0VmxCWFZUZGtZMEpXU0doWFNURnpZamd5YkhZeU1VZElha0Y0VFhGbGNsVXRXa0o2Ulc5ZlFrdGxVSEZaRWhaV2JtMURXVTh0VkV4T1MwWjBVV0Z3YTJGRWQwRm5HaUpCVDAxWlVuZERhSE4wWmxGb2NIVlhkamd0UVZocWMwVlFjM1pXTkY5UlJWOW4iLCJmY3YiOiIzIiwiZmNfaWQiOiJmY183IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE5vZGVGbGFpciIsImxpbmsiOiJodHRwczovL3d3dy5ub2RlZmxhaXIuY29tL2pvYnMvbGlzdGluZ3MvOTg2Nj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "SVP, Principal Data Scientist", "company_name": "GIC Private Limited", "location": "Singapore (+1 other)", "via": "via Laimoon.com", "description": "Internal Audit Department\n\nInternal Audit Department (IAD) has been tasked with the mandate to foster a strong governance and control environment in GIC. IAD provides an independent assessment of GIC's governance, risk management and internal control environment to key stakeholders including the Board of Directors and senior management. IAD acts as a trusted business partner working closely with the GIC group of companies and investment holding entities to bring about positive changes to the control environment and culture and thereby support senior management decision making.\n\nWe are looking for a suitable candidate to join the Audit team, where the key roles and responsibilities include:\n\nResponsibilities\n• Effectively lead and inspire a team of data scientists to achieve IAD's tactical and strategic objectives\n• Implement IAD's data-driven strategy by working closely across functional teams, and effectively translating business requirements into actual deliverables\n• Develop... strategic objectives by identifying opportunities to provide stronger assurance, advisory and anticipatory risk sensing capabilities\n• As a technical and data science Subject Matter Expert (SME), design and detail appropriate analytical or Machine Learning approaches to different business problems\n• Drive and upskill machine learning and analytics capabilities\n• Implement and oversee multiple analytics/machine learning projects, and deploy analytics/machine learning engines into production.\n• Critically review the work performed by junior team members and mentor junior data scientists.\n• Collaborate with Front, Middle, and Back Office business functions, as well as the extended Technology team in GIC on advanced analytics projects\n• Plan and design the end to end analytics/machine learning pipeline, such as data infrastructure, modelling pipeline and case management tool.\n• Keep abreast of market trends in machine learning and audit analytics and recommend appropriate adoption of best practices into GIC\n\nRequirements\n• Master's or PhD in Information Technology, Mathematics, Computer Science or equivalent is preferred\n• At least 10 years' of relevant experience in machine learning techniques, data analytics and design\n• A leader who can motivate and drive excellence within -the team\n• Hands-on experience designing and implementing data science projects, and also providing strong technical guidance and coaching to junior data scientists\n• Strong analytical and organization skills, with the ability to collect, organise, analyse, and disseminate significant amounts of information with attention to detail and accuracy\n• Strong collaboration skills, able to partner and work effectively across teams and with business stakeholders\n• Good communication skills, able to articulate technical concepts and drive discussions\n• Must be competent in Python. Familiar with open sourced platforms and libraries such as Sckit-learn, Spark, Hadoop, Airflow, Pytorch, Tensorflow, Docker, Git\n• Familiar with machine learning and NLP techniques, in analysing a variety of datasets, including large heterogeneous data, and unstructured data.\nAccounting & Finance", "extensions": ["5 days ago", "Full–time"], "detected_extensions": {"posted_at": "5 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTVlAsIFByaW5jaXBhbCBEYXRhIFNjaWVudGlzdCIsImNvbXBhbnlfbmFtZSI6IkdJQyBQcml2YXRlIExpbWl0ZWQiLCJjb21wYW55X21pZCI6Ii9nLzExbXBqMTVweHciLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJoSGZidlczSVRuSnhWUFhoQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdllCQ3JjQlFVNVZYMDV4VWpCTVVtdFZhRzl3TVRSUFRFMTFNa0o0VTNsTWQzVktSRmhhV1c1a1RuZE9NbU5qYnpKb2FGcHBkMnhyVEdOcWEyMVdWR1ZSVWs0MWVrVk9Na3haTTFkM056RnJZM2h6ZFhGSVR6TTVhakJUVW5BNVdURlZhbUk0ZVVzd1JFeHJPSGxOZERJelpEUkpXbE5uT1RGeU5WTkRYMWxMUWtWQ2RGaDJOSGxPT0MxbFNWVnJVVzVUUW5WeVJYUndXRkZ1VlVwdWJXUm5TSE50ZFcxNVNpMXZNMGw2YWtwaWFtVm1ibkpoTVhGUmJraFZFaFpXYm0xRFdVOHRWRXhPUzBaMFVXRndhMkZFZDBGbkdpSkJUMDFaVW5kRGQxUmFUa3B0VnpGQmRtRndRMjk2WlhkdVdEZFpSVlJ1YkdsUiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzE0IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExhaW1vb24uY29tIiwibGluayI6Imh0dHBzOi8vam9icy5sYWltb29uLmNvbS9qb2JzL2V4dGVybmFsdmlldy8yNjAxMzY0Nz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior Data Scientist - Singapore", "company_name": "seppic", "location": "Singapore", "via": "via LinkedIn", "description": "Company Presentation\n\nALBS is an Air Liquide entity in Kuala Lumpur, regrouping for the APAC scope its Business Service Centers (Kuala Lumpur and Shanghai) as well as the two Global Functions (IT, Digital and Procurement).\n\nDesigned to derive optimal value by better leveraging technology, people and competencies, the ultimate goal is to boost efficiency and deliver outstanding and sustainable performance while keeping a strong focus on customer centricity.\n\nThis Organization is striving for excellence, adopting the Best in Class models to deliver value through simplification and standardization of processes, while adhering to Internal controls and compliance requirements.\n\nEntity And Activity Description\n\nSenior Data Scientist oversees the activities of the junior data scientists and provides advanced expertise on statistical and mathematical concepts for the broader Data and Analytics department. The Senior Data Scientist applies and inspires the adoption of advanced data science and... analytics across the business.\n\nTo lead data science projects for the APAC digital team, integrate into the Air Liquide Data Science community and enrich this area of the Digital business.\n\nMissions And Responsibilities\n\nWe are looking for a Senior Data Scientist who will support our business with insights gained from analyzing company data. The ideal candidate is adept at using large data sets to find opportunities for business optimization and using models to test the effectiveness of different courses of action. They must have strong experience using a variety of data mining/data analysis methods, using a variety of data tools, building and implementing models, using/creating algorithms and creating/running simulations. They must have a proven ability to drive business results with their data-based insights. They must be comfortable working with a wide range of stakeholders and functional teams. The right candidate will have a passion for discovering solutions hidden in large data sets and working with stakeholders to improve business outcomes.\n\nCompetencies and Profile\n• MSc or BSc graduate in Statistics, Mathematics or Computer Science\n• 5 - 7 years of relevant work experience in data science field\n• Strong problem solving skills with an emphasis on product development.\n• Experience using statistical computer languages (R, Python, SLQ, etc.) to manipulate data and draw insights from large data sets.\n• Experience working with and creating data architectures.\n• Knowledge of a variety of machine learning techniques (clustering, decision tree learning, artificial neural networks, etc.) and their real-world advantages/drawbacks.\n• Knowledge of advanced statistical techniques and concepts (regression, properties of distributions, statistical tests and proper usage, etc.) and experience with applications.\n• Excellent written and verbal communication skills for coordinating across teams.\n• A drive to learn and master new technologies and techniques.\n• Experience visualizing/presenting data for stakeholders.\n• Ability to work as part of a distributed team.\n• Ability to utilize and lead interns on projects.\n• Specific Training or Certification; Data Science, R or Python", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgRGF0YSBTY2llbnRpc3QgLSBTaW5nYXBvcmUiLCJjb21wYW55X25hbWUiOiJzZXBwaWMiLCJjb21wYW55X21pZCI6Ii9tLzBnNTU4d3ciLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJ0ajhhTHN3djRDMmFzLWxMQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFc3NCQ293QlFVNVZYMDV4VVRGNk9VOXFUM05sUkhBME9WOUtTSFpvVjFSWE1GVjVjV2MyUTNsb1dXZENkRWt0Y25oeWQwZExSRkpXYm1SelVrRXRNMmRLVEhKUlVYWjJaSFZGZEZkRldqY3dVVk5uZW5aSGMzWllUekZPVUVacFZ6TmtRVkUxV1V4TFZUWjFlWFZHWVRkU1pUZE9PRWhFTWxaNllWUnVUbkpHVkhkUFJuY3lNVXRmYVdSNmMwUm9NVm9TRmxadWJVTlpUeTFVVEU1TFJuUlJZWEJyWVVSM1FXY2FJa0ZQVFZsU2QwUmxTVVY0UWxsTVlYSjBURWR0UkZWSlZFUktRbWt5ZUd0cFQyYyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzIxIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExpbmtlZEluIiwibGluayI6Imh0dHBzOi8vc2cubGlua2VkaW4uY29tL2pvYnMvdmlldy9zZW5pb3ItZGF0YS1zY2llbnRpc3Qtc2luZ2Fwb3JlLWF0LXNlcHBpYy0yNDkxODQ4NzkxP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Research Associate (Data Science) (R00004700)", "company_name": "NANYANG TECHNOLOGICAL UNIVERSITY", "location": "Singapore (+1 other)", "via": "via Job Vacancies In Singapore", "description": "Air Traffic Management Research Institute invites applications for the position of Research Associate to be part of a research team to study and develop the Resilience Airspace Concept of Operations.< div>Key Responsibilities:< strong>< div>\n• Work on subprojects of a larger CONOPS study< li>\n• Develop a plan< li>\n• Conduct experiments using simulators< li>\n• Analyse data< li>\n• Find insights hypotheses< li>\n• Vsualise data< li>\n• Liaise with the sponsor< li>\n• Deliver project reports on a timely basis< li>< ul>Job Requirement< strong>< div>\n• Master's degree in Data Science, Human Machine Interface or relevant fields< li>\n• 3-year production experience with spatial and temporal data and 5-year production experience in Python (these may be proven via portfolios or GitHub user page or similar)< li>\n• Experience in managing own project plans, designing of experiments, delivering a research or development product to clients< li>\n• Advantageous computing skills include Machine Learning... Big Data (distributed computing), relational databases, XML, cartography, and Linux< li>\n• Experience in rapidly learning new subject domain matters is advantageous< li>\n• Proficiency in English< li>< ul>We regret that only shortlisted candidates will be notified.< div>< div>< div", "extensions": ["2 days ago", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJSZXNlYXJjaCBBc3NvY2lhdGUgKERhdGEgU2NpZW5jZSkgKFIwMDAwNDcwMCkiLCJjb21wYW55X25hbWUiOiJOQU5ZQU5HIFRFQ0hOT0xPR0lDQUwgVU5JVkVSU0lUWSIsImNvbXBhbnlfbWlkIjoiL20vMGw0OWsiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJHOTJaaE5CVDUzOGpfQmdGQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFcUVDQ3VJQlFVNVZYMDV4VWxoMWVtdE9hMUJLWm5JeU1uUlBYMTlwZURCbmRUTkxUWGxJYkZOU1VIcEdhRVprTXpsV1ZHTmtOa05PVTNScGNteE5UR0ZoVFVWMVpWRTJaVFoxUlV4SlFYZEtXRjlNZFRKV1VtMXdhRTU2YzNadU1IVnRaalZ6TWpOelkwOU5kRU0wT0ROR2VDMXJNVUV0VkZsWVdYTkxWRTVSWVU5WVZHZGhkV290YW1Gc2RuVnVaSGN0UTFnMVZsTmpXRTUzYWtkd1pGTjFZVkpPUTI5dkxUbFpZM2RpWTJGc1NqbFZXVE5tY2pWVmFqSmlOMUpZT1Zoek9IaHVSSGh4VGs5eFFtSnNSazQxUVhoMFZsWjZZa00wU2poS2FYZGliRkV5Um1JelVSSVdWbTV0UTFsUExWUk1Ua3RHZEZGaGNHdGhSSGRCWnhvaVFVOU5XVkozUVhGcmFVTXhMVTVEUzFWemMxWnJWVUl3Wld4cVFqRlpWWFpWUVEiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18yOSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2IgVmFjYW5jaWVzIEluIFNpbmdhcG9yZSIsImxpbmsiOiJodHRwczovL2pvYmVrYS5zZy9qb2JzLzQ1ODY3L05hbnlhbmctVGVjaG5vbG9naWNhbC1Vbml2ZXJzaXR5LVJlc2VhcmNoLUFzc29jaWF0ZS1EYXRhLVNjaWVuY2UtUjAwMDA0NzAwLTIwMjEtMDQtMjE/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Jooble - Data Engineer - 1 to 5y experience", "company_name": "None", "location": "Singapore", "via": "via Jooble", "description": "U-Reg ( is a Fintech certified by the Singapore Fintech Association (SFA). We are looking for a Data Engineer to join our growing team of technical experts. The Data Engineer will support our software developers and will ensure optimal data delivery architecture is consistent throughout ongoing projects. She / he will be responsible for identifying the required infrastructure along with designing, developing, coding and supporting various data pipelines. The Data Engineer will be working closely with Data Scientist(s) to productionize various statistical and Machine Learning models using data pipelines, including deployment and scaling. She / he will also be responsible for defining and creating API for serving prediction. The right candidate will be excited by the prospect of optimizing our company's data architecture to support our next generation of products.\n\nResponsibilities for Data Engineer\n\n· Create and maintain optimal data pipeline architecture,\n\n· Assemble large, complex... data sets that meet functional business requirements.\n\n· Identify, design, and implement internal process improvements: automating manual processes, optimizing data delivery, re-designing infrastructure for greater scalability, etc.\n\n· Build analytics tools that utilize the data pipeline to provide actionable insights.\n\n· Work with stakeholders including the Executive, Product, Data and Design teams to assist with data-related technical issues and support their data infrastructure needs.\n\n· Create data tools for analytics and data scientist team members that assist them in building and optimizing our product into an innovative industry leader.\n\nQualifications for Data Engineer\n\n· Advanced working knowledge and experience working with relational databases.\n\n· Experience building and optimizing 'big data' data pipelines, architectures and data sets.\n\n· Strong analytic skills related to working with unstructured datasets.\n\n· Build processes supporting data transformation, data structures, metadata, dependency and workload management.\n\n· Strong organizational skills.\n\n· We are looking for a candidate with 1 to 5 years of experience , who has attained a Masters degree in Computer Science, Information Systems or another quantitative field", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJKb29ibGUgLSBEYXRhIEVuZ2luZWVyIC0gMSB0byA1eSBleHBlcmllbmNlIiwiY29tcGFueV9uYW1lIjoiTm9uZSIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiSkszRVRKcWFiWXpCWVZvc0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb29ibGUiLCJsaW5rIjoiaHR0cHM6Ly9zZy5qb29ibGUub3JnL2pkcC8tOTEzMjkwNzMzNjYzOTY4OTUyMS9EYXRhLUVuZ2luZWVyLSstMS10by01eS1leHBlcmllbmNlLVNpbmdhcG9yZT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Data Scientist - IIT - Business Analytical Unit", "company_name": "Temasek Polytechnic", "location": "Singapore (+1 other)", "via": "via Monster", "description": "Responsibilities\n• Research and devise appropriate statistical models for data analysis\n• Collaborate with internal and external stakeholders to understand analytic needs and devise possible solutions\n• Identify relevant structured and unstructured data sources to mine for meaningful insights that enhance efficiency, reliability, and performance across the organisation\n• Devise and utilise algorithms and models to mine big data stores, perform data and error analysis to improve models, and clean and validate data for uniformity and accuracy\n• Apply data mining techniques, perform statistical analysis and build prototypes to provide insights\n• Create machine learning-based tools or processes e.g. recommendation engine(s), and constant tracking of performance through A/B testing, and predictive capabilities\n• Communicate analytic solutions to stakeholders and implement improvements as needed to operational systems\n\nPrerequisites\n• Degree in Computer Science, Economics Statistics... Applied Mathematics or at least 4-5 years experience in a similar discipline\n• Strong knowledge in data visualisation tools like Tableau and data analysis processing tools like R / Python / SAS\n• Experience in building machine learning models using real-time data pipelines\n• Experience in data engineering, including SQL and manipulating structured and unstructured data sources\n• Experience in computing tools such as Hadoop\n• Strong analytical, communication and presentation skills to communicate analysis in a clear, precise and actionable manner", "extensions": ["21 days ago", "Full–time"], "detected_extensions": {"posted_at": "21 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEYXRhIFNjaWVudGlzdCAtIElJVCAtIEJ1c2luZXNzIEFuYWx5dGljYWwgVW5pdCIsImNvbXBhbnlfbmFtZSI6IlRlbWFzZWsgUG9seXRlY2huaWMiLCJjb21wYW55X21pZCI6Ii9tLzA5OHM3MyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IlBBdmx4enZFMWRjZHZaZXFBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2WUJDcmNCUVU1VlgwNXhVMlZmTVV4b1NURXdSSFp3Y2xWbk55MWxTM293Vm1SSFJEUnpUbkl6VEd0cFZucGxTV3gzYjFsMlRqWXhMVmR3UnpOMGNreGFRbE5pVmtsUlJreDVlVzFKUjBGNk4wcFFWR0pJYnpKblJFTk1kRWhOVUVKSFpFVmZjV280TFZoeE4zRTBRV2t6ZFVOT1FrTmFTSGxaVVZOell6aFhYMVZ1TTBzeVJqaHZjbGhDYTBoR1VqaHliM2h3TWpabVdIQXRMVWRPVXpoVVVHcE1jSGxoVkUxZk4wdG9NemR5TTBsT09XZERhVWxET0doTkVoWldibTFEV1U4dFZFeE9TMFowVVdGd2EyRkVkMEZuR2lKQlQwMVpVbmRCTUhoTlFXbDNNR2xZWWxKa1pqSnlTMVV3ZGw5TlgwNVlUbUYzIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNDEiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTW9uc3RlciIsImxpbmsiOiJodHRwczovL3d3dy5tb25zdGVyLmNvbS5zZy9qb2IvZGF0YS1zY2llbnRpc3QtaWl0LWJ1c2luZXNzLWFuYWx5dGljYWwtdW5pdC10ZW1hc2VrLXBvbHl0ZWNobmljLXNpbmdhcG9yZS0yOTI3NTU2P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Project Manager - Data Analytics", "company_name": "Michael Page", "location": "Singapore (+1 other)", "via": "via Jobilize", "description": "• Great Working Environment\n• Excellent Salary Package\n\nAbout Our Client\n\nOur client is a leading technology solutions provider with strong presence in Singapore. They are looking to hire a Project Manager- Data Analytics.\n\nAs a Project Manager- Data Analytics, you will be responsible for the following:\n• Planning and implementing the data analytics strategy for the clients and working with project managers to implement them.\n• Working with customers and providing solutions on the on-going projects.\n• Leading teams and providing technical guidance to deliver work in agile environment.\n• Managing the overall resources and budgets for the projects.\n• Driving the overall performance and making sure all SLA's are achieved.\n\nThe Successful Applicant\n\nAs a successful candidate you will have a bachelor's degree in Computer Science or equivalent with at least 8 years of experience in managing end to end data analytics projects. You will have experience in leading analytics consulting team and... has experience in managing data governance or advance analytics projects. You will also have understanding in Data management & Storage, data visualization and data science tools. PMP or CITPM certification will be good to have.\n\nWhat's on Offer\n• Great Working Environment\n• Excellent Salary Package", "extensions": ["8 days ago", "Full–time"], "detected_extensions": {"posted_at": "8 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIgLSBEYXRhIEFuYWx5dGljcyIsImNvbXBhbnlfbmFtZSI6Ik1pY2hhZWwgUGFnZSIsImNvbXBhbnlfbWlkIjoiL20vMDRjeGxkdyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IkNZV0Jkd1dsUndKTDIzek1BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhVakkwTjNwRlRYUnhVbmwyVjI5R1V6VTROMWQzYkZwWlZYVm9iVnBXVWpBNWNEVm5SV0Z1UTBacGNEWkVZVk5UYWtwbFJEQTBVVmw1ZFcxV2NrWk9RazB6Y1ZkM1NVTTFjRWQ2VFdOTlFVUktWR05JYms5d1h6VmxVSFJMWm5OV2FtdHFhVWt0WkY4ek5FUmhObnBEU0ZWeVdtUnFaMUZIYzNKcE1uWlNNV0pUU0ZJeWMyVlhZME5MZFZCaWMxbDNlbDl2UmpodmVESkRVblpSRWhaV2JtMURXVTh0VkV4T1MwWjBVV0Z3YTJGRWQwRm5HaUpCVDAxWlVuZENYMlpLUkcxbk4wTmZhRkpSWjFNdFdGWTJka0p3ZUVnNFdUWkIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY180OSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JpbGl6ZSIsImxpbmsiOiJodHRwczovL3d3dy5qb2JpbGl6ZS5jb20vYW1wL2pvYi9wcm9qZWN0LW1hbmFnZXItZGF0YS1hbmFseXRpY3Mtc2luZ2Fwb3JlLW1pY2hhZWwtcGFnZS1oaXJpbmctbm93LWpvYj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Data Scientist (Artificial Intelligence Platforms)", "company_name": "Government Technology Agency", "location": "Singapore (+1 other)", "via": "via Neuvoo", "description": "The Government Technology Agency (GovTech) aims to transform the delivery of Government digital services by taking an outside-in\" view, putting citizens and businesses at the heart of everything we do. We also develop the Smart Nation infrastructure and applications, and facilitate collaboration with citizens and businesses to co-develop technologies.\n\nJoin us as we support Singapore’s vision of building a Smart Nation - a nation of possibilities empowered through info-communications technology and related engineering.\n\nWho we are\nGovTech's Data Science and Artificial Intelligence (DSAI) division uses technology and data to help deliver high-quality digital services to citizens and businesses in Singapore. We build software products for government agencies to better understand and use their data to improve operations and decision making.\n\nWhat the role is\nData scientists in GovTech help crack challenging problems through the use of machine learning and other computational methods on... government data. You would have the opportunity to work across domains like citizen engagement, healthcare, transport and operations.\n\nAs a data scientist, you will:\n\n· Improve public service delivery and policy by extracting insights from government data\n\n· Work closely with product managers, data scientists and engineers to develop, test and deploy new data products\n\n· Write production-quality code and work with engineers to put models into operation\n\n· Learn new things and impart knowledge with other team members in a multi-disciplinary team\n\nAdditionally, more senior data scientists will be expected to:\n\n· Establish best practices\n\n· Share your expertise and mentor other data scientists\n\n· Help with recruiting.\n\nYou are not just here to write code, but also to figure out what we should be building and how we should build it.\n\nWhat it is like working here\nWe build products that serve a variety of agency users, who use them to solve highly meaningful problems pertinent to our society, from transportation, to education, to healthcare. The public sector is full of opportunities where even the simplest software can have a big impact on people’s lives. We are here to improve how we live as a society through what we can offer as a government.\n\n· Rapid Prototyping - Instead of spending too much time debating ideas we prefer testing them. This identifies potential problems quickly, and more importantly, conveys what is possible to others easily.\n\n· Reliable Productization - To scale an idea, a prototype or a Minimum Viable Product to a software product, we scrutinize and commit to its usability, reliability, scalability and maintainability.\n\n· Ownership - In addition to technical responsibilities, this means having ideas on how things should be done and taking responsibility for seeing them through. Building something that you believe in is the best way to build something good.\n\n· Continuous Learning - Working on new ideas often means not fully understanding what you are working on. Taking time to learn new architectures, frameworks, technologies, and even languages is not just encouraged but essential.\n\nWhat we are looking for\nWe work mostly in Python, JavaScript and Scala. However, we do not require experience in any specific programming language or technology. Proficiency in at least one language and the ability to learn is what matters to us.\n\nWe look for people who:\n\n· Have experience working with data and machine learning to solve problems\n\n· Have a demonstrated ability to build software\n\n· Can write code to solve abstract problems\n\n· Can talk and reason about code with other engineers\n\n· Take the initiative to make things happen\n\n· Want to work for the public good.\n\n", "extensions": ["15 days ago", "Full–time"], "detected_extensions": {"posted_at": "15 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEYXRhIFNjaWVudGlzdCAoQXJ0aWZpY2lhbCBJbnRlbGxpZ2VuY2UgUGxhdGZvcm1zKSIsImNvbXBhbnlfbmFtZSI6IkdvdmVybm1lbnQgVGVjaG5vbG9neSBBZ2VuY3kiLCJjb21wYW55X21pZCI6Ii9nLzExZ2gwNTI4bnEiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiI0NVNUYjV6M2h0NzNhUnN4QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFb3NDQ3N3QlFVNVZYMDV4VkZSaldscGxhM015YkdOdmRWQXhjMjVrUVd4Wk4wdEVOWEZ4TTJsSWNrNWpURXBoU1ZVMFgzUkpVbE4yV1doV01VczJTMGROYTJFMmVVNDFWMnBXWjFKd2NGTTVWV2w1YVdGQ1ExVTFNaTEyWTE5NlpWVjJSazlHTW01SGVFNTRMV1JhVkdOUFYydG5XazkzUWxGd09FcEhaVVl0Ym05M1l5MTNUM2MyYUVNeWQyVnBhMDVYYzNoRVEwdGpZV3hSZGpoWVFrTjFXbU5VV1ZGeGFHRjZZWGM0UmtReFlXVmtYMFo1UWxKSGNIUnNWWFZ5WkhSS2VrMVViblZZU3preWRsbElORWxvRWhaV2JtMURXVTh0VkV4T1MwWjBVV0Z3YTJGRWQwRm5HaUpCVDAxWlVuZERRbmhCWkZCaVIyYzNiVUpDTFdkTFdHOUVOWEEyU0ZwT05UaFIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY181NiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBOZXV2b28iLCJsaW5rIjoiaHR0cHM6Ly9zZy5uZXV2b28uY29tL3ZpZXcvP2lkPWViNzZjOGVhMWIxMVx1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "AI/ML - Annotation Analyst- Thai Language Specialist", "company_name": "Apple", "location": "Singapore", "via": "via LinkedIn", "description": "Summary\n\nImagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. The people here at Apple donʼt just craft products - they build the kind of wonder thatʼs revolutionized entire industries. Itʼs the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it.\n\nAre you interested in being part of a team that continues to innovate the way people and machines interact? The launch of Siri was a defining moment in the history of Artificial Intelligence. Siri offers a faster, easier way to get things done on your Apple devices, even before you ask. Millions of people now use Siri to send a message, play their favorite song or even take a selfie. The Siri team is passionate about technology with a focus on enriching the Siri... customer experience. We are looking for motivated Annotation Analysts that demonstrate active listening, integrity and acute attention to detail. Bring passion and dedication to your job and there's no telling what you could accomplish.\n\nThis position will be based at the Apple corporate campus at Ang Mo Kio.\n\nKey Qualifications\n\nFluency in Thai reading, writing, and comprehension skills\n\nFluency in English reading, writing and comprehension skills\n\nExcellent active listening skills with the ability to understand verbal nuances in the Thai language\n\nHighly organized with strong attention to detail\n\nUnderstanding of the APAC region and cultural variations where the Thai language is spoken\n\nDemonstrates attention to detail and critical thinking skills in evaluation of Siri’s language usage and dialect\n\nAbility to independently navigate systems and tools\n\nDemonstrates integrity and focuses on customer privacy\n\nExperience in content review or a similar environment, prior testing experience preferred\n\nDemonstrates flexibility and adaptability to changing work-flows and responsibilities\n\nGrows with a team where expertise is shared and feedback is welcomed\n\nExcels at working independently to make timely decisions and take appropriate actions\n\nExperience as an end user of Siri, similar Intelligent Personal Assistants, or other AI\n\nSuccessfully meets or exceeds targets, working within tight deadlines\n\nAbility to identify business process solutions that increase efficiencies\n\nAbility to maintain focus and aim for high results through large volumes of tasks\n\nDescription\n\nOur team is comprised of very talented individuals, who are passionate about AI/ML and ensuring Apple services are at their best. As part of the Annotation Team you'll play a central role in enhancing the user experience. We work in a fast paced, dynamic, technology focused environment. As an Annotation Analyst, you'll listen and transcribe audio files and evaluate Siri’s response and language usage, from customers who have opted in to the grading program. You'll use your language and cultural knowledge, along with analytical skills, to evaluate responses against guidelines. Your flexibility and the ability to prioritize tasks is essential. We focus on the user experience, thinking creatively on how customers use Siri and use this knowledge for improvements.\n\nBecause we believe our individual backgrounds, perspectives, and passions help us build the ideas that move all of us forward. We'll train you to be an expert in understanding, supporting and improving the customer experience. This position comes with competitive pay, great benefits, eligibility to participate in our company stock plan, time off, and employee discount.\n\nEducation & Experience\n\nBachelors degree or equivalent work experience preferred\n\nAdditional Requirements\n\nAbility to work Monday- Friday from 8:00am-5:00pm or 9:00am-6:00pm local time; with scheduling and work flexibility based on business needs\n\nPositions with language skills require strong grammar and cultural awareness\n\nSuccessful completion of a pre-employment assessment and background check\n\nSuccessful completion of initial training and certification testing\n\nRole Number: 200198824", "extensions": ["2 days ago", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBSS9NTCAtIEFubm90YXRpb24gQW5hbHlzdC0gVGhhaSBMYW5ndWFnZSBTcGVjaWFsaXN0IiwiY29tcGFueV9uYW1lIjoiQXBwbGUiLCJjb21wYW55X21pZCI6Ii9tLzBrOHoiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJ4SlZaSmVwTFlRLUxDZENMQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFc3NCQ293QlFVNVZYMDV4VVhoNE5uTmhUekJqTlRkc1dqUmFVV2R4YXpsUWNrSk9XVk5yUmxSRVJVWlBSRFpSV1hoNVgySllXSEU1TFVST1kxSm9Tek5LYWtwRk5raHlSbDlhUmpVemEwMXpWVFZuWmxCNmVXeG5ia0ZXVG0xUGJGUndUMFEwYlZFM1duQmxWazVWT1V3eFdXTlhWMDFQZHpOdlJqRlRRVmxPYm10M1FUVndUVU5vUXpWTWJ6RjBZWE1TRmxadWJVTlpUeTFVVEU1TFJuUlJZWEJyWVVSM1FXY2FJa0ZQVFZsU2QwSjNVa2s1WDBodmN6SkdSa1ZIUlhWeWNHZFZOUzE2VlRCYU9IYyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzY0IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExpbmtlZEluIiwibGluayI6Imh0dHBzOi8vc2cubGlua2VkaW4uY29tL2pvYnMvdmlldy9haS1tbC1hbm5vdGF0aW9uLWFuYWx5c3QtdGhhaS1sYW5ndWFnZS1zcGVjaWFsaXN0LWF0LWFwcGxlLTI0OTUwNDE2NDM/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Data Scientist - Chatbot", "company_name": "Shopee", "location": "Singapore (+1 other)", "via": "via Karkidi", "description": "Job Description:\n\nWe are currently looking for Data Science candidates specialized in Natural Language Processing / Deep Learning to solve a variety of practical challenges in building chatbot. You will work with a friendly and professional team of experts to build end-to-end products that bring value to our business. Including:\n• Building customer service chatbot for solving the user's problem. You will explore variety methods to solving use's problems, such as QA chatbot, task chatbot, KBQA, or machine reading comprehension;\n• Building the guidance chatbot to help sellers to promote sales;\n• Prediction whether the user have met problems when using our product and what is the problem;\n• Updating and upgrading the knowledge base of chatbot.\n\nResponsibilities:\n\nYou will need to analyse problems, design solutions, deploy solutions as inference APIs / pipelines, maintain solutions and improve models.\n\nYou will have technical discussions with teammates and tech lead to get more help with... technical challenges and to share your findings with others. You will also share your project updates, timeline estimation and resource requirements with the Product Manager to ensure on-time deliverables.\n\nRequirements:\n• Master, or PhD in Computer Science / Computer Engineering or other relevant fields.\n• Two years working experience with a programming language such as Python, Golang.\n• At least one year working experience in Natural Language Processing / Deep Learning related fields.\n• Basic Natural Language Processing techniques, such as Tokenization, Name Entity Recognition, and Text Classification, etc;\n• Familiar with one the NLP tools-suit is preferred, such as spaCy, nltk, and Stanford NLP tools;\n• Familiar with the stat-of-the-art deep models such as BERT, GTP and beyond;\n• Experience in some of the following domains: language model / text classification / text clustering / summarization generation / intent prediction.\n• Familiar with machine translation / knowledge graph / reinforcement learning is a bonus.\n• Proficient in Python. Experience in Golang / Scala is a bonus.\n• Proficient in TensorFlow. Experience in PyTorch, MxNet is a bonus.\n• Familiar with the data analyzing tools such as pandas;\n• Experience in using Elastic search and Kibana is a bonus;\n• Experience in real-time data processing (such as Flink) is a bonus;\n• Experience in TensorFlowServing, MxNet Model Server or TensorRT Inference Server is a bonus.\n• Experience in building machine learning pipelines is a bonus", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEYXRhIFNjaWVudGlzdCAtIENoYXRib3QiLCJjb21wYW55X25hbWUiOiJTaG9wZWUiLCJjb21wYW55X21pZCI6Ii9nLzExZ2gzZmszNHIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJmdHlwY1QzZldxRnRXa3pOQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VkhNMWRVTllSRmhMZHpaclRIUnZNWEo2YkVkb05XNTZSMlpCZGpkRGMyaEhWQzExVW1FelFqbEpabVpKTnpkNFVqaHhNa2RDWWtKdWNWWnlUR1YxWW5NNFpWZFNSa1JZWmtSVmMwUlFXak5OZVdGQ1RrbGplbE16UTA5eE0yWTBXbVZIVlhvek1tVkJWR040WkU1VmRUWlhjMkpyTFZCUGF6WlhZemRXYURKQ2RucHBSR2x1TVVFeVNYWkZSa1JqVjBWRFJuZE5jbXhPZVROM0VoWldibTFEV1U4dFZFeE9TMFowVVdGd2EyRkVkMEZuR2lKQlQwMVpVbmRFUTBOVU5rWmlSR2RSUTBrM1VYZzRZV05MYVc0MGVIYzRNMDkzIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNzIiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gS2Fya2lkaSIsImxpbmsiOiJodHRwczovL3d3dy5rYXJraWRpLmNvbS9qb2ItZGV0YWlscy8xMTkzP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}], "chips": [{"type": "Title", "param": "job_family_1", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Data scientist", "value": "data scientist"}, {"text": "Learning engineer", "value": "learning engineer"}, {"text": "Research associate", "value": "research associate"}, {"text": "Data science", "value": "data science"}, {"text": "Data engineer", "value": "data engineer"}, {"text": "Scientist", "value": "scientist"}, {"text": "Trainer", "value": "trainer"}, {"text": "Associate", "value": "associate"}, {"text": "Data analyst", "value": "data analyst"}, {"text": "Engineer", "value": "engineer"}, {"text": "Officer", "value": "officer"}, {"text": "Project manager", "value": "project manager"}, {"text": "Project officer", "value": "project officer"}, {"text": "Senior", "value": "senior"}, {"text": "Audit", "value": "audit"}, {"text": "Consultant", "value": "consultant"}, {"text": "Consulting", "value": "consulting"}, {"text": "Customer", "value": "customer"}, {"text": "Deputy director", "value": "deputy director"}, {"text": "Lecturer", "value": "lecturer"}, {"text": "Operations engineer", "value": "operations engineer"}, {"text": "Owner", "value": "owner"}, {"text": "Research engineer", "value": "research engineer"}, {"text": "Research scientist", "value": "research scientist"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Specialist", "value": "specialist"}, {"text": "Technical architect", "value": "technical architect"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Internship", "value": "INTERN"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Mining", "value": "/business/naics2007/21"}, {"text": "Research", "value": "/business/naics2007/5417"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Staffing", "value": "/business/naics2007/5613"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "Nanyang Technological University", "value": "/m/0l49k"}, {"text": "Shopee", "value": "/g/11gh3fk34r"}, {"text": "DBS Bank Ltd", "value": "/m/01q7n5"}, {"text": "Michael Page", "value": "/m/04cxldw"}, {"text": "Micron", "value": "/m/02gdqy"}, {"text": "Air Liquide", "value": "/m/079tgb"}, {"text": "Apple", "value": "/m/0k8z"}, {"text": "ByteDance", "value": "/g/11ghnfr0sv"}, {"text": "CTES Consulting Pte Ltd", "value": "/g/11jrn4m1xc"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "SEPPIC", "value": "/m/0g558ww"}, {"text": "Standard Chartered", "value": "/m/02hszk"}, {"text": "United Overseas Bank", "value": "/m/04gjd1"}, {"text": "AIR LIQUIDE INDUSTRIAL SERVICES PTE LTD", "value": "/g/11hg55y1rb"}, {"text": "Acronis", "value": "/m/04pjlt"}, {"text": "BIGTAPP PTE. LTD.", "value": "/g/11dxpsg5nn"}, {"text": "Burpple", "value": "/g/11dxps5yv5"}, {"text": "Covance by Labcorp", "value": "/m/03ll59"}, {"text": "DHL", "value": "/m/021086"}, {"text": "DUN & BRADSTREET (SINGAPORE) PTE. LTD.", "value": "/g/11g9mpp2ph"}, {"text": "Dathena Science", "value": "/g/11dxprdn6y"}, {"text": "EasyMile", "value": "/g/11bwh58jhs"}, {"text": "Engine Biosciences Pte. Ltd.", "value": "/g/11gxm8pr96"}, {"text": "Experis Singapore", "value": "/g/11dxpnwm3s"}, {"text": "FieldBox.ai", "value": "/g/1ptyw89vr"}, {"text": "GIC Private Limited", "value": "/g/11mpj15pxw"}, {"text": "Government Technology Agency", "value": "/g/11gh0528nq"}, {"text": "Health Sciences Authority", "value": "/m/0h7fhh"}, {"text": "Hewlett Packard Enterprise (HPE)", "value": "/g/11b804x9ty"}, {"text": "Infineon Technologies", "value": "/m/02jzkj"}, {"text": "Infinite Computer Solutions Pte Ltd", "value": "/g/11g9mj72yz"}, {"text": "Institute Of Technical Education (ITE)", "value": "/m/05_02p"}, {"text": "KPMG Singapore", "value": "/g/11dxpsb9nr"}, {"text": "Lazada", "value": "/g/1q5bfkdqp"}, {"text": "Ministry of Defence Singapore", "value": "/m/0566dt"}, {"text": "Ngee Ann Polytechnic", "value": "/m/05451y"}, {"text": "Republic Polytechnic", "value": "/m/06jgzw"}]}]}