{"search_metadata": {"id": "60827b17ad7fa902e6db0b34", "status": "Success", "json_endpoint": "https://serpapi.com/searches/d63fd511afbf5aa4/60827b17ad7fa902e6db0b34.json", "created_at": "2021-04-23 07:45:27 UTC", "processed_at": "2021-04-23 07:45:27 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28programmer%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=170", "raw_html_file": "https://serpapi.com/searches/d63fd511afbf5aa4/60827b17ad7fa902e6db0b34.html", "total_time_taken": 2.76}, "search_parameters": {"q": "(programmer) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "170"}, "jobs_results": [{"title": "Software Engineer for UST, Singapore", "company_name": "UST", "location": "Singapore (+1 other)", "via": "via NodeFlair", "description": "UST is a leading provider of platforms, digital innovation, artificial Intelligence and end-to-end IT services and solutions for Global 1000 companies. We have more than 25,000 employees based in more than 20 countries.\n\nLooking for an experienced Site Reliability Engineer to be a part of world class software engineering team.\n• At least 6 years of developmental experience in ASP .NET, MVC. Hands on expertise in .NET CORE is needed\n• 2+ years of experience in Azure PAAS is a must.\n• Good Hands-on experience in SQL DB\n• Experienced in Power shell scripting\n• Experienced in CI/CD creating pipelines and automated deployments. Should be well versed with DevOps practices.\n• Microsoft certified Azure certifications (preferred).\n• Strong communication and presentation skills to provide new feature demos to project stakeholders.", "extensions": ["2 days ago", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciBmb3IgVVNULCBTaW5nYXBvcmUiLCJjb21wYW55X25hbWUiOiJVU1QiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjQ0aGxQOVhvbGdnb3BuTWtBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTm9kZUZsYWlyIiwibGluayI6Imh0dHBzOi8vd3d3Lm5vZGVmbGFpci5jb20vam9icy9saXN0aW5ncy8xMjkyOT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Programmer (.net)", "company_name": "Adecco GS", "location": "Singapore", "via": "via WhatJobs", "description": "Involved in the design, development, programming, implementation and maintenance of large scale web-based and general application systems\n\nOur client is Singapore's renowned brand.\n\nWORKS SPECIFICATIONS\n\nSCOPE OF WORK\n\n(a) The overall scope of the works expected from the from the Contract Programmer shall include the following:-\n\ni. Gather user requirements and prepare specifications and other relevant documentation according to the documentation standard required and etc;\n\nii. Design, develop, implement and maintain web-based and other applications;\n\niii. Perform project administrative duties, including disseminating project information to project stakeholders and monitoring the progress of project milestones;\n\niv. Trouble-shoot, diagnose and rectify reported application problems while at the same time, resolving the related diagnosed application problems within a satisfactory time period;\n\nv. Conduct End User briefings and training entailing the use of the software applications when... required;\n\nvi. Assist in rolling out new projects/applications or enhancements of existing systems/applications; and\n\nvii. Arrange logistics for meetings, conferences, trainings, and other project-related events. Organise project committee meetings and prepare the necessary materials, including reports, presentations, agendas and other meeting collateral. Transcribe and accurately record key decisions and action items resulting from meetings.\n\n(b) The personnel to be provided must have at least 5 years of working experience in the design, development, programming, implementation and maintenance of large scale web-based and general application systems. They should preferably hold a certification in Microsoft Certified Application Developer (MCAD) and Sun Certified Java Programmer (if possible).\n\n(c) The personnel must have working knowledge and experience in the following environment :-\n\ni. Development Languages/Tools\n\nVB.NET, C#.NET, Visual Basic 6 (At least 5 years)\n\nOO Analysis and Design (At least 2 years)\n\nii. Internet Technologies\n\nASP.NET\n\nHTML, Java Script, AJAX\n\nMS SharePoint Online\n\nMS PowerApp\n\nMS PowerAutomate\n\niii. Database and Others\n\nMS SQL Server 2008 (At least 5 years)\n\nMS SQL Server 2016\n\nMS Visual Studio 2008 (At least 5 years)\n\nMS Visual Studio 2017\n\n.NET Framework 3.5 (At least 5 years)\n\n.NET Framework 4.5\n\nIIS, SSL\n\nWindows 2003 or above / Windows XP", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9ncmFtbWVyICgubmV0KSIsImNvbXBhbnlfbmFtZSI6IkFkZWNjbyBHUyIsImNvbXBhbnlfbWlkIjoiL20vMDhnejQ2IiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoidlpZeDVCWEtmdGJMVnJyMUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVJQkNxSUJRVTVWWDA1eFVWVmlVMFZyUzNWMWNYaENWMlZuWVhJelRFVktVRUkxWDJ0NGQwZHlRbDluTlRjNFpYazFabkUwY1VsWVVXSjBVR2N0WVVRNVgyaHpVMU0wYlc1bWREWm1hak5xZEdGWmQwVnNibUpFVjFkYU9IUlFTSEpXUjFkdFkwMW9SbnBLZEZCd1psTTFXbEJRUWw5TldIRkhha3h0U2pkeGJrNWtSWGRqYkVabVVXVk5aRWhuUkdOS1gyWkxVWEJMTlZWYWFXTnFaVU50TUZSc05FcFJFaGRIU0hWRFdWQmlNMGN0TW5GM1ltdFFhMDVEWm1sQmN4b2lRVTlOV1ZKM1JEWXlZbTl6U1hKalIweG9URWxxU0hGd2JqZ3pibVowWkVoUVVRIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMTEiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gV2hhdEpvYnMiLCJsaW5rIjoiaHR0cHM6Ly9lbi1zZy53aGF0am9icy5jb20vam9iLWZvci1Qcm9ncmFtbWVyLW5ldC1pbi1TRy1jb29wMTc1ODU1Nzk/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Software Engineer - Sys design​/Kubernets​/AKS​/MS Azure​/AWS - Jurong", "company_name": "OakTree Consulting", "location": "Singapore", "via": "via Learn4Good", "description": "Job Description\n\nResponsibilities Design, develop, test, deploy, maintain and improve backend/platform applications System-to-system Integration development using API, messaging and related technologies. Unit test development and peer review in a Scrum team Full stack developer will be an added advantage. Assist architect/team lead on application design, database schema design and integration design Assist development team on integration and security test design. And develop test drivers/simulators or stub required Assist PO/BA on user stories refinement.\n\nAssist QA/Tester on test automation and bug fixes. Assist DevOps on build and release automation. Prepare interface specifications and other design documentations.\n\nRequirements\n\nExperience with backend system design and development. Experience development using Kubernetes, AKS, Istio/Envoy, Spring, Java/JEE, RESTful API, messaging (AMQP, MQTT & related technologies), or postgresql/mysql/MSSQL/RDS/Azure\n\nDB.\n\nExperience with... development on Microsoft Azure, and/or AWS will be an advantage Minimum 3 years experience\n\nAble to express design using UML notation and derive tasks backlog in SCRUM. A fast learner, have a proactive attitude and an eye for quality works A team player - inclusive mindset to collaborate effectively in a diverse team Familiarity with developing efficient queries and designing schemas for relational databases A team player - inclusive mindset to collaborate effectively in a diverse team Plus points as added advantage for senior post or team lead:\n\nExperience with development on a public cloud, e.g. Microsoft Azure, AWS Experience in developing platform level features, such as configuration management, service discovery and routing, feature switch, A/B testing, etc.\n\nExperience with clustering, stateless/stateful, transactions and system integration designs principles\n\nExperience with ESB and API Management\n\nExperience with security hardening and understanding of security CIA and AAA\n\nExperience with LDAP/Active Directory and SSO integration Familiarity with Spring Framework\n\nExperience with Maven, Nexus or Artifactory\n\nExperience with Git or Subversion\n\nExperience with Docker\n\nExperience with CI/CD systems, such as Bamboo, Jenkins Scrum certified, and with experience in a Scrum project Office Location :\n\nJurong East, May require to station at Punggol site, if necessary Kindly submit resumes in MS Word format to with the following details:\n\n- Position applying for Current remuneration Expected remuneration Notice period Reason for Leaving Person-in-charge :\n\nQuek Hong Guek, Margaret Oaktree Consulting\n\nEA License No : 06C4642EA Reg No : R1981137 We regret that only shortlisted candidates will be notified", "extensions": ["1 day ago", "Contractor"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Contractor"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciAtIFN5cyBkZXNpZ27igIsvS3ViZXJuZXRz4oCLL0FLU+KAiy9NUyBBenVyZeKAiy9BV1MgLSBKdXJvbmciLCJjb21wYW55X25hbWUiOiJPYWtUcmVlIENvbnN1bHRpbmciLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6InBZbWdMZm5Wa3cxbWlmTWNBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGVhcm40R29vZCIsImxpbmsiOiJodHRwczovL3d3dy5sZWFybjRnb29kLmNvbS9qb2JzL3NpbmdhcG9yZS9zb2Z0d2FyZV9kZXZlbG9wbWVudC8yNzEzMTgzMzgvZS8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Software Engineer - TikTok Ads", "company_name": "TikTok", "location": "Singapore", "via": "via Bayt.com", "description": "TikTok is the leading destination for short-form mobile video. Our mission is to inspire creativity and bring joy. TikTok has global offices including Los Angeles, New York, London, Paris, Berlin, Dubai, Mumbai, Singapore, Jakarta, Seoul and Tokyo. TikTok is one of the fastest growing apps in the world, and we're looking for Software Engineers to join our App Monetization team. The Ads Infra team uses state-of-the-art ads delivery architectures and cutting-edge machine learning algorithms to optimize every impression on TikTok's platform for both our users and advertisers. What You'll Do 1. Build delivery services for TikTok Ads, including ads targeting, indexing, recall, click and convert prediction, bidding, auction, mixed ranking of ads and organic results, etc.\n2. Build deep learning solutions for TikTok ads ranking, including building training examples, realtime online training, deep models inference, model based retrieval, etc.\n3. Build service frameworks with highest... performance and availability.\n4. Build globalized ads system across multiple data centers worldwide.\n1. Bachelor's degree or above, majoring in Computer Science, or related fields.\n2. Experience programming in at least one of the following programming languages: C, C++, Java or Golang.\n3. Effective communication skills and a sense of ownership and drive. Preferred Qualifications 1. Experienced in at least one area of the following areas: Ads delivery, personalized recommendations, search engine, machine learning, distributed storage system, big data frameworks", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciAtIFRpa1RvayBBZHMiLCJjb21wYW55X25hbWUiOiJUaWtUb2siLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IldValZIZ09BZHV1RXhJazVBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQmF5dC5jb20iLCJsaW5rIjoiaHR0cHM6Ly93d3cuYmF5dC5jb20vZW4vc2luZ2Fwb3JlL2pvYnMvc29mdHdhcmUtZW5naW5lZXItdGlrdG9rLWFkcy01ODE4MTEzNi8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Lead Software Engineer, IT - Channels (POS GI) (20000267)", "company_name": "The Great Eastern Life Assurance Co Ltd", "location": "Singapore (+1 other)", "via": "via Jobs", "description": "Lead Software Engineer, IT - Channels (POS GI) (20000267) The Great Eastern Life Assurance Co Ltd Posted on 5-Apr-21 Lead Software Engineer, IT - Channels (POS GI) (20000267) The Great Eastern Life Assurance Co Ltd Job DescriptionJob Purpose Responsible for building and maintain Java applications, include managing Java/Java EE application development while providing expertise in the full software development lifecycle, from concept and design to testing.Commitment to collaborative problem solving, translate business function/ requirement into technical design and product quality are essential. The Job Contribute in all phases of the development lifecycle. Developing high-volume, low-latency applications and delivering high-availability and performance. Translate application design and use cases into functional applications. Design, build, and maintain efficient, reusable, and reliable application coding. Identify bottlenecks and bugs, and propose solutions to these problems. Prepare... and produce releases of software components. Takes accountability in considering business and regulatory compliance risks and takes appropriate steps to mitigate the risks. Maintains awareness of industry trends on regulatory compliance, emerging threats and technologies in order to understand the risk and better safeguard the company. Highlights any potential concerns /risks and proactively shares best risk management practices. Our Requirements Proficient in Java, with a good knowledge of its ecosystems. Solid understanding of object-oriented programming. Familiar with various design and architectural patterns. Skill for writing reusable Java libraries. Knowledge of concurrency patterns in Java. Familiarity with concepts of MVC, JDBC, and RESTful services. Familiar and experienced with SQL, especially Oracle PL-SQL, packages and stored procedures. Experienced in Spring Framework, Hibernate (ORM), and Jasper report will be an added advantage. Implementing automated testing platforms and unit tests. Basic understanding of JVM, its limitations, weaknesses, and workarounds. Analyze and perform evaluation on defect raised by user to further advice. Provide support for SIT/ UAT. Ability to work in a fast paced, team-oriented environment with minimum direction and management oversight. Recognized University degree in relevant discipline. Preferable tertiary qualification in IT and insurance industry certified (eg. LOMA). Minimum 8 years’ experience in application developer position. Preferably with GENERAL insurance domain knowledge. Experienced in RESTful web-service, automation testing and performance tuning will be an added advantage High level of integrity, takes accountability of work and good attitude over teamwork. Takes initiative to improve current state of things and adaptable to embrace new changes. To all recruitment agencies: Great Eastern does not accept unsolicited agency resumes. Please do not forward resumes to our email or our employees. We will not be responsible for any fees related to unsolicited resumes. Additional Information Senior Executive Qualification Bachelor's Degree, Post Graduate Diploma, Professional Degree Founded in 1908, Great Eastern is a market leader and a well-established trusted brand in Singapore and Malaysia. With S$82.5 billion in assets and over 4 million policyholders, the Group also operates in Indonesia and Brunei and has a presence in China as well as a representative office in Myanmar. The Great Eastern Life Assurance Company Limited and Great Eastern General Limited have been assigned the financial strength and counterparty credit ratings of \"AA-\" by Standard and Poor's since 2010, one of the highest among Asian life insurance companies. We are a LIFE company and our purpose is to empower generations to live healthier and better so that they can live life to the fullest. Be it celebrating life’s simple moments or commemorating life’s major milestones, every day, in many ways, we inspire those around us to live great and celebrate life", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJMZWFkIFNvZnR3YXJlIEVuZ2luZWVyLCBJVCAtIENoYW5uZWxzIChQT1MgR0kpICgyMDAwMDI2NykiLCJjb21wYW55X25hbWUiOiJUaGUgR3JlYXQgRWFzdGVybiBMaWZlIEFzc3VyYW5jZSBDbyBMdGQiLCJjb21wYW55X21pZCI6Ii9tLzAycW5mcDciLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiIyOGJJNlB6ZUo0UnZMMXMxQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFcmNDQ3ZjQlFVNVZYMDV4VTJSTU5FNTVaRzFZWDJwYWVGZHNaRGsxZEdkeVRYRkpjMjAyUkc5V05WZExSR2t4UkVacFFrNXNZbGRWUldaNVUxcEdjV2RhY0dSTFRITm1PRVkyUjJoeGRFTmFaWE5yT0hrd1VsOXZkVk5JYWxwM1YyNTNUSGxrU210VlJUSTVVMVl6ZVRkamNFMVlSbXBzYTFkellqUjRiVUowWlRsVlh6aERVRzh4WDBGbGRrbHJObVk0ZG05alJuTnRhRzl2ZUdkWlprUXdlRzk0UlhSck0yOTVkWE5LTW1ZNU0zQlVaR2x1U1dneGFYWk5abEkzUkhoVllWSkZSMWRzTlZWVlJHcHpaR3hHV2xKak5HdE5OMWhXYm1WbGFuQnBkMlpuY0dReU5tWlphMWhWTmtwcU4xZ3pUR1o2ZGpGM09EbERheElYUjBoMVExbFFZak5ITFRKeGQySnJVR3RPUTJacFFYTWFJa0ZQVFZsU2QwRnJXbVZ6VEd4aGF6UmxaemRSZURoV1NUQlpObFkwVGxSNVZWRSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzI3IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnMiLCJsaW5rIjoiaHR0cHM6Ly9zZy5maWRhbnRvLmNvbS9qb2JzL2pvYi1vcGVuaW5nL3NvZnR3YXJlLWRldmVsb3BlcnMtYXBwbGljYXRpb25zL2xlYWQtc29mdHdhcmUtZW5naW5lZXItaXQtY2hhbm5lbHMtcG9zLWdpLTIwMDAwMjY3LTI3NTUxNTg5MD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Salesforce Developer", "company_name": "Technopals Pte. Ltd.", "location": "Singapore (+1 other)", "via": "via Monster", "description": "1. RESPONSIBILITIES\n\n· Determine business, functional and technical requirements; and participate in application design, configuration, testing and deployment.\n\n· Perform configuration and customization of the Salesforce.com platform.\n\n· Participate in efforts to develop and execute testing, training and documentation.\n\n· Produce tangible deliverables such as requirement specifications, design deliverables, status reports, project plans for project and change initiatives.\n\n· Utilize best practices to perform operational support, enhancements, and bug fixes as needed to the Salesforce.com platform.\n\n· Follow all standard operating procedures and maintain updated ticketing for events, incidents, requests, changes, problem, etc.\n\n· Proactively engage on continuous improvement efforts for application design, support and practice development efforts.\n\n· Provide technical assistance and end-user troubleshooting for bug fixes, enhancements, and how-to assistance.\n\n· Act as a point of... escalation for Service Desk and NOC ticketing for advanced issue resolution.\n\nJOB REQUIREMENTS\n\nAcademic Education & Experience\n\n· Degree in Computer Science, Software Engineering or equivalent.\n\n· At least 3 years of working experience as a Salesforce Developer.\n\n· Experience in vendor, service, stakeholders and people management.\n\n· Experience in agile software development and support mid to large scale Salesforce projects.\n\n· Direct working experience on Salesforce platforms on CRM and Digital Marketing projects.\n\n· Knowledge and experience with complex business systems integration as well as object-oriented design patterns and development.\n\n· Experience with Agile development methodologies such as XP/SCRUM.\n\nSkills and knowledge\n\n· Expertise in core web technolocies including HTML5, Javascript and jQuery.\n\n· Software engineering skills with Force.com platform (Apex, VisualForce, SOQL, Unit Testing)\n\n· Software engineering skills with Java SE & EE (Java, JSF, SQL) preferred.\n\n· Knowledge of relational databases, data modelling, and ETL tools.\n\n· Have a good problem-solving skill that is able analyze issues from multiple perspectives and derive pragmatic and comprehensive solutions to problems in sometimes an ambiguous environment.\n\n· Team player who can communicate effectively, to bring forth the ideas, plans and strategies to other stakeholders in order forge common goals and concretize deliverables.\n\n· Able to work highly independently and good project management skills.\n\n· Desire to work within a fast-paced, collaborative, and team-based support environment.\n\n​", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTYWxlc2ZvcmNlIERldmVsb3BlciIsImNvbXBhbnlfbmFtZSI6IlRlY2hub3BhbHMgUHRlLiBMdGQuIiwiY29tcGFueV9taWQiOiIvZy8xMWR4cHZreW5wIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoidkd2SG1OT3dHcm9GRC1QMkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZjQkNyY0JRVTVWWDA1eFUwaHdRVzFVVDBKVGRXaE1UM0JXYzBWWFZtaG9SRUY1YTJOaVRrdFFSeTFrUlVJd1lYaGZaWFp1Tmt0UmNVTk5SMDlwTkZwdVYySnRaUzEzVTBWd1dVRlFjREl4YUZCUWVub3hSRFJaWTBSa2VVbDNPWGxsVW5kaUxVNWFVbVpzZVRGWlVVNTNjVk4wYVhjMlEzaHZhVVYzVFRscGVFRmxPSFJRWkdkdmJtSlJlbnBhTlRkb1dYSlhlVzVWVmpCSVdYWkRRa2xxWlVSTlVWQlJkMDA1YjFReVpXb3hYelZhUVV4RWEyRmlVamx6RWhkSFNIVkRXVkJpTTBjdE1uRjNZbXRRYTA1RFptbEJjeG9pUVU5TldWSjNSRXR1YTFKVkxXOVlVVmt3TTBsRllucGhhMWxUY0VGa1NFNVlRUSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzM0IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1vbnN0ZXIiLCJsaW5rIjoiaHR0cHM6Ly93d3cubW9uc3Rlci5jb20uc2cvYW1wL2pvYi12YWNhbmN5LXNhbGVzZm9yY2UtZGV2ZWxvcGVyLXRlY2hub3BhbHMtcHRlLWx0ZC1zaW5nYXBvcmUtMjc0MjY4NTUuaHRtbD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Pega Developer #SGUnited", "company_name": "YM GLOBAL TECHNOLOGIES PTE. LTD.", "location": "Singapore (+1 other)", "via": "via LinkedIn", "description": "We are looking for a strong PEGA Developers with CSA certification. Idle candidate must have a first class degree in Information Technology, good Pega implementation knowledge, hands on experience and open to work on Pega Implementation / Development or support projects.\n\nMust Have\n• Pega CSA certification\n• Atleast 3 years IT experience with minimum 2 years Pega development experience\n• Strong communication and analytical skills\n• Able to work independently in gathering requirements from users, designing, implementing, maintaining application systems and project management\n• Familiar with Java, web services like SOAP 1.2, WSDL 2.0 and XML 1.0.\n• Good experience in an IT Application Support/Maintenance or Development environment\n• Strong analytical and communication skills\n• Candidate having Banking domain will have an advantage", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQZWdhIERldmVsb3BlciAjU0dVbml0ZWQiLCJjb21wYW55X25hbWUiOiJZTSBHTE9CQUwgVEVDSE5PTE9HSUVTIFBURS4gTFRELiIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiUUFzaERUT2J0RVNIWnl0a0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL3NnLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvcGVnYS1kZXZlbG9wZXItJTIzc2d1bml0ZWQtYXQteW0tZ2xvYmFsLXRlY2hub2xvZ2llcy1wdGUtbHRkLTI0OTUyNjU5MDI/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Digital Developer (.Net)", "company_name": "halcyonknights", "location": "Singapore", "via": "via Glassdoor", "description": "Position Description – Digital Developer\n\nDivision: Digital\n\nDepartment: Omnichannel Experience\n\nUnit: Nil\n\nReports to: Head of Omnichannel Experience\n\nDirect reports: Nil\n\nOrganisation and Culture\n\nLGIAsuper is one of Australia’s longest-running and most trusted superannuation funds, having served Queensland communities for over 50 years. When we started in 1965 we had 10,000 Queensland local government employees as members. Today, we help members from all industries across Australia with market-leading, capital-protected investment products, as well as insurance and advice.\n\nOur Values\n\nTo help us deliver exceptional retirement outcomes and member service, we are guided by the following three values in all interactions and decision-making.\n• Trusted\nWe use intelligent investment, growth and continuous improvement strategies that provide long-term material benefits to members.\n• Reliable\n\nAll strategies, decisions and services revolve around a commitment to provide exceptional and... consistent member service.\n• Understanding\nWe take the time to genuinely listen to our members and our employees to understand their needs.\n\nThe Role\n\nAn exciting opportunity has arisen for a suitably experienced Digital Developer to be responsible for the development of .NET web and API applications across a range of member facing assets.\n\nAs a part of an Agile team, the role spans across a broad range of web and software development tasks, including analysis, writing user stories and acceptance criteria, estimation, web and .NET development, design, testing and support, and works closely with other technology teams to ensure solutions are delivered to the highest coding and security standards.\n\nThis is a full-time permanent opportunity, based in the Brisbane CBD with some remote working options available.\n\nKey Responsibilities\n• develop digital solutions to deliver a seamless member experience across multiple digital platforms\n• work as part of an Agile software development team, performing development and analysis activities, such as writing user stories, acceptance criteria, performing testing, and maintaining specialised website content\n• actively participate in Agile delivery processes, including planning and estimating\n• identify emerging trends and innovations that can be adopted to benefit members and employers\n• provide third-level support for digital services and maintain an ongoing knowledge base to assist with efficient issue resolution\n\nPersonal Attributes\n\nThe Digital Developer will have and enjoy the following personal attributes:\n• Commercial Orientation – focused on understanding member or customer needs and delivering solutions to directly or indirectly grow and retain members and Funds Under Management\n• Acting with Integrity – being open, self-reflective and trusted by employees and members alike; role-modelling and championing a positive and collaborative culture.\n• Self-Management – seeing problems as opportunities; have a high level of initiative; be goal oriented; and take accountability of your work outputs and actions\n• Goal Oriented – seek to understand and personally contribute to the mission and future direction of LGIAsuper; translate the organisational strategy into practical initiatives and solutions; be creative and innovative in achieving the goals of the organisation.\n• Collaborative – enjoy being mentored and mentoring others; being a team player; empower others through both formal and informal channels; seek views and expertise from across the business.\n\nRequirements\n• As the ideal candidate, you are experienced in working in similar development and analysis roles for digital solutions, you have sound back-end development skills including ASP.Net, C#, MVC, Web Services and in front-end development skills such as HTML 5, CSS 3, JQuery, React, Bootstrap.\n• You can demonstrate your understanding and experience with integration technologies including REST APIs, SOAP and MQ, and have sound experience in Continuous Integration and Delivery with tools including TeamCity and Octopus Deploy.\n• Your proven ability in working with business stakeholders to analyse and document requirements, along with your experience with writing user stories and acceptance criteria, working in Agile environments will put you in good stead for this role.\n• Your experience working in the financial services industry in developing within a CMS platform (Sitecore preferred, Certification a bonus) is highly regarded, as is a tertiary degree in IT / Systems or Agile certification\n\nOrganisational Compliance\n\nYou will:\n• have or develop sound operational knowledge of legislative, regulatory and Code of Conduct requirements including (but not limited to) Privacy Act, Industry Codes of Practice, EFT, AML/CTF, Occupational Health & Safety, Complaint Handling and Dispute Resolution\n• develop a sound knowledge of LGIAsuper policies, procedures, products, services and systems to comply within the authorities and restrictions in relation to the duties of this position\n• ensure adherence to correct identification procedures and confidentiality of information that conform to the requirements of LGIAsuper and the Privacy Act when accessing member details\n• pass an Australian Federal Police check and a bankruptcy check as part of being appointed and have regular checks as a part of your ongoing employment", "extensions": ["14 days ago", "Full–time"], "detected_extensions": {"posted_at": "14 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEaWdpdGFsIERldmVsb3BlciAoLk5ldCkiLCJjb21wYW55X25hbWUiOiJoYWxjeW9ua25pZ2h0cyIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiaW0tZHI5YWw3RU9IZ2ZCNEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBHbGFzc2Rvb3IiLCJsaW5rIjoiaHR0cHM6Ly93d3cuZ2xhc3Nkb29yLnNnL2pvYi1saXN0aW5nL2RpZ2l0YWwtZGV2ZWxvcGVyLW5ldC1oYWxjeW9ua25pZ2h0cy1KVl9JQzMyMzU5MjFfS08wLDIxX0tFMjIsMzYuaHRtP2psPTM3MjA1MjI1ODJcdTAwMjZ1dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Software Developer (Javascript) (BB-F8F61)", "company_name": "SnapHunt Pte Ltd", "location": " (+1 other)", "via": "via BeBee", "description": "Join an award-winning, high-growth companyWork with a passionate and talented teamExcellent learning and career development opportunitiesOur client is an e-ticket distribution platform that serves as marketplace for tours and activities in Asia. They are an award-wining company that is expanding rapidly within Asia, and has growing partnerships with well-known brands and organisations.The JobIn this role, you will be a Scrum development team member and be responsible for :Contributing in all phases of software development cycleCollaborating with team effectively, and supporting storyboarding effort of the teamContinuously enhance applications and develop high quality code as per standards & guidelinesPerforming peer-review to ensure code quality and requirements are metSupporting the smooth delivery of SIT and UAT activitiesTroubleshooting assigned bugs in a timely manner and updating status and details in Bug/Issue Tracking SystemThe ProfileYou have a Bachelor's Degree/Post Graduate... Diploma/Professional Degree in Computer Science/Information Technology or equivalent.You have at least 2 years experience in software development.Being a Certified JAVA Developer or Certified Scrum Developer (CSD) will be an advantageYou have experience with Javascript, Frontend frameworks such as Angular and modern web technologies like HTML, CSS3You have experience with JDK 1.5 and above, J2EE and Spring, Hibernate framework, Grails/Groovy, J2EE application servers GlassFish, Jetty or equivalentYou have worked with Databases – MySQL, Oracle, SQL Server or equivalentYou have good knowledge of REST APIs and Design Patterns e.g. MVCYou are familiar with source control management system such as SVN, GIT and bug tracking system such as BugZilla, JIRA etc.Experience with mobile hybrid development as well as native e.g. Cordova/Phonegap is requiredYou have knowledge of Agile and ScrumPrior experience with C, C++ and C# is advantageousYou have strong analytical skills with ability to solve complex problemsYou have strong written and verbal communication skillsYou are a strong team player and are able to work effectively in a collaborative environmentRef: 73776029", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBEZXZlbG9wZXIgKEphdmFzY3JpcHQpIChCQi1GOEY2MSkiLCJjb21wYW55X25hbWUiOiJTbmFwSHVudCBQdGUgTHRkIiwiY29tcGFueV9taWQiOiIvZy8xMWM3NHQ2MXc4IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiUDI1T2dJdUNqWjVnc1VBS0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZjQkNyY0JRVTVWWDA1eFUwZGpPWEo2U1VkVlUxazFiMlV4UXpCQ1QxTjBjR2RyU210blEwUlBUVXgyVmtSWVZqbG1hMFJzYmkxa1RuaHhkR0UyUTBacFpqbGljRm8zUkY5TVZtZzRUMnRSVVdaaFNESldZemxqYW5SS1ZYbDRWVUZ3V1c5VlNFMUljRXRSVjFkUlpUQXpYMVpHWTFod0xXRTBhbkJ4V2tWMlpVSTFjekozTUdSSlMxQnhVR3gxU1RGSWVsQndUa2RoZGpSaVpFNXhOSGhWUzI5TFoxRmpMVXRmUzJKVFlVSnJYelZQVERWZmRFWm9jakJKRWhkSFNIVkRXVkJpTTBjdE1uRjNZbXRRYTA1RFptbEJjeG9pUVU5TldWSjNSR05VT1V4eVlYQnliM2RmVTNKUFJUbEtlVTEyZVVsUVlYVnVadyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzUyIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJlQmVlIiwibGluayI6Imh0dHBzOi8vc2cuYmViZWUuY29tL2pvYi8yMDIxMDQxNy03ZjU4MGZlNDUwMjM4YjkyNGQ0MWZkZDcwZmRmOGY2MT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior Animation Programmer", "company_name": "Ubisoft", "location": "Singapore", "via": "via Bayt.com", "description": "Company Description\n\nCREATOR OF WORLDS\n\nUbisoft’s 19,000 team members, working across more than 40 locations around the world, are bound by a common mission to enrich players’ lives with original and memorable gaming experiences. Their dedication and talent has brought to life many acclaimed franchises such as Assassin’s Creed, Far Cry, Watch Dogs, Just Dance, Rainbow Six, and many more to come. Ubisoft is an equal opportunity employer that believes diverse backgrounds and perspectives are key to creating worlds where both players and teams can thrive and express themselves. If you are excited about solving game-changing challenges, cutting edge technologies and pushing the boundaries of entertainment, we invite you to join our journey and help us Create the unknown.\n\nOpening its doors in July 2008, Ubisoft Singapore features the largest AAA studio in Southeast Asia and is home to a culture that celebrates serious fun and diversity. As proud innovators of naval gameplay and water... technology, we’re super excited to be the lead studio in bringing a brand-new IP to you – Skull and Bones! Our other notable works include every Assassin’s Creed game since Assassin’s Creed II, with our latest Viking adventure being Assassin’s Creed Valhalla.\n\nJob Description\n\nYOUR DAILY ADVENTURE\n\nAs an Expert Programmer (Animation), your role is to:\n• Advise the Lead Programmer and drive the decision-making regarding the choice, optimization and organization of existing and new innovative systems (related to animations)\n• Contribute to improve the market competitiveness of the game\n• Help implement features related to animation that fit within performance budgets (CPU/Memory/Streaming, etc)\n• Set out best practices and share your programming expertise with other teams\n\nWHAT YOU WILL DO\n• Develop interfaces with game systems (AI, character control, etc.)\n• Develop tools for use by gameplay programmers and animators\n• Develop procedural animation tools and technologies\n• Write technical design and software design documentation\n• Collaborate with game productions to create next generation animation system\n• Perfect animation compression algorithms to reduce memory footprint without affecting visual quality.\n\nQualifications\n\nWHAT YOU BRING\n• Master's or Bachelor's degree in Math or Computer Science, Software Engineering\n• Extensive programming experience with emphasis on character animation\n• Excellent C/C++ programming skills\n• Strong 3D maths and computer graphics skills\n• Experience in IK/FK systems\n• Familiarity with building large and dynamically extensible applications\n• Experience with multi-threaded engine programming on Game consoles\n• Experience building efficient code (CPU/SPU cost, memory usage, code size\n• Understands the overall development cycle of a game engine\n\nAdditional Skills:\n• Familiarity with 3ds Max / Motion Builder\n\nAdditional Information\n\nWHAT YOU’LL ENJOY\n\nCheck out our list of perks and benefits here: https://www.ubisoftsingapore.com/\n\nJOIN THE SQUAD\n\nMaking games is serious business, but it's very important for us to have fun while creating awesome worlds so that we can convey the same sense of joy to millions of players in the world.\n\nCome on board and experience #LifeAtUbi for yourself, we are always on the lookout for talents who thrive in bringing their A-game to work. If this sounds like you, shoot us your resume, portfolio, and anything else to show that you’re serious about fun!\n\nWe are an equal-opportunity employer and value diversity at our company. We do not discriminate on the basis of race, ethnicity, religion, gender, sexual orientation, age or disability status", "extensions": ["9 days ago", "Full–time"], "detected_extensions": {"posted_at": "9 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQW5pbWF0aW9uIFByb2dyYW1tZXIiLCJjb21wYW55X25hbWUiOiJVYmlzb2Z0IiwiY29tcGFueV9taWQiOiIvbS8wMnFkeWoiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJ2a19TMVo1MWVCNzF4ejByQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFc3dCQ293QlFVNVZYMDV4VkY5YVdWWTFOV0ZUYzBjelNXdDFPRVZNZVZBMmJURjZYMFJ1VWtob1R6TnFjSEJPZWxodWFVcEZZMUE0ZEUwd1RYcG1iR2hZWTJ0dWJGTkxUbVZLWW1wQ1ZIQjNia2xpWmkxb1ExTkljUzFwYlZCUGVYb3pRMDFCUVdKU1QxVkdTVkJvVm1wV1VFVjRPVmhQZVhKTmIyTnJNR3g0VTNCblMwZFNjMWRmU0VwMVdqRnZSMVlTRjBkSWRVTlpVR0l6UnkweWNYZGlhMUJyVGtObWFVRnpHaUpCVDAxWlVuZENXbDkwVkdGUE5UUnBiRXhSVkZONVlWZGFiVWd4Y0ZWblYxQkIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY181OSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCYXl0LmNvbSIsImxpbmsiOiJodHRwczovL3d3dy5iYXl0LmNvbS9lbi9zaW5nYXBvcmUvam9icy9zZW5pb3ItYW5pbWF0aW9uLXByb2dyYW1tZXItNTk0NzI0NTcvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}], "chips": [{"type": "Title", "param": "job_family_1", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Software engineer", "value": "software engineer"}, {"text": "Programmer", "value": "programmer"}, {"text": "Programmer analyst", "value": "programmer analyst"}, {"text": "Cnc programmer", "value": "cnc programmer"}, {"text": "Engineer", "value": "engineer"}, {"text": "Senior", "value": "senior"}, {"text": "Analyst programmer", "value": "analyst programmer"}, {"text": "Science", "value": "science"}, {"text": "Software programmer", "value": "software programmer"}, {"text": "Assistant", "value": "assistant"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Electrical engineer", "value": "electrical engineer"}, {"text": "Executive", "value": "executive"}, {"text": "Java engineer", "value": "java engineer"}, {"text": "Java programmer", "value": "java programmer"}, {"text": "Lecturer", "value": "lecturer"}, {"text": "Manager", "value": "manager"}, {"text": "Operator", "value": "operator"}, {"text": "Project officer", "value": "project officer"}, {"text": "Senior programmer", "value": "senior programmer"}, {"text": "Senior system", "value": "senior system"}, {"text": "Senior technical", "value": "senior technical"}, {"text": "Sr. programmer", "value": "sr. programmer"}, {"text": "System engineer", "value": "system engineer"}, {"text": "Systems programmer", "value": "systems programmer"}, {"text": "Technical", "value": "technical"}, {"text": "Trainee", "value": "trainee"}, {"text": "Trainer", "value": "trainer"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Mining", "value": "/business/naics2007/21"}, {"text": "Rental", "value": "/business/naics2007/532"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Wholesale", "value": "/business/naics2007/42"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "VISA", "value": "/m/01kqjn"}, {"text": "EPAM", "value": "/m/0dlnrc"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "TikTok", "value": "/g/11fy265933"}, {"text": "Citi bank", "value": "/m/01dfb6"}, {"text": "Ubisoft", "value": "/m/02qdyj"}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Cognizant", "value": "/m/03bf9h"}, {"text": "Credit Agricole Group", "value": "/m/028vbm"}, {"text": "J.P.Morgan", "value": "/m/01hlwv"}, {"text": "Mindteck (India) Limited", "value": "/m/0cqj8w1"}, {"text": "Nanyang Technological University", "value": "/m/0l49k"}, {"text": "Oracle", "value": "/m/05njw"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Avensys Consulting Pte Ltd", "value": "/g/11g7022gjf"}, {"text": "Avnet", "value": "/m/0c8xmc"}, {"text": "Collins Aerospace", "value": "/m/0kv61y1"}, {"text": "Globaltix Pte Ltd", "value": "/g/11dxpqdhrf"}, {"text": "Government Technology Agency", "value": "/g/11gh0528nq"}, {"text": "HCL SINGAPORE PTE. LTD.", "value": "/g/11fy25ngsv"}, {"text": "OakTree Consulting", "value": "/g/11g70jfhtq"}, {"text": "Optimum Solutions (Singapore) Pte Ltd", "value": "/g/11g70hkrbx"}, {"text": "Razer Inc.", "value": "/m/075hc0"}, {"text": "Realtek Malaysia", "value": "/m/05wrm7"}, {"text": "Realtek Singapore Private Limited", "value": "/g/11g9n26trs"}, {"text": "Success Human Resource Centre Pte Ltd", "value": "/g/11g709_209"}, {"text": "TECHNOPALS PTE. LTD.", "value": "/g/11dxpvkynp"}, {"text": "Techcom Solutions Pte Ltd", "value": "/g/11c73vztx3"}, {"text": "UST", "value": "/m/08kb8g"}, {"text": "UrbanFox", "value": "/g/11ghs7y0w6"}, {"text": "Adecco GS", "value": "/m/08gz46"}, {"text": "Alphanova Pte. Ltd.", "value": "/g/11f8h_czps"}]}]}