{"search_metadata": {"id": "60827af4fe41d0b380d45ea7", "status": "Success", "json_endpoint": "https://serpapi.com/searches/d8c51dfb5fc30d9a/60827af4fe41d0b380d45ea7.json", "created_at": "2021-04-23 07:44:52 UTC", "processed_at": "2021-04-23 07:44:52 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28programmer%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=160", "raw_html_file": "https://serpapi.com/searches/d8c51dfb5fc30d9a/60827af4fe41d0b380d45ea7.html", "total_time_taken": 3.32}, "search_parameters": {"q": "(programmer) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "160"}, "jobs_results": [{"title": "Cyber Security Developer", "company_name": "Career Edge Asia Pte Ltd", "location": "Singapore", "via": "via Glassdoor", "description": "• Develop software and firmware-based cyber security applications and appliances\n• Manage the product development lifecycle from system design to implementation\n• Work closely with all the relevant stakeholders/customers to translate requirements into efficient and effective solutions\n• Involve in both low-level algorithm development, and high level web/windows/Linux software development, and design of users interfaces\n\nRequirements:\n• Degree in Computer Science, or Information Technology\n• Strong programming skills, with minimum of 2 years of programming experience in C/C++, Java, ASP, Microsoft .NET\n• Knowledge in Cryptography and Access Control measures preferred\n• Certification in Cyber Security or Information Technology Security field has an advantage\n• Relevant work experience (2~5 years) in cyber security related field preferred\n\nCompetitive remuneration package will be offered to the shortlisted candidate.\n\nInterested candidates, please send your updated CV in MS Words format... stating your last drawn salary, expected salary, notice period and reason for leaving last / past employment(s) and email to recruit21@caed.com.sg for priority processing.\n\nAttn: Jace Tay (Registration No.: R1331152)\n\nCAREER EDGE ASIA PTE LTD\n\nEA Licence Number: 13C6678\n\nTo find out more job opportunities, visit Career Edge Asia at www.caed.com.sg for all job listings.\n\nEmail: recruit@caed.com.sg\n\nMore Information\n• Salary Offer $4,000 – $5,000", "extensions": ["16 days ago", "Full–time"], "detected_extensions": {"posted_at": "16 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDeWJlciBTZWN1cml0eSBEZXZlbG9wZXIiLCJjb21wYW55X25hbWUiOiJDYXJlZXIgRWRnZSBBc2lhIFB0ZSBMdGQiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Inc1Q21mR2pNWnFod3hfcEFBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gR2xhc3Nkb29yIiwibGluayI6Imh0dHBzOi8vd3d3LmdsYXNzZG9vci5zZy9qb2ItbGlzdGluZy9jeWJlci1zZWN1cml0eS1kZXZlbG9wZXItY2FyZWVyLWVkZ2UtYXNpYS1wdGUtSlZfSUMzMjM1OTIxX0tPMCwyNF9LRTI1LDQ1Lmh0bT9qbD0zNjU3MzAzMjAxXHUwMDI2dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Software Engineer - TikTok Ads", "company_name": "TikTok", "location": "Singapore", "via": "via Bayt.com", "description": "TikTok is the leading destination for short-form mobile video. Our mission is to inspire creativity and bring joy. TikTok has global offices including Los Angeles, New York, London, Paris, Berlin, Dubai, Mumbai, Singapore, Jakarta, Seoul and Tokyo. TikTok is one of the fastest growing apps in the world, and we're looking for Software Engineers to join our App Monetization team. The Ads Infra team uses state-of-the-art ads delivery architectures and cutting-edge machine learning algorithms to optimize every impression on TikTok's platform for both our users and advertisers. What You'll Do 1. Build delivery services for TikTok Ads, including ads targeting, indexing, recall, click and convert prediction, bidding, auction, mixed ranking of ads and organic results, etc.\n2. Build deep learning solutions for TikTok ads ranking, including building training examples, realtime online training, deep models inference, model based retrieval, etc.\n3. Build service frameworks with highest... performance and availability.\n4. Build globalized ads system across multiple data centers worldwide.\n1. Bachelor's degree or above, majoring in Computer Science, or related fields.\n2. Experience programming in at least one of the following programming languages: C, C++, Java or Golang.\n3. Effective communication skills and a sense of ownership and drive. Preferred Qualifications 1. Experienced in at least one area of the following areas: Ads delivery, personalized recommendations, search engine, machine learning, distributed storage system, big data frameworks", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciAtIFRpa1RvayBBZHMiLCJjb21wYW55X25hbWUiOiJUaWtUb2siLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IldValZIZ09BZHV1RXhJazVBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQmF5dC5jb20iLCJsaW5rIjoiaHR0cHM6Ly93d3cuYmF5dC5jb20vZW4vc2luZ2Fwb3JlL2pvYnMvc29mdHdhcmUtZW5naW5lZXItdGlrdG9rLWFkcy01ODE4MTEzNi8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Adjunct Lecturer: Full-stack Software Developer", "company_name": "Generation", "location": "Singapore", "via": "via LinkedIn", "description": "We are seeking a talented full-time adjunct lecturer to deliver our 12-week junior full-stack software developer program that equips young people with the behavioral skills, mindsets, and technical skills needed to become a successful junior developer. The lecturer will work in collaboration with staff at TP and Generation Singapore program staff.\n\nTemasek Polytechnic (TP) is a leading institution of higher learning in Singapore founded in 1990. Together, TP and Generation Singapore are launching a new programme to train Cloud Support and DevOps practitioners in Singapore. This program prepares participants for the Cloud Support and DevOps practitioner roles with a specific focus on Microsoft Azure technologies.\n\nApplicants will be interviewed by both TP and Generation Singapore. If you are selected, you will sign a contract with TP, the details of which can be discussed during your interview. Interested applicants may apply by emailing your CV to Ms Paroma Ray ... paroma.ray@generation.org ).\nTo be successful you'll need: About you\nYou are an education expert (e.g. teacher, instructor, trainer) with software development experience, or a software development expert with experience instructing/teaching. You have an exceptional ability to tailor content to different learners and experience teaching online. You enjoy delivering sessions with energy and enthusiasm to generate excitement about learning new technical and behavioral skills. You build strong relationships with younger and older adults and have a proven record to ensure participants successfully complete the program.\n\nEssential\n\nRequirements\n• A bachelor’s degree or other relevant experience in Information Technology, Computer Science or a related field\n• At least 2 years experience teaching or coaching in an educational or corporate setting; experience with online or blended learning preferred\n• Experience working with adults and/or has extensive knowledge of current trends and issues in adult knowledge\n• Experience with the following languages: Java, JavaScript, React, SQL\n• Familiar with the following: coding foundations, web development, HTML, CSS, Bootstrap, Git & GitHub, Agile Software Development / SCRUM, Object-oriented programming and design, data structures and algorithms, Spring Boot\n• Relevant industry certifications, e.g. Oracle Certified Java Programmer or equivalent will be an advantage\n• Up-to-date knowledge and insights on software developer industry trends\n\nDesirable\n• 3+ years of experience in the above-mentioned areas\n• Experience teaching technical content to a non-technical audience\n• At least 1-year experience in teaching technical content covering the areas mentioned above.\n• Experience supervising other instructors or trainers\n• Competency in Microsoft Office skills (Excel, Word & PowerPoint) and Google Drive\n• At least one experience delivering training, coaching, or mentoring to a youth audience.\n\nMinimum Requirements\n\nMindsets and Capabilities\n• Motivational Fit . Passion for helping change the life trajectories of a diverse group of students (potentially including recent graduates, mid-career switchers, and disconnected populations).\n• Professionalism . This includes but not limited to adherence to a professional dress code, communications and engagement with supervisors, colleagues and students and pays close attention to detail.\n• Effective Communication . Excellent oral and written presentation skills in English – the language of instruction for all Generation trainings\n• Data Management . The ability to collect and analyse training data as required by Generation Programs.\n• Growth Mindset . Be self-reflective, openly receive feedback on his / her performance and should be able to apply feedback and pursue additional learning to improve his / her performance.\n• Solutions and Results Oriented . A positive, solutions-oriented attitude, drive for excellence.\n• Interpersonal Skills .\n• Strong cross-cultural skills that demonstrate the ability to engage well with participants.\n• The ability to be a team player.\n\nWhat you'll do:\nDelivery of Skills-based Training (70%) under the guidance of the Generation Curriculum and Instruction Lead\n• Follow the overarching structure and flow of the curriculum, including behavioral skills, mindsets, technical, and employment essentials sessions.\n• Leverage subject matter expertise during synchronous delivery of online sessions\n• Guide students through asynchronous (independent) learning modules and help solidify understandings debriefs and synchronous moments\n• Prepare and personalise sessions by reviewing curriculum materials and integrating stories or examples to increase participant learning.\n• Engage participants in active thinking and participatory learning using effective communication and facilitation techniques.\n• Differentiate instruction to meet individual learning needs and accommodate different learning styles.\n• Provide in-the-moment feedback to participants to clarify misunderstandings and/or encourage critical thinking.\n• Provide relevant and timely feedback to students on formative and summative assessments, including student projects.\n• Engage in Generation-sponsored instructional support, professional development and training.\n\nProgram Management (10%). Under the guidance of the Generation Programme Lead:\n• Input data using Generation’s technology platform (e.g., participant attendance, performance in class and assessments, etc.).\n• Any other administrative duties required to ensure successful operations of the program\n• Support with screening of candidates and, if necessary, prepare them to attend the training.\n\nStakeholder Engagement & Management (10%)\n• Collaborate with Programme Mentors, Generation and TP staff to identify and mitigate potential risks to participant success and achievement of their goals.\n• Collaborate with the Programme Lead and commit to acting on any feedback that intends to increase data completion to Generation’s global standards\n• Collaborate with the Curriculum and Instruction Lead to support program quality.\n\nParticipant Mentoring and Support (10%)\n• Build relationships with participants, develop an understanding of their personal strengths and challenges, and foster a supportive classroom environment.\n• Motivate and support participants to persevere through challenges and continue on their journey of professional and personal growth.\nAbout Generation\nWorldwide, more than 75 million young people are unemployed. But many employers can’t find people with the skills they need for entry-level jobs. Generation was created in 2014 to help bridge this gap—at speed and scale.\n\nWe’re building a skills-training methodology that can serve hundreds of thousands, and eventually millions, of young people a year. And we’re building proof that this training creates real business outcomes for employers, and lasting career impact for trainees—so everyone has the incentive to invest in skills. Our goal is to help our students achieve personal and professional success—and fundamentally change their life trajectories. Generation programs prepare unemployed or underemployed young people, aged 18 to 29, for jobs in four sectors: healthcare, technology, retail/sales, and skilled trades.\n\nToday, Generation is active in fourteen countries with diverse social, economic and labor-market contexts", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBZGp1bmN0IExlY3R1cmVyOiBGdWxsLXN0YWNrIFNvZnR3YXJlIERldmVsb3BlciIsImNvbXBhbnlfbmFtZSI6IkdlbmVyYXRpb24iLCJjb21wYW55X21pZCI6Ii9nLzExZ214aHc4dHMiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJfdDZ5ZjBJWVZIRzZQUmFrQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VkRFNGIyRmtSbXRqY2tGYWJIYzVOWGMyTTJKTldGbFNaak5FUTBobGJHWXpSbkl4U1Zwd01qWTBiMWhLTVZWRVVWbzRSakkyWldaRFVIRlJiRUphYjNScU1XaFhjWEJNYkRWM1ZYRmljM3BWWTNvM1NWTmtTMUJNUlMxbk0wWk9WbmRQU0hCeFdWbHlNVUZJV0RoM1VGWk1jVVF0ZUROWFEyUkdjbFJVTTBOQ2VFWndiWE5HZFY5VVJVcGFlSEpyVGs4eE1sZHBORFZYTWt0M0VoWTVibkZEV1V0RExVWTRjbVZ6UVZkak9UWlFaMFJCR2lKQlQwMVpVbmRDTm1SUGNXWmhhVzUxYUdKSU1qZzNUalJqTTBKS1ptY3hlR0pSIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMTUiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGlua2VkSW4iLCJsaW5rIjoiaHR0cHM6Ly9zZy5saW5rZWRpbi5jb20vam9icy92aWV3L2FkanVuY3QtbGVjdHVyZXItZnVsbC1zdGFjay1zb2Z0d2FyZS1kZXZlbG9wZXItYXQtZ2VuZXJhdGlvbi0yMjk0NzYzMDE4P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Senior Software Engineer", "company_name": "Cardinal Health Singapore 225 Pte. Ltd", "location": "Singapore (+1 other)", "via": "via Jobs", "description": "Show recruiters you're immediatley available for job opportunities Posted On: 5 days ago Total Views: 6 Total Applications : 1 Job Id: 27388169 Permanent Job Job DescriptionReporting to: R&D Section ManagerJob Summary Work on software design, implementation, verification and coordinate with US software team and software vendors on software related projects. Ensure that all product development conforms to design specifications and coding standards for medical devices.Responsibilities Support project team activities related to product development lifecycle, certification, and problem solving Member of small project development team Design and develop web-based solutions Work on technical problems related web development Comfortable with doing both frontend and backend work Support validation activities per organization policies and procedures Create technical deliverables and provide technical Subject Matter Expertise Participate in Agile development lifecycle methodology, code... configuration management process and code deployment process Provide input into technical design & implementation and system configuration management Generate and maintain technical documentation required to support design control requirement and regulatory submissions Work closely with cross functional teams and external vendors to ensure timely project delivery Requirements Bachelor’s degree in computer science, web development or equivalent is required Experience working in medical device industry is advantageous Experience in Spring Boot, Git and API integration Knowledge of software integration testing Basic cybersecurity knowledge Familiarity with cloud computing Vue.js framework and Database experience is preferred Agile environment is preferred Swift/IOS and/or Android development for mobile development is preferred Team player qualities and good interpersonal skills We currently have an outstanding opportunity for a Senior Software Engineer who will focus on developing software components for video management applications. You will be based in our research & deveJob Description Develop high-quality IT-oriented software products Participate and contribute in the requirement consolidation and product design Manage the product development lifecycle fromThe day-to-day activities: * Design and write with the cutting edge GO language to improve the availability, scalability, latency, and efficiency of Grab's range of services * Design and write dThe Position: Senior Software Engineer will develop information systems by studying operations; designing, developing and installing software solutions; support and develop software team. He/she will 1. Job Description a. Responsible to configure, setup, design process sequences, troubleshoot and fine-tune of process on project using FASA applications or help to develop them. b. Responsible to cWe are on the lookout for software engineers excited about working on today’s cloud native and Kubernetes challenges. You enjoy solving the complexities of cloud native development and are passionate Location: 1 Fusionopolis Place, #06-20, Galaxis (West Lobby), Singapore 138522 We are Aria Health. Advancing technology, building community, and bringing a personal focus to therapy. We’re working tJob Description * Embedded system development * Wireless AP router software and firmware development * Participate in full system development life cycle with application design, development, 1. Job Description a. Responsible to configure, setup, design process sequences, troubleshoot and fine-tune of process on project using FASA applications or help to develop them. b. Responsible to cJob Responsibilities: - Create specifications and define software architecture for embedded systems - Design and develop MCU based firmware for embedded system - Design and develop middleware, applGive your career a boost with Monster's resume services.Simple body text this will replace with orginal content Toll Free No: +8001-012-339 91-40 66116994", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgRW5naW5lZXIiLCJjb21wYW55X25hbWUiOiJDYXJkaW5hbCBIZWFsdGggU2luZ2Fwb3JlIDIyNSBQdGUuIEx0ZCIsImNvbXBhbnlfbWlkIjoiL20vMDluMGpobSIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Ikw0MzRxbEI2ZlZoVU53RjVBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVxRUNDdUlCUVU1VlgwNXhVVU5EYjBSeVJFbFBjVXBOUWtwQk1tdEdUbFJJZDNsTlZtTXhTV0ZWV1dKbE9YUjZTWHA2WjIxU2FXNTFkRGhWU1ZOVmVtUlJPRzFDWjFOc01ITlJiV05QUWpOUmIzaHpVR3BNUWxKbWNFMWxNMHBOVlRsWWMyUnVNM0J4VlVGaFpGVkZWbkV4ZG5aWlRrbEphMkpyT1hsdWVscEtSRFU0Um5GR2VtVXRYMjV6VEZKUFNtOXhOR1ExUVdkQ1NGUllZakpvYVhOYWRVYzJUblZWZDI1RmJISm9kSGRJT0VRek1YUmpOVWRGTm5sQ00weFJlalpZUTJaT2RUVXlORVJQUVVvMGJVd3lZMmhrWldKR2RXeFpjVk5ITkd0SFgwaElkMDVWUVJJV09XNXhRMWxMUXkxR09ISmxjMEZYWXprMlVHZEVRUm9pUVU5TldWSjNRV3hCT0hsUU1WaHNObDlmTW1zNFJGcDFaWG8xVEZKRVdtdHpkdyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzIyIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnMiLCJsaW5rIjoiaHR0cHM6Ly9zZy5maWRhbnRvLmNvbS9qb2JzL2pvYi1vcGVuaW5nL3NvZnR3YXJlLWRldmVsb3BlcnMtc3lzdGVtcy1zb2Z0d2FyZS9zZW5pb3Itc29mdHdhcmUtZW5naW5lZXItMjc1NDM3MjUzP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Senior Technical Developer (Ecommerce) (BB-D2118)", "company_name": "CLEARGO E-BUSINESS CONSULTANCY PTE. LTD.", "location": "Singapore (+1 other)", "via": "via BeBee", "description": "Roles & ResponsibilitiesJob Title Senior Technical Developer (Full Stack)Occupation Senior Technical Developer (Full Stack) Job Description & Requirements We are looking for a full-stack Senior Technical Developer to join us at our Singapore office Location: One Central (Clarke Quay) Job Description / Responsibilities:· Evaluate and provide technical feedback on project requirements· Provide solutions for technical problems with recommendations· Perform programming and technical tasks according to project requirements to defined quality standards· Competent in technical design capabilities· Responsible for design, implementation, deployment, and maintenance of web-based applications and e-Commerce/shopping cart development· Prepare technical documentations including functional/programming specifications, etc.· Mentor junior professionals and contributing to building a solid team Job Requirements:· Higher Certification, Diploma or above in Information Technology / Computer Science ... Computer Engineering / e-Commerce or related discipline· Hands on experience and proficiency in PHP, MySQL, Javascript, jQuery, AJAX, JSON, XML and HTML 5 is a must; Knowledge in NodeJS and/or React is advantage· Comfortable with containerization ecosystems development, ie. Docker· Comfortable with working using Linux OS· Experience with full-stack development including mobile platforms (Android/iOS) is preferred· Ability to adapt to fresh, new development frameworks which are more often than not loosely documented· 5-7 years' experience in web application development· Familiar with e-Commerce related development, eg. payment gateway and shopping cart development is highly preferable· Experienced in Magento and/or Shopify is a great advantage;· Good communication skills with passion at programming and software development;· Highly independent, willing to learn and being flexibleTell employers what skills you haveAgile MethodologiesAJAXCSSHTMLJavaScriptJob DescriptionsMySQLPHPProgrammingSDLCSoftware DevelopmentTechnical DesignWeb Developmentcompetentproject requirementsquality standardstechnical problemsCapability", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgVGVjaG5pY2FsIERldmVsb3BlciAoRWNvbW1lcmNlKSAoQkItRDIxMTgpIiwiY29tcGFueV9uYW1lIjoiQ0xFQVJHTyBFLUJVU0lORVNTIENPTlNVTFRBTkNZIFBURS4gTFRELiIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiNThkeXZtRm1JaG0xbmc4a0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCZUJlZSIsImxpbmsiOiJodHRwczovL3NnLmJlYmVlLmNvbS9qb2IvMjAyMTA0MTctOTAxMmVkZjVkYzY3OWZmODYwNzJmNzBjYjY1ZDIxMTg/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Software Engineer for UST, Singapore", "company_name": "UST", "location": "Singapore (+1 other)", "via": "via NodeFlair", "description": "UST is a leading provider of platforms, digital innovation, artificial Intelligence and end-to-end IT services and solutions for Global 1000 companies. We have more than 25,000 employees based in more than 20 countries.\n\nLooking for an experienced Site Reliability Engineer to be a part of world class software engineering team.\n• At least 6 years of developmental experience in ASP .NET, MVC. Hands on expertise in .NET CORE is needed\n• 2+ years of experience in Azure PAAS is a must.\n• Good Hands-on experience in SQL DB\n• Experienced in Power shell scripting\n• Experienced in CI/CD creating pipelines and automated deployments. Should be well versed with DevOps practices.\n• Microsoft certified Azure certifications (preferred).\n• Strong communication and presentation skills to provide new feature demos to project stakeholders.", "extensions": ["2 days ago", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciBmb3IgVVNULCBTaW5nYXBvcmUiLCJjb21wYW55X25hbWUiOiJVU1QiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjQ0aGxQOVhvbGdnb3BuTWtBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTm9kZUZsYWlyIiwibGluayI6Imh0dHBzOi8vd3d3Lm5vZGVmbGFpci5jb20vam9icy9saXN0aW5ncy8xMjkyOT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Software Developer", "company_name": "Toss-ex Pte. Ltd.", "location": "Singapore (+1 other)", "via": "via Monster Malaysia", "description": "Job Description\n\nDevelopment of salesforce features like APEX class coding, process builders, triggers, lightening components and visual workflows.\n\nUnderstanding of salesforce security practices, Code quality and security tools, specifically PMD Static Code Analyzer and force.com, Salesforce security around Site Guest User profiles, encryption methods and tools.\n\nPrepared Design document in order to support the business.\n\nCo-ordinate with BA and testers during the development.\n\nRequirements\n\n5+ years relevant experience in salesforce development.\n\nFamiliar with CICD and has experience of using Gitlab as a code repository and management tool.\n\nIs able to produce technical design documents before development commences.\n\nExtensive knowledge on SDLC and exposure to QA testing processes and how to Create Test Data based on requirements/Test Scenarios\n\nAgile knowledge and experience as a developer and has used Agile tools such as Jira and confluence\n\nCan conduct Root cause analysis and... investigations during incidents and is able to create and implement fixes to resolve.\n\nDesired Skills and Experience: Agile, Apex Data Loader, Apex Programming, Development, Encryption, Salesforce, Salesforce.com Certified Developer", "extensions": ["17 days ago", "Full–time"], "detected_extensions": {"posted_at": "17 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBEZXZlbG9wZXIiLCJjb21wYW55X25hbWUiOiJUb3NzLWV4IFB0ZS4gTHRkLiIsImNvbXBhbnlfbWlkIjoiL2cvMTFnNzA2emQ3YyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Ind3N3FLX3p0S0YtSzloQXJBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2WUJDcmNCUVU1VlgwNXhVVk0yUW05MWRXaG1SbkZZVDE5RloxYzNUR3QzWWtoRFVuRkZabGs1VDJ3ME9UaFpXRGxtUzNsTWFIZElOM1J2WVhwUE1HbERVVTVFZWxSVldVOXNMVFIxV2t4c0xWbDFNV0owYVRkaGJ5MVVTMGxIZDBJd0xYbzVRbUpOY0c1RmFuVlZYMkptUldsMGJXWlFaM2R3VW1GVlVWTXhjMDVRY2tKcmJqWlNObmhwVHpFek1FbG5XbkJGUm10YU1ITjJVR0ZsU2t0SGVVdG1VbkpRWHpGVmFtOWZOWFpvWlhORGR6TXRXbXBOWmtwQkVoWTVibkZEV1V0RExVWTRjbVZ6UVZkak9UWlFaMFJCR2lKQlQwMVpVbmRDWVhsdFEyeGFSWFV6UjNnMVJXeHVjMkZTTkVKZlVVMWllR3BSIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMzYiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTW9uc3RlciBNYWxheXNpYSIsImxpbmsiOiJodHRwczovL3d3dy5tb25zdGVyLmNvbS5zZy9hbXAvam9iLXZhY2FuY3ktc29mdHdhcmUtZGV2ZWxvcGVyLXRvc3MtZXgtcHRlLWx0ZC1zaW5nYXBvcmUtMjc1OTY1MjUuaHRtbD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Programmer (.net)", "company_name": "Adecco GS", "location": "Singapore", "via": "via WhatJobs", "description": "Involved in the design, development, programming, implementation and maintenance of large scale web-based and general application systems\n\nOur client is Singapore's renowned brand.\n\nWORKS SPECIFICATIONS\n\nSCOPE OF WORK\n\n(a) The overall scope of the works expected from the from the Contract Programmer shall include the following:-\n\ni. Gather user requirements and prepare specifications and other relevant documentation according to the documentation standard required and etc;\n\nii. Design, develop, implement and maintain web-based and other applications;\n\niii. Perform project administrative duties, including disseminating project information to project stakeholders and monitoring the progress of project milestones;\n\niv. Trouble-shoot, diagnose and rectify reported application problems while at the same time, resolving the related diagnosed application problems within a satisfactory time period;\n\nv. Conduct End User briefings and training entailing the use of the software applications when... required;\n\nvi. Assist in rolling out new projects/applications or enhancements of existing systems/applications; and\n\nvii. Arrange logistics for meetings, conferences, trainings, and other project-related events. Organise project committee meetings and prepare the necessary materials, including reports, presentations, agendas and other meeting collateral. Transcribe and accurately record key decisions and action items resulting from meetings.\n\n(b) The personnel to be provided must have at least 5 years of working experience in the design, development, programming, implementation and maintenance of large scale web-based and general application systems. They should preferably hold a certification in Microsoft Certified Application Developer (MCAD) and Sun Certified Java Programmer (if possible).\n\n(c) The personnel must have working knowledge and experience in the following environment :-\n\ni. Development Languages/Tools\n\nVB.NET, C#.NET, Visual Basic 6 (At least 5 years)\n\nOO Analysis and Design (At least 2 years)\n\nii. Internet Technologies\n\nASP.NET\n\nHTML, Java Script, AJAX\n\nMS SharePoint Online\n\nMS PowerApp\n\nMS PowerAutomate\n\niii. Database and Others\n\nMS SQL Server 2008 (At least 5 years)\n\nMS SQL Server 2016\n\nMS Visual Studio 2008 (At least 5 years)\n\nMS Visual Studio 2017\n\n.NET Framework 3.5 (At least 5 years)\n\n.NET Framework 4.5\n\nIIS, SSL\n\nWindows 2003 or above / Windows XP", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9ncmFtbWVyICgubmV0KSIsImNvbXBhbnlfbmFtZSI6IkFkZWNjbyBHUyIsImNvbXBhbnlfbWlkIjoiL20vMDhnejQ2IiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoidlpZeDVCWEtmdGJMVnJyMUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFVYZFFOVTVMVTJ0a2RWZHFORzlyUVRGWmQzZGtWVUowYTJ4dllsZDJaUzFTTWpGbFlUY3hTREpGZG0xQ1dra3RZM2RwTkhkd2JXczNjR3BSYVhOcVozWkhPSFV6TVRrMGFqTXdTMlI2ZFZOVFdtTklRMjVxWkV4Q00wcGtjM2xxUm5Kb1pEaHpNVzl5YzJwek0yWlBSV0ZaU1VaT2VIUmxNWHBKYlVoSVMwTlllbWh4Tm05NmNFVmtWRVpaU2s5aVZ6aExUREpWYTJGdFdHWlJFaFk1Ym5GRFdVdERMVVk0Y21WelFWZGpPVFpRWjBSQkdpSkJUMDFaVW5kQkxYWmhjMmRPVW1sVVRUSlNRMU5FU1VOQ1ptVklaSFZ1ZEVObiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzQzIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFdoYXRKb2JzIiwibGluayI6Imh0dHBzOi8vZW4tc2cud2hhdGpvYnMuY29tL2pvYi1mb3ItUHJvZ3JhbW1lci1uZXQtaW4tU0ctY29vcDE3NTg1NTc5P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Software Developer", "company_name": "IHS Markit", "location": "Singapore (+1 other)", "via": "via Bayt.com", "description": "Software Developer\n\nJob Description\n\nIHS Markit is seeking software engineers (0 – 5 years’ experience) based in Singapore with strong analytical and problem-solving skills to develop and improve our software product, MIR. Team members are never stuck – all team members can take part in all aspects of software development including, but not limited to:\n• Functional and technical design\n• Full-stack Development\n• Automated testing and site reliability\n• Client relationship management and support\n\nYou will be joining a friendly team of experienced, intelligent and helpful technology experts. The team follow the best development practices and are constantly growing.\n\nYou will work with tools and technologies including\n• Java, Spring 5, Spring-boot\n• React with Redux Thunk\n• AWS infrastructure as code\n• Automated and containerized CI/CD technologies\n• SQL, MySQL, H2, Aurora, JPA, Hibernate\n• jUnit, Cucumber, Cypress\n\nWhat to expect in the interviews:\n• Programming exercises and... brainstorming (whiteboard and computer)\n• Sharing and discussions about development experiences you’ve had\n• Design and other technical exercises\n\nWays to get ahead of the pack:\n• Link to your github or include a code sample with your resume\n• Read about, and practice for, technical interviews\n\n-----------------------------------------------\n\nInclusion and diversity are critical to the success of IHS Markit, and we actively encourage applications from people of all backgrounds. We are committed to providing equal employment opportunity without regard to race, color, religion, sex, sexual orientation, gender identity, age, national origin, disability, status as a protected veteran, or any other protected category. For more information on the many ways in which we enthusiastically support inclusion and diversity efforts for both candidates and employees, please access our Inclusion & Diversity Statement here.\n\nWe are proud to provide reasonable accommodations to applicants with disabilities. If you are interested in applying for employment with IHS Markit and need special assistance or an accommodation to use our website or to apply for a position, please contact or call +1 212 849 0399. Determination on requests for reasonable accommodation are considered on a case-by-case basis. This contact information (email and phone) is intended for application assistance and accommodation requests only. We are unable to accept resumes or provide information about application status through the phone number or email address above. Resumes are only accepted through the online application process, and only qualified candidates will receive consideration and follow-up.\n\nIHS Markit maintains a substance-free workplace; employees may be asked to submit to a drug test (where permitted by law). In addition, as a federal contractor in the United States, the company participates in the E-Verify Program to confirm eligibility to work.\n\nFor information please click on the following links:\n\nIHS Markit Business Code of Conduct\nRight to Work\nEEO is the Law\nEEO is the Law Supplement\nPay Transparency\n\n-----------------------------------------------\n\nCurrent Colleagues\n\nIf you are currently employed by IHS Markit, please apply internally via the Workday internal careers site", "extensions": ["15 days ago", "Full–time"], "detected_extensions": {"posted_at": "15 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBEZXZlbG9wZXIiLCJjb21wYW55X25hbWUiOiJJSFMgTWFya2l0IiwiY29tcGFueV9taWQiOiIvZy8xMWYwMF81Y242IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoieEZELWMxa3dxb0JfbkZsUUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFVsVlBjV2xGVWxGdFVUTk5PVzkwUkV0RE9XVmpjMk5hTmpaSFMwbDJUSGxxWWpWMGN6Vk1aM1ZKVkdnNFFreEllVGczVlU5RE1YQkRhWGc1T0dZeGVtTkpZV3RFU1d4elJWaEdaa05uYUdsamFHZFlZa05MYTBScmNWcE5TVWx3V2taUVNVSjZRMHAyUldsTFpGSjJkMWxKZWxwWVJWWk9lWE5yWmt0emVreGFWRVF4T1ZWVVh6aEtVMDl2WnpsMmFVbGlRWE5VZEhwWWVWaG5FaFk1Ym5GRFdVdERMVVk0Y21WelFWZGpPVFpRWjBSQkdpSkJUMDFaVW5kRExVTXhNRVpVWVdaUFJUWnpObVpJVG5OUkxWcDRVRmxYUkVWMyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzUxIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJheXQuY29tIiwibGluayI6Imh0dHBzOi8vd3d3LmJheXQuY29tL2VuL3NpbmdhcG9yZS9qb2JzL3NvZnR3YXJlLWRldmVsb3Blci01OTM3Mzk0Ny8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Salesforce Developer", "company_name": "SnapHunt Pte Ltd", "location": " (+1 other)", "via": "via Learn4Good", "description": "Join a fast-growing startup using cutting edge technologies to deliver game changing results!\n\nExcellent learning & career development opportunities\n\nBe part of a dynamic work environment\n\nAttractive compensation\n\nOur client is a strongly backed sales enablement startup multiplying their customers' success by finding them best target users with the help of sales intelligence, productivity, insights, and other essential resources. With niche brands as their esteemed portfolio of clients, they take pleasure in delivering results that materially improve people's lives, whether they're an employee or a customer.\n\nThe JobAs a Salesforce Developer, you will be assisting us with the development and maintenance of our Salesforce applications. Your primary goal is to create a customized Salesforce application that integrates with third-party services.\n\nYou will be responsible for:\n\nDesigning and building scalable, maintainable, and reliable Salesforce application that interacts with external... APIs.\n\nTranslating functional requirements into technical requirements.\n\nWriting robust and scalable Apex code while following best practices.\n\nBuilding custom Lightning Aura components.\n\nWriting test classes and performing testing before deploying to production.\n\nIdentifying, analyzing and fixing bugs quickly and efficiently so as to ensure the reliability of the application.\n\nCollaborating and working with engineers and developers at a variety of infrastructure levels to achieve business goals.\n\nThe Profile\n\nYou possess Bachelor's in Computer Science, Engineering, Mathematics, or similar fields & have at least 3 years' experience working on APEX projects.\n\nStrong working knowledge of development on Salesforce using APEX, VF page, Triggers is required along with knowledge of coding best practices.\n\nHands-on knowledge of configurable solutions like workflow rules, validation rules, process builder etc. is a must.\n\nYou have worked with Lightning Aura Component framework and have experience working with Salesforce integrations using REST/SOAP.\n\nHands-on experience with code versioning systems like Git and at-least one tool like Bitbucket/GitLab/GitHub is required.\n\nExperience developing Salesforce managed packages; working with Auth 2.0; using Graph\n\nQL would be advantageous.\n\nSalesforce Platform Developer 1 certification would be a plus.\n\nYou possess intellectual curiosity and have the ability to achieve goals with minimal supervision.\n\nYou are committed to solving problems collaboratively, designing sophisticated products, and creating quality outputs", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTYWxlc2ZvcmNlIERldmVsb3BlciIsImNvbXBhbnlfbmFtZSI6IlNuYXBIdW50IFB0ZSBMdGQiLCJjb21wYW55X21pZCI6Ii9nLzExYzc0dDYxdzgiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJZTHJsOEU2a2JtOC1TWFRUQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdllCQ3JjQlFVNVZYMDV4VWxaa2RESmpUbWxLYlhCdFJqRXlPREZLVkVFeVJUUkxjMWh6Y1daWk1YQXpVMlJuZUVKdldVMTRjRGc1WVd3MVVDMVVUR2xSY2pCR2IwdHdUbmQ0VVZsTmIyUlFZelpoUVRrMFp6QXlVWFUzVVdkM1NEbFVVblkzUW05YVNWSjVURFpXT1VWdmMwRjJabEoxY2swd2J6SXhjRzkyUlc0elRrSkRNRGhKWnpNMWRETTRNbTF6WkdGU2EzaHlSemw1WmpZNVoza3hhVlpPTTJKM1MwbDRMV2h5WkdwaWRFc3lOazR3Y2pOeVppMU5FaFk1Ym5GRFdVdERMVVk0Y21WelFWZGpPVFpRWjBSQkdpSkJUMDFaVW5kQ2RYUnVaM1ZhTjNwSGIwaFVWVFEyY0ZKNFVHbGphbEZwTUd4QiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzU4IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExlYXJuNEdvb2QiLCJsaW5rIjoiaHR0cHM6Ly93d3cubGVhcm40Z29vZC5jb20vam9icy9zaW5nYXBvcmUvaW5mb190ZWNobm9sb2d5LzI3MTMxMTk4OC9lLz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}], "chips": [{"type": "Title", "param": "job_family_1", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Software engineer", "value": "software engineer"}, {"text": "Programmer", "value": "programmer"}, {"text": "Programmer analyst", "value": "programmer analyst"}, {"text": "Senior", "value": "senior"}, {"text": "Cnc programmer", "value": "cnc programmer"}, {"text": "Engineer", "value": "engineer"}, {"text": "Analyst programmer", "value": "analyst programmer"}, {"text": "Science", "value": "science"}, {"text": "Software programmer", "value": "software programmer"}, {"text": "Assistant", "value": "assistant"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Electrical engineer", "value": "electrical engineer"}, {"text": "Executive", "value": "executive"}, {"text": "Java engineer", "value": "java engineer"}, {"text": "Java programmer", "value": "java programmer"}, {"text": "Lecturer", "value": "lecturer"}, {"text": "Manager", "value": "manager"}, {"text": "Operator", "value": "operator"}, {"text": "Project officer", "value": "project officer"}, {"text": "Senior programmer", "value": "senior programmer"}, {"text": "Senior system", "value": "senior system"}, {"text": "Senior technical", "value": "senior technical"}, {"text": "Sr. programmer", "value": "sr. programmer"}, {"text": "Systems programmer", "value": "systems programmer"}, {"text": "Technical", "value": "technical"}, {"text": "Trainee", "value": "trainee"}, {"text": "Trainer", "value": "trainer"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Mining", "value": "/business/naics2007/21"}, {"text": "Rental", "value": "/business/naics2007/532"}, {"text": "Wholesale", "value": "/business/naics2007/42"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "EPAM", "value": "/m/0dlnrc"}, {"text": "VISA", "value": "/m/01kqjn"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "Citi bank", "value": "/m/01dfb6"}, {"text": "TikTok", "value": "/g/11fy265933"}, {"text": "Ubisoft", "value": "/m/02qdyj"}, {"text": "Cognizant", "value": "/m/03bf9h"}, {"text": "HCL SINGAPORE PTE. LTD.", "value": "/g/11fy25ngsv"}, {"text": "Oracle", "value": "/m/05njw"}, {"text": "Credit Agricole Group", "value": "/m/028vbm"}, {"text": "Mindteck (India) Limited", "value": "/m/0cqj8w1"}, {"text": "Nanyang Technological University", "value": "/m/0l49k"}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Zühlke Group", "value": "/g/1hh_rg216"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Avensys Consulting Pte Ltd", "value": "/g/11g7022gjf"}, {"text": "Avnet", "value": "/m/0c8xmc"}, {"text": "GlobalTix Pte Ltd", "value": "/g/11dxpqdhrf"}, {"text": "Government Technology Agency", "value": "/g/11gh0528nq"}, {"text": "J.P.Morgan", "value": "/m/01hlwv"}, {"text": "Optimum Solutions (Singapore) Pte Ltd", "value": "/g/11g70hkrbx"}, {"text": "Razer Inc.", "value": "/m/075hc0"}, {"text": "Realtek Malaysia", "value": "/m/05wrm7"}, {"text": "Realtek Singapore Private Limited", "value": "/g/11g9n26trs"}, {"text": "Success Human Resource Centre Pte Ltd", "value": "/g/11g709_209"}, {"text": "TECHNOPALS PTE. LTD.", "value": "/g/11dxpvkynp"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "UST", "value": "/m/08kb8g"}, {"text": "UrbanFox", "value": "/g/11ghs7y0w6"}, {"text": "Adecco GS", "value": "/m/08gz46"}, {"text": "Alphanova Pte. Ltd.", "value": "/g/11f8h_czps"}, {"text": "BioMind", "value": "/g/11dymfr2l6"}, {"text": "Biqmind", "value": "/g/11g21fzhrb"}, {"text": "BitTitan", "value": "/g/11dxpksv89"}]}]}