{"search_metadata": {"id": "60827a6e303eb14b8c14e4ac", "status": "Success", "json_endpoint": "https://serpapi.com/searches/c7c53e9ecca4ea80/60827a6e303eb14b8c14e4ac.json", "created_at": "2021-04-23 07:42:38 UTC", "processed_at": "2021-04-23 07:42:38 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28data+analyst%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=110", "raw_html_file": "https://serpapi.com/searches/c7c53e9ecca4ea80/60827a6e303eb14b8c14e4ac.html", "total_time_taken": 2.4}, "search_parameters": {"q": "(data analyst) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "110"}, "jobs_results": [{"title": "Business Analyst (BB-D9DBB)", "company_name": "DYSON OPERATIONS PTE. LTD.", "location": "Singapore (+1 other)", "via": "via BeBee", "description": "Roles & ResponsibilitiesDyson Global ITAt Dyson, we demand the highest standard of performance from the technologies we engineer. Our people expect the same from the technology that supports them. We are a community that appreciates and advocates better engineering. A community of pioneers.Dyson IT are mid-transformation. Our aim, to create robust IT architecture, to manage data effectively and efficiently and continue to grow our world-class team. A team who is strategic, enabling business acceleration, growth and success.Our Application Business Services TeamDyson’s Global IT applications service has end to end accountability for the design, delivery and support of all business applications enabling Dysons global commercial, operational and enterprise business process. Forming a large proportion of the IT Function, the team are arranged into investment areas including Owner Experience & Retail, Supply Chain, Manufacturing, Finance & compliance and People and collaboration. About the... roleReporting to the Business Analyst Lead, you will be responsible for: Supporting analysis activity in order to elicit requirements and inform business decisions. Supporting the implementation of information system and enhancements in line with business need and aiding benefits realisation. Investigating, analysing and reviewing project or business documentation. Supporting the definition of requirements for improving processes and systems. Supporting the creation and iteration of acceptance criteria in preparation for the deployment of information and communication systems. Producing business models and assisting in the development of business cases. Working independently or collaboratively on complex situations and tasks. Providing specialist advice on subject to multiple stakeholders on complex issues. Acting as a role model and/or coach to Associate Business Analysts. Core Competencies (SFIA):Business analysis - BUAN – Level 4 Investigates operational requirements, problems, and opportunities, seeking effective business solutions through improvements in automated and non-automated components of new or changed processes. Assists in the analysis of stakeholder objectives, and the underlying issues arising from investigations into business requirements and problems, and identifies options for consideration. Works iteratively with stakeholders, to identify potential benefits and available options for consideration, and in defining acceptance tests. Requirements definition and management - REQM – Level 3 Defines scope and business priorities for small-scale changes and may assist in larger scale scoping exercises. Elicits and discovers requirements from operational management and other stakeholders. Selects appropriate techniques for the elicitation of detailed requirements taking into account the nature of the required changes, established practice and the characteristics and culture of those providing the requirements. Specifies and documents business requirements as directed, ensuring traceability back to source. Analyses them for adherence to business objectives and for consistency, challenging positively as appropriate. Works with stakeholders to prioritise requirements. Business Modelling – BSMO – Level 3 Conversant with techniques covering full range of modelling situations. Models current and desired scenarios as directed. Selects appropriate modelling techniques for meeting assigned objectives. Gains agreement from subject matter experts to models produced. Reviews resulting models with stakeholders and gains resolution to resultant issues. Data Analysis – DTAN – Level 3 Applies data analysis, data modelling, and quality assurance techniques, based upon a detailed understanding of business processes, to establish, modify or maintain data structures and associated components (entity descriptions, relationship descriptions, attribute definitions). Advises database designers and other application development team members on the details of data structures and associated components. About youEssential: Years (>2) of broad practical experience in the role, with repeated practice performing business analysis in a variety of complex situations. Knowledge requirements: Deep functional SAP PP, MES knowledge and machine integration via OPC UA or TCP/IP Once embedded, will typically demonstrate good Domain and/or System knowledge inside own area. Minimal Domain and/or System knowledge outside of own area. Awareness of the wide range of activities performed by BAs. Can cope with complex cases through deliberate analysis and planning. Can achieve excellent results on small, less complicated work without supervision. Project implementation via Agile or waterfall or hybrid and enhancement process. Desirable: Relevant professional qualifications; including either: BCS International Diploma in Business Analysis, or IIBA Level 3 Certified Business Analysis Professional (CBAP) A willingness to work towards more advanced Qualification such as: BCS Advanced International Diploma in Business Analysis Experience of working in matrix structures, with cross functional teams and operating under both line reporting and project task managers Experience of working in Agile / scrum framework environments Has experience with S/4 Hana implementation. FMCG industryTell employers what skills you haveAgile & Waterfall MethodologiesBusiness AnalysisCommunication SkillsInformation TechnologyManagementMESProcess ImprovementProject ManagementRequirements AnalysisRequirements GatheringSAPSAP PPStakeholder EngagementStakeholder Management", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJCdXNpbmVzcyBBbmFseXN0IChCQi1EOURCQikiLCJjb21wYW55X25hbWUiOiJEWVNPTiBPUEVSQVRJT05TIFBURS4gTFRELiIsImNvbXBhbnlfbWlkIjoiL2cvMTFmeTI5bWM2ZyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6InhiWi1hMTZEV19zOUJCRE1BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVvd0NDc3dCUVU1VlgwNXhValJSWm1sb1EzSktVelo2UzFSdlQxcEhjalZHZDJaMmVtSkRTMDlpTTNOVVIxSTVla1pqTmtSSFVHTnRXVU4yTTJoV2NuSnBibEJMZG0xa01sWkxhMUpNVnpGc2NHNXFjRFZaTTIwd09FTm1ZMHBRWTJRelIyMU1hRWRKWWxodFRHZEtRV1JqZDJsdFRGZEhlRVppTkVGSlJFTjZXRFJZZDFGSlVtaENMVUpvV2tOcVMyeG1TV05WUlU1SFYxVmpTelpHV1dWeVRFeHZVakpFV0c5dFZISlJWMmwxYWxKVllrUkdha1l4WkV4MFQyNDVUamMyWDFSaVJsTkdZakpDTlhZdFVtWm9FaGRpTTNGRFdVdzJOVWhPWlhGM1ltdFFhRjlUTVdkQmN4b2lRVTlOV1ZKM1ExQm9WUzF4Umt0MWFHZHJabU4zYm5GWlZWUnRjRlJhTjNsMVp3IiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCZUJlZSIsImxpbmsiOiJodHRwczovL3NnLmJlYmVlLmNvbS9qb2IvMjAyMTA0MTctMDMwZTc4OTIxMGRiOWMzODRkNDc3MDQ2NmY0ZDlkYmI/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "VP - Avaloq Lead Developer - Group Consumer Banking and Big Data Analytics Technology - Technology and Operations", "company_name": "DBS Bank Ltd", "location": "Singapore", "via": "via Monster", "description": "Business Function\nGroup Technology and Operations (T&O) enables and empowers the bank with an efficient, nimble and resilient infrastructure through a strategic focus on productivity, quality & control, technology, people capability and innovation. In Group T&O, we manage the majority of the Bank's operational processes and inspire to delight our business partners through our multiple banking delivery channels.\nResponsibilities\n• Leading functional / technical streams in implementation of Avaloq Core Banking Platform\n• Analyzing requirements and designing / proposing software solutions\n• Writing business and technical specifications\n• Performing parameterization and customization of various core banking software modules\n• Providing technical expertise and support for internal and external stakeholders\n• Coaching team members and stream members\n• Assisting project / program managers in project planning & project strategies\n\nRequirements\n• Minimum 10 years of experience with Avaloq Core... Banking Platform\n• Participation in multiple Avaloq Core Banking Platform implementations in the business / technical streams\n• Avaloq Certification is a must\n• Ability to develop high level software designs and solutions\n• Excellent analytical skills and systematic approach to problem solving\n• Ability to articulate complex technical issues to business stakeholders\n• High customer orientation\n• Excellent interpersonal and communication skills with a good command of written and spoken English\n\nApply Now\nWe offer a competitive salary and benefits package and the professional advantages of a dynamic environment that supports your development and recognises your achievements.\nSingapore-DBS Asia Hub", "extensions": ["4 days ago", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJWUCAtIEF2YWxvcSBMZWFkIERldmVsb3BlciAtIEdyb3VwIENvbnN1bWVyIEJhbmtpbmcgYW5kIEJpZyBEYXRhIEFuYWx5dGljcyBUZWNobm9sb2d5IC0gVGVjaG5vbG9neSBhbmQgT3BlcmF0aW9ucyIsImNvbXBhbnlfbmFtZSI6IkRCUyBCYW5rIEx0ZCIsImNvbXBhbnlfbWlkIjoiL20vMDFxN241IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiUm5Vem5UWnlpVkpTWXNxZkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVJQkNxSUJRVTVWWDA1eFUzaGxSbFV5VGtSWWRtMTFORTR5VG5sT05HNUVjVTFHTVU5Q1pUUlNWbFZxTjJSWWRGY3laRzFPUTNoeWNubzNhMmhaTVhoTVdVMHlNbWhUTUdWWFpHMHdOR2hyU3kwNFpFUjNTa014WHkxV01ISkNhekZhVlhOalZXb3lRM0pGZURSS1ZrRjZTV0owUkZCMVgxSkpjalpmVVd4U2JGRTRTMU5rYkcweVREbGhWbFZVU0MxV0xVdDBTalJZUkcwemEwRnpVRTkxUWt4T1dFWjNFaGRpTTNGRFdVdzJOVWhPWlhGM1ltdFFhRjlUTVdkQmN4b2lRVTlOV1ZKM1FqWmtaa3RtWDFvd1drMW5aMncwTkdKdWRUbEpZa1l4TmxRdGR3IiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMTMiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTW9uc3RlciIsImxpbmsiOiJodHRwczovL3d3dy5tb25zdGVyLmNvbS5zZy9qb2IvdnAtYXZhbG9xLWxlYWQtZGV2ZWxvcGVyLWdyb3VwLWNvbnN1bWVyLWJhbmtpbmctYW5kLWJpZy1kYXRhLWFuYWx5dGljcy10ZWNobm9sb2d5LXRlY2hub2xvZ3ktYW5kLW9wZXJhdGlvbnMtZGJzLWJhbmstbHRkLXNpbmdhcG9yZS0zMDM4OTQ2P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Data Scientist", "company_name": "Neuroglee Therapeutics", "location": "Singapore (+1 other)", "via": "via Glassdoor", "description": "Neuroglee is a venture-backed digital health startup that is on a mission of reimagining care for patients living with neurodegenerative diseases. By combining best-in-class cognitive rehabilitation strategies and digital biomarkers, we build evidence-based precision digital therapeutics for neurodegenerative diseases. Our lead investigational product, NG-001 is intended for the symptomatic treatment of Alzheimer's disease/MCI. For more information, please visit www.neuroglee.com.\n\nWe are looking for an excellent Data Scientist for our team. He would be responsible for handling the development of an AI analytics engine for our product (Mobile/Tablet – platform) and needs to work closely with Data Engineers, Neuro-scientists, and cross-technology teams. He would be contributing to the development of our digital therapeutics product NG-001.\n• Design, implement, and maintain the State-of-Art algorithms and create an AI analytics engine.\n• Help in writing patents/research papers on the... developed algorithms.\n• Work closely with Data Engineers and evaluate the whole architecture to ensure the functionality & quality of the AI analytics engine\n• Document the application code scripts, including, drafts, revisions, and final directions.\n\nRequirements\n\nOur Ideal Candidate\n• Bachelors, Masters, or Ph.D. in Computer Science, or related fields.\n• 4+ years of prior experience as a Data Scientist or in similar roles.\n• Solid experience with one or more languages - C/C++, Python, and frameworks like Django or Flask.\n• In-depth knowledge of statistics, machine learning, and deep learning with one or more of its frameworks like Tensorflow, Pytorch, Caffe or Mxnet, and libraries.\n• Proven experience in Computer Vision or Natural Language Processing projects.\n• Exposure to CUDA programming and GPU technology\n• Expert knowledge of data structures, data modelling, and software architecture.\n• Experience with cloud infrastructure like AWS, GCP, Azure.\n• Solid understanding of relational databases (e.g., MSSQL, MySQL) and experience in NoSQL (e.g., GraphDB, MongoDB).\n• Familiar with Big Data Technologies.\n• Published research articles or written technical blogs on Deep learning\n• Quickly picks up new technologies and passionate about solving problems.\n• Experience supporting and working with cross-functional teams in a dynamic environment.\n• Ability to work independently.\n• Proven experience and knowledge of working in an Agile approach and SDLC.\n• Experience with CI/CD and tools like Git, Mercurial, Jenkins.\n\nWays to Outstand from Crowd\n• Rank holder in Kaggle competitions or having an active GitHub account with shareable contributions.\n• Prior experience in the biotechnology, bioinformatics, or healthcare industry, especially the Neuroscience field.\n• Experience with containers like Dockers and Kubernetes.\n• Experience with real-time/static streaming data pipelines such as Kafka.\n• AWS Certified Solution Architect or AWS Certified Machine Learning.\n• Excellent verbal and written communication in the English language.\n• Experience with Jira/Confluence.\n\nBenefits\n\nWe strive to make your life outside work as smooth as possible while you are at work, and we offer a long list of benefits to make that happen.\n• Competitive salary and AWS\n• Generous annual leave policy\n• Coverage for medical, dental, and vision\n• Stocked kitchen\n• A supportive, collaborative group of people who understand that success depends on the team\n\nNeuroglee Therapeutics is an equal opportunity employer and will not discriminate against any employee or applicant on the basis of age, color, disability, gender, national origin, race, religion, sexual orientation, veteran status, or any other classification protected by federal, state, or local law", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEYXRhIFNjaWVudGlzdCIsImNvbXBhbnlfbmFtZSI6Ik5ldXJvZ2xlZSBUaGVyYXBldXRpY3MiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjVXbzZWcUg5TEdfcFdUeGlBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gR2xhc3Nkb29yIiwibGluayI6Imh0dHBzOi8vd3d3LmdsYXNzZG9vci5zZy9qb2ItbGlzdGluZy9kYXRhLXNjaWVudGlzdC1uZXVyb2dsZWUtdGhlcmFwZXV0aWNzLUpWX0lDMzIzNTkyMV9LTzAsMTRfS0UxNSwzNy5odG0/amw9NDAxOTY4MzYzNFx1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Analyst / Senior Analyst, Financial Information Department (BB-C5946)", "company_name": "Accounting and Corporate Regulatory Authority", "location": "Singapore", "via": "via BeBee", "description": "At ACRA, we make Singapore a trusted and best place for business. Our people are proactive self-starters, empowered to create value and grow their careers in an environment that fosters trust and respect. Join us to make a difference! We now have the following exciting career opportunity available. You may also visit our career page at to find out more about other career opportunities. As a member of the Financial Information Department, you will play a key role in creating a progressive and forward-looking financial reporting ecosystem in Singapore.Key responsibilities Assist with the development of medium and long-term roadmap for the filing and consumption of companies’ financial data in Singapore. The roadmap should consider global developments and the relevant digital solutions that could improve the productivity of the financial reporting value chain.Continuously improve ACRA BizFinx system, to enable seamless preparation and filing of accurate financial data in XBRL format... This will include: balancing the information needs of data consumers and the compliance burden on preparers to prepare data for filing;initiating and driving system enhancements for smooth user experience;building a system using machine learning to detect inaccurate financial data filed by companies;automating the enforcement action to deter inaccurate filing; andconducting root cause analysis of inaccurate filing and initiating actions to prevent recurrence. Accelerate the integration of ACRA filing requirements into companies’ accounting systems. This will include working closely with stakeholders, such as preparers, accounting software vendors and other government agencies, to enable automated preparation and seamless filing of financial data from companies’ accounting systems to ACRA.Administer the exemption from the financial reporting requirements in Companies Act, balancing between the need to uphold equal parity, while addressing the constraints faced by the companies.Embrace design thinking, data analytics and digital solutions to continually streamline our work processes and serve our customers better. Training will be provided. Requirements: Have the passion and interests to be a part of the team that drives improvements to the financial reporting value chain in SingaporeProfessional qualification / certification in Accountancy, Computer Science, Information Technology (IT) or related fieldsStrong interest in embracing relevant technologies and a firm believer in delivering improvements. Hands-on experience in system implementation will be a plus. Reliable, independent and driven by challenges in a fast-changingenvironment.Excellent stakeholder management skills, with the ability to translate their needs into deliverables Applicants will be notified on whether they are shortlisted within 4 weeks of the closing date of this job posting", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBbmFseXN0IC8gU2VuaW9yIEFuYWx5c3QsIEZpbmFuY2lhbCBJbmZvcm1hdGlvbiBEZXBhcnRtZW50IChCQi1DNTk0NikiLCJjb21wYW55X25hbWUiOiJBY2NvdW50aW5nIGFuZCBDb3Jwb3JhdGUgUmVndWxhdG9yeSBBdXRob3JpdHkiLCJjb21wYW55X21pZCI6Ii9tLzA5ZzdfYjMiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJ0UWZlT0U3VFFVcUFDS3ZqQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFc3dDQ293Q1FVNVZYMDV4VTNSbGFVRkRNMU14WjFGMk5FZFRRakJXTmtacmJFNVpOVFI1T1VveGVDMWtOWEV4V1VkR05tOHpjVmM1VG5Od01tWmhXRzlvUmkwM05FaGFjWGN3TFZNNUxWWnJWMk5pVm05SlFWUmhObTFGZUZSWFZHUmxlWEoxVkhoNFExOVlZbVU0ZWpWbmVISldiVlpuWTNGa04yZENkRlJHUkdaMldUSjNNVFpXVWw5V2VIVjNXR2RNVVdsNFZYbFdkVVZwVlVsRVgwOXhTWGhYWnpaNlNUZGFaWFZ2VDFSU05GZEdXa2xQUzJ4TVZHRlZXSFJ2UmxwVE9GQmpSRzFyUW5Kb2NXazVSSG94ZVVSbFYwOHhhMVo1VG1KS1lVdzVTazU1ZVVWcVVreFpiblp3V201S1dYTk5hVE5WUVdZeE5EZFFUblZtV0dOQlEwUmFXbmt0TTBaR1RWTk9SbGRxTkJJWFlqTnhRMWxNTmpWSVRtVnhkMkpyVUdoZlV6Rm5RWE1hSWtGUFRWbFNkME5CWlRCdlZqZE5SRkZ6ZG1WUFJsTTBTREZyZW1aV01VZGphVkUiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18yNCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCZUJlZSIsImxpbmsiOiJodHRwczovL3NnLmJlYmVlLmNvbS9qb2IvMjAyMTA0MTctNmY1Yjc1YTQ0MzU2Zjc5ODZmMjA2YjI5MzU3YzU5NDY/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Market Data Business Analyst", "company_name": "Goldman Sachs Services Private Limited", "location": "Singapore", "via": "via Recruit.net", "description": "Job Description : MORE ABOUT THIS JOB YOUR IMPACT The Market Data Business Analyst team at Goldman Sachs are responsible for coordinating with internal business teams on the selection of products and ongoing management of the Firm's market data spend with third party vendors. The team provide guidance to internal users on data services appropriate for specific roles, coordinate expense management initiatives and provide data analytics to enable users to manage costs effectively. The role provides the opportunity to directly contribute to managing the firms operating costs by building data analytics and automated workflow that help end-users to manage their market data subscriptions effectively. You will be responsible for developing data collection, modelling and visualization analytics that correlate usage with user inventories. The role will provide the opportunity to partner with divisional management and business unit leadership teams to implement expense management initiatives... RESPONSIBILITIES AND QUALIFICATIONS HOW WILL YOU FULFILL YOUR POTENTIAL You will thrive in a work environment that requires strong problem solving skills and independent self-direction, coupled with an aptitude for team collaboration and open communication Driving strategic initiatives and deliver key programs of work across Market Data and the broader division Your detailed knowledge of market data vendor products and an understanding of the Goldman Sachs business functions will enable you to formulate strategies to reduce operating expenses Building data analytics using popular storage and visualization technologies to empower market data users to manage their costs Interface with divisional leadership and front office users to implement expense management initiatives Continually evaluate the vendor landscape to identify new offerings that may increase value and efficiency for our employees who require access to market data BASIC QUALIFICATIONS 2 years minimum experience in Market Data Python and SQL programming skills Experience of publishing and modeling data with distributed storage platforms such as Hadoop Experience with using visualization software (Tableau, Qlikview or equivalent) Japanese language PREFERRED QUALIFICATIONS FISD's Financial Information Associate certification Proficient use of tier 1 market data vendor desktop software General understanding of the capital markets Experience of the MDSL MDM inventory system Job Description : MORE ABOUT THIS JOB YOUR IMPACT The Market Data Business Analyst team at Goldman Sachs are responsible for coordinating with internal business teams on the selection of products and ongoing management of the Firm's market data s Experience: 2.00-5.00 Years", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJNYXJrZXQgRGF0YSBCdXNpbmVzcyBBbmFseXN0IiwiY29tcGFueV9uYW1lIjoiR29sZG1hbiBTYWNocyBTZXJ2aWNlcyBQcml2YXRlIExpbWl0ZWQiLCJjb21wYW55X21pZCI6Ii9nLzExZzltbTV0em4iLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiI2VzI3enB1RWNkUGRTUXozQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFcmNDQ3ZjQlFVNVZYMDV4VVdoVlZXczNVMWhVUjI1TGJWVkpXazl3Y1dWU2RuUktVbGhsTW5OYU9EZDVlRVZwVTFWMGJFMVBObVoyV21oMlFtWXdjRE5tY0hKc2RtazFNR1paVWtWbU1URkNPV1ZmZDFKQ2FXeGFjV0ZVZW01S2NqaHNNR3gwTVhsaVp6bEpiWGhvVUVoV1dtcFBTRFJZWTJ3eFpXUXdWVmhNY3pCTlZGTjNSbEZKT1VocVprUk1RM2RHVmpneVRFZE5VbHBQUVZKamVVOUlaMHhKWTB0b1dUZzJOVUp0YUZOb2JtODFTRTlQWkc4MlVqWm9jMU5CYlRSWVZYQnJlbXBwWm01RVNuVTJabmRrT0hCRmFrRklhbFI0VFd3MmEwcERhVzVFYUc1RFZXaG5OMXBEUmxWeGQxZFpiVTFVVkZCa1JrNWxPQklYWWpOeFExbE1OalZJVG1WeGQySnJVR2hmVXpGblFYTWFJa0ZQVFZsU2QwUnZaR3hXVmxaUFpHZHNRVGd0YUVaWFIzbDJabTlCUkdwbFIwRSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzMyIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFJlY3J1aXQubmV0IiwibGluayI6Imh0dHBzOi8vd3d3LnJlY3J1aXQubmV0L2pvYi9idXNpbmVzcy1hbmFseXN0LWpvYnMvN0Q0M0U0RDY0M0FGREFCRD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "NEXTDIGITAL2020 - Senior - Technical Project Manager - Data Analytics", "company_name": "SingTel", "location": "Singapore", "via": "via Monster", "description": "Job Description :\nAbout NCS\nNCS is a leading information and communications technology (ICT) and communications engineering services provider across the Asia-Pacific region. We are headquartered in Singapore and a wholly owned subsidiary of the Singtel Group. We have in-depth domain knowledge and unique capabilities that create business value for customers. We offer a broad range of services, including consulting, systems development and integration, business process outsourcing, infrastructure management and solutions, and technology solutions.\nWhat is the opportunity?\nNCS is seeking a Project Manager with Data Analytics focus! You will identify and translate market and business opportunities for our clients into actionable recommendations for the organisation. You will lead the design, development and delivery of complex digital analytics projects from initiation to closure. To achieve this, you will need to be a leader who can articulate a compelling vision to your client and team... and sure that this vision is delivered through all stages of the project.\nYou should also have a healthy appetite for exploring new technology and developing business cases to support enterprise wide data analytics solutions.\nWhat will you do?\n• Oversee the implementation of data analytics strategy for a client organisation, and develop new service offerings\n• Client-facing interaction including providing analyses, recommendations, presentations and advice to clients\n• Lead the day-to-day activities of the delivery teams through the developing, establishing and maintaining project management standards and procedures. Adapts existing methods and procedures to create possible alternative solutions to moderately complex problems\n• Lead interdisciplinary teams that combine technical, business and data science competencies that deliver work in waterfall or agile software development lifecycle methodologies\n• Understands the strategic direction set by senior management as it relates to team goals\n• Uses considerable judgment to determine solution and seeks guidance on complex problems\n• Manage the timely reporting of data analysis outcomes and effectively communicates findings, insights and recommendations to business leaders using data metrics on top of standard project management measures such as data quality and model accuracy\n• Oversee team management including budgets, forecasting, work allocations and staffing\n• Drive effective performance management practices within the department in accordance with organisation policies and procedures\n\nWhat do you need to succeed?\n• Possess good communications skills to understand our customers core business objectives and build end-to-end data centric solutions to address them\n• A data analytics professional should have a deep passion for analysing and resolving complex problems through a systematic approach to deliver business outcomes. He displays an intellectual curiosity as well as the capability to engage with stakeholders to understand business issues.\n• Good critical thinking and problem-solving abilities, with curiosity to ask why and tenacity to find the root causes\n• Stay up to date with evolving analytics concepts and techniques including team management and project management processes\n• Ability to work independently and manage multiple tasks and projects\n\nMust-have:\n• Minimum of Bachelor's Degree required in related field; strong preference for fields of study in the engineering, computer science, statistics or analytics\n• The successful candidate needs to have either\n• more than 2 years of experience leading an Analytics consulting team OR\n• experience with leading one or more MNCs through the journey to becoming a data-driven organization. OR\n• More than 5 years of experience implementing a broad range of Analytics/Business Intelligence projects such as:\n• Data Governance and Management\n• visualizing KPIs on business dashboards\n• applying advanced analytics/data science techniques to realize business values\n• The right candidate will need to have hands-on experience with one or more of the following Analytics technology stacks as well as familiarity with a broad range of solutions for visualization, advanced analytics, data ingestion/transformation, storage and hosting and willingness to learn new ones on the job.\n• Data Management & Storage: Informatica, Oracle Data Warehousing, IBM InfoSphere, Microsoft SQL Server, Hortonworks Data Platform, Cloudera, SAS\n• Data Visualisation: Tableau, Qlik, Microsoft PowerBI, Oracle Business Intelligence Enterprise, IBM Cognos, MicroStrategy, SAS etc\n• Statistical/Data Science Tools: SPSS, R, Python, Anaconda distributions, Jupyter\n• Experience working with Singaporean clients, the Singapore government, familiarity with GDPR in Europe, PDPA in Singapore will be an advantage\n• Project management certifications such as PMP, Agile, ITIL, Scrum Master\n\nNice to have:\n• Knowledge in database modelling and data warehousing concepts\n• Appreciation of software engineering tools such as Java, .NET, or higher-level programming languages\n• Exposure in artificial intelligence – machine learning, deep learning, reinforcement learning\n• Experience in implementing Graph database analytics\n• Certification and applied experience in cloud-based analytics platforms such as:\n• Microsoft Azure Analytics\n• Amazon Web Services Analytics\n• Google Cloud Platform Analytics", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJORVhURElHSVRBTDIwMjAgLSBTZW5pb3IgLSBUZWNobmljYWwgUHJvamVjdCBNYW5hZ2VyIC0gRGF0YSBBbmFseXRpY3MiLCJjb21wYW55X25hbWUiOiJTaW5nVGVsIiwiY29tcGFueV9taWQiOiIvbS8wMjB6ZmwiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJuVGZneUpoWE1GZzZUM1ZWQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFc3dCQ293QlFVNVZYMDV4VVVGcmFuSmliamhXVEZoNE5ubEtVbk5GVGpsblp6TTNWbE5yWVVaMU5WZHllR1pwVEZaaFFtcHFiSGRaYlZZMk4yeGtTVFpuWkU1YWNrWTJVWFJ3Wld4RmFIUlRaV2M0VVhZM2FHdFlPVTFTT1ZGUmJqSlpNekpRZEVaWlZHeHhVbWRHZDNaS2FGOHpabmhIVkZnelJrSktWVWhsZFVSVU9VMDFjbE14TW5sMGJWQldhRTRTRjJJemNVTlpURFkxU0U1bGNYZGlhMUJvWDFNeFowRnpHaUpCVDAxWlVuZEJkbmt0VWpZd1NUWXhaV1JLYjNCMlMzSTRhV3BZVDE4dFZFSlIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY180MCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNb25zdGVyIiwibGluayI6Imh0dHBzOi8vd3d3Lm1vbnN0ZXIuY29tLnNnL2FtcC9qb2ItdmFjYW5jeS0tbmV4dGRpZ2l0YWwyMDIwLXNlbmlvci10ZWNobmljYWwtcHJvamVjdC1tYW5hZ2VyLWRhdGEtYW5hbHl0aWNzLXNpbmd0ZWwtc2luZ2Fwb3JlLTI2NTM4NTQ3Lmh0bWw/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Senior Compensation & Benefits Analyst, APAC", "company_name": "Tech Data Corporation", "location": "Singapore", "via": "via Glassdoor", "description": "Purpose of the Job\n\nAs a Senior Compensation & Benefits Analyst in the global Center of Excellence, you will be responsible for providing all C&B programmatic and project support for the APAC region, with key focus on driving efficient Bonus/ Incentive Compensation administration process for the region. This role plays a strong part in supporting our transformation journey to drive high standard of service delivery and employee experience.\n\nOrganizational Relationship\n\nDIRECT REPORT TO : Compensation & Benefits Director, APAC\n\nKEY STAKEHOLDERS : Business Leaders, HR, Finance, global C&B team\n\nPrincipal Responsibilities\n• This position provides technical, analytical and administrative support to business leaders and HR Business Partners in the areas of job and compensation review, specifically in compensation surveys, job classification and mapping and internal equity analysis.\n• Incumbent is expected to provide on-time support to drive seamless coordination and execution of the annual... common merit increase process as well as all incentive communication and payment processes.\n• Assists HR and business managers in creating job descriptions/job questionnaires to support job evaluation process.\n• Supports the ongoing harmonization of bonus plans and any other Compensation analysis and benchmarking work as required within the region.\n• Works closely with manager to support all M&A activities by applying Tech Data compensation and benefits philosophy where possible.\n• Support HR teams in all country benefits review in line with global initiatives and in coordination with external vendors.\n• Work closely in partnership with global C&B colleagues to support project initiatives and drive consistent communications in APAC region.\n• Drive process improvement in all daily activities through automation and/or standardization.\n\nVariable Incentive Operations (APAC)\n• Partners with system vendor to drive on-time execution of annual goal setting and quarterly accurate incentive calculation/payout.\n• As a regional resource and administrator, work with Sales / BU and Finance leadership to coordinate SIP process from end to end.\n• Governs sales incentive plan criteria efficiently through streamlined process, escalates to the appropriate parties for exception approvals.\n• Works with country HR and Finance teams to deliver incentive compensation calculations within business mandated and payroll timelines.\n• Develop periodic reports with performance analytics for Sales Management review.\n• Validates and drives effective employee communications on payments made.\n• Ensures accurate data is provided for system to perform quarterly and annual analysis of sales incentive payment results.\n• Contributes to annual sales incentive plan reviews in partnership with regional Compensation and Finance leaders to ensure competitive plan design.\n• Support the harmonization of all bonus plans and any other Compensation analysis and benchmarking work as required within the region.\n\nQualifications & Experience\n\nAcademic qualifications:\n\nDegree qualified in Business Administration or HR Management, with relevant certification in Compensation will be advantageous.\n\nExperience:\n\nMinimum 5 years’ of relevant experience, preferable in an MNC environment. Broad based experience in HR with deep knowledge of Compensation analysis and administration.\n\nSkills:\n\nGood problem solving, analytical and project management skills. Able to apply C&B skills in a flexible way to meet different business requirements. Proactive and creative mindset to drive continuous improvement. Detail-oriented, process driven and meticulous with data. Ability to work independently and under pressure with limited supervision. Possess a proactive and “can-do” attitude, receptive to change. Strong interpersonal and communication skills. An excellent team player with good stakeholder management skills. Proficient in automated tools/platforms and MS office, especially in MS Excel.\n\nCultural Competency Requirements:\n• Within Tech Data diversity is one of our fundamental shared values. We are a multi-cultural environment and we pride ourselves on being a welcoming place of work where we celebrate inclusion and champion people from a multitude of backgrounds.\n\nJoin our team to connect the world with the power of technology", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQ29tcGVuc2F0aW9uIFx1MDAyNiBCZW5lZml0cyBBbmFseXN0LCBBUEFDIiwiY29tcGFueV9uYW1lIjoiVGVjaCBEYXRhIENvcnBvcmF0aW9uIiwiY29tcGFueV9taWQiOiIvbS8wM3AzbDZxIiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiOUwxYU5iM2wzVFZoYWNQWUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZjQkNyY0JRVTVWWDA1eFZEWnljVXROVlVWTWNWWkdabVpyVnpWR1VVSlJTWEZuWjIxdldUazJZMVZVWVY5NlltTlZhbFZQUjJoWFNWSXRaakpyV21RelZrRTBkM2huZFdrMFkxUk9TRFpzVG5sRVFscGxVMVpVZFd0SVNuUmlhVFUxYUZOSFgyZHVXREJCUlVNdFgxVkJZVFV0ZEdGM1pHUlJkRlpWY2xkeVdWZHFXV3M0TmpKQmIwWjVXR3hLUlcxclltOXFjamt4U2paT2MzQkhjV3BEWkRoUlYwcGxhWGs0U0RSaGFsTnhWa3BuYjJWSVMwRlVlRk4zRWhkaU0zRkRXVXcyTlVoT1pYRjNZbXRRYUY5VE1XZEJjeG9pUVU5TldWSjNRelJqVXpKWGJqa3dNRm95Y0Vad1RuVnNRMlYzYkRsaFdUWmtadyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzQ4IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEdsYXNzZG9vciIsImxpbmsiOiJodHRwczovL3d3dy5nbGFzc2Rvb3Iuc2cvam9iLWxpc3Rpbmcvc2VuaW9yLWNvbXBlbnNhdGlvbi1iZW5lZml0cy1hbmFseXN0LWFwYWMtdGVjaC1kYXRhLWNvcnBvcmF0aW9uLUpWX0lDMzIzNTg5NV9LTzAsNDFfS0U0Miw2My5odG0/amw9NDA0MDU0NTc1NVx1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Senior Associate / Associate, Data Engineer, Group Consumer Banking and Big Data Analytics Technology, Technology & Operations", "company_name": "DBS Bank Limited", "location": "Singapore", "via": "via Laimoon.com", "description": "Business Function\n\nGroup Technology and Operations (T&O) enables and empowers the bank with an efficient, nimble and resilient infrastructure through a strategic focus on productivity, quality & control, technology, people capability and innovation. In Group T&O, we manage the majority of the Bank's operational processes and inspire to delight our business partners through our multiple banking delivery channels.\nAs a Data Engineer, you'll be a Data Engineering Specialist and help us discover the information hidden in vast amounts of data. You'll be part of the team which builds a hybrid cloud data platform that supports dynamical data replication across different environments and leverages cloud-native technologies.\nResponsibilities\n• Design and implement key components for highly scalable, distributed data collection and analysis system built for handling petabytes of data in the cloud and on-premises.\n• Work with architects of the analytics system and help in adopting best practices... in backend infrastructure and distributed computing.\n• Implement core practice of Agile, leveraging cloud-native architecture patterns and using Test Driven Development, continuous integration/continuous delivery\n• Continuously discover, evaluate and implement new cloud technologies to maximize analytical system performance\nRequirements\n• 3+ years of experience in one or more areas of big data and/or cloud0native application development\n• Development experience in Java and pride in producing clean, maintainable code. Knowledge of reactive programming and related frameworks would be an advantage.\n• Experience using AWS/GCP managed services (especially those related to data processing and data movement)\n• Hands-on experience with Test Driven Development methodology\n• Familiarity with operational technologies, including k8s, docker, ZooKeeper,\n• Experience with Spark and different schema formats (Avro, Parquet, Carbondata)\n• Experience using high-throughput, distributed message queueing systems such as Kafka.\n• Familiarity with tracing/observability solutions, e.g. OpenTracing, OpenTelemetry, Zipkin\n• An ability to periodically deploy systems to on-prem/cloud environments\n• Mastery of key development tools such as GIT, and familiarity with collaboration tools such as Jira and Confluence or similar tools.\n• Experience with distributed databases, such as Cassandra, and the key issues affecting their performance and reliability.\n• Experience with SQL engines (e.g. MySQL, PostgreSQL)\n• The ability to work with loosely defined requirements, and exercise your analytical skills to clarify questions, share your approach and build/test elegant solutions in weekly sprint/release cycles.\nApply Now\nWe offer a competitive salary and benefits package and the professional advantages of a dynamic environment that supports your development and recognises your achievements. Technology", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQXNzb2NpYXRlIC8gQXNzb2NpYXRlLCBEYXRhIEVuZ2luZWVyLCBHcm91cCBDb25zdW1lciBCYW5raW5nIGFuZCBCaWcgRGF0YSBBbmFseXRpY3MgVGVjaG5vbG9neSwgVGVjaG5vbG9neSBcdTAwMjYgT3BlcmF0aW9ucyIsImNvbXBhbnlfbmFtZSI6IkRCUyBCYW5rIExpbWl0ZWQiLCJjb21wYW55X21pZCI6Ii9tLzAxcTduNSIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IkhyMmx1ejc2Q0MtRjNkZmZBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2Y0JDcmNCUVU1VlgwNXhVMjlGZFhKcVdtZHNiRVY2Y0hoSFNIaHlOVXh1TTNwNWVsOTVWREkyUjNaTWJVMXpMVlZJWjE5MVpqbHpiRjgzT0hrNUxUZDVSamN0TTFSMmNuVXpZVWQyU1dsT05HNXlSVlY0WjBoV01qQktVRmRxYVRoMVNWbzVhemhVTVdwellXWTJWalV4T1daNGNVeG1SM0IwTFc1blp6SnBUV3BITWt4aVF6TnZVbWh5VTE5alpVZGxOR2hOU0hWVVFtdzFOMkp1ZUdsRlZUTkZaV1pWWWs1dWMxQXdVa1p3YXpsdU4ycFJTMk5YY2s1bkVoZGlNM0ZEV1V3Mk5VaE9aWEYzWW10UWFGOVRNV2RCY3hvaVFVOU5XVkozUXpBeWVVSnZaak4zYkVVMk0yTjZiRE5wY0ZCRmFEZFFZVFkyWnciLCJmY3YiOiIzIiwiZmNfaWQiOiJmY181NiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMYWltb29uLmNvbSIsImxpbmsiOiJodHRwczovL2pvYnMubGFpbW9vbi5jb20vam9icy9leHRlcm5hbHZpZXcvMjU5ODU3OTk/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Business Analyst (BB-FAA83)", "company_name": "Dyson", "location": "Singapore", "via": "via BeBee", "description": "About the role Reporting to the Business Analyst Lead, you will be responsible for:Supporting analysis activity in order to elicit requirements and inform business decisions. Supporting the implementation of information system and enhancements in line with business need and aiding benefits realisation. Investigating, analysing and reviewing project or business documentation.Supporting the definition of requirements for improving processes and systems.Supporting the creation and iteration of acceptance criteria in preparation for the deployment of information and communication systems.Producing business models and assisting in the development of business cases.Working independently or collaboratively on complex situations and tasks.Providing specialist advice on subject to multiple stakeholders on complex issues. Acting as a role model and/or coach to Associate Business Analysts. Core Competencies (SFIA): Business analysis - BUAN – Level 4Investigates operational requirements... problems, and opportunities, seeking effective business solutions through improvements in automated and non-automated components of new or changed processes. Assists in the analysis of stakeholder objectives, and the underlying issues arising from investigations into business requirements and problems, and identifies options for consideration. Works iteratively with stakeholders, to identify potential benefits and available options for consideration, and in defining acceptance tests.Requirements definition and management - REQM – Level 3Defines scope and business priorities for small-scale changes and may assist in larger scale scoping exercises. Elicits and discovers requirements from operational management and other stakeholders. Selects appropriate techniques for the elicitation of detailed requirements taking into account the nature of the required changes, established practice and the characteristics and culture of those providing the requirements. Specifies and documents business requirements as directed, ensuring traceability back to source. Analyses them for adherence to business objectives and for consistency, challenging positively as appropriate. Works with stakeholders to prioritise requirements.Business Modelling – BSMO – Level 3Conversant with techniques covering full range of modelling situations. Models current and desired scenarios as directed. Selects appropriate modelling techniques for meeting assigned objectives. Gains agreement from subject matter experts to models produced. Reviews resulting models with stakeholders and gains resolution to resultant issues.Data Analysis – DTAN – Level 3Applies data analysis, data modelling, and quality assurance techniques, based upon a detailed understanding of business processes, to establish, modify or maintain data structures and associated components (entity descriptions, relationship descriptions, attribute definitions). Advises database designers and other application development team members on the details of data structures and associated components.About you Essential:Years (>2) of broad practical experience in the role, with repeated practice performing business analysis in a variety of complex situations.Knowledge requirements: Deep functional SAP PP, MES knowledge and machine integration via OPC UA or TCP/IPOnce embedded, will typically demonstrate good Domain and/or System knowledge inside own area. Minimal Domain and/or System knowledge outside of own area.Awareness of the wide range of activities performed by BAs.Can cope with complex cases through deliberate analysis and planning.Can achieve excellent results on small, less complicated work without supervision.Project implementation via Agile or waterfall or hybrid and enhancement process.Desirable:Relevant professional qualifications; including either:BCS International Diploma in Business Analysis, orIIBA Level 3 Certified Business Analysis Professional (CBAP)A willingness to work towards more advanced Qualification such as:BCS Advanced International Diploma in Business AnalysisExperience of working in matrix structures, with cross functional teams and operating under both line reporting and project task managersExperience of working in Agile / scrum framework environmentsHas experience with S/4 Hana implementation.FMCG industryBenefits Dyson monitors themarket to ensure competitive salaries and pension contributions. Beyond that,you’ll also enjoy a profit-related bonus, generous leave and life insurance.But financial benefits are only the start of a Dyson career. Rapid professionalgrowth, leadership development and new opportunities abound, driven by regularreviews and dynamic workshops. And with a vibrant culture, flexible workinghours, the latest devices and a relaxed dress code reflecting our engineeringspirit, it’s an exciting team environment geared to creativity, innovation andambition.#LI-DYSON", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJCdXNpbmVzcyBBbmFseXN0IChCQi1GQUE4MykiLCJjb21wYW55X25hbWUiOiJEeXNvbiIsImNvbXBhbnlfbWlkIjoiL20vMDVjc2tnIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiM1ZDNm5lYmptUVBQTlVkUUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXN3QkNvd0JRVTVWWDA1eFVXaDJhbE5qY0ZORWJsUnZWRlJaYjA0M01rdEdRVkZsYmt0Uk1GTnpaMlJsVWw5emJHSmlUSFU1YjA1VFlsZExUbEY1ZEd3NWVGRkJaMjE1YUZGdFltdzVUamh6WkZGQldqaGpSMUJaZEU1aWIwWmFhV2haVW5SMGVVbzBZakJoTmkxNGNsUmhSWE5qTUVGR2MwNVRYM1ZvWDFkbVZGaEJhM2h1TVZGS09YWkhibXAwZWxFU0YySXpjVU5aVERZMVNFNWxjWGRpYTFCb1gxTXhaMEZ6R2lKQlQwMVpVbmREZEROSlN6Z3liVWRUWmxCeGEzVkhRMWxuZFVoUVNWQkhlbUpCIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNjMiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQmVCZWUiLCJsaW5rIjoiaHR0cHM6Ly9zZy5iZWJlZS5jb20vam9iLzIwMjEwNDE3LWY1YmVlMGZlZDAzNWQxMTA3ZGIyNzRjYjdkYmZhYTgzP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "First VP - Innovation and Capabilities - Data Analytics - Modeling - T-O Governance and Assurance", "company_name": "United Overseas Bank Limited", "location": "Singapore", "via": "via Monster Singapore", "description": "Job Responsibilities\n• To be an innovative leader responsible for the creation of new data analytics and science capabilities in a first-line-of-defence risk and control function within Group Technology & Operations of a large and complex financial institution.\n• Envision and execute strategies that will improve visibility of risk insights and effectiveness of T&O risk assurance programs through process automation, influencing the early identification and management of emerging risks.\n• Proactively work with the T&O Risk Governance & Assurance function head, department heads and domain specialists within the function in order to provide advanced analytic data modeling systems for use cases.\n• Provide shared services to the larger T&O Risk Governance & Assurance function in the main overseas banking subsidiaries for use case data analytics and modelling deployment.\n• Design and launch innovative and complex analytic models, utilizing a blend of contemporary and traditional data mining... techniques, applied to both structured and unstructured data sets.\n• Responsible for overseeing activities of the data analyst ensuring proper execution of duties and alignment with the function’s overall vision.\n• Nurture data analytics skills within the risk and assurance teams.\n\nJob Requirements\n• A master’s degree in Statistics, Machine Learning, Mathematics, Computer Science, Economics, or any other related quantitative field. A working experience of the same is also acceptable for the position.\n• Be technologically adept and especially demonstrate an understanding of database and computer software, and to be highly proficient and experienced in scripting languages and have rapid prototyping skills, that is, fluency in SQL, Python, R, Java, VB, among others.\n• At least 7 years of working experience in a data science position, preferably working as a Senior Data Scientist.\n• Outstanding skills in the use of MS Word, MS Excel, PowerPoint, and Outlook, which will all be necessary for the creation of both visually and verbally engaging reports and presentations, for senior management, executives, and stakeholders.\n• Exceptionally good skills in SQL server reporting services, analysis services, Qliksense, Tableau, integration services, or any other data visualization tools.\n• Highly skilled in statistical and modeling packages such as SAS, Statistica, Matlab, R, visualization and other advanced analysis tools. He will also be an expert in data management programming such as SQL, PL-SQL, and Python as well as being familiar with the workings of time-series analyses.\n• Proven and successful track record of leading high-performing data analyst team through the successful performance of advanced quantitative analyses and statistical modeling that positively impact business performance.\n\nBe a part of UOB Family\nApply now and make a difference", "extensions": ["5 days ago", "Full–time"], "detected_extensions": {"posted_at": "5 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJGaXJzdCBWUCAtIElubm92YXRpb24gYW5kIENhcGFiaWxpdGllcyAtIERhdGEgQW5hbHl0aWNzIC0gTW9kZWxpbmcgLSBULU8gR292ZXJuYW5jZSBhbmQgQXNzdXJhbmNlIiwiY29tcGFueV9uYW1lIjoiVW5pdGVkIE92ZXJzZWFzIEJhbmsgTGltaXRlZCIsImNvbXBhbnlfbWlkIjoiL20vMDRnamQxIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoicDVvMFRlQVdvUUpTM3NBTkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRW93Q0Nzd0JRVTVWWDA1eFVtOXBPREpaTkVjNFVXRkZNa1ZVYUZkcGVERmxNMjVTVEZSck1FVlZjbEJJY3pkNFdGaG1ibTlCWm04MVppMDNSRVpTZVhCblFWSlRkVkpCZEhwNE1tMVlaR0pQYWpWUFpUSTNWVnBwUWpOVVZXWnBkbW8xZWt0TlpXNVhNWFZtV0MxbFV5MTViMjVqVjFaNFpYZDZhalZWVTJKSFJFMDFYMVZXZUdka2MyUnRXbkJwTVVsNVEwZ3pZMmxJT0hwVVdpMWtMVWh3U21sQk9EZGhOamxMUkVkVGIwVnJiWGxDTlhwdVJEUmFVbGMyWlROa1dGQjFWMUZUTjJ0WlJWTlRSWFphVmpVM0VoZGlNM0ZEV1V3Mk5VaE9aWEYzWW10UWFGOVRNV2RCY3hvaVFVOU5XVkozUXpGTlFsWXlWbkZWTFRSYVRua3dWVVp4TWs1a1RubFFkVmRmZHciLCJmY3YiOiIzIiwiZmNfaWQiOiJmY183MSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNb25zdGVyIFNpbmdhcG9yZSIsImxpbmsiOiJodHRwczovL3d3dy5tb25zdGVyLmNvbS5zZy9hbXAvam9iLXZhY2FuY3ktZmlyc3QtdnAtaW5ub3ZhdGlvbi1hbmQtY2FwYWJpbGl0aWVzLWRhdGEtYW5hbHl0aWNzLW1vZGVsaW5nLXQtby1nb3Zlcm5hbmNlLWFuZC1hc3N1cmFuY2UtdW5pdGVkLW92ZXJzZWFzLWJhbmstbGltaXRlZC1zaW5nYXBvcmUtMjY5NTc3ODUuaHRtbD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Business Operations", "value": "GC06"}, {"text": "Science and Engineering", "value": "GC27"}, {"text": "Management", "value": "GC18"}, {"text": "Accounting and Finance", "value": "GC01"}, {"text": "Advertising and Marketing", "value": "GC03"}, {"text": "Admin and Office", "value": "GC02"}, {"text": "Human Resources", "value": "GC15"}, {"text": "Legal", "value": "GC17"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Sales and Retail", "value": "GC26"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "Data analyst", "value": "data analyst"}, {"text": "Business analyst", "value": "business analyst"}, {"text": "Analyst", "value": "analyst"}, {"text": "Associate", "value": "associate"}, {"text": "Data scientist", "value": "data scientist"}, {"text": "Senior", "value": "senior"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Intelligence analyst", "value": "intelligence analyst"}, {"text": "Operations analyst", "value": "operations analyst"}, {"text": "Project manager", "value": "project manager"}, {"text": "Project officer", "value": "project officer"}, {"text": "Builder", "value": "builder"}, {"text": "Business", "value": "business"}, {"text": "Cloud consultant", "value": "cloud consultant"}, {"text": "Control analyst", "value": "control analyst"}, {"text": "Data engineer", "value": "data engineer"}, {"text": "Executive", "value": "executive"}, {"text": "Hris analyst", "value": "hris analyst"}, {"text": "Insights analyst", "value": "insights analyst"}, {"text": "It analyst", "value": "it analyst"}, {"text": "Office", "value": "office"}, {"text": "Performance manager", "value": "performance manager"}, {"text": "Product analyst", "value": "product analyst"}, {"text": "Research analyst", "value": "research analyst"}, {"text": "Research assistant", "value": "research assistant"}, {"text": "Senior analyst", "value": "senior analyst"}, {"text": "Senior associate", "value": "senior associate"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Solution architect", "value": "solution architect"}, {"text": "Support analyst", "value": "support analyst"}, {"text": "Systems analyst", "value": "systems analyst"}, {"text": "Technology consulting", "value": "technology consulting"}, {"text": "Unit", "value": "unit"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Internship", "value": "INTERN"}, {"text": "Part-time", "value": "PARTTIME"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Accounting", "value": "/business/naics2007/5412"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Mining", "value": "/business/naics2007/21"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Travel", "value": "/business/naics2007/5615"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "DBS Bank", "value": "/m/01q7n5"}, {"text": "SingTel", "value": "/m/020zfl"}, {"text": "Nanyang Technological University", "value": "/m/0l49k"}, {"text": "United Overseas Bank", "value": "/m/04gjd1"}, {"text": "Bank of Singapore", "value": "/m/0r3vczm"}, {"text": "Binance", "value": "/g/11hcz1r4wl"}, {"text": "Citi", "value": "/m/01dfb6"}, {"text": "Cognizant Singapore, Cognizant Technology Solutions", "value": "/m/03bf9h"}, {"text": "Dyson", "value": "/m/05cskg"}, {"text": "EPAM Systems", "value": "/m/0dlnrc"}, {"text": "Ernst & Young", "value": "/m/0g9jc"}, {"text": "Goldman Sachs", "value": "/m/01xdn1"}, {"text": "Goldman Sachs Services Private Limited", "value": "/g/11g9mm5tzn"}, {"text": "GovTech Singapore", "value": "/g/11dxpkfs_6"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "PEOPLE PROFILERS", "value": "/g/11dxq43n_6"}, {"text": "PwC Singapore", "value": "/g/11dxpz2lh8"}, {"text": "Sciente International", "value": "/g/11c73gj19n"}, {"text": "AIR LIQUIDE INDUSTRIAL SERVICES PTE LTD", "value": "/g/11hg55y1rb"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Accounting and Corporate Regulatory Authority", "value": "/m/09g7_b3"}, {"text": "Agency for Integrated Care", "value": "/g/11c73jd3yt"}, {"text": "Amazon Web Services Singapore", "value": "/m/0rznzt1"}, {"text": "BeathChapman Pte Ltd", "value": "/g/11f01b3y2c"}, {"text": "Big Cloud", "value": "/g/11c743lwsr"}, {"text": "Burpple", "value": "/g/11dxps5yv5"}, {"text": "CPF Board", "value": "/m/0615qb"}, {"text": "ClearanceJobs", "value": "/g/11fy1pft9v"}, {"text": "Comfort Transportation Pte Ltd", "value": "/g/11f01gw2xt"}, {"text": "Credit Agricole Group", "value": "/m/028vbm"}, {"text": "DYSON OPERATIONS PTE. LTD.", "value": "/g/11fy29mc6g"}, {"text": "Deloitte", "value": "/m/02spfd"}, {"text": "Direct Search Asia", "value": "/g/11fy260nhz"}, {"text": "EngageRocket", "value": "/g/11c73p5x97"}, {"text": "Epson Singapore", "value": "/g/11dxpfq_tf"}, {"text": "Expedia Group", "value": "/m/03gq420"}, {"text": "Forizons", "value": "/g/11hbm3kyzd"}, {"text": "GLOBALFOUNDRIES Singapore", "value": "/m/05pcrz0"}, {"text": "Google", "value": "/m/045c7b"}, {"text": "IoTalents", "value": "/g/11dxq187wm"}, {"text": "JAC Recruitment", "value": "/g/121g71_s"}, {"text": "JPMorgan Chase Bank, N.A.", "value": "/m/0221wv"}]}]}