{"search_metadata": {"id": "60827a9a9bddf742aaa4d44a", "status": "Success", "json_endpoint": "https://serpapi.com/searches/78b753f4208681c7/60827a9a9bddf742aaa4d44a.json", "created_at": "2021-04-23 07:43:22 UTC", "processed_at": "2021-04-23 07:43:22 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28software+developer%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=130", "raw_html_file": "https://serpapi.com/searches/78b753f4208681c7/60827a9a9bddf742aaa4d44a.html", "total_time_taken": 0.89}, "search_parameters": {"q": "(software developer) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "130"}, "jobs_results": [{"title": "Staff Software Engineer (Tech Lead) - Engineering Productivity", "company_name": "Zendesk", "location": "Singapore (+1 other)", "via": "via Bayt.com", "description": "Job Description\n\nWe are looking for a Staff Software Engineer to join our Global Engineering Productivity team in Singapore. The Engineering Productivity team's vision is to provide a technical ecosystem along with appropriate standards and policies, such that all engineering teams at Zendesk can create, build, test, and release software with efficient speed, quality, reliability, scalability, insight, and security. You will be working with a group of highly skilled engineers to develop and improve our tooling to support productivity.\n\nZendesk engineers work on sophisticated systems and need the right tools and test infrastructure to deliver high quality code to production. Test Frameworks/Infrastructure and their usability play a critical role in the delivery pipeline. You will be involved in architecting, implementing and configuring test frameworks within a substantial infrastructure containing a large number of services to ensure that all developers can test easily, consistently... and reliably. This is an excellent opportunity to have a large impact on an entire engineering organization.\n\nWhat you get to do every day:\n• Developing processes and laying down standards for building hundreds if not thousands of Zendesk environments per day in a reliable fashion.\n• Provide thoughtful leadership, technical direction and architectural input into product vision and roadmap development.\n• Work closely with senior leadership to transform visions & roadmaps into reality.\n• Contribute to engineering efforts from design to implementation, solving complex technical challenges around developer and engineering productivity and velocity.\n• Effectively engage in the continuous improvement of Engineering productivity practice with a focus on speed, quality, and innovation.\n• Cultivate collaboration between the Engineering Productivity teams and other engineering teams.\n• Work as part of a self-directed team where you determine your tasks in coordination with co-workers, rather than waiting for work to be assigned to you.\n• Find opportunities for improvement by challenging the status quo and suggesting alternative and creative solutions.\n\nWhat you bring to the role:\n• You are a technical leader and have a track record of delivering large scale projects.\n• A love of problem solving. You’re skilled at investigating these problems and determining the appropriate fix.\n• Excellent verbal and written communication skills, and interpersonal skills.\n• Experience with Agile methodologies.\n• Strong knowledge of application configuration, infrastructure, and operations.\n• Ability to collaborate with remote teams.\n• Strong skills in documentation and building tools or products for usability.\n• Extensive experience with Build and deployment tools such as Jenkins, Buildkite CircleCI, Github etc.\n• Experience with one or more general-purpose programming languages including but not limited to: Ruby, Java, C/C++, C#, Python, Golang, Scala, JavaScript.\n• Good experience with cloud-based solutions (AWS, GCP, etc) and container orchestration tools (Kubernetes, Mesos, etc).\n\nNice to have:\n• Experience in developing and architecting high availability frameworks/solutions for large scale, distributed web applications.\n• Tactics and strategies for building engineering productivity tools for highly technical users in a large multi-product SaaS organization.\n• Experience with Spinnaker, Terraform, Nginx.\n• Have actively worked on building CI/CD frameworks.\n\nCulture and Perks\n\nWe have 100s of engineers in our Singapore office which is home to our highly successful Chat product. You can find us at Marina One West Tower. We approach work with calm, focus, a sense of humour whilst keeping sane working hours. At Zendesk, we also have a culture where ideas come from the bottom up - we have yearly company hackathons!\n\nPerks include stock options, flexible working, $1500 training allowance, medical cover, mobile phone allowance and 4 months parental leave. These are always subject to change and usually in the positive.\n\nZendesk builds software for better customer relationships. It empowers organizations to improve customer engagement and better understand their customers. Zendesk products are easy to use and implement. They give organizations the flexibility to move quickly, focus on innovation, and scale with their growth.\n\nMore than 150,000 paid customer accounts in over 150 countries and territories use Zendesk products. Based in San Francisco, Zendesk has operations in the United States, Europe, Asia, Australia, and South America.\n\nInterested in knowing what we do in the community? Check out the Zendesk Neighbor Foundation to learn more about how we engage with, and provide support to, our local communities.\n\nZendesk is an equal opportunity employer, and we’re proud of our ongoing efforts to foster global diversity, equity, & inclusion in the workplace. Individuals seeking employment at Zendesk are considered without regard to race, color, religion, national origin, age, sex, gender, gender identity, gender expression, sexual orientation, marital status, medical condition, ancestry, physical or mental disability, military or veteran status, or any other characteristic protected by applicable law.\n\nBy submitting your application, you agree that Zendesk may collect your personal data for recruiting, global organization planning, and related purposes. Zendesk's Candidate Privacy Notice explains what personal information Zendesk may process, where Zendesk may process your personal information, its purposes for processing your personal information, and the rights you can exercise over Zendesk’s use of your personal information", "extensions": ["8 days ago", "Full–time"], "detected_extensions": {"posted_at": "8 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTdGFmZiBTb2Z0d2FyZSBFbmdpbmVlciAoVGVjaCBMZWFkKSAtIEVuZ2luZWVyaW5nIFByb2R1Y3Rpdml0eSIsImNvbXBhbnlfbmFtZSI6IlplbmRlc2siLCJjb21wYW55X21pZCI6Ii9tLzB3a200cGwiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJ0cVdjSTNzX2JFYzlmTXdjQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VTI5MFNtRktVbVJMWW0xcU1HbElRMVJHU0dkUk1IZ3hXVEp6YkVoSGNrWmFTMTlFVHpWYU9VNVllVXh0VGtOU2NrTnFaMmc1VGpaalIwNDNhbnBMTXpOUWRGRk1SRmhRWTNnMWJGRjFSSGg2YkVKRVVrZFJObnBOVm1WS00wVnhRblkzWjNBeFVERnlhVFJqVVdsUk1tOVdNa1ZWWmxKV09IZExaM1U1TW5CalVXUnBSMjl5UmpSYVZrVldTVzFyTmtOeVRqQlJSbDh4WlhSbkVoWnRibkZEV1U1eFVVNDRYMWQwVVdKMWJYSmlkME5CR2lKQlQwMVpVbmRDYlU1RGNsQkRORUl5Y25WT05EVkJSbTVRYWpJd1pHNXRaM04zIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCYXl0LmNvbSIsImxpbmsiOiJodHRwczovL3d3dy5iYXl0LmNvbS9lbi9zaW5nYXBvcmUvam9icy9zdGFmZi1zb2Z0d2FyZS1lbmdpbmVlci10ZWNoLWxlYWQtZW5naW5lZXJpbmctcHJvZHVjdGl2aXR5LTU5NDc3MjU2Lz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior Software Engineer - Data", "company_name": "D4l Data4life Asia Limited", "location": " (+1 other)", "via": "via Monster", "description": "How about joining our growing team and our mission: Helping researchers to find new treatment methods by providing them with the software they need? Our team is expanding and there is a lot to learn, discover and contribute:\n• Develop new software and contribute to existing open source software\n• Work on an analytical platform which requires sub-second responses to complex queries\n• Get in touch with the latest technologies/concepts like Kubernetes, FHIR and in-memory databases\n• Help to shape the product by bringing in new ideas for features and usage of technologies\n\nWho we are looking for\n• Excellent programming skills in at least one programming language\n• Experienced in SQL (e.g. PostgreSQL, SAP HANA)\n• Knowledge of scaling of databases and database performance optimization\n• You are a team player who loves to share knowledge and ideas with your colleagues\n• Ideally, you would have experience in developing and operating micro services on e.g. Kubernetes\n• Knowledge of NoSQL... databases is a plus\n• 5 or more years in a similar role\n• Strong analytical skills\n• Fluency in English\n\nWhy you will love working with us\n• A broad network of Digital Health Experts which enables you to meet the leading minds of the field\n• A highly motivated team out of more than 30 countries which works with joy on the shared mission\n• Space for your ideas and plenty of participation opportunities - Data4life develops through the contribution of all employees\n• Besides a competitive salary (including a budget for your individual continuing education and a financial contribution to your gym membership) we offer you flexible working hours and regular home office days\n• A secure funding which enables you a long time perspective with us\n• Most important: Cheerful colleagues who are very much looking forward to work with you", "extensions": ["4 days ago", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgRW5naW5lZXIgLSBEYXRhIiwiY29tcGFueV9uYW1lIjoiRDRsIERhdGE0bGlmZSBBc2lhIExpbWl0ZWQiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjBkQmNtdm1CV1ZVenF2bWhBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTW9uc3RlciIsImxpbmsiOiJodHRwczovL3d3dy5tb25zdGVyLmNvbS5zZy9hbXAvam9iLXZhY2FuY3ktc2VuaW9yLXNvZnR3YXJlLWVuZ2luZWVyLWRhdGEtZDRsLWRhdGE0bGlmZS1hc2lhLWxpbWl0ZWQtc2luZ2Fwb3JlLTI3Nzg5NzY5Lmh0bWw/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Lead I - Software Engineering", "company_name": "UST Global Singapore Pte Limited", "location": "Singapore", "via": "via LinkedIn", "description": "Role Proficiency\n\nJob Description :\n\nAct creatively to develop applications and select appropriate technical options optimizing application development maintenance and performance by employing design patterns and reusing proven solutions account for others' developmental activities\n\nOutcomes\n• Interpret the application/feature/component design to develop the same in accordance with specifications.\n• Code debug test document and communicate product/component/feature development stages.\n• Validate results with user representatives; integrates and commissions the overall solution\n• Select appropriate technical options for development such as reusing improving or reconfiguration of existing components or creating own solutions\n• Optimises efficiency cost and quality.\n• Influence and improve customer satisfaction\n• Set FAST goals for self/team; provide feedback to FAST goals of team members\n\nMeasures Of Outcomes\n• Adherence to engineering process and standards (coding standards)\n•... Adherence to project schedule / timelines\n• Number of technical issues uncovered during the execution of the project\n• Number of defects in the code\n• Number of defects post delivery\n• Number of non compliance issues\n• On time completion of mandatory compliance trainings\n\nCode\n\nOutputs Expected:\n• Code as per design\n• Follow coding standards templates and checklists\n• Review code – for team and peers\n\nDocumentation\n• Create/review templates checklists guidelines standards for design/process/development\n• Create/review deliverable documents. Design documentation r and requirements test cases/results\n\nConfigure\n• Define and govern configuration management plan\n• Ensure compliance from the team\n\nTest\n• Review and create unit test cases scenarios and execution\n• Review test plan created by testing team\n• Provide clarifications to the testing team\n\nDomain Relevance\n• Advise Software Developers on design and development of features and components with a deep understanding of the business problem being addressed for the client.\n• Learn more about the customer domain identifying opportunities to provide valuable addition to customers\n• Complete relevant domain certifications\n\nManage Project\n• Manage delivery of modules and/or manage user stories\n\nManage Defects\n• Perform defect RCA and mitigation\n• Identify defect trends and take proactive measures to improve quality\n\nEstimate\n• Create and provide input for effort estimation for projects\n\nManage Knowledge\n• Consume and contribute to project related documents share point libraries and client universities\n• Review the reusable documents created by the team\n\nRelease\n• Execute and monitor release process\n\nDesign\n• Contribute to creation of design (HLD LLD SAD)/architecture for Applications/Features/Business Components/Data Models\n\nInterface With Customer\n• Clarify requirements and provide guidance to development team\n• Present design options to customers\n• Conduct product demos\n\nManage Team\n• Set FAST goals and provide feedback\n• Understand aspirations of team members and provide guidance opportunities etc\n• Ensure team is engaged in project\n\nCertifications\n• Take relevant domain/technology certification\n\nSkill Examples\n• Explain and communicate the design / development to the customer\n• Perform and evaluate test results against product specifications\n• Break down complex problems into logical components\n• Develop user interfaces business software components\n• Use data models\n• Estimate time and effort required for developing / debugging features / components\n• Perform and evaluate test in the customer or target environment\n• Make quick decisions on technical/project related challenges\n• Manage a Team mentor and handle people related issues in team\n• Maintain high motivation levels and positive dynamics in the team.\n• Interface with other teams designers and other parallel practices\n• Set goals for self and team. Provide feedback to team members\n• Create and articulate impactful technical presentations\n• Follow high level of business etiquette in emails and other business communication\n• Drive conference calls with customers addressing customer questions\n• Proactively ask for and offer help\n• Ability to work under pressure determine dependencies risks facilitate planning; handling multiple tasks.\n• Build confidence with customers by meeting the deliverables on time with quality.\n• Estimate time and effort resources required for developing / debugging features / components\n• Make on appropriate utilization of Software / Hardware's.\n• Strong analytical and problem-solving abilities\n\nKnowledge Examples\n\nAdditional Comments:\n\nNone\nJob Description : Role Proficiency: Act creatively to develop applications and select appropriate technical options optimizing application development maintenance and performance by employing design patterns and reusing proven solutions account for\n\nExperience: 0.00-50.00 Years", "extensions": ["5 days ago", "Full–time"], "detected_extensions": {"posted_at": "5 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJMZWFkIEkgLSBTb2Z0d2FyZSBFbmdpbmVlcmluZyIsImNvbXBhbnlfbmFtZSI6IlVTVCBHbG9iYWwgU2luZ2Fwb3JlIFB0ZSBMaW1pdGVkIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJuZTdzalhCQmxhUjEtTzd3QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExpbmtlZEluIiwibGluayI6Imh0dHBzOi8vc2cubGlua2VkaW4uY29tL2pvYnMvdmlldy9sZWFkLWktc29mdHdhcmUtZW5naW5lZXJpbmctYXQtdXN0LWdsb2JhbC1zaW5nYXBvcmUtcHRlLWxpbWl0ZWQtMjUwODg5OTIxMD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Devops Developer", "company_name": "Cognizant Technology Solutions Asia Pacific Pte. Ltd", "location": " (+1 other)", "via": "via Jobs", "description": "Job Description: What to Expect:\nManage all development infrastructures such as workstation, server, storage, network and data protection\nProvision virtual machines, application software and licenses for development team\nDevelop scripts to automate build, software release, application deployment and system and application management\nConduct system level security scan, harden system and application platform and recommend application secure coding and other best practices\nConduct application performance testing\nEvaluate and recommend application development platforms, such as but not limited to Content Management Platform, Business Process Management Platform, Application Lifecycle Management Platform\nHow to Succeed:\nDegree or Diploma in Computer Science, Computer or Electronics Engineering, Information Technology or related disciplines Minimum 3 years of experience in AWS/Azure, DevOps CI/CD, GCP Minimum 3 years' experience in application development and scripting on UNIX/Linux and/or... Windows platform Minimum 3 years' experience in databases such as Microsoft SQL, Oracle or any other enterprise databases\nMinimum 3 years' experience system/application security\nExperience in agile development environment will be an added advantage\nExperience with Atlassian products will be an added advantage\nExperience with HP Load Runner or any other open-source load testing tools will be an added advantage\nExperience with Metasploit, w3af or any other system security testing tools will be an added advantage\nCertifications such as Red Hat Certified Engineer, Microsoft Certified Solution Expert for Server and/or Desktop Infrastructure, Microsoft Certified Solution Expert for Data Platform, Microsoft Certified DBA or Oracle Certified DBA will be an added advantage", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEZXZvcHMgRGV2ZWxvcGVyIiwiY29tcGFueV9uYW1lIjoiQ29nbml6YW50IFRlY2hub2xvZ3kgU29sdXRpb25zIEFzaWEgUGFjaWZpYyBQdGUuIEx0ZCIsImNvbXBhbnlfbWlkIjoiL20vMDluM2hieiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6InVlclJqWXJGZXc3T2toWkJBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUNDcUlDUVU1VlgwNXhWR1pOVkZwUVIwbE1RMU5mU1dGbmJISmZZVVZUVkZOa01HMWpYME56T1hvMUxVTTJURmRvZW5Bek5sWTRkRlEzVTFSc1RVcGxjRVJDVDBwMWJEbElRVTV6TFY5TVdWWkVVMmwxZDBSdGIzWjBOWFJGVVd4VWNtSnlia2RVY1ZwRmFFcG1lVnBHVDFwdldqTlVjbkExUVhsMlJWVnlkamhNYkMxSExVMWpaRk4xVkZvNU5rdE9lbTl4VVdSRFFsZEJWMVIxZFhKWVUweHpiek01ZFMweWVsaDZYME5sWTBweFdFZFBUMjQ1VVVoWmNqUTRXbE5aUjJzNFUyaFhaR2xRYlVOdFMyZHhPSFpsTVRab1JVeEhZMjFVVEhsVk1HZG9XRzVaUWxoU2QzWmFjMGxLYldSek9VeFZlR2g2V1hKNFFUQlpOa2d4YkVSdWJVTTJURFI2YjNkSUxVWkJURTFKYm1sSmVHWlFWRGh2YUhKclFtSlZkRjkzVUVFU0ZtMXVjVU5aVG5GUlRqaGZWM1JSWW5WdGNtSjNRMEVhSWtGUFRWbFNkMEZ0ZG0xMlYwMW1UMHcwU1c4d2FEa3lZakpHVFRGdmVYbEhhVUUiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18yMiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIiwibGluayI6Imh0dHBzOi8vc2cuZmlkYW50by5jb20vam9icy9qb2Itb3BlbmluZy9zb2Z0d2FyZS1kZXZlbG9wZXJzLWFwcGxpY2F0aW9ucy9kZXZvcHMtZGV2ZWxvcGVyLTI3NTIyMTE1OT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Software ​/Salesforce developer", "company_name": "SPRINGFIELD CONSULTING PTE. LTD.", "location": "Singapore (+1 other)", "via": "via Learn4Good", "description": "Position: Software / Salesforce developer\nLocation: null\nRoles &\n\nResponsibilities Should have minimum of 5+ years of developing Sales\n\nForce applications. Expertise in Salesforce Development using Lightning Components, Apex Language, Visual Force pages, Classes, Controllers, Triggers, Indexes and Apex Web services. Min 2+ years of Hands on experience in Salesforce Lightning Components Development. Expertise in Salesforce Configurations using Work flows, Process builders, Flows, Roles, Enterprise Territory Management, Security Controls, Reports and Dashboards and Sharing rules. Previous experience working in Logistics, Travel Industry would be huge plus.\n\nExperience in Salesforce Lightning, Lightning Design System, Lightning App Builder and Lightning Component features. Experience in Administration, Configuration, Implementation, Lightning, and experience with Salesforce platform. Experience in Salesforce Customization, Security Access, Workflow Approvals, Data Validation, data... utilities. Expertise in SFDC Development using Lightning Application, Apex Language, Visual Force pages, Classes, Controllers, Triggers, Indexes, Web Services, Components, Tabs, Apex Web services, Custom Objects, Reports, Analytic Snapshots and Dashboards, Profiles, Creating Roles, Page Layouts, Org - Wide default, Sharing rules, Work Flows Experience in implementing Salesforce SOQL, SOSL and dynamic queries in Apex logic Experience in writing test classes for maximum code coverage Experience Lightning Process builder flows, Chatter and quick Action Experience in Integration Methodologies, different API, Trigger framework, Recursive Triggers, VF Remoting, Asynchronous Framework – Batch jobs, Queueable Apex, Future methods Experience in setting up Connected App Experience in Sales cloud, Ant Migration tool, Standard and custom controllers, Data Loader, Force.com,\n\nEclipse IDE Plug-in, VS Code, Work Flow-Approval, Custom objects, Custom tabs, Email service, Html, Web-service (REST and SOAP) Experience in debugging the code for troubleshooting the issues Exceptional verbal and written communication skills are necessary. Familiar with agile development process. Degree in Engineering or Computer Science required. Good to Have:· Salesforce Certified Administrator Certification· Salesforce Advanced Administrator Certification· Salesforce Platform App Builder Certification· Salesforce Platform Developer I & II Certification· Experience in Unix shell scripting for Command Line Data loader jobs\n\nTell employers what skills you have\n\nApex Programming\n\nDevelopment\n\nLogistics\n\nSalesforce\n\nSalesforce Administrator\n\nSalesforce.com Certified Administrator\n\nRegional Management\n\nSecurity Controlshands-on experience\n\nWebServicestravel industry\n\nOracle Apex", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSDigIsvU2FsZXNmb3JjZSBkZXZlbG9wZXIiLCJjb21wYW55X25hbWUiOiJTUFJJTkdGSUVMRCBDT05TVUxUSU5HIFBURS4gTFRELiIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiT191T2pUajdMOGhPbFNFTkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMZWFybjRHb29kIiwibGluayI6Imh0dHBzOi8vd3d3LmxlYXJuNGdvb2QuY29tL2pvYnMvc2luZ2Fwb3JlL2luZm9fdGVjaG5vbG9neS8yNzEyOTM0NDkvZS8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Sr. Software Engineer - Java", "company_name": "Visa", "location": "Singapore", "via": "via NodeFlair", "description": "This position is an individual contributor role on the Issuer Processing Platform Development Team. The successful candidate will be part of a team to design and develop REST based APIs and perform unit and integration testing on newly developed components. Candidate will assist with troubleshooting and resolving defects during the software development life cycle. This role will also contribute to building and maintaining Continuous Integration and Continuous Delivery Pipelines. Candidate will interface directly with staff members of Development, Product Management, Project Management, and Quality Assurance.\n\nAs a key member of the development team, the candidate should be comfortable with driving technical ideas and communicating clearly with technical as well as non-technical audiences.\n\nEssential Functions\n• Design and develop API based applications using Java, utilizing spring framwork.\n• Design, develop, document and implement new functionality, as well as build enhancements... modifications, and corrections to existing software.\n• Develop TDD/BDD unit-tests and oversee execution.\n• Create documentation and procedures for installation and maintenance.\n• Build and maintain relationships with global and virtual teams on software development or support issues.\n• Engage with Quality Assurance team members on defect triage and resolution.\n• Lead development and oversee programming testing functions to ensure that projects are securely delivered while fulfilling expectations.\n• Work as part of a development team and establish close working relationships with stake holders, quality assurance, architects, management and peers in engineering.\n• Identify opportunities for further enhancements and refinements to standards and processes.\n• Prepare design documents; evaluate and recommend solutions to meet user requirements; define and implement solutions.\n• Participate in the Agile process including stand-up meetings, sprint planning, reviews and retrospectives.\n• Lead by example; demonstrating accountability, mentoring junior team members, and by contributing to departmental procedures, best practices, and standards.\n\nQualifications\n\nBasic Qualifications\n• 2 years of work experience with a Bachelor’s Degree or an Advanced Degree (e.g. Masters, MBA, JD, MD, or PhD)\n• 2 years Java development experience\n\nPreferred Qualifications\n• 3 -7 years of work experience with Bachelor’s Degree or 4 years of work experience with an Advanced Degree (e.g. Masters, MBA, JD, MD) or 3 years of experience with a PhD.\n• DevOps experience preferred, with Jenkins, Chef, Kubernetes, CICD, Dockers\n• Experience in building and maintaining Continuous Integration and Continuous Delivery Pipelines\n• Experience in best practices for API development and design patterns.\n• Knowledge of .net code base is a plus\n• Knowledgeable of common developer tool sets such as Java, XML, JSON, REST, Spring etc is preferred\n• Experience in utilizing technologies such as GIT, Maven, JUnit\n• Experience with REST services\n• Design, develop, document and implement new functionality, as well as enhancements, modifications, and corrections to\nexisting software\n• Experience in creating performing tests and produce results to ensure accurate compliance with project design requirements for compliance, load and performance testing\n• Create documentation and procedures for installation and maintenance\n• Ability to develop code that follows established coding guidelines.\n• Service excellence and innovation; create opportunities; consistently think and act 'ahead of the curve.'\n• Quick learner; self-starter, detailed and thorough.\n• Working knowledge NoSQL DB considered a plus\n• Experience in all phases of software development life cycle including project management, functional requirements definition, technical design, development, testing, quality assurance, system certification, systems implementation and system validation.\n• Consistently able to assess and evaluate problems in a production environment and manage risk to the service when recommending change\n• Strong secure coding practices\n• Strong experience working in an Agile environment. Commitment to Agile values and team-based work.\n• Experience in implementing Application Telemetry to help facilitate real time and remote troubleshooting/performance monitoring\n• Should be able to understand and own component security analysis, including code and data flow review. Collaborate with security team to implement and verify secure coding techniques.\n• Experience in virtualized environments, including deployments, maintenance, and troubleshooting\n• Analyze and troubleshoot deployment issues in a timely manner\n\nAdditional Information\nWork Hours\n• Incumbent must make themselves available during core business hours.\n\nTravel Requirements\n• This position requires the incumbent to travel for work less than 5% of the time.\n\nMental/Physical Requirements\n• This position will be performed in an office setting. The position will require the incumbent to sit and stand at a desk, communicate in person and by telephone, frequently operate standard office equipment, such as telephones and computers, reach with hands and arms, and bend or lift up to 25 pounds.\n\nVisa is an EEO Employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status. Visa will also consider for employment qualified applicants with criminal histories in a manner consistent with EEOC guidelines and applicable local law", "extensions": ["24 days ago", "Full–time"], "detected_extensions": {"posted_at": "24 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTci4gU29mdHdhcmUgRW5naW5lZXIgLSBKYXZhIiwiY29tcGFueV9uYW1lIjoiVmlzYSIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiVVpwakZVRmkwVHM1cEVMY0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBOb2RlRmxhaXIiLCJsaW5rIjoiaHR0cHM6Ly93d3cubm9kZWZsYWlyLmNvbS9qb2JzL2xpc3RpbmdzLzEwNDg3P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Senior System Developer (Mulesoft) (BB-932B3)", "company_name": "RAZER (ASIA-PACIFIC) PTE. LTD.", "location": "Singapore (+1 other)", "via": "via BeBee", "description": "Roles & ResponsibilitiesRazer is looking for an energetic and motivated Senior Developer who will contribute in the integration team. The Senior Developer is responsible for design and technical delivery of middleware solutions for Razer, using Anypoint platform, Anypoint Studio, Data weave, Java, Microsoft Power Automate and other technologies. The right candidate must be hands-on with proven experience in leading and managing complex, international, time-critical integration projects. The candidate must be able to communicate well with internal & external facing environments, understand business requirements and translate them into a technical reality that is extendable and scalable.Roles and Responsibilities: Manage Project Implementation, Change Management and Service Desk function Serving as an API and integration evangelist, acting as a trusted advisor in guiding all sizes towards the realization of the business outcome by leveraging the application of an API-led strategy using... MuleSoft technology Provide architecture, analysis, build, and testing guidance for integrations / process automation solution and implementations, including encryption, security, logging, throttling, scalability and clustering Develop APIs on Mulesoft platform, Business Process Orchestrations - ESB Itinerary using Mule ESB Conduct in-depth code reviews to ensure best practices are being followed Managing the SLAs and deliverables for multiple projects, system changes and upgrades Executing the entire SDLC process and ensuring the accuracy and completeness of functional and technical documentations Vendor engagement and management, responding to quotations and contracts, performing necessary budgeting and costing exercises Other duties as assigned Desired Skills and Experience: Bachelor’s degree in IT or equivalent 5+ years of lead/architect experience in integration/middleware solutions, with minimum 3+ years of Mulesoft development experience using MuleSoft 3.x, 4.x and Anypoint Studio Experience in designing public and private enterprise secure services using RAML and/or REST based APIs with Cloud hub API manager Proficiency in designing complex mule flows with connectors, components, filters, transformers and routers with support from Java Experience with different built tools like Maven, Bitbucket and CI tools like Jenkins Strong understanding in Enterprise platform knowledge (eg. application, data and security) Experience in working with cross-functional teams in a global team environment Ability to lead the team and deliver working solutions on a tight schedule and fast-paced environment Strong project management and planning skills Strong interpersonal skills, must be collaborative in nature and work well with others Exceptional communication skills, both written and verbal Experience in AWS, Azure will be an added advantage MuleSoft certification/s is a plus (eg. MuleSoft Certified Platform Architect)Tell employers what skills you haveAPIsAWSDataIntegrationJavaJenkinsWindows AzuredesignedplatformTechnical Deliverymiddleware solution", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU3lzdGVtIERldmVsb3BlciAoTXVsZXNvZnQpIChCQi05MzJCMykiLCJjb21wYW55X25hbWUiOiJSQVpFUiAoQVNJQS1QQUNJRklDKSBQVEUuIExURC4iLCJjb21wYW55X21pZCI6Ii9nLzExZzltdHhiXzIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiI3QnhXd1JWdWR3aE5KOUZXQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFcUVDQ3VJQlFVNVZYMDV4VTFSSVJrNVlkSFZwY2tkek9XWmFWQzB4TlV0a1MwcFlkM0U1WldSNlQwVnZRa2huUjNoU1ZsTmFXVlJaUlVsSWF6Z3diRVIzY1VneFozRnFaSE14ZVZOd1prbGlOR1ZoYmtaUWRuUTNNakZSZGxwelVrRk5TVzEyYWxGU2FHRm1RV1pvU0ZCSmNtWndNVFUwTms1a2QxZGxVR0ZVWldwNlpYZFdTVE0yTkZBNFRVWkdObVJCUXpKdFNISnRhbEV0UlZOSWJ6TjBaRTVVZEZodGVFNWxUVjk2WkhsTFVrUTBOa0ZqVEdSMmJUSTVRa2RDUlMxYWJ6WTVOV3g0V0VGdVpHaDVTbU5NUVhaeVF6ZEtRME01TURVeFJ6Qk5NMlJaUlhsaVp4SVdiVzV4UTFsT2NWRk9PRjlYZEZGaWRXMXlZbmREUVJvaVFVOU5XVkozUVVrMmJYZFFaSEpZV2xJMk1WZE5UUzFvVXpCVk5WOWFjMWxVZHciLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18zNiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCZUJlZSIsImxpbmsiOiJodHRwczovL3NnLmJlYmVlLmNvbS9qb2IvMjAyMTA0MjAtM2FmNWM1MmU3NmMwYTVmYWE5ODgxMDg2ZTY4OTMyYjM/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Software Engineer (eHR)-2021 Start", "company_name": "TikTok", "location": "Singapore", "via": "via Bayt.com", "description": "About the eHR Engineering Team\nThe eHR Engineering team is part of ByteDance Enterprise Services team. We are a rapidly growing and highly capable team. We are builders who embraces change, push boundaries, committed to promoting the revolution of human resources process informatization. We build a highly efficient development engine for ByteDance and bring our products to millions of professionals outside ByteDance by making these available on a SaaS Platform. As a member of People, you play a key role in re-shaping the productivity of the HR industry with the global team. We are looking for talented individuals to join us in 2021 - people who want to inspire creativity and co-create the future with us. Responsibilities\n1. Write and review code and debug problems to develop an SaaS product to solve the complex problems from global clients;\n2. Apply knowledge gained in computer science courses to build next generation systems to constantly be at the cutting edge.\n\nQualifications\n1... Final year or recent graduate with a background in Software Development, Computer Science, Computer Engineering, Information Systems or a related technical discipline;\n2. Experience in Software Development and coding in a general purpose programming language is a plus;\n3. Agile, quick self learner, highly self-motivated and quick problem-solving capabilities;\n4. Possess good coding skills, data structure and basic algorithm skills. Application\n1. Applications will be reviewed on a rolling basis and we encourage you to apply early;\n2. Interview starts from February 2021", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciAoZUhSKS0yMDIxIFN0YXJ0IiwiY29tcGFueV9uYW1lIjoiVGlrVG9rIiwiY29tcGFueV9taWQiOiIvZy8xMWZ5MjY1OTMzIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoieEU0RmxQZHlpNjU5RkJlWkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFVUTk9XbmN5VEZaT1MwbFVjVW94ZEVoVGVHZEdXSFoxWjNwTmJXNVBia3QyUlZCaWNsYzBaa1ZJYlZKRmNqUjZNVnBHYTBwT1VreFdhRWhvWHpCbVpFNTVhVTV2VjNST1RYTjFTV2QyTXpOaGNIbGFla2h3TUU0eFNraHJSVWcyVEU1dU4yTlRSV0V4Y1d4c1ZXSTVhbmxoWTNwSGFtOXBSSGRDVWt0TVJIUklaRVpJZWpFek9VNURURzVtZFROQ2VUVnhNa0YyY3pSRlVqRm5FaFp0Ym5GRFdVNXhVVTQ0WDFkMFVXSjFiWEppZDBOQkdpSkJUMDFaVW5kRGRqSXpWRjg1WDJZd05GVlRTMU10Y21aMU1HMHRWakEzVlVoMyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzQyIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJheXQuY29tIiwibGluayI6Imh0dHBzOi8vd3d3LmJheXQuY29tL2VuL3NpbmdhcG9yZS9qb2JzL3NvZnR3YXJlLWVuZ2luZWVyLWVoci0yMDIxLXN0YXJ0LTU4MTAzMTQ4Lz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Software Quality Engineer", "company_name": "Techgig", "location": "Singapore", "via": "via Mendeley", "description": "About Job\n\nCTC Undisclosed Job Location Singapore Experience 3 - 6 yrs\n\nDescription\n\nRequired Skills: Our client is a leading business service provider in Singapore. The company is looking for an experienced and full-time Software Quality Engineer for onsite role in Singapore.\n\nKey Job Responsibilities:\n\n- Assist Product Owner and Business Analyst to craft out user story acceptance criteria\n\n- Analyse and decompose complicated software systems, and design a holistic test strategy\n\n- Conduct research on emerging technologies and develop test automation framework\n\n- Develop test suites of test scenarios and test cases\n\n- Take a risk-based approach for test automation\n\n- Perform time boxed exploratory testing\n\n- Maintain regression test suite in QA nightly build\n\n- Actively refine smoke test suite in Development CI environment\n\n- Lead system integration testing with other system owners\n\n- Manage user acceptance testing\n\n- Manage defect life cycle, test artefacts and repository\n\n- Drive... continuous improvement in agile testing practices and tools\n\n- Take on secondary role as an Application Performance Engineer or Application Security Engineer\n\nKey Skills/Qualifications:\n\n- Min 3 years experience in exploratory testing and regression test automation\n\n- Strong analytical skills\n\n- Meticulous attention to details\n\n- Good interpersonal skills such as tactfulness\n\n- Good presentation and listening skills\n\n- Experience in agile development environment will be an added advantage\n\n- Experience with Robot Framework, SikuliX, Selenium, HP Testing Tools (Mobile Center, UFT, QC and Sprinter) or EggPlant will be an added advantage\n\n- Certified Software Testing Professional and/or Certified Software Quality Analyst will be an added advantage\n\n- Degree or Diploma in Computer Science, Computer or Electronics Engineering, Information Technology or related disciplines", "extensions": ["9 days ago", "Full–time"], "detected_extensions": {"posted_at": "9 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBRdWFsaXR5IEVuZ2luZWVyIiwiY29tcGFueV9uYW1lIjoiVGVjaGdpZyIsImNvbXBhbnlfbWlkIjoiL2cvMTFjNzNmeGd3dCIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjJoTTlPNGI2emJVZFRBZnBBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhVVmhwVVdoTVVGOHhTa3BOV0ROcGEzZHRPVFpNV0U1WVozRnlUREZHZDNkWVVUWlBhbU52UmxCbVZEWlpjbFEwZW1OMFREbGZVbVJ0VlcxaVYwNUdkRWxwTTFKSFpUSnJOamR0TUhCWE9VUXRWbVV5TVdkSGVqZzRRVXRrYjFCSUxXcG9ja0pEWTFoM2JIUmtTMkpOTFdSMVpqWnpTREl5T1hVMVN5MVpjbnBIYWxjMVh6ZHdaR1JmV0dZME5FVm9hV0pxVTJsT05rTkJkMTlCRWhadGJuRkRXVTV4VVU0NFgxZDBVV0oxYlhKaWQwTkJHaUpCVDAxWlVuZEJXR3gyT0RnNWFVaHlXWEF5TVdsdFpqaElja2g2TmpabFJFdDMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY180OSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNZW5kZWxleSIsImxpbmsiOiJodHRwczovL3d3dy5tZW5kZWxleS5jb20vY2FyZWVycy9qb2Ivc29mdHdhcmUtcXVhbGl0eS1lbmdpbmVlci0xMjg4OTAzP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Software Engineer - Senior welcome - Medical Devices - Up to SGD 6-000-mth", "company_name": "Integrity Partners Pte. Ltd.", "location": "Singapore (+1 other)", "via": "via Monster Singapore", "description": "My client, an leading in innovation medical device company is looking for a software engineer that will be involved in innovative projects that propels the company's product to greater heights!\n\nSoftware Engineer (Junior and Senior)\n\nJob Description\n\n• Assist the project manager on all software coding work required for the primary objective\n• Familiar with Python coding language\n• Experience with web-based GUI design\n• Create and compile all technical specifications, flowchart architecture and code description\n• Ensure appropriate GIT and documentation of code bases\n• Dealing with data management, machine-learning and image signal processing\n• Other job responsibilities and ad-hoc duties as assigned by project manager\n\nRequirements\n\n• Bachelor’s degree in computer science, engineering or a related field or other related majors\n• 2 to 3 years of experiences software engineering\n• Confident in Python, Node.js, Ruby, CSS, Django development environment\n• Strong interest in data-science... and a confident foundation with Python language\n• Experience with backend / web-based data management architecture\n• Some experience working with neural networks, OpenCV, NumPy, statsmodel and vision-related systems will be an advantage\n• High degree of comfort with ambiguity in early-phase investigative projects\nSkills\n• Requiring initiative, ingenuity and problem-solving skills as assignment is broad and challenging in nature\n• Good understanding of multiple platform and SDK environments and highly analytical\n• Possess good communication skills and ability to work well independently\n\nHow to Apply:\n\nInterested applicants may apply by sending in your updated résumé (in MS Word format) to my email or apply directly:\nConsultant: Tan Jun Jie\nEA personnel reg. no.R1878852\nEA License No. 17C8502", "extensions": ["5 days ago", "Full–time"], "detected_extensions": {"posted_at": "5 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciAtIFNlbmlvciB3ZWxjb21lIC0gTWVkaWNhbCBEZXZpY2VzIC0gVXAgdG8gU0dEIDYtMDAwLW10aCIsImNvbXBhbnlfbmFtZSI6IkludGVncml0eSBQYXJ0bmVycyBQdGUuIEx0ZC4iLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImFSQU01UE1wd21BQnlTUndBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTW9uc3RlciBTaW5nYXBvcmUiLCJsaW5rIjoiaHR0cHM6Ly93d3cubW9uc3Rlci5jb20uc2cvYW1wL2pvYi12YWNhbmN5LXNvZnR3YXJlLWVuZ2luZWVyLXNlbmlvci13ZWxjb21lLW1lZGljYWwtZGV2aWNlcy11cC10by1zZ2QtNi0wMDAtbXRoLWludGVncml0eS1wYXJ0bmVycy1wdGUtbHRkLXNpbmdhcG9yZS0yNzc3MTM5NS5odG1sP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}], "chips": [{"type": "Title", "param": "job_family_1", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Software engineer", "value": "software engineer"}, {"text": "Senior", "value": "senior"}, {"text": "Test engineer", "value": "test engineer"}, {"text": "Cloud engineer", "value": "cloud engineer"}, {"text": "Engineer", "value": "engineer"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Assurance engineer", "value": "assurance engineer"}, {"text": "Programmer", "value": "programmer"}, {"text": "Coach", "value": "coach"}, {"text": "Qa engineer", "value": "qa engineer"}, {"text": "Devops engineer", "value": "devops engineer"}, {"text": "Frontend engineer", "value": "frontend engineer"}, {"text": "Java engineer", "value": "java engineer"}, {"text": "Solutions engineer", "value": "solutions engineer"}, {"text": "Testing engineer", "value": "testing engineer"}, {"text": "Analyst", "value": "analyst"}, {"text": "Data engineer", "value": "data engineer"}, {"text": "Design engineer", "value": "design engineer"}, {"text": "Development manager", "value": "development manager"}, {"text": "Devops consultant", "value": "devops consultant"}, {"text": "Firmware engineer", "value": "firmware engineer"}, {"text": "Lead engineer", "value": "lead engineer"}, {"text": "Lecturer", "value": "lecturer"}, {"text": "Manager", "value": "manager"}, {"text": "Network systems", "value": "network systems"}, {"text": "Principal", "value": "principal"}, {"text": "Principal engineer", "value": "principal engineer"}, {"text": "Quality engineer", "value": "quality engineer"}, {"text": "Science", "value": "science"}, {"text": "Scrum master", "value": "scrum master"}, {"text": "Security architect", "value": "security architect"}, {"text": "Security engineer", "value": "security engineer"}, {"text": "Senior engineer", "value": "senior engineer"}, {"text": "Senior lecturer", "value": "senior lecturer"}, {"text": "Senior system", "value": "senior system"}, {"text": "Senior technical", "value": "senior technical"}, {"text": "Software architect", "value": "software architect"}, {"text": "Specialist", "value": "specialist"}, {"text": "Stack engineer", "value": "stack engineer"}, {"text": "System engineer", "value": "system engineer"}, {"text": "Technical", "value": "technical"}, {"text": "Trainee", "value": "trainee"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Wholesale", "value": "/business/naics2007/42"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Mining", "value": "/business/naics2007/21"}, {"text": "Rental", "value": "/business/naics2007/532"}, {"text": "Retail", "value": "/business/naics2007/44"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": ".AB4Jjf.qPB6Vc{padding-right:11px}.qfpP8d{padding:7px 0 7px 11px}.S003Ke{flex:none}.ZoN4Lb{color:rgba(0,0,0,.54)}.nAXVG{color:#70757a}.IxQsL{color:rgba(0,0,0,.26)}.xFO1De{color:#fff}.ooFpK{color:rgba(255,255,255,.30)}.mtnwac{color:#4285f4}.WxeeKb{color:#34a853}.hIVRU{color:#f29900}.EXaTMc{color:#fbbc04}.sxn46d{color:#000}.gqMTF{color:#1a73e8}.zpn8Mb{color:#d93025}.dEUPmd{color:#1e8e3e}.PJNo1{color:#fbbc04}Actively Hiring", "value": "e"}, {"text": "EPAM", "value": "/m/0dlnrc"}, {"text": "VISA", "value": "/m/01kqjn"}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Zühlke", "value": "/g/1hh_rg216"}, {"text": "Cardinal Health", "value": "/m/040vzx"}, {"text": "Credit Agricole Group", "value": "/m/028vbm"}, {"text": "GlobalTix Pte Ltd", "value": "/g/11dxpqdhrf"}, {"text": "HCL SINGAPORE PTE. LTD.", "value": "/g/11fy25ngsv"}, {"text": "Jobline Resources Pte Ltd", "value": "/g/11gp2647pn"}, {"text": "Mediacorp", "value": "/m/03qtz1"}, {"text": "Realtek", "value": "/m/05wrm7"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "TECHNOPALS PTE. LTD.", "value": "/g/11dxpvkynp"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "Thales", "value": "/m/01phj4"}, {"text": "UST", "value": "/m/08kb8g"}, {"text": "UrbanFox", "value": "/g/11ghs7y0w6"}, {"text": "Activate Interactive", "value": "/g/11dxq192l5"}, {"text": "Cognizant", "value": "/m/03bf9h"}, {"text": "DELL", "value": "/m/0py9b"}, {"text": "HCL Technologies", "value": "/m/0698gv"}, {"text": "ORACLE", "value": "/m/05njw"}, {"text": "PUBLICIS SAPIENT", "value": "/m/09n8_2k"}, {"text": "Singapore Press Holdings Limited", "value": "/m/0d7mwh"}, {"text": "Temasek Polytechnic", "value": "/m/098s73"}, {"text": "TikTok", "value": "/g/11fy265933"}, {"text": "Zendesk", "value": "/m/0wkm4pl"}, {"text": "A-it Software Services Pte Ltd", "value": "/g/11dxpy_gl_"}, {"text": "ACCENTURE PTE LTD", "value": "/m/09n8w94"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "Adecco GS", "value": "/m/08gz46"}, {"text": "Atidan Technologies", "value": "/g/11c74f0b8_"}, {"text": "Autodesk", "value": "/m/018nm3"}, {"text": "Avnet", "value": "/m/0c8xmc"}]}]}