{"search_metadata": {"id": "6082799849ecdb4ed3c6ff95", "status": "Success", "json_endpoint": "https://serpapi.com/searches/03b48c162ef461e3/6082799849ecdb4ed3c6ff95.json", "created_at": "2021-04-23 07:39:04 UTC", "processed_at": "2021-04-23 07:39:04 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28consultant%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=60", "raw_html_file": "https://serpapi.com/searches/03b48c162ef461e3/6082799849ecdb4ed3c6ff95.html", "total_time_taken": 2.78}, "search_parameters": {"q": "(consultant) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "60"}, "jobs_results": [{"title": "Talent Acquisition Consultant (Basic Salary up to S$3200 +Incentive)", "company_name": "Celecti Pte. Ltd.", "location": "Singapore (+1 other)", "via": "via NTU-JobsCentral", "description": "# 5-day work week\n\n#Easily accessible by public transports & Downtown & East-West MRT (3 mins walk)\n\n#Attractive renumeration package (Basic Salary up to S$3200 + Sales Incentive)\n\n#Excellent learning opportunities\n\n#Good career prospect, with opportunity to lead a team\n\nAs a client-centric recruitment firm, we provide customized methodologies to address the unique aspects of every assignment and job order. As a Recruitment Consultant, you are to provide a holistic approach to recruitment and ensure that our clients recruitment needs are met. Simultaneously, you are to provide an opportunity for someone who is in need of a livelihood. Join us in this purposeful job as a Talent Acquisition Consultant. We are expanding, and we invite you to be part of our growing team to make a difference in a person’s life and the organization.\n\nPRIMARY JOB DUTIES:\n\nCandidates Management:\n• To source, search and qualify suitable applicant for job role\n• Conduct interview, assess attitude & aptitude... conduct reference check on shortlisted applicant\n\nClients Management:\n• Business Opportunities Development: i) profile target market segments to support organization business needs ii) identify potential customers' needs\n• Customer Acquisition Management: i) to source for potential customers ii) generate leads based on targeted customer characteristics\n• Customer Relationship Management: i) engage customers to ensure services meet customers' needs ii) to build positive relationships with customers\n• To provide advises to clients on economic outlook, salary compensation, and labour market sentiment\n\nJOB REQUIREMENTS:\n• Min. Dip/’A’/Degree in any disciplines\n• Enjoy working in a team-based environment\n• An added advantage for applicant who is CEI certified, but is not a requirement\n\nAre you searching for a meaningful career or a career progression? Be part of our growing team, email your detailed resume in MS Word format to [Click Here to Email Your Resume]. Attention to Ms Lim.\n\nPersonal Data Protection\n\n\"By submitting your curriculum vitae or disclosing your personal information in connection with your job application, you are deemed to have read and agreed to the terms of our Privacy Policy, and consented to the collection, use and disclosure of your personal data by us, in accordance with our Privacy Policy. Please access our website at www.celecti.com.sg for a copy of our Privacy Policy.”", "extensions": ["2 days ago", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJUYWxlbnQgQWNxdWlzaXRpb24gQ29uc3VsdGFudCAoQmFzaWMgU2FsYXJ5IHVwIHRvIFMkMzIwMCArSW5jZW50aXZlKSIsImNvbXBhbnlfbmFtZSI6IkNlbGVjdGkgUHRlLiBMdGQuIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJlaFFIUlRUU0Nka2xIY2k4QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE5UVS1Kb2JzQ2VudHJhbCIsImxpbmsiOiJodHRwczovL250dS5qb2JzY2VudHJhbC5jb20uc2cvdmlld1NpbXBsZVByb2ZpbGUucGhwP2ppZD04ODk4NzFcdTAwMjZ1dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Salesforce Consultant", "company_name": "None", "location": "Singapore", "via": "via Jobs", "description": "At PwC South East Asia Consulting, we help businesses to work smarter and grow faster. We partner with our clients to build effective organisations, innovate and grow, reduce costs, manage risk and regulation and, leverage talent. Our aim is to support businesses in designing, managing and executing lasting beneficial change.PwC's South East Asia Consulting practice provides a comprehensive range of professional services and experience to deliver large scale, cross territory transformation projects, wherever our clients need us to be – from strategy through to execution.About the Role As an Associate / Senior Associate, you'll work as part of a team of problem solvers with extensive consulting and industry experience, helping our clients solve their complex business issues from strategy to execution. Specific responsibilities include but are not limited to: Listen to customer requirements, review existing and future Business Processes and translate all this input after full... understanding in a realistic and actionable solution designs that can be developed and implemented Prepare efforts estimates to build this solution after studying RFPs, requirements, and related customer documents while working in team with developers, project managers, and other Salesforce consultants Gain customer acceptance by explaining or demonstrating how Salesforce can help better meet their strategic, tactical, and financial goals You will be involved in delivering end-to-end salesforce implementation engagements, including discovery, build, test, training and adoption, and support. Professionally document the solution that was implemented Use a broad range of tools and techniques to extract insights from current industry or sector trends. Keep up-to-date with developments in the area of Salesforce. Demonstrate critical thinking and the ability to bring order to unstructured problems. Working in a team environment with people from multiple backgrounds and skill sets Uphold the firm's code of ethics and business conduct. About you Minimum 1 - 3 years of professional services or similar industry experience An interest in upskilling for a digital world and technology trends, an openness to learning new tools and adapting how you work Experience with the Salesforce platform (configuration or development) with one or more Salesforce certifications preferred. This includes, but not limited to: Salesforce Certified Platform App Builder, Salesforce Certified Administrator, Salesforce Certified Sales Cloud Consultant and/or Salesforce Certified Service Cloud Consultant Ability to design the data model, user interface, business logic, and security for custom applications using the configurable aspects of Salesforce You have experience or have understanding of agile methodologies in delivering platform implementations You are comfortable with business analysis and translating business requirements to functional user stories Excellent communication and listening skills in English Ability to work creatively and flexibly, both independently and as part of a team You follow the latest trends in technology, use best practice development principles and you want to work in an environment where that is the norm. You like diving into a product to understand how it works and consistently share your knowledge with others. Most of all, you have a strong desire to build new applications that you can be proud of, and that provide a real value to your users", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTYWxlc2ZvcmNlIENvbnN1bHRhbnQiLCJjb21wYW55X25hbWUiOiJOb25lIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJQWmNEQXVGQktUQjdodHB2QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnMiLCJsaW5rIjoiaHR0cHM6Ly9zZy5maWRhbnRvLmNvbS9qb2JzL2pvYi1vcGVuaW5nL3NhbGVzLXJlcHJlc2VudGF0aXZlcy1zZXJ2aWNlcy1hbGwtb3RoZXIvc2FsZXNmb3JjZS1jb25zdWx0YW50LTI3NTQ1MTA2Mz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior Consultant: Security", "company_name": "NTT", "location": "Singapore", "via": "via Careers At NTT", "description": "The Senior Digital Forensics & Incident Response Consultant (DFIR) will work within established Incident Response methodologies to perform a variety of related activities for NTT customers. This will include responding to Cyber Incidents, proactively hunting for adversaries in customer networks, and performing IR Readiness and Maturity Assessments, as such they will be expected to work independently with little management oversight whilst responding to customer Incidents. The Senior DFIR Consultant will also be responsible for leading and working on projects that will support tactical and strategic business objectives such as Incident Response, Incident Response Gap Analysis assessments, Table Top Exercises and proactive IR design engagements (Runbooks etc.). Demonstration of leadership abilities to provide a clear professional approach to customer facing engagements during the most trying and complex situations such as a data breach. To provide clear and concise communication with a... variety of stakeholders from customer IT staff up to C Suite. With the ability to lead during a crisis, show personal agility to adapt to changing environments, and a strong comprehension of malware, emerging threats and the ability to demonstrate risks to the customers’ business as the result of a breach.\n\nNTT Security provide both first line DFIR services and extensive DFIR consultancy to large organisations where the development and maturity of customers in house DFIR capabilities is required. The consultant will be expected to work closely with other internal security teams such as SOC and Penetration Testing. A solid understanding of real life attacks is essential in the Consultant to provide high quality Incident Response services to our customers.\n\nResponsibilties:\n• Lead and perform Digital Forensic & Incident Response engagements for customers.\n• Supporting Presales engagements and providing Subject Matter Expertise for pre sales calls and meetings.\n• Proactively hunt for adversaries on customer networks utilising a variety of tools and techniques\n• Responsible for Incident and Breach communications, assessments, and reports that may be both internal and customer facing, to include leadership and executive management for the purpose of enabling Senior Management to make decisions in a crisis situation.\n• Understanding of different attacks and how best to design custom containment and remediation plans for customers\n• Lead projects for Incident Response, which can be simple small engagements up to large multinational organisations.\n• Develop and document processes to ensure consistent and scalable response operations\n• Demonstrate industry leadership through blog posts and public speaking at conferences and events as well as provide mentorship to more junior staff members.\n• Understand what sophisticated, real world attacks look like and how to identify TTP’s within log data, network traffic and forensic imaging\n\n​​​​​​​​​​​​​​\n\nExperience, Skills and Qualifications\n• Proven experience with Incident Response, offensive security (penetration testing), as well as detection, networking and endpoint solutions, are all distinct advantages.\n• Be hands on familiar with IR toolsets and investigation techniques on both Windows and GNU/Linux Operating Systems\n• Experience with enterprise level EDR and SIEM platforms.\n• Collaborative attitude and able to serve as a liaison to different businesses and interface with fellow team members and colleagues on other security teams.\n• Working within cyber defence for 5 years + and Incident Response for the last 2 years\n• IT Security related degree (or show practical experience).\n• Hold a CREST or SANS (or other industry related exam) in Incident Response (CREST Certified Incident Manager, CREST Certified Network or Host Intrusion Analyst, SANS GCIH, etc.), or be able to sit and pass one of the CREST Incident Response exam within 6 months\n• In-depth knowledge of operating systems – Windows & Linux, firewalls, HIDS/HIPS & IDS/IPS\n• Experience with OSINT and threat intelligence gathering methods\n• Excellent verbal, written and presentation skills\n• Industry standard information security certification (CISSP, CISM etc.)\n• Deliver post event IR assessments and desktop/real life IR simulations at a technical and executive level\n• Be able to guide, influence and provide thought leadership within incident response services\n• Knowledge and experience with proactive threat hunting techniques and procedures", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQ29uc3VsdGFudDogU2VjdXJpdHkiLCJjb21wYW55X25hbWUiOiJOVFQiLCJjb21wYW55X21pZCI6Ii9tLzA1bXlicDgiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJIQmcyRzRvVXdyMHlZa2tGQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFc3NCQ293QlFVNVZYMDV4VTJkVlVEUnFibmx6VVhoZmQzWklOMG8yVDJWRlVqZHdhRkExY25sdFpGOUhVMlJ0UkVoZk5HcGhkVGhNTFc5T2VuVkRkMnhrWlZkMFdIaEJiMHh0VUVSWVpWUnhiV2xEYzJOWmRFTm9VVFZJUmpObU9XaGxjamN3WjJaRVNFSlVPRmxIUldGSmRGTmpURGhZWmt0VFJHNUxTRTFJWmxFME9GOW9WbWhZUmw5SFYzVmlYMGNTRm0xdWJVTlpTVk5rUkU1VE5YUkJZV1YwUzFSblFsRWFJa0ZQVFZsU2QwUktRWEIzYkdFek9YazNTM0EwV0U1ellraGtSRlpEVm01aVRtYyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzE3IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIENhcmVlcnMgQXQgTlRUIiwibGluayI6Imh0dHBzOi8vY2FyZWVycy5oZWxsby5nbG9iYWwubnR0L2dsb2JhbC9lbi9qb2IvMzY5Mi9TZW5pb3ItQ29uc3VsdGFudC1TZWN1cml0eT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Software Consultant", "company_name": "Glory Global Solutions", "location": "Singapore (+1 other)", "via": "via NodeFlair", "description": "To manage the Singapore business from an operational perspective.\n\nMAIN RESPONSIBILITIES\n• Propose creative ways to configuration our product software to meet customer needs\n• Be the Subject Matter Expert for all software enquiries and support queries from other departments\n• Attend software demo and discussion with customers for software deployment and integration\n• Proposed creative ways to configuration our product software to meet customer’s needs\n• Support software venders to integrate with Glory products, conduct integration training and support troubleshooting\n• Plan and train relevant parties on software related matters\n• Perform comprehensive testing to validate software performance and stability before installation\n• Perform system (hardware and software) integration certification test on our partners’ application before actual deployment\n• Perform field installation and training when necessary\n• Attend / analyze and troubleshoot field problems that are related to software\n•... Create / update documents such as software configuration, test data, user guides etc.\n• Draft new requirements based on customer needs\n• Modify software script / tools to meet customer need and enhance internal operations\n\nREQUIRED EDUCATION AND QUALIFICATIONS\n• At least 2-3 years of relevant experience\n• Diploma or Degree in computing or related IT certification\n\nREQUIRED SKILLS AND COMPETENCIES\n• Network and web server environment knowledge including Apache, HTTP, XML, and Web Service\n• Java development experience\n• SQL Server applications and Web Programming\n• Web Security knowledge including SSL, HTTPS\n• Experience with IoT platforms, Message Queueing Telemetry Platform will be a plus\n• DLL handling\n• C++ and C#\n• English language - Excellent\n• Excellent communication skills\n• Creative and flexible thinker\n• Good Troubleshooting skills (system troubleshooting, hardware and software)\n• Good interpersonal relationship building\n• Can-do attitude\n\nDESIRABLE SKILLS AND COMPETENCIES\n• SOAP Interface\n• Windows script writing\n• Serial Communication\n• VB and VBA\n• Excel macros\n\nGlory believes in equal opportunity for all qualified persons and will not discriminate against any applicant for employment because of race, colour, religion, marital status, national origin, gender, age, disability, veteran status, or any other status protected by law", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBDb25zdWx0YW50IiwiY29tcGFueV9uYW1lIjoiR2xvcnkgR2xvYmFsIFNvbHV0aW9ucyIsImNvbXBhbnlfbWlkIjoiL20vMGNsazhmdCIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IlZ1ZzdJMnN1bTUxMUNvSS1BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2WUJDcmNCUVU1VlgwNXhVV1IwUW5WWWJFdElhblZSU1UxWlNuaHdMV1Z2V1VwTlIycEZhbkJLYzJsb1gzVXhXbFJLTlZkS05rNDNhRVl4VEVreGJsWk1YMkZEUjJobk5HTjNWRVI0Y2xCc1NGcHBZVFp6U0RWblFtRndiVzQzWkd0d01IQklkemhJYldOa1NEWlljM2t6TFRoUmJHdFpZVXRmYUhSVVRtVktPWE5tTVhWTU5sb3dWSFJxVUVNMllrOUtlVE5hTWxoRGRrRmtOMFZZT0hSSmVWUjZjVVprVjJOWWJYTnhSRVYzVDE5VmRsRkVaVFpmZVZrMEVoWnRibTFEV1VsVFpFUk9VelYwUVdGbGRFdFVaMEpSR2lKQlQwMVpVbmRCTFY5S2FEZFZhRFZZWTFGMlJXRlZkV0pMU2pSNmRqSmpVMUZuIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMjUiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTm9kZUZsYWlyIiwibGluayI6Imh0dHBzOi8vMy4xLjAuMTIzL2pvYnMvbGlzdGluZ3MvODExMT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Consultant", "company_name": "Infosys", "location": "Singapore", "via": "via HelpOneBillion", "description": "Job Description\n\nAbout Infosys -\n\nInfosys is a global leader in next-generation digital services and consulting. We enable clients in 46 countries to navigate their digital transformation. With over three decades of experience in managing the systems and workings of global enterprises, we expertly steer our clients through their digital journey. We do it by enabling the enterprise with an AI-powered core that helps prioritize the execution of change. We also empower the business with agile digital at scale to deliver unprecedented levels of performance and customer delight. Our always-on learning agenda drives their continuous improvement through building and transferring digital skills, expertise, and ideas from our innovation ecosystem.\n\nVisit www.infosys.com to see how Infosys (NYSE: INFY) can help your enterprise navigate your next.\n\nJD IDDC Network TF- Senior Consultant -SingaporeRole (L1/L2/L3/Service Lead/Tech Lead/Architect)Senior ConsultantPositionInfrastructure - DC Senior... Network ConsultantDepartment / PUCISNWTAcademic BackgroundBachelor of Engineering / Technology / ScienceOverall Experience (in yrs.)10 + Yrs.LocationSingapore 40DC Network TF- Senior Consultant -SingaporeTechnical skills (Required - Mandatory)Deployment\n\nCisco Switching NX-OS/Cisco Routing\n\nVMware NSX-V/T\n\nNetwork Automation/Python/Ansible\n\nF5 /Citrix Load Balancing\n\nCisco Switching & Routing\n\nAs Built, LLD, Testing & Acceptance Testing Documentation SkillsTechnical skills (Required - Nice to have)F5 Load Balancing, Network Security & Design Skills\n\nVMware NSX-V/T\n\nCertification: CCNP/CCDA equivalent, F5 Certified Technical SpecialistLanguage skills neededRole (L1/L2/L3/Service Lead/Tech Lead/Architect)People skillsLead for 5-8 team membersSoft skills\n• Experience in running operations with ITIL processes / Project Management - PMP\n• Excellent Analytical and troubleshooting skill.\n• Excellent in Verbal, written communication.\n• Creative thinking in implementing Service improvements (automation, incident reduction, etc.).\n• Willingness and flexibility to learn new technologies, scale up quickly and adapt to different roles as the situation demands.\n• Experienced in running operations following ITIL processes.\n• Experienced in writing RFPs solutions and presentations during client visits.\n\n50Role (L1/L2/L3/Service Lead/Tech Lead/Architect)Skill Level\n• Discovery and Design Work Shop\n• Finalize the Baseline, Architecture, Design and Migration Strategy\n• Enterprise Data Network (administration, patching, upgrade and migration activities), Design, Preparing of HLD/LLD, Implementation Team leading, Service Level management, demand, incident, change management.\n• Provide network WAN/LAN design, implementation, consulting, Cisco, Aruba, Juniper or equivalent\n• Network audit Identify the gaps and suggest the remedial solution. Supporting in RFP/RFI response.\n• Handling Client discussions for due diligence, business information gathering etc.\n• Site Network Build & Transform\n• Migration\n• Support Hyper care and Handover\n\nExpert\n• Writing solutions / estimates for RFPs.\n\nSenior Consultant\n\nAll aspects of employment at Infosys are based on merit, competence and performance. We are committed to embracing diversity and creating an inclusive environment for all employees. Infosys is proud to be an equal opportunity employer.\n\nAt Infosys, we recognize that everyone has individual requirements. If you are a person with disability, illness or injury and require adjustments to the recruitment and selection process, please contact our Recruitment team for adjustment only on Infosys_ta@infosys.com or include your preferred method of communication in email and someone will be in touch.\n\nPlease note in order to protect the interest of all parties involved in the recruitment process, Infosys does not accept any unsolicited resumes from third party vendors. In the absence of a signed agreement any submission will be deemed as non-binding and Infosys explicitly reserves the right to pursue and hire the submitted profile. All recruitment activity must be coordinated through the Talent Acquisition department", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDb25zdWx0YW50IiwiY29tcGFueV9uYW1lIjoiSW5mb3N5cyIsImNvbXBhbnlfbWlkIjoiL20vMDFrOHg2IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiZjJXcGJDbkRTTUg3WGNKa0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXNzQkNvd0JRVTVWWDA1eFVuVjRRV2syTmpOcU1sbzNiekphZW1wbFJrRkJXbVpEVEd0VlFqaHlOWFpqY2podE1XMVZXWEY2ZUV3elRsaEhWekpEU0VaQ01tWkVTekJpWDJSdGNtaEtabUZYU0hkSldURmtNbFpETjJsNE5WTlJlbU5LT0dWdWFVbGFYMFpmYTFRemRXeG9aa3hVUkdkd1IzQmZVV1JaVUdSalpIbDFVSFpJV1ROU1FUbFRhemM0VlRVU0ZtMXViVU5aU1ZOa1JFNVROWFJCWVdWMFMxUm5RbEVhSWtGUFRWbFNkMEpNTTJVMWNsRTNSa2xVUkY4dGRHVm5PVU56UVZCYVlXNTVUR2MiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18zMyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBIZWxwT25lQmlsbGlvbiIsImxpbmsiOiJodHRwczovL2hlbHBvbmViaWxsaW9uLmNvbS9qb2IvZjQyYjhhNzc0MTNhZDQ0NGVlNTc0NjU3MTk2YTM0MjUvQ29uc3VsdGFudD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Technology Consultant - Research Services (Singapore)", "company_name": "Qualtrics", "location": "Singapore", "via": "via Qualtrics", "description": "The Qualtrics XM Platform™ is a system of action that helps businesses to attract customers who stay longer and buy more, to engage and empower employees to do the best work of their lives, to develop breakthrough products people love, and to build a brand people can’t imagine living without.\n\nJoining Qualtrics means becoming part of a team bold enough to chase breakthrough experiences - like building a technology that will be a force for good. A team committed to diversity, equity, and inclusion because of a conviction that every voice holds value, with a vision for representation that matches the world around us and inclusion that far exceeds it. You could belong to a team whose values center on transparency, being all in, having customer obsession, acting as one team, and operating with scrappiness. All so you can do the best work of your career.\n\nWe believe every interaction is an opportunity. Are we yours?\nThe Challenge\n\nThe Research Services Team is at the heart of Qualtrics... The initial onboarding experience and solution delivery establishes the client relationship and sets the tone for the partnership. We understand our client's goals and, as trusted advisors, recommend solutions to the challenges they face. We listen carefully to our clients and advocate for customers internally, driving operational improvements and product enhancements. We have impressive members on this team, and are always looking for more amazing talent!\n\nExpectations for Success\n\nYou will know you are doing a great job when you successfully onboard our clients and deliver solutions ultimately resulting in high renewal and expansion rates. You build strong, lasting relationships with clients, are a creative and analytical problem-solver. You support the Research Services Sales team in pursuit of large deals and the Product team to improve product features, have outstanding interpersonal skills to juggle multiple priorities, and are a superb communicator. Most importantly, you care deeply about our clients and provide them a world-class experience.\n\nA Day in the Life\n• Quickly become an expert on the Qualtrics Experience Management (XM) Platform and related solutions\n• Serve as main point of contact for clients during implementation and manage the project to completion\n• Design and document functional and technical requirements and help scope projects by understanding timelines and work\n• Solve complex technical implementations both independently and in a team environment\n• Clearly communicate solutions back to clients through phone and email\n• Train and teach clients on specific and new aspects of the Qualtrics Experience Management (XM) Platform and related solutions\n• Work with our Product Management and Engineering teams to solve problems and implementations\n• Continually adapt and develop in-depth product knowledge and learn new technologies\n\nPreferred Qualifications\n• Bachelor’s degree in Computer Science or Information Systems\n• 1-4 years of experience at a SaaS company\n• Proficient with HTML/CSS and Javascript\n• Superb communicator and problem-solver\n• Want to work at a fast-growing tech company\n\nWhat Differentiates Us From Other Companies\n• Work-life integration is deeply important to us - we have frequent office events, team outings, and happy hours\n• Qualtrics Experience Program - $2,800 AUD for an experience of your choosing (eligible after a year)\n• We take pride in our offices design aiming at fostering creativity from exceptional views to an open and collaborative workspace\n• On top of the standard benefits package we provide snacks, drinks, and free lunches in our office\n• We believe in sharing Qualtrics success which is part of the compensation for all employees\n• To learn more about what we value read about it directly from our employees Qualtrics Life stories", "extensions": ["2 days ago", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJUZWNobm9sb2d5IENvbnN1bHRhbnQgLSBSZXNlYXJjaCBTZXJ2aWNlcyAoU2luZ2Fwb3JlKSIsImNvbXBhbnlfbmFtZSI6IlF1YWx0cmljcyIsImNvbXBhbnlfbWlkIjoiL20vMDgwbm5mdCIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Im5wQ0N6M1F2UzNhMS1idHhBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhVamxUYVVNMk5sazNZamhTY0dwRlNuRkdhMHRJVVZoMVMzUnpSMWxzZFRSd2NWQmFRV3BDYm5saFdFbDRRbnA2V1hWU1NHeEJSbmR6Ym0xNmNFMU1aWE0yUm1wS01FZGhibDkyVW1ScmRIRTFTa1ZsY1ZwTk5XeEtXVXRHWlV3MmVIWXdRelZVY21aWFlsSkhMV2hsWm5CR1pqZFljMlZMZERneGJrWmlXV05MWlZVeFFURjRWMFZrVkRCWlVYVk1ibkpZTlc0NU9UaFBRMnBSRWhadGJtMURXVWxUWkVST1V6VjBRV0ZsZEV0VVowSlJHaUpCVDAxWlVuZERkbkkxZG0wNVRVdzRjRzB4TkRKbWN6SmhPSGR5Y21WdWNtcDMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY180MSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBRdWFsdHJpY3MiLCJsaW5rIjoiaHR0cHM6Ly93d3cucXVhbHRyaWNzLmNvbS9jYXJlZXJzL3VzL2VuL2pvYi8zMDA4OTM2L1RlY2hub2xvZ3ktQ29uc3VsdGFudC1SZXNlYXJjaC1TZXJ2aWNlcy1TaW5nYXBvcmU/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Lead Security Consultant", "company_name": "Sciente Inc", "location": "Singapore", "via": "via SCIENTE", "description": "An exciting opportunity as a Lead Security Consultant to provide strong technical leadership for a fastgrowing cyber security team in Singapore ! Our client is looking for the technical & top talents within the cyber security market to join their team !\n\nMandatory Skill(s)\n• At least 5 years of IT Security experience with strong leadership experience to manage junior teams and members;\n• Strong passion in the everchanging cyber security landscape;\n• Technically inclined with excellent experience in conducting vulnerability assessment and penetration testing against Open Web Application Security Project (OWASP) Top 10 security vulnerabilities and SANS Top 25;\n• Experience in reviewing operating systems, web applications, database servers, network devices, firewalls and infrastructure appliances;\n• Knowledge in information security principles such as cryptography and networking such as TCP/IP ports and protocols;\n• Good experience and understanding in tools such as HP Web Inspect... Fortify, IBM App Scan, Kali Linux / Backtrack, Burp Suite, Metasploit;\n• Strong problem solving and analytical skills with excellent oral and written communication, strong team player and interpersonal skills.\n• At least an Offensive Security Certified Professional (OSCP) / CREST Registered Penetration Tester (CRT) certifications is a MUST;\n\nDesirable Skill(s)\n• Good knowledge and experience in Advanced Persistent Threats (APT) and Cyber Kill Chain;\n• OSCE certified.\n\nResponsibilities\n• As a Subject Matter Expert in the areas of IT Security, including Risk Assessment, Vulnerability Assessment and Penetration Testing;\n• Provide leadership to manage team members and business stakeholders;\n• Perform technical reviews on servers, network devices and applications;\n• Responsible to maintain company's high integrity business processes, systems and applications to provide accurate, timely information;\n• Responsible for protecting the software applications, IT Networks and Infrastructure by preventing data security breaches, data leakage, and cyber threats;\n• Provide Application Vulnerability Assessment services on a global basis through comprehensive testing process;\n• Followup with respective owners on the actions to be taken from the Vulnerability Assessment outcome, ensuring that all issues detected are remediated accordingly;\n• Identify weaknesses and vulnerabilities within the systems and proposing/implementing countermeasures;\n• Involved in compliance and controls, selfassessment processes, documentation and research related tasks", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJMZWFkIFNlY3VyaXR5IENvbnN1bHRhbnQiLCJjb21wYW55X25hbWUiOiJTY2llbnRlIEluYyIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiRlpYLW9QbHZkZ0k5OU1JM0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBTQ0lFTlRFIiwibGluayI6Imh0dHBzOi8vd3d3LnNjaWVudGUuY29tL3NjaWVudGUtaW5jL3RlY2hub2xvZ3ktam9icy81Mzc2L2xlYWQtc2VjdXJpdHktY29uc3VsdGFudC8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Cloud Infrastructure Security Consultant", "company_name": "Avanade", "location": "Singapore", "via": "via Avanade Jobs", "description": "Do you know how to stop a sophisticated cyber threat? So do we.\n\nFortune 500 companies don’t need more cybersecurity: they need better cybersecurity. That’s where you come in. Working with us, you can help to protect some of the world’s biggest companies and keep their assets safe and secure.\n\nYour critical part in this role;\n\nYou recognize cybersecurity is the management of cyber risk associated with people, process, technology, and data. You understand the risks businesses face and how to use the Microsoft Ecosystem to design “Zero Trust - Identity and Data-Centric” solutions that will mitigate these risks and ensure compliance. You’re an astute advisor on Security Transformation, Security Strategy, and Security Operations (SOC). As a Cyber Security Consultant, you can effectively lead technical and non-technical teams.\n\nYou work as part of the team to;\n• Carry out threat and risk assessments and develop security architecture to mitigate threats\n• Advise clients on the security... implications of compliance and regulations such as OSFI, ISO, NIST, PCI, PIPEDA, GDPR, etc\n• Be the “Trusted Advisor” on best practices to protect information\n• Actively lead multiple engagements simultaneously and seamlessly\n• Mentor junior consultants\n• Actively seek and nurture opportunities for business development\n• Contribute to RFPs, scope security programs, and assist in closing sales opportunities\n• Actively participate in the development of cybersecurity offerings\n\nAbout you;\n\nYou’re passionate about understanding or discovering security vulnerabilities and aspire to be the “Trusted Advisor.” You know all about identifying, providing, and validating the security requirements of IT solutions, and you’ve done this in a consulting environment. You’re a skilled communicator who can effectively articulate cybersecurity risks to technical and non-technical audiences.\n\nYou probably have a Bachelor’s degree in technical disciplines such as (Computer Science, Engineering, Applied Mathematics, etc.) and preferably, a Master’s degree in Science, Engineering, or Business. You should have several years (6 plus) of consulting experience in systems and infrastructure engineering, focused on Cybersecurity.\n\nYour skills and experience include;\n• Methods and identification tools for risks and security threats\n• Having knowledge of information security standards (OSFI, ISO, NIST, PCI, PIPEDA, GDPR etc.)\n• Being proficiency in operating systems, database platforms, web technologies, firewalls, and programming languages\n• Having excellent communication skills in written and oral English and a Scandinavian language\n• Giving effective advice in large-scale technology projects while working at all levels - with clients and your team\n\nStrong technical skills to design and implement Azure Security services with hands-on experience on several, but not all, of the items outlined below:\n• Azure Security technologies such as:\n- Azure Monitor\n- Azure Log Analytics\n- Vulnerability scanning and policies\n- Application Gateways\n- Azure Firewall\n- Azure DDoS protection\n- Azure resource locks\n- Azure Policy\n- Database security\n• Security Operations:\n- Azure Security Center\n- Azure Sentinel\n• Patch management:\n- Azure Update Management\n• Application security\n• Information security\n• Identity and Access Management\n• Key management\n\nQualifying certifications:\n• Certified Information Systems Security Professional (CISSP)\n• Certified Information Security Manager (CISM)\n• Certified Cloud Security Professional (CCSP)\n• Azure Security Engineer (AZ-500)\n• GIAC Certified\n\nDon't see the exact right opening for you right now? Send us your information at Talent Community and we can stay in touch and let you know when such a position does come available", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDbG91ZCBJbmZyYXN0cnVjdHVyZSBTZWN1cml0eSBDb25zdWx0YW50IiwiY29tcGFueV9uYW1lIjoiQXZhbmFkZSIsImNvbXBhbnlfbWlkIjoiL20vMDk0NDU2IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoicUM4dTBJR1YwZl93MktBZUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXNzQkNvd0JRVTVWWDA1eFZFdFlNMDFGUTB0d2FsOXVRVEp3YUdsUVlsUXpaR3Q1VG1Oa1IwcElYMHh2YkVKV1RHWjJSMWhGY0RaV1FqVnFYMnBIVUZoTmRVeHNWM1J1VVhOUU0wcGxiMnd6TVhwaFFWZGlUM1Y2ZG1sU2VGZEtka1JmZDJoaFptcFRlR2hSVjJsclRIaGhURWRWWTB4UFQwcFlaV2Q0VTNWamNEZ3RMV0oxUzFrMGRucHNTVGhNTm1jU0ZtMXViVU5aU1ZOa1JFNVROWFJCWVdWMFMxUm5RbEVhSWtGUFRWbFNkMEZOVTA5aFdEZHlSMVZXVkdORFEzcHhZelpUY20xUVdVSnlabWMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY181MiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBBdmFuYWRlIEpvYnMiLCJsaW5rIjoiaHR0cHM6Ly9jYXJlZXJzLmF2YW5hZGUuY29tL2pvYnN6aHNnL0pvYkRldGFpbC9DbG91ZC1JbmZyYXN0cnVjdHVyZS1TZWN1cml0eS1Db25zdWx0YW50LzI3MDAyP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Education Consultant", "company_name": "Le Works", "location": "Singapore", "via": "via Laimoon.com", "description": "Le Works is an education service provider and is looking to expand its consultant team.\n\nAs this is a full commission position, we are looking for candidates with the following attributes:\n• B2C sales experience\n• Ability to reach out to the public\n• Love to help and serve others\n• A goal-getter\n• Independent and reliable\n• A team player\n\nJob Scope:\n• Encourage the public to sign up and attend WSQ courses\n• Meeting individual and team target\n• Provide administration support to the students\n• Set up and ensure the class runs smoothly\n• Support Manager with ad-hoc tasks\n\nBenefits:\n• Unlimited earning potential\n• Opportunity for promotion to management role position\n\nThe work location will be Bishan.\n\nIf you think that you fit the bill, please email your credential, attention to Mark, and we will like to meet you in person.\n\nJob Types: Full-time, Part-time, Internship, Commission\n\nSalary: $2,000.00 - $4,000.00 per month\n\nBenefits:\n• Flexible schedule\n\nSchedule:\n• Day shift\n• Flexible... hours\n• Holidays\n• Late shift\n• Monday to Friday\n• Weekends\n\nSupplemental Pay:\n• Commission pay\n• Performance bonus\n• Retention bonus\n\nCOVID-19 considerations:\nStaff to wear masks during work to protect themselves at all times.\n\nExperience:\n• B2C sales: 1 year (Preferred)\n\nWork Remotely:\n• No\n\nCOVID-19 Precaution(s):\n• Personal protective equipment provided or required\n• Social distancing guidelines in place\n• Sanitizing, disinfecting, or cleaning procedures in place", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJFZHVjYXRpb24gQ29uc3VsdGFudCIsImNvbXBhbnlfbmFtZSI6IkxlIFdvcmtzIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJDZVhTMlBPWUVWQXRqeWlxQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExhaW1vb24uY29tIiwibGluayI6Imh0dHBzOi8vam9icy5sYWltb29uLmNvbS9qb2JzL2V4dGVybmFsdmlldy8yNjAxNjc4Nj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Consultant - System Engineering (Messages)", "company_name": "Verizon", "location": "Singapore", "via": "via NodeFlair", "description": "You will be part of a team responsible for SaaS products for the DWP group that provides services globally to Verizon staff enhancing their communication and collaboration capabilities and play a key role in delivering and supporting SaaS products to the business.\n\nYou will work closely with a team of talented administrators, change management specialists, and internal stakeholders playing a key role in delivering and supporting SaaS products to the business. In this role, you will manage and support the various SaaS and on-prem products.\n\nYou’re a creative thinker who likes to explore, and uncover the issues. You’ll be constantly on the lookout for new features and ways to utilize the SaaS services, keeping up with evolving technologies and emerging industry trends.\n\nThe Primary Accountabilities Associated With This Position Include\n• Managing and troubleshooting SaaS systems including but not limited to Google Workspace, Slack, Proofpoint, CASB, data migration platforms, and... encryption software.\n• Effectively providing day-to-day Microsoft on-prem Exchange and SMTP email operational support to internal customers covering all Servers and Mail Relays within EMEA and APAC.\n• Providing cross-over with other team members as appropriate to deliver a consistent support function across Verizon.\n• Provisioning lead technical support when nominated on major projects undertaken within Verizon.\n• Involvement in implementation discussions working with non-technical stakeholders.\n• Identifying and driving opportunities to improve automation for the company; scoping and creating automation for deployment, management, and visibility of our services.\n• Mentoring junior IT and helpdesk personnel.\n• Vendor engagement for troubleshooting.\n• Daily monitoring and acting on alerts.\n• Leading recovery during outages and participating in on-call rotation.\n• User support/managing ticket queue.\n\nYou'll Need To Have\n\nWhat we’re looking for...\n• Bachelor's degree or four or more years of work experience.\n• Six or more years of relevant work experience.\n• Experience with and a high-level knowledge of one or more of: Slack, Google Workspace Enterprise administration, CASB concepts and use, data migration to SaaS.\n\nEven Better If You Have\n• A degree.\n• Experience supporting enterprise-level SaaS environments.\n• Strong troubleshooting skills, software configuration, and performance tuning for SaaS apps.\n• Strong knowledge of information security operations and best practices.\n• CISSP is a certification is a plus.\n• Google Workspace Administration Certification.\n• Google Migrate experience.\n• O365 and AD management experience.\n• Experience in a web-scale environment including load balancing and containerization.\n• Experience automating system and software configurations and deployments with Python, Javascript, powershell, and/or GAM.\n• Knowledge of log management systems (e.g., Splunk).\n• Strong knowledge of networking routing.\n• Experience with working directly with vendors on new features and roadmaps.\n• Ability to identify / prioritize tasks and work independently without micromanagement.\n• Excellent written and interpersonal communication and documentation skills", "extensions": ["9 days ago", "Full–time"], "detected_extensions": {"posted_at": "9 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDb25zdWx0YW50IC0gU3lzdGVtIEVuZ2luZWVyaW5nIChNZXNzYWdlcykiLCJjb21wYW55X25hbWUiOiJWZXJpem9uIiwiY29tcGFueV9taWQiOiIvbS8wN19kbiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IkcxbHNSa0YwNzhVV0QtSFVBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVzc0JDb3dCUVU1VlgwNXhVbVphUjNSNGFXVkxOakZ0Y0dkS2JqUlFaRzVuWWxZNU0xaHdUVVpVVEd0b1kwUmpNazVwYkU5V2JtbE1jbGt5ZFUxemVHWldhM1l0UTFaa1RrZHNaR1F6VFc0MFRtOXZOa040TFRaTVJFbFNWbWxOWVhCNVEzWXdZVVIzZFhGZmJtdFZaVUZoUW5wVVlYcGtSemw1Ulc5b2IwaGlVWGhPU0Rrd05FOXFhRWhYWTFaRlExSVNGbTF1YlVOWlNWTmtSRTVUTlhSQllXVjBTMVJuUWxFYUlrRlBUVmxTZDBGQlFUTnRXbTEzTW1aa09GVXhRM0ZCV2tKWVdHOVBWbnBqUTJjIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNjQiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTm9kZUZsYWlyIiwibGluayI6Imh0dHBzOi8vbm9kZWZsYWlyLmNvbS9qb2JzL2xpc3RpbmdzLzEyMTI0P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Business Operations", "value": "GC06"}, {"text": "Human Resources", "value": "GC15"}, {"text": "Accounting and Finance", "value": "GC01"}, {"text": "Sales and Retail", "value": "GC26"}, {"text": "Protective Services", "value": "GC23"}, {"text": "Science and Engineering", "value": "GC27"}, {"text": "Management", "value": "GC18"}, {"text": "Advertising and Marketing", "value": "GC03"}, {"text": "Legal", "value": "GC17"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Customer Service", "value": "GC10"}, {"text": "Social Services and Non-Profit", "value": "GC28"}, {"text": "Art, Fashion and Design", "value": "GC05"}, {"text": "Healthcare", "value": "GC14"}, {"text": "Energy and Mining", "value": "GC21"}, {"text": "Sports Fitness and Recreation", "value": "GC29"}, {"text": "Education", "value": "GC11"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "Consultant", "value": "consultant"}, {"text": "Senior consultant", "value": "senior consultant"}, {"text": "Security consultant", "value": "security consultant"}, {"text": "Recruitment consultant", "value": "recruitment consultant"}, {"text": "Lead consultant", "value": "lead consultant"}, {"text": "Associate consultant", "value": "associate consultant"}, {"text": "Principal consultant", "value": "principal consultant"}, {"text": "Financial consultant", "value": "financial consultant"}, {"text": "Functional consultant", "value": "functional consultant"}, {"text": "Presales consultant", "value": "presales consultant"}, {"text": "Technical consultant", "value": "technical consultant"}, {"text": "Application consultant", "value": "application consultant"}, {"text": "Associate", "value": "associate"}, {"text": "Devops consultant", "value": "devops consultant"}, {"text": "Pre-sales consultant", "value": "pre-sales consultant"}, {"text": "Consultants", "value": "consultants"}, {"text": "Development consultant", "value": "development consultant"}, {"text": "Engineer", "value": "engineer"}, {"text": "Hr consultant", "value": "hr consultant"}, {"text": "It consultant", "value": "it consultant"}, {"text": "Senior", "value": "senior"}, {"text": "Services consultant", "value": "services consultant"}, {"text": "Solution consultant", "value": "solution consultant"}, {"text": "Solutions consultant", "value": "solutions consultant"}, {"text": "Business", "value": "business"}, {"text": "Business consulting", "value": "business consulting"}, {"text": "Consulting", "value": "consulting"}, {"text": "Director", "value": "director"}, {"text": "Education consultant", "value": "education consultant"}, {"text": "Hcm consultant", "value": "hcm consultant"}, {"text": "Infrastructure", "value": "infrastructure"}, {"text": "Investment consultant", "value": "investment consultant"}, {"text": "Manager", "value": "manager"}, {"text": "Project manager", "value": "project manager"}, {"text": "Recruitment consultants", "value": "recruitment consultants"}, {"text": "Sap consultant", "value": "sap consultant"}, {"text": "Software engineer", "value": "software engineer"}, {"text": "Specialist", "value": "specialist"}, {"text": "Support consultant", "value": "support consultant"}, {"text": "Systems consultant", "value": "systems consultant"}, {"text": "Systems engineer", "value": "systems engineer"}, {"text": "Technology consulting", "value": "technology consulting"}, {"text": "Academy", "value": "academy"}, {"text": "Accountant", "value": "accountant"}, {"text": "Architect", "value": "architect"}, {"text": "Assistant director", "value": "assistant director"}, {"text": "Cloud consultant", "value": "cloud consultant"}, {"text": "Consultancy", "value": "consultancy"}, {"text": "Data engineer", "value": "data engineer"}, {"text": "Deputy director", "value": "deputy director"}, {"text": "Electrical engineer", "value": "electrical engineer"}, {"text": "Employee", "value": "employee"}, {"text": "Finance consultant", "value": "finance consultant"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Internship", "value": "INTERN"}, {"text": "Part-time", "value": "PARTTIME"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Accounting", "value": "/business/naics2007/5412"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Engineering Services", "value": "/business/naics2007/5413"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Real Estate", "value": "/business/naics2007/53"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Wholesale", "value": "/business/naics2007/42"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "SingTel", "value": "/m/020zfl"}, {"text": "EY", "value": "/m/0g9jc"}, {"text": "Infosys", "value": "/m/01k8x6"}, {"text": "SearchAsia Consulting Pte Ltd", "value": "/g/11fy260nhz"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "Deloitte SEA", "value": "/g/11f_g4x9d_"}, {"text": "Geco Asia", "value": "/g/11gk72_bt_"}, {"text": "OAKTREE CONSULTING", "value": "/g/11g70jfhtq"}, {"text": "Central Provident Fund Board", "value": "/m/0615qb"}, {"text": "NCS", "value": "/m/0282746"}, {"text": "Trustwave", "value": "/m/0n3xjf5"}, {"text": "Ensign InfoSecurity", "value": "/g/11g4jhymjr"}, {"text": "HCL SINGAPORE PTE. LTD.", "value": "/g/11fy25ngsv"}, {"text": "Horangi", "value": "/g/11fm41wdh3"}, {"text": "LINKBYNET", "value": "/g/11f00s44gb"}, {"text": "NTT", "value": "/m/05mybp8"}, {"text": "RECRUIT EXPRESS PTE LTD", "value": "/g/11g706hzhq"}, {"text": "Randstad", "value": "/m/08pt1z"}, {"text": "Randstad Singapore", "value": "/g/11g70b50mr"}, {"text": "UBS", "value": "/m/031rxp"}, {"text": "Xcellink Pte Ltd", "value": "/g/11c73prcqy"}, {"text": "Alight", "value": "/g/11fj9r012s"}, {"text": "Avanade", "value": "/m/094456"}, {"text": "Avensys Consulting", "value": "/g/11g7022gjf"}, {"text": "CBRE", "value": "/m/090r7m"}, {"text": "Golder", "value": "/m/02qx9bq"}, {"text": "Hitachi Solutions", "value": "/g/121lyvj9"}, {"text": "IBM", "value": "/m/03sc8"}, {"text": "Marsh & McLennan", "value": "/m/053rw"}, {"text": "Mott MacDonald", "value": "/m/043l4j"}, {"text": "NTT Ltd.", "value": "/m/01c3fq"}, {"text": "Qualtrics", "value": "/m/080nnft"}, {"text": "SAP", "value": "/m/01pf4l"}, {"text": "Techcom Solutions Pte Ltd", "value": "/g/11c73vztx3"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "Turner & Townsend", "value": "/m/0cfy6xp"}, {"text": "Thatz", "value": "/g/11dxpx4g1l"}]}]}