{"search_metadata": {"id": "608279268ccee006f93638b1", "status": "Success", "json_endpoint": "https://serpapi.com/searches/c1d5595deeec08bd/608279268ccee006f93638b1.json", "created_at": "2021-04-23 07:37:10 UTC", "processed_at": "2021-04-23 07:37:10 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28IT+analyst%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=30", "raw_html_file": "https://serpapi.com/searches/c1d5595deeec08bd/608279268ccee006f93638b1.html", "total_time_taken": 2.19}, "search_parameters": {"q": "(IT analyst) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "30"}, "jobs_results": [{"title": "Business Analyst", "company_name": "GECO Asia Pte Ltd", "location": "Singapore (+1 other)", "via": "via Monster Singapore", "description": "Job Description\nWe are looking for a Business Analyst, who is/are able to fulfill the following requirements:\nDuration: 18 Months\nRequirements:\n- Should possess at least a Diploma in Computer Science, Engineering or Equivalent.\n- Good knowledge of information technology, especially in the areas of technologies used in the project.\n- Good planning and coordination skills.\n- Good team player, responsible and conscientious.\n- Resourceful, independent, responsive and pro-active.\n- Proficiency in Office productivities suites such as Microsoft Office and Microsoft Project; proficiency in Open Office productivity suite would be advantageous.\n- At least 2 years of working experience in information technology\n- Experience in project management / project co-ordination.\n- Experience/certified in the relevant field of the project requirement\nRoles and Responsibilities:\n- Maintenance work planning\n- Develop maintenance work plan\n- Propose continuous improvement initiatives to strengthen... compliance, Cybersecurity posture, and improve work processes.\n- Compliance & Cybersecurity Management\n- Ensure system adhere to applicable standards, policies and directives.\n- Oversee annual self-check and rectification to address gaps.\n- Monitor and strengthen system security posture, ensure vulnerability is timely mitigated and patched, else seek waiver from relevant authority.\n- Support all audit activities. Oversee resolution of audit findings.\n- Incident/ Problem Management\n- To lead investigation and resolution of problems.\n- Perform defect trend analysis to address recurring incident.\n- Change and Service Request (CR and SR) Management\n- Gather requirements from Business Users and oversee CR and SR Assessment.\n- Seek approval from Change Control Board for CR and Ops Manager for SR implementation.\n- Manage CR and SR implementation to ensure satisfactory and timely delivery with users.\n- Detailed Requirement & Design Engineering\n- Track Configuration Changes\n- Analyse SR trends and propose improvement to the system.\n- Obsolescence Management\n- Track and manage Remediation for obsolete system components.\n- Manage the retirement and disposal of obsolete system components.\nPlease send your application to [Confidential Information] with (JOB_002384) in Subject line and highlighting:\n- Your relevant experience\n- Current/expected salary\n- Availability information\n- A latest MS-WORD Resume", "extensions": ["4 days ago", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJCdXNpbmVzcyBBbmFseXN0IiwiY29tcGFueV9uYW1lIjoiR0VDTyBBc2lhIFB0ZSBMdGQiLCJjb21wYW55X21pZCI6Ii9nLzExZ2s3Ml9idF8iLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJ1cEZBZGVidUtJOGdXMmFDQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdllCQ3JjQlFVNVZYMDV4VkZSeFJsRnFWMTlvVGpoSGNsUXRTVEZpWjJoT1NYRnFTRGxoVmtWdGFXdDNhMVJyYW1SeVZXWXdTMWR0ZEhWNVNFbHNkSGxMWTAwMU0yMW5VSG93WkRSVVNWWnFObGcyVEVWMVlWcFJNVTFYWDNRMldWbHVUMkpyTjB4Mk1VTnplalJhTFZCWmQwaG5WbDlLVW01eGRXZFdNbUYwUW1VM1ZtSkthMGx5ZW5ST1VsbHZSRFV3YUVaSVQwMDBjR2hZVUhKMkxYRlVSRjlOU3pSWWJFWjFWa3RMUlcxb01rTjNkbGwyY0doUFprMVZFaFpLTTIxRFdVb3lVRVkyVEdrMVRtOVFibDlwVldGQkdpSkJUMDFaVW5kQlQxQmZVRkJEV0hOa01WSkZlbVpRUTNwSVJYUnVZMnhIVmpkQiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzciLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTW9uc3RlciBTaW5nYXBvcmUiLCJsaW5rIjoiaHR0cHM6Ly93d3cubW9uc3Rlci5jb20uc2cvYW1wL2pvYi12YWNhbmN5LWJ1c2luZXNzLWFuYWx5c3QtZ2Vjby1hc2lhLXB0ZS1sdGQtc2luZ2Fwb3JlLTI3Nzg4MjgzLmh0bWw/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Digital Business Analyst", "company_name": "Government Technology Agency", "location": "Singapore (+1 other)", "via": "via Jobs", "description": "The Government Technology Agency (GovTech) seeks to transform the delivery of Government Digital Services by taking an outside-in\" view, putting citizens and businesses at the heart of everything we do. We also develop the Smart Nation infrastructure and applications, and facilitate collaboration with the public to co-develop technologies. Join us as we support Singapore’s vision of building a Smart Nation - a nation of possibilities empowered through info-communications technology and related engineering.Do you want to apply your skills, knowledge and energy to implement cutting-edge infocomm technology and digital solutions that will change the lives of Singaporeans and the public? In GovTech, you can!As a Digital Business Analyst, you will work in a Government Agency as a key member of the GovTech project team. You will support the Chief Information Officer at the Agency and collaborate with fellow project managers, solution architects and technical services consultants to deliver... leading-edge digital solutions. You are a pro-active, self-motivated and resourceful team member with good tech/digital knowledge and possess strong influencing and people handling skills. You are also adept at balancing multiple projects concurrently while constantly looking for new ways to apply digital technologies to meet identified Agency and citizen/business needs. What to Expect: You will be involved in a range of tasks including the following: partner with the Agency's business teams to elicit citizen/business needs through human-centric, visual methods such as service journeys and develop the appropriate business case work with fellow GovTechies and the Agency's project teams to develop user stories, functional/technical specifications and acceptance criteria evaluate and recommend suitable technology while aligning with GovTech's technology directions (such as cloud-based, enterprise architecture and modernization of legacy systems, adoption of ) identify and adopt the appropriate development methodology (e.g. Agile or Waterfall) in an Outsourced, Co-Sourced or In-house development environment ensure system or product readiness for smooth deployment, adoption and operations analyse impact of requested changes and propose improvements to continuously address changing business needs, and work with support team to understand and address technical problems (Operations & Maintenance phase) assist the CIO to identify new opportunities for the Agency’s digital transformation How to Succeed: Diploma/Degree in Computer Science, Infocomm Technology, Computer or Electronics Engineering or related subject area with minimum 3 years of relevant experience. Candidates with more years of experience will be considered for more senior roles Prior working experience in IT business analysis, application solutioning design and testing Participated in at least one full software or product development cycle, preferably using Agile Methodology Strong analytical, conceptualisation and problem-solving skills Good communication skills with the ability to pitch ideas and influence A driven and motivated personality with an inquisitive mind Ability to learn and apply Preferred Skills: Business Analysis certification, e.g. Certified Business Analysis Professional (CBAP) Past development or consulting experience Knowledge or experience in implementing projects in at least one of the following areas (Data Analytics, Agile Methodologies, Cloud, Internet and Mobile Technologies, Customer Relationship Management, Knowledge Management and Service Design) We are an equal opportunity employer and value diversity at our company as we believe that diversity is critical to innovation. We do not discriminate on the basis of race, religion, color, national origin, sex, gender, gender expression, sexual orientation, age, marital status, veteran status, or disability status. We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation. One more thing... Chat with our new AI-powered virtual recruiter if you would like to find out more about the role, working in GovTech, and Gayle can even submit your job application without going through the usual process below! ", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEaWdpdGFsIEJ1c2luZXNzIEFuYWx5c3QiLCJjb21wYW55X25hbWUiOiJHb3Zlcm5tZW50IFRlY2hub2xvZ3kgQWdlbmN5IiwiY29tcGFueV9taWQiOiIvZy8xMWdoMDUyOG5xIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiSml6QXlUaWpnUWtyM0F2RUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRW9zQ0Nzd0JRVTVWWDA1eFZHZFNjelZFZURjNFgzWXhNM0p3UkV4bGJtUnJja3B5VDI1c2JGZHFWMWx4V1dSU2NHc3phVFZ3VEV4cFVVZG5WVmRITVVSdE5uVktSRkF4ZWpkVVdIVkRUVU16ZUY5YWEwaHRVVGhRZVZoVVJrNUdRWFJxYldGa01rcE9TRFoyZGpoUFJVMXdVakZHVG13NVltRmhWemh1WWtJMVdISlJTbFY0U0ZZeVpGaHBaREJVVjFGemVVTnZibk5uWkVOQk1HVkRSWE5oYmtwc0xYUk1TalY2YWpCNmVIa3hWMHcwY1hWVU1FTlhTMDVmV2xoSFUxWmpUVzVmWTNoVGNXRTFTRWt6WW0xdkVoWktNMjFEV1VveVVFWTJUR2sxVG05UWJsOXBWV0ZCR2lKQlQwMVpVbmRCY3kxNmRUTlViM1ZXYURadk9FdG1TR1J3YkZKSmVrTXdaM0ZSIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMTUiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9icyIsImxpbmsiOiJodHRwczovL3NnLmZpZGFudG8uY29tL2pvYnMvam9iLW9wZW5pbmcvYnVzaW5lc3MtaW50ZWxsaWdlbmNlLWFuYWx5c3RzL2RpZ2l0YWwtYnVzaW5lc3MtYW5hbHlzdC0yNzc4ODIyMDc/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Business Analyst (Treasury Operations), Group Operations & Technology", "company_name": "OCBC Bank", "location": "Singapore", "via": "via EFinancialCareers", "description": "Business Analyst (Treasury Operations), Group Operations & Technology\n\nKey Roles & Responsibilities\n\n• Evaluate business processes, anticipate requirements, and provide compelling and innovative solutions\n• Ensure solutions meet business needs and requirements\n• Stay up-to-date on the latest process and technology to automate and modernize systems\n• Work closely with business, technology and other stakeholders from project initiation, testing to deployment\n• Understand business requirements and translate them into functional specifications\n• Act as a liaison between business and technology users\n\nQualifications\nRequirements\n\n• Strong Business Domain knowledge and work experience in Treasury Operations\n• Certified Scrum Master or Certified Scrum Product Owner or good experience in Agile development methodologies\n• Strong analytical skills with the ability to assimilate information quickly and gain consensus from multiple stakeholders when required\n• Good oral and written communication... skills, including documentation and presentation skills\n• Comfortable communicating across business divisions and levels of seniority *LI-MLIU", "extensions": ["21 hours ago", "Full–time"], "detected_extensions": {"posted_at": "21 hours ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJCdXNpbmVzcyBBbmFseXN0IChUcmVhc3VyeSBPcGVyYXRpb25zKSwgR3JvdXAgT3BlcmF0aW9ucyBcdTAwMjYgVGVjaG5vbG9neSIsImNvbXBhbnlfbmFtZSI6Ik9DQkMgQmFuayIsImNvbXBhbnlfbWlkIjoiL20vMDU1cjI3IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiRURSSWNESml5QW9fX0EwbUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFZEVjRVMll0VEUxWGVVUmxURTFGV1RKYVNsQnpRVlkyWTFkUFQweEpUVUpIUW5BNFpWQlVUR0pXY1RWQ2RtVm9UR3BFU0hWWlZtZEtRelJvYW5KWVVGaFpjV2RVWDI5UGJWSkVkVmhCYWxwSmMzWkxhVzlOY1dWQk5qbDRjRXcyTVZFdFpIUkZNVGRvYkZkelNETTFNRVpEVVdsRVJGZGFSak5SVmpCWFIyTnlRbk5hTWsxcFJHSXdVekZuUjNkTUxTMHdVMXBuZDFRd1NIQkJFaFpLTTIxRFdVb3lVRVkyVEdrMVRtOVFibDlwVldGQkdpSkJUMDFaVW5kRFp6SXpaVGQwWjE4MFdXSkZNVmxqTVRRdE9EVnpSRkIyVlZSQiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzIzIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEVGaW5hbmNpYWxDYXJlZXJzIiwibGluayI6Imh0dHBzOi8vd3d3LmVmaW5hbmNpYWxjYXJlZXJzLnNnL2pvYnMtU2luZ2Fwb3JlLVNpbmdhcG9yZS1CdXNpbmVzc19BbmFseXN0X1RyZWFzdXJ5X09wZXJhdGlvbnNfR3JvdXBfT3BlcmF0aW9uc19fVGVjaG5vbG9neS5pZDEwNzE3NDA5P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Functional Business Analyst - SG", "company_name": "Deloitte SEA", "location": "Singapore", "via": "via Jobs At Deloitte Southeast Asia - Deloitte", "description": "What impact will you make?\n\nAt Deloitte, we offer a unique and exceptional career experience to inspire and empower talents like you to make an impact that matters for our clients, people and society. Whatever your aspirations, Deloitte offers you unrivalled opportunities to realise your full potential. We are always looking for people with the relentless energy to push themselves further, and to find new avenues and unique ways to reach our shared goals.\n\nWork you will do\n\nThis role sits within the and Marketing (C&M) team of Deloitte Southeast Asia, which is a part of Deloitte that uses technology and creativity to better connect the with the business.\n\nBetter known as Deloitte Digital, we use emergent technology to imagine, deliver, and run entirely new business futures. We create innovative ventures, digital platforms, and more meaningful experiences.\n\nAs part of & Applied Design team, you will help our clients to navigate a profitable path through new digital business models... offerings their customers will love, new digital experiences, and transformational end-to-end their digital strategies.\n\nAs a Customer Strategist within Deloitte Digital, you are part of a team of creative, visionary minds of many disciplines who put future-forward thinking into projects that push the edges of technology to support the digital change of our clients. You’ll build and nurture positive working relationships with teams and clients with the intention to exceed client expectations. You will:\n\n• Able to manage a team of designers / business analysts / designers\n\n• Owns project goals leveraging expertise to inspire a sense of shared purpose within the project team\n\n• Organises new challenges and drive business results\n\n• Uses best practices to fit the stakeholders/customers’ needs and deliver within budget on desired outcomes\n\n• Drives end results of the project as a representative of the firm\n\n• Digital capability assessments and roadmap, operating model design and transformation, data monetization, marketing and mobility strategy\n\n• Appreciates digital technology architectures leveraging APIs and\n\n• Prepares, maintains, and submits clear and concise activity/progress reports and time recording/management reports\n\n• Has experience in driving business outcomes by helping clients design and drive strategies based on data insights\n\n• Digital strategy and innovation, digital capability assessments and roadmaps, transformation business cases, agile operating model design and implementation, advanced analytics use case and data management process design, marketing automation, functional design of digital capabilities\n\n• Promotes good working relationships across a project, cultivating the people skills needed to develop trust and communication among all of a project’s stakeholders\n\nEnough about us, let's talk about you\n\n• Bachelor’s degree in Economics, Engineering, Business Strategy or similar required; advanced degree (Master’s, MBA, etc.) would be a bonus\n\n• Experience in technology and digital transformation will be beneficial\n\n• Relevant management consulting experience, e.g. growth strategy development, business case creation, experience strategy and journey design, segmentation and advanced analytics model creation, operating model and process design, etc.\n\n• 5+ years of experience in business consulting / digital agencies\n\n• Agile certification (scrum master – PSM / CSM) will be beneficial\n\n• Ability to develop project plans, manage individual deadlines and goals\n\n• Ability to identify issues and problems, generate solutions and choose appropriate alternatives using basic root cause analysis\n\n• Manage project scope by assessing requirements changes, determining and conveying impact on budget, time and risk\n\n• Manage client expectations, anticipates operational and tactical risks and tracks them; clarify, identify, and track requirements and issues, remove barriers, resolve minor project issues and escalate to immediate manager where required.\n\nNext Steps\n\nSo what are you waiting for? Join the winning team now.\n\nDue to the volume of applications, we regret only shortlisted candidates will be notified", "extensions": ["8 days ago", "Full–time"], "detected_extensions": {"posted_at": "8 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJGdW5jdGlvbmFsIEJ1c2luZXNzIEFuYWx5c3QgLSBTRyIsImNvbXBhbnlfbmFtZSI6IkRlbG9pdHRlIFNFQSIsImNvbXBhbnlfbWlkIjoiL2cvMTFmX2c0eDlkXyIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IlJNR25EdmZjUFNhVW0wcGpBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhVVGRKVEdSVFkzTmFkSE5HYkZoTFVIazBkWEExZEU5QmFsaGxSREZZWWxOWVEyVjFaV0oyVFdKVVVpMWZWVGxFVm1wNU56WTNaRkJpVFZsUE5HeFFMV1pCWlRaaVV6aGhiMk0xZUd4Vk1VRnBOVWRTTlhOZldFSkVUa056WDJKaVpqaElVek5YZHpSdk5tNUdUM2RSYUVwUWNGODNNR2hEU3pocGFtMDRkRGh5Y2psd1VGbFNNWFJUUlZkeFQxVjROemRtWWt0aGNtTTVaVEJSRWhaS00yMURXVW95VUVZMlRHazFUbTlRYmw5cFZXRkJHaUpCVDAxWlVuZEJNRGx6TVVSeWNHdFpVbU5WUWxaZlpHbFhNRll4ZUc1emJIQkIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18zMCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIEF0IERlbG9pdHRlIFNvdXRoZWFzdCBBc2lhIC0gRGVsb2l0dGUiLCJsaW5rIjoiaHR0cHM6Ly9qb2JzLnNlYS5kZWxvaXR0ZS5jb20vam9iL1NpbmdhcG9yZS1TZW5pb3ItRnVuY3Rpb25hbC1CdXNpbmVzcy1BbmFseXN0LVNHLzU3Njc1NzExMC8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Project Analyst (Scrum certified)", "company_name": "EBC CONNECT PTE. LTD.", "location": "Singapore", "via": "via Singapore Job Mela", "description": "SCRUM Certified is highly preferredIndustry: Container ShippingResponsibilities:Effectively capture requirements and user stories from business users.Successfully communicate these requirements to the IT and development teams and ensure the work is carried out to a satisfactory level prior to deployment.Fully understand the interdependencies of various business processes, workflow and requirements to drive the implementation of functional, process and product initiatives for each transformation stage.Prepare estimates and detailed project plans for each phase of the project and when required procure adequate resources to achieve project objectives in planned timeframes.Manage actuals vs budget implementation hours, and communicate revised budgets for any scope changes.Work creatively and analytically in a problem-solving environment using proven methodologies.Demonstrate leadership, teamwork, stakeholder management and excellence.Assist the Business Transformation Head in delivering... appropriate and effective executive level communication through weekly progress reports, proposals, requirements documentation and presentations to various audiences of the team and internal business stakeholders.Educating team members and enforcing best SCRUM practice within the business transformation team.Requirements:Degree holder or equivalent.Certification and proven experience in SDLC Methodologies, Agile, SCRUM is preferred.Skilled in project management best practices to manage on-time on-budget goals, and deliver project milestones.Certified Scrum Product OwnerCertified PMP and/or Prince2 preferredWorking experience:+4 years of experience working on complex agile scrum projects.+4 years’ experience working in a software project as a qualified scrum product owner.1+ years of project management experience working on software projects is preferred.Proven experience in managing transformation and process reengineering projects involving software (build/buy) technology components.Experience in managing software Implementation, and running software development team.Interested candidates please forward your updated CVs in MS Word format to [email protected]Reg ID: R1984062EBC Connect Pte LtdLicence no. 17C8975", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IEFuYWx5c3QgKFNjcnVtIGNlcnRpZmllZCkiLCJjb21wYW55X25hbWUiOiJFQkMgQ09OTkVDVCBQVEUuIExURC4iLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6InlRN292Um1tUEwwNVlsMVNBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gU2luZ2Fwb3JlIEpvYiBNZWxhIiwibGluayI6Imh0dHA6Ly93d3cuc2luZ2Fwb3Jlam9ibWVsYS5jb20vY2VudHJhbC1qb2JzL3Byb2plY3QtYW5hbHlzdC1zY3J1bS1jZXJ0aWZpZWQtOTMwNzE/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Associate Strategy & Portfolio Innovation Analyst", "company_name": "Underwriters Laboratories Inc.", "location": "Singapore", "via": "via UL - ICIMS", "description": "At UL, we know why we come to work.\n\nThousands of us around the world wake up every day with a common purpose: to make the world a safer, more secure and sustainable place. Science is in our DNA; we are endlessly curious and passionate about seeking and speaking the truth. We take delight in knowing that our work makes a meaningful contribution to society, and we are proud that our culture is centered on integrity, collaboration, inclusion and excellence. UL stands at the forefront of technological advancement, and we are continually challenged to find new ways to foster innovation and positive change. Satisfying? Yes. Exciting? Absolutely!\n\nUnderwriters Laboratories (UL) is the world's leading organization specializing in product safety testing and certification. Founded in 1894, UL has earned a reputation as a world leader in the development, testing and certification of product safety standards, with more than 1400 safety standards that serve as the foundation for nearly 200... industries. The UL Mark is recognized worldwide and its reputation for helping manufacturers around the world design products that are safe for users remains unmatched.\n\nWhat you’ll learn & achieve:\n\nWe are hiring for Associate Strategy & Portfolio Innovation Analysts to be responsible for coordination of our Testing, Inspection and Certification (TIC) business' strategic plans to ensure the continued successful growth and profitability.\n\nWe are building a new team to look at our Industrial and Consumer customer operating units to identify and evaluate acquisitions, divestitures, and organic business opportunities that are in line with the organization's long-range goals. This role will also be involved in market intelligence monitoring, market research, market intelligence, and knowledge management.\n• Supports strategy, business development and/or corporate initiatives, including collaborating with business lines across Regional and Functional areas.\n• Identifies, prioritizes, and assists in executing activities required to support strategies, priorities, and special initiative projects.\n• Supports the prioritization of corporate strategic initiatives, and evaluates investment opportunities for their strategic and financial value.\n• Communicates and generates support for recommendations among business leaders across the organization.\n• Compiles and analyzes financial information, and develops integrated revenue and expense analyses, projections, reports, and presentations.\n• Identifies trends and developments in competitive environments and presents findings to management.\n• Conducts industry, market, competitive, and stakeholder intelligence research and analyses.\n• Where necessary support M&A activities including deal pipeline management, deal sourcing, commercial due diligence and post-merger integration work initiatives.\n• Maintain M&A content and support periodic reporting of M&A initiatives to senior executives.\n• Work with leadership on the management of overall business strategy & long-range planning activities.\n• Read and follow the Underwriters Laboratories Code of Conduct, and follow all physical and digital security practices.\n• Performs other duties as directed.\n\nWhat makes you a great fit:\n• At least University Degree in in Business Administration, Finance, or related field.\n• Ability to work within a complex and often ambiguous environment.\n• Ability to handle multiple projects with proven success in synthesizing large data sets related to a wide variety of functional business problems.\n• Demonstrated ability to express complex ideas, present results, and translate statistical and business terminology to various levels of management.\n• Demonstrated strong analytical and strategic thinking abilities.\n\nWhat you’ll experience working at UL:\n• Mission: For UL, corporate and social responsibility isn’t new. Making the world a safer, more secure and sustainable place has been our business model for the last 125 years and is deeply engrained in everything we do.\n• People: Ask any UL employee what they love most about working here, and you’ll almost always hear, “the people.” Going beyond what is possible is the standard at UL. We’re able to deliver the best because we employ the best.\n• Interesting work: Every day is different for us here as we eagerly anticipate the next innovation that our customers’ create. We’re inspired to take on the challenge that will transform how people live, work and play. And as a global company, in many roles, you will get international experience working with colleagues around the world.\n• Grow & achieve: We learn, work and grow together with targeted development, reward and recognition programs as well as our very own UL University that offers extensive training programs for employees at all stages, including a technical training track for applicable roles.\n\nLearn More:\n\nCurious? To learn more about us and the work we do, visit our company page www.UL.com", "extensions": ["17 days ago", "Full–time"], "detected_extensions": {"posted_at": "17 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBc3NvY2lhdGUgU3RyYXRlZ3kgXHUwMDI2IFBvcnRmb2xpbyBJbm5vdmF0aW9uIEFuYWx5c3QiLCJjb21wYW55X25hbWUiOiJVbmRlcndyaXRlcnMgTGFib3JhdG9yaWVzIEluYy4iLCJjb21wYW55X21pZCI6Ii9tLzAxcTFnaiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImV0MzVLOVJIazAzRFQ0WlJBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVvc0NDc3dCUVU1VlgwNXhVVEF0WVdZMGNIUkxVRnAyVmxOek9YWkthV1paY2taS1EyWnJSa1ZrVW1WaGRHSjFTV3hNV2s0NGRrb3lia1l4ZVhsVVJYSXdNbFZSUVVSSU1VTndMVVUzTUVnek9IaG9ZVU5YWVdwaVYzRlFTazFpYW5GSlgyNUtjbGRSUlhwek1uZFliblZsY0dsaFdqSnJVVUZ6TFcxUlJWWlhNa0pHV0ZKc2RtWmlWMmhQTTFONVQyZGFNM0ZpY2tWdVFuYzVkbEZXV0RNMmQyaFphV3Q0WWw5TFVETTFjSFp0Wm1oMGF6SlZZMHd4TTJ4ZloxSnlielYzV1RGT1FuaDZjRlp1VW5VelQyVnJFaFpLTTIxRFdVb3lVRVkyVEdrMVRtOVFibDlwVldGQkdpSkJUMDFaVW5kRVQyNVFjMEZRTVVSalNtSmxlbE4xWm5KcFgxZHViMlZKT0hObiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzQxIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFVMIC0gSUNJTVMiLCJsaW5rIjoiaHR0cHM6Ly9ub251c2VuZ2xpc2gtdWwuaWNpbXMuY29tL2pvYnMvMjI2OTkvYXNzb2NpYXRlLXN0cmF0ZWd5LSUyNi1wb3J0Zm9saW8taW5ub3ZhdGlvbi1hbmFseXN0L2pvYj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior Business Analyst", "company_name": "Sciente Inc", "location": "Singapore", "via": "via SCIENTE", "description": "An excellent opportunity to contribute to the to business change and digital transformation journey of a well established organization in the entertainment / hospitality industry. Seeking a dynamic Business Analyst with good communication skills and and a strong technical background.\n\nMandatory Skill(s)\n• Degree in Computer Science, Engineering, Information Systems;\n• At least 4 years of business analysis experience supporting and/or implementing IT systems and applications;\n• Strong experience in requirements gathering, impact analysis, functional testing ( UAT ) and documentation;\n• Ability to visualize business requirements from a technical implementation perspective with a strong interest in process-re-engineering;\n• Excellent interpersonal skills to efficiently manage interactions with business users , stakeholders and technical personnel;\n• Good understanding of end to end Software Development Lifecycle ( SDLC );\n• Analytical thinker with good problem-solving skills and... attention to detail;\n• Strong communication, presentation, and technical writing skills.\n\nDesirable Skill(s)\n• Experience in Agile development methodology;\n• CCBA or CBAP certification from IIBA or any other relevant certification.\n\nResponsibilities\n• Responsible for understanding the business processes and evaluating the viability and feasibility of implementing them;\n• Collaborate with business users to identify requirements and translate them into functional specifications;\n• Liaise between users and technical IT teams throughout the SDLC;\n• Develop test cases and coordinate with business users to verify that the technical implementation is in accordance with business requirements;\n• Concurrently support multiple applications systems and platforms;\n• Assist in monitoring and reporting of project progress, issues and risks to ensure deliverables are on track;\n• Ensure that relevant project documentation is maintained as per corporate standards and guidelines", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQnVzaW5lc3MgQW5hbHlzdCIsImNvbXBhbnlfbmFtZSI6IlNjaWVudGUgSW5jIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiI2ZVZaVVh0ZjJkdGJOWkxBQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFNDSUVOVEUiLCJsaW5rIjoiaHR0cHM6Ly93d3cuc2NpZW50ZS5jb20vc2NpZW50ZS1pbmMvdGVjaG5vbG9neS1qb2JzLzUyOTYvc2VuaW9yLWJ1c2luZXNzLWFuYWx5c3QvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Business Analyst #SGUnited at Kydon Group", "company_name": "Kydon Group", "location": "Singapore (+1 other)", "via": "via BizLINKS Resources Pte Ltd", "description": "Business Analyst #SGUnited at Kydon Group\n\nEmployer Referral\n\nJob Description\n\nScope of Work Perform business analysis such as assess current state, analyses stated requirements of stakeholders to define business needs; Source and evaluate alternatives to identify solution that best fits business need, identify gaps, and determine workarounds/changes to the solution. Assess deployed solutions to see how well they met the original need; Work closely with business users and project team members on project initiation, solution design, implementation, deployment and post implementation support; Lead the solution design effort and help to develop innovative solutions while complying to existing standards, guidelines and processes; and Manage conflicts, issues and changes to ensure stakeholders and project team remain in agreement on solution scope, communicate and manage expectations of stakeholders. Requirements Diploma / Degree in IT or equivalent; At least 3 years of relevant... experience; Business Analysis certification (Certification of Competency in Business Analysis™ (“CCBA®”), Certified Business Analysis Professional™ (CBAP®)) or an equivalent certification will be an added advantage; Analytical, conceptualisation and problem-solving skills; Ability to perform qualitative, quantitative and root-cause analysis; Pro-active, resourceful and self-motivated to innovate and take smart risks to achieve business goals; Good communication skills, both oral and written, with the ability to pitch ideas and influence stakeholders; Knowledge of design thinking and workshop facilitation will be an added advantage. Show more\n\nOriginal Joblink : https://sg.linkedin.com/jobs/view/business-analyst-%23sgunited-at-kydon-group-2202446559", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJCdXNpbmVzcyBBbmFseXN0ICNTR1VuaXRlZCBhdCBLeWRvbiBHcm91cCIsImNvbXBhbnlfbmFtZSI6Ikt5ZG9uIEdyb3VwIiwiY29tcGFueV9taWQiOiIvZy8xMWZocWpzcDB6IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiRXl2bXAwTVROb1YydVBpekFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFZEVldXRTB3VVZCa1JEVk9jR1pTV0VoTFYybzNURXhYV2kxclYxTlhTRW8zWmxCV01tTktVR050V25sclpqTXpRbDlSY2xCa1RsWnNaWFZ3YVVOellrRlFWMWhXU1dac1psVlZMV2N5ZVV3elJXWkNiRFJIYm5ReFVYcFdTVlY1UmtoaVFrMDVja1ZHTm10b2VuSmFhbE01VldkTU1VbENWRFpGUWpWQ1NtTk1Va0phZVhOeFRVaDNOSGRNTlRocWJEazBWemxyZUhSVFVFMW5FaFpLTTIxRFdVb3lVRVkyVEdrMVRtOVFibDlwVldGQkdpSkJUMDFaVW5kRVlVRkRZMVV0VlZKNlp6ZHRSazB6YjFwblVqTjVkMUl6ZVdWbiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzUyIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJpekxJTktTIFJlc291cmNlcyBQdGUgTHRkIiwibGluayI6Imh0dHBzOi8vd3d3LmJpemxpbmtzcmVzb3VyY2VzLmNvbS5zZy9pbmRleC5waHAvam9iLWxpc3RpbmdzLXB1YmxpYy85MS1hbmFseXN0cy8zODEwLWJ1c2luZXNzLWFuYWx5c3Qtc2d1bml0ZWQtYXQta3lkb24tZ3JvdXA/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "L2 Security Analyst - WL-FNC210324 013/01", "company_name": "Xcellink Pte Ltd", "location": "Singapore (+1 other)", "via": "via Workable For Job Seekers", "description": "The Company:\n\nOur client is a Government organization. With their expansion scheme, they are now looking L2 Security Analyst.\n\nThe Role:\n• Produce intelligence outputs to provide an accurate depiction of the current threat landscape and associated risk through the use of customer, community, and open source reporting.\n• Produce actionable intelligence information for delivery to colleagues and customers in the form of technical reports, briefings, and data feeds.\n• Participate in regular threat focus meetings.\n• Perform detailed investigative works into all traffic anomalies against established, historical baselines of individual agencies.\n• Review and profile the events of all monitored clients.\n• Build rules and intelligence to detect threats and proliferate to all monitored networks.\n• Implement and devise detection method of threats in security operations.\n• Filter and fine-tune the security events flowing to databases\n• Prepare training programme for L1 Security Analyst.\n•... Conduct knowledge sharing sessions for L1 Security Analyst.\n• Monitor real-time third party security feeds, forums, and mailing lists to gather information on vulnerabilities and exploits related to the client.\n• Assess each event based on factual information and wider contextual information available\n• Attend customers’ review meetings as-and-when needed.\n• Minimum Diploma grad with module in IT or Cyber Security\n• 'Minimal 2 years of relevant working experience in SOC as security analyst with hands-on experience in monitoring, triage, analysis and incident management of real time security events\n• Familiar with SOC processes\n• Hands-on experience in Unix/Linux and Windows administration\n• Strong foundation in Internet protocols (TCP/IP) and security concepts\n• Hands-on experience in Security Information Event Management System (SIEMS)\n• Strong ability to understand and analyse log and network packet data\n• Strong foundation in security threat and attack countermeasure\n• Analytical problem solving and troubleshooting skill\n• Effective time management and organisational skill\n• Effective communication skill\n• Operational knowledge on SIEMS, Breach Detection System, Network Forensic System\n• Good communication skills (verbally, reading & in writing)\n• Ability to follow predefined procedures, policies & processes, work under pressure;\n• Advantages for those in Possession of security Analyst certification eg Certified Ethical Hacker (CEH), Certified Security Analyst (ECSA) or Computer Hacking Forensic Investigator (CHFI) will be advantageous but not mandatory.\n\n$2,600 - $ 3,200 + End of contract Bonus\n\n8:30am - 6:00pm (Monday- Friday", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJMMiBTZWN1cml0eSBBbmFseXN0IC0gV0wtRk5DMjEwMzI0IDAxMy8wMSIsImNvbXBhbnlfbmFtZSI6IlhjZWxsaW5rIFB0ZSBMdGQiLCJjb21wYW55X21pZCI6Ii9nLzExYzczcHJjcXkiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJ1SjhjNGJIYUN2V0VVTERvQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdllCQ3JjQlFVNVZYMDV4VVdsNFVXRk9ORUo2UVVsUWMwbFBOMnRPYjJoaFduVklZbWx1WjFwbU5VMXllak5oUVZsMGVUSkZlVTlaTmtOUGVUZDRhbkpMWWxCcFl6RjZRbTlvYWxGalFrSlVhbGRQUkRCTFQwUkhhVkpUYTFSaWQxZGhaa2swTTFoZldqVnliaTFGVUROR09XNVJVMDlTU1ZWcWRGbFhka1pTUlhoNWVqUmxNSEJHVEZCSVVHMW9iVlJIWVZCS1gwVmFPRFl5VjNJek0yOXNZV2Q0T1RaVGVHUlJibk4zZHpVNFpFUkxRVzl4WWtoVFZIUjNFaFpLTTIxRFdVb3lVRVkyVEdrMVRtOVFibDlwVldGQkdpSkJUMDFaVW5kQmVXMWtWRGx0WkhobVNUSkdjbEJRY3psVGFubGlibUl0YjJwQiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzU4IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFdvcmthYmxlIEZvciBKb2IgU2Vla2VycyIsImxpbmsiOiJodHRwczovL2FwcGx5LndvcmthYmxlLmNvbS94Y2VsbGluay9qL0U5Rjg4MThBMzEvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Principle Business Analyst, Omni Channel APAC Job", "company_name": "Boston Scientific", "location": "Singapore", "via": "via Jobs At Boston Scientific", "description": "Purpose and Passion • Comprehensive Benefits • Life-Work Integration • Community • Career Growth\n\nAt Boston Scientific, you will find a collaborative culture driven by a passion for innovation that keeps us connected on the most essential level. With determination, imagination and a deep caring for human life, we’re solving some of the most important healthcare industry challenges. Together, we’re one global team committed to making a difference in people’s lives around the world. This is a place where you can find a career with meaningful purpose—improving lives through your life’s work.\n\nAbout the role:\n\nDigitization is the key strategic direction to transform the commercial operations model of Boston Scientific to provide exceptional customer experience and deliver better patient outcome to drive strong business growth.\n\nThis role will be responsible for the analysis, setup, and execution of various Omni Channel initiatives with the Boston Scientific APAC region to meet the... business needs of the company. This role supports the design and configuration of Omni Channel solutions and is also responsible for deploying a system that meets the business strategy across business units and franchises, executes testing, and writes configuration and/or technical documentation. This individual will be required to communicate and coordinate with business management, project executives, Marketing and Sale organization, and Distribution Partners to ensure appropriate integration of processes across the organization. The role collaborates with the central capability team, and division heads of the assigned area, to support the business needs of the company.\n\nKey Responsibilities:\n• Drive the deployment of Omni Channel solutions from identifying business opportunities, evaluation through implementation to support end-to-end Omni Channel business processes.\n• Works with Business and Technical resources to design and create Boston Scientific APAC’s end-to-end Omni Channel business process flows, technical solutions, and integration with 3rd party tools.\n• Participate in all phases of the solution delivery including the creation of functional specifications, creation of technical specifications, data mapping, test planning, test management, test execution, collaborate with business function to provide training and deployment; consult with technical analysts and developers as needed to develop customized solutions\n• Facilitate requirements gathering sessions with all levels of business and technical teams.\n• Coordinate testing activities associated with any new development or modification to any systems or business processes directly or indirectly associated with the end-to-end Omni Channel business process.\n• Continually evaluate the current business process. Demonstrate thought leadership in the Omni Channel space by continuing to evaluate current capabilities to identify new opportunities that improve the business process and the supporting systems.\n• Work with the business teams to become a highly sought-after strategic business partner.\n• Collaborate with the data science team to quickly propose and work to identify capability gaps, identify plausible solutions, develop prototypes, and implement new functionality based on business needs.\n• Provide ad hoc training and consulting to business users as required in both run and maintain activities, such as remedial training, issue resolution, etc.\n• Contribute to the evaluation, implementation, and ongoing use of 3rd party vendor solutions associated with the end-to-end Omni Channel business process.\n\nWhat we’re looking for in you:\n\nKey Skills & Experiences:\n\nTo be successful, you should be an experienced Business Analyst with the following skills:\n• Bachelor’s degree in computer science/information technology or equivalent\n• 8+ years of experience with leading exploratory business requirements, solution validation, and design workshops with 3+ years of experience working with E-commerce, or more accurately, Omni Channel solutions.\n• Experience in enhanced content delivery, asset transformation management, and digital content analysis\n• 5+ years of practicing in data management and data governance\n• Experience working in the healthcare industry\n• Ability and proven track record in applying agile framework with a solution-driven approach\n• Demonstrated skill in Data configuration/governance, channel mapping, base syndication/management to enhanced content, workflow management, and reporting automation\n• Ability to engage various stakeholders in a multination environment virtually.\n• Ability to create and meet timelines cognizant of business needs and constraints.\n• Highly self-motivated, driven work ethic, keen attention to detail, and exceptional customer service orientation.\n• Ability to collaboratively work directly with distributors, internal business partners, outside consultants, and IT team members\n• Strong communication skills including the ability to communicate technical information understandably to non-technical audiences through writing and presentations.\n• Ability to multi-task and prioritize in a fast-paced environment.\n• Strong analytical skills; ability to perform system analysis and draw conclusions by relating information from different sources, including root-cause analysis and issue resolution.\n\nPreferred Qualifications\n• Hands-on experience in putting machine learning into business operations\n• Hands-on experience in using RPA to deliver business objective\n• Hands-on experience with Adobe Experience Manager\n• Hands-on experience with Adobe Captivate Prime\n• Understanding of AWS and SFDC platform\n• Certified Scrum Product Owner and/or Certified Scrum Master\n• 5+ years Working in a global organization within a multi nation company\n\nThe position is on local employment contract ONLY\n\nAbout us\n\nAs a global medical technology leader for more than 35 years, our mission at Boston Scientific (NYSE: BSX) is to transform lives through innovative medical solutions that improve the health of patients. If you’re looking to truly make a difference to people both around the world and around the corner, there’s no better place to make it happen.\n\nBoston Scientific is an Equal Opportunity Employer – Race, Color, Religion, Sex, Sexual Orientation, Gender Identity, National Origin, Disability, Veteran\n\nBoston Scientific is proud to be recognized for our innovations that impact patients' lives, our performance as a company, our workplace culture and our contributions to communities around the world. Some of our recent accolades include:\n• Forbes Most Innovative Companies (2018)\n• Forbes list of World's Best Employers (2018)\n• FORTUNE World’s Most Admired Companies (2018, 2017, 2016)\n• Glassdoor’s Highest Rated CEOs (2018, 2017)\n\nFor more information, please visit us at\n\nVisit www.bostonscientific.com to learn more and apply", "extensions": ["16 days ago", "Full–time"], "detected_extensions": {"posted_at": "16 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcmluY2lwbGUgQnVzaW5lc3MgQW5hbHlzdCwgT21uaSBDaGFubmVsIEFQQUMgSm9iIiwiY29tcGFueV9uYW1lIjoiQm9zdG9uIFNjaWVudGlmaWMiLCJjb21wYW55X21pZCI6Ii9tLzA0czZoMCIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Ik14M0wwdkJaUGcya1VYRHZBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2WUJDcmNCUVU1VlgwNXhVWEY1VDFCUlFuSnhNVTVNYjJ0bFVVbHNOMlpXZFVsc2JqSkVWbkZIVEZoek4zaDNkak5XWXpsclJsRnlTSEpwY3psT1ZteFBTMDlDU25wVlMwRXlSRmQ0YkRNemNtWktXbVpYVEhFd09VTmlSMlJUUVRodVExbDNhMjR6VEhadlRtSldabEZJU1VsakxWTk1ZMFYzTjJSM1RHdGpja2N5U21GbmJsSlRTWFZsVkhoYWRIbG1UbkEwTms1bmRYVlRRVlpFU0dWRGRFVXplVmxOU1VaV2VsUkNMWEJSZUZaRmJsQm9UbVpCU0VWM0VoWktNMjFEV1VveVVFWTJUR2sxVG05UWJsOXBWV0ZCR2lKQlQwMVpVbmRDUldaeFZtUmpaV3BPT1RoU2NXbGtkR2x0ZG5CaVVFdHZNbkpSIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNjUiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9icyBBdCBCb3N0b24gU2NpZW50aWZpYyIsImxpbmsiOiJodHRwczovL2pvYnMuYm9zdG9uc2NpZW50aWZpYy5jb20vam9iL1NpbmdhcG9yZS0wMS83MzA3ODkzMDAvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Business Operations", "value": "GC06"}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Accounting and Finance", "value": "GC01"}, {"text": "Science and Engineering", "value": "GC27"}, {"text": "Advertising and Marketing", "value": "GC03"}, {"text": "Customer Service", "value": "GC10"}, {"text": "Legal", "value": "GC17"}, {"text": "Protective Services", "value": "GC23"}, {"text": "Management", "value": "GC18"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Property", "value": "GC24"}, {"text": "Sales and Retail", "value": "GC26"}, {"text": "Social Services and Non-Profit", "value": "GC28"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "Business analyst", "value": "business analyst"}, {"text": "Analyst", "value": "analyst"}, {"text": "Security analyst", "value": "security analyst"}, {"text": "Systems analyst", "value": "systems analyst"}, {"text": "It analyst", "value": "it analyst"}, {"text": "Data analyst", "value": "data analyst"}, {"text": "System analyst", "value": "system analyst"}, {"text": "Support analyst", "value": "support analyst"}, {"text": "Associate", "value": "associate"}, {"text": "Management analyst", "value": "management analyst"}, {"text": "Operations analyst", "value": "operations analyst"}, {"text": "Soc analyst", "value": "soc analyst"}, {"text": "Test analyst", "value": "test analyst"}, {"text": "Intelligence analyst", "value": "intelligence analyst"}, {"text": "Research analyst", "value": "research analyst"}, {"text": "Senior", "value": "senior"}, {"text": "Senior analyst", "value": "senior analyst"}, {"text": "Control analyst", "value": "control analyst"}, {"text": "Manager", "value": "manager"}, {"text": "Project analyst", "value": "project analyst"}, {"text": "Researcher", "value": "researcher"}, {"text": "Risk analyst", "value": "risk analyst"}, {"text": "Service analyst", "value": "service analyst"}, {"text": "Technology analyst", "value": "technology analyst"}, {"text": "Accounting analyst", "value": "accounting analyst"}, {"text": "Application analyst", "value": "application analyst"}, {"text": "Behavior analyst", "value": "behavior analyst"}, {"text": "Business", "value": "business"}, {"text": "Center analyst", "value": "center analyst"}, {"text": "Compliance analyst", "value": "compliance analyst"}, {"text": "Coordinator", "value": "coordinator"}, {"text": "Desk", "value": "desk"}, {"text": "Desk analyst", "value": "desk analyst"}, {"text": "Financial analyst", "value": "financial analyst"}, {"text": "Functional analyst", "value": "functional analyst"}, {"text": "Hr analyst", "value": "hr analyst"}, {"text": "Interns", "value": "interns"}, {"text": "Operations center", "value": "operations center"}, {"text": "Process analyst", "value": "process analyst"}, {"text": "Programmer analyst", "value": "programmer analyst"}, {"text": "Project manager", "value": "project manager"}, {"text": "Qa analyst", "value": "qa analyst"}, {"text": "Senior associate", "value": "senior associate"}, {"text": "Senior consultant", "value": "senior consultant"}, {"text": "Specialist", "value": "specialist"}, {"text": "Sr analyst", "value": "sr analyst"}, {"text": "Support executive", "value": "support executive"}, {"text": "Technical analyst", "value": "technical analyst"}, {"text": "Technical architect", "value": "technical architect"}, {"text": "Trainee", "value": "trainee"}, {"text": "Treasury analyst", "value": "treasury analyst"}, {"text": "Wealth management", "value": "wealth management"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Internship", "value": "INTERN"}, {"text": "Part-time", "value": "PARTTIME"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Research", "value": "/business/naics2007/5417"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Mining", "value": "/business/naics2007/21"}, {"text": "Real Estate", "value": "/business/naics2007/53"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Engineering Services", "value": "/business/naics2007/5413"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Utilities", "value": "/business/naics2007/22"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "SingTel", "value": "/m/020zfl"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "Trustwave", "value": "/m/0n3xjf5"}, {"text": "Government Technology Agency", "value": "/g/11gh0528nq"}, {"text": "OCBC", "value": "/m/055r27"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "Credit Agricole Group", "value": "/m/028vbm"}, {"text": "HSBC", "value": "/m/01vq1f"}, {"text": "UL", "value": "/m/01q1gj"}, {"text": "VISA", "value": "/m/01kqjn"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "American Express", "value": "/m/01w6dw"}, {"text": "Avensys Consulting", "value": "/g/11g7022gjf"}, {"text": "Binance", "value": "/g/11hcz1r4wl"}, {"text": "BlueVoyant", "value": "/g/11h1y4qdlf"}, {"text": "Caterpillar", "value": "/m/0319hp"}, {"text": "Cognizant Singapore, Cognizant Technology Solutions", "value": "/m/03bf9h"}, {"text": "DBS Bank Ltd", "value": "/m/01q7n5"}, {"text": "Deloitte SEA", "value": "/g/11f_g4x9d_"}, {"text": "Dyson", "value": "/m/05cskg"}, {"text": "EPAM Systems", "value": "/m/0dlnrc"}, {"text": "Experis Singapore", "value": "/g/11dxpnwm3s"}, {"text": "JPMorgan Chase & Co.", "value": "/m/01hlwv"}, {"text": "Jobline Resources Pte Ltd", "value": "/g/11gp2647pn"}, {"text": "Marina Bay Sands Pte Ltd", "value": "/m/09mhd9q"}, {"text": "Medtronic", "value": "/m/03z4j3"}, {"text": "Mizuho Bank", "value": "/m/022103"}, {"text": "Public Service Division", "value": "/g/11g6__bv10"}, {"text": "RECRUIT EXPRESS PTE LTD", "value": "/g/11g706hzhq"}, {"text": "RHB Singapore", "value": "/g/11c73srg7f"}, {"text": "Randstad", "value": "/m/08pt1z"}, {"text": "Randstad Singapore", "value": "/g/11g70b50mr"}, {"text": "SITA", "value": "/m/06l20z"}, {"text": "Selby Jennings", "value": "/g/11fy2ds3gn"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "Xcellink Pte Ltd", "value": "/g/11c73prcqy"}, {"text": "Xilinx", "value": "/m/03dwkc"}, {"text": "103 Golden Agri International Pte Ltd", "value": "/g/11fy210tb9"}, {"text": "Activate Interactive Pte Ltd", "value": "/g/11dxq192l5"}, {"text": "Amazon", "value": "/m/0mgkg"}, {"text": "Apple", "value": "/m/0k8z"}, {"text": "Aramco", "value": "/m/01qjg2"}]}]}