{"search_metadata": {"id": "60827932cace961ed1c57657", "status": "Success", "json_endpoint": "https://serpapi.com/searches/4828f72920cf213e/60827932cace961ed1c57657.json", "created_at": "2021-04-23 07:37:22 UTC", "processed_at": "2021-04-23 07:37:22 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28programmer%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=30", "raw_html_file": "https://serpapi.com/searches/4828f72920cf213e/60827932cace961ed1c57657.html", "total_time_taken": 2.06}, "search_parameters": {"q": "(programmer) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "30"}, "jobs_results": [{"title": "PEGA Developer", "company_name": "Sciente International Pte Ltd", "location": "Singapore (+1 other)", "via": "via Monster Singapore", "description": "A golden opportunity to accelerate your career?\n\nWe are looking for highly motivated PEGA developers to join our client to deliver PEGA related projects through applications development and enhancements.\n\nMandatory Skill-set\n• Degree or Diploma in Computer Science, Information Technology or relevant fields;\n• Have at least 2 years of experience in analysis, design, development, deployment and support related activities using PEGA;\n• Experienced in Java, J2EE technologies and proficient in PRPC Application Development;\n• Some knowledge in designing solutions using Pega framework and or supporting various Pega components;\n• Experienced in application batch support, working with various teams in trouble-shooting and root cause analysis;\n• Excellent analytical skills and problem solving abilities;\n• A good team player with the ability to work independently.\n\nDesired Skill-set\n• Experience in Business Process Management / PEGA;\n• Certified in Pega CLSA / CSSA.\n\nResponsibilities\n• Work with... the stakeholders to translate the requirements into application features;\n• Responsible for application development on PEGA CRM, including interfaces with other applications and systems;\n• Ensures the scalability, availability, maintainability, and flexibility of application;\n• Ensures delivered work meets technical and functional requirements;\n• Assists in the identification of enhancements for existing applications and perform troubleshooting & debugging;\n• Provides regular updates on project progress and outstanding issues;\n• Assures that application designs are consistent with industry best practices.\n\nShould you be interested in this career opportunity, please send in your updated resume to apply@sciente.com at the earliest.\n\nWhen you apply, you voluntarily consent to the disclosure, collection and use of your personal data for employment/recruitment and related purposes in accordance with the SCIENTE Group Privacy Policy, a copy of which is published at SCIENTEs website (https://www.sciente.com/privacy-policy).\n\nConfidentiality is assured, and only shortlisted candidates will be notified for interviews.\n\nEA Licence No. 07C5639", "extensions": ["8 days ago", "Full–time"], "detected_extensions": {"posted_at": "8 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQRUdBIERldmVsb3BlciIsImNvbXBhbnlfbmFtZSI6IlNjaWVudGUgSW50ZXJuYXRpb25hbCBQdGUgTHRkIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJfN0w1ZTlubWdMbkV2Y3hPQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1vbnN0ZXIgU2luZ2Fwb3JlIiwibGluayI6Imh0dHBzOi8vd3d3Lm1vbnN0ZXIuY29tLnNnL2pvYi12YWNhbmN5LXBlZ2EtZGV2ZWxvcGVyLXNjaWVudGUtaW50ZXJuYXRpb25hbC1wdGUtbHRkLXNpbmdhcG9yZS0yLTcteWVhcnMtMjc3MTY3OTEuaHRtbD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior Software Engineer at Netflix", "company_name": "Netflix", "location": "Singapore", "via": "via BizLINKS Resources Pte Ltd", "description": "Employer Referral\n\nSenior Software Engineer at Netflix\n\nThe Company and Product Strategy Instant streaming is a core part of Netflix's strategy for the future. Our first product to support instant streaming to TVs was launched in May 2008 and has since expanded to all relevant connected screens in the home, including TV’s, streaming sticks, and operator set-top boxes. Our reach and ease-of-use is enhanced through strong partnerships with many of the world's most innovative partners such as Sony, Panasonic, J COM, and KDDI. In this role, you will help ensure we continue our strong innovation and partnership with our biggest partners in Japan. About The Role In order to help our partners add the Netflix instant streaming service quickly to their device, we work very closely with these engineering teams to quickly overcome any and all challenges. We are looking to add to our team in APAC that currently works with local partners on integration, certification and in field phases of a... product. You’ll apply your experience in software development to a wide variety of technical challenges to achieve the goal of helping our Japanese partners bring their products to market on time with the highest quality. The functionality of our platform includes streaming and playback, dynamic UI, payments, security and partner-specific adaptation for new types of devices. Willingness to travel to Netflix’s Los Gatos, CA headquarters to interface with the internal engineering teams, as well as periodic travel to Japan to develop and maintain strong ties with our partners. Our culture is a bit unique, and we tend to live by our values, so it’s worth learning more about Netflix at https //jobs.netflix.com/life-at-netflix Singapore, Singapore Product Partner Ecosystem Engineering Senior Software Engineer The Company and Product Strategy Instant streaming is a core part of Netflix's strategy for the future. Our first product to support instant streaming to TVs was launched in May 2008 and has since expanded to all relevant connected screens in the home, including TV’s, streaming sticks, and operator set-top boxes. Our reach and ease-of-use is enhanced through strong partnerships with many of the world's most innovative partners such as Sony, Panasonic, J COM, and KDDI. In this role, you will help ensure we continue our strong innovation and partnership with our biggest partners in Japan. About the role In order to help our partners add the Netflix instant streaming service quickly to their device, we work very closely with these engineering teams to quickly overcome any and all challenges. We are looking to add to our team in APAC that currently works with local partners on integration, certification and in field phases of a product. You’ll apply your experience in software development to a wide variety of technical challenges to achieve the goal of helping our Japanese partners bring their products to market on time with the highest quality. The functionality of our platform includes streaming and playback, dynamic UI, payments, security and partner-specific adaptation for new types of devices. Willingness to travel to Netflix’s Los Gatos, CA headquarters to interface with the internal engineering teams, as well as periodic travel to Japan to develop and maintain strong ties with our partners. Our culture is a bit unique, and we tend to live by our values, so it’s worth learning more about Netflix at https //jobs.netflix.com/life-at-netflix Required skills and attributes You are fluent in Japanese with excellent business reading and intermediate business writing skills. You should also have intermediate spoken and written English skills. You are an experienced and current C/C++ programmer. 5+ years of relevant experience integrating applications into complex embedded platforms. You know what's important when releasing software to partners – ideally, you have worked as a software developer producing as well as consuming an SDK (Software Development Kit). You're comfortable with proactive outward communication and technical leadership. You enjoy working side by side with partners on tough and ambiguous problems. Experience working with partners is a plus. Ideally, you have a deep background in one or more of the following embedded system development, Linux system-level programming, audio/video playback, embedded graphics, or UI programming. Experience with Android application and Android framework development is a plus. 2-3 years experience as a team leader or an engineering manager is a plus. Periodic travel to Los Gatos, California and regional offices required, as external conditions permits. Show more\n\nOriginal Joblink: https://sg.linkedin.com/jobs/view/senior-software-engineer-at-netflix-1996925994 ", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgRW5naW5lZXIgYXQgTmV0ZmxpeCIsImNvbXBhbnlfbmFtZSI6Ik5ldGZsaXgiLCJjb21wYW55X21pZCI6Ii9tLzAxN3JmXyIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImI2bzlaMnRhLW1UeTRFTFRBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVzc0JDb3dCUVU1VlgwNXhWRkJ5YW5Oc1IxQmFkSEZ2YVRjek9XMVdWbVY1ZDFOMlJVVnhUR3BhVEZOWmIzbG1WRU5VYnpGTVdWSmhPRVpoTUhKWFExTmhjRzlFYXpaeE5EVjJVa0pUVFdGUk1FNTFkV3Q0V0hGdldUY3hNV0paVTBSeE0wMVpTMGx2ZDJvNFVuWk9lV2R0VVZCVmJuRjJjVXRVUVRKdmMzSjRiV1JoTm5KbWFVeHdWM1ZVWjNkUFRXTVNGazB6YlVOWlQyWnJTMDB0ZW1kblpqRTVORXRCUkhjYUlrRlBUVmxTZDBOaWF6UlFZbXhqVkZwRVJHcFBlbE40YWxCbVRGWlhUVzF3ZEZFIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMTEiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQml6TElOS1MgUmVzb3VyY2VzIFB0ZSBMdGQiLCJsaW5rIjoiaHR0cHM6Ly93d3cuYml6bGlua3NyZXNvdXJjZXMuY29tLnNnL2luZGV4LnBocC9qb2ItbGlzdGluZ3MtcHVibGljLzkyLXNvZnR3YXJlLWVuZ2luZWVycy8yODE4LXNlbmlvci1zb2Z0d2FyZS1lbmdpbmVlci0yODE4P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Sr. Software Engineer - Java", "company_name": "Visa", "location": "Singapore", "via": "via NodeFlair", "description": "This position is an individual contributor role on the Issuer Processing Platform Development Team. The successful candidate will be part of a team to design and develop REST based APIs and perform unit and integration testing on newly developed components. Candidate will assist with troubleshooting and resolving defects during the software development life cycle. This role will also contribute to building and maintaining Continuous Integration and Continuous Delivery Pipelines. Candidate will interface directly with staff members of Development, Product Management, Project Management, and Quality Assurance.\n\nAs a key member of the development team, the candidate should be comfortable with driving technical ideas and communicating clearly with technical as well as non-technical audiences.\n\nEssential Functions\n• Design and develop API based applications using Java, utilizing spring framwork.\n• Design, develop, document and implement new functionality, as well as build enhancements... modifications, and corrections to existing software.\n• Develop TDD/BDD unit-tests and oversee execution.\n• Create documentation and procedures for installation and maintenance.\n• Build and maintain relationships with global and virtual teams on software development or support issues.\n• Engage with Quality Assurance team members on defect triage and resolution.\n• Lead development and oversee programming testing functions to ensure that projects are securely delivered while fulfilling expectations.\n• Work as part of a development team and establish close working relationships with stake holders, quality assurance, architects, management and peers in engineering.\n• Identify opportunities for further enhancements and refinements to standards and processes.\n• Prepare design documents; evaluate and recommend solutions to meet user requirements; define and implement solutions.\n• Participate in the Agile process including stand-up meetings, sprint planning, reviews and retrospectives.\n• Lead by example; demonstrating accountability, mentoring junior team members, and by contributing to departmental procedures, best practices, and standards.\n\nQualifications\n\nBasic Qualifications\n• 2 years of work experience with a Bachelor’s Degree or an Advanced Degree (e.g. Masters, MBA, JD, MD, or PhD)\n• 2 years Java development experience\n\nPreferred Qualifications\n• 3 -7 years of work experience with Bachelor’s Degree or 4 years of work experience with an Advanced Degree (e.g. Masters, MBA, JD, MD) or 3 years of experience with a PhD.\n• DevOps experience preferred, with Jenkins, Chef, Kubernetes, CICD, Dockers\n• Experience in building and maintaining Continuous Integration and Continuous Delivery Pipelines\n• Experience in best practices for API development and design patterns.\n• Knowledge of .net code base is a plus\n• Knowledgeable of common developer tool sets such as Java, XML, JSON, REST, Spring etc is preferred\n• Experience in utilizing technologies such as GIT, Maven, JUnit\n• Experience with REST services\n• Design, develop, document and implement new functionality, as well as enhancements, modifications, and corrections to\nexisting software\n• Experience in creating performing tests and produce results to ensure accurate compliance with project design requirements for compliance, load and performance testing\n• Create documentation and procedures for installation and maintenance\n• Ability to develop code that follows established coding guidelines.\n• Service excellence and innovation; create opportunities; consistently think and act 'ahead of the curve.'\n• Quick learner; self-starter, detailed and thorough.\n• Working knowledge NoSQL DB considered a plus\n• Experience in all phases of software development life cycle including project management, functional requirements definition, technical design, development, testing, quality assurance, system certification, systems implementation and system validation.\n• Consistently able to assess and evaluate problems in a production environment and manage risk to the service when recommending change\n• Strong secure coding practices\n• Strong experience working in an Agile environment. Commitment to Agile values and team-based work.\n• Experience in implementing Application Telemetry to help facilitate real time and remote troubleshooting/performance monitoring\n• Should be able to understand and own component security analysis, including code and data flow review. Collaborate with security team to implement and verify secure coding techniques.\n• Experience in virtualized environments, including deployments, maintenance, and troubleshooting\n• Analyze and troubleshoot deployment issues in a timely manner\n\nAdditional Information\nWork Hours\n• Incumbent must make themselves available during core business hours.\n\nTravel Requirements\n• This position requires the incumbent to travel for work less than 5% of the time.\n\nMental/Physical Requirements\n• This position will be performed in an office setting. The position will require the incumbent to sit and stand at a desk, communicate in person and by telephone, frequently operate standard office equipment, such as telephones and computers, reach with hands and arms, and bend or lift up to 25 pounds.\n\nVisa is an EEO Employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status. Visa will also consider for employment qualified applicants with criminal histories in a manner consistent with EEOC guidelines and applicable local law", "extensions": ["24 days ago", "Full–time"], "detected_extensions": {"posted_at": "24 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTci4gU29mdHdhcmUgRW5naW5lZXIgLSBKYXZhIiwiY29tcGFueV9uYW1lIjoiVmlzYSIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiVVpwakZVRmkwVHM1cEVMY0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBOb2RlRmxhaXIiLCJsaW5rIjoiaHR0cHM6Ly93d3cubm9kZWZsYWlyLmNvbS9qb2JzL2xpc3RpbmdzLzEwNDg3P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "AX Developer", "company_name": "AccionLabs", "location": "Singapore", "via": "via SmartRecruiters Jobs", "description": "Company Description\n\nAccion Labs is a global technology services firm with offering a full range of product life-cycle services in the emerging technology segment. This includes Web 2.0, Open Source, SaaS/Cloud, Mobility, IT Operations Management/ITSM, Big Data and traditional BI/DW.\n\nThrough nine global offices and a rapid-response delivery model, Accion offers a range of engagement models such as turn-key projects, extended-teams, shared-IP development, offshore-leveraged engagements and professional staffing (contract, contract-to-hire & direct perm).\n\nAccion Labs is privately-held, venture-funded and has a hands-on management team that believes in execution and outcome.\n\nJob Description\n\nRole: - AX Developer\n\nKey Responsibilities\n\n· Working on a full life-cycle implementations of Dynamics AX solutions\n\n· Technical requirement gathering and documentation\n\n· Implementation and deployment of AX modules and customizations\n\n· CR estimation\n\n· Post-live training and support\n\n·... Customizing Dynamics AX solution through X++ and MorphX\n\n· Customizing Dynamics AX web services\n\n· Quality Assurance and Testing\n\n· System Integration Test\n\n· Development / Technical Skills\n\n· 4-6 years in Dynamics AX ERP design and implementation\n\n· Dynamics AX Security System setup and administration\n\n· Experience in AX User Tools, MorphX, X++ Editor / Debugger, Report Development in SSRS, Data Migration, Microsoft .NET via Visual Studio, Microsoft SQL Server\n\n· Experience in SSAS, Management Reporter, AX 7 is a plus\n\n· Experience in EP and SharePoint\n\n· Technical solution description and documentation\n\n· Demonstrated knowledge in system upgrades, integrations and testing.\n\n· Ability to analyze and recommend solutions to any technical difficulty in a timely manner\n\n· Knowledge of MS Sure Step implementation methodology\n\n· Certification in AX programming is a plus\n\nAdditional Information\n\nAll your information will be kept confidential according to EEO guidelines", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBWCBEZXZlbG9wZXIiLCJjb21wYW55X25hbWUiOiJBY2Npb25MYWJzIiwiY29tcGFueV9taWQiOiIvZy8xMWR4cHFtMTZ2IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiaWN1Vk9nNGcxNkpTOWVKbUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFZFOTRTbVJmYlV0SGRrSmtMV1J3WW1WbFRpMWFTWEkyWXpWVVdETjBSREV3TlZVd2NVbFZRMkpmTFZwVmFtOUdaM1U0WTJwNmVtcHVWak56UlhFMGFqQmZlRTVQVTB4dlZXaE5ielp3WTBKRGJtTTNUV1ozWm5kWVFWUXlTMk53YW5aNU5rWlVVekZJYTNVMVZVOW1WVFUyVW5kdWVIcHZkVVoyTVRVMldVTTBVa0pRYlZoRVoyWnZlWEF6VUhwWGNsQk9UbWxOUTAweU5GaEJFaFpOTTIxRFdVOW1hMHROTFhwbloyWXhPVFJMUVVSM0dpSkJUMDFaVW5kQlkyNVVNRTkyWTFWMlMxbHBURFZJWlRCeVdrRjBUamRmY3pOQiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzIyIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFNtYXJ0UmVjcnVpdGVycyBKb2JzIiwibGluayI6Imh0dHBzOi8vam9icy5zbWFydHJlY3J1aXRlcnMuY29tL0FjY2lvbkxhYnMyLzk1MjM3ODU1LWF4LWRldmVsb3Blcj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Part-time Software Engineer - Accounting Firm", "company_name": "3E Accounting Pte Ltd", "location": "Singapore (+1 other)", "via": "via 3E Accounting", "description": "3E Accounting Singapore is currently looking to appoint a Part-time Software Engineer to join their company digital R&D team in Singapore office.\n\n3E Accounting Pte Ltd aims to be the leading corporate service provider and top accounting firm in Singapore providing One-Stop Solution services for our clients.\n\n3E Accounting Pte Ltd, Singapore is the global headquarters of 3E Accounting International, an International Accounting network with a global presence in more than 80 countries worldwide.\n\nOur Mission\nTo offer the Three Es: efficiency, effectiveness and economy, all part of our One-Stop Solution services for our clients.\n\nOur Vision\nThe World’s leading corporate service provider, offering services beyond excellence.\n\nRemuneration is commensurate with qualifications and work experience. Qualified and interested candidates should email their resume to info@3ecpa.com.sg\n\nPlease state your current and expected salary.\n\nJob Responsibilities:\n\n• Responsible in supporting the full... software development of new and existing applications.\n• Work with internal team to explore and create new design/architectures (but not limited to) for better scaling and performance of front-end and back-end services\n• Document systems enhancements and details specifications\n• Prepare test data to satisfy user acceptance test scenarios\n• Support/prepare project status reports for stakeholders\n• Any other ad-hoc duties as required or assigned\n\nRequirements:\n\n• Degree in Computer Science, Information Technology or related degrees\n• Experience in back-end software development preferred.\n• Ability to adapt quickly to new technology and in-house application\n• Good written and communication skills to be able to work effectively with IT and Digital R&D team.\n• Ability to translate business needs into technical solutions\n• Proficient in Front-end (HTML, CSS, JavaScript, ajax, bootstrap)\n• Knowledge in Python, RestApi, OOP (object-oriented programming), MVC (model-view-controller), Django, SQL, GitHub, angular.js and Principle of Accountancy preferred", "extensions": ["Over 1 month ago", "Part-time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Part-time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQYXJ0LXRpbWUgU29mdHdhcmUgRW5naW5lZXIgLSBBY2NvdW50aW5nIEZpcm0iLCJjb21wYW55X25hbWUiOiIzRSBBY2NvdW50aW5nIFB0ZSBMdGQiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Imgyc29JMkJkeFJveEowMlhBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gM0UgQWNjb3VudGluZyIsImxpbmsiOiJodHRwczovL3d3dy4zZWNwYS5jb20uc2cvY2FyZWVycy9wYXJ0LXRpbWUtc29mdHdhcmUtZW5naW5lZXIvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Analyst Programmer", "company_name": "LIM & TAN SECURITIES PTE LTD", "location": "Singapore (+1 other)", "via": "via Learn4Good", "description": "Roles &\n\nResponsibilities\n\nResponsibilities and\n\nDuties:\n\nWrite and optimize in-house application SQL statements from Oracle DB. Mapping and documenting interfaces between legacy AS400 and production system namely NOVA Post trade settlement system. Interface with users on back office system requirements and system implementation. Interface with vendors on application interfaces, problem resolution and system implementation. Provide application training and support. Generate reports and statistics for Backroom and Management.\n\nKnowledge of Crystal Reports. Document applications and operational procedures. Develop user manuals to users of system. Drawing up and documenting testing schedules for complete systems. Supporting users on change control and system updates. Ensuring that deadlines are met; working closely with colleagues, developers, testers and a variety of end users to ensure technical compatibility and user satisfaction.\n\nRequirements Pre-requisite :\n\nKnowledge of Nova... system and Datawarehouse and Oracle DB. Minimum Diploma in Computer Studies/Science or equivalent certification in a related domain Good troubleshooting skills on desktop/servers, networks and business applications. Responsible, team player, resourceful, cope well under pressure, able to prioritise and manage tasks.\n\nTell employers what skills you have\n\nBack Office\n\nBusiness Analysis\n\nDatabases\n\nJavaMicrosoft SQL Server\n\nSDLCSoftware Development\n\nSQLSystem\n\nRequirements\n\nTraining\n\nXMLsystem\n\nProduction system\n\nIBM AS/400\n\nSQL statements\n\nApplication Interfaces", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBbmFseXN0IFByb2dyYW1tZXIiLCJjb21wYW55X25hbWUiOiJMSU0gXHUwMDI2IFRBTiBTRUNVUklUSUVTIFBURSBMVEQiLCJjb21wYW55X21pZCI6Ii9nLzExZnkxcW1wMXciLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJIOHhhcm1aS29VV0hyeWRJQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFb3NDQ3N3QlFVNVZYMDV4VXpObGIxVm9lak41Um1RMmNreGFhVVoxV1VWT0xURXRRMnRXVFhoNFZsYzRWMmhZYUhKdGFFZFVhazlTVFhoYVpHeGhXa0V4V1dJMldHSXpWVVUyUVV4MldrWlFhMDVhU1hCemNVSklXWEpGZURsbVowUlVZWFJJWW5OcGVGTTJRMWxsWlRCMWQyRnZXVTV6T0c5WFRUZHFUR2xqU21GeGFGZ3plWHB0ZVV3MmRFOTFaMkppWTBoSE1VSmFia1ZwU2poSWRVcHNjRzFaUkVsT1JYbGtOWE5vZVMxa1J6VmlaVEJwVkdaWk4wbDFTSGxUY1VoTVdreEJUbUUxTFhZd1JVdFhabGRDRWhaTk0yMURXVTltYTB0TkxYcG5aMll4T1RSTFFVUjNHaUpCVDAxWlVuZEVhRkIxV0VaR1psWnRNMFk1ZUZKSVJFcEZRV0ZxUVVaQmIxOVIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18zMyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMZWFybjRHb29kIiwibGluayI6Imh0dHBzOi8vd3d3LmxlYXJuNGdvb2QuY29tL2pvYnMvc2luZ2Fwb3JlL2luZm9fdGVjaG5vbG9neS8yNzEyODkxNjIvZS8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Software Engineer (Web, Frontend, Backend, Full-Stack)", "company_name": "Surer", "location": "Singapore", "via": "via Glints", "description": "Get a more meaningful career with us 🚀\n\nSurer is an InsurTech startup that will revolutionise the way the General Insurance industry manages their entire workflow, from an agent advising their clients (the end policyholder) to how the Insurer distributes their products.\n\nAnd as a Software Engineer, you get to be a part of the revolution! We are building delightful experiences for insurance intermediaries and some of the biggest insurers out there, and this role at Surer only means you design, build, and ship for them! At Surer, you can take on big responsibilities to solve some of today's greatest problems in the Insurance industry.\n\nIt does not matter if you're stronger in frontend, backend, or both; as long as you're passionate about and skilled at building web products, there's a place for you!\n\nResponsibilities\n\nWe are looking for a talented and self-driven Software Engineer who has the nous to think out-of-the-box and make use of the great flexibility we provide to our team - to... make a big difference for the Insurance industry and empower the parties within this ecosystem.\n\nYour day to day task will be focused on working directly with our CTO and the founding team and be on the leading front to develop new features, suggest better processes, re-engineering and testing of functionalities.\n\nIn summary, you will:\n• Design, develop, test, deploy, maintain and improve our full-stack web software\n• Coding: consistently write production-ready code that is testable, easily understood by other developers, and accounts for edge cases and errors, with scalability and performance in mind.\n• Testing: write unit tests as well as higher-level tests in accordance with it.\n• Debugging: proficient at debugging systematically to diagnose all issues located to a single service\n• Collaborate closely with our product designer, product owner, and other engineers based on Agile principles and work with tool sets such as JIRA (or similar issues management systems) while keeping an eye out for emerging technology trends and developments.\n• Technical documentation\n\nExperience and Skill Sets\n\nMust have:\n• Bachelor’s Degree in Information Technology, Computer Science or equivalent\n• Preferably at least 1 year of experience in software development, working on business applications, however fresh grads will be considered as well\n• Knowledge or experience in full stack web application development with a variety of languages including but not limited to .Net Core, Javascript, HTML and CSS\n• Knowledge or experience in the concept of web development such as HTTP, HTTPS protocols, backend code integration with frontend code via RESTful APIs\n• Experience in dealing with Git repo\n• Value high quality code and you want to satisfy your thirst for knowledge of the latest technologies every day\n• Strong understanding of good software engineering practices (version control, code reviews, testing, refactoring etc.)\n• Able to understand and communicate ideas clearly with team members\n\nNice to Have:\n• Knowledge or experience in DevOps and in using the surrounding ecosystem of tools\n• Knowledge or experience in working in an agile development environment and familiar with being in a SCRUM team\n• Good grasp of security principles, and develops with a security-first mindset\n• CI/CD practices\n• Familiar with frameworks such as jQuery, Bootstrap\n• Able to work independently as well as in a team\n• Able to multitask in a demanding, fast paced environment and work with minimal supervision to meet deadlines\n• Knowledge or experience in TDD (Test Driven Development) and/or BDD (Behaviour Driven Development)\n• Knowledge or experience in building Microservices\n• Knowledge or experience in Domain Driven Design (DDD)\n\nWhat you can get out of us\n• Exposure to a fast-paced, yet fun, startup culture\n• Work directly with the founding team and have autonomy to make certain decisions\n• Opportunity to develop industry-changing products\n• Gain knowledge and experience in the InsurTech and FinTech industry\n• Flat team structure with no office politics\n• You will be engaged in conversations about the business to have a broader perspective of the value of your work as an engineer\n• We are a young startup and so have many interns in the team - they will look to you for guidance, which is an opportunity to hone your leadership skills\n\n---\n\nAbout Surer\n\nSurer is a cloud-based, web platform with a market-first technology in the region, that helps all parties in the General Insurance industry automate processes and drive network collaborations, enabling them to provide better service and support to their clients. Launched in August 2020 in Singapore, Surer was founded by a group of professionals with years of experience in the Insurance industry who are passionate about solving inefficiencies within the General Insurance industry as it was a problem they had faced as well. Surer is certified by the Singapore FinTech Association as an InsurTech service provider and is one of the portfolio companies funded by Antler, a global early-stage venture capital firm that invests in the defining technology companies of tomorrow. Visit https://surer.sg/ for more information or read about us in the media at https://surer.sg/category/in-the-news/.\n\nAbout the founders\n\nFounded by Gordon, Derren and Renfred, we have held positions to grow the business in highly successful startups like PropertyGuru and Carousell, successfully founded and exit-ed from a VendTech startup, ShakeSalad, while also having careers in major insurance companies like AIG, MSIG and QBE. One of us is even an Asian Games Gold Medalist", "extensions": ["10 days ago", "$3.5K–$5K a month", "Full–time"], "detected_extensions": {"posted_at": "10 days ago", "schedule_type": "Full–time", "salary": "$3.5K–$5K a month"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciAoV2ViLCBGcm9udGVuZCwgQmFja2VuZCwgRnVsbC1TdGFjaykiLCJjb21wYW55X25hbWUiOiJTdXJlciIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoidUltZGJnN0tWMGp6U19GN0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBHbGludHMiLCJsaW5rIjoiaHR0cHM6Ly9nbGludHMuY29tL3R3L29wcG9ydHVuaXRpZXMvam9icy9zb2Z0d2FyZS1lbmdpbmVlci13ZWItZnJvbnRlbmQtYmFja2VuZC1mdWxsLXN0YWNrLzJiOWUyNzM3LTgyYTAtNDE1ZC1iYTFhLTU0MTUzNzg5ZTJlZj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior Software Engineer", "company_name": "Cardinal Health", "location": "Singapore", "via": "via Jobs", "description": "Job Summary Work on software design, implementation, verification and coordinate with US software team and software vendors on software related projects. Ensure that all product development conforms to design specifications and coding standards for medical devices. Responsibilities Support project team activities related to product development lifecycle, certification, and problem solving Member of small project development team Design and develop web-based solutions Work on technical problems related web development Comfortable with doing both frontend and backend work Participate in design & code reviews Support validation activities per organization policies and procedures Create technical deliverables and provide technical Subject Matter Expertise Participate in Agile development lifecycle methodology, code configuration management process and code deployment process Provide input into technical design & implementation and system configuration management Generate and maintain... technical documentation required to support design control requirement and regulatory submissions Work closely with cross functional teams and external vendors to ensure timely project delivery Requirements Bachelor’s degree in computer science, web development or equivalent is required Minimum 3 years web application development experience in Java/Kotlin, JavaScript Experience working in medical device industry is advantageous Experience in Spring Boot, Git and API integration Knowledge of software integration testing Basic cybersecurity knowledge Familiarity with cloud computing Vue.js framework and Database experience is preferred Agile environment is preferred Swift/IOS and/or Android development for mobile development is preferred Team player qualities and good interpersonal skills", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgRW5naW5lZXIiLCJjb21wYW55X25hbWUiOiJDYXJkaW5hbCBIZWFsdGgiLCJjb21wYW55X21pZCI6Ii9tLzA0MHZ6eCIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IldYRVlOUDNpa0hfSDhBTHJBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhVVlJyWVVwd1ZUVjNSa3hsWTBWVVNVSkNYMFJJY2pWalpIUkpUR0ZKV1Y5dFZXY3hkbEpCUlV4WFZVSmxRWFJHVGxObmJYcGlUbkpoV21KS2VFOWxVbEJ5VFU0NGVXMUVibFJQZDBSbFdVcHNaM0JZVUZSdmVEbENjamh0VEZwdlpHbDFNV0ZJVFZCU1pGbFpNbWhtTkUwMUxVUmxRamR2VDJwdFgyeHZjWFpzYmpoNWRrUndhVnAxUjAxM2NtMTVWVmN6VkRaa2NHd3hNVVYzRWhaTk0yMURXVTltYTB0TkxYcG5aMll4T1RSTFFVUjNHaUpCVDAxWlVuZENNek5SZVhoTExXTkRWbFI0WlRKSE1rY3piVk5zT0V4eGIwcG4iLCJmY3YiOiIzIiwiZmNfaWQiOiJmY180NiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIiwibGluayI6Imh0dHBzOi8vc2cuZmlkYW50by5jb20vam9icy9qb2Itb3BlbmluZy9zb2Z0d2FyZS1kZXZlbG9wZXJzLXN5c3RlbXMtc29mdHdhcmUvc2VuaW9yLXNvZnR3YXJlLWVuZ2luZWVyLTI3Nzg0ODAxMD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Software Developer (Backend / Java / J2EE)", "company_name": "Trust Recruit Pte Ltd", "location": "Singapore (+1 other)", "via": "via Shortlisted Jobs | Singapore", "description": "J2EE / Linux Golang Responsibilities: Visualize, design and develop program modules for projects. Involved in full development cycle of the project Troubleshoot the system and detects for error. Involved in monitoring and repair Research and explore new technologies to better improve existing and new products Provide technical support for product maintenance Work closely with the... read more on Shortlisted Jobs | Singapore", "extensions": ["4 days ago", "$3,750–$5,000 a month", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time", "salary": "$3,750–$5,000 a month"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBEZXZlbG9wZXIgKEJhY2tlbmQgLyBKYXZhIC8gSjJFRSkiLCJjb21wYW55X25hbWUiOiJUcnVzdCBSZWNydWl0IFB0ZSBMdGQiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImpfSUM1TGplemVjYkIwQlNBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gU2hvcnRsaXN0ZWQgSm9icyB8IFNpbmdhcG9yZSIsImxpbmsiOiJodHRwczovL3NnLnNob3J0bGlzdGVkam9icy5jb20vam9icy90cnVzdC1yZWNydWl0LXB0ZS1sdGQtc29mdHdhcmUtZGV2ZWxvcGVyLWJhY2tlbmQtamF2YS1qMmVlLTczNzg5Lz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "SOFTWARE ENGINEER (DevOps)", "company_name": "Recruit Expert Pte Ltd", "location": "Singapore (+1 other)", "via": "via Recruit Expert", "description": "Responsibilities:\n• Analysing, designing, coding and maintenance of payment applications.\n• Resolving customer issues.\n• Maintaining and enhancing the existing software for performance improvement\n• Diagnosing software and system failures\n• Performing activities related to test cases.\n\nRequirements:\n• Diploma in Computer Science or Computer Engineering\n• At least 2 years experience in credit card terminal software development.\n• C++ and C#\n• Knowledge in ARM compilers, Eclipse IDE.\n• Knowledge in standards like ISO8583, PCI-DSS\n• Well versed with data cryptography (DUKPT, Master Key)\n• Familiar with EMV certification process in both contact and contactless\n\nSalary: up to $5,000\n\nIf you are keen to apply for the position, kindly email your detailed resume in MS Word to careers@recruit-expert.com\n\nPlease note that only shortlisted candidates will be notified.\n\nRef: 0083718\n\nEA Licence: 19C9701\n\nRegistration: R2197355", "extensions": ["28 days ago", "Full–time"], "detected_extensions": {"posted_at": "28 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTT0ZUV0FSRSBFTkdJTkVFUiAoRGV2T3BzKSIsImNvbXBhbnlfbmFtZSI6IlJlY3J1aXQgRXhwZXJ0IFB0ZSBMdGQiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6InhvUzNJX3VBZWhNMkdGUmtBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gUmVjcnVpdCBFeHBlcnQiLCJsaW5rIjoiaHR0cHM6Ly93d3cucmVjcnVpdC1leHBlcnQuY29tL2pvYi9tY2YtMjAyMS0wMDgzNzE4LTMtc29mdHdhcmUtZW5naW5lZXItZGV2b3BzLz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}], "chips": [{"type": "Title", "param": "job_family_1", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Software engineer", "value": "software engineer"}, {"text": "Programmer", "value": "programmer"}, {"text": "Programmer analyst", "value": "programmer analyst"}, {"text": "Senior", "value": "senior"}, {"text": "Cnc programmer", "value": "cnc programmer"}, {"text": "Engineer", "value": "engineer"}, {"text": "Analyst programmer", "value": "analyst programmer"}, {"text": "Science", "value": "science"}, {"text": "Software programmer", "value": "software programmer"}, {"text": "Assistant", "value": "assistant"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Electrical engineer", "value": "electrical engineer"}, {"text": "Executive", "value": "executive"}, {"text": "Java engineer", "value": "java engineer"}, {"text": "Java programmer", "value": "java programmer"}, {"text": "Lecturer", "value": "lecturer"}, {"text": "Manager", "value": "manager"}, {"text": "Operator", "value": "operator"}, {"text": "Project officer", "value": "project officer"}, {"text": "Senior programmer", "value": "senior programmer"}, {"text": "Senior system", "value": "senior system"}, {"text": "Senior technical", "value": "senior technical"}, {"text": "Sr. programmer", "value": "sr. programmer"}, {"text": "Systems programmer", "value": "systems programmer"}, {"text": "Technical", "value": "technical"}, {"text": "Trainee", "value": "trainee"}, {"text": "Trainer", "value": "trainer"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Mining", "value": "/business/naics2007/21"}, {"text": "Rental", "value": "/business/naics2007/532"}, {"text": "Wholesale", "value": "/business/naics2007/42"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "EPAM", "value": "/m/0dlnrc"}, {"text": "VISA", "value": "/m/01kqjn"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "Citi bank", "value": "/m/01dfb6"}, {"text": "TikTok", "value": "/g/11fy265933"}, {"text": "Ubisoft", "value": "/m/02qdyj"}, {"text": "Cognizant", "value": "/m/03bf9h"}, {"text": "HCL SINGAPORE PTE. LTD.", "value": "/g/11fy25ngsv"}, {"text": "Oracle", "value": "/m/05njw"}, {"text": "Credit Agricole Group", "value": "/m/028vbm"}, {"text": "Mindteck (India) Limited", "value": "/m/0cqj8w1"}, {"text": "Nanyang Technological University", "value": "/m/0l49k"}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Zühlke Group", "value": "/g/1hh_rg216"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Avensys Consulting Pte Ltd", "value": "/g/11g7022gjf"}, {"text": "Avnet", "value": "/m/0c8xmc"}, {"text": "GlobalTix Pte Ltd", "value": "/g/11dxpqdhrf"}, {"text": "GovTech", "value": "/g/11gh0528nq"}, {"text": "J.P.Morgan", "value": "/m/01hlwv"}, {"text": "Optimum Solutions (Singapore) Pte Ltd", "value": "/g/11g70hkrbx"}, {"text": "Razer Inc.", "value": "/m/075hc0"}, {"text": "Realtek Malaysia", "value": "/m/05wrm7"}, {"text": "Realtek Singapore Private Limited", "value": "/g/11g9n26trs"}, {"text": "Success Human Resource Centre Pte Ltd", "value": "/g/11g709_209"}, {"text": "TECHNOPALS PTE. LTD.", "value": "/g/11dxpvkynp"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "UST", "value": "/m/08kb8g"}, {"text": "UrbanFox", "value": "/g/11ghs7y0w6"}, {"text": "Adecco GS", "value": "/m/08gz46"}, {"text": "Alphanova Pte. Ltd.", "value": "/g/11f8h_czps"}, {"text": "BioMind", "value": "/g/11dymfr2l6"}, {"text": "Biqmind", "value": "/g/11g21fzhrb"}, {"text": "BitTitan", "value": "/g/11dxpksv89"}]}]}