{"search_metadata": {"id": "60827a36fdca3e0ea4a7eaa1", "status": "Success", "json_endpoint": "https://serpapi.com/searches/08d471ffe91be108/60827a36fdca3e0ea4a7eaa1.json", "created_at": "2021-04-23 07:41:42 UTC", "processed_at": "2021-04-23 07:41:42 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28product+manager%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=100", "raw_html_file": "https://serpapi.com/searches/08d471ffe91be108/60827a36fdca3e0ea4a7eaa1.html", "total_time_taken": 5.47}, "search_parameters": {"q": "(product manager) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "100"}, "jobs_results": [{"title": "Product Manager, Auction and Delivery Ads", "company_name": "TikTok", "location": "Singapore", "via": "via Bayt.com", "description": "The mission of TikTok Ads Platform is to connect global advertisers and users, advertisers of any industry and experience level are able to get suitable marketing solutions, then easily create, manage and optimize ads. The Core Ads team is looking for an experienced Product Manager to build highly scalable machine learning products that determine what ads billions of TikTok users see and engage with. You will be responsible for helping 'millions' of advertisers improve their return on ad spend, growing overall monetization efficiency, and protecting the experience of our users, creators and community through industry leading recommendation system. Responsibilities:\n1. Build next-gen bidding, budget and automation ad products\n2. Improve ad personalization, relevance and ranking\n3. Optimize ad inventory strategy for revenue and user experience\n4. Shape delivery insights that shed light on ML system for marketers and brands\n5. Enable advertisers to achieve true business value with upper... and lower funnel objectives\n6. Grow advertiser retention via enhanced delivery experience and higher ROI\n\nQualifications\n1. BA/BS degree in Computer Science, EE, Mathematics or Statistics, or equivalent practical experience. Experience with machine learning/ recommendation system a plus.\n2. At least 3-5 years of commercial experience in a product management role, with demonstrated leadership in the management of a product (or portfolio of products) through the software development lifecycle, from conception to launch to ongoing performance measurement and optimization.\n3. Fast learner with a good sense of judgment and original thinking.\n4. Highly analytical with excellent communication, organizational skills", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9kdWN0IE1hbmFnZXIsIEF1Y3Rpb24gYW5kIERlbGl2ZXJ5IEFkcyIsImNvbXBhbnlfbmFtZSI6IlRpa1RvayIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiWG91WkRNcXI0TWFrRFFCdUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCYXl0LmNvbSIsImxpbmsiOiJodHRwczovL3d3dy5iYXl0LmNvbS9lbi9zaW5nYXBvcmUvam9icy9wcm9kdWN0LW1hbmFnZXItYXVjdGlvbi1hbmQtZGVsaXZlcnktYWRzLTU4NzQyNjIyLz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Product Manager - Ratings & Credit Content", "company_name": "S&P Global", "location": "Singapore", "via": "via Laimoon.com", "description": "S&P Global Market Intelligence\n\nThe Role: Product Management - GTM and Strategy\n\nThe Location: Singapore\n\nThe Team: The team is responsible for defining and implementing the go-to-market approach as well as the market strategy of the Credit Risk Solutions business in Asia-Pacific. The team works on day-to-day management and long term strategic planning and execution in all markets, supporting sales strategies, go-to-market, and product development regionally.\n\nThe Impact: This role is responsible for maintaining and growing the Credit Risk Solutions business in the Asia-Pacific region as a key member of the Credit Risk Solutions team.\n\nWhat's in it for you:\n• Opportunity to help lead the long term strategic credit initiatives in the Asia-Pacific region\n• Work closely with a broad group of stakeholders to launch new products and grow the business in the region\n• Be part of a highly skilled team focusing on both developed and developing credit and capital markets\n• Regional role with... opportunity to travel and interact with different facets of the business as conditions allow\nResponsibilities: Help oversee the management of the Credit Risk Solutions product line in Asia-Pacific with responsibility for day-to-day management of the market strategy and go-to-market plan. Work with key stakeholders across commercial, marketing, product, technology and senior management in order to provide local management for the Credit Risk Solutions business line within the Asia-Pacific region. Act as a subject matter expert in client meetings. Develop and author thought leadership articles which address market problems and articulate the value of our capabilities. Represent S&P Global Market Intelligence in market facing presentations, events and webinars on credit risk topics.\n\nWhat We're Looking For:\n• 5+ years of product management experience\n• University education, ideally with a focus on economics or finance\n• Experience in financial services, in particular in the Credit space\n• Experience working on a globally located team and coordinating across time zones\n• Experience working to launch products in different markets and grow existing business lines within Asia-Pacific\n• Ability to work closely within a team but also be able to work independently with little supervision\n• Strong client-facing and presentation skills\nS&P Global Market Intelligence\n\nAt S&P Global Market Intelligence, we know that not all information is important-some of it is vital. Accurate, deep and insightful. We integrate financial and industry data, research and news into tools that help track performance, generate alpha, identify investment ideas, understand competitive and industry dynamics, perform valuation and assess credit risk. Investment professionals, government agencies, corporations and universities globally can gain the intelligence essential to making business and financial decisions with conviction.\n\nS&P Global Market Intelligence is a division of S&P Global (NYSE: SPGI), which provides essential intelligence for individuals, companies and governments to make decisions with confidence. For more information, visit www.spglobal.com/marketintelligence.\n\nS&P Global is an equal opportunity employer committed to making all employment decisions without regard to race/ethnicity, sex, pregnancy, gender identity or expression, color, creed, religion, national origin, age, disability, marital status (including domestic partnerships and civil unions), sexual orientation, military veteran status, unemployment status, or other legally protected categories, subject to applicable law.\n\n20 - Professional (EEO-2 Job Categories-United States of America), PDMGDV202.2 - Middle Professional Tier II (EEO Job Group), SWP Priority - Ratings - (Strategic Workforce Planning)\n\nJob ID: 259485\nPosted On: 2021-02-08\nLocation: Singapore, Singapore\nTechnology", "extensions": ["17 days ago", "Full–time"], "detected_extensions": {"posted_at": "17 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9kdWN0IE1hbmFnZXIgLSBSYXRpbmdzIFx1MDAyNiBDcmVkaXQgQ29udGVudCIsImNvbXBhbnlfbmFtZSI6IlNcdTAwMjZQIEdsb2JhbCIsImNvbXBhbnlfbWlkIjoiL20vMDJfbmw0IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiQXNTelA5dDR3TGxkVXFrdkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFZGVk9RMkZZUWxoRFlpMDJjVWRETTNWMmRrTm1OVUpoV0VoUFYyb3lVazUxVDBwZlpGaDZRVXRRWkhOWU9VaGFZMW81YzFoamVGOXVkMGREYmtFeGRHUnpVMnhXT0V4UFRVVllPVzEwWlVJMFFraG1Oekl5WTBGbFFXdDZiR2x6VG14cFluUnRjbVpLVVVoVWNVbFlTRlYwYm5KeFZrdzFlVjlDYjNBeWJIRmpZWGRpYkU1eGJWaE5NRlZoYzBodFpqUlBjbGxOU1VSMU0yMVJFaFpQTTNGRFdVcFRWME4wWlZOMFFXRlBiRmxRVVVKbkdpSkJUMDFaVW5kRFNuQkpkblJQUjFZeVNtcFlWMWQzZW5JNVIxUnBkV2xxUWxKQiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzExIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExhaW1vb24uY29tIiwibGluayI6Imh0dHBzOi8vam9icy5sYWltb29uLmNvbS9qb2JzL2V4dGVybmFsdmlldy8yNDQ1MDAyMT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Executive, Product and Partnership Management", "company_name": "Singapore Institute of Management", "location": "Singapore (+1 other)", "via": "via Glassdoor", "description": "We are looking for a Product and Partnership Executive to join our team. In this role, you will support the Product and Partnership Manager on building/ launch of new products, manage business collaborations with knowledge partners and faculty members/ trainers.\n\nManage Partners\n• Build and maintain the relationships with existing/ new partners\n• Support in building effective business models with strategic business partnerships (accreditation bodies/knowledge partners/industry leaders) to support organisational strategies and objectives.\n• Build and maintain a network of faculty members and trainers\n• Build strong internal and external partnership networks that enable a constant pipeline of market intelligence and information to form key analytical perspectives for trend forecasting and sensing\n• Tracking and analysis to continually optimising partnership models performance and measure effectiveness\n\nManage Products\n• Manage an area of products and services\n• Research on the... competitive landscape and workforce transformation skills trend that will contribute to SIM product planning and strategies\n• Recommend enhancement opportunities across the business’s products based on organisational objectives\n• Work with Design & Build team to map products based on business plans.\n\nJOB REQUIREMENTS\n• Certified in ACTA/ACLP/DACE preferred\n• Familiar with various types of funding available in the market\n• Knowledge of current and upcoming technologies, tools, methodologies and digital products\n• Strong business acumen with track record of successful partnership and relationship management\n• Creative problem solver with strong analytical skills, and innovative in approaching challenges\n• Able to multi-task, work effectively in fast-paced cross-disciplinary project teams\n• Good team player with positive attitude and eager to learn\n• Ability to work in an agile environment\n• Proficient in stakeholder relationship building and management – strong ability to develop positive relationships and partnerships across all levels of personnel with individuals and organisations\n• Self-driven, outgoing personality with good presentation and communication skills\n• Fresh graduates are welcome to apply", "extensions": ["20 days ago", "Full–time"], "detected_extensions": {"posted_at": "20 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJFeGVjdXRpdmUsIFByb2R1Y3QgYW5kIFBhcnRuZXJzaGlwIE1hbmFnZW1lbnQiLCJjb21wYW55X25hbWUiOiJTaW5nYXBvcmUgSW5zdGl0dXRlIG9mIE1hbmFnZW1lbnQiLCJjb21wYW55X21pZCI6Ii9tLzA2ZGJwOSIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjhGaGNVZ2FFMUFMZUFWZnlBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVxRUNDdUlCUVU1VlgwNXhVMWxZTFVKWmJXaEZPRU14Y2pKbmFYVjBMVXhyZUdoaldGVTFZa1JWUkdKT1l5MDVXV3RHVlZOUlpYaHdVa3RzTjJGT04wMHpVelIxTlc5blUyTlNVRmgyYzJSaFNqbFZTVFpYYUUxSFIzWTVNMmxuTm1SV1kxTjRNREJqZVZNMFkxTkxWRjlaYzJwSmFsUllZelUzYURaWVNUazNWM0pCTTNoeGJFbHNPV0pSTkhaMmVsaHZWVUp3YmpoRlYwWjJVVVpIVjI1UlpVZ3dOMW8wTkVGclowb3lPV3hXV0UxbWEwaElWR0ZmVnpKME4zSkdhV2RxUzNOcFpsSlRNSFpHWkdWc1RFRmpXV05IY0drNWRUSldRWEZKWmsxVlNqUlFjbEZRUVJJV1R6TnhRMWxLVTFkRGRHVlRkRUZoVDJ4WlVGRkNaeG9pUVU5TldWSjNSRkp2VTBFeE4zTk9iRVZQUnpCelIyNTZUakV6UzNkdWRXZE5adyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzE4IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEdsYXNzZG9vciIsImxpbmsiOiJodHRwczovL3d3dy5nbGFzc2Rvb3Iuc2cvam9iLWxpc3RpbmcvZXhlY3V0aXZlLXByb2R1Y3QtYW5kLXBhcnRuZXJzaGlwLW1hbmFnZW1lbnQtc2luZ2Fwb3JlLWluc3RpdHV0ZS1vZi1tYW5hZ2VtZW50LUpWX0lDMzIzNTkyMV9LTzAsNDRfS0U0NSw3OC5odG0/amw9Mzc0MjM3NzkzNFx1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Product Manager (Digital)", "company_name": "None", "location": "Singapore", "via": "via Jobs", "description": "Digital at Chubb At Chubb, we believe that the experience is the product – as such, customer experience and a Digital-by-default strategy is at the heart of everything we do. As part of our growing Digital Business, you'll be welcomed into a highly competent, lively and supportive environment where your voice matters. With a focus on collaborative working – we are looking for ambitious and experienced Digital talent to ensure we're creating the best new service-based products and experiences for our partners. Role Overview The Digital Product Owner for E-Service is responsible for the delivery of the Digital Product vision around how our customers will self-serve online. My Account allows our customers to access and manage their policies in one place, update personal and payment information and make an end-to-end claim without the need to call. My Account will also create new revenue streams for incremental growth of our Online Channel by promoting new subscription-based products to... existing customers. In this role, you will be assigned a development scrum team with a range of multi-disciplinary skills to deliver digital solutions that combine insurance product, technology and front-end user experience for Chubb across Asia Pacific. The Digital Product Owner is a critical link between the development teams and our business stakeholders – as such, we're looking for someone with very strong communication skills to captain our Digital delivery for My Account. You will bring different members of the business together to make sure we're always finding new ways to build the best product possible to meet the demanding needs of our customers. You will be working closely with our Insights teams to use data from all channels to keep us on our toes, listening to customer needs so we can focus on creating new products with a personalised service that keeps them coming back for more. Main Responsibilities • Collaborate with global Chubb colleagues to identify priority scope for maximum customer satisfaction and business value, and track through to achievement • Develop clear business cases for new features and functionality to be developed • Identify risks and dependencies across Chubb's business functions to ensure a smooth and timely delivery • Provide clarity and direction to your dedicated development team to facilitate regular sprint planning and prioritisation • Ensure Business Analysts can translate your requirements into clear, small and testable User Stories for delivery within an agreed timebox • Empower the development team to solve complex and technical problems to ensure that the business and user needs are met throughout the project execution and delivered in the most efficient way • Responsible for understanding, overseeing and defending the product concept and user experience that has been planned - approving and participating in the creation of solutions to problems and unforeseen circumstances that may appear during execution phases • Work with the Digital Technology team to ensure that the delivery adheres with Chubb's Digital Architecture and Information Security standards • Seek our data to analyse and make decisions around all the elements related to the product (User experience, insurance products, promotion, digital marketing etc.) being wholly accountable for the production to meet plans, quality and expectations Experience & Qualifications • Minimum of 3 years' experience as a Digital Product Owner, preferably responsible for a highly-performant mobile app or web-based platform • Certified Agile Scrum Product Owner with experience in educating on and delivering using Agile Scrum methodologies • Experience using Atlassian Jira and Confluence to maintain product backlogs and sprint planning • Bachelor's Degree in Business, Marketing, Communication, UX or other related field required • Proficient in Microsoft Applications (Word, Excel and PowerPoint) and working knowledge of common application software • Ideally understanding of insurance products and their related services (claims etc) is preferred • Track record of website optimization and solutions that positively impact consumer experience • Ability to quickly assimilate technical and business information into clearly defined deliverables • Highly effective in problem-solving and creative solutions • Strong team player with excellent organization, communication and coordination skills • Ability to meet deadlines in a fast-paced, collaborative business environment, handling multiple projects simultaneously Digital at Chubb At Chubb, we believe that the experience is the product – as such, customer experience and a Digital-by-default strategy is at the heart of everything we do. As part of our growing Skills: Collaboration, Customer Experience, Project Management, Project Planning, Sdlc, Vision, Competent, Environment, digital business Experience: 5.00-7.00 Years", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9kdWN0IE1hbmFnZXIgKERpZ2l0YWwpIiwiY29tcGFueV9uYW1lIjoiTm9uZSIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiRm0yeFBMaFFaTGhtNlY4Q0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIiwibGluayI6Imh0dHBzOi8vc2cuZmlkYW50by5jb20vam9icy9qb2Itb3BlbmluZy9hY2NvdW50YW50cy9wcm9kdWN0LW1hbmFnZXItZGlnaXRhbC0yNzU3MzIwNjI/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Regulatory Affairs Manager, APAC (PPE) (BB-6314E)", "company_name": "Robert Walters", "location": "Singapore (+1 other)", "via": "via BeBee", "description": "An exciting Regulatory Affairs Manager, APAC (PPE) role has been made available at one of the world's leading medical supplies company.About the Regulatory Affairs Manager, APAC (PPE) Role:In charge of the PPE portfolio, you will provide technical leadership in the development and implementation of regulatory strategies to support the achievement of business objectives, while ensuring compliance with domestic, regional, and international PPE regulations.Key Responsibilities: Actively monitor the evolving regulatory landscape and proactively communicate potential business impact to managementDevelop the company's presence in industry groups to facilitate the organisation's ability to shape the regulatory landscapeDevelop and implement domestic, regional, product specific regulatory strategies in support of business objectivesPrepare accurate right first time regulatory submissions to secure timely approvals in support of business initiativesEngage commercial and functional stakeholders... on progress of regulatory initiatives and proactively communicate risks and present mitigation plansProvide an interpretation of regulatory requirements, both domestic and regional to the appropriate business team members and highlight implications of differences with respect to product development and testing activities so as to minimise overall development activities while bringing speed to the registration processConduct training seminars on domestic and regional regulatory requirements and/or impending regulations to the appropriate business team members to enable the best development activities To succeed in this Regulatory Affairs Manager, APAC (PPE) role, you must possess relevant regulatory technical experience in PPE sector, including direct experience in submissions and regulatory defence, regulatory review, regulatory certification and product life cycle management within the Asia Pacific region.Key Requirements: A broad technical background is required; preferably a graduate level degree, or as a minimum, a bachelor’s degree in a major scientific discipline, preferably pharmacy, chemistry, or microbiologyMinimum of eight years' relevant regulatory technical experience in PPE sector, including direct experience in submissions and regulatory defence, regulatory review, regulatory certification and product life cycle management within the Asia Pacific regionExpertise in the various regulatory framework covering PPE across Asia Pacific. Proven track record of registering disinfectants and medical devices across Asia PacificExcellent understanding of key US and EU PPE regulatory framework. Ability to articulate the impact of these regulations to Asia Pacific This organisation needs no introduction and is recognised as a key leader within the medical supplies field. The culture is demanding, but if you are confident and have a can-do attitude, the potential rewards are significant. The business is also very focused on developing and training their people to the highest standards.If you are driven, determined and want to take the next step in your career, this Regulatory Affairs Manager, APAC (PPE) role is for you. Great career progression opportunities await the right person in this exciting Regulatory Affairs Manager, APAC (PPE) role in Singapore.Apply now to learn more.Do note that we will only be in touch if your application is shortlisted.Do note that we will only be in touch if your application is shortlisted", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJSZWd1bGF0b3J5IEFmZmFpcnMgTWFuYWdlciwgQVBBQyAoUFBFKSAoQkItNjMxNEUpIiwiY29tcGFueV9uYW1lIjoiUm9iZXJ0IFdhbHRlcnMiLCJjb21wYW55X21pZCI6Ii9tLzA2NGtwa3AiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiI4ZlhDZTJZcWN2OXlrSXZHQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VWxaV2NISldTazlITjJvM2JUWlVaRm95Y0dWb1oxbFRNa1JwTnpSSU5FcHZhWGx5TlRCb1NWVXhSMHhOYW1wT1lteFRUVzFDZEhkeVNUWkxOREJZVWpnMVdHZGpTRTF5YW1zMlkzaFlibVoxUmtZMlExTjJabUZhUm5RNE1qQkRjMnBoUjFGclNtVjVhblJsUjBkMlpIQlZhbWczYkV4TE5IaFhWbFl3UWxsUlMzbzVRblJPY20xME9XVnRVVll6Ukhadk56WlNTa2h0TlZWUkVoWlBNM0ZEV1VwVFYwTjBaVk4wUVdGUGJGbFFVVUpuR2lKQlQwMVpVbmRDU0hWR1RuZDBjMk5qUXkxS2EwSXdOWGxFUjFoMmFIVXhSR3hSIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMzAiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQmVCZWUiLCJsaW5rIjoiaHR0cHM6Ly9zZy5iZWJlZS5jb20vam9iLzIwMjEwNDE3LWRkZTk4M2I3NjNjOGM4M2I0ZDFiNjFkMzE0ZDYzMTRlP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "(Senior) Manager, Product Development", "company_name": "Tessa Therapeutics Ltd", "location": "Singapore (+1 other)", "via": "via LinkedIn", "description": "This role is responsible for coordinating outsourced works and assisting all members of Product Development in aligning their product development activities with corporate goals and priorities, project timelines and budgets. He/she tracks and documents scientific progress of both internal and external projects, monitors scope, status, schedule and budget, and he/she also follows up closely with stakeholders to ensure that projects are on track. This position establishes timely and efficient communication for sharing operational updates of Product Development activities with Project teams and Project Managers, and ensuring problems are rapidly identified and resolved to deliver on commitments.\n\nJob Description\n• Provide administrative and logistic support for all Product Development activities in the department\n• Responsible for department’s and Projects’ budgets, activity tracking, and setup and maintenance of a documentation system for efficient information sharing\n• Work with... scientists and directors to file development reports to document all completed activities and serve as the key person to manage a retrievable report system\n• Assist department members in sourcing and procuring materials or technologies by conducting suppliers and/or capability survey, initiate contact and track projects progress with relevant external parties and keep up with new industrial trends for Product Development of Cell Therapies\n• Supports Product Development outsourced work as well as assay technology transfers by establishing contracts and scopes management with contract research organizations, contract development and manufacturers, service/supply vendors.\n• Ensure communications for Product Development activities and progress with Tessa colleagues is effective and transparent, with timely updates on critical tasks to project managers to help them update project timelines accurately\n• Develop and maintain positive relationships with collaboration partners ensuring positive team environment and alignment with Tessa’s strategies\n• Collaborate with QA and Regulatory Affairs departments to ensure GxP data quality and timely records retrieval in accordance to Tessa’s Quality Policies\n• Flag potential quality problems and communicate any deviations and escalate issues as appropriate\n• Participate in future hiring and resource planning for Product Development department\n\nRequirements\n• Bachelor’s degree in Life Sciences\n• More than 10 years track record in managing multiple projects in life science industry\n• Data analysis skills using basic statistics are required.\n• Basic knowledge of GMP, GCP, and CMC & QA guidelines are highly desired.\n• PMP certification or with strong project management skills desired\n• Highly developed inter-personal skills and verbal/written communication\n• Strong problem solving and critical thinking skills\n• Ability to manage situations with internal and external collaborations and help teams focus on making progress through objective and clear communication style", "extensions": ["7 days ago", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiIoU2VuaW9yKSBNYW5hZ2VyLCBQcm9kdWN0IERldmVsb3BtZW50IiwiY29tcGFueV9uYW1lIjoiVGVzc2EgVGhlcmFwZXV0aWNzIEx0ZCIsImNvbXBhbnlfbWlkIjoiL2cvMTFmcDFtMXp2ciIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Im1JR2tQVm1zNGUzZUhyUWVBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVvc0NDc3dCUVU1VlgwNXhVbkpZTlZnelozTnBNbEpCU1MxR2Eyb3hiRkoxVFRselNXTk1lWFJsYW1oVGIxWldVWFphVFY5RVluYzJlRXhSVEdZdGJrZDBhWEkyVjI1cmQwbG5YMmhDY1hWT2MwRjJRM294VEdobmNqRlJlVkJoVmxOc1QyWTNRbXRPVDBJdGRrbHpOMjFIWlZCdVRHaHFaVXRMVUROVVdtTnFRVk0xVmpNM2RERXpkMUkxTUVSUFNrY3lVR3hzYms1c0xVczRjakE0VURkV1lteFJkMFY0YWpnMVdVczFhamxQZHpKemVFbDBPVkJEZVVvMlNtTXRiRUZLUVdKR1dYQmlSWGQzVFZKaWRGZHJFaFpQTTNGRFdVcFRWME4wWlZOMFFXRlBiRmxRVVVKbkdpSkJUMDFaVW5kRFFYWk5ZemxMTVU5eVRubFZWbmg1V0ZaTVpFZ3pVa2d3UjJaUiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzM3IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExpbmtlZEluIiwibGluayI6Imh0dHBzOi8vc2cubGlua2VkaW4uY29tL2pvYnMvdmlldy9zZW5pb3ItbWFuYWdlci1wcm9kdWN0LWRldmVsb3BtZW50LWF0LXRlc3NhLXRoZXJhcGV1dGljcy1sdGQtMjQ4ODMxMzIwMz9yZWZJZD00NjdjMzRlYi0xMzI1LTRjNjAtOTM3Ni0yMDY4ZTVmMTkxNDNcdTAwMjZ0cmFja2luZ0lkPWg2dGZVejVnaGNobGhrenJjR1hiU1ElM0QlM0RcdTAwMjZ1dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Manager, Product Supply", "company_name": "Adidas Group", "location": "Singapore (+1 other)", "via": "via Bayt.com", "description": "Purpose:\n• Manage purchasing expertise in product categories in order to maintain a Confirmed On Time Availability (COTA) supply of product to meet customer demand in a manner that will optimize financial KPI to brand and minimize overall Supply Chain costs.\n\nKey Responsibilities:\n• Lead SEA/TH PSI team to create visibility on availability, inventory and cost (upcharge) performance and ensure timely decision/action\n• Monitor forecast and purchase process to determine appropriate quantities to meet the demand for each individual category; Accountable to influence the appropriate production and inventory positions for a Business Unit(s)\n• Manage completeness and accuracy of SEA/TH Marketing Buying Volume (MBV), inc. risks and opportunities with Demand Planning and Global Product Supply\n• Continuous improvement on tools development and buy guidelines to support / control business principles and efficient processes within Demand/ Supply chain Operations\n• Identify critical supply chain... constraints and determine actions to overcome supply problems of critical products.\n• Tracking purchasing KPI’s - ensuring the highest sales order and forecast coverage against Purchase Orders in close collaboration with Inventory Management. Drive and take corrective action where necessary especially for On Time Allocation (OTA) target.\n• Develop and maintain requirements, processes, and open communication with key stakeholders.\n• Lead regular Demand and Supply validation meetings for all business units in conjunction with Global Product Supply, demand planning, and markets.\n• Leads projects to review operational procedures and practices towards the goal of making continuous business improvement.\n• Manages on-going projects by defining timelines and milestones, writing project briefs, and defining specifications as required.\n\nKnowledge Skills and Abilities:\n• Motivating and leading a complex team\n• Excellent knowledge of overall supply chain mechanics, planning and purchasing\n• Excellent understanding of the flow of goods from sourcing to customer\n• Process thinking\n• Analytical\n• Ability to accept and meet critical deadlines with good planning and organization skills\n• Ability to challenge the way in which things are done\n• Excellent communication skills\n• Fluent in English (oral and in writing)\n\nRequisite Education and Experience / Minimum Qualifications:\n• University degree with a focus on Logistics or a related field or comparable experience.\n• Supply chain education / background\n• 3-5 years in a Supply Chain Management position\n• Minimum 2 years of team lead experience\n• Good skills in ERP systems (SAP)\n• Competent user in Microsoft Office applications", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJNYW5hZ2VyLCBQcm9kdWN0IFN1cHBseSIsImNvbXBhbnlfbmFtZSI6IkFkaWRhcyBHcm91cCIsImNvbXBhbnlfbWlkIjoiL20vMDFqdG1sIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiUlhrOS15QTRNYUtGOUlEckFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFZHWkhXRkYzVVc1WU5WVlpZWHBwVWs1ck1EVXlZMWxYWWtKZmRTMUNiVGN0WkVGcU5ISjZkRFpQVVZoUVZHMUNjMDF3V1ZWUlpXMWtjSFZSU21aMVUwZExja0ZYVjJkWGIwMHRaelpNUVRsUmNrZFdObU0zV0VKc1p6ZzRiSE01UTJodWJrUkRkbGhaTUZKM2VUZzVTazE2UldRMFRrTlRiVXh4UWtsNFdHdERNaTFIYUU4MWJqbDFWR2RYV25ZeGRUTnpWMU5WVHpNeldXVjNFaFpQTTNGRFdVcFRWME4wWlZOMFFXRlBiRmxRVVVKbkdpSkJUMDFaVW5kQ09ETm9VVGxSVTBsRE5uUlhPSGRpUm1OclRYTkdNbmhUY0VOMyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzQ1IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJheXQuY29tIiwibGluayI6Imh0dHBzOi8vd3d3LmJheXQuY29tL2VuL3NpbmdhcG9yZS9qb2JzL21hbmFnZXItcHJvZHVjdC1zdXBwbHktNTg5OTgzODAvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Insurance Product Manager (Digital)", "company_name": "Ethos BeathChapman", "location": "Singapore", "via": "via Laimoon.com", "description": "involved in the process of end to end product development, including monitoring post product launches. Your key role is to perform as a effective conduit between the business team and technology team when designing and delivering new insurance products in the regional marketplace.\n\nKey Responsibilities\n• Drive the end-to-end product development of insurance products; from conceptualisation , design, technical development, testing and roll out, to post-launch improvements and iterations.\n• Work closely with business stakeholders to design the right product and system architecture to support the business initiatives in targeted markets.\n• Effectively manage multiple stakeholders expectations and project time-lines.\n• Work with the technology and design teams to deliver comprehensive and customer-centric insurance solutions; including but not limited to customer policy administration, billing, claims management etc.\n\nKey Requirements:\n• Good educational qualifications with strong GPA... scores. Bachelor's degree or above in computer science, engineering, finance or related disciplines.\n• At least 2 years' experience in product development in insurtech/insurance companies for direct/digital distribution channels.\n• Strong understanding of at least 1-2 Southeast Asian online markets would be highly desirable.\n• Strong presentation and communication skills in English and Mandarin.\n• Self-driven, entrepreneurial, positive attitude and collaborative team player.\n• Take ownership in a lead role, enjoy working with dynamic stakeholders in a fast-paced working culture.\nInsurance", "extensions": ["8 days ago", "Full–time"], "detected_extensions": {"posted_at": "8 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJJbnN1cmFuY2UgUHJvZHVjdCBNYW5hZ2VyIChEaWdpdGFsKSIsImNvbXBhbnlfbmFtZSI6IkV0aG9zIEJlYXRoQ2hhcG1hbiIsImNvbXBhbnlfbWlkIjoiL2cvMTFjNzN6MHhtMCIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImhFYURQUmk2a3Q3cVJwWThBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2WUJDcmNCUVU1VlgwNXhVekZUU25CeE4wbGhSV1poWWxNelpFMTBUR2QyVGpObVRqazRYek4zUkdwcWIwSlNiVU5KYVRoMU0xZGlkbVJaZHpkaFFqVjNkbGhDV1ZORmVrbElVRkpKYldkVlRrbFdSV015Y0V4dU9HczBNWFZ6Tkc0NVdFcE5Ubm8yTWpWSFJVeFNUekJXYW04MWRHbFNTamcyUlRSUldHc3hOR0Z4WmtZdExUWkJPV0pUVDJWWGRHbG5kRVZKZVdOR2MxcHZiMmh2VGtsRlpGOXJORFkwZWpSM1RtVndVemRyWVdWaE9UTnRXa2Q2T0hOSkVoWlBNM0ZEV1VwVFYwTjBaVk4wUVdGUGJGbFFVVUpuR2lKQlQwMVpVbmREVGtJMlRWZEhlbHBoYjI5cWIyRk5PVFpwTTJWVmNXc3dURkZSIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNTMiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGFpbW9vbi5jb20iLCJsaW5rIjoiaHR0cHM6Ly9qb2JzLmxhaW1vb24uY29tL2pvYnMvZXh0ZXJuYWx2aWV3LzI1NzAzODIzP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "product manager - payments projects", "company_name": "Randstad", "location": "Singapore", "via": "via Monster", "description": "job description\n• High value projects\n• Concrete project timelines\n• Exposure to latest technology\n• Excellent salary package and benefits\n• Permanent role\nabout the company\nThis is an exciting opportunity to be a Product Manager (Payments projects) for a leading Multinational Corporation which has a strong presence globally. They have plans to kick start new project plans from as early as Q2 2021.\nabout the job\nReporting to the Principal Product Manager and collaborating with the UX/UI team, your responsibilities include:\n• Defining the product vision and creating an execution plan. This includes owning the strategic roadmap, from creation to implementation, to measuring success for the products.\n• Partnering with the UX/UI team to come up with wireframe designs.\n• Closely working with cross functional teams and technology to develop clear product documentation including specifications, user stories, wireframes, data visualizations, and process flows.\n• Engaging with stakeholders and... communicating the product vision to them to establish a common understanding and alignment on priorities.\n• Identifying best practices and implementing improvements to existing product processes.\n\nskills and experience required\nAs a successful candidate, you should have:\n• Bachelor’s Degree in Information Technology/Computer Science or equivalent\n• At least 7 years of experience in end to end product management including ideation, discovery, execution and post-launch.\n• At least 5 years of B2B (business to business) customer-facing experience\n• At least 5 years of experience in microservices and APIs\n• Experience working with UI/UX Team\n• Good competency in Agile methodology and practices\n• Strong customer-centric mindset\n• Excellent interpersonal and communication skills\n• Candidates from payments / e-commerce / SaaS / Cloud infrastructure industry will have added advantage\n\nThis is an excellent job role to start off high value projects from scratch for a leading Multinational corporation which will add tremendous value to your portfolio. You will have exposure to latest technology.\nTo apply online please use the apply function, alternatively you may contact Josh LIM at 6510 3660 or or josh.lim(at)randstad.com.sg\nskills\nproduct manager, technical product manager, product, products, payments, ecommerce, saas, cloud infrastructure, ux, user experience, ui, user interface, wireframe, process flow\nqualification\nAt least 5 years of B2B customer-facing experience\nAt least 5 years of experience in microservices and APIs\nExperience working with UI/UX Team\nPayments/E-commerce/SaaS/Cloud infra industry preferred\neducational requirements\nAssociate Degree/Diploma\nshare", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJwcm9kdWN0IG1hbmFnZXIgLSBwYXltZW50cyBwcm9qZWN0cyIsImNvbXBhbnlfbmFtZSI6IlJhbmRzdGFkIiwiY29tcGFueV9taWQiOiIvbS8wOHB0MXoiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJpMDlCR2MtTjdRSmQ4Uzl5QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VWxkS1owcFpPVEE1YmtkSFdXbFRXREJ4UjFWRFRWVkNhakY2U0VWdGQzZFNaWGxZV1ZnNWNFeDJiRTF1ZDJkVlJsQTFOR3BzYzBsdVVXOXVMUzFwUXpsWVlUWkVWbTk2TTJoelFrdHRVVzVSYmw4M2RFdERXV0Y1YWpWMmVHUmFiWFY2YXpsbWNXcHRabXQ0V1dKcVdrRkthazl3TURVNFFtNHpVMUF6WDJ0TlRVWlVVbWhzV1Zkb1IwVTFRUzExYmtwUFZHbGpiMUI2VEVaQkVoWlBNM0ZEV1VwVFYwTjBaVk4wUVdGUGJGbFFVVUpuR2lKQlQwMVpVbmRCYVZOSE1VSnhNak40ZHkxTFUyUkZlRVpWVGtSMVJEbEllRzVCIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNjEiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTW9uc3RlciIsImxpbmsiOiJodHRwczovL3d3dy5tb25zdGVyLmNvbS5zZy9hbXAvam9iLXZhY2FuY3ktcHJvZHVjdC1tYW5hZ2VyLXBheW1lbnRzLXByb2plY3RzLXJhbmRzdGFkLXNpbmdhcG9yZS0yNzA1MDcyNy5odG1sP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Product Manager (Web Application)", "company_name": "None", "location": "Singapore", "via": "via Jobs | Fidanto", "description": "Product Manager Looking for an experienced product strategist and communicator who is passionate about coming up with product solutions to drive business goals. This role will require you to be able to distil, document and evangelise company's web based product vision while working in an agile and fast-paced environment, using the latest and best practices across product planning, customer experience, product discovery, and product development. Lead ideation, development, launch, and iteration of approaches to improve revenue and user experience for our web services across desktop, mobile and apps Conduct market and competitor analysis to assess market needs and ensure products are competitive Gain a deep understanding of the user experience, identify and fill product gaps and generate new ideas that grow market share, improve customer experience and drive growth Influence stakeholders to build cross-functional buy-in and commitment to a shared product vision Develop and implement... product roadmaps Think multi-platform across online, mobile, video, social and events Test and measure everything and integrate quantitative and qualitative analysis into all product and management decisions Work closely with the Product Design and UX team Get a better understanding of our consumers and their usage of our products. Keep an ear out to our users through social networks, conversations with the sales team, to continuously make improvements and get new ideas. Manage the entire product lifecycle, from identifying user needs, planning the business case to creating products and services that are valuable, usable and feasible Work closely with the Client Service, Business Development & Marketing team to communicate product benefits, positioning and targets Conduct regular brainstorming sessions across the organisation on product features and performance Act as the key liaison for training needs as emerging products are launched Requirements At least Bachelor degree, MBA beneficial 4 years of product management experience, especially web-based products In-depth knowledge of web standards in design and usability Agile or Scrum certification preferred Expertise in product development tools (like JIRA, Confluence) preferred Expert on modern forms of product planning, customer discovery, product discovery, product development process and execution Strong analytical, business, project management, and organizational skills Exceptional influencing skills Entrepreneurial and commercially minded, highly creative Only Singaporeans and PRs need to apply Product Manager Looking for an experienced product strategist and communicator who is passionate about coming up with product solutions to drive business goals. This role will require you to be ab Skills: Agile, Business Strategy, Competitive Analysis, Confluence, e-commerce, Jira, Marketing Strategy, Product Design, Product Development, Product Management, Product Marketing, Product Planning, Project Management, Scrum, Social Media, Strategic Planning, Usability, Usability Design, Web Based, Agile Development Experience: 5.00-7.00 Years", "extensions": ["12 days ago", "Full–time"], "detected_extensions": {"posted_at": "12 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9kdWN0IE1hbmFnZXIgKFdlYiBBcHBsaWNhdGlvbikiLCJjb21wYW55X25hbWUiOiJOb25lIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJQNkhadElNVUZEQWRjSGdrQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnMgfCBGaWRhbnRvIiwibGluayI6Imh0dHBzOi8vc2cuZmlkYW50by5jb20vam9icy9qb2Itb3BlbmluZy9pbmZvcm1hdGlvbi10ZWNobm9sb2d5LXByb2plY3QtbWFuYWdlcnMvcHJvZHVjdC1tYW5hZ2VyLXdlYi1hcHBsaWNhdGlvbi0yNzIwMjIzNzg/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Management", "value": "GC18"}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Business Operations", "value": "GC06"}, {"text": "Advertising and Marketing", "value": "GC03"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Accounting and Finance", "value": "GC01"}, {"text": "Legal", "value": "GC17"}, {"text": "Farming and Outdoors", "value": "GC13"}, {"text": "Human Resources", "value": "GC15"}, {"text": "Sales and Retail", "value": "GC26"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "Product manager", "value": "product manager"}, {"text": "Manager", "value": "manager"}, {"text": "Project manager", "value": "project manager"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Development manager", "value": "development manager"}, {"text": "Director", "value": "director"}, {"text": "Manufacturing manager", "value": "manufacturing manager"}, {"text": "Marketing manager", "value": "marketing manager"}, {"text": "Plant manager", "value": "plant manager"}, {"text": "Production manager", "value": "production manager"}, {"text": "Program manager", "value": "program manager"}, {"text": "Regional", "value": "regional"}, {"text": "Senior", "value": "senior"}, {"text": "Sr. manager", "value": "sr. manager"}, {"text": "Account manager", "value": "account manager"}, {"text": "Admin manager", "value": "admin manager"}, {"text": "Affairs manager", "value": "affairs manager"}, {"text": "Assistant", "value": "assistant"}, {"text": "Brand manager", "value": "brand manager"}, {"text": "Commodity manager", "value": "commodity manager"}, {"text": "Communication", "value": "communication"}, {"text": "Customer", "value": "customer"}, {"text": "Dealer", "value": "dealer"}, {"text": "Devops engineer", "value": "devops engineer"}, {"text": "Engineering", "value": "engineering"}, {"text": "Executive", "value": "executive"}, {"text": "Product specialist", "value": "product specialist"}, {"text": "Production supervisor", "value": "production supervisor"}, {"text": "Risk manager", "value": "risk manager"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Transactional", "value": "transactional"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Internship", "value": "INTERN"}, {"text": "Part-time", "value": "PARTTIME"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Toiletries", "value": "/business/naics2007/3256"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Foods & Beverages", "value": "/business/naics2007/311"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Management", "value": "/business/naics2007/55"}, {"text": "Research", "value": "/business/naics2007/5417"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "Citi", "value": "/m/01dfb6"}, {"text": "Binance", "value": "/g/11hcz1r4wl"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "Amazon", "value": "/m/0mgkg"}, {"text": "Standard Chartered", "value": "/m/02hszk"}, {"text": "United Overseas Bank", "value": "/m/04gjd1"}, {"text": "Apple", "value": "/m/0k8z"}, {"text": "Tata Communications", "value": "/m/04338k"}, {"text": "Workato", "value": "/g/11dxpy_3xd"}, {"text": "BNY  Mellon", "value": "/m/02vps5x"}, {"text": "DBS Bank", "value": "/m/01q7n5"}, {"text": "EPAM Systems", "value": "/m/0dlnrc"}, {"text": "GVT Government Technology Agency (GovTech)", "value": "/g/11gh0528nq"}, {"text": "Grab", "value": "/m/0134c_p9"}, {"text": "Paypal", "value": "/g/122s91_5"}, {"text": "PeopleSearch Pte Ltd", "value": "/g/11c73ngn0w"}, {"text": "Randstad", "value": "/m/08pt1z"}, {"text": "Singapore Airlines", "value": "/m/015f2x"}, {"text": "TEKsystems (Allegis Group Singapore Pte Ltd)", "value": "/g/11b6g4bkv0"}, {"text": "ABBOTT LABORATORIES (SINGAPORE ) PRIVATE LIMITED", "value": "/m/09m57z3"}, {"text": "ADVANCE INTELLIGENCE PTE. LTD.", "value": "/g/11dymfkxss"}, {"text": "AXA", "value": "/m/04mn99"}, {"text": "Adecco Personnel Pte Ltd", "value": "/m/08gz46"}, {"text": "Adidas Group", "value": "/m/01jtml"}, {"text": "Aetna, a CVS Health Company", "value": "/m/0kg8x"}, {"text": "Agency for Science, Technology and Research", "value": "/m/0gmjcg"}, {"text": "Alibaba", "value": "/m/07s6ctl"}, {"text": "Argyll Scott", "value": "/g/11dxpk2374"}, {"text": "Autodesk", "value": "/m/018nm3"}, {"text": "Barry Callebaut", "value": "/m/03clky2"}, {"text": "BioMind", "value": "/g/11dymfr2l6"}, {"text": "CHUBB ASIA PACIFIC PTE. LTD.", "value": "/m/09m8xyh"}, {"text": "Cargobase", "value": "/g/11dxppfsjn"}, {"text": "Cargobase Pte Ltd", "value": "/g/11fy240nxm"}, {"text": "DKSH", "value": "/m/0dj2nh"}, {"text": "Dathena", "value": "/g/11dxprdn6y"}, {"text": "Dyson", "value": "/m/05cskg"}, {"text": "Enggsol Pte Ltd", "value": "/g/11g9mnfmm1"}, {"text": "Ethos BeathChapman", "value": "/g/11c73z0xm0"}, {"text": "Eu Yan Sang", "value": "/m/03cl9hn"}, {"text": "Flintex Consulting Pte. Ltd.", "value": "/g/11h1z41pzb"}, {"text": "GIVAUDAN SINGAPORE PTE LTD", "value": "/g/11f00wn519"}, {"text": "Goldman Sachs", "value": "/m/01xdn1"}, {"text": "GovTech Singapore", "value": "/g/11dxpkfs_6"}]}]}