{"search_metadata": {"id": "608279ad216a9d4338963561", "status": "Success", "json_endpoint": "https://serpapi.com/searches/ba4a85de1e338462/608279ad216a9d4338963561.json", "created_at": "2021-04-23 07:39:25 UTC", "processed_at": "2021-04-23 07:39:25 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28project+manager%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=70", "raw_html_file": "https://serpapi.com/searches/ba4a85de1e338462/608279ad216a9d4338963561.html", "total_time_taken": 1.69}, "search_parameters": {"q": "(project manager) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "70"}, "jobs_results": [{"title": "Training Program Manager", "company_name": "TikTok", "location": "Singapore", "via": "via Bayt.com", "description": "- Build, execute, measure, and improve/simplify different programs, including onboarding and leadership development.\n- Develop strategies and processes to ensure effective delivery of global training programs leadership development\n- Contribute to reporting on training activities and analyze data to drive results and learning effectiveness.\n- Create and manage the communication strategy for promoting and highlighting key training processes and activities across the network.\n- Partner with your internal peers and stakeholders to develop standardization, where applicable, across multiple other existing programs and training initiatives\n- Create innovative training solutions that are utilised in multiple geographies and languages.\n- Analyze and solve business problems with focus on understanding root causes and driving forward-looking opportunities\n- Work strategically with broad group of stakeholders inside Monetization Integrity organisation and beyond to capture interdepenancies... development opportunities and optimisation of existing training programs\n- Drive adherence to standardised processes and industry best practices learning solutions as well as getting feedback from the operational teams on areas of opportunity for improvement.\nEducation and Experience\n- BA/BS in Human Resource Management, Education, Business Administration or relevant Fields (relevant experience beyond the 7-year requirement will also be considered in lieu of a college degree). Master’s in Adult learning prefered.\n- Proven at least 5 years of working experience as Learning Program Manager, L&D Consultant, Learning Portfolio Manager or Instructional Design\n- Experience building, interpreting, and communicating performance metrics to multiple organizational levels\n- Proven ability to build, execute, manage, and improve programs and projects\n- Understanding of industry learning trends and best practices, adult learning theory, and instructional design principles\n- Ability to deal with ambiguity, limited data, excellence at prioritising, managing, and completing projects with tight deadlines\n- Experience working with cross-functional teams in a global environment\n- Proven ability to influence others without having positional authority\n- Ability to adapt well to fast-paced environments with quickly changing circumstances, direction, and strategy.\n- Technical aptitude to be able to quickly learn new technologies and develop various learning solutions.\n- A strong focus on internal customers' needs and satisfaction, with an emphasis in demonstrating return on investment in training. A qualified candidate will be focused on how training contributes to the company's bottom line and will have the analytical skills to justify programmatic decisions with data\n- Experience developing training in a variety of delivery modalities (virtual, hands-on/experiential, instructor led, remote classroom, synchronous/asynchronous) for a variety of audiences\n- Familiarity and/or experience with program management tools, learning management systems, instructional design tools, including Adobe Creative Suite, Captivate Suite/Storyline\nAdditional Qualifications / Skills:\n- Professional certification such as CIPD in Learning and Development is an advantage\n- Project Management Professional Certification is an advantage.\n- Proven ability to partner and collaborate with others at all levels within the organization, including senior leaders, managers, employees, and external resources.\n- Excellent facilitation and presentation skills including classroom and virtual delivery\n- Familiar with adult learning methodologies - Strong organizational and project management skills.\n- Ability to develop a vision and strategy while working in a collaborative manner. - Excellent verbal and written communication skills.\n- Ability to design practical learning solutions.\n- Ability to communicate with employees at all levels of the organization.\n- Excellent interpersonal skills. - Good understanding of instructional design methodologies\n- Experience in Design Thinking\n- Excellent verbal communication in English. Additional languages are a strong advantage (preferred languages - Vietnamese, Thai, Mandarin, Korean", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJUcmFpbmluZyBQcm9ncmFtIE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJUaWtUb2siLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjRCeTFsR0U1eUFmbEhoSGVBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQmF5dC5jb20iLCJsaW5rIjoiaHR0cHM6Ly93d3cuYmF5dC5jb20vZW4vc2luZ2Fwb3JlL2pvYnMvdHJhaW5pbmctcHJvZ3JhbS1tYW5hZ2VyLTU4ODE0MzE4Lz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Regional Project Manager", "company_name": "Timeo-Performance", "location": "Singapore (+1 other)", "via": "via SmartRecruiters Jobs", "description": "Company Description\n\nOur client, a leader in print and enterprise content management, looking for their Regional Project Manager.\n\nThis is a regional role, based in Singapore.\n\nJob Description\n• Conduct Project Kick Off meeting and gathering respective stakeholders for alignment\n• To conduct project consultancy to in-countries customers\n• Assist to resolve issues raised by regional service team and customers\n• Work with different teams to meet project milestones and deadlines\n• Prepared and submit required documentations to company managements or customers\n• Agreeing project objectives for RHQ and in countries\n• Providing independent advice on the management of projects\n• Organising the various professional people working on a project\n• Project risk assessment\n• Ensure quality standards are met and delivered\n• To hand over transformed project to service delivery team\n• Project delivery time, on-time, on-budget, on-scope\n• Project methodology and training for in-countries PMP... Certified\n\nQualifications\n• Candidate must possess at least a Bachelor’s Degree, Post Gradudate Diploma, Post Graduate Diploma, Professional Degree in IT/Computer Science\n• At least 5 years of working experience in the related\n• Experience in handling Managed Print Services across countries\n• Network infrastructure knowledge & system integration pre-sales skills would be an added advantage\n• Preferable with Microsoft Certification (MCSE, MCP etc.)\n• Proficiency in architecture & design experience with complex IT solutions that encompass applications, data and technologies across multiple platforms\n• Excellent interpersonal, good customer handling and presentation skills\n• Strong analytical skills with ability to analyse complex requirements with impact to both business & technical aspects\n• Willing to travel\n\nAdditional Information\n\nNote that only short-listed candidates will be notified. Thank you for your understanding", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJSZWdpb25hbCBQcm9qZWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJUaW1lby1QZXJmb3JtYW5jZSIsImNvbXBhbnlfbWlkIjoiL2cvMTFjNzN6ZzhzNSIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImhqZllFOTlEbUxrZE5peHlBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2WUJDcmNCUVU1VlgwNXhVemhaVlZKSU5pMDNjMkpLV1RoS2MyOVRZVEZxY1VscFRrRjViVk5IYWxkVWNrbHpZWFY2UW14YWNVSnJaM1JsWTNwdVZUQmFRa3BNVWpGTGRVZDFSVGRuTW1OZlUxbERUa1ZKYmpWbE9YUlhjV04xZDFaNlUwaEtNMFZNTVU1M1NqTm5aV3hqZDFsaU1sVnVTMVZhU1hFNFZrSnJlVWMzTUhGTFVFMXlYMU01VTJGSmFsRk5ZVlJQY0hJMGMwNWpNM1UzUWpCa01FWlpZbWxqTmxSUWVrUTJPSEZWV1d0cVdFZFRhVFJhWlc5QkVoWnlibTFEV1U5cFpVSnpUMnRmVVdJeGF6Vk1iMEpuR2lKQlQwMVpVbmRETmtKdE4wOXBOMjFHZUdOSGNFOHRZa2hmVmpBeWFEQjNiR0ZuIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMTEiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gU21hcnRSZWNydWl0ZXJzIEpvYnMiLCJsaW5rIjoiaHR0cHM6Ly9qb2JzLnNtYXJ0cmVjcnVpdGVycy5jb20vdGltZW8tcGVyZm9ybWFuY2UvMTAxNDQ5MDM5LXJlZ2lvbmFsLXByb2plY3QtbWFuYWdlcj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Data Center Migration Project Manager", "company_name": "EIRE Systems", "location": "Singapore (+1 other)", "via": "via Careers | EIRE Systems", "description": "IT Data Centre Consolidation Project Manager\n\nPosition\n• Initial engagement is for an IT Data Centre Consolidation Project Manager responsible for development of the scope and deliverables for migration and consolidation of 5 Asia Pacific in-country data centres to Singapore\n• The role is to work with corporate entities in to document detailed plans for upgrading and migrating all host systems to Singapore.\n• Subsequent to development and sign-off of the integrated migration plan by the global, regional and country management the role will be extended to define and manage the execution of the program and in conjunction with regional Information Technology managers and business heads.\n• Reporting to the Head of Infrastructure Project Management Office Singapore\n\nDuties and Responsibilities\n• Prepare project business case including Cost Benefit Analysis and Project Charter for approval by key stakeholders\n• Build regional inventory of all business systems\n• Current Infrastructure... Platforms\n• Software versions deployed and in use\n• Current licencing costs and charges\n• Current maintenance and support contracts and costs for all systems\n• Undertake an EOL analysis to identify technical challenges across all platforms\n• Complete high level capacity modelling for Singapore infrastructure to support the Regional business platforms\n• Identify and document all potential efficiencies\n• Financial\n• Support\n• Licencing\n• Maintenance\n• Develop and document the road map strategy to complete migration strategy\n• Sequence\n• Timeline\n• Resource plan\n• Budget\n• Co-ordinate engagement of all internal and external dependencies\n• Vendors\n• Resources\n• Management\n• Schedule and chair regular project steering committee meetings\n• Identifying gaps in technology capability versus business requirement\n• Supervising internal IT staff, consultants, vendors and suppliers\n• Meeting with IT analysts and finalizing essential IT infrastructure\n• Planning and supervising installation of IT infrastructure\n• Project management (scope, budget and schedule) including regular management reporting for projects remediation, user testing and roll out\n• Identify potential project risks and its implication to the organization and to recommend mitigating measures to manage the risks\n• Responsibilities for ensuring adherence of all deliverables to appropriate standards and quality levels\n• Identify, document and communicate all regulatory requirements pursuant to remote hosting and data retention for the target countries.\n• Propose a pragmatic solution that accounts for all regulatory requirements pursuant to remote hosting and data retention for the target countries.\n\nRequired Skills and Experience\n• Excellent knowledge about all aspects of information technology specifically with complex infrastructure environments\n• Excellent people skills, an ability to work harmoniously in diverse cultural and remote regional environments\n• Ability to work across all levels of IT and business management\n• Excellent analytical and observation skills\n• Ability to keep up with latest developments in the field and upgrade IT infrastructure\n• Good written and oral communication skills, an ability to present concise reports and recommendations\n• Excellent planning and organization ability\n• Excellent time management skills and understanding the value of a baseline\n• Excellent troubleshooting and problem solving abilities\n• Excellent management and leadership qualities\n• A minimum of 10 Years’ experience in:\n• Data Centre Operations, Migration, Move and/or Consolidation with exposure to recovery strategy planning and implementation\n• Project management experience working with application development teams\n• Managing mid to large scale multi-discipline IT infrastructure projects\n• Knowledge and Understanding of:\n• Servers, networks, and storage\n• Hyper-converged infrastructure\n• Virtualization technologies, VMWare preferred\n• Replication technologies, Zerto or SRM preferred\n• Backup technologies, Netbackup preferred\n• Financial Systems\n• The principles of information security\n• Contractual commitments and deliverables\n• Analytical and problem-solving skills with attention to detail\n• Organizational, planning, and project management skills\n• Computer skills — proficiency using stand business software, MS Office, and MS Project\n• Excellent presentation skills\n\nIT education and qualification\n• Bachelor's Degree in Engineering, Computer Science, Information Technology\n\nAny of the following:\n• Current project management certification (Prince2 or PMP)\n• ITIL Foundation\n\nInterested candidates please send your CV to malar.kannan@eiresystems.com", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEYXRhIENlbnRlciBNaWdyYXRpb24gUHJvamVjdCBNYW5hZ2VyIiwiY29tcGFueV9uYW1lIjoiRUlSRSBTeXN0ZW1zIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJKcjBxa2tLZ3pBMFB5aVVWQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIENhcmVlcnMgfCBFSVJFIFN5c3RlbXMiLCJsaW5rIjoiaHR0cHM6Ly9jYXJlZXJzLmVpcmVzeXN0ZW1zLmNvbS9jYXJlZXJzLzMwMjcyLUVJUkUtQ2FyZWVycy1Qb3J0YWwvam9icy8xMzE3NTI0NS1EYXRhLUNlbnRlci1NaWdyYXRpb24tUHJvamVjdC1NYW5hZ2VyLz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "ACMV Project Manager", "company_name": "STAFFHUB GROUP PTE LTD", "location": "Singapore (+1 other)", "via": "via Www.careers-Page.com", "description": "Key Responsibilities:\n• Responsible for the overall implement and completion of construction projects within scheduled time, cost and meet client quality requirement & contractual terms;\n• Liaise and communicate effectively with client/representative and consultants;\n• Provide professional advice/technical solutions to client and consultants when required;\n• Ensure compliance to safety & health standards, quality standards and relevant governing codes;\n• Study of Construction drawings details and coordinate with the consultants and sub-contractors to resolve any technical / site issues;\n• Monitor and coordinate the site activities involving the sub-contractors, supervisors and site workers;\n• Other ad-hoc assignments.\n\nQualification / Experience\n• Candidate must possess a well recognised Honours Degree in Mechanical Engineering/Construction Management\n• Must possess at least 5-10 years of ACMV experience in a local construction environment\n• Possess the necessary construction safety... certs (CSCPM, etc)\n• Preferably experience in General Building Works will be an added advantage\n• With analytical mindset and innovative problem-solving capabilities\n• Excellent written and interpersonal communications skills (English and Mandarin) - to liaise with Mandarin speaking associates\n• Strong stakeholder management skills in the interactions with various business associates\n• Good understanding of code of practice of M&E\n• Willingness to take ownership and responsibility\n• Independent, self-starter and able to work under tight schedule\n• Strong organisational skills\n• Certified Project Management Professional (PMP) and Lean Sigma will be an added advantage", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBQ01WIFByb2plY3QgTWFuYWdlciIsImNvbXBhbnlfbmFtZSI6IlNUQUZGSFVCIEdST1VQIFBURSBMVEQiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6InR6SzREcnVTWnE3NHQ4VUxBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gV3d3LmNhcmVlcnMtUGFnZS5jb20iLCJsaW5rIjoiaHR0cHM6Ly93d3cuY2FyZWVycy1wYWdlLmNvbS9zdGFmZmh1Yi1ncm91cC9qb2IvVzRSUjlXP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Learning & Knowledge Program Manager (Strategic Education)", "company_name": "IBM", "location": "Singapore (+1 other)", "via": "via IBM Global Careers", "description": "Introduction\nAt IBM, work is more than a job - it's a calling: To build. To design. To code. To consult. To think along with clients and sell. To make markets. To invent. To collaborate. Not just to do something better, but to attempt things you've never thought possible. Are you ready to lead in this new era of technology and solve some of the world's most challenging problems? If so, lets talk.\n\nYour Role and Responsibilities\nAs part of the GIC Learning & Knowledge shared services team, this profile will be directly working under the GIC Learning & Knowledge leader and liaise across learning domains and centers to project manage ‘strategic’ education deployments, manage key activities, and help coordinate and support the GIC Learning & Knowledge leader.\nYou will ensure the smooth running of the end-to-end program through working flexibly across the following areas:\n• Project management support; including change management, risk and issue management, reporting, status tracking, and... project reporting.\n• Create program strategies covering Communication, Deployment, Governance and Reporting.\n• Stakeholder management and reporting to them on the progress of the key programs.\n• Maintaining and supporting the GIC L&K Leader with the recurring cadence and on critical follows up from it.\n• Provision of standard documents and tools\n\nKey Responsibilities\nYou will be responsible for:\n• Work as Project lead for key strategic projects and deployments across the globe.\n• Reviewing and challenging reports provided for adherence to standards, completeness, and reasonableness.\n• Managing the initiative governance structure, assisting in the preparation and co-ordination of materials\n• Lead key meetings such as the Review meetings, Steering Committee/Forums and working group meetings.\n• Working to create and track Programme Tasks/ Budget including management and Reporting against the signed off Project plan.\n• Assisting in the development and management of a communication strategy, preparing status reporting, providing visibility on status and transparency of risks and issues for multiple levels of stakeholders\n• Maintaining and actively managing the initiative stakeholder map and communications plan\n\nQualifications and Skills Requirements\n• Experienced PMO with a demonstrable track record working on strategic/complex initiatives with cross functional delivery impact.\n• Deep Expertise in Learning & Knowledge functions in a Global organization.\n• Experience and Knowledge of Deploying large skilling programs across complex organisational structure.\n• Experience in Current Technologies, programming, and platforms (Cloud, AI, Software Engineering)\n• Experience in building data models and corresponding Data Analysis and visualization.\n• Experience in Executive stakeholder management, presentation, and communication\n• In-depth Knowledge of Project Office and Project Management function\n• Excellent communication, interpersonal and stakeholder management skills with the ability to work with and present to senior stakeholders.\n• Experience of delivering large scale transformation programs (preferably in Change management/ Talent transformation areas but not mandatory)\n• Experience of working with Technology to deliver complex projects.\n• Ability to execute quickly and effectively – strong influencing skills and ability to get things done in a complex matrix organizational structure.\n• Should have carried out Process improvement initiatives for a function/program to bring about simplification in managing operations, automation of tasks.\n• Should have carried out client stakeholder management with direct interfacing.\n• Should be a keen learner, proactive, enthusiastic, takes accountability, have demonstrated capability to be a differentiator in challenging environment.\n• PMP Certified (Required), Any other technical certifications (Preferred).\nKey Supporting Competencies\n• Command Skills - Relishes leading; takes unpopular stands if necessary; encourages direct and tough debate but is not afraid to end it and move on; is looked to for direction in a crisis; faces adversity head on; energized by tough challenges.\n• Organizational Agility - Knowledgeable about how organizations work; knows how to get things done both through formal channels and the in formal network; understands the origin and reasoning behind key policies, practices, and procedures; understands the cultures of organizations.\n• Business Acumen - Knows how businesses work; knowledgeable in current and possible future policies, practices, trends, technology, and information affecting his/her business and organization; knows the competition; is aware of how strategies and tactics work in the marketplace.\n• Dealing with Ambiguity - Can effectively cope with change; can shift gears comfortably; can decide and act without having the total picture; is not upset when things are up in the air; does not have to finish things before moving on; can comfortably handle risk and uncertainty.\n• Process Management - Good at figuring out the processes necessary to get things done; knows how to organize people and activities; understands how to separate and combine tasks into efficient workflow; knows what to measure and how to measure it; can see opportunities for synergy and integration where others cannot; can simplify complex processes; gets more out of fewer resources.\n\nRequired Technical and Professional Expertise\nAs above\n\nPreferred Technical and Professional Expertise\nAs above\n\n", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJMZWFybmluZyBcdTAwMjYgS25vd2xlZGdlIFByb2dyYW0gTWFuYWdlciAoU3RyYXRlZ2ljIEVkdWNhdGlvbikiLCJjb21wYW55X25hbWUiOiJJQk0iLCJjb21wYW55X21pZCI6Ii9tLzAzc2M4IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoibnlWOFVLN0c0OVktRF83V0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXNzQkNvd0JRVTVWWDA1eFVUUmlhVk5wTkRod2JXZERTMVJGY0dwU1psWkdlRzVwUVRsSlgyVmhVakV4TWxsTVIxY3RlSFJYZFRGeWVURXhaVk5OYTBweVZFNDJUMmxvTUVWRmRUUkVjWGxuZUhOalYyZ3lSVnAwVmxKeU1GVTViRXh4WVRCaGVrVm9SMWN0V20xV2FFbGZUemxJVjJaV1YzRkxlRGxIVldRd1ZFaFphMVZMU1VVd1puRmtXVzkxYmpFU0ZuSnViVU5aVDJsbFFuTlBhMTlSWWpGck5VeHZRbWNhSWtGUFRWbFNkMEpGTjNWelVFZGhSMVZ0WkVsa1RtVlBaMlptVjNoblRtdEZVWGMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18yOCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBJQk0gR2xvYmFsIENhcmVlcnMiLCJsaW5rIjoiaHR0cHM6Ly9jYXJlZXJzLmlibS5jb20vZnIvam9iLWRldGFpbHMtZnIvMTI0NzMxMDkvbGVhcm5pbmcta25vd2xlZGdlLXByb2dyYW0tbWFuYWdlci1zdHJhdGVnaWMtZWR1Y2F0aW9uLXNpbmdhcG9yZS1zZy8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Cash Management IT Senior Project Manager, CIO - VP", "company_name": "BNP Paribas", "location": "Singapore", "via": "via BNP Paribas", "description": "In Asia Pacific, BNP Paribas is one of the best-positioned international financial institutions with an uninterrupted presence since 1860. Currently with over 17,000 employees* and a presence in 13 markets, BNP Paribas provides corporates, institutional and private investors with product and service solutions tailored to their specific needs. It offers a wide range of financial services covering corporate & institutional banking, wealth management, asset management, insurance, as well as retail banking and consumer financing through strategic partnerships.\n\nWorldwide, BNP Paribas has a presence in 73 markets with more than 196,000 employees. It has key positions in its three main activities: Domestic Markets and International Financial Services (whose retail-banking networks and financial services are covered by Retail Banking & Services) and Corporate & Institutional Banking, which serves two client franchises: corporate clients and institutional investors. Asia Pacific is a key... strategic region for BNP Paribas and it continues to develop its franchise in the region.\n\nBNP Paribas offers you an exciting career in an international business environment that is fast-paced, diverse and focuses on creating high-value relationships with our clients. We offer competitive salary and benefits, as well as a working environment where you’re valued as part of the team.\n• excluding partnerships\n\nhttps://careers.apac.bnpparibas/\nPosition Purpose\n\nThis role is set to manage Cash Management IT projects (Site initiatives with Regional application/IT impact as well as Regional application releases). At the onset, the Project Manager will be assigned to take over and run an inflight payments-system migration project that is targeted to complete before mid-2021.\nThis role is essentially a leadership role to manage the various components (TBA, Operations, IT, TCOE, Compliance, IT Security, Stakeholders, etc) that forms the core and extended project team. He/she needs to plan and ensure task owners completes their work in accordance to the plan up to a point that he/she is also chair daily standup meetings to secure progress updates or ensure project issues or conflicts are resolved at the shortest possible time.\n\nThe project manager is also responsible for timeliness in reporting and escalations to Management is essential to flag critical dependencies, risks and issues for an executive decision that will align the delivery plan back on track.\n\nResponsibilities\n\nDirect Responsibilities\n• Deliver IT projects/releases within the agreed budget and schedule without compromising quality\n• Be knowledgeable and oversee and drive projects from initiation to post implementation support following SDLC/Agile and QMS methodologies. Enforce the Bank’s project management policies and procedures\n• Set expectation and project governance at kick off and monitor adherence/compliance throughout the project phases\n• Lead the (Core and Extended) Teams together and collaborate closely to deliver the project/release. Ensure delivery plans, objectives and targets are aligned clearly with the teams and stakeholders\n• Collate progress statuses to track/align reality with delivery plan and publish the reports to stakeholders\n• Manage project Dependencies, Risks and Issues with the project teams to overcome challenges or propose mitigation plans if require escalations to Management for decisions\n• Chair Steercos to provide communication and status reporting to stakeholders and senior management\n• Manage change requests and demands that may impact approved delivery plans\n• Vendor management (where applicable)\n• Clarity:\n\n- Baselining\n\n- Project Cards\n\n- Tracking of Actuals\n\n- Risk Monitoring and mitigation\n\nContributing Responsibilities\n• Develop new products jointly with other application/project teams\n• Contribute towards the end-to-end solutioning for these new products\n• Contribute towards defect leakage and quality improvement initiatives\n• To share support and expertise by providing training and knowledge sharing sessions\n\nTechnical and Behavioral Competencies required\n• A must to go into details, takes ownership and hold task-owners accountable to fulfill obligations in line with his or her project plans\n• Possess leadership quality to lead and drive projects\n• Be results-oriented\n• Able to manage dispute and possess good negotiation skills to align teams back on track to agreed IT delivery objectives and plans. Escalate to appropriate levels of Management for timely intervention to avoid further deterioration of project progression\n• Able to multi-task ie. manage projects in parallel\n• Able to manage stress and achieve team cohesion especially during difficult and challenging periods in delivering\n\nExperience and Qualifications required\n• Minimum 15 years of experience in working in IT projects and managing projects (and programs would be a bonus).\n• Good and proven fundamental knowledge of Project Management and Risk Management are essential and required for this role\n• PM certification is encouraged but not mandatory; proven track records in managing large sized project teams and deliverables\n• Have done budgeting/financial planning and tracking\n• Experienced in Cash Management IT or possess Cash Management domain knowledge would be a plus", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDYXNoIE1hbmFnZW1lbnQgSVQgU2VuaW9yIFByb2plY3QgTWFuYWdlciwgQ0lPIC0gVlAiLCJjb21wYW55X25hbWUiOiJCTlAgUGFyaWJhcyIsImNvbXBhbnlfbWlkIjoiL20vMDJxaGs0IiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiOF9pcE90b196QVp1SE5hMUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFUxOHlhblZGY1VkME4zaEJjSGcxV0hWS2FpMU1aamxoYm10T1FsSlhhRUppVlU1Zk9VZHZlSGxFZW5oTmVHUTRhRTB5TjNScFgxQnRXbkIxT1hsbGVXb3hUSEJyYW1oSlVFVkhOek5XYWpGdE9FOVJTbHBFT0ZaVlNrNVpkMk5wVWkxSFgzbFJja1V6VWprM1RrUlhNa1ZNTFdRelEyWm1VVFUxZW5SU04xZHFkVWh1WTJsT1puTXljREpoVlU5MVlsUkJaMHhUTWtGME1WWjNFaFp5Ym0xRFdVOXBaVUp6VDJ0ZlVXSXhhelZNYjBKbkdpSkJUMDFaVW5kQ1NUaFJZblJxVEZCa1NXbGpOV1ZvWHpNME1YQnFZa2hCUW5CMyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzM2IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJOUCBQYXJpYmFzIiwibGluayI6Imh0dHBzOi8vZ3JvdXAuYm5wcGFyaWJhcy9lbi9jYXJlZXJzL2pvYi1vZmZlci9jYXNoLW1hbmFnZW1lbnQtc2VuaW9yLXByb2plY3QtbWFuYWdlci1jaW8tdnA/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Project Manager (Network Infrastructure)<h1 style=\"text-align: justify;\"> </h1> <h1 style=\"text-align: justify", "company_name": "BizLINKS Resources", "location": "Singapore (+1 other)", "via": "via BizLINKS Resources Pte Ltd", "description": "• Be a single point of contact to customers on project deliverable\n• Responsible for small scale to large ones amounting to more than S$10 million\n• services scoping and deliverables\n• effort estimation\n• work breakdown structure\n• deliver project based on methodology, within time/budget\n• Lead a team of engineers to implement the solutions and compilation of documents to hand-over to support team for operation maintenance support\n\nRequirements\n• Network Systems Integration Experience\n• PMP certification preferred\n• Salary budget 6K\n\nAPPLY FOR THIS POST\n\nGeneral CV submission", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIgKE5ldHdvcmsgSW5mcmFzdHJ1Y3R1cmUpXHUwMDNjaDEgc3R5bGU9XCJ0ZXh0LWFsaWduOiBqdXN0aWZ5O1wiXHUwMDNlIFx1MDAzYy9oMVx1MDAzZSBcdTAwM2NoMSBzdHlsZT1cInRleHQtYWxpZ246IGp1c3RpZnkiLCJjb21wYW55X25hbWUiOiJCaXpMSU5LUyBSZXNvdXJjZXMiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IlNwVlZxVG9WZnN5UzNpeGVBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQml6TElOS1MgUmVzb3VyY2VzIFB0ZSBMdGQiLCJsaW5rIjoiaHR0cHM6Ly93d3cuYml6bGlua3MuY29tLnNnL2luZGV4LnBocC9qb2ItbGlzdGluZ3MtbWFpbm1lbnUtMjcvMTMtaXQtam9icy8xNTctcHJvamVjdC1tYW5hZ2VyLW5ldHdvcmstaW5mcmFzdHJ1Y3R1cmU/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Senior Internal IT Project/Programme Manager", "company_name": "NTT", "location": "Singapore", "via": "via Careers At NTT", "description": "Job Summary\n\nPosition Overview\n\nThe Senior Project Manager will be under the direction of the Director of R&D Program Management and Supporting Services, and will oversee high-priority projects which often require considerable resources and high levels of functional integration. The Senior Project Manager will take projects from original concept through final implementation ensuring the project meets its approved timeline, scope, quality, and cost targets. The Senior Project Manager will interface with all areas affected by the project including Product Management, Development, Global Services, Marketing, operating companies, and vendors.\n\nShort Description\n\nKey Accountabilities\n\nAs the Senior Project Manager, you will be accountable to:\n• Work directly with all departments under the R&D group (including Product Management, Architecture, Product Architecture, Development, Product Services Office, etc.) as well as groups outside of R&D (including Global Services, Marketing, Business... Operations, Sales Enablement, etc.) and possibly outside of NTTS (including third party vendors and NTT operating companies)\n• Facilitate planning projects, confirming scope, uncovering of requirements, managing change, and using available technology appropriately for storage/sharing of information (SharePoint, Aha, etc.)\n• Monitor and track project progress, actively manage risks and issues, and effectively escalating when needed\n• Communicate proactively with stakeholders at all levels\n• Participate in the tracking of testing and deployment activities led by other groups influencing as appropriate\n• Assist with engagement and management of third party vendors towards successful delivery according to project and contract constraints\n• Propose changes and engage team members to modify processes to increase quality and/or efficiency\n• Provide detailed project plans, budget forecasts, and schedules, outlining critical path, deployment approach, work activities, milestones, deliverables, resources, and dependencies for each R&D project.\n• Support the use of Agile-based processes for development deliverables and according to NTTS’ Agile implementation and SDLC; work closely with Product Owners/Architects on the escalation of blockers, monitoring of sprints, and refactoring the overall project plan.\n• Other project management duties that may be assigned\n\nLong Description\n\nExperience Skills and Qualifications\n\nAs the Senior Project Manager your skills and qualifications will include:\n• Bachelors degree in Computer Science, Information Management, Business Administration or a related field from an accredited college/university\n• Possesses training and certification in the following areas (preferred but not required): Project Management Professional (PMP), Agile Certified Practitioner (PMI-ACP) and/or other related certifications\n• Minimum of twelve (12) years of experience as the project manager on multi-million dollar software development or complex system implementation projects\n• Minimum of three (3) years of experience working with Agile projects as well as the ability to balance Agile development inside of a larger waterfall/predictive project\n• Must be able to nurture self-organizing, high performing teams through servant leadership and mentoring\n• Must be able to work effectively with teams and individuals distributed globally across time zones and cultures\n• Must encourage, support, and guide continuous improvement of the team, its products and processes\n• Must be able to resolve conflict through arbitration, negotiation, reasoned discussion, or escalation\n• Must be willing and able to identify problems, impediments, dependencies, and other team dysfunctions, and then facilitate quick resolution\n• Must be able to lead a team to make realistic and achievable delivery commitments\n• Must be effective and clear in presenting to large groups in person and in virtual, phone- based meetings\n• Must be able to identify project management related training needs for one self and the team\n• Assist in the hiring of new project managers and/or project team related resources", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgSW50ZXJuYWwgSVQgUHJvamVjdC9Qcm9ncmFtbWUgTWFuYWdlciIsImNvbXBhbnlfbmFtZSI6Ik5UVCIsImNvbXBhbnlfbWlkIjoiL20vMDVteWJwOCIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjBJY2xMMFJ0RC00N2Z3MGNBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVzc0JDb3dCUVU1VlgwNXhVbWR1Y0VSblVHMXVaVTFvZVdOclFWaE1NV2RGV0RGUlZWaHlhM05NZEU5WFdWOXVPWEZxUnpOMFNtWndaWEpNYVZoV1JEQmxWMUpMVUVGM1JtSk1iRXBWT0hOU1EyeHFia0pEU0dZelNHOHlZbkEwZUVzdFpqQlplVlV6VDBkRGRVWTJNR1JxYlVGcFpETjNOa3hxTkVacmQxQjRTV0pKVFhwaE5FbDRTRkpwYkhWSGVFSVNGbkp1YlVOWlQybGxRbk5QYTE5UllqRnJOVXh2UW1jYUlrRlBUVmxTZDBGSE5WcE9kemRUWDNsUWNXdFZYMUpUU1hsamNXZHhlRlppV1hjIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNTAiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQ2FyZWVycyBBdCBOVFQiLCJsaW5rIjoiaHR0cHM6Ly9jYXJlZXJzLmhlbGxvLmdsb2JhbC5udHQvZ2xvYmFsL2VuL2pvYi8zNzk0L1Nlbmlvci1JbnRlcm5hbC1JVC1Qcm9qZWN0LVByb2dyYW1tZS1NYW5hZ2VyP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Project Manager - Data Analytics", "company_name": "Sciente Inc", "location": "Singapore", "via": "via SCIENTE", "description": "A very exciting opportunity for a Project Manager who has experience in managing Data Analytics project, to join the Group Audit team in one of the leading Banks.\n\nMandatory Skill(s)\n• Bachelor Degree in Computer Science or Information Systems disciplines;\n• At least 6 years’ experience in project Delivery;\n• Minimum 4 years of Project Management skills;\n• Excellent ability of implementing Data Analytics project;\n• Good exposure in banking Industry;\n• Ability to work independently, manage stress and multitask in a fast paced environment;\n• Excellent stakeholder management skills;\n• Strong communication, presentation, documentation and negotiation skills.\n\nDesirable Skill(s)\n• Prior experience in consulting;\n• PMP certification.\n\nResponsibilities\n• Responsible for the end to end timely and on budget delivery of Data Analytics Projects;\n• Ensure the technical feasibility of the project by liaising with stakeholders in defining the scope, objectives and measure of success;\n• Work closely... with the Business Users / Product Owners and communicate schedule of the progress and if required escalate to the management;;\n• Responsible for creating a workplan/schedule for the activities required to successfully complete the project;\n• Trace the financials on monthly basis;\n• Plan and manage the risks and issues to avoid cost and schedule impact;\n• Examine the quality of work done on regular basis ensuring that project standards are met", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIgLSBEYXRhIEFuYWx5dGljcyIsImNvbXBhbnlfbmFtZSI6IlNjaWVudGUgSW5jIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJsR1lyTldRbGk1YURXbEVlQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFNDSUVOVEUiLCJsaW5rIjoiaHR0cHM6Ly93d3cuc2NpZW50ZS5jb20vc2NpZW50ZS1pbmMvdGVjaG5vbG9neS1qb2JzLzU1MDIvcHJvamVjdC1tYW5hZ2VyLS0tZGF0YS1hbmFseXRpY3MvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Program Manager", "company_name": "None", "location": "Singapore", "via": "via Jobs", "description": "Today Lonza is a global leader in life sciences. We are more than 15,000 employees in more than 100 locations around the world. While we work in science, there is no magic formula to how we do it. Our greatest scientific solution is talented people working together, devising ideas that help businesses to help people. In exchange, we let our people own their careers. Their ideas, big and small, genuinely improve the world. And that's the kind of work we want to be part of. As our business grows, we are looking to further strengthen our Program Management team by hiring a Program Manager (PM) to lead internal project teams. You will be responsible to ensure flawless and smooth execution of the contracted programs according to defined timelines and cost, via leading multidisciplinary project teams. In this role, the Program Manager is the key interface between Sales and Operations organizations and the customer. Program Manager is responsible to manage multiple projects, either within... one technology, or within multiple technologies and oversees the complete life-cycle of all the projects. Based on experience, programs under PM's responsibility range from small or mid-sized to large and complex portfolios, based on the seniority. During execution, key focus is on the customer centricity and internally on quality, cost, profitability, timelines and risk management. Key responsibilities: · Lead project execution after deal closure. Direct, lead and motivate multi-disciplinary project teams and hold team members accountable to deliver results within an agreed project governance structure to ensure customer satisfaction throughout the life of the program. Shared customer relationship management with Account Managers. · Coach, mentor and, via frequent discussions with line managers, continuously develop project team members. · Program Manager utilize in-depth understanding of multiple functions and strong relationships with these functions during the execution. · Act as single point of contact for customer with regards to operational questions and ensure each project milestone is delivered in line with the agreed objectives. Act as the customer advocate and champion in the Lonza's Singapore Project Management organization. · Manage project scope, timelines and budget and program profitability together with core project team. Raise and prepare scope changes and communicate them to a customer in close collaboration with Account Manager. In collaboration with Account Management / Commercial Development, create mid-long term program strategies. · Define, organize and be responsible for all customer communication (using an open communication model), agreeing milestones and conducting \"lessons learned\" with the customer, as well as executing decommissioning at the end of contractual activities. · Program Manager ensures the right and effective internal and external governance are in place and are effective. Also ensures very clear alignment of internal stakeholders. · Contribute to the local Sales & Operations meeting, by best in class forecasting and demand planning for the given programs. Key requirements: · Degree in Life Sciences related discipline with commercial acumen or experience in project planning; PMP Certification highly desired. · Experience working in FDA regulated biotech/pharma industry with proven experience in a project management capacity. · Relevant business and customer interaction experience in a CDMO highly preferred, but not essential. · Knowledge base of clinical research strongly preferred, with experience of moving pharmaceutical products from clinical into commercial manufacturing environments an advantage. · Statistical techniques and failure analysis, validation concepts. · Excellent communication and negotiation skills to be applied at high level. · Excellent soft skills to build solid relationship within the global network, e.g. with customers, key accounts, and program management. Every day, Lonza's products and services have a positive impact on millions of people. For us, this is not only a great privilege, but also a great responsibility. How we achieve our business results is just as important as the achievements themselves. At Lonza, we respect and protect our people and our environment. Any success we achieve is no success at all if not achieve ethically. People come to Lonza for the challenge and creativity of solving complex problems and developing new ideas in life sciences. In return, we offer the satisfaction that comes with improving lives all around the world. The satisfaction that comes with making a meaningful difference. Today Lonza is a global leader in life sciences. We are more than 15,000 employees in more than 100 locations around the world. While we work in science, there is no magic formula to how we do it. Our Skills: biologics , Leadership, Life Sciences, Management, Process Improvement, Program Management, Project Management, Strategic Planning, Strategy, project teams Experience: 7.00-10.00 Years", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9ncmFtIE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJOb25lIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJHWDI0Z3dfT0lYV1dZT3RDQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnMiLCJsaW5rIjoiaHR0cHM6Ly9zZy5maWRhbnRvLmNvbS9qb2JzL2pvYi1vcGVuaW5nL2luZm9ybWF0aW9uLXRlY2hub2xvZ3ktcHJvamVjdC1tYW5hZ2Vycy9wcm9ncmFtLW1hbmFnZXItMjc4NTAyMDY0P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Management", "value": "GC18"}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Advertising and Marketing", "value": "GC03"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Media, Communications and Writing", "value": "GC20"}, {"text": "Transportation and Logistics", "value": "GC30"}, {"text": "Art, Fashion and Design", "value": "GC05"}, {"text": "Construction", "value": "GC09"}, {"text": "Education", "value": "GC11"}, {"text": "Human Resources", "value": "GC15"}, {"text": "Protective Services", "value": "GC23"}, {"text": "Property", "value": "GC24"}, {"text": "Science and Engineering", "value": "GC27"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "Project manager", "value": "project manager"}, {"text": "Program manager", "value": "program manager"}, {"text": "Manager", "value": "manager"}, {"text": "Delivery manager", "value": "delivery manager"}, {"text": "Project director", "value": "project director"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Senior", "value": "senior"}, {"text": "Consultant", "value": "consultant"}, {"text": "Coordinator", "value": "coordinator"}, {"text": "Deputy director", "value": "deputy director"}, {"text": "Director", "value": "director"}, {"text": "Group manager", "value": "group manager"}, {"text": "Operations", "value": "operations"}, {"text": "Scrum master", "value": "scrum master"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Services", "value": "services"}, {"text": "Vice president", "value": "vice president"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Engineering Services", "value": "/business/naics2007/5413"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Entertainment", "value": "/business/naics2007/71"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Management", "value": "/business/naics2007/55"}, {"text": "Real Estate", "value": "/business/naics2007/53"}, {"text": "Research", "value": "/business/naics2007/5417"}, {"text": "Retail", "value": "/business/naics2007/44"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": ".AB4Jjf.qPB6Vc{padding-right:11px}.qfpP8d{padding:7px 0 7px 11px}.S003Ke{flex:none}.ZoN4Lb{color:rgba(0,0,0,.54)}.nAXVG{color:#70757a}.IxQsL{color:rgba(0,0,0,.26)}.xFO1De{color:#fff}.ooFpK{color:rgba(255,255,255,.30)}.mtnwac{color:#4285f4}.WxeeKb{color:#34a853}.hIVRU{color:#f29900}.EXaTMc{color:#fbbc04}.sxn46d{color:#000}.gqMTF{color:#1a73e8}.zpn8Mb{color:#d93025}.dEUPmd{color:#1e8e3e}.PJNo1{color:#fbbc04}Actively Hiring", "value": "e"}, {"text": "Michael Page", "value": "/m/04cxldw"}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Nanyang Technological University", "value": "/m/0l49k"}, {"text": "Jobline Resources Pte Ltd", "value": "/g/11gp2647pn"}, {"text": "Randstad Singapore", "value": "/g/11g70b50mr"}, {"text": "GECO Asia", "value": "/g/11gk72_bt_"}, {"text": "Facebook", "value": "/m/0hmyfsv"}, {"text": "HP", "value": "/m/03mnk"}, {"text": "IoTalents", "value": "/g/11dxq187wm"}, {"text": "NCS Group", "value": "/m/0282746"}, {"text": "National University of Singapore", "value": "/m/01q460"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "OPTIMUM SOLUTIONS (SINGAPORE) PTE LTD", "value": "/g/11g70hkrbx"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "ACI HR Solutions Ltd", "value": "/g/11c73ryh3p"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Apple", "value": "/m/0k8z"}, {"text": "Avensys Consulting", "value": "/g/11g7022gjf"}, {"text": "BNP Paribas", "value": "/m/02qhk4"}, {"text": "Ceridian", "value": "/m/07f8h6"}, {"text": "Ensign InfoSecurity", "value": "/g/11g4jhymjr"}, {"text": "Humanica Asia Pte. Ltd", "value": "/g/11h1y98c9z"}, {"text": "Kerry Consulting", "value": "/g/11c73vtzc8"}, {"text": "Marsh and McLennan", "value": "/m/053rw"}, {"text": "NSEARCH GLOBAL", "value": "/g/11dxpksll4"}, {"text": "NTT", "value": "/m/05mybp8"}, {"text": "OakTree Consulting", "value": "/g/11g70jfhtq"}, {"text": "Salesforce", "value": "/m/07btr5"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "TEKsystems", "value": "/g/11b6g4bkv0"}, {"text": "Teradyne", "value": "/m/04bzqp"}, {"text": "Toshiba Tec Singapore Pte. Ltd", "value": "/g/11g9n9q547"}, {"text": "Trustwave", "value": "/m/0n3xjf5"}, {"text": "Wood Plc", "value": "/m/07vv9s"}, {"text": "Workiva", "value": "/m/0113m1rd"}, {"text": "A-it Software Services Pte Ltd", "value": "/g/11dxpy_gl_"}, {"text": "ABS Group", "value": "/g/11dxplj1z6"}, {"text": "AIA", "value": "/m/02r5cgx"}, {"text": "ASEAN CABLESHIP PTE. LTD.", "value": "/g/11b7dsfph2"}]}]}