{"search_metadata": {"id": "60827eb596f5d7401e49cdb0", "status": "Success", "json_endpoint": "https://serpapi.com/searches/32193bb278c760e1/60827eb596f5d7401e49cdb0.json", "created_at": "2021-04-23 08:00:53 UTC", "processed_at": "2021-04-23 08:00:53 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28software+engineer%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=220", "raw_html_file": "https://serpapi.com/searches/32193bb278c760e1/60827eb596f5d7401e49cdb0.html", "total_time_taken": 2.77}, "search_parameters": {"q": "(software engineer) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "220"}, "jobs_results": [{"title": "Senior Software Developer-Senior Software Engineer-Consultant - Workflow Developer", "company_name": "Hcl Singapore Pte. Ltd.", "location": "Singapore (+1 other)", "via": "via Monster", "description": "• At least 3 years of hands-on experience in developing BPMS applications using Intalio/Appway/Flowable\n\n• Understand business / system requirements and translate them into technical solutions which are scalable, stable and fit for purpose\n\n• Design and develop modules within a larger system\n\n• Ensure adherence to standards (incl. code, security and performance)\n\n• Exposure to WM systems (CRM, AML, Order Entry, Workbench, eBanking)\n\nProfessional\n\n• Minimum 10 years of Java EE application design and development experience.\n\n• Minimum 8 years of SQL development experience\n\n• Minimum 8 years of hands-on development experience\n\n• Minimum 5 years of experience in the Banking domain\n\nTechnical\n\n- Take responsibility for creation of the workflow solutions using BPMS as per Specifications\n\n- Able to understand existing workflows and amend as per change request.\n\n- Very good exposure in web services using WSDL and REST.\n\n- Consult closely with technical lead and project manager for project... tasks (Prefer to have exposure to working with virtual team)\n\n- Create well-designed, reusable objects.\n\n- Document software code and ensure that technical documentation i.e. configuration guides, install guides meet requirements", "extensions": ["15 days ago", "Full–time"], "detected_extensions": {"posted_at": "15 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgRGV2ZWxvcGVyLVNlbmlvciBTb2Z0d2FyZSBFbmdpbmVlci1Db25zdWx0YW50IC0gV29ya2Zsb3cgRGV2ZWxvcGVyIiwiY29tcGFueV9uYW1lIjoiSGNsIFNpbmdhcG9yZSBQdGUuIEx0ZC4iLCJjb21wYW55X21pZCI6Ii9nLzExZnkyNW5nc3YiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJlMTh0T0VtbTRxOUh6QmFRQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFb3NDQ3N3QlFVNVZYMDV4VTI1S00zWnJVMFZSZDJwR2NrVkNNbUY1UmtKVVZFcFZjVTlMWW1rdFpuVlhiVmx1TFVsQ1NreFdaSGRWTTNaWVl6QlJlbkZUTlZkcE1WWmFTekZZTkhOc1VVVjFjbEp1TXpoNFJuWmlVMVJpZEdoYU0xbEZVSGRCVDBSTmRFbFdTMFJ5WW1vM1IyZFNXRE40ZVVZM1MxZFBhMWQxZFVSdE0ySldlRXA2UzI1SmEzbzJOazF5YjFOelNsQk9YM014Y0ZScmFWQnZXVkkyU0Zoa1V6aDBXRzFQZDE5Vk1rSm9ZWE5wUW5KWmNVOTRNMlJ3WTBoaFVEQkZXR0Y0V0VsdGFHTlRTM1JZRWhaME16WkRXVTVmZWtsd1NEWXRaMU52T1dKbWIwRlJHaUpCVDAxWlVuZENUMU5pZUY5c2FFVnBUemN6U1VodVJYRkpWMTlhYjJFMU5VWm4iLCJmY3YiOiIzIiwiZmNfaWQiOiJmY182IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1vbnN0ZXIiLCJsaW5rIjoiaHR0cHM6Ly93d3cubW9uc3Rlci5jb20uc2cvYW1wL2pvYi12YWNhbmN5LXNlbmlvci1zb2Z0d2FyZS1kZXZlbG9wZXItc2VuaW9yLXNvZnR3YXJlLWVuZ2luZWVyLWNvbnN1bHRhbnQtd29ya2Zsb3ctZGV2ZWxvcGVyLWhjbC1zaW5nYXBvcmUtcHRlLWx0ZC1zaW5nYXBvcmUtMjc2MjgyMjcuaHRtbD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior Software Engineer (JavaScript)", "company_name": "EPAM Systems", "location": "Singapore (+1 other)", "via": "via Bayt.com", "description": "EPAM is committed to providing our global team of more than 41,150 EPAMers with inspiring careers from day one. EPAMers think creatively and lead with passion and honesty. Our people are the source of our success. We value collaboration, work in partnership with our customers, and strive for the highest standards of excellence. In today’s market conditions, we’re supporting operations for hundreds of clients around the world remotely. No matter where you are located, you’ll join a dedicated, diverse community that will help you discover your fullest potential.\n\nDESCRIPTION\nWe are looking for an experienced Senior Software Engineer with strong experience in JavaScript and some experience in Java.\n\nYour team:\n• You’ll be working with Derivs & Solutions in Singapore as a DeskDev working closely with the wider DeskDev team in IT, Development & QA teams both locally and globally\n• In addition you will be working closely with global business stakeholders to elicit and review... requirements\nWhat You’ll Do\n• The role involves working together with front office trader and sales, utilizing a variety of technologies to provide fast time-to-market and applications, covering all aspects of equity derivatives: pricing and quoting, data analytics, market data, risk management, trade capture, etc\n• The role will be responsible for developing high quality trading and sales tools for the desk with a side focus of integrating proven solutions\n• The candidate will be participating in the design and development of cutting edge infrastructure, systems, and applications(both client and server side) used by Front Office to provide streamlined and revenue-generating services to our clients, examples of which include:\n• Building and expanding a leading Electronic RFQ platform for the client’s Flow Structured Business globally\n• Designing and building a micro-service based Pre-Trade platform for global Equity Derivatives business\n• Enhancing Excel-based pricing / param / risk management tools onto service-based Web apps\n• The candidate will be expected to closely liaise with trading, sales, quants, structuring and the tech groups in the equity derivatives business. The products spread across exchange listed, OTC and exotics\n• The candidate will be able to rapidly learn in-depth knowledge and gain experience of Equity Derivatives trading / risk management from both technology and business perspective\nRequirements\n• This position is open to professionals with >7 years of experience\n• Minimum Bachelor degree from a recognized University. Computer Science / Engineering / Mathematics majors preferred\n• Self-motivated with independent thinking, and a quick learner that can thrive in a fast-paced environment\n• Strong communication skills in both written and verbal English. Experience in working across business and IT at all levels will be a plus\n• An excellent team player with a good balance of strategic view & rapid application development\n• Strong interest in applying academic knowledge/technical skills to solving practical problems in the Investment Banking industry\n• Technical Capabilities:\n• Strong scripting language (Python / Javascript / ReactJS + TypeScript) and one core language (Java / C#)\n• Solid background in data structure and algorithms\n• Knowledge of Web development will be a plus\n• Knowledge of Equity Derivatives will be a plus\n• Knowledge of Kafka, Kubernetes, Docker, SQL, KDB, Excel/VBA and Unix programming will be a plus\n• Good understanding of testing and familiarity with different testing approaches. Familiarity of TDD / BDD will be a plus\n\nWe offer\n• Friendly team and enjoyable working environment\n• Work-life balance and flexible schedule\n• Online training library, mentoring, career development and potential partial grant of certification\n• Unlimited access to LinkedIn learning solutions\n• Referral bonuses\n• Compensation for sick leave and paid time off\n• Opportunities for self-realization", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgRW5naW5lZXIgKEphdmFTY3JpcHQpIiwiY29tcGFueV9uYW1lIjoiRVBBTSBTeXN0ZW1zIiwiY29tcGFueV9taWQiOiIvbS8wZGxucmMiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiItQjVaY2hqT0pYTzc1UE5zQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VW5rNVF6aFJXbGhFUkhaSlp6UkdWVUowVmpCbE5UbE1UM2N0V2pFMVRHSlpialpVUVVOYVQzQjZlbVJ2UkhSb2JGQlZOalJoZUZsR1JsOUhhMmhEWm1kemFtNDVaVXBRY25kNVNXeFpNRFpUYW14amJUVjNkazR6U0haWFJWRllObTFNU0V3MGIycFBUVEJUYjJOd1gxRklXRWhIZEUxUlZITXpXV1o2ZFRkaGEwVm5XUzFZVG1sUWNHNXJSVGhFYmw5dlIwOTBUVXBhUmkxbkVoWjBNelpEV1U1ZmVrbHdTRFl0WjFOdk9XSm1iMEZSR2lKQlQwMVpVbmRFVUdRMGNVUnBWRlI2TFdwc1ZWUk1UbU5YWjI1WWFsUjJWR3huIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMTMiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQmF5dC5jb20iLCJsaW5rIjoiaHR0cHM6Ly93d3cuYmF5dC5jb20vZW4vc2luZ2Fwb3JlL2pvYnMvc2VuaW9yLXNvZnR3YXJlLWVuZ2luZWVyLWphdmFzY3JpcHQtNTkxNzAzOTcvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Lead I - Software Engineering", "company_name": "UST Global Singapore Pte Limited", "location": "Singapore (+1 other)", "via": "via Jobs", "description": "Job Description : Role Proficiency: Act creatively to develop applications and select appropriate technical options optimizing application development maintenance and performance by employing design patterns and reusing proven solutions account for others' developmental activities Outcomes: Interpret the application/feature/component design to develop the same in accordance with specifications. Code debug test document and communicate product/component/feature development stages. Validate results with user representatives; integrates and commissions the overall solution Select appropriate technical options for development such as reusing improving or reconfiguration of existing components or creating own solutions Optimises efficiency cost and quality. Influence and improve customer satisfaction Set FAST goals for self/team; provide feedback to FAST goals of team members Measures of Outcomes: Adherence to engineering process and standards (coding standards) Adherence to project... schedule / timelines Number of technical issues uncovered during the execution of the project Number of defects in the code Number of defects post delivery Number of non compliance issues On time completion of mandatory compliance trainings Outputs Expected: Code: Code as per design Follow coding standards templates and checklists Review code – for team and peers Documentation: Create/review templates checklists guidelines standards for design/process/development Create/review deliverable documents. Design documentation r and requirements test cases/results Configure: Define and govern configuration management plan Ensure compliance from the team Test: Review and create unit test cases scenarios and execution Review test plan created by testing team Provide clarifications to the testing team Domain relevance: Advise Software Developers on design and development of features and components with a deep understanding of the business problem being addressed for the client. Learn more about the customer domain identifying opportunities to provide valuable addition to customers Complete relevant domain certifications Manage Project: Manage delivery of modules and/or manage user stories Manage Defects: Perform defect RCA and mitigation Identify defect trends and take proactive measures to improve quality Estimate: Create and provide input for effort estimation for projects Manage knowledge: Consume and contribute to project related documents share point libraries and client universities Review the reusable documents created by the team Release: Execute and monitor release process Design: Contribute to creation of design (HLD LLD SAD)/architecture for Applications/Features/Business Components/Data Models Interface with Customer: Clarify requirements and provide guidance to development team Present design options to customers Conduct product demos Manage Team: Set FAST goals and provide feedback Understand aspirations of team members and provide guidance opportunities etc Ensure team is engaged in project Certifications: Take relevant domain/technology certification Skill Examples: Explain and communicate the design / development to the customer Perform and evaluate test results against product specifications Break down complex problems into logical components Develop user interfaces business software components Use data models Estimate time and effort required for developing / debugging features / components Perform and evaluate test in the customer or target environment Make quick decisions on technical/project related challenges Manage a Team mentor and handle people related issues in team Maintain high motivation levels and positive dynamics in the team. Interface with other teams designers and other parallel practices Set goals for self and team. Provide feedback to team members Create and articulate impactful technical presentations Follow high level of business etiquette in emails and other business communication Drive conference calls with customers addressing customer questions Proactively ask for and offer help Ability to work under pressure determine dependencies risks facilitate planning; handling multiple tasks. Build confidence with customers by meeting the deliverables on time with quality. Estimate time and effort resources required for developing / debugging features / components Make on appropriate utilization of Software / Hardware's. Strong analytical and problem-solving abilities Knowledge Examples: Additional Comments: None Job Description : Role Proficiency: Act creatively to develop applications and select appropriate technical options optimizing application development maintenance and performance by employing design patterns and reusing proven solutions account for Experience: 0.00-50.00 Years", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJMZWFkIEkgLSBTb2Z0d2FyZSBFbmdpbmVlcmluZyIsImNvbXBhbnlfbmFtZSI6IlVTVCBHbG9iYWwgU2luZ2Fwb3JlIFB0ZSBMaW1pdGVkIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJ0ek9zZ2N6V2NEOXJkNUIxQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnMiLCJsaW5rIjoiaHR0cHM6Ly9zZy5maWRhbnRvLmNvbS9qb2JzL2pvYi1vcGVuaW5nL2NvdW5zZWxvcnMtYWxsLW90aGVyL2xlYWQtaS1zb2Z0d2FyZS1lbmdpbmVlcmluZy0yNzU3MjQwMjY/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "(Staff/Sr.) Software Quality Assurance Engineer", "company_name": "Omnivision Technologies, Inc", "location": "Singapore", "via": "via Glassdoor", "description": "Responsibilities:\n\nAs part of the overall software group that delivers SDKs for Automotive Linux and Neural processing, you will work closely with software engineers and managers to:\n\n- establish a strong objective quality process with automated tools\n• develop and execute test plans, suites, cases and reports\n• drive test automation\n• continuously improve quality metrics\n\nRequirements:\n\nMust have:\n\n- 8 years of SQA experience with 3 years in team & process leadership\n• Ability to derive test specifications from a product feature prioritising the user's perspective\n• Ability to develop multiple test suites for different release quality vs market window requirements\n• Strong knowledge of any collaboration, defect, versioning and test tools such as Confluence, JIRA, Git and TestRail\n• Strong communication and documentation skills\n\nAdvantageous to have:\n\n- ISTQB certification\n• Python & bash based automation development experience\n• TestRail admin and usage experience", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiIoU3RhZmYvU3IuKSBTb2Z0d2FyZSBRdWFsaXR5IEFzc3VyYW5jZSBFbmdpbmVlciIsImNvbXBhbnlfbmFtZSI6Ik9tbml2aXNpb24gVGVjaG5vbG9naWVzLCBJbmMiLCJjb21wYW55X21pZCI6Ii9tLzAyN2xubnQiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJHZXdvdVozRUVZaUlwT2tuQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFb3NDQ3N3QlFVNVZYMDV4VTBaVWNWOVpURUZtTVV4a1ltdzRkbk5xZG5GbWEySnNabk15TkVselIxZ3dNbXMyVlRONVRWa3paa3RuY0ROWWJWVlRYMlZFU0V0dWJGWk9SelIxUVU1bFQzTXplRzVEUjNWSFRrSktkbnAwWms4MldVOHplakZaVkRKMVpGRlNUM2t6TWxOeFkxVTNTRXRyWm5jM2IwUTJiVlJ5UkU5bExYbFZTVmhsU0U5MlJGQlZaRTF1Y0ZsdFlVUnFOakUxTUVrMmQzZHZNbmxuUlhvNVFrUkNjMFE0TTFaVllWSXdWRGsxTWsxU1JIbDFhMlpCVEU1SVVYZHROVE5MWjBrd04wdHdXbVE1RWhaME16WkRXVTVmZWtsd1NEWXRaMU52T1dKbWIwRlJHaUpCVDAxWlVuZEVMVWx5YTFobGFFeFBOVk5uU2t0NVV6SlBURXRmY25sdlp6QjMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18yNSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBHbGFzc2Rvb3IiLCJsaW5rIjoiaHR0cHM6Ly93d3cuZ2xhc3Nkb29yLnNnL2pvYi1saXN0aW5nL3N0YWZmLXNyLXNvZnR3YXJlLXF1YWxpdHktYXNzdXJhbmNlLWVuZ2luZWVyLW9tbml2aXNpb24tdGVjaG5vbG9naWVzLUpWX0lDMzIzNTkyMV9LTzAsNDRfS0U0NSw2OC5odG0/amw9NDA0MTIyNjg2OVx1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "IT Software Engineer (Magento)", "company_name": "UrbanFox", "location": "Singapore", "via": "via LinkedIn", "description": "Responsibilities\n• Maintain and customize existing ecommerce (Magento) platform\n• Development of backend application services and web APIs\n• Identifying and implementing of security and data protection\n• Identifying and optimizing application performance\n• Participate in code review\n• Participate in application architecture design\n• Providing application support, identifying, and resolving technical issues\n• Such other duties and responsibilities as may be reasonably requested by your immediate supervisor / the head of department from time to time.\n\nRequirements\n• Strong programming foundation\n• At least 3 years of hands-on experience in 1 or more high performance PHP projects\n• At least 3 years of hands-on experience with relational databases, preferably MySQL\n• At least 3 years of hands-on experience with ecommerce platforms, preferably Magento\n• At least 3 years of hands-on experience with API development\n• Demonstrated ability in writing code that are well organized and reusable\n•... Team player, outspoken, always ready to share and contribute ideas\n\nGood To Have\n• Magento Certified Developer\n• Experience with Unit Testing\n• Experience with AWS, and basic DevOps skills\n• Knowledge of GIT, Laravel/Lumen\n\nKay added this: Knowledge of GIT, Laravel/Lumen [L(1]\n\nAbout UrbanFox Asia\n\nUrbanFox was unveiled on 24th October 2017, but is not new to the industry. Formerly known as Courex, she was founded in 2009, mainly operating as a Courier service company. Over the years, Courex has evolved into an end-to-end urban logistics expert that provides reliable and economical solutions to help businesses maximize its sales potential. We offer warehousing, multi-channel commerce and delivery solutions.UrbanFox has come a long way since its early days and is now a subsidiary of Keppel Logistics, and works closely with its parent company to leverage on mutual strengths. With Keppel's extensive regional network and UrbanFox’s nimbleness, we are excited about its regional prospects and the growth potential it is able to provide to its customers.We have built a strong foundation of technical know-how and we are constantly exploring new ideas with the aim of adding value to our customers’ businesses. Our team stays up to date on industry’s challenges to help realize customers’ growth ambitions so as to offer solutions that are relevant for different markets around the region.UrbanFox is passionate about building sustainable and innovative solutions that are suitable for businesses of all sizes. We aim to establish long-term partnerships with our customers by providing them with the best experience and value to their business. Accelerate your growth with us", "extensions": ["14 days ago", "Full–time"], "detected_extensions": {"posted_at": "14 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJJVCBTb2Z0d2FyZSBFbmdpbmVlciAoTWFnZW50bykiLCJjb21wYW55X25hbWUiOiJVcmJhbkZveCIsImNvbXBhbnlfbWlkIjoiL2cvMTFnaHM3eTB3NiIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImR6ZXZGSFVvUmNjRlpMcWJBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhWRTFzWW1GR1VVVm1SVWgwVVVaYVdYSXhTMGRTZVROVFpHeG5aa3R2VjNOc01YTkxTSEZLUldaWE5sa3pWV3BPTFVsemNFTkZORW8zUjJrdE1VRXlPSEJHWlhCM1kxUTBOMGRTUTBkWE5XbFpXSFpwVVRCWlVWTlFUV3R5T0U1NGVVOU5XaloyV0Uxb2NrSktiMWhFVlY5VlprRkdTVWhwWjNCUVZWSlJSMVpyTlRGeU4zcE1lSEY0T1doZmNVNTFVak5FZFdFNE4yNHlZVk4zRWhaME16WkRXVTVmZWtsd1NEWXRaMU52T1dKbWIwRlJHaUpCVDAxWlVuZENPV05UWVZsd05EQjBSamt0ZEY5MGJGVmhkMGhmZERKUmNrTjMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18zMyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL3NnLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvaXQtc29mdHdhcmUtZW5naW5lZXItbWFnZW50by1hdC11cmJhbmZveC0yNDk2NTIyMzM5P3JlZklkPTI3Y2Q2MTYyLWM4MGYtNDZkOC04NTk3LTRiOGEwMzgxMzNjNlx1MDAyNnRyYWNraW5nSWQ9VWx6bGxHZUN6SExWbzNOdzdtZnI4QSUzRCUzRFx1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Software Engineer (Cryptography)", "company_name": "Thales Group", "location": "Singapore", "via": "via WhatJobs", "description": "Location: Singapore, SingaporeIn fast changing markets, customers worldwide rely on Thales. Thales is a business where brilliant people from all over the world come together to share ideas and inspire each other. In aerospace, transportation, defence, security and space, our architects design innovative solutions that make our tomorrow's possible.Thales in Singapore has been present since 1973, providing state-of-the-art solutions for customers in the aerospace, defence, security and transportation markets. Today, Thales in Singapore employs over 600 people and is home to all regional avionics services, a ground transportation integration centre, and regional innovation hub.\n\nThe Cryptography team in Singapore develops embedded cryptographic libraries for the Mobile Connectivity Solutions business unit. These libraries are integrated in Thales’ products such as removable SIMs and eSIMs. As a Software Engineer, you will be working in a stimulating environment doing software development... and evaluation. This is an ideal role for engineers who want to focus on writing small but complex functions on an embedded target.\n\nA week in the life of an Embedded Software Engineer:\n\nYou will develop and validate software libraries implementing cryptographic functions You will incorporate security countermeasures suited for the end product’s requirements You will occasionally perform attacks on smartcards’ cryptographic module You will assist in the certification of smartcard products You monitor innovation in embedded cryptography. This includes new attack techniques or implementations.\n\nKnowledge, Skills and Experience:\n\nYou must have a Bachelor’s Degree in Computer Science or Computer Engineering. It would be preferred if you have a Master’s degree in Computer Science or Computer Engineering, basic understanding of modern cryptographic algorithms and secure coding, knowledge of possible attacks, software countermeasures. Proficiency in low level programming languages such as C or Assembly. Strong understanding of architecture and programming model of microcontrollers. Willingness to learn Mathematical concepts related to cryptography. It would be preferred if you have used embedded development tools like emulators or development kits. We would like someone to join our team who is a strong verbal and written communicator, logical and creative problem-solver, open-minded and a quick learner. We are looking for someone with at least 2 years of experience in a software engineering position or a related role. At Thales we provide CAREERS and not only jobs. With Thales employing 80,000 employees in 68 countries our mobility policy enables thousands of employees each year to develop their careers at home and abroad, in their existing areas of expertise or by branching out into new fields. Together we believe that embracing flexibility is a smarter way of working. Great journeys start here, apply now", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciAoQ3J5cHRvZ3JhcGh5KSIsImNvbXBhbnlfbmFtZSI6IlRoYWxlcyBHcm91cCIsImNvbXBhbnlfbWlkIjoiL20vMDFwaGo0IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoib0N2VGJOMUprdEJ4MTFzYkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFUydFljMXBFV1VnelRsRkVSR2cxVkhaYWJDMVZiek14WXpkUUxXTnpTRUl6WDJsb1oyaDNWMmd0TVVzd01YWXljbmRMTTJKcldFVnNjRTlOWm1aRk5rUlVYMXBmYkRCWlNWUTFlVzFFYUZSRmVuaHBaVWN4UWs1aVh6bGhiRkZqTVRReGFreDFhalpTVEdjeE9FMW9hVk50V1hZM1ZsVlFkVVJFUVdoeVRXdERZMDR6U2tSdmFtWjRRVWhDUTJZeVRHUlRkV0Z2ZDNVNVRFSlJFaFowTXpaRFdVNWZla2x3U0RZdFoxTnZPV0ptYjBGUkdpSkJUMDFaVW5kRFMwNW9ja2RrYmtJMFIwSldTVGhtWW1kWFZuQktORzFhYWpoUiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzQxIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFdoYXRKb2JzIiwibGluayI6Imh0dHBzOi8vZW4tc2cud2hhdGpvYnMuY29tL2pvYi1mb3ItU29mdHdhcmUtRW5naW5lZXItQ3J5cHRvZ3JhcGh5LWluLVNpbmdhcG9yZS1jb29wMTc1NjkyMTg/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Assistant Manager / Manager, Full Stack Developer", "company_name": "Changi Airport Group", "location": "Singapore (+1 other)", "via": "via Glassdoor", "description": "An exciting opportunity is waiting for you in the newly set up Digital Factory, who will spearhead the digital transformation efforts of Changi Airport Group. You will be working on Commercial and Operational digital applications and projects that will transform our business and bring customer experience to greater heights. You will be working in squads with fellow enthusiasts, re-imagining how we serve our connected customers. As a digital disrupter, you’ll recreate and redefine our business to generate lasting competitive advantage, focusing on building the applications for Changi’s existing / new digital products.\n\nYou will be responsible for the below areas:\n• Produce HTML/CSS/JavaScript code from design documentation for integration into desktop and mobile websites and web applications.\n• Understand cross-browser and cross-platform concepts and concerns.\n• Ensure code and design quality through the execution of test plans.\n• Strong attention to detail and understanding of UX and... visual design concepts to provide leadership perspective on front and backend technologies and their overall impact on the creative process.\n• Work closely with internal and external design, business, and technical counterparts.\n• Adopt the agile approach: Develop, test, analyse and iterate the applications with the end objectives and key results in mind.\n\nRequirements:\n• A bachelor’s degree in a relevant computer science discipline.\n• 4-6 years in-depth knowledge and experience of front-end and backend development for consumer facing applications, including websites and mobile devices etc.\n• Ability to solve complex development problems and produce the highest quality code while striving to push the technical boundaries of online applications.\n• Familiar with AWS components and services, e.g. S3, API Gateway, Lambda Functions, etc. AWS Certified Solution Architect (Associate) preferred.\n• Familiar with AWS serverless components, e.g. implementing microservices using DynamoDB, SQS, Cognito, S3, Lambda, and Python coding.\n• Development and consumption of RESTful web APIs or web services\n• Strong understanding of W3C and accessibility guidelines\n• HTML, XHTML, HTML5, CSS, Web graphic production\n• AJAX / JavaScript / jQuery\n• Responsive Design and grid frameworks (Bootstrap, Foundation, etc", "extensions": ["5 days ago", "Full–time"], "detected_extensions": {"posted_at": "5 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBc3Npc3RhbnQgTWFuYWdlciAvIE1hbmFnZXIsIEZ1bGwgU3RhY2sgRGV2ZWxvcGVyIiwiY29tcGFueV9uYW1lIjoiQ2hhbmdpIEFpcnBvcnQgR3JvdXAiLCJjb21wYW55X21pZCI6Ii9tLzA2dzMxOWgiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJMSHJiY3dmaVNxbFFpQXMwQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdllCQ3JjQlFVNVZYMDV4VTNFNGNEZ3pOWFF4YjFWcFozQlNUbGxNTVRWdGJGa3hZbWRKTWt4aVZGaEpRV3gzT1UwMFJrazRUMVpWY1RWSmNXbHdURU41ZDJwemVsVlNkMkpRZFZKSFlYVjJOR0ZtUVY4NE1WaDJVSFk1YzBWb2FUVXdPRzlvZFc1Zk5tOVhjR05FU0U5WVVXVmFOM2h0V2xWTFdGUm9WMkpEYVVrMmRreE5UMDVoVkZCeGIzWkdWRU5yZGt4bFkwYzBSMFk0VlZwTmFEaE9Zak0wYmkwNGMzbHBZalpqTjJ4TlZYbFdkR2xWY1c5clNFRXdFaFowTXpaRFdVNWZla2x3U0RZdFoxTnZPV0ptYjBGUkdpSkJUMDFaVW5kQk1UVTJkVE0wTldWc05razRSV3RHZHpWdlFpMXdhVGxXTlZsUiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzQ5IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEdsYXNzZG9vciIsImxpbmsiOiJodHRwczovL3d3dy5nbGFzc2Rvb3Iuc2cvam9iLWxpc3RpbmcvYXNzaXN0YW50LW1hbmFnZXItbWFuYWdlci1mdWxsLXN0YWNrLWRldmVsb3Blci1jaGFuZ2ktYWlycG9ydC1ncm91cC1KVl9JQzMyMzU5MjFfS08wLDQ2X0tFNDcsNjcuaHRtP2psPTM4MDU0NzA1MDZcdTAwMjZ1dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Automation Lead", "company_name": "Ridik Pte. Ltd", "location": "Singapore", "via": "via Jobs | Fidanto", "description": "Show recruiters you're immediatley available for job opportunities Posted On: 3 days ago Total Views: 2 Job Id: 27539645 Permanent Job Job DescriptionResponsibilities: Review requirements, specifications and technical design documents to provide timely and meaningful feedback Create detailed, comprehensive and well-structured test plans and test casesDevelop testing strategy, framework and testing processes Identify, analyze, record, document thoroughly and track bugs Track quality assurance metrics, like defect densities and open defect countsDesign, develop and execute automation scripts using open source tools. Possibly, perform automated testing, instead of regression. Liaise with users to understand and detail the requirements. Further, share the detail requirement with technical teams. Works together with the software developer to enhance and improve programs Prepare unit test cases for the developers and review the outcome from the development phase itself. Estimate... prioritize, plan and coordinate testing activities Requirements: Total experience should be around 7 to 15 years. Must have testing experience in data ware house project (50% at least data side) ETL and data verification manually and automation . Must have experience in manual and automation experience (1 year minimum) any TOOL is fine and minimum 1 year UI (user interface) testing No need test manager profiles. For initial 6 months Individual contributor and after 2-3 guys ll report to him. Project length is 3-5 years. Skills: Proven work experience in software development and software quality assurance Strong knowledge of software QA methodologies, tools and processesExperience in writing clear, concise and comprehensive test plans and test cases Hands-on experience with both white box and black box testing Hands-on experience with automated testing tools Hands-on testing experience in UI based application projects Good to have testing experience in Micro service based projects Experience in SQL, Java scripting, and Java programming Good to have experience in Big Data testing OR, Ready to learn and implement Big Data testing. Good to have certification in testing area Bachelor/Master degree in Computer Science, Engineering or related subject. As Test Lead: - Design/Architect the automation framework and develop new solutions. - Implement QA processes and automate testing to improve the overall testing cycle. - Assist in test planning aIf you are motivated, resourceful, skilled in Software Engineering, and passionate about automating software testing, maybe you will be interested in this job. Responsibilities * Design, build anGoodpack is an innovator in developing safe and cost-efficient transportation and storage solutions for challenging payloads, including natural rubber, food and liquids and specialty industrial goods Responsibilities: * Lead the team of testers perfoming automation Testing * Setup the testing framework aligned with the team. * Plan and execute performance, compatibility & regression testiTHE CLIENT Our client is a top Global Banking organization providing various services and solutions to their extensive clientele base. They are looking for an experienced Senior QA & Automation Test Beam is Asia-Pacific’s largest and fastest-growing shared micromobility company led by technology and innovation. We’re on a mission to turn little drives into better rides and make cities flow better• Leading a team of engineers to support and maintain the technology stack comprising the automation solution and infrastructure. • Responsible for the management and support of the automation systemsJob Description --------------- Roles & Responsibilities: * Analyze Business Requirements, design, develop, test and deliver quality software products in a complex environment. * Supports the a* Leading a team of engineers to support and maintain the technology stack comprising the automation solution and infrastructure. * Responsible for the management and support of the automation sy* Create test plans, test strategy, Daily Test Progress Reports and Test Completion Status Updates * Work with IT teams in setting up test environments and test data * Identify test automationGive your career a boost with Monster's resume services.Simple body text this will replace with orginal content Toll Free No: +8001-012-339 91-40 66116994", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBdXRvbWF0aW9uIExlYWQiLCJjb21wYW55X25hbWUiOiJSaWRpayBQdGUuIEx0ZCIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiOUVacnZnM3ZscE54VVZnQUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIHwgRmlkYW50byIsImxpbmsiOiJodHRwczovL3NnLmZpZGFudG8uY29tL2pvYnMvam9iLW9wZW5pbmcvc29mdHdhcmUtZGV2ZWxvcGVycy1zeXN0ZW1zLXNvZnR3YXJlL2F1dG9tYXRpb24tbGVhZC0yNzU0NTcxNjQ/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Staff Software Engineer (Golang / Java / Fullstack)", "company_name": "VISA", "location": "Singapore", "via": "via Bayt.com", "description": "Job Description and Responsibilities\n\nQualifications", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTdGFmZiBTb2Z0d2FyZSBFbmdpbmVlciAoR29sYW5nIC8gSmF2YSAvIEZ1bGxzdGFjaykiLCJjb21wYW55X25hbWUiOiJWSVNBIiwiY29tcGFueV9taWQiOiIvbS8wMWtxam4iLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJjT3JPb3I3RzVNdEcxdXpyQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFc3NCQ293QlFVNVZYMDV4VVZoeFRUTkxPVXRaUkZaR2FFcDRSMGRoWWpSWU5HNTRRMDFXWkZZdGVUVTBka3RyUzFRd2FuTkJjelJCZEVkRlFVa3dYekJNU0hvNVVHRmtSbHBvTVdzeWJHeFVVVkZTWmtaTlpVRkhaa0YwZUdWWFdGSlpRazVmZFdSNU9VTjNRMkZHTVdjek0xOVJTbnBXVVhSTFVVMXlhVWx1Y1dKMVNrUjROWEZ3WTBadVRrbFpZMW9TRm5Rek5rTlpUbDk2U1hCSU5pMW5VMjg1WW1adlFWRWFJa0ZQVFZsU2QwUTVkRVJRYkhacWR6Z3dTa1pMY3pKMlQzVkJTRmxYUmxKUFQwRSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzYxIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJheXQuY29tIiwibGluayI6Imh0dHBzOi8vd3d3LmJheXQuY29tL2VuL3NpbmdhcG9yZS9qb2JzL3N0YWZmLXNvZnR3YXJlLWVuZ2luZWVyLWdvbGFuZy1qYXZhLWZ1bGxzdGFjay01ODc2MzAyNy8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Software Engineer/ Associate Consultant/ Lead Engineer/ Senior Software Engineer/ Consultant - Veeva", "company_name": "HCL SINGAPORE PTE. LTD.", "location": "Singapore (+1 other)", "via": "via LinkedIn", "description": "More than 3+ years’ experience in Merck SDLC development and GATE support Program.\nMust be able to develop a dashboard or analytics reports using CRM OD.\n\nExperience Required In Oracle CRM On Demand Integration.\n\nAnalyze/troubleshoot the SSIS jobs used for ETL.\nGood to have understanding of VEEVA architecture, data model and security model\nAble to translate business requirements into technical specifications\nGood to have experience in ITIL Process like Incident, Knowledge, Change and Release management\nLead life sciences customers in the rapid configuration ,implementation and project Management of the Vault Regulatory software suite (Vault Registrations, Vault Submissions, Vault Submissions Archive, Vault Publishing)\nArchitect multi-phased implementation programs to deploy Vault RIM across an organization globally\nDigital Marketing & Channels – Pharmaceutical Consent Hub data process flow experience (must)\nManage/lead the project for Vault PromoMats Setup and administer Veeva... development, deployment and CRM/ PromoMats integration\nExperience working with Zinc\nVeeva Sample management process expertise\nExpertise in managing the Project related Veeva campaign Management, remote interaction.\nPrimary customer liaison managing relationships and communication between the project team, customer and internal stakeholders\nProgram and project management including resource planning, leading and motivating a cross-functional team, and project tracking and forecasting\nCollate and share life sciences industry best practices with our customers around commercial excellence. Evangelize Multichannel customer relationship management in the life sciences industry.\n\nMandate Skills\nCertified Project Management Professional from PMI\nCertified in Veeva CRM\nExperience in Veeva Vault\nMust delivered program budget ranging USD 10 Mil\nWell Versed with multiple module program Integration\nGood Experience in working in Pharma domain\nWell versed with GxP Guidelines\n\nMSPS, IVE, MSP\nGxP Guidelines, LOMA Nomenclarure, SOX guidelines.\nVeeva Vault\nOracle CRM OD certification\nVeeva CRM\n\nOracle, MYSQL\n\nSituation Intelliegence tool\n\nGOOD to HAVE\nOracle CRM OD certification\nVeeva Vault\n\nTechnical / Professional Skills\nIoT, Blockchain, Enterprise Architect\n\nNon-Technical / Soft Skills\nExcellent Communication skills & a team leader.\nProven ability to work with people from different cultures\nA high level of intelligence; ability to operate not only on the basis of important past experiences, but in the light of the approaches and developments that occur in the market.\nNatural problem solving inclination\nHigh level presentation and interpersonal skills\nExperience decomposing complex problems into component parts for effective problem solving", "extensions": ["30 days ago", "Full–time"], "detected_extensions": {"posted_at": "30 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlci8gQXNzb2NpYXRlIENvbnN1bHRhbnQvIExlYWQgRW5naW5lZXIvIFNlbmlvciBTb2Z0d2FyZSBFbmdpbmVlci8gQ29uc3VsdGFudCAtIFZlZXZhIiwiY29tcGFueV9uYW1lIjoiSENMIFNJTkdBUE9SRSBQVEUuIExURC4iLCJjb21wYW55X21pZCI6Ii9nLzExZnkyNW5nc3YiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJRU3ZjMnFYZjN0ZkU2NkZBQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFb3NDQ3N3QlFVNVZYMDV4VkRORFMzRkJYM1ZYWTJaSmQxSTJOeTFaWWtaM2NrODRiVzVoZFd4bFJYaEVjMmM0YTFCWGFuaDZabVp2WVZGeFdXUlRUR3hVUXpBM2NGWndkVXhhVVZweGRsVlNjVXBHZHpjNFkybE5iWHBNWVRkRVZreHBRVEl6V25Cdk5GSXpkVUZqTkRSUGFtVndWbEZDUzNOaU1XUktVbFZNVlhkMGVXOTNWVGRHWW5OUVNWaDZZemsyVmtGbWJrdE5OVWR5YlhKMU0xOWpSV3g1U21JM2VFTndjRmcwY25SeWJUQTBVSG90UzJWRk4wOWZORTlsYW1sSlJHdE5hbGx1V0VoYVJXZElUa1pMRWhaME16WkRXVTVmZWtsd1NEWXRaMU52T1dKbWIwRlJHaUpCVDAxWlVuZERXWE5wWTJ0TlFVSTRkamc1VUZaTUxVMHplR3RpT1VKT1FqaDMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY182NyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL3NnLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvc29mdHdhcmUtZW5naW5lZXItYXNzb2NpYXRlLWNvbnN1bHRhbnQtbGVhZC1lbmdpbmVlci1zZW5pb3Itc29mdHdhcmUtZW5naW5lZXItY29uc3VsdGFudC12ZWV2YS1hdC1oY2wtc2luZ2Fwb3JlLXB0ZS1sdGQtMjQ3NTU2MTEwMT9yZWZJZD04YTIxM2Q1Mi1jMGFjLTRmOWMtYjFiOC04MzQ0NDEyZDQ2OTdcdTAwMjZ0cmFja2luZ0lkPXVQZGV0NUMyNnFqamZtOTdqc0NvSWclM0QlM0RcdTAwMjZ1dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}], "chips": [{"type": "Title", "param": "job_family_1", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Software engineer", "value": "software engineer"}, {"text": "Senior", "value": "senior"}, {"text": "Engineer", "value": "engineer"}, {"text": "Cloud engineer", "value": "cloud engineer"}, {"text": "Test engineer", "value": "test engineer"}, {"text": "Assurance engineer", "value": "assurance engineer"}, {"text": "Research engineer", "value": "research engineer"}, {"text": "It engineer", "value": "it engineer"}, {"text": "System engineer", "value": "system engineer"}, {"text": "Data engineer", "value": "data engineer"}, {"text": "Devops engineer", "value": "devops engineer"}, {"text": "Java engineer", "value": "java engineer"}, {"text": "Network engineer", "value": "network engineer"}, {"text": "Principal engineer", "value": "principal engineer"}, {"text": "Qa engineer", "value": "qa engineer"}, {"text": "Quality engineer", "value": "quality engineer"}, {"text": "Research associate", "value": "research associate"}, {"text": "Solutions engineer", "value": "solutions engineer"}, {"text": "Technical", "value": "technical"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Associate", "value": "associate"}, {"text": "Associate engineer", "value": "associate engineer"}, {"text": "Automation", "value": "automation"}, {"text": "Design engineer", "value": "design engineer"}, {"text": "Development engineer", "value": "development engineer"}, {"text": "Development manager", "value": "development manager"}, {"text": "Engineering manager", "value": "engineering manager"}, {"text": "Firmware engineer", "value": "firmware engineer"}, {"text": "Frontend engineer", "value": "frontend engineer"}, {"text": "Hardware engineer", "value": "hardware engineer"}, {"text": "Lead engineer", "value": "lead engineer"}, {"text": "Lecturer", "value": "lecturer"}, {"text": "Manager", "value": "manager"}, {"text": "Network systems", "value": "network systems"}, {"text": "Principal", "value": "principal"}, {"text": "Product engineer", "value": "product engineer"}, {"text": "Programmer", "value": "programmer"}, {"text": "Project officer", "value": "project officer"}, {"text": "Science", "value": "science"}, {"text": "Security engineer", "value": "security engineer"}, {"text": "Senior engineer", "value": "senior engineer"}, {"text": "Senior lecturer", "value": "senior lecturer"}, {"text": "Senior system", "value": "senior system"}, {"text": "Senior technical", "value": "senior technical"}, {"text": "Services engineer", "value": "services engineer"}, {"text": "Software architect", "value": "software architect"}, {"text": "Software engineering", "value": "software engineering"}, {"text": "Specialist", "value": "specialist"}, {"text": "Stack engineer", "value": "stack engineer"}, {"text": "Systems analyst", "value": "systems analyst"}, {"text": "Systems engineer", "value": "systems engineer"}, {"text": "Technical marketing", "value": "technical marketing"}, {"text": "Testing engineer", "value": "testing engineer"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Wholesale", "value": "/business/naics2007/42"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Rental", "value": "/business/naics2007/532"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": ".AB4Jjf.qPB6Vc{padding-right:11px}.qfpP8d{padding:7px 0 7px 11px}.S003Ke{flex:none}.ZoN4Lb{color:rgba(0,0,0,.54)}.nAXVG{color:#70757a}.IxQsL{color:rgba(0,0,0,.26)}.xFO1De{color:#fff}.ooFpK{color:rgba(255,255,255,.30)}.mtnwac{color:#4285f4}.WxeeKb{color:#34a853}.hIVRU{color:#f29900}.EXaTMc{color:#fbbc04}.sxn46d{color:#000}.gqMTF{color:#1a73e8}.zpn8Mb{color:#d93025}.dEUPmd{color:#1e8e3e}.PJNo1{color:#fbbc04}Actively Hiring", "value": "e"}, {"text": "EPAM", "value": "/m/0dlnrc"}, {"text": "VISA", "value": "/m/01kqjn"}, {"text": "Nanyang Technological University", "value": "/m/0l49k"}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "HCL SINGAPORE PTE. LTD.", "value": "/g/11fy25ngsv"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "Zühlke", "value": "/g/1hh_rg216"}, {"text": "Experis Singapore", "value": "/g/11dxpnwm3s"}, {"text": "OakTree Consulting", "value": "/g/11g70jfhtq"}, {"text": "Realtek Malaysia", "value": "/m/05wrm7"}, {"text": "TikTok", "value": "/g/11fy265933"}, {"text": "UST", "value": "/m/08kb8g"}, {"text": "UrbanFox", "value": "/g/11ghs7y0w6"}, {"text": "Activate Interactive Pte Ltd", "value": "/g/11dxq192l5"}, {"text": "Cardinal Health", "value": "/m/040vzx"}, {"text": "Cognizant", "value": "/m/03bf9h"}, {"text": "Collins Aerospace", "value": "/m/0kv61y1"}, {"text": "Credit Agricole Group", "value": "/m/028vbm"}, {"text": "DELL", "value": "/m/0py9b"}, {"text": "EPS Consultants Pte Ltd", "value": "/g/11gbxgscvy"}, {"text": "GlobalTix Pte Ltd", "value": "/g/11dxpqdhrf"}, {"text": "HCL Technologies", "value": "/m/0698gv"}, {"text": "Jobline Resources Pte Ltd", "value": "/g/11gp2647pn"}, {"text": "Metropolitan Wireless International Pte Ltd", "value": "/g/11g9m_xbc4"}, {"text": "Microsec", "value": "/g/11f00w21ts"}, {"text": "NCS PTE. LTD.", "value": "/m/0282746"}, {"text": "PALO IT", "value": "/g/11dxpwj75r"}, {"text": "Singapore Press Holdings Limited", "value": "/m/0d7mwh"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "Thales DIS (Singapore) Pte. Ltd.", "value": "/g/11f0197yrz"}, {"text": "Thales Group", "value": "/m/01phj4"}, {"text": "Zendesk", "value": "/m/0wkm4pl"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "Amaris Consulting", "value": "/m/0b6mxkc"}]}]}