{"search_metadata": {"id": "60827906c7ad410480130e54", "status": "Success", "json_endpoint": "https://serpapi.com/searches/5d82f2ad173f0883/60827906c7ad410480130e54.json", "created_at": "2021-04-23 07:36:38 UTC", "processed_at": "2021-04-23 07:36:38 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28software+engineer%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=20", "raw_html_file": "https://serpapi.com/searches/5d82f2ad173f0883/60827906c7ad410480130e54.html", "total_time_taken": 1.37}, "search_parameters": {"q": "(software engineer) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "20"}, "jobs_results": [{"title": "Junior Software Engineer (JavaScript) - Singapore", "company_name": "EPAM", "location": "Singapore", "via": "via JobWiz", "description": "Our APAC cross-border Emerging Engineers Academy (EEA) is a specially designed program that aims to identify, groom and catapult junior technologists into digital architects of the future through a comprehensive and structured methodology that focuses on innovation, collaboration and leveraging new technologies to deliver engineering excellence. Check out this blog article for what our previous batch of graduates from Singapore had to say about the program.\n\nThis is a golden opportunity for recent grads majoring in IT/Computing/Comp Sci/Engineering etc. or those with a basic interest, certification or knowledge of frontend technologies to join us and benefit from the latest and most up-to-date training by our master trainers before embarking on a rewarding career journey with EPAM!\n\nAs an EEA participant, you will undergo a paid 3 month intensive program that blends theory with practice, before graduating as a Junior Software Engineer specializing in JavaScript and other skillsets, to... be deployed immediately into one of our exciting local or global projects upon graduation.\n\nDue to current pandemic situation, please note that this position is open only to Singaporeans (Citizens/PRs), and applicants must be able to start full-time with us in early May 2021.\n\nResponsibilities\n• Participate in full-time EEA (JavaScript) training course for the first three months\n• Play a junior developer role after the training course, with accelerated path to senior or lead roles based on performance\n• Write high quality and testable code following clean code principles\n• Implement functionality by following defined software development process with supervision\n• Read and understand project and requirement documentation\n• Create documentation describing his/her code\n• Participate in Agile Scrum activities: daily standup, demo session, retrospective, planning, etc\n\nRequirements\n• Professional Certification or Bachelor's degree in Computer Science, Software Engineering or related majors\n• Have Object Oriented Programming experience from diploma/degree studies\n• Knowledgeable in Databases and SQL Language\n• Enthusiasm and desire to learn, able to learn technology quickly\n• Good problem solving and analytical skills\n• Good communication skills\n\nWe offer\n• Friendly team and enjoyable working environment\n• Work-life balance and flexible schedule\n• Online training library, mentoring, career development and potential partial grant of certification\n• Unlimited access to LinkedIn learning solutions\n• Referral bonuses\n• Compensation for sick leave and paid time off\n• Opportunities for self-realization", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJKdW5pb3IgU29mdHdhcmUgRW5naW5lZXIgKEphdmFTY3JpcHQpIC0gU2luZ2Fwb3JlIiwiY29tcGFueV9uYW1lIjoiRVBBTSIsImNvbXBhbnlfbWlkIjoiL20vMGRsbnJjIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiei1lVEFzMG00R1I4cVRQdUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXNzQkNvd0JRVTVWWDA1eFVqWjNNbmRRZG1GS1FXUkJVWHByWTB0amQySmxYMHBzUjBOaVNIaGtiVXgwV0Y5WmJGTjJMVFpQTUhsb2NFOXRhSEZaT1RNd1RWQmxORzVTZURsZmMyZzNhMmR1YmpGRU9FVllPRUpCWDFCV1JXMVJTR1oyWTNGTWJUSlZkbkJNVGxCc1ZVZ3lTREY1VW1kVWJtVTVVMkZsZW5Kc1RUbEVSRkl3TjFKNE9XcHNaRE53ZVhNU0ZrSnViVU5aU1RKaVREbFRNM1JSWW1ac1lWaHZRMmNhSWtGUFRWbFNkMEYyUVVWaFNrVnFhRWxLZHkweFlrcGhRV2xCUkd0a2FUZHhhMUUiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY183IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYldpeiIsImxpbmsiOiJodHRwczovL3d3dy5qb2J3aXouc2cvam9iL0NSLTIyMDUxNDc0MTE/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Sr. Software Test Engineer ( Automation )", "company_name": "VISA", "location": "Singapore", "via": "via Jobs", "description": "Company Description As the world's leader in digital payments technology, Visa's mission is to connect the world through the most creative, reliable and secure payment network - enabling individuals, businesses, and economies to thrive. Our advanced global processing network, VisaNet, provides secure and reliable payments around the world, and is capable of handling more than 65,000 transaction messages a second. The company's dedication to innovation drives the rapid growth of connected commerce on any device, and fuels the dream of a cashless future for everyone, everywhere. As the world moves from analog to digital, Visa is applying our brand, products, people, network and scale to reshape the future of commerce.At Visa, your individuality fits right in. Working here gives you an opportunity to impact the world, invest in your career growth, and be part of an inclusive and diverse workplace. We are a global team of disruptors, trailblazers, innovators and risk-takers who are... helping drive economic growth in even the most remote parts of the world, creatively moving the industry forward, and doing meaningful work that brings financial literacy and digital commerce to millions of unbanked and underserved consumers. You're an Individual. We're the team for you. Together , let's transform the way the world pays. Job Description and Responsibilities Digital & Developer Platform at Visa is looking for a passionate Sr. Software Test Automation Engineer, to work on the certification of digital and mobile products of Visa. Drive the test effort from planning and organization to execution and delivery. Develop effective test strategies. Write and contribute to test plans and/or test cases in medium to large sized projects Advocate and educate product/project teams on test design, automation framework use and implementation. Work with those teams to evaluate test-ability of new features/implementations. Use your knowledge of testing in defining acceptance criteria and test\\ability to influence better software design, promote best engineering practices, bug prevention strategies, testability, and other quality attributes across products. Continually work to incorporate automated tests into our CI and CD deployment pipeline Perform creative exploratory testing of new features and products Collaborate with Cross team developers and product to increase MERCHANT/ISSUER End to End test coverage, improve efficiency & effectiveness and promote best practices. Provide critical feedback to Software Engineers and product managers to improve existing and new features and capabilities Work with project teams highlighting and detailing any risks and assumptions identified Actively engage in the continuous improvement of testing practice with a focus on speed, quality and innovation Qualifications Basic Qualifications Bachelor’s Degree or equivalent in the Computer Science, Computer Engineering or Information Technology disciplines with strong fundamentals in software engineering. Minimum 3 years of years of Software Development or equivalent Test Automation Experience This role requires the candidate to have fluent Chinese and English communication skills as the role will involve working closely with teams and customers based in China and US. Preferred Qualifications . BS/BE in Software Engineering, Computer Science, IS, or other related field 4+ years of Software Development or equivalent Test Automation experience 4+ years of experience working in Java environment and coding skills Strong API & UI Automation, Integration testing The individual must be good at Integration testing, API & mobile UI Automation, Client Centric focused test plan, review and certification of products Strong understanding of object-oriented programming languages - Groovy, Java, JavaScript, J2EE, XML, unit-testing and RDBMS Accomplished with Open Source Automation Framework tools (Java, Javascript Eclipse, IntelliJ, SOAPUI, TestNG, Selenium, Jmeter and similar tools) Ability to write clear and concise automation scripts in - Groovy, Java, JavaScript, Python Highly Skilled in JSON Methods and Encryption Methodology(s) Heavily Practiced in rational databases Experienced Debugger by reviewing log file validation on a LINUX/UNIX server, Splunk Experience in configuration management tools like Jenkins Ability to Use and Obtain SME knowledge base to define and communicate writing test cases, test plans, and/or test strategies Strong interpersonal and facilitation skills along with effective communication (both written and verbal) skills. Agile methodology experience is required Additional Information Work Hours: Incumbent must make themselves available during core business hours Physical Requirements: ​​​​​​ This position will be performed in an office setting. The position will require the incumbent to sit and stand at a desk, communicate in person and by telephone, frequently operate standard office equipment, such as telephones and computers, and reach with hands and arms. Visa is an EEO Employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status. Visa will also consider for employment qualified applicants with criminal histories in a manner consistent with EEOC guidelines and applicable local law", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTci4gU29mdHdhcmUgVGVzdCBFbmdpbmVlciAoIEF1dG9tYXRpb24gKSIsImNvbXBhbnlfbmFtZSI6IlZJU0EiLCJjb21wYW55X21pZCI6Ii9tLzAxa3FqbiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IkNGeXJXM1kxdDlUSW15SldBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVzc0JDb3dCUVU1VlgwNXhWRjlKUmpaaWRqUm9UVTQ0TjI1clRYcGlXbU55Y0hsVVdtaHJYM050YlhkamQzTjVlbHAxY0habVlYZDJXakprTFRWdlZYcHpkbkJ2TlROUU5IWlFibGRHZVhwSFdESlJUMjVHTlhoeWRtbHVUV3R5TTBsS00wSTBMWGN5ZUU1emJVdzVibFUzVlRGcVNFeHFWMWhZYkhaTE16ZFNhVUpMTWtOV2NsQlNjRUkwU0U5NllUY1NGa0p1YlVOWlNUSmlURGxUTTNSUlltWnNZVmh2UTJjYUlrRlBUVmxTZDBSemFVWmhjbVZ6ZGpaV1RUVjZkVk5rV1VkeFdtUTFZVTU0VTBFIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMTUiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9icyIsImxpbmsiOiJodHRwczovL3NnLmZpZGFudG8uY29tL2pvYnMvam9iLW9wZW5pbmcvc29mdHdhcmUtZGV2ZWxvcGVycy1zeXN0ZW1zLXNvZnR3YXJlL3NyLXNvZnR3YXJlLXRlc3QtZW5naW5lZXItYXV0b21hdGlvbi0yNzc4ODI4NzE/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Lead Professional Officer, ICT Software Engineering - Machine Learning and AI - 2309 JT", "company_name": "CTES CONSULTING PTE LTD", "location": "Singapore (+1 other)", "via": "via CTES Consulting Pte Ltd", "description": "Our client is actively searching for a Lead Professional Officer/ Senior Professional Officer - Software Engineering (Machine Learning/ Deep Learning/ Artificial Intelligence) to join their team!\n\nIf you are a dynamic individual seeking a new career opportunity, read further!\n\nThe Senior Professional Officer/ Lead PO acts as a first line mentor to the students on hands-on and practical activities such as labs, student projects and IWSP to enhance the students’ technical problem-solving skills and increase their preparedness for industry.\n\nThe responsibilities of this role are:\n• Work with faculty in the development, design, planning and set-up of laboratories for teaching and research activities. This may involve activities to plan, procure and manage equipment in the lab, provide training to staff and students on usage of specific laboratory or equipment as well as development of lab manuals.\n• Mentor students during hands-on projects and laboratory activities for ICT year-1 and... year-2 student to enhance their practical problem-solving skills. This may involve conduct of relevant practical activities as well as supervision of students in their projects and laboratory assignments as a part of applied learning.\n• Guide students to navigate the industry environment during their Integrated Work Study Programme (IWSP).\n• Support the faculty in the supervision and assessment of students for IWSP, ITP (integrative team project) and for Final Year Projects/Capstones.\n• When innovation project opportunities arise, participate in the project/s together with faculty and students.\n• Working in a team to manage and ensure the readiness, operations and proper maintenance of the laboratories resources.\n• Carry out Risk Assessment, and ensure compliance with Work, Safety and Health Regulations in the laboratories\n\nThe ideal candidate will need to have the following qualities and experience:\n• A good degree in Computing or Data Science from a recognized University. Major in Software Engineering or possessing a Master degree will be advantageous.\n• Proven AI industry practitioner and working experience as a Machine Learning Software Engineer or similar role, with good knowledge of industry practices and technological applications in the field. Familiarity with machine learning frameworks and libraries (such like Caffe, Spark ML, Keras, PyTorch, TensorFlow, Scikit-Learn, CNTK etc)\n• At least 10 years’ experience in the knowledge domain\n• Must have a firm grasp and understanding of data structures, data modeling and software architecture using Python, R, Java and C, as well as deep knowledge of math, probability, statistics and algorithms.\n• Keen interest to support research and academic project work, with demonstrated ability in developing software solutions to technical problems.\n• Possess strong supervisory skills and enjoy working closely with students in an educational environment.\n• Self-starter with hand-on knowledge to setup network and server systems, manage software development environment and configuration activities to support testing and maintenance of information system, software applications, hosted services and websites.\n• Demonstrate proficiency to keep abreast of development in the field and pursue professional certification programs. Possess of industrial certifications in relevant areas will be an added advantage.\n• Professional Officers appointed at senior levels may have managerial responsibilities.\n• A committed believer in continuous learning and self-improvement, with a strong sense of confidence in managing his/her own learning process.\n• Good communication and interpersonal skills.\n• Passionate about training, coaching and mentoring.\n• Able to build and maintain strong working relationships with people within and external to the university.\n• Self-motivated team player and flexibility to work across functions/teams in a dynamic hand-on environment.\n• Possess strong analytical and critical thinking skills.\n• Show strong initiative and take ownership of work.\n\nJob Location(s): West (eg: Queenstown, Jurong, Clementi, Tuas)\n\nConsultant In Charge: Jaclyn Tan\nEA Reg. No.: R1104237\nCompany EA License No.: 07C3481", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJMZWFkIFByb2Zlc3Npb25hbCBPZmZpY2VyLCBJQ1QgU29mdHdhcmUgRW5naW5lZXJpbmcgLSBNYWNoaW5lIExlYXJuaW5nIGFuZCBBSSAtIDIzMDkgSlQiLCJjb21wYW55X25hbWUiOiJDVEVTIENPTlNVTFRJTkcgUFRFIExURCIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiWWtlbUE1Q1FiZVVRemFZbEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBDVEVTIENvbnN1bHRpbmcgUHRlIEx0ZCIsImxpbmsiOiJodHRwczovL2N0ZXMuY29tLnNnL3dlYi9qb2IvMjMwOT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "SG056A: Project Engineer", "company_name": "FedEx", "location": "Singapore", "via": "via HelpOneBillion", "description": "Company: FedEx Express APAC\n\nJob Title: SG056A: Project Engineer\n\nJob Requisition Number: RC354400\n\nLocations:\n\nSingapore, Singapore\n\nJob Category: Planning & Eng.\n\nTime Type: Full Time\n\nJob Type: Regular\n\nJob Posting End Date: 2021-05-03\n\nTo manage and administer an internal enterprise software development/ deployment project across Asia Pacific.\n\nRequirement:\n\n1.Experience leading a major IT project, preferably across multiple markets\n• Has direct experience in SAFe Agile framework used in software development\n• Certified in any of SAFe certifications (Product Engineer, Scrum Master, Practitioner, Agile Product Manager, Release Train Engineer etc)\n• Understanding of operations/project management concept from Kanban, Theory of Constraint is strong point for consideration\n• Experience in Project Management Tools (from Microsoft Project to more advance tools) will be bonus point\n• Good communication skills (written and verbal)\n• Ability to prepare high quality PowerPoint decks... quickly\n\nEducation: Bachelor's Degree in Mechanical, Aeronautical, Aerospace, Structural or equivalent Engineering.\n\nAt FedEx Express, we believe that a connected world is a better world. We connect people and possibilities with our diverse portfolio of transportation, e-commerce, and business solutions. Today, our networks reach more than 220 countries and territories, linking more than 99 percent of the world's GDP. FedEx is consistently recognized as one of the most admired brands in the world and one of the best places to work. Our people are the foundation of our success and the key to our future. At FedEx, we are as diverse as the world we serve. We leverage our diverse talents, experiences and ideas to be more responsive to customer challenges, spark creative solutions, and adapt to change. FedEx is an equal opportunity / affirmative action employer (minorities/females/disability/veterans) committed to a diverse workforce.\n\nWhat can you expect as a FedEx team member?\n• Career Mobility and Development: When you join FedEx, you're joining a team with possibilities that literally span the world-from opportunities for advancement and location transfer, to training and leadership programs.\n• Total Compensation and Benefits Package: We want to keep our employees for a long time, so we offer competitive benefits, opportunities for flexible work arrangements, and programs to support well-being", "extensions": ["2 days ago", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTRzA1NkE6IFByb2plY3QgRW5naW5lZXIiLCJjb21wYW55X25hbWUiOiJGZWRFeCIsImNvbXBhbnlfbWlkIjoiL20vMGs5czEiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJsbXB2WFlFMGRGYmx3bDdMQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFc3NCQ293QlFVNVZYMDV4VTNwUWNtYzBkbGswTTFaVFZ5MDRObTB0TXkxSk5XUTFPRzlJWmxkWFpuTnZSMjlZYVhkWlJYZGFTRXQ1YjBoMmJIVnpSa0ZyY1VOTFRHZElXbVpTT0cxT04xVXhWRTlsTm05a2RHODVlV014TVhkd2RrRTBiV3c1ZDNRNFpXUTJSMEYzT0hkM1EzcHZTSE5wUmxSclpFUklaR2xuZWtNMmFtOXZXWFZyZFZoVE5VeFRjSG9TRmtKdWJVTlpTVEppVERsVE0zUlJZbVpzWVZodlEyY2FJa0ZQVFZsU2QwRnVZVEZaV0ROWWVTMU5kR2RNUm1kNVFXOTJTVEJuVkZaT1ZIYyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzI4IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEhlbHBPbmVCaWxsaW9uIiwibGluayI6Imh0dHBzOi8vaGVscG9uZWJpbGxpb24uY29tL2pvYi8xMmE0NWU0Y2NkYzNkYTgxNzgyOWIyNGRiMDY1NmY3ZC9TRzA1NkEtUHJvamVjdC1FbmdpbmVlcj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Software Quality Engineer", "company_name": "Techgig", "location": "Singapore", "via": "via Mendeley", "description": "About Job\n\nCTC Undisclosed Job Location Singapore Experience 3 - 6 yrs\n\nDescription\n\nRequired Skills: Our client is a leading business service provider in Singapore. The company is looking for an experienced and full-time Software Quality Engineer for onsite role in Singapore.\n\nKey Job Responsibilities:\n\n- Assist Product Owner and Business Analyst to craft out user story acceptance criteria\n\n- Analyse and decompose complicated software systems, and design a holistic test strategy\n\n- Conduct research on emerging technologies and develop test automation framework\n\n- Develop test suites of test scenarios and test cases\n\n- Take a risk-based approach for test automation\n\n- Perform time boxed exploratory testing\n\n- Maintain regression test suite in QA nightly build\n\n- Actively refine smoke test suite in Development CI environment\n\n- Lead system integration testing with other system owners\n\n- Manage user acceptance testing\n\n- Manage defect life cycle, test artefacts and repository\n\n- Drive... continuous improvement in agile testing practices and tools\n\n- Take on secondary role as an Application Performance Engineer or Application Security Engineer\n\nKey Skills/Qualifications:\n\n- Min 3 years experience in exploratory testing and regression test automation\n\n- Strong analytical skills\n\n- Meticulous attention to details\n\n- Good interpersonal skills such as tactfulness\n\n- Good presentation and listening skills\n\n- Experience in agile development environment will be an added advantage\n\n- Experience with Robot Framework, SikuliX, Selenium, HP Testing Tools (Mobile Center, UFT, QC and Sprinter) or EggPlant will be an added advantage\n\n- Certified Software Testing Professional and/or Certified Software Quality Analyst will be an added advantage\n\n- Degree or Diploma in Computer Science, Computer or Electronics Engineering, Information Technology or related disciplines", "extensions": ["9 days ago", "Full–time"], "detected_extensions": {"posted_at": "9 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBRdWFsaXR5IEVuZ2luZWVyIiwiY29tcGFueV9uYW1lIjoiVGVjaGdpZyIsImNvbXBhbnlfbWlkIjoiL2cvMTFjNzNmeGd3dCIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjJoTTlPNGI2emJVZFRBZnBBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhWRzFUVDBwYWIzbEpSa2cwT1ZvMmRqTlhjRGN4YUhSR1gzcFpRVzVPVkhJdFpsbE5WbDkwVTA5aVIzcENRVGh6YkdadVRrVXRaalZLWnpJemJYaElZVXcxTnpkeE5GTnJTRUo0WTNWaE1qbDNjRzB0TFZKU2RUbHNNRVZqYm5wRFRuRjZSMEV0V2xka09VOXZTVEZyTmxKek9IcDNNak5RUjBaamNGRTNWSFkxYkhGVGF6TlRNRmRYVlVVMGFXRkNkVFk1U0ZaSlJqQmFORkJuRWhaQ2JtMURXVWt5WWt3NVV6TjBVV0ptYkdGWWIwTm5HaUpCVDAxWlVuZERkbWhQT0dwa1luVk9iMmhHUlV0eFpHOHdSM3BPU0hSd2JVbG4iLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18zNiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNZW5kZWxleSIsImxpbmsiOiJodHRwczovL3d3dy5tZW5kZWxleS5jb20vY2FyZWVycy9qb2Ivc29mdHdhcmUtcXVhbGl0eS1lbmdpbmVlci0xMjg4OTAzP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Software Engineer/ Senior Software Engineer/ Consultant - PEGA", "company_name": "HCL SINGAPORE PTE. LTD.", "location": "Singapore (+1 other)", "via": "via LinkedIn", "description": "Atleast 4 cycles of PRPC implementation experience.\nMust have Pega CSSA Certification\nShould have Experience in SOAP, REST, JSON\nShould have JAVA and mySQL experience\nSound Understanding of PRPC OOTB activities\n\nGOOD to HAVE\nHaving Banking Domain Experience is plus\n\nTechnical / Professional Skills\nPega CSSA Certified\nWindows\nHTML, CSS, JavaScript, Ajax\nMySQL,\n\nNon-Technical / Soft Skills\nShould be Team Player\nExcellent communication skills", "extensions": ["2 days ago", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlci8gU2VuaW9yIFNvZnR3YXJlIEVuZ2luZWVyLyBDb25zdWx0YW50IC0gUEVHQSIsImNvbXBhbnlfbmFtZSI6IkhDTCBTSU5HQVBPUkUgUFRFLiBMVEQuIiwiY29tcGFueV9taWQiOiIvZy8xMWZ5MjVuZ3N2IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiNWE3U1lFQmRQTVgxbWRtLUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRW9zQ0Nzd0JRVTVWWDA1eFUwOVVPWFpwTUZsdWIwbGxaRVZpUzBFM1drRjJlbE5XTUU1aGNFeDJlVmxOZWpSUFVqWk5PSEJEWmxacFIwUnRTemd6YlV4Wk9HZzJNbE0xZEhGTGVtazVUbVkwVEZocmNuaGpjMkp1Vld4R2VYSlBVWFozY25WaGJHaEdkM1YzWjBkcVJGaHJTR2RvVmtkUmJrcEJWMnR4UTNkMlVqWjVZVU5LYjJKWVFYcDFXR00yTUZSVVgxWjZlRU5zWTIwek5USjRiMU5SWDA1RGVXWmFabUpzV25KRVQwNXpNMjFIT0dwdVNtZFpibkJEZUdkNlREVTRiMFZuY0hwdlVGOHlSVzAzVGtOVkVoWkNibTFEV1VreVlrdzVVek4wVVdKbWJHRlliME5uR2lKQlQwMVpVbmRFV0ZSalFXSlJXbXd0VG1veWJHWjNWbkIwYkdkNlVtNTVZbWQzIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNDMiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGlua2VkSW4iLCJsaW5rIjoiaHR0cHM6Ly9zZy5saW5rZWRpbi5jb20vam9icy92aWV3L3NvZnR3YXJlLWVuZ2luZWVyLXNlbmlvci1zb2Z0d2FyZS1lbmdpbmVlci1jb25zdWx0YW50LXBlZ2EtYXQtaGNsLXNpbmdhcG9yZS1wdGUtbHRkLTI1MTQxMTY1NTA/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Programmer (.net)", "company_name": "Adecco SG - BB", "location": "Singapore (+1 other)", "via": "via Adecco", "description": "Involved in the design, development, programming, implementation and maintenance of large scale web-based and general application systems\n\nOur client is Singapore's renowned brand.\n\nWORKS SPECIFICATIONS\n\nSCOPE OF WORK\n\n(a) The overall scope of the works expected from the from the Contract Programmer shall include the following:-\n\ni. Gather user requirements and prepare specifications and other relevant documentation according to the documentation standard required and etc;\n\nii. Design, develop, implement and maintain web-based and other applications;\n\niii. Perform project administrative duties, including disseminating project information to project stakeholders and monitoring the progress of project milestones;\n\niv. Trouble-shoot, diagnose and rectify reported application problems while at the same time, resolving the related diagnosed application problems within a satisfactory time period;\n\nv. Conduct End User briefings and training entailing the use of the software applications when... required;\n\nvi. Assist in rolling out new projects/applications or enhancements of existing systems/applications; and\n\nvii. Arrange logistics for meetings, conferences, trainings, and other project-related events. Organise project committee meetings and prepare the necessary materials, including reports, presentations, agendas and other meeting collateral. Transcribe and accurately record key decisions and action items resulting from meetings.\n\n(b) The personnel to be provided must have at least 5 years of working experience in the design, development, programming, implementation and maintenance of large scale web-based and general application systems. They should preferably hold a certification in Microsoft Certified Application Developer (MCAD) and Sun Certified Java Programmer (if possible).\n\n(c) The personnel must have working knowledge and experience in the following environment :-\n\ni. Development Languages/Tools\n\nVB.NET, C#.NET, Visual Basic 6 (At least 5 years)\n\nOO Analysis and Design (At least 2 years)\n\nii. Internet Technologies\n\nASP.NET\n\nHTML, Java Script, AJAX\n\nMS SharePoint Online\n\nMS PowerApp\n\nMS PowerAutomate\n\niii. Database and Others\n\nMS SQL Server 2008 (At least 5 years)\n\nMS SQL Server 2016\n\nMS Visual Studio 2008 (At least 5 years)\n\nMS Visual Studio 2017\n\n.NET Framework 3.5 (At least 5 years)\n\n.NET Framework 4.5\n\nIIS, SSL\n\nWindows 2003 or above / Windows XP\n\nNext Steps\n\nIf interested, you can click on \"Apply here\" or write an e-mail to asha.yadav@adecco.com with your updated resume.\n\nNOTE: - Only shortlisted candidates will be contacted back.\n\nAsha Yadav| EA LIcence No.91C2918 | Personnel Registration No. R1876730", "extensions": ["6 days ago", "Contractor"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Contractor"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9ncmFtbWVyICgubmV0KSIsImNvbXBhbnlfbmFtZSI6IkFkZWNjbyBTRyAtIEJCIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiIwVjVfNy1IQnI3S3pOZ1NpQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEFkZWNjbyIsImxpbmsiOiJodHRwczovL3d3dy5hZGVjY28uY29tLnNnL2ktdC1hbmQtdC1qb2JzL3Byb2dyYW1tZXItbmV0LS8zMjE0MzU4P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Senior Software Engineer, Chat Platform", "company_name": "Zendesk", "location": "Singapore (+1 other)", "via": "via Bayt.com", "description": "Job Description\n\nZendesk is looking for a Senior Software Engineer to join the Chat Platform team. The team focuses on delivering the best experience for our largest customers and experimenting with opportunities for accelerated growth. Zendesk’s customer base is growing fast and you will be able to make meaningful contributions to a product that is used by millions of people every day.\n\nThe Chat Platform team works with a high degree of autonomy and achieves high velocity by combining designers, test engineers, product managers, and software engineers collaborating together.\n\nSenior Software Engineers at Zendesk are expected to be hands-on technologists who can contribute to application development directly, contribute to the design and implementation of projects, and be involved in technical discussions beyond their teams. You should love finding elegant solutions to complex problems, and care about not only the technical and algorithmic aspects of large systems but the way they... enable other developers to do their jobs. Previous experience with web infrastructure, distributed systems, or component-oriented software engineering is a strong plus.\n\nWhat you’ll be doing\n• Work on a Chat platform backend serving millions of users daily.\n• Guide the team on technical design discussions and propose innovative solutions on backend components.\n• Ensure scalability, performance, maintainability, and security of the technical platform in collaboration with SRE teams.\n• Build POCs to test candidate technologies and make informed decisions.\n• Collaborate closely with the Product Manager, the Team Lead, and the Tech Lead to provide technical insights and early estimates on upcoming projects.\n• Educate other developers through pairing sessions, and code reviews.\n• Become a key contributor to better working practices across Zendesk.\n\nWhat you bring to the role\n• Required:\n• You have delivered enterprise-grade software as part of a cloud-based company or business unit.\n• You are independent, self-motivated, and a good team player at the same time.\n• You have reasonable communication skills: able to explain a technical concept in an accurate and understandable way.\n• You put the customer first and respect your commitment to deliver.\n• Preferred:\n• You have hands-on experience with or knowledge of developing event-driven microservices using technologies similar to Apache Kafka.\n• You have hands-on experience with or knowledge of AWS distributed services.\n• You have personal projects, collaboration with open-source communities, or active learning initiatives to showcase your passion for technology.\n\nTech Stack\n• Java, Javascript, Python\n• Redis, Mysql, AWS Aurora\n• Apache Kafka\n• Docker, Kubernetes\n\nZendesk builds software for better customer relationships. It empowers organizations to improve customer engagement and better understand their customers. Zendesk products are easy to use and implement. They give organizations the flexibility to move quickly, focus on innovation, and scale with their growth.\n\nMore than 150,000 paid customer accounts in over 150 countries and territories use Zendesk products. Based in San Francisco, Zendesk has operations in the United States, Europe, Asia, Australia, and South America.\n\nInterested in knowing what we do in the community? Check out the Zendesk Neighbor Foundation to learn more about how we engage with, and provide support to, our local communities.\n\nZendesk is an equal opportunity employer, and we’re proud of our ongoing efforts to foster global diversity, equity, & inclusion in the workplace. Individuals seeking employment at Zendesk are considered without regard to race, color, religion, national origin, age, sex, gender, gender identity, gender expression, sexual orientation, marital status, medical condition, ancestry, physical or mental disability, military or veteran status, or any other characteristic protected by applicable law.\n\nBy submitting your application, you agree that Zendesk may collect your personal data for recruiting, global organization planning, and related purposes. Zendesk's Candidate Privacy Notice explains what personal information Zendesk may process, where Zendesk may process your personal information, its purposes for processing your personal information, and the rights you can exercise over Zendesk’s use of your personal information", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgRW5naW5lZXIsIENoYXQgUGxhdGZvcm0iLCJjb21wYW55X25hbWUiOiJaZW5kZXNrIiwiY29tcGFueV9taWQiOiIvbS8wd2ttNHBsIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiMTZ0OTFHazloOHduV2pHVUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFVXVXplREJMY0dGNWRITXdTR2gxTlhRMVYySldRa2x1VTFsQmRsVjNVbWhEUkZGUWVsSXlMVkJDTFRCTVQzbFNXWGxvVEhCbU5qRnZWR281TW1aVE1uSXRTRGQ0Y2tjd0xXUm9jbUpOYWt4c05GYzRSMlZoVDJNeGIyMXJZV1ZLZG5WT2NqZG1PRXMwYkRObVJHZExhSFJtVlY5TlJqUktUMUJ1ZERsdk9FOXdjemRCUVZwalUzVlBZbFp0ZWtsMlIzRnFRMFpVTTNKeGRHNTNFaFpDYm0xRFdVa3lZa3c1VXpOMFVXSm1iR0ZZYjBObkdpSkJUMDFaVW5kQ2EzY3lVREY1VFMxWFZHdHRNWEZXYjIxcGNEaFpZMlk1WlZKbiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzU0IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJheXQuY29tIiwibGluayI6Imh0dHBzOi8vd3d3LmJheXQuY29tL2VuL3NpbmdhcG9yZS9qb2JzL3Nlbmlvci1zb2Z0d2FyZS1lbmdpbmVlci1jaGF0LXBsYXRmb3JtLTU5NTU2OTQ1Lz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Software Developer - A-I - SGUnitedTraineeships - SGUP", "company_name": "Ac P. Computer Training & Consultancy Pte Ltd", "location": "Singapore", "via": "via Monster", "description": "This role is open to both SGUnited Traineeships and SGUnited Mid Career Pathways Programme.\n\nTraineeship Description\n\nThe Software Developer (A.I) (Trainee) reports to the Director. The Traineeship will be project-based and presents a fast-paced environment that emphasizes quality deliverables and continuous improvement to encourage one to sharpen their expertise. We are looking for creative, hardworking, and versatile developers who can bring fresh ideas regarding the works of Convolutional Neural networks and Deep Learning.\n\nSpecific Responsibilities\n\n1. Research and implement Convolutional Neural Network and Deep Learning in educational technology\n\n2. Deliver fully tested source code complying with quality indicators objectives\n\n3. Modify existing software to correct errors, adapt it to new hardware, or upgrade interfaces and improve performance\n\n4. Generate and maintain software design/test documentation\n\n5. Learn about Convolutional Neural Network and Deep Learning in educational... technology\n\n6. Design and develop robust and scalable software systems including frontend and backend\n\n7. Troubleshoot, debug and upgrade existing software\n\nCompetencies:\n\n1. Learn more about Convolutional Neural Network and Deep Learning\n\n2. Manage software development, enhancement, debugging, testing, and maintenance of the backend application\n\n3. Active Participation in software creation, implementation, and modification\n\n4. How to use Artificial Intelligence to bring the gap between the capabilities of humans and machine in the educational industry\n\n5. Learn and ensure Quality Assurance (QA) in AI software and applications created\n\nApproved Training Allowance:\n• Fresh Graduate: $2100\n• Mid-career (Non-mature, below 40 as of 2021): $2500\n• Mid-career (Mature, above 40 as of 2021): $3200\n\nDuration of Traineeship Offered: 5 months\n\nEducation Qualifications Required for the Traineeship Role: Diploma/ Professional Certification\n\nEligibility Criteria for SGUnitedTraineeships:\n\nSingapore Citizen or Permanent Resident; and\n\nGraduated or graduating in the calendar year 2020 or 2021 from universities, or other educational institutions (e.g. private universities and overseas institutions);\n\nGraduated earlier from the above institutions and completed National Service in 2019 or 2020.\n\nEligibility criteria for SGUnited Mid Career Pathways Programme:\n\nThis program is open to all Singaporeans and Permanent Residents", "extensions": ["2 days ago", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBEZXZlbG9wZXIgLSBBLUkgLSBTR1VuaXRlZFRyYWluZWVzaGlwcyAtIFNHVVAiLCJjb21wYW55X25hbWUiOiJBYyBQLiBDb21wdXRlciBUcmFpbmluZyBcdTAwMjYgQ29uc3VsdGFuY3kgUHRlIEx0ZCIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoidy1tLUN5VzRnMGp5NldGRkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNb25zdGVyIiwibGluayI6Imh0dHBzOi8vd3d3Lm1vbnN0ZXIuY29tLnNnL2FtcC9qb2ItdmFjYW5jeS1zb2Z0d2FyZS1kZXZlbG9wZXItYS1pLXNndW5pdGVkdHJhaW5lZXNoaXBzLXNndXAtYWMtcC1jb21wdXRlci10cmFpbmluZy1jb25zdWx0YW5jeS1wdGUtbHRkLXNpbmdhcG9yZS0yNzgxNTQxMy5odG1sP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Aws Devops & Data Engineer", "company_name": "Engine Biosciences", "location": "Singapore", "via": "via MNC Jobs Singapore | MNC Jobs In Singapore", "description": "Location: Singapore or California, US\nFull Time\n\nEngine Biosciences is a venture-backed biotechnology company discovering and developing novel therapeutics and precision medicines, utilizing a proprietary platform that integrates massively parallel biological experimentation with data science, machine learning and AI. Led by scientific experts from MIT, Harvard, Mayo Clinic and UCSD, and successful drug developers, informaticians, and company builders, Engine is working on multiple programs and therapeutic areas and growing rapidly across US and Asia.\n\nThe AWS DevOps & Data Engineer will maintain, support, optimize, develop, automate and manage AWS utilization by the global Engine Bio’s engineers and scientists, towards the development of a secured and cost effective analytics platform that combines advanced system biology analytics with genomics data science and machine learning for accelerated drug discovery and biomarker identification. The successful candidate will bring hands-on... industry experience in AWS DevOps & Data engineering, including AWS certification and proficiency in AWS solutions such as EC2, S3, Glacier, VPC, EMR, Lambda, RDS, IAM, Cloudwatch, Cloud-formation, autoscaling, Docker, DynamoDB, SPARK, Code-Commit, access control, and related technologies.\n\nResponsibilities\n• Implement and manage Engine’s cloud infrastructure and working closely with teams to understand, build, secure and improve our solutions and processes.\n• Define and build effective databases to manage data received from heterogenous sources (including genomics data, experimental data, imaging data and text mining data from internal and external sources; Develop workflows and pipelines to extract, transform, and load (ETL) data from various data sources in heterogenous formats to enable down-stream data analysis and visualization.\n• Implement strategies for operational support including monitoring, performance analysis, cost optimization, testing, and debugging of services and information security issues.\n• Work closely with internal global teams that includes bioinformaticians, data scientists and biologists to identify areas of development and develop solutions to ensure reliability, security and scalability.\n\nThe above listed responsibilities are essential duties associated with this position; however, they are not an exhaustive list. Changes to individual responsibilities may occur due to business needs.\n\nMinimum Requirements\n• B.Sc. in Computer Engineering or related field\n• AWS Certified\n• Three years hands-on AWS DevOps engineering Experience in the industry\n• Experience in AWS compute, storage and security of big data (petabytes)\n• Experience in developing front-end, back-end and database solutions\n• Experience in setting up, building and managing data platforms, data infrastructure and pipeline management\n• Strong communication and global collaboration skills\n\nDesired Skills & Experience\n• AWS DevOps engineering experience supporting teams of more than 40 AWS users\n• Experience in the biotech/pharma/health industry including regulatory and data privacy compliances\n• Python scripting and automation\n• Experience working across multiple time zones with executive leadership, scientists and engineers\n\nTo apply, please e-mail your CV to computational.recruiting@enginebio.com", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBd3MgRGV2b3BzIFx1MDAyNiBEYXRhIEVuZ2luZWVyIiwiY29tcGFueV9uYW1lIjoiRW5naW5lIEJpb3NjaWVuY2VzIiwiY29tcGFueV9taWQiOiIvZy8xMWM3M3hudnBxIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiQm5tcVQ3QTk0cDhXaWFka0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZZQkNyY0JRVTVWWDA1eFV6RjNSMnRMYzFsV1FraE9VRmx6YldSQ1JsY3lXa2Q0VDJGbmVqVnlXRVJsZDFndGEweFZiV05XUWpac1NYZFpNVmcwTkZJeE9HcG5RbUp2VDNGdWFFRTBUVFppWTBsRFRFNUlhVUZ3Y2tobVRqbGtSbFpTWVhkT04wZEdNWGRmWjNwNlJGcDFWa2xWYjJoR1JrOU9kVGh2VFdWdlJHRldZV052VmxSRmJUVnBSV3RqTTJsWFJXOW9kRFl4Tm13d1Z6RmlTekkwVTFwS1RGVjBkbE5MUnpKa1ZteG5XbVpUUXpaNmJUTkllRUYzRWhaQ2JtMURXVWt5WWt3NVV6TjBVV0ptYkdGWWIwTm5HaUpCVDAxWlVuZERha1kzYjI1NllsYzFNRlY0Y1MxeUxYTkxTbE5TT0RWV2NreEIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY182NiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNTkMgSm9icyBTaW5nYXBvcmUgfCBNTkMgSm9icyBJbiBTaW5nYXBvcmUiLCJsaW5rIjoiaHR0cHM6Ly9zZy5tbmNqb2J6LmNvbS9qb2JzL2F3cy1kZXZvcHMtYW1wLWRhdGEtZW5naW5lZXItc2luZ2Fwb3JlLTM3ODAxMj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}], "chips": [{"type": "Title", "param": "job_family_1", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Software engineer", "value": "software engineer"}, {"text": "Engineer", "value": "engineer"}, {"text": "Senior", "value": "senior"}, {"text": "Cloud engineer", "value": "cloud engineer"}, {"text": "Test engineer", "value": "test engineer"}, {"text": "Research engineer", "value": "research engineer"}, {"text": "Assurance engineer", "value": "assurance engineer"}, {"text": "It engineer", "value": "it engineer"}, {"text": "Java engineer", "value": "java engineer"}, {"text": "Qa engineer", "value": "qa engineer"}, {"text": "System engineer", "value": "system engineer"}, {"text": "Data engineer", "value": "data engineer"}, {"text": "Devops engineer", "value": "devops engineer"}, {"text": "Network engineer", "value": "network engineer"}, {"text": "Principal engineer", "value": "principal engineer"}, {"text": "Quality engineer", "value": "quality engineer"}, {"text": "Solutions engineer", "value": "solutions engineer"}, {"text": "Technical", "value": "technical"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Associate", "value": "associate"}, {"text": "Associate engineer", "value": "associate engineer"}, {"text": "Automation", "value": "automation"}, {"text": "Design engineer", "value": "design engineer"}, {"text": "Development engineer", "value": "development engineer"}, {"text": "Development manager", "value": "development manager"}, {"text": "Engineering manager", "value": "engineering manager"}, {"text": "Firmware engineer", "value": "firmware engineer"}, {"text": "Frontend engineer", "value": "frontend engineer"}, {"text": "Hardware engineer", "value": "hardware engineer"}, {"text": "Lecturer", "value": "lecturer"}, {"text": "Manager", "value": "manager"}, {"text": "Officer", "value": "officer"}, {"text": "Principal", "value": "principal"}, {"text": "Product engineer", "value": "product engineer"}, {"text": "Programmer", "value": "programmer"}, {"text": "Project officer", "value": "project officer"}, {"text": "Research associate", "value": "research associate"}, {"text": "Science", "value": "science"}, {"text": "Security engineer", "value": "security engineer"}, {"text": "Senior engineer", "value": "senior engineer"}, {"text": "Senior lecturer", "value": "senior lecturer"}, {"text": "Senior system", "value": "senior system"}, {"text": "Senior technical", "value": "senior technical"}, {"text": "Services engineer", "value": "services engineer"}, {"text": "Software architect", "value": "software architect"}, {"text": "Software engineering", "value": "software engineering"}, {"text": "Specialist", "value": "specialist"}, {"text": "Stack engineer", "value": "stack engineer"}, {"text": "Systems analyst", "value": "systems analyst"}, {"text": "Systems engineer", "value": "systems engineer"}, {"text": "Technical marketing", "value": "technical marketing"}, {"text": "Testing engineer", "value": "testing engineer"}, {"text": "Trainee", "value": "trainee"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Wholesale", "value": "/business/naics2007/42"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Rental", "value": "/business/naics2007/532"}, {"text": "Staffing", "value": "/business/naics2007/5613"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": ".AB4Jjf.qPB6Vc{padding-right:11px}.qfpP8d{padding:7px 0 7px 11px}.S003Ke{flex:none}.ZoN4Lb{color:rgba(0,0,0,.54)}.nAXVG{color:#70757a}.IxQsL{color:rgba(0,0,0,.26)}.xFO1De{color:#fff}.ooFpK{color:rgba(255,255,255,.30)}.mtnwac{color:#4285f4}.WxeeKb{color:#34a853}.hIVRU{color:#f29900}.EXaTMc{color:#fbbc04}.sxn46d{color:#000}.gqMTF{color:#1a73e8}.zpn8Mb{color:#d93025}.dEUPmd{color:#1e8e3e}.PJNo1{color:#fbbc04}Actively Hiring", "value": "e"}, {"text": "EPAM", "value": "/m/0dlnrc"}, {"text": "VISA", "value": "/m/01kqjn"}, {"text": "Nanyang Technological University", "value": "/m/0l49k"}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Zühlke", "value": "/g/1hh_rg216"}, {"text": "HCL SINGAPORE PTE. LTD.", "value": "/g/11fy25ngsv"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "Experis Singapore", "value": "/g/11dxpnwm3s"}, {"text": "OakTree Consulting", "value": "/g/11g70jfhtq"}, {"text": "Realtek Malaysia", "value": "/m/05wrm7"}, {"text": "TikTok", "value": "/g/11fy265933"}, {"text": "UST", "value": "/m/08kb8g"}, {"text": "UrbanFox", "value": "/g/11ghs7y0w6"}, {"text": "Activate Interactive Pte Ltd", "value": "/g/11dxq192l5"}, {"text": "Cardinal Health", "value": "/m/040vzx"}, {"text": "Cognizant", "value": "/m/03bf9h"}, {"text": "Collins Aerospace", "value": "/m/0kv61y1"}, {"text": "Credit Agricole Group", "value": "/m/028vbm"}, {"text": "DELL", "value": "/m/0py9b"}, {"text": "EPS Consultants Pte Ltd", "value": "/g/11gbxgscvy"}, {"text": "GlobalTix Pte Ltd", "value": "/g/11dxpqdhrf"}, {"text": "HCL Technologies", "value": "/m/0698gv"}, {"text": "Jobline Resources Pte Ltd", "value": "/g/11gp2647pn"}, {"text": "Metropolitan Wireless International Pte Ltd", "value": "/g/11g9m_xbc4"}, {"text": "PALO IT", "value": "/g/11dxpwj75r"}, {"text": "Singapore Press Holdings Limited", "value": "/m/0d7mwh"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "Thales DIS (Singapore) Pte. Ltd.", "value": "/g/11f0197yrz"}, {"text": "Thales Group", "value": "/m/01phj4"}, {"text": "Zendesk", "value": "/m/0wkm4pl"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "Aryan Solutions", "value": "/g/11dxptv4s4"}, {"text": "Atidan Technologies", "value": "/g/11c74f0b8_"}, {"text": "Bee Cheng Hiang Hup Chong Foodstuff Pte Ltd", "value": "/g/11dxpq9hhl"}]}]}