{"search_metadata": {"id": "60827ed2ce87f828559b1073", "status": "Success", "json_endpoint": "https://serpapi.com/searches/0222415142181a93/60827ed2ce87f828559b1073.json", "created_at": "2021-04-23 08:01:22 UTC", "processed_at": "2021-04-23 08:01:22 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28solution+architect%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=230", "raw_html_file": "https://serpapi.com/searches/0222415142181a93/60827ed2ce87f828559b1073.html", "total_time_taken": 1.03}, "search_parameters": {"q": "(solution architect) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "230"}, "jobs_results": [{"title": "ServiceNow Solution/Technical Architect", "company_name": "IBM", "location": "Singapore", "via": "via LinkedIn", "description": "Your Role and ResponsibilitiesIBM’s ServiceNow business is growing rapidly, and we are looking for a new leader to drive this growth. As a Technical Architect – ServiceNow, you will be responsible for providing architecture oversight to our projects as well as help in architecting solutions for our top national and international clients. You will provide thought leadership, review and advice on the client’s ServiceNow Architecture and integration within ServiceNow modules and 3rd Party solutions and build new methods and tools to be used across all our projects.\n\nResponsibilities for the ServiceNow Technical Architect\n• Handle Architectural role in ServiceNow area. Analyse current technologies used within the target project and determine ways to improve by implementing ServiceNow and its architecture.\n• Provide technical consultation to our clients in terms of using ServiceNow best practices for implementations and ongoing operations\n• Lead and govern end-to-end ServiceNow... implementations, migrations, transformation projects using onshore, offshore and nearshore models.\n• Establish enterprise wide best-practices and IT thought leadership in Service Management, Service Integration and Management, Intelligent Automation Platform and Robotic Process Automation.\n• Implement complex ServiceNow solutions for our clients in all applications/modules such as TSM Pro, ITSM Pro, HRSD, ITOM Pro, SAM Pro, HAM Pro, ITBM Pro, Security Operations, GRC, FSM Pro and CSM Pro.\n• Lead & investigate complex technical issues and review code as required.\n• Account for possible project challenges on constraints including, risks, time, resources and scope\n• Work closely with project management teams to successfully monitor technical progress of ServiceNow implementations and maintenance/administration tasks\n• Design ServiceNow technical solutions and also provide detailed specifications for those proposed solutions\n• Provide expert guidance for best practices related to ServiceNow administration\n\nRequired Professional And Technical Expertise\n• 10+ years of IT experience with Proven ServiceNow Product knowledge\n• 3-5 years of experience as a ServiceNow Solution/Technical Architecture with implementing SaaS/PaaS Solution on specific cloud architecture.\n• Experience in multiple end-to-end ServiceNow implementations across all modules - TSM Pro, ITSM Pro, HRSD, ITOM Pro, SAM Pro, HAM Pro, ITBM Pro, Security Operations, GRC, FSM Pro and CSM Pro.\n• Strong experience in integrating ServiceNow to several other applications using SOAP/REST. Preferred to have experience working with ServiceNow to ServiceNow and ServiceNow to Remedy ebondings or anyother Products of similar nature.\n• Strong working in an Agile/DevOps environment in Continuous Integration, Continuous Delivery, automated testing, Agile metrics Preferred Tech and Prof Experience\n• Strong understanding of the key technologies relevant to the ServiceNow integration solutions including: SSO, SAML, SSL, Web Services, LDAP, JDBC, ODBC, REST,FTP and also well versed with cloud technologies.\n• Mandatory ServiceNow certifications – Certified System Administrator, Certified Application Developer, Implementation Specialist in 2 or more of these modules – ITSM/HRSD/CSM/FSM/ITBM/Discovery/Service Mapping/GRC/SIR/PPM/Cloud Management\n• Experience with enterprise level tool migrations\n• Experience in software engineering and design architecture\n• Excellent Communication skills – ability to communicate at an executive level\n\nPreferred Professional And Technical Expertise\n• Preferably ITIL v4 certified\n• Preferably be TOGAF 9 certified or have a similar enterprise architecture certification\n• Should have strong Agile/DevOps delivery experience\n• Should have good knowledge of network/infrastructure/database/asset setup for an organization to be able to assist client using ServiceNow ITOM/ITAM\n• Current understanding of best practices regarding system security measures\n• Experience with scripting in the ServiceNow platform using JavaScript, Jelly, and/or AngularJS for Business Rules, Client Scripts, UI Actions, UI Pages, Widgets, Background scripts etc.\n• Ambitious individual who can work under their own direction towards agreed targets/goals.\n• Ability to handle change and be open to it along with good time management and an able to work under stress\n• Proven interpersonal skills while contributing to team effort by accomplishing related results as needed\n\nBy submitting your interest in this job, you agree to receive text notifications with additional steps to complete your job application. You will receive up to 6 messages from the number \"63879\". Message & data rates may apply. Please refer to our privacy policy for more information", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZXJ2aWNlTm93IFNvbHV0aW9uL1RlY2huaWNhbCBBcmNoaXRlY3QiLCJjb21wYW55X25hbWUiOiJJQk0iLCJjb21wYW55X21pZCI6Ii9tLzAzc2M4IiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiUlV2R2hsVWlKd08zMVh3bEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXNrQkNvd0JRVTVWWDA1eFVUQk5kMUI1UkVKaFdEWTNWV0phWTNKNWFIbHVWV3R6TldKclZXTTJZamxGZDFkbWEwNWxkRVp5V0ZWNmRVOVhUV2wxZW01a1VVdExSRUZsYWxaT2RVTkdNVlJ1VGsxeVgxbHhRVTVHZEVZMVdUQnlUMGhLWnpOaE1WQnlTMUJpVjFoV2RuVlNaaTFwVkVaUWVGVm5TVzFyYWpCUFlqVXhjakZLVjE4d2NESnpUMWxxYjI4U0ZEQXpOa05aVUhKM1FUVnFZblJCWVZSc1NscFJHaUpCVDAxWlVuZERaRVpNZGpoVldrUlJaSE5zYmsxV01GRmliVzVUU1MxTlVuWjMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY183IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExpbmtlZEluIiwibGluayI6Imh0dHBzOi8vc2cubGlua2VkaW4uY29tL2pvYnMvdmlldy9zZXJ2aWNlbm93LXNvbHV0aW9uLXRlY2huaWNhbC1hcmNoaXRlY3QtYXQtaWJtLTI0NzIzNDU0Mzg/cmVmSWQ9MGJjY2E5OTItYWFjNi00MmI5LWJkOTctZDBiNzI2MGVmZmVmXHUwMDI2dHJhY2tpbmdJZD02UTFUNS9oTnp0JTJCeDJFZ2hXNnBqSFElM0QlM0RcdTAwMjZ1dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior / Solution Architect (Mobile App)", "company_name": "EPAM Systems", "location": "Singapore", "via": "via LinkedIn", "description": "EPAM is committed to providing our global team of more than 41,150 EPAMers with inspiring careers from day one. EPAMers think creatively and lead with passion and honesty. Our people are the source of our success. We value collaboration, work in partnership with our customers, and strive for the highest standards of excellence. In today’s market conditions, we’re supporting operations for hundreds of clients around the world remotely. No matter where you are located, you’ll join a dedicated, diverse community that will help you discover your fullest potential.\n\nDescription\n\nWe are looking for an experienced Senior / Solution Architect in Singapore to make the team stronger.\n\nResponsibilities\n• Design and build advanced applications for the mobile platform\n• Lead discussion with CTO on application risk assessment\n• Work with infrastructure team to set up environment and drive vendor discussion\n• Collaborate with cross-functional teams to define, design, and ship new features\n• Work... with outside data sources and API's\n• Unit-test code for robustness, including edge cases, usability, and general reliability\n• Work on bug fixing and improving application performance\n• Continuously discover, evaluate, and implement new technologies to maximize development efficiency\n• Full-cycle web application development using Agile approach:\n• Idea generation and high-level vision creation\n• Solution design and documenting, proposal\n• Development, testing, and Production launch\n• Run customer’s demo and education sessions\n• Coordinate your work with other developers to deliver first-class technology solutions in a positive, fun, yet challenging and deadline driven environment\n• Work closely with other Product and Technology teams, internal and external, to bring technology solutions and perspectives to the product development process\n• Provide input on, follow and evangelize code quality guidelines and standards\n• Participate in code reviews to highlight best of breed solutions\n• Identify / troubleshoot application code-related issues, and review and provide feedback on any required final user documentation\n\nRequirements\n• Information BS/MS degree in Computer Science, Engineering or a related subject\n• Senior Solution architect: Minimum 12-15 years of software development experience with minimum 7 years of Solution Architect (Mobile Domain)\n• Solution Architect: Minimum 10 -12 years of software development experience with 4-6 years of Solution Architect (Mobile Domain)\n• Software architect for integrating vendor products & implementation for mobile banking solution. The focus would be more on system integration, architecture review, driving the implementation on the client side\n• Able to document SAD\n• Experience working with Java in mobile domain\n• Experience with third-party libraries and APIs\n• Working knowledge of the general mobile landscape, architectures, trends, and emerging technologies\n• Mobile banking experience is strongly preferred\n• Banking experience is required\n• Strong understanding & experience with Design patterns, Data Structures\n• Familiarity with RESTful APIs to connect mobile applications with back-end services\n• Demonstrable capability to use OS frameworks for multi-threading, data persistence, and adapting user interface across multiple screen sizes\n• Experience with performance and memory usage tuning\n• Developed a culture of benchmarking and optimization\n• Comfortable working in agile product development environment, building from scratch and continuously improving it\n• Drive architecture and technology choices for the mobile products\n• Ability to lead mobile projects through the complete development lifecycle\n• Solid understanding of the full mobile development life cycle\n\nWe offer\n• Friendly team and enjoyable working environment\n• Work-life balance and flexible schedule\n• Online training library, mentoring, career development and potential partial grant of certification\n• Unlimited access to LinkedIn learning solutions\n• Referral bonuses\n• Compensation for sick leave and paid time off\n• Opportunities for self-realization", "extensions": ["8 days ago", "Full–time"], "detected_extensions": {"posted_at": "8 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgLyBTb2x1dGlvbiBBcmNoaXRlY3QgKE1vYmlsZSBBcHApIiwiY29tcGFueV9uYW1lIjoiRVBBTSBTeXN0ZW1zIiwiY29tcGFueV9taWQiOiIvbS8wZGxucmMiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJTeERCS216LTMybnVjRDBQQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdDhCQ3FJQlFVNVZYMDV4VTJGQ2VYaFNaMHAyWm10T09GSkVhM1l4YUMxMFpVcFpaVGRDYVVadE9GVmhUSGRrYVRadldrVmxYeTFoV1ZKemFEaG5TMmR4VFdaSVNqSTBUVE5EUVdwYWRFVTJia0p2VVhGMFVsZHlNRWRpTlZOM1duY3dVVTFQY0hJMFZGUXRaREZqUzJjMFRGbGlMV0pIZHpSR2JXSnhhVzUyUTJGS1FVbHBMWEV4VFRrNU16aFVaRkY2TURKdmNuVnhaVlpNZGpsUWJtMVlRbEpUYmxGUkVoUXdNelpEV1ZCeWQwRTFhbUowUVdGVWJFcGFVUm9pUVU5TldWSjNRWGhhVmtKUWNsVm5hbUpRTUZKTlQwNDNTRXhXVW5sTk0xcGlVUSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzE1IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExpbmtlZEluIiwibGluayI6Imh0dHBzOi8vc2cubGlua2VkaW4uY29tL2pvYnMvdmlldy9zZW5pb3Itc29sdXRpb24tYXJjaGl0ZWN0LW1vYmlsZS1hcHAtYXQtZXBhbS1zeXN0ZW1zLTI1MDUyNzIzMDU/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "GIT _ Senior Architect (125901)", "company_name": "Singtel", "location": "Singapore", "via": "via Glassdoor", "description": "Singtel, Asia’s leading communications technology group, provides an extensive range of telecommunications and digital services to millions of consumers and businesses across Asia, Australia, Africa and the USA. With over 140 years of innovation behind us, we continue to push boundaries in our networks and services, to enrich lives and transform businesses.\n\nOur core values – Customer Focus, Challenger Spirit, Teamwork, Integrity, and Personal Excellence – shape the way we work. We are passionate about making a difference and have an open and inclusive culture where everyone is empowered to do their best. Our diverse business means you will enjoy unique opportunities and rewarding experiences to learn and grow your career in a dynamic industry.\n\nJoin us and experience what it’s like to be with an Employer of Choice*. Together, let’s create a brighter digital future for all. *Awarded at the HR Fest Awards 2020\n\nSingtel are at the leading edge of technology development to improve the... experience of our customers as they consume services across mobile, voice and data infrastructure, managed services, cloud computing, IT services and professional consulting. To support that journey, we are searching for top talent and have an exciting opportunity for an Architect to strengthen our team.\n\nThis is a strategic role expected to focus on Application Architecture for various digital channels and platforms.\n\nResponsibilities\n• Understands business functions and transform requirements into architecture and blueprint for the solution being created. Need to propose new innovative solutions, updates to existing solutions, negotiate alternative options, build technical and release roadmaps\n• Construct a solution architecture around Microservices and APIs, and be able to decompose monolith applications into meaningful implementable Microservices and APIs in a Cloud/DevOps environment\n• Work closely with the development team and get their buy-in into accepting the design to be implemented. Also, work with different stake holders, product owner, senior executives, external parties like system integrators, product partners.\n• Provide technology perspective to business to achieve roadmap and prioritization by keeping abreast with industry trends. Where required, help business size the complexity of problem and help simplify and define MVP\n\nExperience\n• 12+ years of experience in the technology industry including 8+ in architecture of scalable and high-performance internet facing systems\n• Possess strong background and experience as a successful Software engineer/Architect in building large scale, highly available Internet and mobile applications.\n• Have in depth knowledge of cloud computing, microservices architecture (incl. design pattern, rest/grpc, gateway & service mesh etc.), DevOps, Streaming architecture, Modern data architecture, Mobile and Web application architecture\n• Good experience in API security including OAuth2/OIDC, Tokens, mTLS etc.\n• Significant experience working on mission critical internet facing applications focusing on scalability, performance, architecture aspects\n• Passion for architecture and ability to pick up and learn new technological advances very quickly\n• Exhibits leadership in guiding team members, adapts to changes in technology and business domains, has good knowledge of latest trends in the market and is well respected within the team\n• Solid understanding of Public Cloud (pref. AWS) architecture. AWS certification is a big plus\n• Experience in Java, Spring boot, any modern messaging technology, any Traditional and NoSQL database is a big plus\n\nWe believe in the strength of a vibrant, diverse and inclusive workforce where backgrounds, perspectives and life experiences of our people help us innovate and create strong connections with our customers. We strive to ensure all our people practices are non-discriminatory and provide a fair, performance-based work culture that is diverse, inclusive and collaborative", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJHSVQgXyBTZW5pb3IgQXJjaGl0ZWN0ICgxMjU5MDEpIiwiY29tcGFueV9uYW1lIjoiU2luZ3RlbCIsImNvbXBhbnlfbWlkIjoiL20vMDIwemZsIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiN3p1NVgtREVKX05yc1pucEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXNrQkNvd0JRVTVWWDA1eFVWZHpjVmhIVG1GVGRIRlhTalJ4WDBwaFEyczFiSFJIU0hocVNucFRZWE5vVjNOcVlWSXhkVmN0Y0ZKMVNYSjRVakJETnkxTmVtcHFRVUUzUWxkNmFtcHhORkptUVU0eExYUnlja1ZYTTNWVWRtWkhOamcyZGxwcFpFNW9TV1JwZWs5cGFXWkNjRkJ6TFhrek1IVnNXbWcyZGt0TFExRlFOVGhsVnpWd1YwaDJlRk4yTFdjU0ZEQXpOa05aVUhKM1FUVnFZblJCWVZSc1NscFJHaUpCVDAxWlVuZENkR05WWVdKalVTMTNRVkJ1V1hJdGFXeG9ja1kzUkhCSGVGQm4iLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18yMyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBHbGFzc2Rvb3IiLCJsaW5rIjoiaHR0cHM6Ly93d3cuZ2xhc3Nkb29yLnNnL2pvYi1saXN0aW5nL2dpdC1zZW5pb3ItYXJjaGl0ZWN0LTEyNTkwMS1zaW5ndGVsLUpWX0lDMzIzNTkyMV9LTzAsMjdfS0UyOCwzNS5odG0/amw9NDAzOTg0ODgzNlx1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Senior / Solution Architect (Android)", "company_name": "EPAM Systems", "location": "Singapore", "via": "via LinkedIn", "description": "EPAM is committed to providing our global team of more than 41,150 EPAMers with inspiring careers from day one. EPAMers think creatively and lead with passion and honesty. Our people are the source of our success. We value collaboration, work in partnership with our customers, and strive for the highest standards of excellence. In today’s market conditions, we’re supporting operations for hundreds of clients around the world remotely. No matter where you are located, you’ll join a dedicated, diverse community that will help you discover your fullest potential.\n\nDescription\n\nWe are looking for an experienced Senior/ Solution Architect specialized in Android in Singapore to make the team stronger.\n\nResponsibilities\n• Design and build advanced applications for the Android platform\n• Collaborate with cross-functional teams to define, design, and ship new features\n• Work with outside data sources and API's\n• Unit-test code for robustness, including edge cases, usability, and general... reliability\n• Work on bug fixing and improving application performance\n• Continuously discover, evaluate, and implement new technologies to maximize development efficiency\n• Full-cycle web application development using Agile approach:\n• Idea generation and high-level vision creation\n• Solution design and documenting, proposal\n• Development, testing, and Production launch\n• Run customer’s demo and education sessions\n• Be a member of a cross-functional team that experiment with new technology and proactively searches for the best solutions and ideas in the marketplace\n• Coordinate your work with other developers to deliver first-class technology solutions in a positive, fun, yet challenging and deadline driven environment\n• Work closely with other Product and Technology teams, internal and external, to bring technology solutions and perspectives to the product development process\n• Provide input on, follow and evangelize code quality guidelines and standards\n• Participate in code reviews to highlight best of breed solutions\n• Identify/troubleshoot application code-related issues, and review and provide feedback on any required final user documentation\n\nRequirements\n• Proficient with software development for Android applications\n• Strong understanding & experience with Design patterns, Data Structures\n• Familiarity with RESTful APIs to connect mobile applications with back-end services\n• Demonstrable capability to use OS frameworks for multi-threading, data persistence, and adapting user interface across multiple screen sizes\n• Experience with developing custom UIs and animations\n• Familiarity with ad integration, push notifications\n• Experience with performance and memory usage tuning\n• Developed a culture of benchmarking and optimization\n• Comfortable working in agile product development environment, building from scratch and continuously improving it\n• Drive architecture and technology choices for the mobile products\n• Ability to lead mobile projects through the complete development lifecycle\n• Ability to lead and mentor a group of engineers\n• Passionate about delivering high quality user experience\n• Self-starter, strong sense of ownership, gets things done\n• Capable of making timely decisions while dealing with uncertainties & inadequate information\n• BS/MS degree in Computer Science, Engineering or a related subject\n• Minimum 15 years of software development experience\n• Minimum 7 years of Android development\n• Expert in Android SDK\n• Experience working with remote data via REST and JSON\n• Experience with third-party libraries and APIs\n• Working knowledge of the general mobile landscape, architectures, trends, and emerging technologies\n• Solid understanding of the full mobile development life cycle\n• Critical thinker and problem-solving skills\n• Great interpersonal and communication skills\n• Mobile banking experience is strongly preferred\n• Experience with functional reactive programming, TDD, Kotlin would be a plus\n• Banking experience is required\n\nWe offer\n• Friendly team and enjoyable working environment\n• Work-life balance and flexible schedule\n• Online training library, mentoring, career development and potential partial grant of certification\n• Unlimited access to LinkedIn learning solutions\n• Referral bonuses\n• Compensation for sick leave and paid time off\n• Opportunities for self-realization", "extensions": ["8 days ago", "Full–time"], "detected_extensions": {"posted_at": "8 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgLyBTb2x1dGlvbiBBcmNoaXRlY3QgKEFuZHJvaWQpIiwiY29tcGFueV9uYW1lIjoiRVBBTSBTeXN0ZW1zIiwiY29tcGFueV9taWQiOiIvbS8wZGxucmMiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJXMjVkY2xSdko0YkxwSXVCQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdDhCQ3FJQlFVNVZYMDV4VkdoNlNHUmFTR3RZZFdadGVuTTBVa1JPV2xKcFZ6WTNiaTFOVEZWVk9VZHFkRVU0YkV0clIySlNSVkY2ZUU0M01YaFVNV2hxVVdwS1ZGUkZjeTFwZGtGeU1XSmFSVXd4TUhNemRsUkliRGhaTWw5bU9GSklVWEp1TVU4M1ozSXdVMUJGYUhWNmIwdFRhVlExWmxGelYwTkxRa2hUZEdsV1JXRTVNSGMyYTA1UFp6QlpRbHBSY1U1b1UySkRWVWh6V0ZrNGVtaFlZMnRqV25SM0VoUXdNelpEV1ZCeWQwRTFhbUowUVdGVWJFcGFVUm9pUVU5TldWSjNRbVZuVmxGTVVFRmxjMnhzY0hCNVNHOXNhWEpyVldzeVFqZE5adyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzMxIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExpbmtlZEluIiwibGluayI6Imh0dHBzOi8vc2cubGlua2VkaW4uY29tL2pvYnMvdmlldy9zZW5pb3Itc29sdXRpb24tYXJjaGl0ZWN0LWFuZHJvaWQtYXQtZXBhbS1zeXN0ZW1zLTI1MDUyNjk1MDc/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Alibaba Cloud Intelligence Solutions Architect Singapore", "company_name": "Alibaba Group Holding Limited", "location": "Singapore", "via": "via Jobrapido.com", "description": "Job Description Alibaba Cloud Established In September 2009, Alibaba Cloud (Alibaba Cloud Computing) develops highly scalable cloud computing and data management services providing large and small businesses, financial institutions, governments and other organizations with flexible, cost-effective solutions to their networking and information needs\n\nA business of the Alibaba Group, one of the world’s largest e-commerce companies, Alibaba Cloud operates the network that powers Alibaba’s extensive online and mobile commerce ecosystem, and sells a comprehensive suite of cloud-computing products and services\n\nBackground: Solutions Architect (SA) is a key pre-sales technical position in Alibaba Cloud international business division\n\nOur CA’s are experienced cloud architects with comprehensive IT knowledge and industry insight and are, ultimately, the key to success on implementing projects\n\nSolutions Architects are responsible for developing solutions in Alibaba Cloud and helping customers... and partners to develop their applications and services on the Alibaba Cloud platform\n\nClosely work with customers to ensure their cloud architecture is successfully implemented by assisting them in building their applications and services on the Alibaba Cloud platform. - Create and present solution architecture designs to C-level/senior personnel. - Responsible for understanding the unique requirements of customers and partners, and provide appropriate technical cloud solutions and architecture designs based on Alibaba Cloud cloud services. - Provide assistance to Alibaba Cloud customers and partners in migrating their existing IT system onto Alibaba Cloud platforms\n\nThis includes providing migration technique support for both applications and databases. - Responsible for demo development and testing Alibaba Cloud services.※Candidate who has ACP(Alibaba Cloud Certification Professional) or ACA(Alibaba Cloud Certification Associate) is preferred\n\nJob requirements - A background in IT, computer science and/or cloud computing with a good understanding of networking, servers, storage systems, enterprise applications and the cloud. - A minimum of 3 years experience working and consulting on enterprise architecture design and has a strong understanding of customer needs and requirements\n\nExperience working or studying abroad is preferred. - Expert knowledge and understanding of cloud architecture design and familiar with architecture methodology and practice in internet based applications/websites\n\nMust also be familiar with procedures and tools for application migration and cloud/virtualization solutions for enterprise customers. - Experience with Java/PHP/Python/Scala/Go/C++ development, familiar with JDBC, XML, Web Service and design patterns\n\nExperience with Structs, Hibernate, Tomcat or Weblogic server. - Familiar with, and able to setup environments and do testing independently on Redis/MySQL/PostgreSQL/NoSQL DB/Hadoop/Spark... - Excellent writing, proofreading and editing skills\n\nAble to create documentation that can express cloud architectures using text and diagrams. - Able to work under high pressure, a quick learner with a passion for cloud technology\n\nAble to think strategically about businesses, products and technical challenges. - Good communication skills, a good team player and has professional attitude to work - Fluent English is required\n\n我们鼓励人人践行公益，同学如参与过公益活动，有相关证明，也欢迎附在简历中。参考依据包括但不限于：全国志愿服务信息系统开具的志愿服务证明、“人人3小时”公益平台公益时证书、志愿服务组织（含社会团体、社会服务机构、基金会）授予的志愿服务证明等。 Work Experience 五年以上", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBbGliYWJhIENsb3VkIEludGVsbGlnZW5jZSBTb2x1dGlvbnMgQXJjaGl0ZWN0IFNpbmdhcG9yZSIsImNvbXBhbnlfbmFtZSI6IkFsaWJhYmEgR3JvdXAgSG9sZGluZyBMaW1pdGVkIiwiY29tcGFueV9taWQiOiIvbS8wN3M2Y3RsIiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoieDdsWG4zT2JoUFc3TXZTekFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRW9rQ0Nzd0JRVTVWWDA1eFUySjJUbXhRY0dkM2RHdHBkSGM0YUhoMmRuaHROVGxrWkc1RGNDMUtUV2cyZG5sSVJYaGZNSFkyV1VsUlEwTjNaVFEyTnpORE4zVllOMGcxWVhaRldrRjBNR052UjI5YVVXVXdhRlZGTFZZd1VFSlRjeko0ZGpGdWNIcE1RMHBFZVcxcWJ6STBjRnA1U2tSWFNXdDZVWGx0UlhJeE5HcHlaVGxRZVdkVFRFWk5la3BGVEd0Nk9FeFFlVjgyWjIxNU9VZEtTQzEzWkhWYWJHWnlaazlHZFhrd2JITnJVREIxT1VocFp6a3laMU5EYW04eVZsTmhWbE5JY0hNNWNHYzVaM05IYm5aQ0VoUXdNelpEV1ZCeWQwRTFhbUowUVdGVWJFcGFVUm9pUVU5TldWSjNRMGxXZW5BMWIxZDBMVTAyTm5oQk9VeGpXVTV5TmpWWmVuZFBVUSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzM5IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnJhcGlkby5jb20iLCJsaW5rIjoiaHR0cHM6Ly9zZy5qb2JyYXBpZG8uY29tL2pvYnByZXZpZXcvMjI4NzQ1Nzg/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Technical Trainer", "company_name": "Amazon", "location": "Singapore", "via": "via Jobs | Fidanto", "description": "Job Description : Amazon Web Services provides a highly reliable, scalable, low-cost infrastructure platform in the cloud that powers hundreds of thousands of businesses in 190 countries around the world. To meet the growing demand for AWS Services around the globe, we need exceptionally talented, bright, and driven people. If you have strong IT infrastructure and/or programming experience, and can communicate highly technical concepts to audiences at different stages in the AWS journey, we'd like to speak with you. We are looking for a dynamic, organized self-starter to join our Training Team. Here's your chance to work as a Technical Trainer with high visibility and significant customer impact. The successful candidate is an experienced technical trainer, ideally with hands-on experience with Amazon Web Services and/or in-depth knowledge of software architecture and virtualization technologies. In this role, you will deliver training content to developers, administrators, architects... to drive adoption and usage of AWS services. You'll have an opportunity to combine a passion for teaching, with enthusiasm for technology, to drive learning and establish positive customer relationships. You will have excellent communication skills and proven technology training experience. You will also: · Constantly learn and master the most innovative technologies related to cloud computing using AWS product and services. · Deliver training programs in startups to transform their workforce by embedding confidence to use AWS technologies · Strategically engage with various customers business functions and IT organizations to create customer-tailored training plans jointly with AWS Training Business Development Managers and Sales Managers · Partner with AWS internal AWS Support Engineers, Technical Account Managers and Solutions Architects to understand customer challenges, identify customers pain points & deliver impactful training sessions · Dive deep and build a domain expertise in Startups that focus on – Fintech, Healthcare, Media, Aviation, Gaming and others · Create a global impact through development of curriculum for cutting-edge and innovative technologies released by AWS product and service teams · Get hands-on with training & certification internal projects that improve processes that contributes to productivity gains and business performance improvements · Be the AWS advocate at customer facing events such as AWS re:Invent, AWSome Days, AWS Summits and AWS Customer Appreciation Nights · Excel in an Area of Depth and build Subject Matter Expertise in Architecture, DevOps, Big Data, Deep Learning. If this position excites you, please submit your resume using the link below and include a cover letter outlining your motivation, experience and why you want to join our team Basic Qualifications : · Ability to communicate (written and verbal) in English and Bahasa Indonesia. · 8 years of experience in training delivery in programming, systems architecture or systems administration. · Excellent oral presentation skills, interpersonal communication, and writing skills. · A strong \"stage presence\" and ability to manage a classroom of adult learners. · Experience architecting infrastructure solutions using both Linux/Unix and Windows with specific recommendations on server, load balancing, HA/DR, network and storage architectures. · Recent coding experience in one or more of the following languages, Java, .Net, Perl, PHP, Ruby or Python. · Experience working within the Startups or Enterprise software market or Internet industries is highly desired. · Ability to travel as required. Preferred Qualifications : · AWS Certified Solution Architect - Associate Level · Experience creating and maintaining training materials. · Knowledge and/or hands-on experience with AWS infrastructure services highly desired. Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer, and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, disability, age, or other legally protected status. Job Description : Amazon Web Services provides a highly reliable, scalable, low-cost infrastructure platform in the cloud that powers hundreds of thousands of businesses in 190 countries around the world. To meet the growing demand for AWS Services a Skills: Technical Trainer Experience: 8.00-11.00 Years", "extensions": ["4 days ago", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJUZWNobmljYWwgVHJhaW5lciIsImNvbXBhbnlfbmFtZSI6IkFtYXpvbiIsImNvbXBhbnlfbWlkIjoiL20vMG1na2ciLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJsZzhDQkZVRzIwWWZ4cnduQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFc2tCQ293QlFVNVZYMDV4VWpSWFNEWjBlRU5WYm1ORllrOWFjRkkwVGpoV05IbFBWRjlmUmpSWE1EWjZPVFl6YVRoVFpXZEdUbXhHYjFScWJrVnlRM1J5TURsQlZVNWthazlZUkZOSWJVa3RjakZrVTFoelZDMXRjWEJ3WlZaeE9FOTRRVW8xVjJGNVFrOUJVMlZsVVVsMWJVNXJUamhGUm1aRFUyRndiMnBKVlVwcGFqVnBUM0p4WTBKUlFYUnBUVGNTRkRBek5rTlpVSEozUVRWcVluUkJZVlJzU2xwUkdpSkJUMDFaVW5kRVlYVnhSMVJXTVdoRE1rbDFUR2haYkZack1ubDBRVzkxY25kMyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzQ3IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnMgfCBGaWRhbnRvIiwibGluayI6Imh0dHBzOi8vc2cuZmlkYW50by5jb20vam9icy9qb2Itb3BlbmluZy9jb3Vuc2Vsb3JzLWFsbC1vdGhlci90ZWNobmljYWwtdHJhaW5lci0yNzY5NjQ1Mzk/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Principal Manager, Solution Architect (2-year contract) Digital Enablement and Operations Division (Training Partners / Individuals)", "company_name": "Committee for Private Education Group (SkillsFuture Singapore)", "location": "Singapore (+1 other)", "via": "via LinkedIn", "description": "Responsibilities\n• Provide technical expertise and contribute to establishing the direction for the IT architecture, standards, design and implementation approaches for the agency systems\n• Creates, evaluates and implements plans and design proposals for high impact IT solutions\n• Translate business requirements, including application resiliency requirements, into application architectural specifications\n• Evaluate and recommend the use of leading edge technologies and methods, considering factors, such as their long-term effectiveness (service delivery and cost), practicality, technical limitations and criticality\n• Design the architecture blueprint of the organisation's business, information and ICT assets, by using multiple architectural models. Use, govern and enhance the architecture blueprint to ensure that the business and ICT are in alignment.\n• Perform code reviews and make recommendations of code changes\n• Review specifications and designs to ensure compliance with security... and IT policies\n• Collaborate with vendor development staff to resolve technical challenges\n• Help analyze and determine performance tuning and scalability improvements of code and queries\n• Provide architecture and technical support during production incidents\n• Actively engage stakeholders (Management, System Owners & Process Owners) to provide recommendations of solutions for business needs.\n• Drive knowledge sharing initiatives to promote technical proficiency across all teams\n• Manage collaboration across technical design and implementation teams for cross team technical design and implementation\n• Actively participates in forums driving enterprise architecture and solutions\n\nRequirements\n• Tertiary qualification preferably with at least 8 years of relevant working experience in solution architecture and design.\n• Min 7 years of design/implementation/consulting experience with distributed applications - must have a minimum of 3 years hands-on experience as a tech lead and system architect (i.e. system design, performance tuning, and system prototyping & maintenance)\n• A solid software development background and multiple industry certifications.\n• Should have experience designing and implementing applications in an enterprise setting.\n• Solid understanding of Server-side technologies, development, Service Oriented Architectures, web services, RESTful API and public web sites / e-services development. Full Stack development experience and knowledge a must.\n• Strong knowledge of security and infrastructure designs and implementations, especially cloud platforms like AWS, Azure or GCP.\n• Working knowledge of software development tools and methodologies\n• Able to independently analyze and identify comprehensive solutions considering all functional implications while developing a workable solution\n• Team player with strong organization and people handling skills\n• Strong in writing, presentation and stakeholder management", "extensions": ["3 days ago", "Contractor"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Contractor"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcmluY2lwYWwgTWFuYWdlciwgU29sdXRpb24gQXJjaGl0ZWN0ICgyLXllYXIgY29udHJhY3QpIERpZ2l0YWwgRW5hYmxlbWVudCBhbmQgT3BlcmF0aW9ucyBEaXZpc2lvbiAoVHJhaW5pbmcgUGFydG5lcnMgLyBJbmRpdmlkdWFscykiLCJjb21wYW55X25hbWUiOiJDb21taXR0ZWUgZm9yIFByaXZhdGUgRWR1Y2F0aW9uIEdyb3VwIChTa2lsbHNGdXR1cmUgU2luZ2Fwb3JlKSIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoid2JmaXZna19NX3NjdzJQMEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL3NnLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvcHJpbmNpcGFsLW1hbmFnZXItc29sdXRpb24tYXJjaGl0ZWN0LTIteWVhci1jb250cmFjdC1kaWdpdGFsLWVuYWJsZW1lbnQtYW5kLW9wZXJhdGlvbnMtZGl2aXNpb24tdHJhaW5pbmctcGFydG5lcnMtaW5kaXZpZHVhbHMtYXQtY29tbWl0dGVlLWZvci1wcml2YXRlLWVkdWNhdGlvbi1ncm91cC1za2lsbHNmdXR1cmUtc2luZ2Fwb3JlLTI1MTU2NDMxNzA/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Ref: 122673 - Senior Architect, Solution - FICO (1-Year Direct Contract)", "company_name": "Singtel", "location": "Singapore", "via": "via Glassdoor", "description": "Realise your full potential with Asia's leading communications group. While we take pride in our 140-year heritage, our philosophy is to always look forward and evolve. Today, we are a leader in cutting-edge ICT innovation and digital advances, powered by a vast network of offices in countries and territories across Asia Pacific, the Middle East, Europe and the USA. Come be a part of our dynamic organisation as we create the infocomms landscape of the future.\n\nThe Singtel Group is Asia's leading communications group providing a diverse range of services including fixed, mobile, data, internet, TV, infocomms technology (ICT) and digital solutions. The successful applicant will be joining Group IT as a Senior Architect, Solution based in Singapore.\n\nKey Responsibilities:\n\nChange Requests\nDrive the delivery and completion of change requests in the SAP FICO area. Person is expected to work together with outsourced vendors to review and approve solutions to regular change requests. For... major change requests (eg: new initiatives, products, implementation), the person is expected to provide high level solution design and then review and approve the detailed solution design proposed by the outsourced vendor.\n\nDomain Ownership\nTogether with the SAP solution architects, be responsible for the overall strategy of Financial Systems (SAP and non-SAP) in the SingTel group (SingTel/NCS/Optus). The candidate must possess the vision and hands on experience to formalize, standardize, govern, and evolve the architecture design, standards, and processes in SAP Finance modules with the objective to deliver best practice, relevant, timely, dependable, and cost effective solutions to the Finance business stakeholders. The SAP modules in scope are mainly SAP FICO (CO-PA, CCA, PCA, PS, AP, AR, AM, GL, RE-FX, SPL). Version 1909 environment, and RE-FX module to address IFRS16 regulations are preferred.\n\nClient Facing\nBe the strategic interface and global single point of contact between IT and Finance business stakeholders of the SingTel Group so that stakeholders have clear and direct access to IT. The candidate must possess the consulting skills and industry experience to work with the stakeholders to understand business requirement and recommend industry best practice solutions.\n\nOperational Excellence\nEnsure issues and changes in financial systems are addressed within expected SLAs. Ensure continuous improvements to the systems and processes through proactive review and optimization initiatives with the business. Recommend and implement major improvements that have significant benefit to IT or the business.\n\nThe ideal candidate should possess:\n• Tertiary qualifications in business or IT\n• Experience in S4HANA environment and SAP Fiori\n• Minimum 10 years working experience as an SAP FICO consultant in large projects (or a combination of 6 years consulting and 4 years’ end user support experience)\n• SAP FICO Certification in ECC\n• Excellent interpersonal skills, in dealing with various multi-discipline groups and teams\n• Must be decisive, action oriented, results focused and able to work independently is a must\n• Show an ability to win the trust and respect of individuals and the group\n• Possess the ability to exercise independent and effective judgment based on previous background and experience\n• Preparedness to express and share knowledge and views on a continual basis\n• Emphasise collaboration and the development of win/win partnerships – strong team player\n• Work well under pressure and to tight deadlines\n\nIf this description is exciting and you feel that you have the necessary skills and experience to make a difference, then please follow the link to apply. For more information on this and other opportunities please refer to our careers portal under https://groupcareers.singtel.com.\n\nLet’s shape a better world through technology. Join us to lead the change.\n\nNote to Recruitment Agencies\n\nIn sourcing for candidates for particular roles, the Singtel Group works only with a panel of selected recruitment agencies expressly engaged under written agreements. Even then, these agencies are only activated from time to time for specific recruitment exercises for particular roles under instructions expressly issued by a member of the Singtel Talent Acquisition team.\n\nExcept under such circumstances, no agency shall source or attempt to source any candidates for the Singtel Group. The Singtel Group will not pay nor be obliged or liable to pay any recruitment fees of any kind whatsoever to any agency where candidate CVs are submitted to the Singtel Group by such agency on an unsolicited or speculative basis.\n\nThe Singtel Group reserves all rights to directly contact any candidate to which such CVs relate without any obligation or liability whatsoever to the agency concerned (including without limitation any obligation or liability to pay any recruitment fees of any kind", "extensions": ["3 days ago", "Contractor"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Contractor"}, "job_id": "eyJqb2JfdGl0bGUiOiJSZWY6IDEyMjY3MyAtIFNlbmlvciBBcmNoaXRlY3QsIFNvbHV0aW9uIC0gRklDTyAoMS1ZZWFyIERpcmVjdCBDb250cmFjdCkiLCJjb21wYW55X25hbWUiOiJTaW5ndGVsIiwiY29tcGFueV9taWQiOiIvbS8wMjB6ZmwiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJ0b0hTQUEwTThDeVdxaExqQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFc2tCQ293QlFVNVZYMDV4VWpSRlJtaExZVzl6TkVkSmRFTmZVVjlTVFRnMlZteHpkRXRSV201R1VtOURNRnBDY3pJMFduTXhWVXRYT0VOdlRWRjRhMngwVlRNMGNIcDJTMlp5VUdweGRtcFVUVU14YVdKQlYwbzJOM2g1ZVdkQ1VtSkpjV1pxTm1GelNWcEpRVzU2TVdsMExUaFJNMWxQYjJ4cWFGTktTMVZSVFVRNWMxUjBUMFEzYm1oS1puZHdUMU1TRkRBek5rTlpVSEozUVRWcVluUkJZVlJzU2xwUkdpSkJUMDFaVW5kQ1QwZEVjMUpHZGxoS1ZXdHNXbVZ4Y1ZCbmMzUTNjVUpRYWpCMyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzU5IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEdsYXNzZG9vciIsImxpbmsiOiJodHRwczovL3d3dy5nbGFzc2Rvb3Iuc2cvam9iLWxpc3RpbmcvcmVmLTEyMjY3My1zZW5pb3ItYXJjaGl0ZWN0LXNvbHV0aW9uLWZpY28tMS15ZWFyLWRpcmVjdC1jb250cmFjdC1zaW5ndGVsLUpWX0lDMzIzNTkyMV9LTzAsNjRfS0U2NSw3Mi5odG0/amw9NDA0MDAxOTc2MVx1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Solution Architect", "company_name": "EPAM Systems", "location": "Singapore", "via": "via LinkedIn", "description": "EPAM is committed to providing our global team of more than 41,150 EPAMers with inspiring careers from day one. EPAMers think creatively and lead with passion and honesty. Our people are the source of our success. We value collaboration, work in partnership with our customers, and strive for the highest standards of excellence. In today’s market conditions, we’re supporting operations for hundreds of clients around the world remotely. No matter where you are located, you’ll join a dedicated, diverse community that will help you discover your fullest potential.\n\nDescription\n\nWe are looking for an experienced Solution Architect in Singapore to make our team stronger.\n\nResponsibilities\n• Work in stand-alone mode on technical pre-sale activity and leading it\n• Identify gaps in delivery capabilities and proposes solutions to overcome them\n• Conduct interviews with candidates to Architect position\n• Provide guidance for the most complex or mission critical aspects of the architecture\n• Find... and evaluates emerging technologies\n• Hand-on and up-to-date experience with microservices technology domain\n• Initiate and arrange business domain specific knowledge sharing/trainings for the project team, acts as trainer\n• Pro-actively analyze and measure current processes and practices and suggest/drive improvements to time to market/quality/cost\n• Utilize metrics and KPI to make decisions and track project risks\n• Provide timely input of risks and issues, impacting quality, schedule or resources, and recommend effective mitigation plans when applicable\n• Develop work instructions, trainings, white-papers, case studies\n\nRequirements\n• Bachelor’s degree or above in Computer Science or related subject, Master’s degree or overseas education background is preferred\n• Having at least 10+ years of experience\n• Technology and Business domain-specific knowledge\n• 2-3 years experience in production architecture designs / solutions and review activities with available track of record\n• Good knowledge of architecture theory of all related technology domain\n• 2-3 years proven successful customer advisory/consultancy cases\n• Can write white papers and blueprints on customer’s request\n• Can create technology road map for Competency/domain\n• Has Enterprise Architecture theoretical knowledge\n• Can process, absorb, retain and reuse knowledge for several of the most popular business domains\n• Can create white papers and blue-prints, commercial proposals\n• True leader with confidence\n• Can lead group of Architects\n• Can lead the meeting of engineers, meeting with customer representatives, and the direction of an architecture\n• Ability to conduct presentation with wide audience (200+ people)\n• Software Engineering experience on any of the following technologies: Java, .NET, Javascript\n• Deep knowledge of any technologies from the following list would be beneficial: Kubernetes, Docker, Istio, Kong API, WSO API Management, PostgreSQL\n\nNice to have\n• Knowledge of financial business domains\n\nWe offer\n• Friendly team and enjoyable working environment\n• Work-life balance and flexible schedule\n• Online training library, mentoring, career development and potential partial grant of certification\n• Unlimited access to LinkedIn learning solutions\n• Referral bonuses\n• Compensation for sick leave and paid time off\n• Opportunities for self-realization", "extensions": ["2 days ago", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2x1dGlvbiBBcmNoaXRlY3QiLCJjb21wYW55X25hbWUiOiJFUEFNIFN5c3RlbXMiLCJjb21wYW55X21pZCI6Ii9tLzBkbG5yYyIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IlBhSlVtVXJjNWhrS0VSSEdBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV0OEJDcUlCUVU1VlgwNXhVbVF0TWxNMlQzaG5Ta2RIVEhSSmNuZHRVVzh5TlVSQmNHeHNNVGRaYTNFMGRtVXlhRk16YjFKa2EycGFjM2xvWTJ0VlUyaFNjMU5HT1RBM01IcDRWRVV3VG1VdFRtZEVZa013VkRsa2JHVk1hUzFIY1ZSWExWUlRWSGd4TXprM2VETkljVmx5TFVSSFVGSXpUbHBQWVhOaloyRllOa2QzZEZKbllrMXlUbkJaU0ZwUWF6VmlMVTVFTlVOaGQySllaM1kxUkRWVU1XTTBhRzFCRWhRd016WkRXVkJ5ZDBFMWFtSjBRV0ZVYkVwYVVSb2lRVTlOV1ZKM1FUSlNUV3c0UkdoU1VXcFlhazlwZDE5R1ZuWmhlRTVYTjFKbFVRIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNjciLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGlua2VkSW4iLCJsaW5rIjoiaHR0cHM6Ly9zZy5saW5rZWRpbi5jb20vam9icy92aWV3L3NvbHV0aW9uLWFyY2hpdGVjdC1hdC1lcGFtLXN5c3RlbXMtMjQyOTUyOTI4ND91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Cloud Solution Architect / AI Ranger", "company_name": "Microsoft", "location": "Singapore", "via": "via LinkedIn", "description": "Microsoft is on a mission to empower every person and every organization on the planet to achieve more. Our culture is centered on embracing a growth mindset, a theme of inspiring excellence, and encouraging teams and leaders to bring their best each day. In doing so, we create life-changing innovations that impact billions of lives around the world. You can help us to achieve our mission.\n\nMicrosoft aspires to help our customers achieve their own digital transformation, leveraging the power of Microsoft Cloud solutions and support offerings. To this end, Microsoft invests in a dedicated Customer Success team that will help Microsoft customers successfully realize their business outcomes.\n\nAzure is the most comprehensive, innovative and flexible cloud platform today and Microsoft is hiring professionals that will drive customer cloud adoption within the most important companies in the market.\n\nWe are always learning. Insatiably curious. We lean into uncertainty, take risks, and learn... quickly from our mistakes. We build on each other’s ideas because we are better together. We stand in awe of what humans dare to achieve and are motivated every day to empower others to do more and achieve more through our technology and innovation. Together we make a difference.\n\nTo learn more about Microsoft’s mission, please visit: https://careers.microsoft.com/mission-culture\nCheck out all of our products at: http://www.microsoft.com/en-us\n\nResponsibilities\n\nWe are looking for a highly motivated and passionate Data Science/Artificial Intelligence Cloud Solution Architect to drive high priority AI customer initiatives on the Microsoft Azure Platform in collaboration with customers and the Microsoft field in Enterprise accounts segment of our business. This is a customer facing role, owning overall technical relationship between customer and Microsoft Artificial Intelligence Platform in your region.\n\nYou will own Data Science / AI technical customer engagements including architectural design sessions, specific implementation projects and/or MVPs. The ideal candidate will have experience in customer-facing roles and success leading deep technical architecture discussions and development of POCs and/or Data Science Models with senior customer executives, Enterprise Architects, Data Scientists, IT Management and Developers to drive AI solutions to production\n\nKey responsibilities include:\n• * Understand customers’ overall data estate Business and IT priorities and success measures to design AI solutions that drive business value.\n• Apply technical knowledge to architect and design solutions that meet business and IT needs, create AI roadmaps, drive POCs and MVPs, and ensure long term technical viability of new deployments, infusing key AI technologies where appropriate (e.g. Azure ML, Azure Cognitive Services, Azure Bot Service, Azure Databricks, Azure Synapse, Power BI, etc.)\n• Working with multiple customers to createProof of concepts (POCs) / MinimumViable Products (MVPs) etc. and guiding customers through to production deployment and operationalizationof projects\n• Ensure that solution exhibits high levels of performance, security, scalability, maintainability, repeatability, appropriate reusability and reliability upon deployment\n• Develop deep relationships with key customer decision makers (both Business and IT) who drive long-term innovation and AI adoption within their company to enable them to be Azure AI advocates\n• Be a Voice of Customer to share insights and best practices, connect with Engineering team to remove key blockers and drive product improvements.\n• Collaborate with other Cloud Solution Architects, Global Black Belts and MS stakeholders in developing complex end-to-end Enterprise AI solutions on Microsoft Cloud platforms.\n• Maintain technical skills and knowledge, keeping up to date with market trends and competitive insights; collaborate and share with the AI technical community while educate customers on Azure platform\n• Be an Azure Platform evangelist with customers, partners and external communities.\n\nQualifications\n\nExperiences Required: Education, Key Experiences, Knowledge and Skills:\n\nProfessional Experience. 5+ years of success in consultative/complex technical sales and deployment projects, architecture, design, implementation, and/or support of AI / ML / Data Science solutions.\n\nTechnical\n• Enterprise-scale technical experience with AI technologies (Azure Machine Learning, Azure cognitive services, Open-Source AI frameworks, Python, MLOps, cloud and hybrid infrastructures and architecture designs. Required\n• \"Hands on\" Experience creating AI Proofof Concepts, MinimumViable Products(MVPs)for customers\n• The technical aptitude and experience to learn new technologies and understand market and relevant cloud trends\n• Competitive Landscape: Knowledge of key AI platforms such as AWS, GCP, DataRobot etc\n• Partners: Understanding of partner ecosystems and the ability to leverage partner solutions to solve customer needs preferred\n• Depth / Subject Matter Expertise in two or more of the following AI Platform Cloud solutions required\n• Data Governance\n• Data Engineering\n• Data Science\n• Machine Learning including Azure ML, ML Server, Azure Databricks\n• Artificial Intelligence including BOT framework, Cognitive Services, Cognitive Search\n• Breadth of technical experience and knowledge advantageous, with\n• Experience in big data workloads like HDInsight, Hadoop, Spark,\n• Advanced Analytics including Azure Data Bricks, visualization tools as PowerBI, Tableau\n\nCommunication\n• Relationship Building. Proven track record of building deep technical relationships with senior executives. Experience in managing various stakeholder relationships to get consensus on solution/projects. The ability to influence and build relationships across technical and business teams Required\n• Good business acumen to quickly understand the customer’s industry and business to have relevant discussions with business decision makers.\n• Good understanding of key AI scenarios that are driving innovation in key industries such as Financial services, Retail, Healthcare etc.\n• Problem Solving. Ability to solve customer’s AI problems through various cloud technologies Required\n• Collaboration and Communication. Acknowledged for driving decisions collaboratively, ability to communicate AI concepts effectively with busienss, data science and technical audiences, resolving conflicts and ensuring follow through with exceptional verbal and written communication skills. Ability to orchestrate, lead, and influence virtual teams, ensuring successful implementation of customer projects. Presentation skills with a high degree of comfort with both large and small audiences (Senior Executives, IT management, Data Scientists, Engineers) Required\n\nEducation\n• Bachelor's degree in Computer Science, Data Science, Information Technology, Engineer or related field preferred\n• Certification in one or more of the following technologies preferred: Data Science, Machine Learning, Artificial Intelligence\n\nExperience\n• Prior work experience in a Consulting/Architecture position within a software and/or services company such as Amazon, Google, IBM, etc desired\n• Prior solution delivery experience in AI specialized solution providers\n\nTravel required: 0-25%\n\nRe-location would be accommodated for qualified candidates\n\n#customersuccess\n\nMicrosoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form.\n\nBenefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work", "extensions": ["10 days ago", "Full–time"], "detected_extensions": {"posted_at": "10 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDbG91ZCBTb2x1dGlvbiBBcmNoaXRlY3QgLyBBSSBSYW5nZXIiLCJjb21wYW55X25hbWUiOiJNaWNyb3NvZnQiLCJjb21wYW55X21pZCI6Ii9tLzA0c3Y0IiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiT1E1aThoT1BoWW9hRzU0ZEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXQ4QkNxSUJRVTVWWDA1eFZFY3hVakIzVTI5dk5EQXpNMGxTYzBWeU9XTmpablJXUWw4NVUxOVdkbXBIVEc5cFZFNTJXV3RtVjFWRlh6Rm9OekoyYnpZMFRHbzFVMU5OTlhCdVQzcEhZWFZpY0RscFJrTlZVbWhpWW1Od09GOTBWakJTYkVOU1UxTnBkbWxoTkV0bldTMHhkbXRCWkVoU2FrMDJTRVpUWlZaRVJWRXhabTB6Y0hrM1YxUTRaMlZwYWxCT1JHYzROMEp4UmpWWVJFTnBlVFEwV1ZoQlFubEJFaFF3TXpaRFdWQnlkMEUxYW1KMFFXRlViRXBhVVJvaVFVOU5XVkozUkRGVlJXMTNSbXRhTFdKMWNqbDVUM1pHVUdWbE1tZGlWelIxUVEiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY183NSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL3NnLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvY2xvdWQtc29sdXRpb24tYXJjaGl0ZWN0LWFpLXJhbmdlci1hdC1taWNyb3NvZnQtMjQ4NjIxMjMyMz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}], "chips": [{"type": "Title", "param": "job_family_1", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Solution architect", "value": "solution architect"}, {"text": "Solutions architect", "value": "solutions architect"}, {"text": "Architect", "value": "architect"}, {"text": "Cloud architect", "value": "cloud architect"}, {"text": "Technical architect", "value": "technical architect"}, {"text": "Enterprise architect", "value": "enterprise architect"}, {"text": "Manager", "value": "manager"}, {"text": "Senior", "value": "senior"}, {"text": "Consultant", "value": "consultant"}, {"text": "Financial services", "value": "financial services"}, {"text": "Infrastructure architect", "value": "infrastructure architect"}, {"text": "Application architect", "value": "application architect"}, {"text": "Cloud engineer", "value": "cloud engineer"}, {"text": "It architect", "value": "it architect"}, {"text": "Lead architect", "value": "lead architect"}, {"text": "Network architect", "value": "network architect"}, {"text": "Security architect", "value": "security architect"}, {"text": "Senior architect", "value": "senior architect"}, {"text": "Systems engineer", "value": "systems engineer"}, {"text": "Associate director", "value": "associate director"}, {"text": "Deputy", "value": "deputy"}, {"text": "Engineers", "value": "engineers"}, {"text": "Head", "value": "head"}, {"text": "Infrastructure", "value": "infrastructure"}, {"text": "Lab", "value": "lab"}, {"text": "Network engineer", "value": "network engineer"}, {"text": "Presales consultant", "value": "presales consultant"}, {"text": "Public sector", "value": "public sector"}, {"text": "Senior analyst", "value": "senior analyst"}, {"text": "Senior consultant", "value": "senior consultant"}, {"text": "Senior director", "value": "senior director"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Software architect", "value": "software architect"}, {"text": "Solution consultant", "value": "solution consultant"}, {"text": "System administrator", "value": "system administrator"}, {"text": "System architect", "value": "system architect"}, {"text": "System engineer", "value": "system engineer"}, {"text": "Systems analyst", "value": "systems analyst"}, {"text": "Systems architect", "value": "systems architect"}, {"text": "Technical trainer", "value": "technical trainer"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Accounting", "value": "/business/naics2007/5412"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Management", "value": "/business/naics2007/55"}, {"text": "Real Estate", "value": "/business/naics2007/53"}, {"text": "Wholesale", "value": "/business/naics2007/42"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Amazon", "value": "/m/0mgkg"}, {"text": "Microsoft", "value": "/m/04sv4"}, {"text": "EPAM Systems", "value": "/m/0dlnrc"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "IBM", "value": "/m/03sc8"}, {"text": "Salesforce", "value": "/m/07btr5"}, {"text": "EY", "value": "/m/0g9jc"}, {"text": "Publicis Sapient", "value": "/m/02myjp"}, {"text": "Randstad", "value": "/m/08pt1z"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Alibaba Group Holding Limited", "value": "/m/07s6ctl"}, {"text": "Avanade", "value": "/m/094456"}, {"text": "Capgemini", "value": "/m/03vlk0"}, {"text": "Comtel Solutions Pte Ltd", "value": "/g/11dxpztgnb"}, {"text": "DELL", "value": "/g/11c54ch2jm"}, {"text": "Ericsson", "value": "/m/02kyh"}, {"text": "HTZ Resources", "value": "/g/11h21p9b4d"}, {"text": "Infinite Computer Solutions Pte Ltd", "value": "/g/11g9mj72yz"}, {"text": "Michael Page", "value": "/m/04cxldw"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "Orange Business Services", "value": "/m/08zvyz"}, {"text": "Recruitment Hub Asia Pte Ltd", "value": "/g/11dxpww_0f"}, {"text": "TEKsystems (Allegis Group Singapore Pte Ltd)", "value": "/g/11b6g4bkv0"}, {"text": "Talent Trader Group Pte Ltd", "value": "/g/11dxpmlc5b"}, {"text": "Tata Consultancy Services", "value": "/m/01psx8"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "Verizon", "value": "/m/07_dn"}, {"text": "A-Speed Infotech Pte Ltd", "value": "/g/11g9mxswl4"}, {"text": "ABeam Consulting", "value": "/g/11bc6whr_f"}, {"text": "Amazon Web Services (AWS)", "value": "/g/11dxprr2xv"}, {"text": "Amazon Web Services Singapore", "value": "/m/0rznzt1"}, {"text": "Aon", "value": "/m/0z7n"}, {"text": "Avaya", "value": "/m/01sqlk"}, {"text": "Azendian Solutions Pte Ltd", "value": "/g/11dxpvcjj2"}, {"text": "Big Cloud", "value": "/g/11c743lwsr"}]}]}