{"search_metadata": {"id": "60827a7d1baebb75ff30f20f", "status": "Success", "json_endpoint": "https://serpapi.com/searches/85ef34e40c8a2619/60827a7d1baebb75ff30f20f.json", "created_at": "2021-04-23 07:42:53 UTC", "processed_at": "2021-04-23 07:42:53 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28IT+analyst%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=120", "raw_html_file": "https://serpapi.com/searches/85ef34e40c8a2619/60827a7d1baebb75ff30f20f.html", "total_time_taken": 5.51}, "search_parameters": {"q": "(IT analyst) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "120"}, "jobs_results": [{"title": "Senior / Data Analyst", "company_name": "EPAM Systems", "location": "Singapore", "via": "via NodeFlair", "description": "We are looking for an experienced\nSenior / Data Analyst\nin Singapore to make our team stronger.\n\nResponsibilities\n• Provide consultancies on data solutioning\n• Be the bridge between the technical team and business units\n• Team will range a diverse set of roles – Engineers, data scientists, analysts, machine learning, business, etc\n• Articulate problems, solutions and functionalities to users and tech team alike\n• Resolve data related issues end to end\n\nRequirements\n• Polytechnic Diploma or above in Computer Science\n• 5+ years of experience in software engineering and Big Data\n• Advanced knowledge at least one programming language such as Java, Python, Scala\n• Familiar with SQL, Bash\n• Experienced in any of big data technologies and frameworks below:\n• Spark, Spark Streaming, Kafka/ Kafka Streams, Hadoop, Yarn, HDFS, Hive, Airflow, Jupyter\n• Parquet, ORC, AVRO, CarbonData\n• Lambda, Kappa, Data Lake\n• NoSQL Data Bases\n• Data platform\n• Understanding of Agile and implementation of CI/CD... pipeline\n• Experienced working and onboarding multiple data sources\n• Able to model, ingest, process, and build required output dashboards. Machine learning angle and approach required\n• Experience with integrating different data and cloud platforms\n• Strong stakeholder managements\n\nWe offer\n• Friendly team and enjoyable working environment\n• Work-life balance and flexible schedule\n• Online training library, mentoring, career development and potential partial grant of certification\n• Unlimited access to LinkedIn learning solutions\n• Referral bonuses\n• Compensation for sick leave and paid time off\n• Opportunities for self-realization", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgLyBEYXRhIEFuYWx5c3QiLCJjb21wYW55X25hbWUiOiJFUEFNIFN5c3RlbXMiLCJjb21wYW55X21pZCI6Ii9tLzBkbG5yYyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Im5GbUREeTRpbC03cGRia3NBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhWRU0yVTNsUU5XaFNPV2d4YzJ3d2QxQkhjWGRTY1dsNFNUSlNMWEZhT0hGU1kwaEJNRU0xY0ZSQlF6RjRiMWd3VURsalRIVTNWVVJITjJKWGVVNXhRbXhJZUdGM1UxWlFiR1JmYTNGM2FYVTRhRVJ5WlhsR2ExRjROVGxtUzJaSE1XcDRUa2N4Y25SMk1YUTVVMU41UzNOM05uQlBVVEYyU210NlpXZGxTVk4zWHpWU2EwOVpSa1JZY2tOV2JVcHdjM2RyTld0eGQwMVVjbFZSRWhabldIRkRXVXhUZWswNGRsUXRaMU0wTnpVeVFVRjNHaUpCVDAxWlVuZEJTREJGT0VFMlFtSTFVbVpKWlUxb2VIZFVTekZLUWtNMlF5MTMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY183IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE5vZGVGbGFpciIsImxpbmsiOiJodHRwczovL3d3dy5ub2RlZmxhaXIuY29tL2pvYnMvbGlzdGluZ3MvNzYyMD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Information Technology Analyst / Senior Analyst / Lead Analyst, Workday, Project Cumulus #sgunited #publicservice", "company_name": "Public Service Division", "location": "Singapore (+1 other)", "via": "via MNC Jobs Singapore | MNC Jobs In Singapore", "description": "As part of Public Sector Transformation, PSD is working with various stakeholders to on-board close to 40 Statutory Boards by phases onto Workday, a Cloud Human Capital Management (HCM) / Enterprise Resource Planning (ERP) Saas Suite. The roll-out will bring about changes in business processes, systems and technology, job roles and organisation structures, and you will be at the forefront of these changes!\nPSD engages a diverse group of stakeholders, including the Systems Integrator, the government in-house Shared Services VITAL, the HR Policy teams and other government agencies, to plan the subsequent activities to ensure the successful adoption of the new cloud-based system, transition of workforce, achievement of benefit realization, etc.\nWe believe in supporting you to develop professionally and personally. Beyond opportunities for on-the-job training and formal Workday Certification, there are attachment programmes to other stakeholders, be involved in other parts of the project... and gain a more holistic experience.\nResponsibilities\n\nFor Statutory Boards in the Implementation Phase\n• Translate policy intent and directions into applicable systems solutions for customers and stakeholders, and where necessary, propose new work processes to ensure the most effective and efficient method for implementation.\n• Together with central government stakeholders, supporting the HR system architectural design for statutory boards while ensuring alignment with the business objectives.\n• Configuration and testing of the systems, including the integrations of the core HR system with other third party or custom solutions.\n• Ensure that data migration, data cleansing and data mapping work are well executed\n• Develop best practice documents, workflows and manuals applicable to the statutory boards.\n• Users training and engagement to ensure a successful deployment of the HR system.\n\nFor Statutory Boards in the Maintenance Phase\n• Provide post-implementation support for the initial trouble-shooting and issue identification. If further technical support is necessary, to work with the System Integrator for possible solutioning, system re-configuration or adjustments.\n• Support system enhancement evaluate new releases’ capabilities and assess the impact on current processes.\n• Review of documents, workflows and manuals where necessary.\n\nOther Project Matters\n• Establish and maintain scalable processes that ensure best practices in HR.\n• Identify opportunities for business process re-engineering (BPR) initiatives for productivity improvement, via transforming, streamlining and continuous improvement of work processes.\n\nRequirements\n\n[Values]\nWe are looking for self-motivated individuals who value integrity, teamwork and take pride in going the extra mile to provide excellent service.\n[Work Experience & Competencies]\nAn ideal candidate should possess the following:\n• [Thinking Clearly and Making Sound Judgement] Ability to examine complex problems and propose possible solutions, demonstrating good problem solving and root cause identification skills.\n• [Working Effectively with Stakeholders] Strong communications and stakeholder management skills, adept at exploring issues from a user-centric perspective and contributing to a collaborative working environment.\n• [Improving and Innovating Continuously] Possesses a mindset of continuous improvement, recommend and explore fresh ideas that may not have been tried and tested.\n• [Project Management] Good project management skills to effectively manage project milestones, timeline and drive initiatives.\n• [Application Software Development] Experience or knowledge in application software development, with interest to design and develop applications to meet users’ needs.\n• [Information Technology] Some knowledge of IT governance processes and policies, with keen interest in leveraging technology to solve business problems on the ground.\n• [Java Programming] Preferably possesses technical skills in Java Programming.\n• [Experience in ERP implementation] Experience in the implementation of cloud SaaS or other ERP products, including Workday and Excelity payroll will be an added advantage.\n\nApplicants with no prior experience are also welcome to apply.\n[Personal Traits]\n• Passion in technology with a desire for continuous improvement\n• Agile and adaptable\n• Able to proactively develop and manage relationships with key stakeholders\n• Strong negotiation, conflict resolution, influencing, and stakeholder management skills\n• Organised, meticulous and able to multi-task\n• Good team player who is able to thrive in a fast-paced environment\n\nOnly shortlisted applicants will be notified within 2 weeks after closing date.\n\nSuccessful candidates will be offered a 2-year contract.\n\nminimumYearsExperience : 0\n\n[CANDIDATES WHO REQUIRE WORK PASSES NEED NOT APPLY", "extensions": ["7 days ago", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJJbmZvcm1hdGlvbiBUZWNobm9sb2d5IEFuYWx5c3QgLyBTZW5pb3IgQW5hbHlzdCAvIExlYWQgQW5hbHlzdCwgV29ya2RheSwgUHJvamVjdCBDdW11bHVzICNzZ3VuaXRlZCAjcHVibGljc2VydmljZSIsImNvbXBhbnlfbmFtZSI6IlB1YmxpYyBTZXJ2aWNlIERpdmlzaW9uIiwiY29tcGFueV9taWQiOiIvZy8xMWc2X19idjEwIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiRVBmNmxNVzlQZk91MG9TMUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRW9zQ0Nzd0JRVTVWWDA1eFVtNWhXa1ozYzFSSlNVMVNZblV0VFZwMkxXWmhNMmhoZVdreU5tSjVSR1YwVEVWbVYxZFBaRTQyTTJZNFduTkhXa0p5WDFSYWNuQkdiWFo2Wm1Ga05FRTVPVEV4V0RaSFUwSTROMmh6VUV4NGVXZzVZbTlwVnpOT1EzZFFjek5RU0d0dWF6ZEhkR2xRTWtGWk1FSkdiV1EwVlY5MFRtVXpZMUJxTkVreFVsWkllV1JWTXpWVVVXTnFhak5xYW05cFZFcHBWVkExYWxKcU1XSmtSMnhKVW1KVWFXTTRiMlZCUTNweldrRmFPVWhWVERZME5WSkdWSEZGVm1aS2QzWmpVRUphVmxkWkVoWm5XSEZEV1V4VGVrMDRkbFF0WjFNME56VXlRVUYzR2lKQlQwMVpVbmRFWlhKdlkwd3pRa05zWm1KMFJYZHFMV3A0UVZkUmREWlhlbDlSIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMTQiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTU5DIEpvYnMgU2luZ2Fwb3JlIHwgTU5DIEpvYnMgSW4gU2luZ2Fwb3JlIiwibGluayI6Imh0dHBzOi8vc2cubW5jam9iei5jb20vam9icy9pbmZvcm1hdGlvbi10ZWNobm9sb2d5LWFuYWx5c3Qtc2VuaW9yLWFuYWx5c3QtbGVhZC1hbmFseXN0LXdvcmtkYXktcHJvamVjdC1jdW11bHVzLXNndW5pdGVkLXB1YmxpY3NlcnZpY2Utc2luZ2Fwb3JlLTIyMTU1OD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Junior  Senior Business Analyst", "company_name": "Thatz Resources Pte Ltd", "location": "Singapore", "via": "via Jobs | Fidanto", "description": "Are you seeking the new norm career opportunities?\n\nWe are assisting Thatz International Pte Ltd to identify suitable talents to grow their business in the new norm. Talent selected will be placed with them to carry out their Next-Generation ICT Engagement and Consultancy (Thatz 2.0) or Outsourcing business.\n\nWho we are\n\nThatz Resources Pte Ltd (Agency License No. 04S4557) has been established since the Year 2000 to recruit the right IT candidate that meets our clients’ requirements at all levels. We always have great success in matching the best candidate with the job openings.\n\nOur DELIVERIES:\n\nQuality\n\nSpeed\n\nTechnology\n\nRight Pricing\n\nUser eXperience\n\nOur CORE VALUES:\n\nIntegrity\n\nSystem\n\nConsistency\n\nForward Looking\n\nHumanity, and\n\nEnvironmental Friendly\n\nJunior / Senior Business Analyst\n\nJob Title: Junior / Senior Business Analyst\n\nWork Location: Central Singapore\n\nJob Type: 3 Years Contract, subject to renewal\n\nAbout the Job\n\nPrimary Responsibilities:\n\nElicit, scope and manage... the Agency’s business requirements\n\nDevelop the business case and Tender Specifications\n\nEvaluate and recommend ICT solutions that best address the needs\n\nPrioritise product backlog through rigorous information gathering and analysis with stakeholders, and contribute to the development of the Functional/ Design specifications\n\nReview testing and data conversion documents to verify that specifications are met\n\nDrive smooth deployment, adoption and operations of the solution analyse impact of requested changes (Operations & Maintenance phase)\n\nWork with developers to understand and troubleshoot technical problems, as needed (Operations & Maintenance phase)\n\nJob Requirements:\n\nDegree or Diploma in Computer Science, Information Systems, Information/Infocomm Technology, Computer or Electronics Engineering or related discipline\n\nMinimum 3 years of working experience for Consultant and 5 years of working experience for Senior Consultant\n\nParticipated in full software or product development cycles, preferably using Agile Methodology with past development experience\n\nProven experience in IT business analysis, application solutioning and design, and testing\n\nStrong analytical, conceptualisation and problem-solving skills\n\nExcellent communication skills, both oral and written, with the ability to pitch ideas and influence stakeholders\n\nAdvantageous to have\n\nConsulting or Business Analysis experience\n\nBusiness Analysis certification (Certification of Competency in Business Analysis™ (CCBA®), Certified Business Analysis Professional™ (CBAP®)).\n\nKnowledge of, or experience in implementing projects in at least one of the following areas (Data Analytics, Agile Methodologies, Internet and Mobile Technologies, Customer Relationship Management, Knowledge Management, Service Design, Cloud Solutioning.\n\nLocals preferred (SPRs are welcome to apply).\n\nWhat’s in it for you?\n\nIt’s important each and every employee feels they are supported and can complete their life’s best work today and in the future. We are investing in each person not only with competitive compensation, but also with industry benefits and perks. A few ways we support our employees is by offering:\n\nCompetitive Salary\n\nH&S Insurance Coverage\n\nAnnual Leave and Medical Benefits\n\nCompany events and annual awards (subject to Covid-19 situation)\n\nCommunity and sustainability support\n\nOther benefits\n\nThe key objective of this role:\n\nTo deliver an Awesome User Experience through result-oriented outcomes with friendly service disposition ...we call it Thatz Way!\n\nARE YOU THATZ ONE?\n\nGet in touch\n\nPrepare your updated resume (please include your notice period, current salary package with full breakdown such as base, incentives, annual wage supplement, etc.), and expected package.\n\nApply through this application or send your resume to\n\nAll shortlisted candidates will be contacted\n\nAs an advocate for fair employment, we strive to do our best to render objective and merit-based considerations for all applications, and we shall communicate with you when short-listed. All qualified applicants will receive consideration for employment without regard to race, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. For those who are not short-listed, your profile will be kept for other opportunities where suitable.\n\nPlease note that your response to this job advertisement and communications with us according to this job advertisement will constitute an informed consent by you to the collection, usage, and/or disclosure of your personal data by Thatz Resources Pte Ltd and her customers to carry out its business in compliance with the relevant provisions of the Personal Data Protection Act.\n\nBest wishes for your job search!\n\nFeel free to recommend this position to your friend(s) or relative(s) who may meet our needs and get rewarded.\n\nFor more information about THATZ and other job listings, please visit: www.thatz.com\nDiploma, Bachelor's / Honours", "extensions": ["3 days ago", "$2.7K a month", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time", "salary": "$2.7K a month"}, "job_id": "eyJqb2JfdGl0bGUiOiJKdW5pb3IgIFNlbmlvciBCdXNpbmVzcyBBbmFseXN0IiwiY29tcGFueV9uYW1lIjoiVGhhdHogUmVzb3VyY2VzIFB0ZSBMdGQiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IkNtR2FOTXhqLWJ3Q1dlTl9BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9icyB8IEZpZGFudG8iLCJsaW5rIjoiaHR0cHM6Ly9zZy5maWRhbnRvLmNvbS9qb2JzL2pvYi1vcGVuaW5nL2J1c2luZXNzLWludGVsbGlnZW5jZS1hbmFseXN0cy9qdW5pb3Itc2VuaW9yLWJ1c2luZXNzLWFuYWx5c3QtMjc3MzY0NTI5P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "IT Senior Business Analyst (Renewable Contract)", "company_name": "Mason & Co Pte Ltd", "location": "Singapore", "via": "via Joblum Singapore", "description": "The Business Analyst/Senior Business Analyst is the main liaison between the business and IT in translating business needs into system solutions. The candidate is required to conduct research on client’s business needs, processes, requirements and its traceability. Develop and communicate effective system solutions.\nThe person should possess an analytical mind and is able to see interconnections in system solutions and usability. Also, should adopt a systematic approach in addressing complex issues with good judgement and arrive at effective solutions.\nStakeholder Management:\nManage stakeholder expectations and needs by aligning those with requirements and objectives of the organisation. This involves planning of actions to effectively communicate with, negotiate with and influence stakeholders\nRequirements\n• Bachelor’s degree in Computer-related discipline or equivalent\n• Minimum 8 years of IT experience\n• Minimum 6 years of IT Business Analysis experience\n• Minimum 2 years working... in Agile development projects experience\n• Certified Business Analyst (CBA) certification will be an added advantage\n• Experience in developing Agile and/or UML requirements artifacts is mandatory\n• Preference will be given to candidate with the following skillset\n• Liaise with stakeholders to identify business needs\n• Review existing business processes to identify opportunities\nStakeholder Management:\nManage stakeholder expectations and needs by aligning those with requirements and objectives of the organisation. This involves planning of actions to effectively communicate with, negotiate with and influence stakeholders", "extensions": ["25 days ago", "$5K–$8K a month", "Full–time"], "detected_extensions": {"posted_at": "25 days ago", "schedule_type": "Full–time", "salary": "$5K–$8K a month"}, "job_id": "eyJqb2JfdGl0bGUiOiJJVCBTZW5pb3IgQnVzaW5lc3MgQW5hbHlzdCAoUmVuZXdhYmxlIENvbnRyYWN0KSIsImNvbXBhbnlfbmFtZSI6Ik1hc29uIFx1MDAyNiBDbyBQdGUgTHRkIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJtZjBnNDg5cUhENGxuZnhDQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYmx1bSBTaW5nYXBvcmUiLCJsaW5rIjoiaHR0cHM6Ly9zZy5qb2JsdW0uY29tL2pvYi9pdC1zZW5pb3ItYnVzaW5lc3MtYW5hbHlzdC1yZW5ld2FibGUtY29udHJhY3QvNTg2ODYwP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Carbon Accounting Analyst", "company_name": "Climate Resources Exchange", "location": "Singapore (+1 other)", "via": "via Glints", "description": "If you are a Singaporean or a Permanent Resident or a Dependent Pass holder with any of the following:\n• Degree in Bachelor of Science & Environmental Earth Systems Science\n• Degree in Carbon Trading\n• Degree in Carbon Financing\n• Degree in Clean Energy\n• Degree in Economics\n• Degree in Environmental Engineering\n• Degree in Environmental Law\n• Degree in Environmental Studies\n• Degree in Green Building and Sustainability\n• Degree in IFM\n• Any related degree with specificity in Carbon Emissions:\n\nWe are keen on discussing the following Job Description with you, which would progress our initiatives in carbon emissions, it’s benefits to customers, and to your own accomplishments.\n\nYou would achieve this by taking ownership of the following:\n\n• Analyzing and preparing data for reports of emissions streams: Scope 1 – 3 under the GHG Protocol to be verified and certified under ISO14064 for corporate and industrial clients\n\n• Making presentations to clients, closing carbon profile contracts... reporting to clients and actively participating during workshops and trade-shows, including:\n• Drafting technical proposals for clients with respect to carbon profiling, originating carbon emission reduction projects under the CDM-UNFCCC as well as VCS\n• Drafting technical proposals for conducting resource efficiency studies (including energy efficiency and decarbonization pathways)\n• Developing reports for clients' embodied carbon and operational carbon generated in new developments\n• Developing scenarios for carbon pricing for organizations and industries\n\nPreferred attributes:\n• Experience exceeding 5 years in this field\n• A good understanding of climate change sciences and international policy development\n• An understanding of the Singapore Carbon Pricing Act and Article 6 of the Paris Agreement\n• An understanding of carbon trading and carbon pricing\n• A genuine passion for climate change mitigation\n• Leadership skills\n• Diligence in providing timesheets for each and every project\n• The ability to take an initiative in recognizing new business opportunities\n• A go-getter\n• Self-motivated, including the Ability to work from offices and remotely as required\n• working as a team-player and independently as well\n• Holding a valid Passport and a willingness to travel globally (post covid-19)\n\nRemuneration:\n• Remuneration is based on qualification, experience and ability to produce results. The position is with commission on sales and additional to base salary.\n• A Basic Salary with expenses including travel and work-related meetings\n• Bonus on an annual net-revenue performance, depending on work performance\n• Share Options in the company in accordance with the constitution of the company discussed when deemed appropriate\n\nApplication:\n• Please send your CV with a cover letter and a recent photograph, indicating your expected salary.\n• Interested individuals may apply directly to v.kesava@climate-resources.com\n• Only Singaporeans or Permanent Residents or Dependent Pass holders can be considered for this position", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDYXJib24gQWNjb3VudGluZyBBbmFseXN0IiwiY29tcGFueV9uYW1lIjoiQ2xpbWF0ZSBSZXNvdXJjZXMgRXhjaGFuZ2UiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IlBaR21fMWFXXzJxR0VuR2tBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gR2xpbnRzIiwibGluayI6Imh0dHBzOi8vZ2xpbnRzLmNvbS9vcHBvcnR1bml0aWVzL2pvYnMvY2FyYm9uLWFjY291bnRpbmctYW5hbHlzdC8xOTFjNDNiYi05MDczLTRmMTEtYjBjYS1iYWFjZDBkMTU4Mjc/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Senior Wealth Business IT Analyst and Business Project Manager", "company_name": "Citi bank", "location": "Singapore", "via": "via Bayt.com", "description": "Responsibilities:\n• Provide direction and technical leadership on complex, high-impact projects and in all phases of the development and implementation process, ensuring essential procedures are followed\n• Provide evaluative judgment based on analysis of information in complicated and unique situations and contribute to formulation of standards and strategies for own area and other functional areas\n• Resolve issues that have impact beyond own area and apply in-depth understanding of concepts and procedures within own area and basic knowledge of other areas\n• Work as a team to achieve objectives and negotiate with internal and external parties\n• Has the ability to operate with a limited level of direct supervision.\n• Can exercise independence of judgement and autonomy.\n• Acts as SME to senior stakeholders and /or other team members\n• This position will also support Consumer and Off-shore business on Technical Management topic and issue that require interfacing with other Citi... Technology arms\n• Appropriately assess risk when business decisions are made, demonstrating particular consideration for the firm's reputation and safeguarding Citigroup, its clients and assets, by driving compliance with applicable laws, rules and regulations, adhering to Policy, applying sound ethical judgment regarding personal behavior, conduct and business practices, and escalating, managing and reporting control issues with transparency, as well as effectively supervise the activity of others and create accountability with those who fail to maintain these standards.\n\nQualifications:\n• At least 12 years of experience in technology related role\n• Degree in Information Technology, Computer science or other relevant computing discipline\n• Candidate with wealth management or insurance products knowledge will be preferred.\n• Familiar with project management processes and software development lifecycle\n• Demonstrated leadership skills\n• Consistently demonstrate clear and concise written and verbal communication\n• Proven interpersonal skills with ability to partner and influence across organizational lines\n• Proven ability of using complex analytical, interpretive and problem-solving techniques\n• Single Point of Contact for any escalation on technology issue\n• Engage business product managers and process owners to define go-to digital model and strategy\n• Work with Technology Risk and Business CBORC to ensure business and technology risks are addressed\n• Managing the execution of digital adoption programs\n• Measuring the Return Of Investment of digital adoption initiatives\n\n-------------------------------------------------\n\nJob Family Group:\n\nTechnology\n\n-------------------------------------------------\n\nJob Family:\n\nBusiness Analysis / Client Services\n\n------------------------------------------------------\n\nTime Type:\n\n------------------------------------------------------\n\nCiti is an equal opportunity and affirmative action employer.\n\nQualified applicants will receive consideration without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.\n\nCitigroup Inc. and its subsidiaries (\"Citi”) invite all qualified interested applicants to apply for career opportunities. If you are a person with a disability and need a reasonable accommodation to use our search tools and/or apply for a career opportunity review Accessibility at Citi.\n\nView the \"EEO is the Law\" poster. View the EEO is the Law Supplement.\n\nView the EEO Policy Statement.\n\nView the Pay Transparency Posting", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgV2VhbHRoIEJ1c2luZXNzIElUIEFuYWx5c3QgYW5kIEJ1c2luZXNzIFByb2plY3QgTWFuYWdlciIsImNvbXBhbnlfbmFtZSI6IkNpdGkgYmFuayIsImNvbXBhbnlfbWlkIjoiL20vMDFkZmI2IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiZFlXVklqTU1MNlpTWUxzcEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFZFNVZkalJNYldSR1ZVeEpOa2hFVkhKQ1pXSkhOalUxVURSdVdVY3hObkE1UjJ4NlVtVmtOamxxV2tzNVZrTjVaRlJNV21kYWVYQTRTRUZRUzA5d05FWkphRGh6Y0ZOUlVHNTVVMmxNWDJrelZWYzNaMFF4U2xscE1VOU5hVUpqWmkxM2RHbzJWM2huUmpsS1pETk9SRVJRU0VsRlVVdFZhRWxWV1VSR1NGVkVhSFp4TkdvM1RreE1lR1pGYjFkSFZFaElla3B6Um5KdWVWZDNFaFpuV0hGRFdVeFRlazA0ZGxRdFoxTTBOelV5UVVGM0dpSkJUMDFaVW5kRGNWRTVVRlYyWmxkb05tNUtVMWxEZVVWaFZ6TklTRzAyVDJkbiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzM5IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJheXQuY29tIiwibGluayI6Imh0dHBzOi8vd3d3LmJheXQuY29tL2VuL3NpbmdhcG9yZS9qb2JzL3Nlbmlvci13ZWFsdGgtYnVzaW5lc3MtaXQtYW5hbHlzdC1hbmQtYnVzaW5lc3MtcHJvamVjdC1tYW5hZ2VyLTU4ODYxMTAxLz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Analyst / Associate, Trade Services", "company_name": "Mizuho Bank", "location": "Singapore", "via": "via EFinancialCareers", "description": "Asia & Oceania Administration Department - Trade Services\n\nOverview of Division/Department\n\nOur Trade Services (TRS), a member of our Asia & Oceania Administration Department, is responsible for handling all trade related transactions which includes checking of documentary credits/collections, invoice financing relating to goods and services, freight financing, trust receipt etc.\n\nCompany Profile\nMizuho Bank, Ltd. is a subsidiary of the Japan-based Mizuho Financial Group, Inc. (listed on the Tokyo Stock Exchange and NYSE) and is one of the largest financial services companies in the world. Mizuho Bank, Ltd. provides financial and strategic solutions for the increasingly diverse and sophisticated needs of its clients with offices located in all the major cities of the world such as Tokyo, New York, London, Hong Kong and Singapore.\n\nJob Responsibilities\nYour key roles & responsibilities include:\n\n1. Processing and checking all transactions assigned and manage the various processing... using local systems\n2. Managing various TAPS processes, reconciliation of documents daily counts and to perform EOD operations\n3. Performing housekeeping for the team\n4. Reporting cases of error and incident nature to team leader\n5. Performing doc checking function per checking limit matrix\n6. Perform follow up/tracing on outstanding items\n7. Supporting other staff in case of need\n8. Providing guidance to junior staff\n9. Adhering to HOP and IOP (not limited to Part 8 where applicable)\n10. Participating in project/ad hoc work as assigned\n11. To man the counter/DHL desk\n\nJob Requirements\nWhat you should have:\n• A Bachelor Degree with at least three year of relevant experience\n• Strong leadership, meticulous and ability to multitask are attributes that will help the candidate perform successfully in this role.\n• Additional professional qualification of Certified Documentary Credit Specialist (CDCS) would be advantageous\n\nJoin Mizuho Bank, Ltd., in Singapore, and be part of our expanding team, passionate to build the future together. \"One MIZUHO: Building the future with you", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBbmFseXN0IC8gQXNzb2NpYXRlLCBUcmFkZSBTZXJ2aWNlcyIsImNvbXBhbnlfbmFtZSI6Ik1penVobyBCYW5rIiwiY29tcGFueV9taWQiOiIvbS8wMjIxMDMiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJLdTlKVzJuMEFGX3BUS2lMQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VVdwSWExTm5TalpsVTJwb1VGOTVMVTFUWjA4ME9XOTJUeTFEVkRRdE5XSkxZa3A2ZEd0c05HZGFhblZTYm5Obk9GcEJkbVpqUVZZeGJsVjRlbk5IVVRWV1lUZGlSMWt3ZVZkSmVWcHBVSFoxWjBGVmFrTTFWVFl6VEhSdVpGbFhOVXB3Vkc1MGVrdHZlRWN6YVZoMWRGQjBjMFUyTUV4R1EyWkdaM3B6TTFOWVpGUk1RMUp4V1RrNWNWUkJZVXN0ZGpCRFJYcEdWeTAzZUhGUkVoWm5XSEZEV1V4VGVrMDRkbFF0WjFNME56VXlRVUYzR2lKQlQwMVpVbmREV0VzdFZVSjZVR3RhUVhsUWFHeHhPVjh4T1RkdlkyTnFRVFJuIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNDciLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gRUZpbmFuY2lhbENhcmVlcnMiLCJsaW5rIjoiaHR0cHM6Ly93d3cuZWZpbmFuY2lhbGNhcmVlcnMuc2cvam9icy1TaW5nYXBvcmUtU2luZ2Fwb3JlLUFuYWx5c3RfX0Fzc29jaWF0ZV9UcmFkZV9TZXJ2aWNlcy5pZDEwNzU4MDU3P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Market Data Business Analyst", "company_name": "Jobs via eFinancialCareers", "location": "Singapore", "via": "via LinkedIn", "description": "More About This Job\n\nYOUR IMPACT\n\nThe Market Data Business Analyst team at Goldman Sachs are responsible for coordinating with internal business teams on the selection of products and ongoing management of the Firm's market data spend with third party vendors. The team provide guidance to internal users on data services appropriate for specific roles, coordinate expense management initiatives and provide data analytics to enable users to manage costs effectively.\n\nThe role provides the opportunity to directly contribute to managing the firms operating costs by building data analytics and automated workflow that help end-users to manage their market data subscriptions effectively. You will be responsible for developing data collection, modelling and visualization analytics that correlate usage with user inventories. The role will provide the opportunity to partner with divisional management and business unit leadership teams to implement expense management initiatives.\n\nHow Will You... Fulfill Your Potential\n\nRESPONSIBILITIES AND QUALIFICATIONS\n• You will thrive in a work environment that requires strong problem solving skills and independent self-direction, coupled with an aptitude for team collaboration and open communication\n• Driving strategic initiatives and deliver key programs of work across Market Data and the broader division\n• Your detailed knowledge of market data vendor products and an understanding of the Goldman Sachs business functions will enable you to formulate strategies to reduce operating expenses\n• Building data analytics using popular storage and visualization technologies to empower market data users to manage their costs\n• Interface with divisional leadership and front office users to implement expense management initiatives\n• Continually evaluate the vendor landscape to identify new offerings that may increase value and efficiency for our employees who require access to market data\nBASIC QUALIFICATIONS\n• 2 years minimum experience in Market Data\n• Python and SQL programming skills\n• Experience of publishing and modeling data with distributed storage platforms such as Hadoop\n• Experience with using visualization software (Tableau, Qlikview or equivalent)\n• Japanese language\nPREFERRED QUALIFICATIONS\n• FISD's Financial Information Associate certification\n• Proficient use of tier 1 market data vendor desktop software\n• General understanding of the capital markets\n• Experience of the MDSL MDM inventory system\n\nAbout Goldman Sachs\n\nABOUT GOLDMAN SACHS\n\nAt Goldman Sachs, we commit our people, capital and ideas to help our clients, shareholders and the communities we serve to grow. Founded in 1869, we are a leading global investment banking, securities and investment management firm. Headquartered in New York, we maintain offices around the world.\n\nWe believe who you are makes you better at what you do. We're committed to fostering and advancing diversity and inclusion in our own workplace and beyond by ensuring every individual within our firm has a number of opportunities to grow professionally and personally, from our training and development opportunities and firmwide networks to benefits, wellness and personal finance offerings and mindfulness programs. Learn more about our culture, benefits, and people at GS.com/careers .\n\nWe're committed to finding reasonable accommodations for candidates with special needs or disabilities during our recruiting process. Learn more: https:// www.goldmansachs.com/careers/footer/disability-statement.html\n\n© The Goldman Sachs Group, Inc., 2021. All rights reserved.\nGoldman Sachs is an equal employment/affirmative action employer Female/Minority/Disability/Veteran/Sexual Orientation/Gender Identity", "extensions": ["2 days ago", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJNYXJrZXQgRGF0YSBCdXNpbmVzcyBBbmFseXN0IiwiY29tcGFueV9uYW1lIjoiSm9icyB2aWEgZUZpbmFuY2lhbENhcmVlcnMiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IlYydVk5R093ZHU1Z09xcGZBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGlua2VkSW4iLCJsaW5rIjoiaHR0cHM6Ly9zZy5saW5rZWRpbi5jb20vam9icy92aWV3L21hcmtldC1kYXRhLWJ1c2luZXNzLWFuYWx5c3QtYXQtam9icy12aWEtZWZpbmFuY2lhbGNhcmVlcnMtMjUxMjY5NzcwNj9yZWZJZD05Nzc3YjQ4MS1hMWY5LTQ2YmQtODEzMi1hYTI2NDNlYmIxZjJcdTAwMjZ0cmFja2luZ0lkPWpwUUlpeTlDclBUTVQyUlZUWTRYL0ElM0QlM0RcdTAwMjZ1dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Payments Technical Architect - Analyst", "company_name": "Evolution Recruitment Solutions PTE. LTD", "location": "Singapore (+1 other)", "via": "via Monster Singapore", "description": "Job Description :\nWe are looking for a strong technical architect or technical business analyst who comes from a software engineering background and experience in the payments space, specifically in the following areas:\n• Payment Services Provider / PSP onboarding flows\n• Payment Facilitator Onboarding and certification flows\n• Payment Processing Acquiring\n• Card Issuing / Scheme Onboarding (Visa, MasterCard, JCB, ...)\n• Card tokenization and wallet services\n• POS fleet management, rollout and certification (L2 / L3 certification)\n• E-money / wallet (not crypto) architecture\n• Issuer Processing\n• MOTO / Virtual Terminals\n• Core banking / Ledger implementations\n• EMV standards / ISO8583\n\nThis is an excellent opportunity for an ambitious individual to come in and help shape the technical roadmap for a leading payments company. If this sounds like something that you are passionate about and aligned with, please reach out to [Confidential Information]\nPlease contact #ConsultantFirstname... #ConsultantSurname (Reg No. #Consultant_RegNo) at #CompanyName (Licence no. #CompanyLicenceNo", "extensions": ["28 days ago", "Full–time"], "detected_extensions": {"posted_at": "28 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQYXltZW50cyBUZWNobmljYWwgQXJjaGl0ZWN0IC0gQW5hbHlzdCIsImNvbXBhbnlfbmFtZSI6IkV2b2x1dGlvbiBSZWNydWl0bWVudCBTb2x1dGlvbnMgUFRFLiBMVEQiLCJjb21wYW55X21pZCI6Ii9nLzExYzczeThrN2siLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJrWnh4dGFIeVV1OWQzZGo0QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFcllDQ3ZjQlFVNVZYMDV4VTA5b2FqSmZWMVZFVkZoNlZYQk5URTlyWTJ0VE1FSklRVkpRV1VWcGJtVkxOVk5aVG0xWFZVOHhiRTlxWnkxeGNrNXNVbXRSWlVoT1ptMXVRMEkzWldkc1RsRjFaalZHV1VST2JWaG1iVkYyTUZrek9WZG5SbXBFVVVzMk5sZEJUMUZaWTJNNVlsTkxibVI1UlVaUVpqQk9SVEJsTm1SNVFVWXhNbnB1ZW1veFdGOUtRblphVDFaQlRrNTJNR0ppUm1zNGIzZENUa05VYzBnMFVETlRUMnBoT1RaT2N6ZFBhRVp6ZG5wUlZITmFkbVl6TURsRk5sbGpNbDlWT0ZSUVpGbG5kM1F6VTNoQlRHOHpXRzlIYVZadVJUbGtWM05WVVd0cE1VSnplbTFaYUZWc2JtUnJibk15U0RNMU4wNTBZeElXWjFoeFExbE1VM3BOT0haVUxXZFRORGMxTWtGQmR4b2lRVTlOV1ZKM1EzbHhOMFJTY0RjMGNIRTJiMGQyV1dWNWRtRlVVWHAyY25sTVp3IiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNjAiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTW9uc3RlciBTaW5nYXBvcmUiLCJsaW5rIjoiaHR0cHM6Ly93d3cubW9uc3Rlci5jb20uc2cvYW1wL2pvYi12YWNhbmN5LXBheW1lbnRzLXRlY2huaWNhbC1hcmNoaXRlY3QtYW5hbHlzdC1ldm9sdXRpb24tcmVjcnVpdG1lbnQtc29sdXRpb25zLXB0ZS1sdGQtc2luZ2Fwb3JlLTI3NDgxNzUzLmh0bWw/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Business Analyst at Dyson", "company_name": "Dyson", "location": "Singapore", "via": "via BizLINKS Resources Pte Ltd", "description": "Business Analyst at Dyson\n\nJob Description\n\nAutomated And Non Automated Components Of New Or Changed Processes. Assists In The Analysis Of Stakeholder Objectives, And The Underlying Issues Arising From Investigations Into Business Requirements And Problems, And Identifies Options For Consideration. Works Iteratively With Stakeholders, To Identify Potential Benefits And Available Options For Consideration, And In Defining Acceptance Tests. Requirements Definition And Management Reqm :“ Level 3 Defines Scope And Business Priorities For Small Scale Changes And May Assist In Larger Scale Scoping Exercises. Elicits And Discovers Requirements From Operational Management And Other Stakeholders. Selects Appropriate Techniques For The Elicitation Of Detailed Requirements Taking Into Account The Nature Of The Required Changes, Established Practice And The Characteristics And Culture Of Those Providing The Requirements. Specifies And Documents Business Requirements As Directed, Ensuring... Traceability Back To Source. Analyses Them For Adherence To Business Objectives And For Consistency, Challenging Positively As Appropriate. Works With Stakeholders To Prioritise Requirements. Business Modelling :“ Bsmo :“ Level 3 Conversant With Techniques Covering Full Range Of Modelling Situations. Models Current And Desired Scenarios As Directed. Selects Appropriate Modelling Techniques For Meeting Assigned Objectives. Gains Agreement From Subject Matter Experts To Models Produced. Reviews Resulting Models With Stakeholders And Gains Resolution To Resultant Issues. Data Analysis :“ Dtan :“ Level 3 Applies Data Analysis, Data Modelling, And Quality Assurance Techniques, Based Upon A Detailed Understanding Of Business Processes, To Establish, Modify Or Maintain Data Structures And Associated Components (Entity Descriptions, Relationship Descriptions, Attribute Definitions). Advises Database Designers And Other Application Development Team Members On The Details Of Data Structures And Associated Components. About You Essential: Years (>2) Of Broad Practical Experience In The Role, With Repeated Practice Performing Business Analysis In A Variety Of Complex Situations. Knowledge Requirements: Deep Functional Understanding From Sap: Sales And Distribution, Material Management And Logistic. Once Embedded, Will Typically Demonstrate Good Domain And/Or System Knowledge Inside Own Area. Minimal Domain And/Or System Knowledge Outside Of Own Area. Awareness Of The Wide Range Of Activities Performed By Bas. Can Cope With Complex Cases Through Deliberate Analysis And Planning. Can Achieve Excellent Results On Small, Less Complicated Work Without Supervision. Project Implementation Via Agile Or Waterfall And Enhancement Process. Desirable Relevant Professional Qualifications; Including Either: Bcs International Diploma In Business Analysis Or Iiba Level 3 Certified Business Analysis Professional (Cbap) A Willingness To Work Towards More Advanced Qualification Such As: Bcs Advanced International Diploma In Business Analysis Experience Of Working In Matrix Structures, With Cross Functional Teams And Operating Under Both Line Reporting And Project Task Managers Experience Of Working In Agile / Scrum Framework Environments Has Experience With S/4 Hana Implementation. Fmcg Industry Benefits Dyson Singapore Monitors The Market To Ensure Competitive Salaries And Bonuses. Beyond That, You'll Enjoy A Transport Allowance And Comprehensive Medical Care And Insurance. But Financial Benefits Are Just The Start Of A Dyson Career. Professional Growth, Leadership Development And New Opportunities Abound, Driven By Regular Reviews And Dynamic Workshops. And With A Vibrant Culture, The Latest Devices And A Relaxed Dress Code Reflecting Our Engineering Spirit, It's An Exciting Team Environment Geared To Fuelling And Realising Ambition. Show More\n\nOriginal Joblink : https://sg.linkedin.com/jobs/view/business-analyst-at-dyson-2347842856\n\nGoogle Company: https://www.google.com/search?q=Business%20Analyst%20at%20Dyson", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJCdXNpbmVzcyBBbmFseXN0IGF0IER5c29uIiwiY29tcGFueV9uYW1lIjoiRHlzb24iLCJjb21wYW55X21pZCI6Ii9tLzA1Y3NrZyIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IkUxbzNLQnNZYlpoLTFMbmlBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVzc0JDb3dCUVU1VlgwNXhVek5DU0UxU05UbE1VV0YwTnpOeVFtaEZkbGgwZERkalQyNXlNVWcwZWxwbllVdE1XVUZJTVZwb1NXVm5kVmxJWldabVlYRlliVmhaVVRFeWRHNWpaMWhPVFV0WFNrZGlVamMwY1ZKdldVbFpOVkJUVm5WTVpVOXRYelJtVWpSUFYzVmxURjgzWTJad2JrSldUa2g2ZG1OdE9XRklTblJ6TlRSWVVsWlBXSGwzU2tsd2RXVVNGbWRZY1VOWlRGTjZUVGgyVkMxblV6UTNOVEpCUVhjYUlrRlBUVmxTZDBGdGNWVTNXbXQwYzAxa1ZVVnlTRWRPVUhCSFpVSmlaVWRrY1ZFIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNjciLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQml6TElOS1MgUmVzb3VyY2VzIFB0ZSBMdGQiLCJsaW5rIjoiaHR0cHM6Ly93d3cuYml6bGlua3NyZXNvdXJjZXMuY29tLnNnL2luZGV4LnBocC9qb2ItbGlzdGluZ3MtcHVibGljLzkxLWFuYWx5c3RzLzUwNjUtYnVzaW5lc3MtYW5hbHlzdC1hdC1keXNvbj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Business Operations", "value": "GC06"}, {"text": "Accounting and Finance", "value": "GC01"}, {"text": "Science and Engineering", "value": "GC27"}, {"text": "Advertising and Marketing", "value": "GC03"}, {"text": "Customer Service", "value": "GC10"}, {"text": "Protective Services", "value": "GC23"}, {"text": "Legal", "value": "GC17"}, {"text": "Management", "value": "GC18"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Property", "value": "GC24"}, {"text": "Sales and Retail", "value": "GC26"}, {"text": "Social Services and Non-Profit", "value": "GC28"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "Business analyst", "value": "business analyst"}, {"text": "Analyst", "value": "analyst"}, {"text": "Security analyst", "value": "security analyst"}, {"text": "Systems analyst", "value": "systems analyst"}, {"text": "It analyst", "value": "it analyst"}, {"text": "Data analyst", "value": "data analyst"}, {"text": "Support analyst", "value": "support analyst"}, {"text": "System analyst", "value": "system analyst"}, {"text": "Test analyst", "value": "test analyst"}, {"text": "Associate", "value": "associate"}, {"text": "Operations analyst", "value": "operations analyst"}, {"text": "Soc analyst", "value": "soc analyst"}, {"text": "Intelligence analyst", "value": "intelligence analyst"}, {"text": "Management analyst", "value": "management analyst"}, {"text": "Senior", "value": "senior"}, {"text": "Senior analyst", "value": "senior analyst"}, {"text": "Control analyst", "value": "control analyst"}, {"text": "Manager", "value": "manager"}, {"text": "Process analyst", "value": "process analyst"}, {"text": "Project analyst", "value": "project analyst"}, {"text": "Research analyst", "value": "research analyst"}, {"text": "Risk analyst", "value": "risk analyst"}, {"text": "Service analyst", "value": "service analyst"}, {"text": "Technology analyst", "value": "technology analyst"}, {"text": "Accounting analyst", "value": "accounting analyst"}, {"text": "Application analyst", "value": "application analyst"}, {"text": "Behavior analyst", "value": "behavior analyst"}, {"text": "Business", "value": "business"}, {"text": "Center analyst", "value": "center analyst"}, {"text": "Compliance analyst", "value": "compliance analyst"}, {"text": "Coordinator", "value": "coordinator"}, {"text": "Desk", "value": "desk"}, {"text": "Desk analyst", "value": "desk analyst"}, {"text": "Finance analyst", "value": "finance analyst"}, {"text": "Financial analyst", "value": "financial analyst"}, {"text": "Functional analyst", "value": "functional analyst"}, {"text": "Hr analyst", "value": "hr analyst"}, {"text": "Operations assistant", "value": "operations assistant"}, {"text": "Operations center", "value": "operations center"}, {"text": "Programmer analyst", "value": "programmer analyst"}, {"text": "Project manager", "value": "project manager"}, {"text": "Qa analyst", "value": "qa analyst"}, {"text": "Researcher", "value": "researcher"}, {"text": "Senior associate", "value": "senior associate"}, {"text": "Senior consultant", "value": "senior consultant"}, {"text": "Specialist", "value": "specialist"}, {"text": "Sr analyst", "value": "sr analyst"}, {"text": "Support executive", "value": "support executive"}, {"text": "Technical analyst", "value": "technical analyst"}, {"text": "Technical architect", "value": "technical architect"}, {"text": "Trainee", "value": "trainee"}, {"text": "Treasury analyst", "value": "treasury analyst"}, {"text": "Wealth management", "value": "wealth management"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Real Estate", "value": "/business/naics2007/53"}, {"text": "Research", "value": "/business/naics2007/5417"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Engineering Services", "value": "/business/naics2007/5413"}, {"text": "Mining", "value": "/business/naics2007/21"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "SingTel", "value": "/m/020zfl"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "VISA", "value": "/m/01kqjn"}, {"text": "Government Technology Agency", "value": "/g/11gh0528nq"}, {"text": "OCBC", "value": "/m/055r27"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "Trustwave", "value": "/m/0n3xjf5"}, {"text": "Credit Agricole Group", "value": "/m/028vbm"}, {"text": "HSBC", "value": "/m/01vq1f"}, {"text": "Randstad", "value": "/m/08pt1z"}, {"text": "UL", "value": "/m/01q1gj"}, {"text": "American Express", "value": "/m/01w6dw"}, {"text": "Avensys Consulting", "value": "/g/11g7022gjf"}, {"text": "Binance", "value": "/g/11hcz1r4wl"}, {"text": "BlueVoyant", "value": "/g/11h1y4qdlf"}, {"text": "Caterpillar", "value": "/m/0319hp"}, {"text": "Cognizant Singapore, Cognizant Technology Solutions", "value": "/m/03bf9h"}, {"text": "DBS Bank Ltd", "value": "/m/01q7n5"}, {"text": "Deloitte SEA", "value": "/g/11f_g4x9d_"}, {"text": "Dyson", "value": "/m/05cskg"}, {"text": "EPAM Systems", "value": "/m/0dlnrc"}, {"text": "Experis Singapore", "value": "/g/11dxpnwm3s"}, {"text": "Marina Bay Sands Pte Ltd", "value": "/m/09mhd9q"}, {"text": "Medtronic", "value": "/m/03z4j3"}, {"text": "Mizuho Bank", "value": "/m/022103"}, {"text": "NTT MSC", "value": "/g/11fd_nds29"}, {"text": "Public Service Division", "value": "/g/11g6__bv10"}, {"text": "RECRUIT EXPRESS PTE LTD", "value": "/g/11g706hzhq"}, {"text": "RHB Singapore", "value": "/g/11c73srg7f"}, {"text": "Randstad Singapore", "value": "/g/11g70b50mr"}, {"text": "SITA", "value": "/m/06l20z"}, {"text": "Selby Jennings", "value": "/g/11fy2ds3gn"}, {"text": "Standard Chartered", "value": "/m/02hszk"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "Xcellink Pte Ltd", "value": "/g/11c73prcqy"}, {"text": "Xilinx", "value": "/m/03dwkc"}, {"text": "103 Golden Agri International Pte Ltd", "value": "/g/11fy210tb9"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Activate Interactive Pte Ltd", "value": "/g/11dxq192l5"}, {"text": "Amazon", "value": "/m/0mgkg"}, {"text": "Apple", "value": "/m/0k8z"}]}]}