{"search_metadata": {"id": "60827a2f23488473e48c2dab", "status": "Success", "json_endpoint": "https://serpapi.com/searches/42f1bd865b714935/60827a2f23488473e48c2dab.json", "created_at": "2021-04-23 07:41:35 UTC", "processed_at": "2021-04-23 07:41:35 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28project+manager%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=100", "raw_html_file": "https://serpapi.com/searches/42f1bd865b714935/60827a2f23488473e48c2dab.html", "total_time_taken": 6.57}, "search_parameters": {"q": "(project manager) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "100"}, "jobs_results": [{"title": "Infrastructure Project Manager", "company_name": "Sciente Inc", "location": "Singapore", "via": "via SCIENTE", "description": "We have an excellent opportunity for an Infrastructure PM with forward looking vision and knowledge, experience and qualities to lead the transformation of our technical infrastructure with cloud capabilities to better support the applications and businesses.\n\nMandatory Skill(s)\n• Degree in Information Technology, Computer Engineering, Computer Science or Information System;\n• Has at least 5 years of working experience as a Project Manager;\n• Strong knowledge and understanding of IT infrastructure technologies, trends and practices;\n• Has broad understanding on different aspects of infrastructure including Cloud related;\n• Proven project management experience managing technically medium to complex, cross-organizational projects;\n• Experience in project plans, milestones, measures, budgets, resource and time management;\n• Ability to work efficiently under pressure and to tight deadlines;\n• Excellent communication, stakeholder management and leadership skills.\n\nDesirable Skill(s)\n• PMP... certified.\n\nResponsibilities\n• Develop, execute and closure of project plan;\n• Engage in project conceptualization, defining project scope and providing business solutions based on the business requirements;\n• Responsible for planning, leading, organizing, and motivating IT project teams to achieve project implementation on schedule and within budget;\n• Manage running and monitoring of various infrastructure projects and regularly review and analyse the project scope, identify and address project risks;\n• Drive cross-functional project teams whenever necessary;\n• Manage project deliverables, performance goals and progress reporting;\n• Create a working environment that allows everyone to work to the best of their abilities;\n• Negotiate with other teams, suppliers, sub-contractors on various project and operational matters", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJJbmZyYXN0cnVjdHVyZSBQcm9qZWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJTY2llbnRlIEluYyIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoidS1aTnZBREI2eTBtY2wtd0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBTQ0lFTlRFIiwibGluayI6Imh0dHBzOi8vd3d3LnNjaWVudGUuY29tL3NjaWVudGUtaW5jL3RlY2hub2xvZ3ktam9icy82MTIzL2luZnJhc3RydWN0dXJlLXByb2plY3QtbWFuYWdlci8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Project Manager​/Associate​/Regional Development", "company_name": "WSP CONSULTANCY PTE. LTD.", "location": "Singapore", "via": "via Learn4Good", "description": "Position: Project Manager/ Associate (Regional Development Support)\nRoles &\n\nResponsibilities\n\nResponsibilities\n\nSales Support regional business development activities through participation in external market profile raising activities and functions, and through involvement with key clients. Actively involve / support in key client relationships.\n\nActively involved in the development of cross-regional / global relations and promote collaboration between business units Support bids by contributing and reviewing submissions and demonstrating added value both commercially and technically. Support prospect / fee bid reviews, as required. For regional / strategic pursuits, support the pursuit team in the development and implementation of ‘win strategies’ Maintain regional pursuit management & key account management databases Support Business Development managers and bidding teams (regional, strategic or multi-discipline/multi-business unit pursuits) as required Ensure the bid preparation... process for regional pursuits, as implemented by the leading business unit conforms to the Asia business compliance requirements.\n\nPerform other duties as required Project Management (when assigned):\n\nPlay an active role in the planning of a project (either at the bidding phase, i.e. before contract award or on contract commencement) in terms of understanding scope, methodology of delivery and resource planning Develop project plans that will set out to all project team members and stakeholders how the project will be implemented, and progress monitored Coordinate internal resources and sub-consultants in the execution of projects to deliver project scope and objectives Manage changes to the project scope, project schedule and project costs, applying appropriate verification techniques and internal company procedures Measure performance of the project in terms of time, cost and quality using appropriate tools and techniques Report project performance and escalate issues to senior management as needed and as per company procedures Perform project risk management Create and maintain comprehensive Project Documentation in accordance with company standards, procedures, and systems.\n\nLeadership Provide support to the Regional Development Director, Asia in delivery of any strategic business development plans or initiatives. Exhibit and demonstrate behaviours and attitudes in accordance with WSP core values through effective team working with transparent and open communication. Work with the Regional Development Director, Asia to focus on staff development, work winning, project delivery and client management.\n\nRequirements Degree in Civil, Electrical or Mechanical Engineering or equivalent Minimum 8 years relevant experience in their respective engineering field Chartered Engineer (or equivalent) in their chosen discipline Registered with the Professional Engineers for Associate level (or equivalent) Possess sound understanding of Project Management as a discipline and ideally have experience in project delivery within one or more of WSPs active market sectors Have formal Project Management training and ideally have a Project Management certification, such as PMI PMP certification Have experience in sales and will have an aptitude for strategic thinking Possess a sound knowledge and experience of the various industry standard Project Management software and analytical tools currently available Possess strong communication and people skills\n\nCan demonstrate excellent presentation skills and with an aptitude for ‘creative thinking’\n\nAble to plan, organize and efficiently deliver project deliverables\n\nTell employers what skills you have\n\nAccount Management\n\nBid Preparation\n\nBusiness Development\n\nCollaboration\n\nDevelopment\n\nLeadership\n\nNew Business Development\n\nProject Management\n\nStrategyreviewing\n\nInvolvedinvolvementbusiness development activities", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXLigIsvQXNzb2NpYXRl4oCLL1JlZ2lvbmFsIERldmVsb3BtZW50IiwiY29tcGFueV9uYW1lIjoiV1NQIENPTlNVTFRBTkNZIFBURS4gTFRELiIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiemZWX1pwc3dyT09TbXlCLUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMZWFybjRHb29kIiwibGluayI6Imh0dHBzOi8vd3d3LmxlYXJuNGdvb2QuY29tL2pvYnMvc2luZ2Fwb3JlL21hbmFnZW1lbnRfYW5kX21hbmFnZXJpYWwvMjcxMzk5MTM4L2UvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Deployment And Integration  Technical Project Manager", "company_name": "Techgig", "location": "Singapore", "via": "via Mendeley", "description": "About Job\n\nCTC Undisclosed Job Location Singapore Experience 5 - 8 yrs\n\nDescription\n\nJob Description\n\nThe Deployment and Integration Project Manager is primarily responsible for the enablement of Enterprise Customers using FireEye technology. This role requires working hand in hand with customers and partners to help manage the product logistics and technical aspects of the deployment of complex solutions centered around FireEye technologies.\n\nResponsibilities:\n\nDrive large strategic and complex projects, with executive visibility and many critical dependencies.\n\nCoordinate the day-to-day activities required to deliver a high-quality product on time.\n\nManage key internal and external stakeholders, ensuring ongoing project updates and achievement of accountabilities\n\nDevelop trusting relationships with customers, understanding their business needs and technical challenges\n\nProvide Project Management and customer communication support, including requirements definition, project... planning, resource coordination, scheduling, project and issue tracking, written and verbal status updates, deliverable tracking, and escalation management\n\nFunction as a single point of contact for all FireEye and customer communications and facilitate rapid responses for customer questions and concerns\n\nProvide consistent project execution to include: Lead the delivery of program objectives. Maintain program schedule, target dates and critical path. Develop and manage a project change control process as needed to ensure project team operates within the scope and change approval process. Track progress and review program activities to make certain deadlines are met appropriately. Assess program issues and identify solutions to meet productivity, quality, and customer goals\n\nProvide information, documentation and deliverables within the agreed upon project timeline\n\nProvide deployment and configuration for the FireEye suite of products as needed at least at a basic level.\n\nParticipate in regularly scheduled meetings with FireEye and the customer to discuss the status of the implementation and provide weekly status reports to ensure clear and detailed communication throughout the project\n\nQualifications\n\n5 years in an information security environment\n\nExperience in a similar role as a Technical Account Manager, Principal Consultant, Operations Manager, Service Delivery etc. PMP/Prince2 Certification desirable.\n\nAt least 2-3 years of experience in managing projects that involves Security solutions such as Endpoint Security, SIEM/SOAR, Network Security and Cloud based platforms such as AWS, Azure, VMware.\n\nStrong working knowledge of Microsoft Excel, reporting, and analytics\n\nPrevious success in planning and delivering projects involving multiple functional areas and technologies.\n\nExperience handling issues, Incident, Problem, and Service availability\n\nExperience in working with Microsoft Project or any other similar project management tool.\n\nAblility to build strong client relationships and to interact effectively at all levels of client organization.\n\nUnderstanding of security infrastructure (proxies, firewalls, email filtering technologies, and network intrusion detection systems)\n\nExperience in managing a small to medium sized team within a project management environment\n\nCurrent knowledge of security threats, solutions, security tools and network technologies\n\nKnowledge of security solutions and technologies, including network and endpoint solution architectures, implementation, and configurations\n\nFamiliarity with network protocols, packet flow, TCP and UDP traffic\n\nKnowledge of SCCM and other agent push and distribution technologies\n\nExcellent communication and presentation skills, with the ability to present to a variety of internal and external audiences, including the ability to comfortably interact with senior executives\n\nAbility to write comprehensive methodology and technical solutions documentation\n\nStrong leadership skills with the ability to prioritize and execute in a methodical and disciplined manner\n\nAbility to set and manage expectations with senior stakeholders and team members\n\nExperience with FireEye security products, highly desired\n\nWilllingness to travel up to 30 PERCENT", "extensions": ["2 days ago", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEZXBsb3ltZW50IEFuZCBJbnRlZ3JhdGlvbiAgVGVjaG5pY2FsIFByb2plY3QgTWFuYWdlciIsImNvbXBhbnlfbmFtZSI6IlRlY2hnaWciLCJjb21wYW55X21pZCI6Ii9nLzExYzczZnhnd3QiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJXaFVmeFJ0UEhoUGlWQ2JoQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VVZkcWJDMXlRMlp2VTFWa09UQlFibGRMUkd4NVVEVTBibWMwVWxaT0xVMDJYMWt4V1VkNU5sRnFOVm81TmtWVk0wTlVORWxuVEhZNWIwSkRUemw2YjA1ak1UbDRXV1JhV1U1NlYyWlFPVzlRVkdsS2IwTkJiRkIyVUhoS2VFNWZXa3R4Y25SSmNGYzJXbFpTYjFsUFNGRlJjbTR5VFZKNVpVc3plR2RrTkd0MmNGOXRkVzFzZFhVd1pYaEtOM3B6Y0RaMU1YaFNNRzlUYmxOM0VoWk9TSEZEV1V4dFRWQkpNbk4wVVdGbE5XSnBVVUozR2lKQlQwMVpVbmREUXkxRWEyeHpRV1F6UjJWb01tSktVa1ZqV0dJek9WcEVkMHhSIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMTUiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTWVuZGVsZXkiLCJsaW5rIjoiaHR0cHM6Ly93d3cubWVuZGVsZXkuY29tL2NhcmVlcnMvam9iL2RlcGxveW1lbnQtYW5kLWludGVncmF0aW9uLXRlY2huaWNhbC1wcm9qZWN0LW1hbmFnZXItMjA4NDA3OD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Jooble - Assistant Project Manager", "company_name": "None", "location": "Singapore", "via": "via Jooble", "description": "Job Description / Responsibilities : -\n\na. Meeting of potential clients to enquire and understand their needs;\n\nb. Co-ordinate layout plan, M&E plan and visuals, prepare project schedule for the project;\n\nc. Submission of plans to relevant agencies for approval and arrange inspection;\n\nd. Manage budget efficiently;\n\ne. Ensure timely delivery and quality of work done for the project;\n\nf. Key interface with the clients, obtain feedbacks and resolve project related issues.\n\nRequirements :-\n\na. Recognized qualification in interior design, architecture or equivalent;\n\nb. Min 3 years' experience in corporate office design and build project management. Those with PMP Certification have added advantage.\n\nc. Able to interpret architectural plans and familiar with building and safety regulations;\n\nd. Experience in leading and managing multiple projects within tight timelines;\n\ne. Excellent project, presentation, leadership and people management skills;\n\nf. Highly self motivated;\n\ng. Good... communication & interpersonal skills.\n\nQualification :-\n\na. Diploma, Bachelor's Degree, Post Graduate Diploma or Professional Degree", "extensions": ["28 days ago", "Full–time"], "detected_extensions": {"posted_at": "28 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJKb29ibGUgLSBBc3Npc3RhbnQgUHJvamVjdCBNYW5hZ2VyIiwiY29tcGFueV9uYW1lIjoiTm9uZSIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiWUNMakpLWVhrRXZLM3VNN0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb29ibGUiLCJsaW5rIjoiaHR0cHM6Ly9zZy5qb29ibGUub3JnL2pkcC8tODkxODc5MDYzOTk5NDI5MDA4OC9Bc3Npc3RhbnQtUHJvamVjdC1NYW5hZ2VyLVNpbmdhcG9yZT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Technical Project Manager, Carriers - Singapore", "company_name": "Facebook", "location": "Singapore (+1 other)", "via": "via JobWiz", "description": "Partner Engineering is a highly technical team that works with our strategic partners to integrate Facebook messaging products into their mobile platforms, apps, and devices. In this unique partner-facing engineering team, you will use your excellent technical and business skills to deliver platform products that drive value for our community, our partners, and Facebook.The team plays a critical role in the success of our platform and products through a variety of activities, such as building APIs and helping mobile operators configure their systems. Our team has played an instrumental role in the launch and scaling of many connectivity-related initiatives here at Facebook.As a Technical Project Manager you will work closely with the Facebook partner managers throughout the region handling the technical relationships with mobile operators and strategic partners to run and deliver Facebook Operators Solutions products. You will get the opportunity to work on multiple key technologies... alongside some of the most innovative companies and brightest minds in the world.\n• Manage Facebook Operators Solutions projects in a matrix organization\n• Drive and complete projects from initiation to closure and communication practices with the partner and internally in Facebook\n• Ensure that Facebook project and support processes are followed throughout the partner life-cycle\n• Communicate partner needs to the Facebook product team to improve people’s experiences with our products\n• Work with Facebook product teams in creating and executing new exciting programs with operators to increase Facebook accessibility and engagement\n• Help launch brand new products including supporting Alpha and Beta programs\n• Troubleshoot partner’s technical issues in real-time in cooperation with their engineering and second level operations teams and work with internal technical teams on resolving escalations.\n• Use a broad range of technical and soft skills to build productive relationships with our partners\n• Use expertise and product insight to deliver high-quality project/integration/partner engagements, while sustaining self-driven productivity\n• Guide workflow changes, and gain consensus from stakeholders while driving to a solution\n• Respond and maintain effective communication with industry partners and internal stakeholders\n• Work with partners to develop a long-term strategic plan, grounded on business objectives, and manage partners during feature launches\n• Understand organizational structure and cross functional team dynamics and is able to get support from those teams as needed\n• Identify and surface insights using metrics on product usage to increase adoption and provide new solutions that address the needs of our partners\n• Build and manage strong working relationships with technical counterparts. Mentor and share knowledge with peers, creating positive atmosphere amongst team\n• Willingness to travel up to 30% of the time (No travel currently due to COVID-19)\n• Previous experience as a technical project manager, solutions engineer, technical sales consultant or partner/sales engineer in the telecommunications space.\n• BA/BS in Computer Science or Engineering or equivalent degree/experience\n• Excellent communication skills and experience working with technical management teams.\n• Experience coordinating, and multi-tasking in a highly organized manner\n• Knowledge of IT infrastructures (distributed, high availability, real-time infrastructures) and understanding of network protocols on different layers.\n• Knowledge of mobile infrastructure, capabilities and network protocols, especially packet core infrastructure, VAS and BSS infrastructures for provisioning and charging. Advanced packet core features are a plus.\n• Knowledge of web technology stack and/or mobile (HTTP, HTML, JavaScript, CSS, RESTful API).\n• Knowledge of software development processes and best practices. Knowledge with project and issue tracking systems\n• Experience working with System Integrators from a technical/project perspective.\n• PMP or similar project management related certification.\n\nFacebook's mission is to give people the power to build community and bring the world closer together. Through our family of apps and services, we're building a different kind of company that connects billions of people around the world, gives them ways to share what matters most to them, and helps bring people closer together. Whether we're creating new products or helping a small business expand its reach, people at Facebook are builders at heart. Our global teams are constantly iterating, solving problems, and working together to empower people around the world to build community and connect in meaningful ways. Together, we can help people build stronger communities - we're just getting started", "extensions": ["7 days ago", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJUZWNobmljYWwgUHJvamVjdCBNYW5hZ2VyLCBDYXJyaWVycyAtIFNpbmdhcG9yZSIsImNvbXBhbnlfbmFtZSI6IkZhY2Vib29rIiwiY29tcGFueV9taWQiOiIvbS8waG15ZnN2IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiTXpXaXd1eVpSVnU2MEU4S0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFVUSTNSVVozU0hWYWNHWkxUV1ZHTUdkTlFtZFFNRnBQZGxCWlYzaDZPREpIUmw5VmFtZDRYekZHVFdkWFV6UlFRWGt3U1ZoMldqRm9XWE5RVDFwbE1VOXljR3RPY0hsTE5WZGlWVEJVZVRGUGJVdDZhbUp6YnpRMGRFVk9VRFZ6ZWxkc1lqUnZaVE14YTNSRGJWOVRSbEZvTFZCTmRWTjZSemQ0YzJsS00yRjVTMDAxYTBFMWJrbEtNems1VGxsc1RtUklUVkUwTVVOU2JIbDNFaFpPU0hGRFdVeHRUVkJKTW5OMFVXRmxOV0pwVVVKM0dpSkJUMDFaVW5kQ1VYQmhjbEJRUzI5bk4ybEZka1JQV1hGR2RtRjVUekpTWW01MyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzI3IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYldpeiIsImxpbmsiOiJodHRwczovL2pvYndpei5zZy9qb2IvQ1ItMjI3MDQxMjk3Mz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Deployment Project Manager", "company_name": "Exabeam", "location": "Singapore", "via": "via Bayt.com", "description": "Exabeam helps security teams outsmart the odds by adding intelligence to their existing security tools – including SIEMs, XDRs, cloud data lakes, and hundreds of other business and security products. Out-of-the-box use case coverage repeatedly delivers successful outcomes. Behavioral analytics allows security teams to detect compromised and malicious users that were previously difficult, or impossible, to find. Automation helps overcome staff shortages by minimizing false positives and dramatically reducing the time it takes to detect, triage, investigate and respond. For more information, visit https://www.exabeam.com.\n\nExabeam is looking for a Deployment Project Manager to own project delivery for our APJ clients. This individual will partner with our in-house Professional Services Engineers (PSEs) and manage communications on project timeline, budget, scope and quality. You will also work cross-functionally with internal teams to plan, drive, track and deliver daily tasks to meet... our client’s goals. Success in this role will require someone with exceptional project management and organizational skills, as well as the ability to analyze complex multivariate problems and use a systematic approach to gain quick resolution.\n\nResponsibilities\n• Deliver 5-9 deployment projects of various scale concurrently\n• Prepare clients to complete technical pre-requisites before deployment starts\n• Work with Professional Services to create a project plan with clear success criteria, review the plan with clients, agree on risk and mitigation plan, then execute\n• Enforce change control process to avoid scope creep\n• Track tasks daily and provide weekly report to clients\n• Proper project closing with clients\n• Upon completion of deployment, work with Technical Account Manager to ensure proper handoff\n• Work with Professional Services to continuously improve Exabeam deployment process\n\nQualifications\n• Working knowledge of Japanese and English highly desired\n• Minimum 5 years in a customer facing project management role deploying software or hardware (security industry highly desired)\n• Bachelor's degree or equivalent experience required\n• Ability to manage multiple fast paced projects with a strong sense of autonomy\n• Knowledge in Networking highly desired\n• Willingness to travel\n• PMP desired\n• Capable of presenting to technical as well as 'C' level audiences\n•", "extensions": ["5 days ago", "Full–time"], "detected_extensions": {"posted_at": "5 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEZXBsb3ltZW50IFByb2plY3QgTWFuYWdlciIsImNvbXBhbnlfbmFtZSI6IkV4YWJlYW0iLCJjb21wYW55X21pZCI6Ii9nLzExZjAxOXRiZGgiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJOa0FNQ05HRjdmR0hPMFVBQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VkhKTE9GSkZUbEJDZFdGVlgzSkhRMjEzYldRelNrd3lUMUpOVW5GeU56Y3pjbU56Y0U1bVIzbFhRMFY0Ym5vM2FYSTVhbFJ4VTJreWVWYzJUVEpEWVRkSmFGRndVV041YVRGVlVVaHZaVEp1VVRaNWIxRmZXR3hGWmtnMVpqZDVWa05DUlZJMlozUlJaWEpEWlRBMFlsTTRjWEpYT0VNeFQxWkdMWGxEYlZaRGFFZEJTME5aVDA4ME9HZDROVTFRWVZocFVWbE5XR0Z2UlVGUkVoWk9TSEZEV1V4dFRWQkpNbk4wVVdGbE5XSnBVVUozR2lKQlQwMVpVbmRETmxCWFVrcHlkRzl4T1hCd05uUlZhMWQxYlhrdFNrdEplR1ozIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMzUiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQmF5dC5jb20iLCJsaW5rIjoiaHR0cHM6Ly93d3cuYmF5dC5jb20vZW4vc2luZ2Fwb3JlL2pvYnMvZGVwbG95bWVudC1wcm9qZWN0LW1hbmFnZXItNTk1Mjg2NDYvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Asia IT Project Manager, Service Delivery - 1 Year Fixed Term, Renewable", "company_name": "Marsh and McLennan", "location": "Singapore", "via": "via Marsh McLennan Careers", "description": "MARSH & MCLENNAN\n\nMarsh & McLennan (NYSE: MMC) is the world's leading professional services firm in the areas of risk, strategy and people. The Company's 76,000 colleagues advise clients in over 130 countries. With annualized revenue approaching $17 billion, Marsh & McLennan helps clients navigate an increasingly dynamic and complex environment through four market-leading businesses. Marsh advises individual and commercial clients of all sizes on insurance broking and innovative risk management solutions. Guy Carpenter develops advanced risk, reinsurance and capital strategies that help clients grow profitably and pursue emerging opportunities. Mercer delivers advice and technology-driven solutions that help organizations meet the health, wealth and career needs of a changing workforce. Oliver Wyman serves as a critical strategic, economic and brand advisor to private sector and governmental clients. For more information, visit mmc.com, follow us on LinkedIn and Twitter @mmc_global or... subscribe to BRINK.\n\nMarsh & McLennan is seeking candidates for the following position based in the Singapore office:\n\nAsia IT Project Manager, Service Delivery - 1 Year Fixed Term, Renewable\n\nWhat can you expect?\n• Lead and manage in-scope small & medium complexity initiatives/projects related to applications support, maintenance and application modernization, such as but not limited to technical upgrades, minor functional upgrades and process improvement projects. This may include taking the primary project leadership role includes project planning, execution, timing, functionality, quality, communication and budget (overall accountability from original concept through the final implementation).\n\nWhat is in it for you?\n• Work for a company who is at the forefront of modern technology and an IT organization that is evolving ahead of its competitors\n• Join a strong brand in the Insurance, Broking and Risk Management industry\n\nWe will count on you to:\n• Work closely with regional teams, Asia IT Service Delivery Leader and Heads of Solution Delivery – North & South Asia to manage the end to end delivery of project from an IT standpoint\n• Acts as project manager for technical/functional upgrades and modernization projects of in-production applications.\n• Manage systems requirements capture and requirements design as well as User Acceptance testing.\n• Prepare and execute work breakdown structure/project plan. Recommend options and alternatives. Estimate duration/costs/resources. Manage & Lead project resources (internal and/or external) to deliver project deliverables specified within agreed parameters.\n• Track the quality and status of deliverables and ensure readiness for delivery of project, and smooth transition to BAU (Business As Usual)\n• Ensure IT Change Management and work with internal team to ensure project management governance process are adhered during Project Development Lifecycle\n• Engage applications support/applications development teams, business analysts, software systems engineering, database support and infrastructure support teams as necessary to achieve project objectives. Oversee technical delivery. Effectively communicate with stakeholders, including users wherever applicable.\n• Provide weekly/monthly status on issues, risks, milestones and timelines. Identify and anticipate risks and issues; facilitate resolution, mitigation and appropriate escalation. Collaborate with project and development teams, support teams, other functions within IT as necessary.\n\nWhat you need to have:\n• Minimum of Bachelor’s Degree, ideally in computer science or related field.\n• Minimum 8-10 years’ experience in information technology. 5+ years project management experience required. 5+ years supporting/testing large, complex systems, and in a structured team-oriented environment.\n• Knowledge / Experience with insurance sector is a preferred. Familiarity with highly regulated, controls & compliance driven IT environments.\n• Solid experience in project management. PMP, PMI, or Prince 2 preferred. ITIL foundation certification is advantageous. Demonstrated experience in planning and leading software development projects.\n• Must be self-motivated, able to work independently with little guidance and able to lead and motivate a team. Exceptional analytical, conceptual, and problem-solving abilities\n• Good working knowledge of project life cycle methodology and Proficient in the use of MS Word, Excel, PowerPoint, MS Project, Visio\n• Demonstrable skills working in a structured analysis environment including sign-off from relevant stakeholders on all documentation. Ability to accurately assess project risks and raise risks and issues to senior team members as appropriate.\n• Experience in project initiation and requirements phases of large technology or business change planning, execution, and benefits realization. Understanding of the organization’s goals and objectives, IT Strategy objectives\n• Exposure to / knowledge of applicable laws and regulations as they relate to technology issues (e.g. MAS Singapore regulations)\n• Ability to articulate ideas to both technical and non-technical audiences.\n• Occasional travel might be required.\n\nTechnical Skills\n• Prior technical experience with Java EE, .Net development is preferred though not essential.\n• Experience working with multiple development methodologies such as Agile, Scrum and Waterfall\n• Possess a general understanding in the areas of application programming, database and system design\n• Knowledge of Service Oriented Architectures (SOA) a plus\n• Knowledge of HP PPM a plus", "extensions": [], "detected_extensions": {}, "job_id": "eyJqb2JfdGl0bGUiOiJBc2lhIElUIFByb2plY3QgTWFuYWdlciwgU2VydmljZSBEZWxpdmVyeSAtIDEgWWVhciBGaXhlZCBUZXJtLCBSZW5ld2FibGUiLCJjb21wYW55X25hbWUiOiJNYXJzaCBhbmQgTWNMZW5uYW4iLCJjb21wYW55X21pZCI6Ii9tLzA1M3J3IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiNEFuR0loM1BDMHZFYkk3NUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZZQkNyY0JRVTVWWDA1eFVVbFpWRnA2ZDE4eGNHSTFlVW8xVFdOQ1pGSTFaV1Z4ZGxKUE5FbDBSbEJPV2t0SlMySlZjbVZIVTJOQ1NGQlhia000TURWcGRqSkpWRXMwYVRKVlUwcGtPSG8yYkd0ek1IUjNVMFYzU2tkeFNtMTNSWFl6TVdsbWQyOUpUWGgxYTFGSVZURkhRM2hQY1Y4elRrWlRaMTlMU0RocWVGbDZWa2xMZUc1d05uUmlNVWRwVkVFMlpWbERWMVJxTFVzdFNEazNZblExWmw5aVJqZFJaVVZWVG5WV1NFaENRekZzYVV0UGNVazRSMnBuRWhaT1NIRkRXVXh0VFZCSk1uTjBVV0ZsTldKcFVVSjNHaUpCVDAxWlVuZEJPRnBYZUdGemRVZGxSMngzVFRKSVZVczFkbmxHVEVKWU5XSkIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY180MiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNYXJzaCBNY0xlbm5hbiBDYXJlZXJzIiwibGluayI6Imh0dHBzOi8vY2FyZWVycy5tbWMuY29tL2dsb2JhbC9lbi9qb2IvTUFNQ0dMT0JBTFIxMDc4NTFFWFRFUk5BTEVOR0xPQkFML0FzaWEtSVQtUHJvamVjdC1NYW5hZ2VyLVNlcnZpY2UtRGVsaXZlcnktMS1ZZWFyLUZpeGVkLVRlcm0tUmVuZXdhYmxlP3V0bV9zb3VyY2U9bW9ndWxcdTAwMjZ1dG1fbWVkaXVtPXBoZW5vbS1mZWVkc1x1MDAyNnV0bV9jYW1wYWlnbj1tb2d1bFx1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "project manager", "company_name": "Leader Resource Pte. Ltd.", "location": "Singapore (+1 other)", "via": "via Monster Singapore", "description": "A Project Manager is responsible for planning, overseeing and leading projects from ideation through to completion. This is a senior role at an organisation and requires interaction with a range of internal and external stakeholders, most often managing several moving project parts simultaneously. An ideal Project Manager job description should capture the nuances and variation of this senior role, seeking multi-skilled and highly capable candidates.\nProject Manager duties and responsibilities of the job\n\nAs a role that focuses on completing a project as efficiently and promptly as possible, expect to see any of the following duties and responsibilities in a Project Manager job description:\n\n· Leading project planning sessions\n\n· Coordinating staff and internal resources\n\n· Managing project progress and adapt work as required\n\n· Ensuring projects meet deadlines\n\n· Managing relationships with clients and stakeholders\n\n· Designing and signing off on contracts\n\n· Overseeing all incoming... and outgoing project documentation\n\n· Participating in tender process i.e. design, submission and review\n\n· Designing risk mitigation plan\n\n· Conducting project review and creating detailed reports for executive staff\n\n· Optimising and improving processes and the overall approach where necessary\n\n· Securing growth opportunities and initiating new projects\n\n· Managing large and diverse teams\n\nskills to perform well in the role:\n\n· Written and verbal communication skills\n\n· Capacity to manage high stress situations\n\n· Ability to multi-task and manage various project elements simultaneously\n\n· Leadership skills\n\n· Big-picture thinking and vision\n\n· Attention to detail\n\n· Conflict resolution skills\n\nRequirements:\n\n·\n\nProven working experience in project management\n\n·\n\n·\n\nExcellent client-facing and internal communication skills\n\n·\n\n·\n\nExcellent written and verbal communication skills\n\n·\n\n·\n\nSolid organizational skills including attention to detail and multitasking skills\n\n·\n\n·\n\nStrong working knowledge of Microsoft Office\n\n·\n\n·\n\nProject Management Professional (PMP) / PRINCE II certification is a plus\n\n·\n\n·\n\nDiploma with 8 years experiences, or Bachelor's Degree in appropriate field of study or equivalent work experience", "extensions": ["5 days ago", "Full–time"], "detected_extensions": {"posted_at": "5 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJwcm9qZWN0IG1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJMZWFkZXIgUmVzb3VyY2UgUHRlLiBMdGQuIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiI0MU9rd251QUdWODRxdWdCQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1vbnN0ZXIgU2luZ2Fwb3JlIiwibGluayI6Imh0dHBzOi8vd3d3Lm1vbnN0ZXIuY29tLnNnL2FtcC9qb2ItdmFjYW5jeS1wcm9qZWN0LW1hbmFnZXItbGVhZGVyLXJlc291cmNlLXB0ZS1sdGQtc2luZ2Fwb3JlLTI3NzcxMTU3Lmh0bWw/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Project Manager", "company_name": "Sciente International", "location": "Singapore (+1 other)", "via": "via Jobs", "description": "17 March 2021 Are you looking for an exciting opportunity? We are hiring for a Project Manager to lead and manage Training Application projects! Mandatory Skill(s) Degree in Computer Science, Engineering, Information Systems; Has at least 8 years of Project Management experience, with proven track record of management of work streams for project implementation; Knowledge of Agile based Project Management approach; Has strong leadership abilities and interpersonal skills; Prior experience in vendors selection and management; Strong experience in project budgeting, project financials /projections, monitoring of project costing and regular project reporting; Focus in meeting time lines, firm hold of project budget, ensuring that internal/external work together to achieve the objectives of the project; Excellent communication skills and emotional intelligence to influence key decisions, mediate conflicts and build consensus. Desirable Skill(s) PMP Certified. Experience in implementing... Training / Educational related Projects; Responsibilities Responsible to establish and execute the work-stream plan for the project; To lead and manage project work stream progress, teams and stakeholders across business and technology lines and functions and ensure the successful delivery of project; Manage project financials and keep track of project costs, scope, risk, schedule and progress, performance, deliverables, issues, escalations, and conflicts; Work closely with vendors to manage project scope, deliverables, risks, dependencies, cost, and timelines; Collaborate with the other related projects and work-stream teams to ensure that projects are meeting business objectives; Responsible for tender evaluation and procurement where necessary; Produce accurate and detailed project reports and presentations to update the management on a timely basis; Proactively suggest, adopt industry best practices to run projects more efficiently and effectively", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJTY2llbnRlIEludGVybmF0aW9uYWwiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImFtNmQyanM4SnJBN1VXck5BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9icyIsImxpbmsiOiJodHRwczovL3NnLmZpZGFudG8uY29tL2pvYnMvam9iLW9wZW5pbmcvaW5mb3JtYXRpb24tdGVjaG5vbG9neS1wcm9qZWN0LW1hbmFnZXJzL3Byb2plY3QtbWFuYWdlci0yNzc4NTIyOTg/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Project Manager (enterprise software)<h1 style=\"text-align: justify;\"> </h1> <h1 style=\"text-align: justify;\">", "company_name": "BizLINKS Resources", "location": "Singapore (+1 other)", "via": "via BizLINKS Resources Pte Ltd", "description": ". Manage the definition, planning, executing and delivery of Enterprise software projects within scope, time and budget . effort estimation . project planning and budgeting . schedules development . resource allocation . SLA management . Risk mitigation . Lead a team of highly skilled project leaders, development expertst. . Lead a team of project leaders,architects, developers to ensure smooth delivery of project solution according to budget and timeline schedule. . 3-5 years of direct software project management exp . domain exp in SOA environment . government account exp. . PMP certified . salary up to 6K APPLY for this post\n\nGeneral CV submission", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIgKGVudGVycHJpc2Ugc29mdHdhcmUpXHUwMDNjaDEgc3R5bGU9XCJ0ZXh0LWFsaWduOiBqdXN0aWZ5O1wiXHUwMDNlIFx1MDAzYy9oMVx1MDAzZSBcdTAwM2NoMSBzdHlsZT1cInRleHQtYWxpZ246IGp1c3RpZnk7XCJcdTAwM2UiLCJjb21wYW55X25hbWUiOiJCaXpMSU5LUyBSZXNvdXJjZXMiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImJjejVPZWJaSUk4eXJUNTBBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQml6TElOS1MgUmVzb3VyY2VzIFB0ZSBMdGQiLCJsaW5rIjoiaHR0cHM6Ly93d3cuYml6bGlua3NyZXNvdXJjZXMuY29tLnNnL2luZGV4LnBocC9qb2ItbGlzdGluZ3MtbWFpbm1lbnUtMjcvMTMtaXQtam9icy80MTItcHJvamVjdC1tYW5hZ2VyLWVudGVycHJpc2Utc29mdHdhcmU/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Management", "value": "GC18"}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Advertising and Marketing", "value": "GC03"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Media, Communications and Writing", "value": "GC20"}, {"text": "Transportation and Logistics", "value": "GC30"}, {"text": "Art, Fashion and Design", "value": "GC05"}, {"text": "Construction", "value": "GC09"}, {"text": "Education", "value": "GC11"}, {"text": "Human Resources", "value": "GC15"}, {"text": "Protective Services", "value": "GC23"}, {"text": "Property", "value": "GC24"}, {"text": "Science and Engineering", "value": "GC27"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "Project manager", "value": "project manager"}, {"text": "Program manager", "value": "program manager"}, {"text": "Manager", "value": "manager"}, {"text": "Delivery manager", "value": "delivery manager"}, {"text": "Project director", "value": "project director"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Senior", "value": "senior"}, {"text": "Consultant", "value": "consultant"}, {"text": "Coordinator", "value": "coordinator"}, {"text": "Deputy director", "value": "deputy director"}, {"text": "Director", "value": "director"}, {"text": "Group manager", "value": "group manager"}, {"text": "Operations", "value": "operations"}, {"text": "Scrum master", "value": "scrum master"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Services", "value": "services"}, {"text": "Vice president", "value": "vice president"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Engineering Services", "value": "/business/naics2007/5413"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Entertainment", "value": "/business/naics2007/71"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Management", "value": "/business/naics2007/55"}, {"text": "Real Estate", "value": "/business/naics2007/53"}, {"text": "Research", "value": "/business/naics2007/5417"}, {"text": "Retail", "value": "/business/naics2007/44"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": ".AB4Jjf.qPB6Vc{padding-right:11px}.qfpP8d{padding:7px 0 7px 11px}.S003Ke{flex:none}.ZoN4Lb{color:rgba(0,0,0,.54)}.nAXVG{color:#70757a}.IxQsL{color:rgba(0,0,0,.26)}.xFO1De{color:#fff}.ooFpK{color:rgba(255,255,255,.30)}.mtnwac{color:#4285f4}.WxeeKb{color:#34a853}.hIVRU{color:#f29900}.EXaTMc{color:#fbbc04}.sxn46d{color:#000}.gqMTF{color:#1a73e8}.zpn8Mb{color:#d93025}.dEUPmd{color:#1e8e3e}.PJNo1{color:#fbbc04}Actively Hiring", "value": "e"}, {"text": "Michael Page", "value": "/m/04cxldw"}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Nanyang Technological University", "value": "/m/0l49k"}, {"text": "Jobline Resources Pte Ltd", "value": "/g/11gp2647pn"}, {"text": "Randstad Singapore", "value": "/g/11g70b50mr"}, {"text": "GECO Asia", "value": "/g/11gk72_bt_"}, {"text": "Facebook", "value": "/m/0hmyfsv"}, {"text": "HP", "value": "/m/03mnk"}, {"text": "IoTalents", "value": "/g/11dxq187wm"}, {"text": "NCS Group", "value": "/m/0282746"}, {"text": "National University of Singapore", "value": "/m/01q460"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "OPTIMUM SOLUTIONS (SINGAPORE) PTE LTD", "value": "/g/11g70hkrbx"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Apple", "value": "/m/0k8z"}, {"text": "Avensys Consulting", "value": "/g/11g7022gjf"}, {"text": "BNP Paribas", "value": "/m/02qhk4"}, {"text": "Ceridian", "value": "/m/07f8h6"}, {"text": "Ensign InfoSecurity", "value": "/g/11g4jhymjr"}, {"text": "Humanica Asia Pte. Ltd", "value": "/g/11h1y98c9z"}, {"text": "Kerry Consulting", "value": "/g/11c73vtzc8"}, {"text": "Marsh and McLennan", "value": "/m/053rw"}, {"text": "NSEARCH GLOBAL", "value": "/g/11dxpksll4"}, {"text": "NTT", "value": "/m/05mybp8"}, {"text": "OakTree Consulting", "value": "/g/11g70jfhtq"}, {"text": "Salesforce", "value": "/m/07btr5"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "TEKsystems", "value": "/g/11b6g4bkv0"}, {"text": "Teradyne", "value": "/m/04bzqp"}, {"text": "Toshiba Tec Singapore Pte. Ltd", "value": "/g/11g9n9q547"}, {"text": "Trustwave", "value": "/m/0n3xjf5"}, {"text": "Wood Plc", "value": "/m/07vv9s"}, {"text": "Workiva", "value": "/m/0113m1rd"}, {"text": "A-it Software Services Pte Ltd", "value": "/g/11dxpy_gl_"}, {"text": "ABS Group", "value": "/g/11dxplj1z6"}, {"text": "ACI HR Solutions Ltd", "value": "/g/11c73ryh3p"}, {"text": "AIA", "value": "/m/02r5cgx"}, {"text": "ASEAN CABLESHIP PTE. LTD.", "value": "/g/11b7dsfph2"}]}]}