{"search_metadata": {"id": "60827ae91c450a2e4eda5ccd", "status": "Success", "json_endpoint": "https://serpapi.com/searches/4e2c3a04b8763eaf/60827ae91c450a2e4eda5ccd.json", "created_at": "2021-04-23 07:44:41 UTC", "processed_at": "2021-04-23 07:44:41 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28software+engineer%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=160", "raw_html_file": "https://serpapi.com/searches/4e2c3a04b8763eaf/60827ae91c450a2e4eda5ccd.html", "total_time_taken": 2.87}, "search_parameters": {"q": "(software engineer) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "160"}, "jobs_results": [{"title": "Lead I - Software Engineering", "company_name": "UST Global Singapore Pte Limited", "location": "Singapore", "via": "via LinkedIn", "description": "Role Proficiency\n\nJob Description :\n\nAct creatively to develop applications and select appropriate technical options optimizing application development maintenance and performance by employing design patterns and reusing proven solutions account for others' developmental activities\n\nOutcomes\n• Interpret the application/feature/component design to develop the same in accordance with specifications.\n• Code debug test document and communicate product/component/feature development stages.\n• Validate results with user representatives; integrates and commissions the overall solution\n• Select appropriate technical options for development such as reusing improving or reconfiguration of existing components or creating own solutions\n• Optimises efficiency cost and quality.\n• Influence and improve customer satisfaction\n• Set FAST goals for self/team; provide feedback to FAST goals of team members\n\nMeasures Of Outcomes\n• Adherence to engineering process and standards (coding standards)\n•... Adherence to project schedule / timelines\n• Number of technical issues uncovered during the execution of the project\n• Number of defects in the code\n• Number of defects post delivery\n• Number of non compliance issues\n• On time completion of mandatory compliance trainings\n\nCode\n\nOutputs Expected:\n• Code as per design\n• Follow coding standards templates and checklists\n• Review code – for team and peers\n\nDocumentation\n• Create/review templates checklists guidelines standards for design/process/development\n• Create/review deliverable documents. Design documentation r and requirements test cases/results\n\nConfigure\n• Define and govern configuration management plan\n• Ensure compliance from the team\n\nTest\n• Review and create unit test cases scenarios and execution\n• Review test plan created by testing team\n• Provide clarifications to the testing team\n\nDomain Relevance\n• Advise Software Developers on design and development of features and components with a deep understanding of the business problem being addressed for the client.\n• Learn more about the customer domain identifying opportunities to provide valuable addition to customers\n• Complete relevant domain certifications\n\nManage Project\n• Manage delivery of modules and/or manage user stories\n\nManage Defects\n• Perform defect RCA and mitigation\n• Identify defect trends and take proactive measures to improve quality\n\nEstimate\n• Create and provide input for effort estimation for projects\n\nManage Knowledge\n• Consume and contribute to project related documents share point libraries and client universities\n• Review the reusable documents created by the team\n\nRelease\n• Execute and monitor release process\n\nDesign\n• Contribute to creation of design (HLD LLD SAD)/architecture for Applications/Features/Business Components/Data Models\n\nInterface With Customer\n• Clarify requirements and provide guidance to development team\n• Present design options to customers\n• Conduct product demos\n\nManage Team\n• Set FAST goals and provide feedback\n• Understand aspirations of team members and provide guidance opportunities etc\n• Ensure team is engaged in project\n\nCertifications\n• Take relevant domain/technology certification\n\nSkill Examples\n• Explain and communicate the design / development to the customer\n• Perform and evaluate test results against product specifications\n• Break down complex problems into logical components\n• Develop user interfaces business software components\n• Use data models\n• Estimate time and effort required for developing / debugging features / components\n• Perform and evaluate test in the customer or target environment\n• Make quick decisions on technical/project related challenges\n• Manage a Team mentor and handle people related issues in team\n• Maintain high motivation levels and positive dynamics in the team.\n• Interface with other teams designers and other parallel practices\n• Set goals for self and team. Provide feedback to team members\n• Create and articulate impactful technical presentations\n• Follow high level of business etiquette in emails and other business communication\n• Drive conference calls with customers addressing customer questions\n• Proactively ask for and offer help\n• Ability to work under pressure determine dependencies risks facilitate planning; handling multiple tasks.\n• Build confidence with customers by meeting the deliverables on time with quality.\n• Estimate time and effort resources required for developing / debugging features / components\n• Make on appropriate utilization of Software / Hardware's.\n• Strong analytical and problem-solving abilities\n\nKnowledge Examples\n\nAdditional Comments:\n\nNone\nJob Description : Role Proficiency: Act creatively to develop applications and select appropriate technical options optimizing application development maintenance and performance by employing design patterns and reusing proven solutions account for\n\nExperience: 0.00-50.00 Years", "extensions": ["5 days ago", "Full–time"], "detected_extensions": {"posted_at": "5 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJMZWFkIEkgLSBTb2Z0d2FyZSBFbmdpbmVlcmluZyIsImNvbXBhbnlfbmFtZSI6IlVTVCBHbG9iYWwgU2luZ2Fwb3JlIFB0ZSBMaW1pdGVkIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJuZTdzalhCQmxhUjEtTzd3QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExpbmtlZEluIiwibGluayI6Imh0dHBzOi8vc2cubGlua2VkaW4uY29tL2pvYnMvdmlldy9sZWFkLWktc29mdHdhcmUtZW5naW5lZXJpbmctYXQtdXN0LWdsb2JhbC1zaW5nYXBvcmUtcHRlLWxpbWl0ZWQtMjUwODg5OTIxMD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Software Developer (BB-A47EA)", "company_name": "Globaltix Pte Ltd", "location": "Singapore (+1 other)", "via": "via BeBee", "description": "GlobalTix is a comprehensive technology solutions provider to the travel trade. Today, it is the one of the largest B2B marketplace for tours and activities in Asia, linking over 2,000 partners with more than 80,000 products from 120 cities. GlobalTix’s cloud-based and platform agnostic e-ticket distribution platform serves to connect tourist attractions and niche services with online and offline travel agents across the globe. Its integrated solution supports attraction owners’ online sales, empowering them to meet end consumers’needs via real-time bookings and the convenience of a single, all-in-one paperless ticket.GlobalTix solution won the Best Business Innovation Award by Singapore Tourism Board. With a passionate team, we were rewarded with the 8th fastest growing companies in Singapore in 2020 and ranked 34 in Asia-Pacific.The company, which was launched in 2014, has offices in Singapore, Malaysia, Thailand, Indonesia and Philippines. It handles more than S$150 million worth... of transactions on its platform annually. GlobalTix works with customers such as Singapore Airlines, Wildlife Reserves Singapore, Nerf Action Xperience, National Gallery Singapore, Kidzania Thailand, Escape Theme Park in Malaysia, Viator and TripAdvisor, among others.The RoleSoftware DevelopmentBe a Scrum development team member Ability to collaborate with team effectivelyAble to support storyboarding effort of the teamCapability to contribute in all phases of the development cycleDevelop and enhance applicationsDevelopment activities are expected to be carried out with minor supervisionAble to deliver working software on timeAble to design and develop high quality code as per standards and guidelinesPeer-Review of codeCan perform peer-review to ensure code quality and requirements are metSoftware SupportSupport SIT and UAT activitiesAble to assist smooth delivery of software to SIT and UAT environmentsProvide support for productionCapable to fix assigned bugs quicklyAble to update status and work details in Bug/Issue Tracking SystemIdeal ProfileCandidate must possess at least Bachelor's Degree/Post Graduate Diploma/Professional Degree in Computer Science/Information Technology or equivalent.Minimum of 2 years of experience in software developmentPossessing any of the certifications or equivalent would be an added advantage a) Certified JAVA Developer b) Certified Scrum Developer (CSD)Strong analytical skills, able to solve complex problemGood knowledge and implementation of REST APIsKnowledge of Agile and ScrumExperience with modern web technologies, HTML5, CSS3Experience with Javascript and frontend frameworks e.g. AngularExperience with JDK 1.5 and above, J2EE and Spring, Hibernate framework, Grails/GroovyKnowing C, C++ and C# is advantageousExperience with J2EE application servers GlassFish, Jetty or equivalentWorking with Databases – MySQL, Oracle, SQL Server or equivalentKnowledge of Design Patterns e.g. MVCFamiliar with source control management system such as SVN, GIT or equivalent.Familiar with usage of bug tracking system such as BugZilla, JIRA or equivalent.Experience with mobile hybrid development as well as native e.g. Cordova/PhonegapAble to communicate in English fluently both verbal and writtenWhat's on Offer?Great work environmentWork alongside & learn from best in class talentOpportunity to make a positive impact", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBEZXZlbG9wZXIgKEJCLUE0N0VBKSIsImNvbXBhbnlfbmFtZSI6Ikdsb2JhbHRpeCBQdGUgTHRkIiwiY29tcGFueV9taWQiOiIvZy8xMWR4cHFkaHJmIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoicE00Q0dpSHBNX1VwekJUWEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZZQkNyY0JRVTVWWDA1eFZFRnJiV0p0ZFMxSWIxVTNORlpITldkc2VtNVBkR2hwUTI5bmJURjJWVXh2TFhsWWRsWklVbWRqV1d3eFMzZDNkVEU0TVdZeVRFZHVSVVJKVWt4NmJua3hiVkUyTFU0M2JYZEpVMUJzWHpWa2VHdE9VVVJTWlhGbVVrbHRUM2xaV25oZlZGUnNlVTQ0TW5CM1ducFBSVkpQY25SUFdWVlRWMncwUlhoUVl6SXpWMjl2Ym5VNFJWVmtaRkpaTXpKVlEwRjJURlEyZDA1alh6UktUMVY0UTNsbFNqVnZha1JUV2t0WVZsbGZlblpyRWhZMmJuRkRXVXN6TmsxT1NFWXRaMVJ0Y0VseWIwRlJHaUpCVDAxWlVuZEVUV3hTZFVFd1QxVldTVU56WTNCWmJYUk1NVUZUVm5CVVQxQlIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18xMSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCZUJlZSIsImxpbmsiOiJodHRwczovL3NnLmJlYmVlLmNvbS9qb2IvMjAyMTA0MTctYjg4YTZkMjgwYmMyYTBjMjNkYTc4MjA3MzllYTQ3ZWE/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Senior Java Software Engineer", "company_name": "ThinkAnalytics", "location": "Singapore", "via": "via NodeFlair", "description": "Are you a talented, motivated and ambitious senior technologist looking for a role where you can take ownership whilst remaining hands-on with technology?\n\nYou could be joining the Global leader in personalized content discovery and viewer insight, delivering to 80+ customers worldwide including Sky, HBO, Astro and Singtel.\n\nAs a senior member of the team in Singapore, you’ll take on a lead role in the design, development, testing and deployment of solutions tailored to meet bespoke customer requirements. You’ll collaborate with external customers and internal teams including development, operations, information science and testing. In addition, you’ll guide more junior members of the team, ensuring best practices are followed in order to deliver consistently high quality and robust solutions.\n\nKey Skills\n\nWe’d like to hear from you if you have the following:\n\nInterpersonal\n• Excellent written and verbal communication skills\n• First class analytical and problem-solving skills\n•... Diligent, methodical and attentive to detail\n• Self-starter, self-motivated and adaptable team player\n• Fast learning, enjoys solving complex problems and creating simple solutions\n• A passion for developing quality code and embracing improvement in development practices\n\nTechnical\n• Extensive practical experience of Java Software Development (ideally for 5 years +)\n• A breadth of experience across the full development lifecycle\n• Excellent knowledge of core Java including working experience of Spring, SQL and RDBMS\n• Version control using Git\n• Experience in system design and architecture\n• Experience of automating processes at scale\n• Experience with infrastructure components and their integration into application architecture\n\nDesirable\n• Experience of using tools and systems such as;\n• Atlassian products e.g. JIRA, Bitbucket\n• CI/CD tools\n• NoSQL\n• Kafka\n• Docker\n• Linux\n• AWS experience (if you have an AWS certification this is an advantage!)\n• Experience of both local and remote people management\n\nSuccessful candidates will work on a variety of projects related to our core products and will receive mentoring from our development experts. This will provide the priceless experience of new emerging state of the art technology as well as the entire software life-cycle while working within a team that delivers world-leading solutions.\n\nSee the world\n\nWe are jointly headquartered in Glasgow and Los Angeles, with additional offices in London, Singapore, and India. If you enjoy travel or just want to experience other parts of the world, there are regular opportunities for short or long-term secondment to our other development offices", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgSmF2YSBTb2Z0d2FyZSBFbmdpbmVlciIsImNvbXBhbnlfbmFtZSI6IlRoaW5rQW5hbHl0aWNzIiwiY29tcGFueV9taWQiOiIvbS8wMTF0MnFyZCIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6InJVcVc1aWtUOXVRVWlDODZBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhVbUpEYVdOblMwbFFObmxFWkV0UGVsOU5TbEkwYTJwQlFsTTNSMU10U0RoeVRsZ3lNRlYwVXpaSFZHMHpkRzkyVkZwc1pWY3labE5EVlcxaGJqUkxMV3BHT0RoRVlXdHVSbUZLTVZodGRVWjBUbGxyYW10NGJYQklVRU5HZWxaa04xaFhOazlGVTBka1gyTkpOR3RmUlhacFJYcFlNbFpuUjNWbk5XMXFTVEUwTm5SRFNVeEliMlk0V2xwR1lrSTBaVzFyUlhCdloxWlRhbE5CRWhZMmJuRkRXVXN6TmsxT1NFWXRaMVJ0Y0VseWIwRlJHaUpCVDAxWlVuZERSVmgzTmxkWlUxTmpZMHA2TjA5T00yWmhkRGx2VWtjNFMyeDMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18xOCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBOb2RlRmxhaXIiLCJsaW5rIjoiaHR0cHM6Ly93d3cubm9kZWZsYWlyLmNvbS9qb2JzL2xpc3RpbmdzLzg1MTk/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Senior Lecturer / Lecturer - Software Engineering/Fintech", "company_name": "Nanyang Polytechnic", "location": "Singapore (+1 other)", "via": "via Glassdoor", "description": "Responsibilities\n\nDevelop course including curriculum development, course delivery and project supervision\n\nSpearhead and identify new opportunities, initiatives and collaborations with the industry\n\nPlan, lead, manage and undertake project development with industry\n\nRequirement\n\nAt least 3 year(s) of relevant experience in related domain\n\nRelevant qualification in the area of Computer Science, Engineering, Information Technology or related fields of study\n\nProficient in programming languages such as Python and Java/C#\n\nHands on and deployment experience in at least one database (Oracle, MS SQL, MySQL and NoSQL) including SQL scripting and modeling\n\nExtensive experience in managing and participating in software engineering projects\n\nStrong knowledge of good software architecture practices including design patterns, object-oriented programming practices, and service architecture patterns\n\nFluent in agile development methodologies such as SCRUM. Experience in leading SCRUM teams or... being a SCRUM master would be advantageous\n\nProficient in modern development practices, such as DevOps\n\nKnowledge in software testing and security testing\n\nStrong knowledge of the various blockchain platforms such as bitcom, Ethereum, etc\n\nFintech or financial service industry experience is a plus\n\nHands-on experience in fintech-related projects such as, such as blockchain and artificial intelligence (Al)/machine learning, is a plus\n\nPreferably with at least one professional relevant certification: PMP or CITPM", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgTGVjdHVyZXIgLyBMZWN0dXJlciAtIFNvZnR3YXJlIEVuZ2luZWVyaW5nL0ZpbnRlY2giLCJjb21wYW55X25hbWUiOiJOYW55YW5nIFBvbHl0ZWNobmljIiwiY29tcGFueV9taWQiOiIvbS8wM3g2OTMiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJ1SThYMHd6a0xyTlM5LW5XQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdllCQ3JjQlFVNVZYMDV4VTNGV2NXTTRaa2hwUkc0d1VHNDJaVTFFZERSRlozRnpkMlpMT1dSTVJqbDRiSFl5ZGpKcE1IRXpWV051VFVveWNIVjRjMTlxU0RSQmVIQTRUbTFXU0VkMGJGaDNiMnM0VlRsaFZtOVROMjUxUzJkak1tbE1kbVZYVVZCWlNtNDFiek5xU1dwRVpYVjRNVGhtTkc0MlQzSTVURTFSTFRWUWIydGtjakZaZW1aUVFtaFhhRVZuUm5aUVVsRjVkRFphVW5adGNpMXBTM1JRZVhsSFZFNXBXakZtTldreFUwaE5ZMjAyV1ZGWU5VdEpFaFkyYm5GRFdVc3pOazFPU0VZdFoxUnRjRWx5YjBGUkdpSkJUMDFaVW5kQ1V6VkZlbk0xUVc5QmRVdEZaR0ZMYlZCbmFGZE9SWEU1VWxGMyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzI1IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEdsYXNzZG9vciIsImxpbmsiOiJodHRwczovL3d3dy5nbGFzc2Rvb3Iuc2cvam9iLWxpc3Rpbmcvc2VuaW9yLWxlY3R1cmVyLWxlY3R1cmVyLXNvZnR3YXJlLWVuZ2luZWVyaW5nLWZpbnRlY2gtbmFueWFuZy1wb2x5dGVjaG5pYy1KVl9JQzMyMzU5MjFfS08wLDUzX0tFNTQsNzMuaHRtP2psPTM2NzY5NjgwNzdcdTAwMjZ1dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Advanced Mech Design Engr", "company_name": "Honeywell", "location": "Singapore", "via": "via Monster", "description": "Experience: 10 - 13 years\nSkills: printing technologies, design documentation, validation, solid works, supply chain, design and development, dfx, product design, dfmea, six sigma, product support, pro-engineer, responsible, me cad systems, product specification, cost estimates, problem solving, supervision, design documents, excellent communication skills., cad, mechanical design, mechanical systems, printers, analytical, project work, marketing, team player, Simulation Engineer, System Tools Engineer, Navigation Engineer, FPGA Design Engineer, Radar Systems Analyst, GPS Integration Engineer, Embedded Hardware Engineer, FPGA DSP Engineer, System Development Specialist\nIndustry: Electronics Manufacturing\nFunctional Area: IT,Engineering - Mechanical/Automotive/Industrial,Engineering - Environmental/Health/Safety\nJoin the industry leader to design the next generation of breakthroughs\n• Design and Development of Mechanical Systems for Thermal Barcode Printers\n• Responsible for Mechanical... design and development, detailed design of mechanical sub-systems and components, with the ability to handle design reviews, design calculations, design simulations and Dfx.\n• Responsible for design documentation which include detailed design documents, product specification, Engineering Change Notices, BOM, project schedules, cost estimates.\n• Responsible for developing Engineering Validation Test Plan, and performing validation of new design.\n• You will work closely with other functional groups in engineering, quality, service, marketing, product support, NPI partners and supply chain\n\nQualifications:\n• Minimum Bachelors degree in Mechanical/Mechatronics Engineering or equivalent.\n• At least 10 years of product design experience. Knowledge and experience in the fields of dynamic mechanisms, gear train, stepper motor, and paper/media feed systems. Experience in Printing technologies preferred\n• Proficient in ME CAD systems like Pro-Engineer, Solid Works\n• Experienced or Certified in Six Sigma (DFSS) is a PLUS\n• Ability to work with team members, cross-functions, and external partners in technical and project matters\n• Have Problem solving and analytical skills, confident with project work, assertive and able to work independently with minimum supervision.\n• Knowledge in DFMEA/DFx preferred\n• Team player with excellent communication skills", "extensions": ["5 days ago", "Full–time"], "detected_extensions": {"posted_at": "5 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBZHZhbmNlZCBNZWNoIERlc2lnbiBFbmdyIiwiY29tcGFueV9uYW1lIjoiSG9uZXl3ZWxsIiwiY29tcGFueV9taWQiOiIvbS8wMWd4NjYiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJOUTg1N3YtOHlvNWJyc25kQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VXpaeFpXeFhTa2N3UkZnMlpEUktNbUZDV0RVek9HaFRkbWRLV1VWVGFURlFlSFEwTnpSRVlUUTVZakI0TUU1eFlTMXpRVmgyWjJObmRXY3hUalZuWWxKTVNFOTVlbEJWZG1jM2NuTjZiWGRYU1ZCT1ZWSnNha0YwYnpaSlIzbERRVGhtUjFkUGVYQmtVRXRyZFV3eGFHVTFMVmRMVHkwMmNIWTROSEZCT1RoWFYxZHpSRXRoZGtsWFMxVnBPWGMxYzBKakxUWllSV3MyTUhaM0VoWTJibkZEV1Vzek5rMU9TRVl0WjFSdGNFbHliMEZSR2lKQlQwMVpVbmRFWmpOUlZVWnlSRTlLYjJ0RmNEZEpkakZ6TVRWMWIyMWpSMlpCIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMzMiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTW9uc3RlciIsImxpbmsiOiJodHRwczovL3d3dy5tb25zdGVyLmNvbS5zZy9hbXAvam9iLXZhY2FuY3ktYWR2YW5jZWQtbWVjaC1kZXNpZ24tZW5nci1ob25leXdlbGwtc2luZ2Fwb3JlLTEwLTEzLXllYXJzLTI3NzU2ODAzLmh0bWw/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Senior Software Engineer", "company_name": "Metropolitan Wireless International Pte Ltd", "location": "Singapore", "via": "via Jobs | Fidanto", "description": "Metropolitan Wireless International Pte Ltd. Posted on 12-Mar-21 Senior Software Engineer Metropolitan Wireless International Pte Ltd. Job DescriptionResponsibilities Designing, developing and testing assigned modules – this will include module design and test documentation Code development and peer reviews Module testing and reporting Carrying out related QA activities, attending quality audits Installation and testing of application at site Carrying out user training Troubleshooting & maintenance of application. Requirements Bachelor's degree in Computer Science from a reputed Institute/University. Minimum 6 years of development work experience in Core Java multi-threaded client-server applications is mandatory (or) Oracle Java Certification with minimum 3-years’ experience. Minimum 3 Year(s) of working experience as Full Stack Developer Experience with backend framework such as Java (Spring Boot), NodeJs Experience in designing and developing APIs Working experience in the... following frameworks – Multi-thread applications using core Java - mandatory Hibernate for Database – desired Familiarity with design patterns and OOP design concepts - mandatory Familiarity with Relational SQL Database - mandatory Other protocols – RPC, JSON, CORBA, SNMP, MODBUS, etc. – any or all desired Experience in mobile app development is a plus. Familiar with project models and object-oriented software development methods. Outstanding analytical skills, strong verbal, and written communication skills Good analytical capability to troubleshoot and fix software issues. Passionate about software programming. We look forward to working and growing together with the successful candidate.Only shortlisted candidate will be notified. Thank you for applying!Additional Information Senior Executive Qualification Bachelor's Degree, Post Graduate Diploma, Professional Degree Metropolitan Wireless International is established in January 2009 and specialize in designing and developing state of the art solutions using mobile wireless communication technologies.Our solutions are general designed for the purpose of Safety and Communication. We strive in the Public Safety & Transportation sector as well as Security and Aviation industry.We are a growing IT Software Company based in Singapore and we offer the following: Responsive and Friendly team State of the art technologies to work with Being a small company means that we are always there for each other and we take great care of employees and clients alike. We are basically a family.We have done work for SMRT Corporation, Delhi Metro, MTR Corporation, SAMART Telecoms, Singapore Police Force, and Indonesia Military.As we are a Certified TETRA Partner, most of our application and software design revolves around Radio Dispatcher for the Trains & 2-way Radio Walkie Talkies. But as technology is advancing, we are no strangers to Data Applications such as Push-to-Talk over Cellular.We are actively pursuing Indoor Positioning and Internet of Things (IoT) as well.Hence, we are looking for more people to join the company and diversify the business. Most importantly, we want to grow together.Additional Company Information Registration No. 200814930Z Company Size 1 - 50 Employees Benefits & Others Miscellaneous allowance, Medical, Regular hours, Mondays - Fridays, Business (e.g. Shirts", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgRW5naW5lZXIiLCJjb21wYW55X25hbWUiOiJNZXRyb3BvbGl0YW4gV2lyZWxlc3MgSW50ZXJuYXRpb25hbCBQdGUgTHRkIiwiY29tcGFueV9taWQiOiIvZy8xMWc5bV94YmM0IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiUGpzUzVMUGRaZUF0WFA0aUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXJZQ0N2Y0JRVTVWWDA1eFVsTkRTVUZRV0doQlVFb3llR1Z0U0VkSWNFbGhkRGRvV25NNFN6SkJXbVJNVlZseWFEaElkVVJCYkdaNFRYcFFNSEZUZDNGUFNITTFWMlJvZUdaNVltOXNSQzFxTjNWclQwUjNiM1o1U2t4eFYwTXdOVk4zU1dwSlZXZFlRbXM0V0U0NGNrbDRjVWhXUnpJMVVtd3habFpSYUZBeVZVeEJZM2QxTFVKSk5VRmhlRUZFZEhKdVdGaEJSMmhKTld4ek1USXlTRzFKTlhCeFZHMVpTMG90YW04dFlrWkVRbkJ6Ym05eGRGaDBWSFpwWVhJeFZVcFFOemhFWkRKcVdqbE1RVTVxZDFWaWR6QnlZMFo1YzNoR09IZFFjQzFMWTNkNldEaGtiMUl5WlVOMFVWcENZbHBzV0dWTWVXdHVXRmxaVlJJV05tNXhRMWxMTXpaTlRraEdMV2RVYlhCSmNtOUJVUm9pUVU5TldWSjNSRUZCWTBsc1dHaDBiVzVXZWkxVlZVUTVhbnBFTFVKS1NrVTFVUSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzQwIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnMgfCBGaWRhbnRvIiwibGluayI6Imh0dHBzOi8vc2cuZmlkYW50by5jb20vam9icy9qb2Itb3BlbmluZy9zb2Z0d2FyZS1kZXZlbG9wZXJzLXN5c3RlbXMtc29mdHdhcmUvc2VuaW9yLXNvZnR3YXJlLWVuZ2luZWVyLTI3NTIxODI1MT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior Software Engineer / Software Engineer (Java with Angular / ReactJS)", "company_name": "EPAM Systems", "location": "Singapore (+1 other)", "via": "via Bayt.com", "description": "EPAM is committed to providing our global team of more than 41,150 EPAMers with inspiring careers from day one. EPAMers think creatively and lead with passion and honesty. Our people are the source of our success. We value collaboration, work in partnership with our customers, and strive for the highest standards of excellence. In today’s market conditions, we’re supporting operations for hundreds of clients around the world remotely. No matter where you are located, you’ll join a dedicated, diverse community that will help you discover your fullest potential.\n\nDESCRIPTION\nWe are looking for an experienced Senior Software Engineer / Software Engineer (Java with Angular / ReactJS) in Singapore to make the team stronger.\n\nWeb-based applications development in the business domain of a financial services client.\n\nFull-cycle web application development using Agile approach:\n1. Idea generation and high-level vision creation;\n2. Solution design and documenting, proposal;\n3. Development... testing, and Production launch.\nResponsibilities\n• Be a member of a cross-functional team that experiment with new technology and proactively searches for the best solutions and ideas in the marketplace\n• Coordinate your work with other developers to deliver first-class technology solutions in a positive, fun, yet challenging and deadline driven environment\n• Work closely with other Product and Technology teams, internal and external, to bring technology solutions and perspectives to the product development process\n• Provide input on, follow and evangelize code quality guidelines and standards\n• Participate in code reviews to highlight best of breed solutions\n• Identify/troubleshoot application code-related issues, and review and provide feedback to any required final user documentation\nRequirements\n• Degree in Computer Science or equivalent\n• At least 7+ years of experience in Java/J2EE development\n• Hands-on project experience in Angular/ReactJS is a must\n• Experience in application and system design with OOA/OOD, UML Modeling\n• Project / hands-on experience with J2EE standard\n• Good programming experience with Java (EJB, Servlets, JSP, JDBC, ect, WebSphere Application Server on Unix and Windows platforms for 4-5 years\n• Experience in Hibernate, Spring frameworks a must. Experience of Struts will be a plus\n• Knowledge of database design, familiarity with Oracle SQL and PL/SQL a must\n• Sound knowledge of application security issues such as authentication, authorization and auditing\n• Experience with internet/intranet infrastructure/integration projects preferred\n• Strong communication skills and good command of English. Excellent technical writing skills\nWe offer\n• Friendly team and enjoyable working environment\n• Work-life balance and flexible schedule\n• Online training library, mentoring, career development and potential partial grant of certification\n• Unlimited access to LinkedIn learning solutions\n• Referral bonuses\n• Compensation for sick leave and paid time off\n• Opportunities for self-realization", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgRW5naW5lZXIgLyBTb2Z0d2FyZSBFbmdpbmVlciAoSmF2YSB3aXRoIEFuZ3VsYXIgLyBSZWFjdEpTKSIsImNvbXBhbnlfbmFtZSI6IkVQQU0gU3lzdGVtcyIsImNvbXBhbnlfbWlkIjoiL20vMGRsbnJjIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiMTFWZkUzalFqUXByMGdyS0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFVUbEtWMmczV2xGSmNFZzBZVlEyV0VOQ2VXbDVPV3MyV2pVd1UwNHpia0pXTjI1MmFqSm1ablk1YldGVVVsQXpSVXhEVmtOWFEwVk9lRGg0WjNCSldFNXVNSHBwVjFNeVJteFZjMU5YUmxwTmVrVnJhM2x1Y1RCbVNERlZSM0ZQVFVvelZHb3RjWGMzWm1JMFRXMUJTV1pZZGtWcVFUSnFiSFJuYzIxcE5VSmliVk13ZEdWVlprTlFUa2d4WjI0MGFtaG1jR2xKY2pKNFNWZFJFaFkyYm5GRFdVc3pOazFPU0VZdFoxUnRjRWx5YjBGUkdpSkJUMDFaVW5kQ2NUaFFVMVowUWpNM1ZpMWFRa056Y3pZeFdHUXRhbXhVUkRCbiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzQ3IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJheXQuY29tIiwibGluayI6Imh0dHBzOi8vd3d3LmJheXQuY29tL2VuL3NpbmdhcG9yZS9qb2JzL3Nlbmlvci1zb2Z0d2FyZS1lbmdpbmVlci1zb2Z0d2FyZS1lbmdpbmVlci1qYXZhLXdpdGgtYW5ndWxhci1yZWFjdGpzLTU3NDI1ODUyLz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Avaloq Developer / Senior Avaloq Developer (BB-731DB)", "company_name": "MAYBANK SINGAPORE LIMITED", "location": "Singapore (+1 other)", "via": "via BeBee", "description": "Roles & ResponsibilitiesResponsibilities :- Implement and deliver technical solutions on Avaloq as per customer requirements; Analyze and resolve incidents and defects reported by the users; Maintain, review and improvement of existing code base; Solution documentation Requirements A good degree in Computer Engineering; Preferred Avaloq Certified Professional with a 3 - 8 years of hands-on experience in Avaloq; Good communication skills and team player; Able to muilti-tasked in a fast-paced environment.Tell employers what skills you haveCollaborationComputer EngineeringDynamic ProgrammingProject Planningcommunicateenvironmentcustomer requirementshands-on experiencetechnical solutionsMulti-tasker", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBdmFsb3EgRGV2ZWxvcGVyIC8gU2VuaW9yIEF2YWxvcSBEZXZlbG9wZXIgKEJCLTczMURCKSIsImNvbXBhbnlfbmFtZSI6Ik1BWUJBTksgU0lOR0FQT1JFIExJTUlURUQiLCJjb21wYW55X21pZCI6Ii9nLzExZnQ1aGhkMWQiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJuYWdfZ200QzVCMlVwREZBQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFb3NDQ3N3QlFVNVZYMDV4Vkhsc2RrUjJNVmxZYVdkd1lrNUtZa1Z0UmpGUmNubElVbFZYTUd0aGFUUTJaMFZGTVU1VldsVjZRVGhHWjNOSWJrbDFiVjlDVFZsWlZHdHhSMHAxYm1ONE0wTTBhRGQ0Y1U1VFpqbFBVbTgzZVVOZk9YTmZXbXBVWms5UllqTXlYM05yUlU1U1ZscGlUelZoWTNoalozWkllWEZvZGtkMFlUVlVjakJpV0U5QlpXbzBhMHMzV1dkMFkwVnFTalpWUVdOcWVsbG5jM3BNWjJkWlYyWk1MVUZFYTA1NllqUlBkbmxXWW5kcGRXWlFTRUkxZGtOcVJpMDFSa3hmZDFKcmFVdE9kV3BQRWhZMmJuRkRXVXN6TmsxT1NFWXRaMVJ0Y0VseWIwRlJHaUpCVDAxWlVuZEVOa3cyYWxGdVFqUkRSSFEzVnkxRFpWSk1abkZQTVZGdWQwSm4iLCJmY3YiOiIzIiwiZmNfaWQiOiJmY181NCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCZUJlZSIsImxpbmsiOiJodHRwczovL3NnLmJlYmVlLmNvbS9qb2IvMjAyMTA0MTctNGU1MDBhY2I5MDA3ZjIyMzhhNDBhNjlhYjFiNzMxZGI/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Cloud Solutions Engineer - AWS", "company_name": "SHIELD - Autonomous Risk Intelligence", "location": "Singapore", "via": "via NodeFlair", "description": "As a Cloud Solutions Engineer, you will be responsible for enhancing our current services and application architectures critical to support our cyber fraud and identity solutions. This role requires an extensive knowledge of security concepts and cloud technologies to develop high-performing, high-availability, scalable and efficient application patterns for the cloud. The ideal candidate should be a keen problem solver and a hands-on team player who is passionate about helping businesses stop fraud and abuse.\n\nRESPONSIBILITIES\n• Assist the team in design, planning, management, maintenance and support of cloud infrastructure for high traffic workloads that operate at enterprise scale\n• Research and implement technology solutions to improve the performance, reliability, availability, security and efficiency of infrastructure\n• Identify risks (infrastructure, network, security) early and ensure they are addressed before they become actual problems\n• Setup, testing and implementation of... technologies on multiple cloud environments\n• Automate tasks and implement infrastructure services\n• Day-to-day monitoring, configuring, backup, and maintenance of systems cloud environment to optimal performance\n• Heavily execution-drive\n• Require periodic after-hours/weekend support\n• Troubleshooting, performs root cause analysis, and working closely with developers to implement corrective/preventive actions during and after an incident\n\nREQUIREMENTS\n• Minimum 5 years of experience\n• Minimum Bachelor Degree in Computer Science, Computer Engineer or related fields\n• Experience in developing and operating services and infrastructure in AWS. Aliyun/GCP experience is a plus\n• Experience with containerization and container orchestration services like kubernetes\n• Working knowledge of Linux OS and setting up monitoring/logging/tracing systems. Experience in setting up compliance systems like PCI DSS/SOC 2 is a plus\n• Experience in infrastructure automation tools such as Ansible/Jenkins\n• Experience with setting up application monitoring tools like Prometheus/Grafana\n• Prior experience in e-payments or e-commerce industry is a plus\n• AWS Associate/Professional certification will be an advantage\n• Able to work in a fast-paced environment\n\nPERKS\nIn order to ensure that our Agents are in tip-top condition, we’ve got you covered from your physical to mental well-being:\n• A truly flexible working environment\n• In-house gym and shower facilities\n• Latest games on the PlayStation and VR\n• Dinner and transportation covered if you ever need to work late\n• Team sports, movie screenings, celebrations and more\n• Tech gadgets you need to help you do amazing work\n• Possibly the best pantry you have ever seen\n• All the merch and more", "extensions": ["7 days ago", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDbG91ZCBTb2x1dGlvbnMgRW5naW5lZXIgLSBBV1MiLCJjb21wYW55X25hbWUiOiJTSElFTEQgLSBBdXRvbm9tb3VzIFJpc2sgSW50ZWxsaWdlbmNlIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJUZFdCUTFRVXZkUm1MV2ttQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE5vZGVGbGFpciIsImxpbmsiOiJodHRwczovL25vZGVmbGFpci5jb20vam9icy9saXN0aW5ncy8xMjUxMT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "System Engineer*", "company_name": "Singtel Group", "location": "Singapore", "via": "via Singtel Careers", "description": "Systems Engineer\n\nSystems Engineer who will be responsible for maintaining and administering the organization computer systems & networks. The primary duties will include maintenance of computer networks, hardware, software, and other related systems, performing disaster recovery operations, protecting data, software, and hardware from attacks, and replacing faulty hardware components when necessary. Engineer will also be working closely with customer POC to identify potential issues and fix existing problems in accordance with the specifications & service level.\n\nResponsibilities includes:\n• Maintaining and administering computer networks and related computing environments including systems software, applications software, hardware, and configurations.\n• Align or enhance ITSM/ITIL methodologies in daily operations e.g. Change, Incident, problem, release management & CMDB.\n• Respond promptly to incident, root cause analysis & provide temporary and/or permanent resolution of incidents... escalated.\n• Monitor & measure the performance & availability of the network & systems proactively which include daily, weekly & monthly checks and reporting.\n• Leading in the development / adoption and enforcement of Information Security policies, procedures and standards. Conduct review in accordance with customer / statutory requirements\n• Define, create and maintain the documentation for certification and accreditation of each information system in accordance with customer / statutory requirements.\n• Protecting data, software, and hardware by coordinating, planning and implementing network security measures. Maintaining appropriate security measures and mechanisms to guard against unauthorized access to electronically stored and /or transmitted patient data and protect against reasonably anticipated threats and hazards.\n• Review network & systems in order to identify potential security weaknesses, recommend improvements to amend vulnerabilities, implement changes and document upgrades. Oversee and/or assist in performing on-going security monitoring of organization information systems.\n• Assess the impacts on the network & system modifications and technological advances. Establishing new solution that meets the minimum mandatory risk based technical, operational, and management information security control requirements.\n• Lead / participate in system related projects such as server migration, new infra setup, disaster recovery exercise etc.\n• Business oriented and able to work according to our customers requirements in a professional manner.\n\nThe ideal candidate should possess the following:\n• Bachelor's degree in computer science and technical certification\n• Minimum 5 years’ experience Systems Administration\n• 2 years comparable working experience in any of the following areas: SCCM, Bigfix, Sharepoint Bomgar, HPSM, ServiceNow, Uipath, backup & storage solution\n• Strong technical aptitude with a specialization in design, implementation and review of systems architecture, engineering and/or process", "extensions": ["13 days ago", "Full–time"], "detected_extensions": {"posted_at": "13 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTeXN0ZW0gRW5naW5lZXIqIiwiY29tcGFueV9uYW1lIjoiU2luZ3RlbCBHcm91cCIsImNvbXBhbnlfbWlkIjoiL20vMDIwemZsIiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiTEhaMVYwTjF4NXJhZnkySkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFUwUkNkSFEyU1RsZmJXTkhjelZmYkRGQ2Ixa3hkWE5GUTNsak9FVmZORGgyYmpkTlpYSkhaRlphYm5jMVRUQTNTMFp0WlVSNlFrMDJNWEJaWVhrM2JrUk1PRW95Tmpack5FNDRhREJmYkVOT1gwOUJOMFpGTFZCWFkwbDBlRUZQYUdoeU0wbGlWbDlDTTNGblFYUTRiV3QwV1ZablYxSjZOVUpKUWxndFpFdHljRmcyUVZOaVJXSnpaMEZaZUdKSVdVRjFhMHhXYlRCa01qbEJFaFkyYm5GRFdVc3pOazFPU0VZdFoxUnRjRWx5YjBGUkdpSkJUMDFaVW5kQ2VuQjJkVkJoV2tReGVsRkRUM2xMUjJSd2VrOXVlbkU1ZW5GMyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzY1IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFNpbmd0ZWwgQ2FyZWVycyIsImxpbmsiOiJodHRwczovL2dyb3VwY2FyZWVycy5zaW5ndGVsLmNvbS9qb2IvU3lzdGVtLUVuZ2luZWVyLVNpbmcvNTcwODg1NTEwLz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}], "chips": [{"type": "Title", "param": "job_family_1", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Software engineer", "value": "software engineer"}, {"text": "Senior", "value": "senior"}, {"text": "Engineer", "value": "engineer"}, {"text": "Cloud engineer", "value": "cloud engineer"}, {"text": "Test engineer", "value": "test engineer"}, {"text": "Assurance engineer", "value": "assurance engineer"}, {"text": "Research engineer", "value": "research engineer"}, {"text": "It engineer", "value": "it engineer"}, {"text": "System engineer", "value": "system engineer"}, {"text": "Data engineer", "value": "data engineer"}, {"text": "Devops engineer", "value": "devops engineer"}, {"text": "Java engineer", "value": "java engineer"}, {"text": "Network engineer", "value": "network engineer"}, {"text": "Principal engineer", "value": "principal engineer"}, {"text": "Qa engineer", "value": "qa engineer"}, {"text": "Quality engineer", "value": "quality engineer"}, {"text": "Research associate", "value": "research associate"}, {"text": "Solutions engineer", "value": "solutions engineer"}, {"text": "Technical", "value": "technical"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Associate", "value": "associate"}, {"text": "Associate engineer", "value": "associate engineer"}, {"text": "Automation", "value": "automation"}, {"text": "Design engineer", "value": "design engineer"}, {"text": "Development engineer", "value": "development engineer"}, {"text": "Development manager", "value": "development manager"}, {"text": "Engineering manager", "value": "engineering manager"}, {"text": "Firmware engineer", "value": "firmware engineer"}, {"text": "Frontend engineer", "value": "frontend engineer"}, {"text": "Hardware engineer", "value": "hardware engineer"}, {"text": "Lead engineer", "value": "lead engineer"}, {"text": "Lecturer", "value": "lecturer"}, {"text": "Manager", "value": "manager"}, {"text": "Network systems", "value": "network systems"}, {"text": "Officer", "value": "officer"}, {"text": "Principal", "value": "principal"}, {"text": "Product engineer", "value": "product engineer"}, {"text": "Programmer", "value": "programmer"}, {"text": "Project officer", "value": "project officer"}, {"text": "Science", "value": "science"}, {"text": "Security engineer", "value": "security engineer"}, {"text": "Senior engineer", "value": "senior engineer"}, {"text": "Senior lecturer", "value": "senior lecturer"}, {"text": "Senior system", "value": "senior system"}, {"text": "Senior technical", "value": "senior technical"}, {"text": "Services engineer", "value": "services engineer"}, {"text": "Software architect", "value": "software architect"}, {"text": "Specialist", "value": "specialist"}, {"text": "Stack engineer", "value": "stack engineer"}, {"text": "Systems analyst", "value": "systems analyst"}, {"text": "Systems engineer", "value": "systems engineer"}, {"text": "Technical marketing", "value": "technical marketing"}, {"text": "Testing engineer", "value": "testing engineer"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Wholesale", "value": "/business/naics2007/42"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Rental", "value": "/business/naics2007/532"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": ".AB4Jjf.qPB6Vc{padding-right:11px}.qfpP8d{padding:7px 0 7px 11px}.S003Ke{flex:none}.ZoN4Lb{color:rgba(0,0,0,.54)}.nAXVG{color:#70757a}.IxQsL{color:rgba(0,0,0,.26)}.xFO1De{color:#fff}.ooFpK{color:rgba(255,255,255,.30)}.mtnwac{color:#4285f4}.WxeeKb{color:#34a853}.hIVRU{color:#f29900}.EXaTMc{color:#fbbc04}.sxn46d{color:#000}.gqMTF{color:#1a73e8}.zpn8Mb{color:#d93025}.dEUPmd{color:#1e8e3e}.PJNo1{color:#fbbc04}Actively Hiring", "value": "e"}, {"text": "EPAM", "value": "/m/0dlnrc"}, {"text": "VISA", "value": "/m/01kqjn"}, {"text": "Nanyang Technological University", "value": "/m/0l49k"}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "HCL SINGAPORE PTE. LTD.", "value": "/g/11fy25ngsv"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "Zühlke", "value": "/g/1hh_rg216"}, {"text": "Experis Singapore", "value": "/g/11dxpnwm3s"}, {"text": "OakTree Consulting", "value": "/g/11g70jfhtq"}, {"text": "Realtek Malaysia", "value": "/m/05wrm7"}, {"text": "TikTok", "value": "/g/11fy265933"}, {"text": "UST", "value": "/m/08kb8g"}, {"text": "UrbanFox", "value": "/g/11ghs7y0w6"}, {"text": "Activate Interactive Pte Ltd", "value": "/g/11dxq192l5"}, {"text": "Cardinal Health", "value": "/m/040vzx"}, {"text": "Cognizant", "value": "/m/03bf9h"}, {"text": "Collins Aerospace", "value": "/m/0kv61y1"}, {"text": "Credit Agricole Group", "value": "/m/028vbm"}, {"text": "DELL", "value": "/m/0py9b"}, {"text": "EPS Consultants Pte Ltd", "value": "/g/11gbxgscvy"}, {"text": "GlobalTix Pte Ltd", "value": "/g/11dxpqdhrf"}, {"text": "HCL Technologies", "value": "/m/0698gv"}, {"text": "Jobline Resources Pte Ltd", "value": "/g/11gp2647pn"}, {"text": "Metropolitan Wireless International Pte Ltd", "value": "/g/11g9m_xbc4"}, {"text": "Microsec", "value": "/g/11f00w21ts"}, {"text": "NCS PTE. LTD.", "value": "/m/0282746"}, {"text": "PALO IT", "value": "/g/11dxpwj75r"}, {"text": "Singapore Press Holdings Limited", "value": "/m/0d7mwh"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "Thales DIS (Singapore) Pte. Ltd.", "value": "/g/11f0197yrz"}, {"text": "Thales Group", "value": "/m/01phj4"}, {"text": "Zendesk", "value": "/m/0wkm4pl"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "Amaris Consulting", "value": "/m/0b6mxkc"}]}]}