{"search_metadata": {"id": "60827980f26ac63fe75790b9", "status": "Success", "json_endpoint": "https://serpapi.com/searches/5806dee22eff873b/60827980f26ac63fe75790b9.json", "created_at": "2021-04-23 07:38:40 UTC", "processed_at": "2021-04-23 07:38:40 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28software+developer%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=60", "raw_html_file": "https://serpapi.com/searches/5806dee22eff873b/60827980f26ac63fe75790b9.html", "total_time_taken": 2.37}, "search_parameters": {"q": "(software developer) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "60"}, "jobs_results": [{"title": "RPA Developer", "company_name": "Steenbok", "location": "Singapore", "via": "via Snaphunt", "description": "Over the years, it has cultivated a niche in interconnecting applications from mobile and web frontends to the traditional ERP systems through middleware. Today, its best value to the customer is its experience and ability in cross-application connectivity.\n\nTo date, its business has remained as that of an outsourced IT arm to the industries.\n\nThe Role\n\nIf you are motivated, resourceful, skilled in Software Engineering, and passionate about business transformation and automating business processes, this opportunity is for you.\n\nResponsibilities\n• Develop scripts for automation with RPA\n• Maintain and enhance existing automation scripts to improve business processes\n• Build and automate bots with programming\n• Write clean and optimized codes/scripts\n\nIdeal Profile\n\nRequirements\n• IT diploma or degree\n• At least 2 years in RPA development\n• Proficient in at least one of the programming languages, e.g. Python, VBA, VBScript, JavaScript\n• Automation Anywhere Master RPA Certification is... advantageous\n• Good problem solving skills\n• Effective communication skills and able work collaboratively in a cross functional team\n\nWhat's on Offer?\n• Work within a company with a solid track record of success\n• Work alongside & learn from best in class talent\n• Excellent career development opportunities", "extensions": ["9 hours ago", "$48K a year", "Full–time"], "detected_extensions": {"posted_at": "9 hours ago", "schedule_type": "Full–time", "salary": "$48K a year"}, "job_id": "eyJqb2JfdGl0bGUiOiJSUEEgRGV2ZWxvcGVyIiwiY29tcGFueV9uYW1lIjoiU3RlZW5ib2siLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImpFV0l6UU5yMlVUSWRvLVVBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gU25hcGh1bnQiLCJsaW5rIjoiaHR0cHM6Ly9zdGVlbmJvay5zbmFwaHVudC5jb20vam9iLzIwODYwMTE5P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Performance Test Engineer", "company_name": "OCBC Bank", "location": "Singapore", "via": "via EFinancialCareers", "description": "Performance Test Engineer\n\n• Involved in collecting performance test requirements across different application technologies\n• Involved in writing performance test plans by incorporating performance testing objectives, testing environment, user profiles, risks, test scenarios, explanation about the tools used, schedules and analysis, monitors and presentation of results.\n• Responsible for developing and modifying performance test scripts using Microfocus (MF) Performance Centre (PC) or tools like JMeter. Should be able to customize and enhance test scripts as per workload requirements\n• Responsible to develop and execute test scripts using protocols such as Web (http/html), web services, SAP, Java user using MF Performance Centre\n• Responsible to create & execute test scenarios as per agreed workload model using MF PC or any other performance testing tool such as JMeter.\n• Responsible for application performance monitoring either using industry wide APM tools such as Nimsoft... Appdynamics or OS commands such as perfmon, Nmon etc.\n• Responsible to perform thorough analysis of performance test results to report the server response times, throughput, Hits/sec, Trans/sec Transaction Response under load, Web Server Monitors, App server monitors, system monitors such as java processes, Oracle DB connections monitoring and other Performance metrics.\n• Worked with App-Dev, Production, Technical and Business Managers in planning, scheduling, developing, and executing performance tests.\n• Responsible to work on both waterfall and Agile methodologies\n• Responsible to integrate performance testing into CI/CD Pipeline for applications following Agile methodologies *LI-VW\n\nQualifications\n\n• Must have hands-on experience on end-to-end performance testing lifecycle\n• Must have hands-on experience working with Agile/DevOps model and integrate &automate performance testing in CI/CD model\n• Must have hands-on experience on performance testing tools such as MF Performance Centre and JMeter. Certification on these tools is a plus.\n• Must have hands-on experience on APM tools such as Nimsoft, AppDynamics, Splunk or Operating system commands such as perfmon and Nmon\n• Must have hands-on experience on formulating and executing Mobile on-device performance testing & engineering\n• Knowledge in service virtualization using any SV tools is a plus.\n• Good knowledge of SDLC processes, performance testing methodology and different types of testing.\n• ISTQB/ISEB certifications is an advantage\n• Excellent communication (spoken and written) skills and able to work independently", "extensions": ["2 days ago", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQZXJmb3JtYW5jZSBUZXN0IEVuZ2luZWVyIiwiY29tcGFueV9uYW1lIjoiT0NCQyBCYW5rIiwiY29tcGFueV9taWQiOiIvbS8wNTVyMjciLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJKc3IzSWNQRVlneUYzaU1wQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VVdWMFluaFViMW94YjNGdU1qaFVkV0YwUzBOTGNsOWhNa0U1Vm1SM2VtMWphRmRPVmxneVpDMXhiVXd3ZVRNeloxa3hjR0ZUVGpOa2NVaGtaMDVEVWt0d2JrbEVSM0p0Y1doT1ozbHVNSFZzY2pNMGVVMTFRM05JUWs5Q2RWQmFYelZGWTNRMVQxazNlRmczYlhoVFFuTkZWbkpuZVhSbFpuQjNMWFZYZVdneWNITklla3RyZUZkQ1NIcFpkRGh5ZVdJMFRYRlZhSEZGVlRWQkVoWm5XRzFEV1UxdVJrdFpjVEpuWjJWc2VHOWxaMFJCR2lKQlQwMVpVbmRFZW5acVJtaDFlRkl5WkdsWVlVNVFaSFoyUW5OSU5YWkZkMHBuIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMTMiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gRUZpbmFuY2lhbENhcmVlcnMiLCJsaW5rIjoiaHR0cHM6Ly93d3cuZWZpbmFuY2lhbGNhcmVlcnMuc2cvam9icy1TaW5nYXBvcmUtU2luZ2Fwb3JlLVBlcmZvcm1hbmNlX1Rlc3RfRW5naW5lZXIuaWQxMDc1MjkwMj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Lead Software Architect", "company_name": "Zühlke", "location": "Singapore (+1 other)", "via": "via Zühlke", "description": "The Zuhlke Opportunity.\nThrive in an environment where you can express your passion and enthusiasm for software development and be inspired by your colleagues’ enthusiasm.\n\nWhat your job will include?\n• As a Lead Software Architect, you will be responsible for developing IT architectures of innovative software solutions and for strategic technology consulting for our customers. You will partner with customers from a wide range of industries.\n• In these complex organisations, you will find the right solutions for different stakeholder groups. You will also be a coach and mentor, especially to younger team members.\n• Our reputation is fundamental to our business, so our culture emphasizes quality, reliability and respect. We value learning new technologies and skills, thus, you will get a generous individual training budget to attend conferences, participate in certified courses, and our annual technical camp is a lot of fun.\n\nWhat you should offer?\n• After completing your studies in... computer science or equivalent related field (bachelor's/master's), you continued to develop, and you can correctly evaluate new technologies and trends.\n• Over several years in your profession, you have gained a broad knowledge of different full stack technologies and methods.\n• Your architectural decisions are characterised by non-functional requirements such as availability, flexibility, stability, ease of maintenance and security; combined with economic aspects.\n• On the one hand, you are an expert with Enterprise Java technologies, web-based and desktop clients, application servers as well as relational and NoSQL databases. On the other hand, you know how systems outside the Java area are integrated and are familiar with technologies like REST, web services and messaging.\n• You have proven expertise in the JavaScript ecosystem and used frameworks like ReactJS and Angular where you applied your indepth knowledge in JavaScript and/or TypeScript.\n• You are still an active hands-on contributor in software engineering with the above; expect that we will require you to demonstrate that your skills are current in the interview process.\n• You have worked with Docker in both development and production environments.\n• You are willing to active shape and develop the career of your colleagues.\n• You are an experienced leader and a decisive success factor for the agile development process in project teams. This involves close cooperation with the project management.\n• You are aware of the concrete effects of your architectural decisions at the code level and you discuss them with developers.\n• You have strong communication skills and you are sensitive to different requirements.\n\nWhat we offer?\n\nAt Zuhlke Asia you get the best of both worlds. You can leverage on the benefits of working in a stable, large, highly reputable company with a long history of success while enjoying the freedom and autonomy of working in a fast-growing start-up environment. Zuhlke offers you networked innovation power and the security of a long-running, international success story. We support your personal development with specialised workshops and active knowledge sharing among experts", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJMZWFkIFNvZnR3YXJlIEFyY2hpdGVjdCIsImNvbXBhbnlfbmFtZSI6IlrDvGhsa2UiLCJjb21wYW55X21pZCI6Ii9nLzFoaF9yZzIxNiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjRiSHdsNnRLVnBSTFlmM2pBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhWRms0Tm1oU05XZGtUa2RhT1dGT2FuTk9jR3hNV2xKSFJFOWxibUpNYVZwdlZXVlZORFZWZEd0Nk9ITjJjVTQ1UlZCTVdISlhlbFpFV1UxTWMzRnVNMEZaUlMwMlJFY3hiek0xVTNCMFdUbHphVVI2TW1ZeGREaGhibVZUVUhST1FrUXRhemxTYldKNmNqaGthMUpaTkRsa00zUlVWVzVuU0RKMGNFMDRZbUV6TldoNE1rWnRNRFJ3T0V4MFUwMWFVMHhLYjBzM1VtbDFhalpCRWhabldHMURXVTF1Umt0WmNUSm5aMlZzZUc5bFowUkJHaUpCVDAxWlVuZEVWRmRJVGtsQlZtdFlWRGRZVm1JMExYbDBla0ZsWTFOSlYzUkIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18yMSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBaw7xobGtlIiwibGluayI6Imh0dHBzOi8vd3d3Lnp1ZWhsa2UuY29tL2VuL2NhcmVlcnMvbGVhZC1zb2Z0d2FyZS1hcmNoaXRlY3QtMD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "SG - Financial Software Engineer", "company_name": "StashAway", "location": "Singapore", "via": "via Bayt.com", "description": "We are currently expanding and looking for an exceptional and motivated Full Stack Engineer with a background in investments/finance/mathematics. You will work on our Economic Regime-based Asset Allocation (ERAA) framework, automating the investment decision process, maintain our financial computation engine and related microservices.\n\nYou will need to leverage the entire technology stack to realise these goals and will be part of a team that is constantly tackling difficult questions of scale, architecture, and interaction. Your contribution to a dynamic Technology team allows you to be exposed to a variety of concepts and technologies. You will enjoy being able to have a direct impact on StashAway's investment framework, and the development of features to support our products.\n\n-----\n\nWe have assembled an agile stack of microservices primarily written in Scala, Kotlin, Python, and JavaScript that is organised in Kubernetes and runs on AWS, communicates via Kafka and persists data in... Cassandra, MongoDB, and Postgres databases. We heavily utilise Event Sourcing as a data modelling and persistency concept for our core trading system.\n\nWe strive to keep most of the services simple and robust so they are easy to develop, test and maintain allowing us to iterate quickly and productively.\n\nDo check out StashAway's Engineering blog to learn more about the technology we use, the challenges we face, and the solutions we deliver!\n\n-----\n\nResponsibilities:\n• Build efficient, scalable, and robust solutions for clients in Python and other related technologies.\n• Portfolio Analytics - Maintaining the business logic code for the information and statistics that are displayed on the web/mobile.\n• Investment Server and Market Data - storing and providing financial data (ETF Prices & Dividends) from Bloomberg, and allocation across portfolios.\n• Write testable, clean, efficient code that can be confidently released in production.\n• Code in a collaborative, agile environment developing many new features.\n• Write well-tested, clean code and review other team members’ contributions.\n• Work closely with Product and Investment teams to produce high-quality results by understanding the investment process.\n• Be part of a team that enables faster internationalisation and the development of new investment products.\n• Must-Haves:\n• Bachelor degree in Computer Science, Engineering, Finance, Mathematics or related field.\n• Have experience in at least one statistical programming language - Python, R, Julia. Our financial stack is mainly in Python.\n• Have at least 1-3 years of experience in building web applications, preferably with a JavaScript-powered modern frontend stack.\n• Strong background in data structures and algorithms.\n• Familiar with agile processes, testing and continuous integration.\n• Eager and willing to learn new things, staying up to date with the latest technologies, and expanding your base skill sets to propose new approaches to your work.\n• We have an annual Learning & Development budget of S$1,000/year for you to take charge of your up-skilling and learning!\n• Able to work independently with minimum supervision.\n• Good-to-Haves:\n• Past work experience working on a B2C product and interest in finance", "extensions": ["5 days ago", "Full–time"], "detected_extensions": {"posted_at": "5 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTRyAtIEZpbmFuY2lhbCBTb2Z0d2FyZSBFbmdpbmVlciIsImNvbXBhbnlfbmFtZSI6IlN0YXNoQXdheSIsImNvbXBhbnlfbWlkIjoiL2cvMTFnNGNwdjNiZyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImgtZmY2MzY4S1Fjb3ZybGxBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhVVFZPT0Y5VVR6SndPRUUzVEZkc2RIaGlha010WmtVd2Qyb3hVWGg1Y1VOQlpIQmpTMnBvUW5JdFpHOVdlRFpWVW1kclZ6QjVhbGczWDFWdFdGY3dSSE4zTTNWMFZtTjVUakZaU0hFMU1tSldMVGhpVEMxelVWcFljSE5QVFhKaFFqWnNRbTl4YUc1bFYyRXlObWN3TjNCclJ5MVdkSGhrYjNKVFMwVjRjV1JvYWxOb01GZHdZVWt3YWxjNWEyWkNZa3QyUjBwcGMxYzVhVGgzRWhabldHMURXVTF1Umt0WmNUSm5aMlZzZUc5bFowUkJHaUpCVDAxWlVuZEJTRmxwVVZBdGIwUXphRWxwV1VWRVIzSlFiVjlZWVZKb2NXMVIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18yOSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCYXl0LmNvbSIsImxpbmsiOiJodHRwczovL3d3dy5iYXl0LmNvbS9lbi9zaW5nYXBvcmUvam9icy9zZy1maW5hbmNpYWwtc29mdHdhcmUtZW5naW5lZXItNTk1MzAyMDYvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "IT SOFTWARE QUALITY ASSURANCE ENGINEER - ISO CERTIFIED - SINGAPOREANS ONLY", "company_name": "APBA TG Human Resource Pte Ltd", "location": "", "via": "via Joblum Singapore", "description": "Job Description\n• Enforce that the team adhere to the software development processes and quality processes defined\n• Participate in the review processes for documents and software\n• Conduct audit to ensure adherence to defined quality processes\n• Collaborate with Project Manager / Software Managers to improve the existing processes to maintain a high level of quality software\n• Actively contribute to quality process improvement, testing and software quality development strategy and roadmap / vision\n• Develop and maintain quality assurance metrics for performance improvement\n• Provide briefing / training on the documented processes and tools used\nRequirement\n• Degree in Science (Mathematics), Computer Science, Computer Engineering or Information Technology\n• IT Software Development Management experience preferred\n• Minimum 4 years of software engineering/object orientated software development experience\n• ISO certified\n• Preferable gone through at least 2 cycles of SLDC\n• Experience in... software quality assurance, process definition, software audit and change management will be an advantage\n• Experience in MiniTab and/or Oracle Crystal Ball will be an added advantage\n• Able to articulate and write proficiently\n• Keen eye on details\n• Demonstrate leadership skills and have a strong team spirit with can-do attitude\n\nNote: This is NOT an engineering/ hardware related job.\nThis is a full time job. It is a yearly renewabe contract position with benefits. This is NOT a perm position", "extensions": ["14 days ago", "$5K–$6K a month", "Full–time"], "detected_extensions": {"posted_at": "14 days ago", "schedule_type": "Full–time", "salary": "$5K–$6K a month"}, "job_id": "eyJqb2JfdGl0bGUiOiJJVCBTT0ZUV0FSRSBRVUFMSVRZIEFTU1VSQU5DRSBFTkdJTkVFUiAtIElTTyBDRVJUSUZJRUQgLSBTSU5HQVBPUkVBTlMgT05MWSIsImNvbXBhbnlfbmFtZSI6IkFQQkEgVEcgSHVtYW4gUmVzb3VyY2UgUHRlIEx0ZCIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiYmdiUDZTOUVZSENSc3Fxa0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JsdW0gU2luZ2Fwb3JlIiwibGluayI6Imh0dHBzOi8vc2cuam9ibHVtLmNvbS9qb2IvaXQtc29mdHdhcmUtcXVhbGl0eS1hc3N1cmFuY2UtZW5naW5lZXItaXNvLzYwNzY3Mz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior It Developer", "company_name": "Sciente Consulting Pte. Ltd", "location": "Singapore (+1 other)", "via": "via MNC Jobs Singapore | MNC Jobs In Singapore", "description": ":\n\nAre you looking for the next challenge in your career? We have an exciting opportunity for a Senior IT Developer to be part of the regional technical team, supporting the development and implementation of a largescale regulatory application.\n\nMandatory Skill(s)\n\nDiploma/Degree holder in Information Technology or related field;\n\nAt least 5years of experience in software design and development using Java, PL /SQL, Python, Scala;\n\nOracle certified professional (Java, PL/SQL);\n\nProficient in data models or various RDBMS database systems;\n\nHands on experience with Hadoop and Talend;\n\nIndependent and proactive;\n\nGood interpersonal skills and a strong team player;\n\nCandidates with strong passion in software development and learning new technologies;\n\nExcellent verbal and written communication skills.\n\nDesirable Skill(s)\n\nBig Data certification;\n\nTalend data integration certification;\n\nKnowledge of Insurance and financial reporting will be advantageous.\n\nResponsibilities\n\nBeing part of the... technical team to develop the a regulatorysolution for the entire group;\n\nResponsible to develop, set up and support the application and data integration;\n\nLiaise with both external and internal stakeholders to ensure the successful delivery of application;\n\nDocument and review technical specifications;\n\nInvolve in System Integration and User Acceptance Testing;\n\nMaintain, support and ensure necessary changes are implemented and documented;\n\nProvide system support during and post implementation.\n\n: Are you looking for the next challenge in your career? We have an exciting opportunity for a Senior IT Developer to be part of the regional technical team, supporting the development and implementation of a largescale regulatory a", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgSXQgRGV2ZWxvcGVyIiwiY29tcGFueV9uYW1lIjoiU2NpZW50ZSBDb25zdWx0aW5nIFB0ZS4gTHRkIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJ6OU1Sa0prcGp3Tm9BYlBzQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1OQyBKb2JzIFNpbmdhcG9yZSB8IE1OQyBKb2JzIEluIFNpbmdhcG9yZSIsImxpbmsiOiJodHRwczovL3NnLm1uY2pvYnouY29tL2pvYnMvc2VuaW9yLWl0LWRldmVsb3Blci1zaW5nYXBvcmUtMjQxMjcxP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Backend Software Engineer (Senior or Junior)", "company_name": "OSIM", "location": "Singapore", "via": "via NodeFlair", "description": "OSIM is looking for talented BACKEND SOFTWARE ENGINEER (Senior or Junior)who are interested in creating IoT products in an open and flexible agile environment. Depending on your personal capability, you can be either a Tech Leader or Key Team member. We will reward the right person competitively for their service.\n\nWhat are you waiting for!!! If you are able to:-\n• Work closely with fellow Backend Engineers, Frontend Engineer, Product Owner, UI/UX Designers to define, refine, and implement features on the IoT and AI related product lines.\n• Work closely with Electronic Engineer on the interface between backend and Communication Daughter Cards (CDC), define interfaces (e.g. REST API and communication data structure).\n• Work closely with DevOps to build frameworks and tools, define standards (e.g. REST API) and improve overall efficiency of the development (e.g., CI/CD) and hygiene of the codebase (i.e., Git).\n• Work closely with QAs to make sure the key API and UI are covered by... automation testing and manual testing.\n• Work on complex engineering problems to improve the scalability, security, and reliability of our platform.\n• Have hands-on programming and architecture design skills with demonstrated willingness and capability to learn new technologies quickly.\n\nThe right talent will have:-\n• 1 ~ 7 years of backend software engineer relevant working experience.\n• Be able to use programming languages to solve complex problems in a given time with clean code style and modularized code structure. Prefer Python and C#.\n• Experience of cloud services, (e.g. AWS, Azure), backend frameworks (e.g. .Net Core and Flask), relational database (e.g. MySQL), CI/CD flow (Docker, Circle CI, Travis).\n• Strong understanding of system performance and scaling, Demonstrated ability to design, build, and deliver complex, successful REST servicesand/or customer experiences efficiently and with quality.\n• Experience of working in an Agile team, preferably in roles exposed to full cycle scrum product development.\n• Be able to own the product with proactive and responsible attitudes.\n\nAdditional Advantage\n• AI (NLP or CV) knowledge and experience\n• IoT product knowledge and experience\n• Entrepreneur experience\n• Being able to review the CDC code in C language\n\nDesired Skills and Experience\n.NET Compact Framework, Agile, Agile Project Management, Artificial Intelligence, Backend Development, Certified Scrum Master CSM, Computer Engineering, Internet of Things, Python, Scrum, SQL Azure, Windows Azure", "extensions": ["Over 1 month ago", "$4K–$8K a month", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time", "salary": "$4K–$8K a month"}, "job_id": "eyJqb2JfdGl0bGUiOiJCYWNrZW5kIFNvZnR3YXJlIEVuZ2luZWVyIChTZW5pb3Igb3IgSnVuaW9yKSIsImNvbXBhbnlfbmFtZSI6Ik9TSU0iLCJjb21wYW55X21pZCI6Ii9tLzA2NWQ0XyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6InpDMDVKV0V4MFRYeExWNmpBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVzc0JDb3dCUVU1VlgwNXhVbHAwT0hWbGJtcElVRzgwTW1sU1VrOWlYekJLZFZGRFdqQlhWVEE0TWtKSlYyRjFNMU40YlVKcU5qSlVVekZhVFhacWVWWTJZa3BDY0UxRFNVaFJhVUp6VjFaUVgwMTVhVk0yUzBObVJtaHZUM3B2UW1FMVNEQllYMk52YTFGYU5qTlRTSE52WkVad1NGbGhNbTV5YnpWQlpucHphMVI0Vm10dVYyMU5iVEpVYlV4Qk1uVVNGbWRZYlVOWlRXNUdTMWx4TW1kblpXeDRiMlZuUkVFYUlrRlBUVmxTZDBNd1lUSk9UMEU1V1cxVWJuaGFOazVwYjJ3ek5ISm5hRFZpUjNjIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNDciLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTm9kZUZsYWlyIiwibGluayI6Imh0dHBzOi8vd3d3Lm5vZGVmbGFpci5jb20vam9icy9saXN0aW5ncy85MjgwP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "SW Quality Assurance Engineer (Edge team - Singapore)", "company_name": "DELL", "location": "Singapore", "via": "via Dell Careers", "description": "SW Quality Assurance Engineer (Edge team - Singapore)\n\nDell Technologies is seeking innovative Software Quality Assurance Engineer to drive the vision and execution of a new Enterprise Edge Initiative. As a Software Quality Assurance Engineer in our new Edge innovation group, you will have come from an environment in which you have already had life experiences in this activity. You will have an understanding of why orchestration is important to our customers. We are looking for you to accelerate the delivery and overall improve the quality of products by developing and executing test plans that ensure the best possible customer experience. You will test code manually and with automated tools to debug and solve complex software problems on both mobile and web applications. The ideal candidate will have experience building and executing automated test scripts, conducting end to end application tests, and extensive knowledge of SDDC environments. As a Software Quality Assurance Engineer... you will need to take initiative and have the ability to execute in a very dynamic environment. Your insights and feedback will impact the making of this solution.\n\nYou will:\n• Develop and/or execute software test plans on our applications in order to identify software problems and their causes.\n• Act as a thought leader for the QE team, always focusing on solving problems and implementing solutions and work cross functionally in an Agile/Scrum environment alongside Development and Product Management to deliver high quality solutions\n• Communicate daily with internal teams, onshore and offshore, as well as customers and stakeholders.\n• Participate in product and feature design with Development and Product Management\n• Develop reports or summary on the process and have the life experiences to recognize challenges at an early state.\n\nRequirements:\n• Bachelor’s degree in Computer Science or related field (master’s degree preferred) or relevant experience\n• At least 1 - 5 years of experience in Quality Assurance/Testing, Automation framework design (desirable) or related experience\n• Ability to analyze requirements, develop a test strategy and test plan, create and execute manual and automated test cases, track defects and report results\n• Experience building and executing automated scripts or experience with automation tools e.g. Selenium/Webdriver, Cucumber, JUnit, Postman, Java, Golang, C# and or NodeJS\n• Knowledge of any one or more Cloud platforms (Azure, AWS, GCP etc.\n• Able to work independently and within a agile, collaborative team-oriented environment using sound judgment in decision-making\n\nGood to have:\n• Experience with Atlassian’s suite of products (JIRA, Stash, Confluence, etc.)\n• Certifications such as Certified Software Testing Professional or Certified Software Quality Analyst will be an added advantage\n• Experience of Dell and VMware products is a plus but not expected. However, you should be eager to learn Dell/VMware products and other related technologies\n• Experience in Performance Testing is an advantage\n• Knowledge of server, storage, networking, virtualization and HCI concepts is a plus\n\nDell Technologies is a unique family of businesses that helps organizations and individuals build their digital future and transform how they work, live and play—providing customers with the industry’s broadest and most innovative technology and services portfolio. We value our customers, winning together, innovation, results and integrity. Grow your career with a highly competitive salary, bonus programs, world-class benefits and unparalleled learning and development opportunities— all at a company that is proud to be diverse and inclusive. Learn more on how we are closing the diversity gap here.\n\nDell is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at Dell are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. Dell will not tolerate discrimination or harassment based on any of these characteristics. Dell encourages applicants of all ages. Read the full Employment Opportunity Policy here.\n\n\"EdgeBU\"\n\n\"LIpriority", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTVyBRdWFsaXR5IEFzc3VyYW5jZSBFbmdpbmVlciAoRWRnZSB0ZWFtIC0gU2luZ2Fwb3JlKSIsImNvbXBhbnlfbmFtZSI6IkRFTEwiLCJjb21wYW55X21pZCI6Ii9tLzBweTliIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiNUZoVVBDNVNZaW5wZnZER0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXNzQkNvd0JRVTVWWDA1eFUyVTBVRGRDUkd0Nk9GUnlaV3B5TUhWV0xYVkRkRW90YW5WV2RtWXRXVVpSTWpaVGJFMUNVR1F0YTAxRFJWRkdVRWM1UjBSa1lqZHVUM053Y2pFMlZuRjBUMHgwVW5KWWJITmxUMGR3Y1doMVUwazBWRzh6UzBGWFVFdG1ORzE0TVVKWk1sUlhkVlJyYmxCclRWQTNiazFxY2pCVVVWaFNWMXAzU3pKTlJISkNXbFJJVDNnU0ZtZFliVU5aVFc1R1MxbHhNbWRuWld4NGIyVm5SRUVhSWtGUFRWbFNkMEpYUjJoT1ZVUm9ORkp3TVdWWFQwWjVRMkZoYkhaWVRHaGtTWGMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY181NSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBEZWxsIENhcmVlcnMiLCJsaW5rIjoiaHR0cHM6Ly9qb2JzLmRlbGwuY29tL2pvYi9zaW5nYXBvcmUvc3ctcXVhbGl0eS1hc3N1cmFuY2UtZW5naW5lZXItZWRnZS10ZWFtLXNpbmdhcG9yZS8zNzUvMTkwMDI5OTQ/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "AWS Engineer", "company_name": "Acp Computer Training School Pte. Ltd.", "location": "Singapore (+1 other)", "via": "via Monster Singapore", "description": "Job Responsibilities:\n• Ensure all the application systems remain in good working order.\n• Support new application systems when they become operational.\n• Respond to production emergencies in a timely manner including bringing up the server (in a crash) or system processes, fixing problems or finding workarounds.\n• Perform routine checks and to escalate to the Project Manager any anomaly detected\n• Conduct troubleshooting together with other system engineers, database administrators (DBA) and outsourced vendors\n• Follow through every issue/problem till closure; and complete the necessary documentation as required by NLB.\n• Assist users and answer queries regarding the supported operational systems.\n• Interact with the helpdesk agents, end-users, and external vendors during application support and problem resolution.\n• Provide standby support on weekends / public holidays. In the event of scheduled downtime or during a crash, the Candidate is required to be in office during off-office... hours to support the systems.\n• Make code changes/ enhancements that arise from service requests.\n• Follow the NLB’s technical standards and update the necessary documentation.\n• The candidate shall be prepared to understudy and undertake the development of new applications and maintenance of any existing systems in NLB as assigned by the NLB Project Manager.\n\nJob Requirements:\n• Possess at least a bachelor’s degree in Information Technology (IT), Computer Engineering, Computer Science, or equivalent.\n• Minimum of FIVE (5) years working experience in working experience in the IT industry\n• Able to work independently and as a team member\n• Certified in Amazon Web Services like AWS Certified CloudPractitioner or better\n• Proficient in C# (NET), or equivalent C-based programming language like PHP, PERL, C++, and C\n• Proficient in front-end technologies, like HTML5, jQuery, JavaScript, and CSS\n• Proficient in SQL technology like MSSQL, MySQL, PostgreSQL, MariaDB, or equivalent and be proficient in writing optimized SQL queries or stored procedures\n• Working experience in Service Oriented Architecture (SOA) by having to integrate application using SOAP or REST services", "extensions": ["7 days ago", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBV1MgRW5naW5lZXIiLCJjb21wYW55X25hbWUiOiJBY3AgQ29tcHV0ZXIgVHJhaW5pbmcgU2Nob29sIFB0ZS4gTHRkLiIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiWFFTRk5HVVFtQjVnclFPX0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNb25zdGVyIFNpbmdhcG9yZSIsImxpbmsiOiJodHRwczovL3d3dy5tb25zdGVyLmNvbS5zZy9hbXAvam9iLXZhY2FuY3ktYXdzLWVuZ2luZWVyLWFjcC1jb21wdXRlci10cmFpbmluZy1zY2hvb2wtcHRlLWx0ZC1zaW5nYXBvcmUtMjc3NTU5MzcuaHRtbD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Software Developer​/Mobile apps", "company_name": "THE TALENT SHARK PTE. LTD.", "location": "Singapore", "via": "via Learn4Good", "description": "Position: Software Developer (Mobile apps)\nLocation: null\nRoles &\n\nResponsibilities\n\nJob\n\nDescription:\n\nThe role of the Software Developer will be responsible for designing, developing, and implementing business solutions for the company and its clients. The role also comprises on-site/offsite low-level requirements gathering, understanding client’s needs, and working with the architects to come up with a viable solution. Qualifications\n\nBachelors or Associate degree in IT discipline. 3-5+ years in software development or equivalent.\n\n3-5+ years work experience with the following languages and tools:\n\nGood working experience on mobile development by using IOS(Swift), Android (Kotlin), or Xamarin. Familiar with Apple and Google store App deployment Good understanding of development methodologies, testing practices, and tools and knowing when to apply each method to achieve the desired outcomes. Familiarity with architecture styles/APIs (REST, API, MVC) Client/Server scripting framework... (JavaScript, Angular.js, React JS, Node.js) Excellent troubleshooting and communication skills BSc/BA in Computer Science, Engineering or a related field Knowledge of security standards and techniques for web applications Understand browser-specific compatibility issues Expertise in the design, implementation, and deployment of user-centric software, with a focus on usability · Added advantages Understanding and practicing Agile methodologies o Certification in mobile development or equivalent Familiar with Cloud application deployment such as (azure, AWS or google cloud) Experience in Java-based mobile application Experience in Java/J2EE, .\n\nNet, and/or mobile Technologies Good knowledge of DevOps (Jenkins), automated testing would be beneficial.\n\nResponsibilities Report to Development Lead Develops software solutions by studying information needs; conferring with users; studying systems flow, data usage, and work processes; investigating problem areas; following the software development lifecycle. Determines operational feasibility by evaluating analysis, problem definition, requirements, solution development, and proposed solutions. Documents and demonstrates solutions by developing documentation, flowcharts, layouts, diagrams, charts, code comments, and clear code.\n\nPrepares and installs solutions by determining and designing system specifications, standards, and programming. Improves operations by conducting systems analysis, recommending changes in policies and procedures. Updates job knowledge by studying state-of-the-art development tools, programming techniques, and computing equipment; participating in educational opportunities; reading professional publications; maintaining personal networks; participating in professional organizations. Protects operations by keeping information confidential. Provides information by collecting, analyzing, and summarizing development and service issues.\n\nAccomplishes engineering and organization mission by completing related results as needed. Supports and develops software engineers by providing advice, coaching, and educational opportunities. Provide level 2 and 3 support to business users.\n\nTell employers what skills you have\n\nAgile\n\nAgile Application Development\n\nAmazon Cloud\n\nAndroid\n\nAndroid Development\n\nAngular JSAngular.jsAngular\n\nJSAWSiOSiOS Development\n\nJ2\n\nEEJavaScript\n\nMVCNode.jsNodeJSRESTSWIFTWindows Azure", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBEZXZlbG9wZXLigIsvTW9iaWxlIGFwcHMiLCJjb21wYW55X25hbWUiOiJUSEUgVEFMRU5UIFNIQVJLIFBURS4gTFRELiIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiSnZDY2Y3Q0NiZ2xpOWJRSEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMZWFybjRHb29kIiwibGluayI6Imh0dHBzOi8vd3d3LmxlYXJuNGdvb2QuY29tL2pvYnMvc2luZ2Fwb3JlL3NvZnR3YXJlX2RldmVsb3BtZW50LzI3MTI5OTMwNi9lLz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}], "chips": [{"type": "Title", "param": "job_family_1", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Software engineer", "value": "software engineer"}, {"text": "Senior", "value": "senior"}, {"text": "Test engineer", "value": "test engineer"}, {"text": "Cloud engineer", "value": "cloud engineer"}, {"text": "Engineer", "value": "engineer"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Assurance engineer", "value": "assurance engineer"}, {"text": "Programmer", "value": "programmer"}, {"text": "Coach", "value": "coach"}, {"text": "Qa engineer", "value": "qa engineer"}, {"text": "Devops engineer", "value": "devops engineer"}, {"text": "Frontend engineer", "value": "frontend engineer"}, {"text": "Java engineer", "value": "java engineer"}, {"text": "Solutions engineer", "value": "solutions engineer"}, {"text": "Testing engineer", "value": "testing engineer"}, {"text": "Analyst", "value": "analyst"}, {"text": "Data engineer", "value": "data engineer"}, {"text": "Design engineer", "value": "design engineer"}, {"text": "Development manager", "value": "development manager"}, {"text": "Devops consultant", "value": "devops consultant"}, {"text": "Firmware engineer", "value": "firmware engineer"}, {"text": "Lead engineer", "value": "lead engineer"}, {"text": "Lecturer", "value": "lecturer"}, {"text": "Manager", "value": "manager"}, {"text": "Network systems", "value": "network systems"}, {"text": "Principal", "value": "principal"}, {"text": "Principal engineer", "value": "principal engineer"}, {"text": "Quality engineer", "value": "quality engineer"}, {"text": "Science", "value": "science"}, {"text": "Scrum master", "value": "scrum master"}, {"text": "Security architect", "value": "security architect"}, {"text": "Security engineer", "value": "security engineer"}, {"text": "Senior engineer", "value": "senior engineer"}, {"text": "Senior lecturer", "value": "senior lecturer"}, {"text": "Senior system", "value": "senior system"}, {"text": "Senior technical", "value": "senior technical"}, {"text": "Software architect", "value": "software architect"}, {"text": "Specialist", "value": "specialist"}, {"text": "Stack engineer", "value": "stack engineer"}, {"text": "System engineer", "value": "system engineer"}, {"text": "Technical", "value": "technical"}, {"text": "Trainee", "value": "trainee"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Wholesale", "value": "/business/naics2007/42"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Mining", "value": "/business/naics2007/21"}, {"text": "Rental", "value": "/business/naics2007/532"}, {"text": "Retail", "value": "/business/naics2007/44"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": ".AB4Jjf.qPB6Vc{padding-right:11px}.qfpP8d{padding:7px 0 7px 11px}.S003Ke{flex:none}.ZoN4Lb{color:rgba(0,0,0,.54)}.nAXVG{color:#70757a}.IxQsL{color:rgba(0,0,0,.26)}.xFO1De{color:#fff}.ooFpK{color:rgba(255,255,255,.30)}.mtnwac{color:#4285f4}.WxeeKb{color:#34a853}.hIVRU{color:#f29900}.EXaTMc{color:#fbbc04}.sxn46d{color:#000}.gqMTF{color:#1a73e8}.zpn8Mb{color:#d93025}.dEUPmd{color:#1e8e3e}.PJNo1{color:#fbbc04}Actively Hiring", "value": "e"}, {"text": "EPAM", "value": "/m/0dlnrc"}, {"text": "VISA", "value": "/m/01kqjn"}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Zühlke", "value": "/g/1hh_rg216"}, {"text": "Cardinal Health", "value": "/m/040vzx"}, {"text": "Credit Agricole Group", "value": "/m/028vbm"}, {"text": "GlobalTix Pte Ltd", "value": "/g/11dxpqdhrf"}, {"text": "HCL SINGAPORE PTE. LTD.", "value": "/g/11fy25ngsv"}, {"text": "Jobline Resources Pte Ltd", "value": "/g/11gp2647pn"}, {"text": "Mediacorp", "value": "/m/03qtz1"}, {"text": "Realtek", "value": "/m/05wrm7"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "TECHNOPALS PTE. LTD.", "value": "/g/11dxpvkynp"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "Thales", "value": "/m/01phj4"}, {"text": "UST", "value": "/m/08kb8g"}, {"text": "UrbanFox", "value": "/g/11ghs7y0w6"}, {"text": "Activate Interactive", "value": "/g/11dxq192l5"}, {"text": "Cognizant", "value": "/m/03bf9h"}, {"text": "DELL", "value": "/m/0py9b"}, {"text": "HCL Technologies", "value": "/m/0698gv"}, {"text": "ORACLE", "value": "/m/05njw"}, {"text": "Singapore Press Holdings Limited", "value": "/m/0d7mwh"}, {"text": "Temasek Polytechnic", "value": "/m/098s73"}, {"text": "TikTok", "value": "/g/11fy265933"}, {"text": "Zendesk", "value": "/m/0wkm4pl"}, {"text": "A-it Software Services Pte Ltd", "value": "/g/11dxpy_gl_"}, {"text": "ACCENTURE PTE LTD", "value": "/m/09n8w94"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "Adecco GS", "value": "/m/08gz46"}, {"text": "Atidan Technologies", "value": "/g/11c74f0b8_"}, {"text": "Autodesk", "value": "/m/018nm3"}, {"text": "Avnet", "value": "/m/0c8xmc"}]}]}