{"search_metadata": {"id": "60827ea25c10593c63bf46b9", "status": "Success", "json_endpoint": "https://serpapi.com/searches/f35ec5f1e99c5d1d/60827ea25c10593c63bf46b9.json", "created_at": "2021-04-23 08:00:34 UTC", "processed_at": "2021-04-23 08:00:34 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28project+manager%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=210", "raw_html_file": "https://serpapi.com/searches/f35ec5f1e99c5d1d/60827ea25c10593c63bf46b9.html", "total_time_taken": 1.27}, "search_parameters": {"q": "(project manager) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "210"}, "jobs_results": [{"title": "Project Manager - Banking - Vendor Management", "company_name": "GMP Technologies", "location": "Singapore (+1 other)", "via": "via Monster", "description": "• Involve in end to end Project Management Life Cycle\n• Understand business function and analyze users requirements, make clear scope of project and build consensus with users\n• Take complete ownership of the project and be able to manage various stakeholders.\n• Ensure successful delivery of projects within stipulated schedule and budgets.\n• Vendor Management and Stakeholder Management\n• Report each project progress every week and ensure issues are properly documented, tracked and addressed.\n\nQualifications\n• Diploma/Degree in Computer Science/ Information Technology/ Business Management from a recognized institution\n• Good working experience in Project management Life Cycle\n• Working background in SDLC\n• Strong analytical, problem solving and documentation skills.\n• Good interpersonal skills with strong team spirit. Must be able to function well as a team member\n• PMP Certified is added advantage\n\nFor more information, please visit to www.gmprecruit.com and search for Job Reference... 17037\nTo find out more about this opportunity, please contact Tang Lee Ling at [Confidential Information]\nWe regret that only shortlisted candidates will be notified.\nGMP Technologies (S) Pte Ltd | EA Licence: 11C3793 | Tang Lee Ling | Registration No: R1106845", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIgLSBCYW5raW5nIC0gVmVuZG9yIE1hbmFnZW1lbnQiLCJjb21wYW55X25hbWUiOiJHTVAgVGVjaG5vbG9naWVzIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJsM25vRVF2aU5zMFdnYzZ2QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1vbnN0ZXIiLCJsaW5rIjoiaHR0cHM6Ly93d3cubW9uc3Rlci5jb20uc2cvam9iL3Byb2plY3QtbWFuYWdlci1iYW5raW5nLXZlbmRvci1tYW5hZ2VtZW50LWdtcC10ZWNobm9sb2dpZXMtc2luZ2Fwb3JlLTE5NjYwNTg/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Customer Experience Delivery Manager", "company_name": "Sciente Inc", "location": "Singapore", "via": "via SCIENTE", "description": "Our client is seeking a dynamic Customer Experience / CX Delivery Manager to implement and scale initiatives to achieve better and seamless service delivery transformations.\n\nYou will be working on various initiatives to improve our clients customer experiences and implementing new ways of delivering seamless Customer Experience CX services.\n\nMandatory Skill(s)\n• Degree in Information Technology, Computer Engineering, Computer Science or Information System;\n• At least 8 years of working experience with 4 years of Customer Experience CX, customer journey experience in the service industry;\n• Leader with out of the box thinking and quick decision making capabilities;\n• Knowledge and implementation of customer experience and customer research projects;\n• Timely delivery of projects and strong project management skills will be required;\n• Strong written and verbal communication skills and should be good at presenting/ facilitating;\n• Should be a good team player as will be required to... work with various project stakeholders.\n\nDesirable Skill(s)\n• PMP Certification;\n• Design Thinking Experience.\n\nResponsibilities\n• Responsible for leading teams to develop an understanding of customers pain points and solution to deliver a more seamless and integrated experience;\n• Work alongside user interface and experience experts to improve customer facing digital services / applications;\n• Responsible for re-looking at the back-end processes and coming up with solutions which allows the customers to easily interact;\n• Identify consumers pain-points and put together a strategy to prevent and recover the bad experience;\n• Manage and coordinate workflows with project managers and schedules, requirements, goals and assignments as required;\n• Work closely with different teams to understand customers requirements better and providing appropriate solutions accordingly;\n• Prepare reports and statistics on a regular basis for submission to Senior Management", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDdXN0b21lciBFeHBlcmllbmNlIERlbGl2ZXJ5IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJTY2llbnRlIEluYyIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiQVlwX0p1U3VRN2Q5T2dhNkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBTQ0lFTlRFIiwibGluayI6Imh0dHBzOi8vd3d3LnNjaWVudGUuY29tL3NjaWVudGUtaW5jL3RlY2hub2xvZ3ktam9icy82MDI1L2N1c3RvbWVyLWV4cGVyaWVuY2UtZGVsaXZlcnktbWFuYWdlci8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Project Manager", "company_name": "MONSTAR LAB PTE. LTD.", "location": "Singapore", "via": "via MNC Jobs Singapore | MNC Jobs In Singapore", "description": "Monstar Lab is one of the top digital product development company with 26 offices in 15 countries and most importantly with a team of 1200+ beautiful souls.\n\nWe build innovative digital products that includes mobile apps, web apps, AR/ VR products for our clients such as UOB, NTUC Income, Gardens by the Bay, Shake Shack, Resort World Sentosa and many stealth startups that we can’t talk about publicly.\n\nOur Singapore office is looking for experienced dynamic & energetic Project Managers who are expert facilitators who exercise good judgment, balancing the needs of business, engineering, and user experience. PM’s are expected to be the primary point of contact for important client projects and to facilitate the Monstar Lab software development process. They also help train client Product Owners to prioritize product backlog and smoothly transition product and process management. They work meticulously to prioritize, plan, and deliver industry-leading software with a strong focus on... efficacy and usability.\n\nCandidate requirements\n• 4+ years of strong project management experience preferably in Agile methodologies\n• Strong experience in lean/agile startup methodologies (SCRUM, Kanban), ability to spearhead an iterative approach, prioritize, plan and execute sprints\n• Experienced in at least 2 full project development life cycles, with at least one using agile methodology\n• Work with Product owners, cross-functional teams and end users for project briefs.\n• Analyze, clarify and finalize the specific requirements (user stories) of each project\n• Able to turn user needs & requirements into well-defined, detailed product features & prioritizing the Product backlog\n• Experienced in closely collaborating with engineers and designers as part of small and medium co-located teams\n• Ability to quickly understand a specific client domain and identify the trends and opportunities in that space\n• Ability to facilitate collaborative decision-making in a workshop context\n• Excellent verbal and written communication skills and ability to adapt your communication style for the audience\n\nDesired Skills / Experiences\n• PMP or Agile certification preferred\n• Experience as a designer or engineer a plus\n• Experience leading or supporting user research, customer experience\n• Consulting experience on Digital products\n• Strong analytical, conceptualization and problem solving skills\n• Experience working in Singapore in a similar role a plus\n\nWhat we provide:\n\nOpportunity to build and grow a product from scratch\nGreat benefits and a balanced lifestyle\nTech company culture\n\nminimumYearsExperience : 4\n\n[CANDIDATES WHO REQUIRE WORK PASSES NEED NOT APPLY", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJNT05TVEFSIExBQiBQVEUuIExURC4iLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IlVuck0wYk1vX2xMRjEtWG1BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTU5DIEpvYnMgU2luZ2Fwb3JlIHwgTU5DIEpvYnMgSW4gU2luZ2Fwb3JlIiwibGluayI6Imh0dHBzOi8vc2cubW5jam9iei5jb20vam9icy9wcm9qZWN0LW1hbmFnZXItcGF5YS1sZWJhci0xOTI1Mzc/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Senior Project Manager", "company_name": "None", "location": "Singapore", "via": "via Jobs", "description": "Xylem is seeking a disciplined and organized individual with an environmental or civil engineering background to manage Xylem key water industry client projects. This position offers the opportunity to join Xylem's driven, contrarian, creative experts in their endeavor to use high tech tools and SaaS deployments to solve age-old infrastructure problems. You will lead complex projects across the world using your expert project management skills, water industry technical knowledge, and your passion for client success. You will plan and maintain project scopes, budgets, schedules, identify and mitigate risks, and communicate goals and results with project stakeholders. Your projects often span offices and time zones, and you are adept at keeping all the players coordinated on the project's progress and deadlines. Xylem's team is hyper-focused on the use of big data, artificial intelligence, and the Internet of things to implement Intelligent Urban Water solutions, primarily for water... utilities. Xylem's team has clients worldwide, and is seeking to disrupt the status quo and drastically advance the water industry. This team's mission is to help utilities save money and save the planet by dynamically managing water and wastewater infrastructure. Essential Duties/Principal Responsibilities: Work with team members to deliver projects on-time, on-budget, and on-scope. Operate effectively in a SaaS business environment by managing internal expectations as well as balancing business objectives with client goals Serve as project manager for overall project delivery (cost, schedule, scope, quality, contracts) and ensure project delivery for a variety of hardware, software and professional service projects Maintain project management tools for project tracking, billing, and revenue forecast projections. Serve as technical interface with clients, business managers and commercial teams and provide direction to the engineering and product management teams. Coordinate activities with engineers in other disciplines (environmental, civil, electrical, and software). Prepare and review work products. Convey project results and findings to clients by means of oral discussions, presentations and written project documentation. Present optimization concepts to utility managers and clients. Actively contribute to the refinement and development of new product features and service offerings by working closely with product development team. Make complex, cutting-edge ideas understandable and exciting to utility managers and clients. Minimum Qualifications: Education, Experience, Skills, Abilities, License/Certification: Graduation from a four-year university with a major in engineering, water and wastewater, asset management, or related field. A certificate of registration as a Professional Engineer issued by the local state/country authority a plus. 5 years of experience in working with public utility companies at planning and operation management levels, preferred. Must have education/experience and accountability for cost control and profit targets and managing a project budget. Experience with developing and managing projects and programs, scheduling and implementation with ability to plan, assign, direct and coordinate a variety of functional specialties with overlapping work areas a plus. Experience with managing engineers, suppliers, and sub-contractors a plus. PMP certification a plus. Familiarity with agile methodology a plus. Organized, disciplined and focused approach to project management. Ability to bring structure to a project while incorporating creativity and innovation into the solutions. High emotional intelligence, with enthusiastic and innovative mindset to solve solutions and have an impact on client projects and team collaboration Excellent communication skills to express complex ideas to professionally diverse audiences. Exposure to and open to learning different approaches and software for project management. Experience with taking ideas from concept through to completion in accordance with program objectives. Passion for Client Success and team impact. Strong written/verbal communication skills. Ability to quickly develop working knowledge of Xylem's value propositions. Ability to manage multiple tasks in a fast-paced environment. Knowledge of project delivery methods, team building and client relationship building Physical Demands: Regularly required to sit or stand, reach, bend and move about the facility May work in outside weather conditions and be exposed to varying weather conditions Work Environment: Office: Standard office equipment; work usually performed in an office setting free from any disagreeable elements. Must be able to travel as required up to 30% Standard weekly job hours: 40 hours Xylem is an Equal Opportunity Employer. Employment decisions are made without regard to race, color, religion, national or ethnic origin, sex, sexual orientation, gender identity or expression, age, disability, protected veteran status or other characteristics protected by law. Xylem is seeking a disciplined and organized individual with an environmental or civil engineering background to manage Xylem key water industry client projects. This position offers the opportunity t Skills: Business Analysis, Change Management, Leadership, Management, Process Improvement, Program Management, Project Management, Project Planning, Plan, Organised, Road Construction, Technical Knowledge, Project Management Skills Experience: 5.00-7.00 Years", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgUHJvamVjdCBNYW5hZ2VyIiwiY29tcGFueV9uYW1lIjoiTm9uZSIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiUXpTX1VTVzluLU02WUw2a0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIiwibGluayI6Imh0dHBzOi8vc2cuZmlkYW50by5jb20vam9icy9qb2Itb3BlbmluZy9jb3Vuc2Vsb3JzLWFsbC1vdGhlci9zZW5pb3ItcHJvamVjdC1tYW5hZ2VyLTI3NTcyMjg5OD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Manager, Services Program/Project Management - Thailand", "company_name": "Salesforce", "location": "Singapore", "via": "via LinkedIn", "description": "To get the best candidate experience, please consider applying for a maximum of 3 roles within 12 months to ensure you are not duplicating efforts.\nJob Category\nCustomer Success Group\n\nJob Details\n\nThis role can be based in Thailand\n\nAt Salesforce, there is nothing more important than the success of our customers. In the Customer Success Group, our trusted experts and high-value services secure customer success by accelerating adoption, engagement, and growth for customers of all sizes. In collaboration with Sales, Technology & Products, and our Partner community, we bring the full power of Salesforce to help customers to achieve business value faster.\n\nWe are seeking innovative and passionate Project Manager who share our vision of bringing the power of cloud computing to enterprises. Project Managers are experienced professionals on our project teams responsible for overseeing the production of deliverables. They work closely with various technical and non-technical team members... managing and running more complex, enterprise and strategic technical projects. Our Project Managers are subject matter experts who actively participate on the project, scoping, contracts review, knowledge transfer, and budget management.\n\nResponsibilities\n• Build a high-performing team that embodies the Salesforce values focused on making every customer successful\n• Provide executive project oversight and client communication.\n• Hire world class talent and manage performance to ensure career growth opportunities\n• The success metrics in this role will include project margin, CSAT and utilization.\n• Ensure on time and on budget delivery of projects while also ensuring that project gates and governance are properly adhered to during the execution of the project.\n• Track utilization of project resources and manage this against the resource allocation and budget. This includes on time entry and approvals for project timesheets.\n• Create and manage project plans; monitor and review project progress and timelines; adjust schedules and plans as needed; and identify and resolve issues to ensure project success.\n• Ensure on time and on budget delivery of projects while also ensuring that project gates and governance are properly adhered to during the execution of the project.\n• Track utilization of project resources and manage this against the resource allocation and budget. This includes on time entry and approvals for project timesheets.\n• Manage day-to-day execution of project implementations. Assist with the planning, tracking, documentation and status updates for the project.\n• Able to manage one or two large projects or a couple of small to medium sized interrelated projects requiring complex cross-functional collaboration and management at the program level.\n• During the course of a project, be the primary customer interface and perform project management activities that ensures adherence to Salesforce methodology and project gates and governance.\n• Exercise solid project leadership skills combined with strong business acumen and in-depth analytical skills.\n• Facilitate requirements gathering and assist with the creation of project deliverables, as needed.\n• Facilitate and own the creation of salesforce technical design documents for complex projects, by interfacing with Technical Architects and Developers, as needed.\n• Provide hands on configuration / customization of the salesforce product.\n• Adopt a standardized development lifecycle methodology for all projects.\n• Identify opportunities to leverage all Salesforce technologies.\n• Facilitate review sessions with the client and your team.\n• Participate in end to end implementation planning including project management, issue management, communication and change management.\n• As necessary, write and review QA and UAT test scripts.\n• Manage UAT with end users including coordination and user acceptance signoff.\n• Prepare user documentation and training documentation as necessary.\n• Leverage business knowledge and expertise to drive business process improvements.\n• Establish and maintain trusted advisor relationships with client project stakeholders by providing vision and future product roadmapping.\n• Have difficult conversations regarding budget, resources and timeline and formally capture and communicate outcomes of those meetings.\n\nPreferred Qualifications & Skills\n• PgMP or MSP Certification\n• PMP Certification\n• 15+ years experience in Project Management Role.\n• 15+ years experience in managing external client projects in positions of increasing responsibility in the delivery of business consulting and systems development.\n• Implementing enterprise-scale software solutions. CRM and Salesforce.com implementation experience preferred or Commerce (digital, and physical store), point of sale and omni implementation experience preferred.\n• Experience with defining and managing customer specific Development Operations, Managed Services projects\n• Demonstrated project leadership skills, with direct responsibility for managing project teams, budget and schedule.\n• Demonstrated negotiation, conflict management and leadership skills.\n• Demonstrated project management skills with teams of up to 10+ people.\n• Demonstrated history of delivering high quality results on schedule and within budget.\n• Outstanding and effective interpersonal skills; along with strong communication skills both verbal and written.\n• Ability to weigh business and technical requirements to produce project plans and estimates.\n• Ability to lead both small and enterprise-wide engagements, facilitate meetings, mentoring teams of junior team members and effectively managing client escalations.\n• Manage and communicate with remote developers during non-traditional business hours.\n• Ability to work effectively in a fast paced, high energy, team-oriented environment.\n• Ability to multi-task and perform effectively under pressure.\n• Must be able to travel\n• Experience with business process expertise around Marketing, Sales, Customer Service, or Vertical (i.e. Financial, Life Sciences, or Semiconductor) or Commerce (eCommerce and physical store).\n• Salesforce.com Certifications (Admin, Consultant, Developer) preferred but not necessary\n• Should have strong consulting background, ideally from the big 4\n• As this role would cover Thailand, fluency in Thai language preferred\n\nLeadership Qualities\n• COMPOSURE: Strong customer-facing communication and interpersonal skills with the ability to support complex engagements\n• EXPERTISE: Working knowledge of industry best practices and implementation experience of the salesforce product suite\n• CREDIBILITY: Able to interact with various levels of an organization both technical and non-technical to discuss comprehensive solutions\n• CONSULTATIVE: Able to lead high powered workshops and effectively tailor messaging based on the audience and subject matter\n• WILLINGNESS: Able to analyze customer issues, articulate comprehensive solutions, and craft a plan of action\n• LEARNER: Has a passion for continued education in new technologies and complex business and technical concepts\n• PASSION: Passionate about Customer Success and is a great listener\n• URGENCY: Ability to move fast and drive business value and results\n• OHANA: Embodies Aloha culture and a team player that everyone enjoys working with and has a generous heart\n• TRUST: Ability to earn the trust of the customer and lives the company’s core values\n\nAbout Salesforce\n\nSalesforce, the Customer Success Platform and world's #1 CRM, empowers companies to connect with their customers in a whole new way. The company was founded on three disruptive ideas: a new technology model in cloud computing, a pay-as-you-go business model, and a new integrated corporate philanthropy model. These founding principles have taken our company to great heights, including being named one of Forbes’s “World’s Most Innovative Company” five years in a row and one of Fortune’s “100 Best Companies to Work For” eight years in a row. We are the fastest growing of the top 10 enterprise software companies, and this level of growth equals incredible opportunities to grow a career at Salesforce. Together, with our whole Ohana (Hawaiian for \"family\") made up of our employees, customers, partners and communities, we are working to improve the state of the world.\n\nAccommodations - If you require assistance due to a disability applying for open positions please submit a request via this Accommodations Request Form.\nPosting Statement\nAt Salesforce we believe that the business of business is to improve the state of our world. Each of us has a responsibility to drive Equality in our communities and workplaces. We are committed to creating a workforce that reflects society through inclusive programs and initiatives such as equal pay, employee resource groups, inclusive benefits, and more. Learn more about Equality at Salesforce and explore our benefits.\n\nSalesforce.com and Salesforce.org are Equal Employment Opportunity and Affirmative Action Employers. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status. Salesforce.com and Salesforce.org do not accept unsolicited headhunter and agency resumes. Salesforce.com and Salesforce.org will not pay any third-party agency or company that does not have a signed agreement with Salesfore.com or Salesforce.org.\n\nSalesforce welcomes all", "extensions": ["28 days ago", "Full–time"], "detected_extensions": {"posted_at": "28 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJNYW5hZ2VyLCBTZXJ2aWNlcyBQcm9ncmFtL1Byb2plY3QgTWFuYWdlbWVudCAtIFRoYWlsYW5kIiwiY29tcGFueV9uYW1lIjoiU2FsZXNmb3JjZSIsImNvbXBhbnlfbWlkIjoiL20vMDdidHI1IiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiZE1laDJ3Ylg2eWxzenJmQ0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXQ4QkNxSUJRVTVWWDA1eFVtZzNNWEprV25keVRYSnVjSE5aYjJkVE9UZzVkak5vT1VGTVVGWkRiMUZUWkZWc2F6aFNRMnRsWW5GTFFWZDBhVmRSUmpWbFZrSjNVelZsYlMxa1NUTXpSblJ3YjJsaVNFMU5UbUpvTWs4M09FVnJVbkpQYmtwTmN6WkdaRkl5UVRKb2IyeDVjSE16VmpkdGFVZEtTMWxhTUMxSGRrSlVhMUprZEVscVpEVnBXbnB2VDJ4dVFXSlBZVjlhTUhZMVVrNTROSGRrTjJFMlluSjNFaFJ2TXpaRFdVMUxVME0xYlVkMFVXRkVYMGxWVVJvaVFVOU5XVkozUW5sa2VuWnROR00zY1ZGSUxVeE9iREZWWkhWSUxVeHRia2RzVVEiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18yMyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL3NnLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvbWFuYWdlci1zZXJ2aWNlcy1wcm9ncmFtLXByb2plY3QtbWFuYWdlbWVudC10aGFpbGFuZC1hdC1zYWxlc2ZvcmNlLTI0MjUyMjA2OTY/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Project Manager (BB-86EA3)", "company_name": "ENUIT PTE. LTD.", "location": "Singapore", "via": "via BeBee", "description": "Roles & ResponsibilitiesAbout UsEnuit is a growing company and technology leader in the energy trading & risk management space providing mission critical software platforms for natural gas, electricity, metals, crude and refined product merchants such as utilities, refiners, producers, traders, and consumers.Enuit has the latest technology and is revolutionizing the development and deployment of Entrade, its flagship product, empowering clients to increase operational efficiency, to monitor and manage risk, and to increase profit margins along all aspects of their business from front to back. Entrade allows the traders, market and credit risk practitioners, operations and schedulers, and accountants to effectively manage a broad range of physically and financially traded commodities as well as the complex logistics operations associated with commodities such as natural gas, electricity, crude and associated refined products, coal, metals, and agricultural products to name a few... Headquartered in Houston, Texas, Enuit has projects throughout North America and Asia with opportunities popping up with a global partners across the globe. Enuit seeks to hire a Project Manager. As an Energy Trading & Risk Management Software Project Manager, you will be responsible for coordinating the team throughout all project management phases and to ensure alignment of company’s business targets with overall project objectives and outcomes. Description of the Opportunity: Meet with clients to take detailed ordering briefs and clarify specific requirements of each project; Set the strategic direction of all projects, define project’s scope set milestones and deadlines, create budget and revenue estimates and manage project resource and their costs; Assign, prioritize and supervise project tasks that are delegated to project team members; Track project performance using appropriate KPIs, metrics, tools and techniques specifically to analyze the successful completion of short and long term goals; Prepare status reports and project deliverables and ensuring they adhere to quality standards; Identify, prevent and manage risks; Provide project progress to management frequently; Establish effective project communication plan and ensuring quality execution; Coordinate the development of user manuals, training materials and other documents as needed to enable successful implementation with clients; Conduct post project evaluation and identify successful and unsuccessful project elements; Prepare and handle all necessary project management activities with clients; Prepare and manage all related contract management activities with clients; Work with relevant personnel from different departments where necessary; Manage and update internal tracking system (i.e. BQE) for project activities and expenses; Coordinate and review invoices before sending to clients; Manage any special assignments provided from management. Qualifications for consideration: Minimum of bachelor’s degree in Business, Management Information Systems, Computer Science/Engineering or related field; 5 years’ experience in project management with PMP Certification is preferred; Ability to lead project teams of various sizes and see them through to completion; Strong interpersonal skills, ability to define situations, document data and draw conclusions; Track record in client management and conflict resolution skills; Excellent written and verbal communication skills with the ability to motivate and influence others; Works well with project team members; Good Energy/Commodity industry knowledge is a plus.Tell employers what skills you haveBusiness AnalysisConflict ManagementInterpersonal SkillsLeadershipOperational EfficiencyPerformance MetricsProgram ManagementProject ManagementProject PlanningSoftware ImplementationTrackingplatformRisk Mgmt", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIgKEJCLTg2RUEzKSIsImNvbXBhbnlfbmFtZSI6IkVOVUlUIFBURS4gTFRELiIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoidVNUXzJaX3dtaFNiOG9zOUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCZUJlZSIsImxpbmsiOiJodHRwczovL3NnLmJlYmVlLmNvbS9qb2IvMjAyMTA0MTctNTI0ZjVhOTYxYTEyMzMyNDg0MzI4OTEyYzljODZlYTM/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Regional Project Manager", "company_name": "Workiva", "location": "Singapore", "via": "via Glassdoor", "description": "The Project Manager is the point person for customer-related projects. This person plans, budgets, monitors, and documents all progress of a particular project, including delays, setbacks, and unexpected circumstances. The Project Manager leads the resources assigned to the project and is ultimately responsible for the project's success. This role oversees the budget, timeline, and scope of high-profile projects with large budgets.\n\nWhat You'll Do\n• Acts as the point of contact person for issues regarding the project.\n• Responsible for the project from inception to completion.\n• Leads the project team and is responsible for holding the team accountable to timelines, budget, deliverables, and scope.\n• Manages project documentation and reporting.\n• Communicates potential delays and estimated delivery dates to all stakeholders.\n• May work onsite with customers to ensure the project meets the customers' expectations.\n• Oversees schedules, budgets, timelines, and project scope to ensure... goal attainment.\n• Researches the proper budget for a given project, ensures the team stays within budget, and speaks to each budgeted expense.\n• Has the authority to readjust the budget as needed, within scope.\n• Stays in constant contact with the customer to ensure project is on track and communicates progress on a consistent basis.\n• Consults with stakeholders when project execution does not fall within the budget, timeline, or scope to ensure the project stays within budget, on time, and within scope.\n• Works closely with Stakeholder teams and Workiva management to act as an ambassador and advocate on behalf of the customer.\n• Consults with cross functional teams to ensure all are aligned.\n\nWhat You'll Need\n• Associate or bachelor’s degree in a related field preferred, or equivalent combination of education and experience\n• 5+ years of experience required\n• Customer-facing experience required\n• Familiarity working within the Software or Technology field strongly preferred\n• Excellent verbal, written, and interpersonal communication skills\n• Ability to set priorities, meet deadlines, and manage multiple projects in a fast-paced, changing environment\n• Strong project management and time management skills are a must\n• Experience working in in the Big Four strongly preferred\n• PMP certification preferred\n• Up to 50% travel\n• Reliable internet access for any period of time working remotely, not in a Workiva office.\n\nWhere You’ll Work\n\nOur values drive how we work and who we hire. You will see these values ingrained in how we support our customers, work with team members, build our products and in the work environment we’ve created.\n• Customer Success : Always delight our customers.\n• Trust: Rely on each other.\n• Integrity: Do the right thing, every time.\n• Collaboration: Share resources and work together.\n• Innovation: Keep creating solutions and finding better ways.\n• Inclusion: Support a diverse community where we all belong.\n• Accountability: Be responsible for your success and failure.\n\nWe believe our people are our greatest asset, and our unique culture gives employees the opportunity to make an impact everyday. We give our employees the freedom and resources they need—backed by our culture of collaboration and diverse thought—to continue innovating and breaking new ground. We hire talented people with a wide range of skills and experiences who are eager to tackle some of today’s most challenging problems.\n\nAt Workiva, you’ll enjoy:\n• Casual Dress: Workiva has a casual work environment, most people wear jeans to the office.\n• Involvement: Ability to participate in Employee Resource Groups, (Women in Tech, Women in Sales, Ethnic Diversity, Veterans, Rainbow (LGBTQ), Remote Employees, Caregiving) Volunteering, Company wide celebrations, and more\n• Work-life Balance: We have competitive PTO, VTO and Parental Leave. We encourage employees to spend time enjoying life outside of work.\n\nLearn more: http://https://www.linkedin.com/showcase/workiva-life-and-careers/\n\nWorkiva is an Equal Employment Opportunity Employer. We believe that great minds think differently. We value diversity of backgrounds, beliefs, and interests, and we recognize diversity as an important source of intellectual thought, varied perspective, and innovation. Employment decisions are made without regard to age, race, creed, color, religion, sex, national origin, ancestry, disability status, veteran status, sexual orientation, gender identity or expression genetic information, marital status, citizenship status or any other protected characteristic.\n\nWorkiva is committed to working with and providing reasonable accommodations to applicants with disabilities. To request assistance with the application process, please email talentacquisition@workiva.com ", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJSZWdpb25hbCBQcm9qZWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJXb3JraXZhIiwiY29tcGFueV9taWQiOiIvbS8wMTEzbTFyZCIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6InpUQmpSNTl4U2h4aUNGWVhBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV0OEJDcUlCUVU1VlgwNXhVVUo0Vm5veU5sQjVNMmRFVkUxdGNrWnFhRVF5TTNNd2FXdG5YelJ4Um1JME9VNXdRVU5oY2pVMVltRlRSR1E0VFRoeWEyVnlPRlUxYkU5SVRWSk5Ua3BCTFY5UVkxOXRiMHBuWkRoV1lsZDVhbkZvTFZWclRIZFhaVEZCVldodVR6TjRRbEpQWkRWd1V6QklXSGhZY3psVFZWUk1Ta3hOZVVOeU4ySjRRVmMyT0dOak4yRjRhM2gxTFVvM1duRXRUR1JZVEdKSlpIZ3RVR2xCRWhSdk16WkRXVTFMVTBNMWJVZDBVV0ZFWDBsVlVSb2lRVTlOV1ZKM1JDMDNURlZXT0ZJeFkxOVNZWGhxTVhNNVdIY3dkR0ZGZEdOQmR3IiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMzUiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gR2xhc3Nkb29yIiwibGluayI6Imh0dHBzOi8vd3d3LmdsYXNzZG9vci5zZy9qb2ItbGlzdGluZy9yZWdpb25hbC1wcm9qZWN0LW1hbmFnZXItd29ya2l2YS1KVl9JQzMyMzU5MjFfS08wLDI0X0tFMjUsMzIuaHRtP2psPTQwMDcxMzUzNDBcdTAwMjZ1dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Software Development Project Manager", "company_name": "Nityo 3p Solutions Pte. Ltd.", "location": "Singapore (+1 other)", "via": "via Monster Singapore", "description": "Lead team to develop business applications.\n\nManages the execution of software development across phases through common software development methodologies.\n\nResponsible for the full cycle of software development phases through project scoping, project resource management, budget planning, tracking and scheduling of project timeline and proper user acceptance test in order to deliver the business applications on time.\n\nBuild clients confidence and trust, strives to exceed expectations, assumes responsiblity for solving problems and ensures commitments are met.\n\nCandidate should possess the following attributes:\n\n- Good communication skill with clients at all levels\n\n- PMP Certified or Scrum Master Certified will be preferred\n\n- About 5 years or more experience in managing full cycle of software development\n\n- Good contract management experience", "extensions": ["11 days ago", "Full–time"], "detected_extensions": {"posted_at": "11 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBEZXZlbG9wbWVudCBQcm9qZWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJOaXR5byAzcCBTb2x1dGlvbnMgUHRlLiBMdGQuIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJaWmdTSmhaa1JBYndnTHZHQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1vbnN0ZXIgU2luZ2Fwb3JlIiwibGluayI6Imh0dHBzOi8vd3d3Lm1vbnN0ZXIuY29tLnNnL2FtcC9qb2ItdmFjYW5jeS1zb2Z0d2FyZS1kZXZlbG9wbWVudC1wcm9qZWN0LW1hbmFnZXItbml0eW8tM3Atc29sdXRpb25zLXB0ZS1sdGQtc2luZ2Fwb3JlLTI3MjcwMDA3Lmh0bWw/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Associate Manager  Program Manager", "company_name": "HCL SINGAPORE PTE. LTD.", "location": "Singapore (+1 other)", "via": "via MNC Jobs Singapore | MNC Jobs In Singapore", "description": "Roles & Responsibilities\n\nThe Scope of Program Manager resources' services will be as follows but not limited to:\n\nI. To deliver projects effectively within scope, on time, on budget, quality and in compliance to Customer on Program Management governance and industry best practices;\n\nII. To sustain strong stakeholder relationships and manage their opinions/ expectations;\n\nIll. To effectively monitor delivery effectiveness, and successfully track all technical & project delivery activities and budget;\n\nIV. To successfully collaborate with project team, technical architect team and vendors to ensure the solution meets Business needs;\n\nV. To accurately identify change requirements and ensuring consistent handling and thorough evaluation throughout the delivery lifecycle;\n\nVI. To ensure accurate and efficient Project Closure Management without undesired effect on stakeholder satisfaction;\n\nVII. To be able to manage multiple projects in parallel as per above requirements\n\nVIII. To be able... to manage projects based on different software methodologies\n\nIX. To have sufficient understanding of the relevant domain area (E.g. Industry, business knowledge) necessary to execute the project in a manner that facilitates business outcomes\n\nX. To have sufficient understanding of the relevant technology necessaryto execute the project\n\nXI. To be willing and able to understand and comply all internal process that govern the delivery of the projects.\n\nSenior Project Manager\n• Minimum years of PM experience - 5\n• Minimum years of Senior PM role – 2\n• Professional certification is a must from recognised IT industry - , ITIL & Prince2 Practitioner, PMP Certified, Scrum Master\n• Certifications such as Lean IT will be\n• Has strong cross-functional and organizational communication skills\n• Managed and led medium to large size, business critical, complex projects end-to-end\n[CANDIDATES WHO REQUIRE WORK PASSES NEED NOT APPLY]\n\n[CANDIDATES WHO REQUIRE WORK PASSES NEED NOT APPLY", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBc3NvY2lhdGUgTWFuYWdlciAgUHJvZ3JhbSBNYW5hZ2VyIiwiY29tcGFueV9uYW1lIjoiSENMIFNJTkdBUE9SRSBQVEUuIExURC4iLCJjb21wYW55X21pZCI6Ii9nLzExZnkyNW5nc3YiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJIQ09OVGxIUU5ma0piazAyQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFb2tDQ3N3QlFVNVZYMDV4VVZaWGExUkNNVlEyV1VodlNGaGhPVXB4WlZKMWNXUk9iVll4VmtJMVprOWtVblp1VmtGNVRHTTJaRXhyYUhKNFF6Um1NR1JqVFVvMWQyVXphMnRIVkV4c2VVdFpTVVJKTldKQ05XTTRabVJHUVVkelJIbFlXRjlLZFROc2FFWkVVRGx6TFZFeWRGWjVOMGw0YkdWSmQzVkxkMk5VTUVkVlJXRjBTMGR5ZFZFMmVYbHdUVE5OU1RGaVEzZzBRa2RRU25SSWFFUnBUamhzWVdKTmJHTkNhWGx2Um5ab1ZHSldZM1ZOVkZkSFVFbGtkVkZNWVhCRlNVMW9NVXh4VkVWNFRXcE5aM1p1RWhSdk16WkRXVTFMVTBNMWJVZDBVV0ZFWDBsVlVSb2lRVTlOV1ZKM1FXTkhkR0l6V0Rkdk0yY3dhR05QZVdoT1UySnBhbW8xZDBKVmR3IiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNDYiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTU5DIEpvYnMgU2luZ2Fwb3JlIHwgTU5DIEpvYnMgSW4gU2luZ2Fwb3JlIiwibGluayI6Imh0dHBzOi8vc2cubW5jam9iei5jb20vam9icy9hc3NvY2lhdGUtbWFuYWdlci1wcm9ncmFtLW1hbmFnZXItc2hlbnRvbi13YXktMTM1ODc3P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Project Manager - Digital", "company_name": "Sciente International Pte Ltd", "location": "Singapore (+1 other)", "via": "via Jobs | Fidanto", "description": "Job Summary An exciting opportunity for an experience Project Manager to be involved in running Digital projects. Mandatory Skill-set\nHave a university degree and professional Project Management Certification like PMP or Prince 2;\nAt least 6 years of proven track record in successful managing projects;\nGood experience in running projects for multi-cultural, multi-location, matrix environment;\nExcellent stakeholder management and management of project team members across multiple locations;\nFocus in meeting time lines, firm hold of project budget, ensuring that internal/external work together to achieve the objectives of the project;\nAbility to think out of the box, proactive in anticipating issues, provide wise counsel/advice to resolve issues and leveraging on industry best practices when applicable;\nLead by example and proven ability to encourage/motivate, monitor, evaluate and develop the project team to meet organization objectives;\nExcellent communication skills and emotional... intelligence to influence key decisions, mediate conflicts and build consensus;\nTenacity and the drive to work through issues obstacles in a calm/collected manner;\nAbility to analyse, make decisions and overcome show-stoppers/difficulties and lead the project to success;\nPre-empt any risks and mitigate any threats or problematic areas proactively;\nFamiliar with project budgeting, project financials /projections, monitoring of project costing and regular project reporting;\nStrong personality and yet personable to build and enrich relationships with the organization.\nDesired Skill-set\nA Keen Entrepreneurial Spirit.\nResponsibilities\nResponsible to lead, drive, manage projects for the organization;\nTo lead and manage project team, sponsors and stakeholders across business and technology lines and functions to ensure the successful delivery of project;\nDevelop, execute and closure of project plan including coming up with detailed work plans, project scoping and initiation document, business case and business requirements document, schedules, project estimates, resource plans, etc.;\nManage project financials and keep track of project costs, scope, risk, schedule and progress, performance, deliverables, issues, escalations and conflicts;\nWork closely with vendors to manage project scope, deliverables, risks, dependencies, cost and timelines;\nLead the teams to ensure that projects are implemented with timelines and meeting business objectives;\nRevise as appropriate to meet changing needs and requirements;\nUnderstand users request, analyse and document the business process flow;\nManagement of team and stakeholders throughout the various stages of projects (including but not limited to facilitating requirements gathering workshops, design specification, identifying target operating model, identifying and facilitating user training need, managing UAT /dress rehearsals/ parallel run/ Go-Live rollout etc);\nProduce accurate and detailed project reports and presentations to update the teams project milestones and status to senior management on a timely basis;\nProactively suggest, adopt industry best practices to run projects more efficiently and effectively;\nPerform post-implementation review.Should you be interested in this career opportunity, please send in your updated resume to apply@sciente.com at the earliest.\n\nWhen you apply, you voluntarily consent to the disclosure, collection and use of your personal data for employment/recruitment and related purposes in accordance with the SCIENTE Group Privacy Policy, a copy of which is published at SCIENTE's website (https://www.sciente.com/privacy-policy).\n\nConfidentiality is assured, and only shortlisted candidates will be notified for interviews", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIgLSBEaWdpdGFsIiwiY29tcGFueV9uYW1lIjoiU2NpZW50ZSBJbnRlcm5hdGlvbmFsIFB0ZSBMdGQiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Ilc2MjhURGNNcFNQdnItTjlBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9icyB8IEZpZGFudG8iLCJsaW5rIjoiaHR0cHM6Ly9zZy5maWRhbnRvLmNvbS9qb2JzL2pvYi1vcGVuaW5nL21hbmFnZXJzLWFsbC1vdGhlci9wcm9qZWN0LW1hbmFnZXItZGlnaXRhbC0yNzUyMjEwMjM/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Management", "value": "GC18"}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Media, Communications and Writing", "value": "GC20"}, {"text": "Advertising and Marketing", "value": "GC03"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Transportation and Logistics", "value": "GC30"}, {"text": "Art, Fashion and Design", "value": "GC05"}, {"text": "Construction", "value": "GC09"}, {"text": "Education", "value": "GC11"}, {"text": "Human Resources", "value": "GC15"}, {"text": "Protective Services", "value": "GC23"}, {"text": "Property", "value": "GC24"}, {"text": "Science and Engineering", "value": "GC27"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "Project manager", "value": "project manager"}, {"text": "Program manager", "value": "program manager"}, {"text": "Manager", "value": "manager"}, {"text": "Project director", "value": "project director"}, {"text": "Delivery manager", "value": "delivery manager"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Senior", "value": "senior"}, {"text": "Consultant", "value": "consultant"}, {"text": "Coordinator", "value": "coordinator"}, {"text": "Deputy director", "value": "deputy director"}, {"text": "Director", "value": "director"}, {"text": "Group manager", "value": "group manager"}, {"text": "Operations", "value": "operations"}, {"text": "Scrum master", "value": "scrum master"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Services", "value": "services"}, {"text": "Vice president", "value": "vice president"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Engineering Services", "value": "/business/naics2007/5413"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Entertainment", "value": "/business/naics2007/71"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Management", "value": "/business/naics2007/55"}, {"text": "Real Estate", "value": "/business/naics2007/53"}, {"text": "Research", "value": "/business/naics2007/5417"}, {"text": "Retail", "value": "/business/naics2007/44"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": ".AB4Jjf.qPB6Vc{padding-right:11px}.qfpP8d{padding:7px 0 7px 11px}.S003Ke{flex:none}.ZoN4Lb{color:rgba(0,0,0,.54)}.nAXVG{color:#70757a}.IxQsL{color:rgba(0,0,0,.26)}.xFO1De{color:#fff}.ooFpK{color:rgba(255,255,255,.30)}.mtnwac{color:#4285f4}.WxeeKb{color:#34a853}.hIVRU{color:#f29900}.EXaTMc{color:#fbbc04}.sxn46d{color:#000}.gqMTF{color:#1a73e8}.zpn8Mb{color:#d93025}.dEUPmd{color:#1e8e3e}.PJNo1{color:#fbbc04}Actively Hiring", "value": "e"}, {"text": "Michael Page", "value": "/m/04cxldw"}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Nanyang Technological University", "value": "/m/0l49k"}, {"text": "Jobline Resources Pte Ltd", "value": "/g/11gp2647pn"}, {"text": "Randstad Singapore", "value": "/g/11g70b50mr"}, {"text": "GECO Asia", "value": "/g/11gk72_bt_"}, {"text": "Facebook", "value": "/m/0hmyfsv"}, {"text": "HP", "value": "/m/03mnk"}, {"text": "IoTalents", "value": "/g/11dxq187wm"}, {"text": "NCS Group", "value": "/m/0282746"}, {"text": "National University of Singapore", "value": "/m/01q460"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "OPTIMUM SOLUTIONS (SINGAPORE) PTE LTD", "value": "/g/11g70hkrbx"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Apple", "value": "/m/0k8z"}, {"text": "Avensys Consulting", "value": "/g/11g7022gjf"}, {"text": "BNP Paribas", "value": "/m/02qhk4"}, {"text": "Ceridian", "value": "/m/07f8h6"}, {"text": "Ensign InfoSecurity", "value": "/g/11g4jhymjr"}, {"text": "Humanica Asia Pte. Ltd", "value": "/g/11h1y98c9z"}, {"text": "Kerry Consulting", "value": "/g/11c73vtzc8"}, {"text": "Marsh and McLennan", "value": "/m/053rw"}, {"text": "NSEARCH GLOBAL", "value": "/g/11dxpksll4"}, {"text": "NTT", "value": "/m/05mybp8"}, {"text": "OakTree Consulting", "value": "/g/11g70jfhtq"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "TEKsystems", "value": "/g/11b6g4bkv0"}, {"text": "Teradyne", "value": "/m/04bzqp"}, {"text": "Toshiba Tec Singapore Pte. Ltd", "value": "/g/11g9n9q547"}, {"text": "Trustwave", "value": "/m/0n3xjf5"}, {"text": "Wood Plc", "value": "/m/07vv9s"}, {"text": "Workiva", "value": "/m/0113m1rd"}, {"text": "A-it Software Services Pte Ltd", "value": "/g/11dxpy_gl_"}, {"text": "ABS Group", "value": "/g/11dxplj1z6"}, {"text": "ACI HR Solutions Ltd", "value": "/g/11c73ryh3p"}, {"text": "AIA", "value": "/m/02r5cgx"}, {"text": "ASEAN CABLESHIP PTE. LTD.", "value": "/g/11b7dsfph2"}]}]}