{"search_metadata": {"id": "60827ea15c56061c80fec5d4", "status": "Success", "json_endpoint": "https://serpapi.com/searches/37bf93228510123f/60827ea15c56061c80fec5d4.json", "created_at": "2021-04-23 08:00:33 UTC", "processed_at": "2021-04-23 08:00:33 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28solution+architect%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=210", "raw_html_file": "https://serpapi.com/searches/37bf93228510123f/60827ea15c56061c80fec5d4.html", "total_time_taken": 1.13}, "search_parameters": {"q": "(solution architect) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "210"}, "jobs_results": [{"title": "Associate Solutions Architect", "company_name": "Amazon", "location": "Singapore", "via": "via Monster", "description": "Job Description :\n• * Please note that this role includes a 6 month Singapore based training and onboarding plan after which you will be deployed to a Solutions Architect team in Singapore.**\nDo you have a deep passion for utilizing technology to empower businesses? Are you passionate about collaborating with technology and business leaders to deliver cloud-based solutions?\nThis is a unique opportunity for motivated self-starters to play a key role in a fast-growing business, and to deliver significant value to AWS customers of all s from nimble start-up’s to global brands. You will learn from top AWS subject matter experts and get paid while you train for an exciting career in the tech industry. These are some of the most challenging and exciting roles in the IT industry today. We work with cutting edge technologies to support the largest and most innovative businesses, non-profits, and government agencies around the world. This is a an exciting opportunity for you to take a role in... helping AWS transform the way the world uses technology to solve their business challenges. The skills and experiences you gain are highly sought after throughout the industry and give you the opportunity for the career of a lifetime.\nOur Commercial Sales Associate Solutions Architects are passionate technologists with technical breadth and depth coupled with strong interpersonal skills. They are passionate about helping customers build infrastructures and applications at scale. In this role, you will partner across AWS teams to help customers craft highly scalable, flexible and resilient cloud architectures that address customer business problems. As a trusted customer advocate, you will help organizations understand best practices around cloud-based solutions, and how to migrate existing workloads to the cloud. You will have the opportunity to help customers use AWS within their organizations ranging from new start-ups to large enterprise customers.\nBasic Qualifications :\nBachelor's degree in Computer Science, Computer Engineering, Software Engineering or related fields\n1-3 years of experience as a technical specialist in customer-facing roles.\nExperience with one of the following programming languages: Java, Python, Ruby, Node.js, C#, or C++\nExperience with Networking fundamentals, Security, Databases (Relational and/or NoSQL), Operating Systems (Unix, Linux, and/or Windows)\nAbility to interact with business and technical staff within a customer or partner organization.\nAbility to communicate effectively with a diverse set of customers or partners, across multiple disciplines.\nPreferred Qualifications :\nMaster’s degree in Computer Science, Computer Engineering, Software Engineering or related fields\nWorking knowledge of modern software development practices and technologies such as agile methodologies and DevOps is highly desired.\nTechnical acumen, including the ability to understand the customer IT landscape, identify opportunities and overcome any technical obstacles, ultimately influencing the adoption of AWS platform in conjunction with business requirements.\nAWS Certification, e.g. AWS Solutions Architect Associate", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBc3NvY2lhdGUgU29sdXRpb25zIEFyY2hpdGVjdCIsImNvbXBhbnlfbmFtZSI6IkFtYXpvbiIsImNvbXBhbnlfbWlkIjoiL20vMG1na2ciLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJrM1hyX1FQeGtMZjZFcnUtQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFc3dCQ293QlFVNVZYMDV4VkhSR1FrNUJjME5FWmxSeFVqbFJTbWN4Y1V0SWFIUkRPVVpqWm1kR01tdHRlbmcyVTJWNVpDMVhSRU5GWDB4cGJrdFVNVVZHWm14dVJUaHZPRmxTV1ZneU9GQm9hR1ZxT0c1U2VrdFBRM0E1TTNOemEyeFdXSGR0VTJaUGQwWjFZVGc0WVY5V1RsVXpRVEl3Ym1veU1VZzNaMEZrTUc1ZlNubHJSemRZWDBGNlRIVklOV1VTRjI5WU5rTlpUSEZxUmkxeGR6Vk9iMUJyV25GUFowRnpHaUpCVDAxWlVuZENWRVl6V2xkR1RYTnNSMEpITjJ0ZmFVaEdjR0ZNYWtoc1luZEIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY183IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1vbnN0ZXIiLCJsaW5rIjoiaHR0cHM6Ly93d3cubW9uc3Rlci5jb20uc2cvam9iL2Fzc29jaWF0ZS1zb2x1dGlvbnMtYXJjaGl0ZWN0LWFtYXpvbi1zaW5nYXBvcmUtMjU2NzA4Mz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Lead System Engineer, Cloud / Infrastructure (up to S$7000)", "company_name": "HTZ RESOURCES", "location": "Singapore (+1 other)", "via": "via Singapore", "description": "Lead System Engineer, Cloud / Infrastructure (up to S$7000) HTZ RESOURCES Central SGD 5,000 - SGD 7,000 Posted on 22-Mar-21 Lead System Engineer, Cloud / Infrastructure (up to S$7000) HTZ RESOURCES Job DescriptionYour Role You will be providing daily administration & support on emerging cloud technology which has hands-on experience on Azure, AD, Office365 and various cloud services such as container services, ASE, data analytics etc. What Will You Do Actively participate on improving monitoring of IT Infrastructure to ensure optimal IT Services delivery Support and involved or lead cloud computing migration and operation which could be initiated from cross-function team Understand data center operation support and administration. Coordinate and conduct regular attestation reviews as per policies and procedures. Prefer the appreciation on legacy technology such as VMWare, SAN which can involve on transformation projects Support overseas/ remote office IT infrastructure setup. Provide... solutions to business. Manage projects when required. Review workflow, processes and ensure SOPs are in place and remain relevant. Define, develop architectural & setup standards and implementation guide to meet business needs globally. What Do We Want At least 6-8 years of similiar experience and Techincally sound experience in architecture design, managing and support the following applications/systems – Cloud Computing Platforms (Office365, Azure, AWS,etc), Microsoft Active Directory, DNS & DHCP Services, GPO, Microsoft Windows Server Operating Systems etc. Well versed in administrating the following technologies will be a plus – Microsoft Lync/Skype for Business, Linux based Operating Systems, VMware & Hyper-V hypervisors, SAN/NAS, Endpoint Backup Solution, Citrix, CommVault, Public & Private Certificates management. Ad advantage with the Certifications such as Microsoft Certified Professional (MCSE various track), VMware, PMP/ PRINCE2, ITIL V3, AWS Certified Solutions Architect/ Azure Solutions Architect will be an added advantage. Independent worker with initiatives, resourceful, positive attitude, friendly deposition, and team player. Experience in working with different cultures and demographics. Good analytical skills and attention to details. Good verbal and written communication. What Will You Get In Return You will be given exposure to a hold a key position in a growing organization with attractive rewards and a wide range of benefits. You will entitle a salary up to S$7000 + attractive perks. What You Need to do Now Click \"Apply\" and please include the following information in your resume: Personal Particulars with recent photograph Education background Work experiences in point forms Reason(s) for leaving Current and Expected salary Date of availability / Notice Period Note: Only shortlisted candidate will be notified via email for an interview invitation Additional Information Senior Executive Qualification Diploma, Advanced/Higher/Graduate Diploma, Bachelor's Degree, Post Graduate Diploma, Professional Degree, Master's Degree HTZ Resources (EA No.14C7241) is new staffing provider for many international MNC and SME in Singapore & Malaysia. Bronze Winner for Best New Recruitment Agency 2018 by Asia Recruitment Awards Bronze Winner for Best New Recruitment Solution Provider by HR Vendor of the Year 2018 Bronze Winner for Best Staffing Recruitment Firm by HR Vendor of the Year 2019 Additional Company Information Registration No. 14C7241 EA No. 14C0232 EA Registration No. R1654517 Company Size 1 - 50 Employees Average Processing Time 20 days Human Resources Management / Consulting Benefits & Others Regular hours, Mondays - Fridays, Business (e.g. Shirts", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJMZWFkIFN5c3RlbSBFbmdpbmVlciwgQ2xvdWQgLyBJbmZyYXN0cnVjdHVyZSAodXAgdG8gUyQ3MDAwKSIsImNvbXBhbnlfbmFtZSI6IkhUWiBSRVNPVVJDRVMiLCJjb21wYW55X21pZCI6Ii9nLzExaDIxcDliNGQiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJlWFk3UFY2dy1vRGw5Y1Z0QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUlCQ3FJQlFVNVZYMDV4VXpoa1RVSnBlakowVHpoNlNFMTNaV05KVWxacVJtcEJOa1ZEVUdWaVZITlZMVEV6TkZWTU1YVlRabWRoT0hKeWIzSnNOWFI2TWxsSE1sZzRXazFSU2pOSU0yTXRWVXBwV1doVU5YWkNVRkpSU3pZNGJWSnZNWGxQTXpONGFVNTJjbnAxTjNSbFZrSTVkVGN3VEdablQwVmZNRzFoYkc5blZGSkhiRlZpWlVFdFVWUkNabTQ0VEUwMU1rbG1Wamh2V0VoWmJGVmZiR0ZCU0UxbkVoZHZXRFpEV1V4eGFrWXRjWGMxVG05UWExcHhUMmRCY3hvaVFVOU5XVkozUWpaeGNsWTNkbHBUTkhaVGRYZFRValZ4UmpSVFlsQklaVVpoUVEiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18xNCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBTaW5nYXBvcmUiLCJsaW5rIjoiaHR0cHM6Ly9zZy5maWRhbnRvLmNvbS9qb2JzL2pvYi1vcGVuaW5nL2VuZ2luZWVycy1hbGwtb3RoZXIvbGVhZC1zeXN0ZW0tZW5naW5lZXItY2xvdWQtaW5mcmFzdHJ1Y3R1cmUtdXAtdG8tczcwMDAtMjc1NTE4MTM3P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Cloud and IT Transformation - Enterprise Architect - Manager", "company_name": "PricewaterhouseCoopers Consulting (Singapore) Pte. Ltd.", "location": "Singapore", "via": "via Workday", "description": "Line of Service\nAdvisory\n\nIndustry/Sector\nNot Applicable\n\nSpecialism\nEnterprise IT Architecture\n\nManagement Level\nManager\n\nJob Description & Summary\nAt PwC South East Asia Consulting, we help businesses to work smarter and grow faster. We partner with our clients to build\neffective organisations, innovate and grow, reduce costs, manage risk and regulation and, leverage talent. Our aim is to\nsupport businesses in designing, managing and executing lasting beneficial change.\nPwC’s South East Asia Consulting practice provides a comprehensive range of professional services and experience to deliver\nlarge scale, cross territory transformation projects, wherever our clients need us to be – from strategy through to execution.\n\nAbout the Team\nPwC SEAC’s Technology Consulting’s vision is to create meaningful relationships with our clients by powering the next generation digital enterprise.\n\nOur practice spans the whole range of clients’ digital capabilities, ranging from strategy to execution... We help solve complex boardroom problems, and work with the team to not only solve problems of today but get them ready for new\nopportunities for tomorrow, creating the pathway of how technology can enable business visions. We help our clients with advisory services such as IT & cloud strategy, IT cost & governance, IT operating model etc. We also work on the\nimplementation of various IT applications e.g. CRM, ERP and SharePoint.\n\nOur focus areas are Enterprise Architecture, Vendor Selection, IT Cost optimisation, IT Governance and Compliance, IT Effectiveness & Operating Model Optimisation.\n\nAbout the Role\n• Design, creating POCs, defining the solution blueprint, architecture definition, workload estimation, release planning, sourcing model and resourcing strategy\n• Assist in project delivery from a perspective of Architecting, Designing and Delivering capabilities to the existing environment from infrastructure through to systems and application\n• Works with internal teams, vendors and the delivery teams to provide fit for purpose solutions in line with established industry and company standards\n• The EA will need to focus on application, database, system, and infrastructure information and data interaction including alignment with the Information Management and Strategy function and other business information domains.\n• The Application, Data, and Technical Architecture will involve the identification, definition, and creation of architecture artefacts for our clients\n• This includes the support of data governance, repository standards, information infrastructure, and core information management capabilities such as: master data management, data capacity management, indexing and searching across structured and unstructured data in the federated enterprise, data lifecycle management, reporting, data security, analytics, and enterprise content management\n• Researches and maintains an understanding of trends within the market and understands the role of new technologies in the development of efficiencies within operational services\n• Impeccable attention to detail and with proven abilities to translate client requirements into solutions, and confident with an ability to handle pressure in critical situations by always ensuring that client requirements are met\n• Proactively identifying and pursuing opportunities for further business and team growth\n\nAbout you\n• Minimum 6 - 7 years of relevant experience preferably with a Consulting or Technology firm with experience in Engineering and delivery of complex, integrated IT Solutions\n• Prior experience in TOM Design, Process Design, Change Management, and Project Management across several transformation initiatives\n• Prior Solution Architecture experience\n• Preferred experience in IT strategy, including Organisational Design and IT Effectiveness; Technology & Architecture, Application, Security & Infrastructure Consulting; IT Sourcing, all areas with particular focus on Applications; IT Transformation; IT Optimisation, including IT Service Strategy and Design and Service Integration and Management (SIAM)\n• Some experience with broader business process re-engineering efforts and principles (Lean, workflow design, etc.)\n• Hands-on experience in AWS/ Azure/ ServiceNow/ VMWare SDDC, ISM , System management skills etc.\n• Self-driven, curious and a fast-learner, and able to take responsibility for personal growth and development\n• Able to demonstrate the ability to research and analyse pertinent client, industry, and technical matters\n• Possess strong problem solving skills and able to prioritise and manage multiple tasks\n• Strong interpersonal and stakeholder management skills with ability to coordinate between technical and business teams\n• Excellent verbal, written communication and interpersonal skills with stakeholders at all levels\n• Demonstrated project management experience handling multiple projects simultaneously\n• Able to interact with various levels of internal and external stakeholders both in written and verbal forms\n• Ability to efficiently understand client organasations and their business model and to tailor relevant processes to privacy requirements.\n• Good to have the following certifications:\n• - AWS /Azure Certified Solution Architect\n• - ITIL Master certification\n• - Professional Cloud Solutions Architect Certification\n• - CTA: Certified Technical Architect\n\nEducation (if blank, degree and/or field of study not specified)\nDegrees/Field of Study required:\n\nDegrees/Field of Study preferred:\n\nCertifications (if blank, certifications not specified)\n\nDesired Languages (If blank, desired languages not specified)\n\nTravel Requirements\nNot Specified\n\nAvailable for Work Visa Sponsorship?\nYes\n\nGovernment Clearance Required?\nNo\n\nJob Posting End Date", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDbG91ZCBhbmQgSVQgVHJhbnNmb3JtYXRpb24gLSBFbnRlcnByaXNlIEFyY2hpdGVjdCAtIE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJQcmljZXdhdGVyaG91c2VDb29wZXJzIENvbnN1bHRpbmcgKFNpbmdhcG9yZSkgUHRlLiBMdGQuIiwiY29tcGFueV9taWQiOiIvZy8xMWZ5MjE4azR6IiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoidkpseU51SVQ0cWR5TWVydkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVJQ0NxSUNRVTVWWDA1eFUxbDNhek42V2tkR1ZFUldZazlyZFdSV2RHNTZVV3cyTTNKMFVFUkNRemR4ZWpCemIxUnBNSGhpWW1zMGNpMHlabUZ0VTJGWVVIRnJaM1pyYlVSNk9IZGtNRGRmZEY5V1prUndVRTQxTjJGZlJUSTViVlJ0U0RCcmNYTXlOR0kzZDFacFZYZGhaazUzTm1WeGVERlhiekF4UkVVd1R6a3hVVk5OVG5OWU1VZFNWVkZzVG1kZlptOHhMV0Z1VGtaUWFsVkxTM2xsT0VnM2QzQjVibFowUW5wMGVVMDJUM2N3YURSeFR5MTZjVkJXUTNwMGEzRjRNRUpKZVMxTmVsUTBlVzFzYlVwTlQwWXRRVEF0Wm10c1kzbHJXa2huZUdGRVpuaHFOVTVGYURsc2JFbDRURXhUWTFSak4zUjBhMnRUVDJGdVZYbFRSVmxoYVdWNVgxTXhSalp1ZWxoaVpHOXZVWGRaVjBWcE9HbGZkWGR1WmxSc2NFRmplbEVTRjI5WU5rTlpUSEZxUmkxeGR6Vk9iMUJyV25GUFowRnpHaUpCVDAxWlVuZERTV2xsUlVkUWRVdHpUM0l4TjJkQmRGcEpXVTlTTjB4TmJWbFIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18yMCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBXb3JrZGF5IiwibGluayI6Imh0dHBzOi8vcHdjLndkMy5teXdvcmtkYXlqb2JzLmNvbS9HbG9iYWxfRXhwZXJpZW5jZWRfQ2FyZWVycy9qb2IvU2luZ2Fwb3JlL0Nsb3VkLWFuZC1JVC1UcmFuc2Zvcm1hdGlvbi0tLUVudGVycHJpc2UtQXJjaGl0ZWN0LS0tTWFuYWdlcl8xNzk0MzRXRD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Solution Architect (AWS)", "company_name": "Accenture Southeast Asia", "location": "Singapore", "via": "via LinkedIn", "description": "About Accenture\n\nAccenture is a global professional services company with leading capabilities in digital, cloud and security. Combining unmatched experience and specialized skills across more than 40 industries, we offer Strategy and Consulting, Interactive, Technology and Operations services—all powered by the world’s largest network of Advanced Technology and Intelligent Operations centres. Our 506,000 people deliver on the promise of technology and human ingenuity every day, serving clients in more than 120 countries. We embrace the power of change to create value and shared success for our clients, people, shareholders, partners and communities. Visit us at www.accenture.com.\n\nJob Title: Solution Architect (AWS)\n\nJob Description\n\nAccenture is looking for passionate and customer obsessed AWS solution architects to help deliver complex projects using AWS native services. You’ll work with smart people across our industry specialist organisations, and technology groups to help our... customers get the most out of AWS in their cloud journey. The role is based in Singapore and will include travel in the ASEAN region.\n\nCritical Success Factors:\n\nBasic Criteria\n• 3 -10 years of experience with Amazon Web Services. Candidate must have strong experience with multiple AWS services beyond traditional IaaS.\n• Candidate must have at least 2 AWS Associate Certifications and 1 AWS Professional Certification\n• Hands-on AWS experience with a minimum of 2 implementations (preferred in Enterprise scale environments)\n• Experience with at least one programming language (compiled or interpreted languages)\n\nPreferred Criteria\n• Bachelor’s degree or equivalent\n• Experienced AWS Cloud Architect with specialization in at least one of the following areas:\n• AWS Cloud Strategy: Business Case development, application assessment and migration planning, Cloud Operating Model design\n• AWS Security: Compliance, Cloud Security Architecture, third-party security tools/platforms, encryption/KMS/CloudHSM, Inspector, Macie, IAM policies/roles, Shield, WAF, etc.\n• Cloud Native Application Architecture: AWS PaaS/FaaS services, Serverless architecture, Lambda, API Gateway, Containerization and Microservices, Lightweight architectures including JavaScript frameworks (Backbone.js, AngularJS, React), single page applications, and modern web applications.\n• AWS Migration: Optimization of applications to scalable cloud designs, rearchitecting applications to modern cloud patterns, and database migration (including cross-platform)\n• DevOps and Infrastructure as Code: AWS environment and application automation utilizing CloudFormation and third-party tools (Chef, Puppet, Ansible, etc.). CI/CD pipeline setup using AWS services such as CodeBuild/Commit/Deploy.\n\nKey Responsibilities may include:\n• Design Cloud Native Application Architectures, ensure that solutions are designed using AWS native services and with customer user experience, scale/performance, security and operability in mind.\n• Understanding of overall system architecture, scalability, reliability, and performance in a MPP database environment\n• Experience designing and leading database performance benchmarks.\n• Experience with large-scale data analytics and data warehousing\n• Deliver the infrastructure and operating environment for container based micro services that meet the agreed high availability, performance and security requirements.\n• Independently lead client design workshops and provide tradeoffs and recommendations\n• Deliver the projects with Continuous Integration (CI) and Continuous Deployment (CD) practices and its related tool sets (e.g. JIRA, GIT/BitBucket, Jenkins, Nexus, etc.)\n\nYou will also have opportunities to hone your functional skills and expertise in an area of specialization. We offer a variety of formal and informal training programs at every level to help you acquire and build specialized skills faster. Learning takes place both on the job and through formal training conducted online, in the classroom, or in collaboration with teammates. The sheer variety of work we do, and the experience it offers, provide an unbeatable platform from which to build a career.\n\nAccenture is an equal opportunities employer and welcomes applications from all sections of society and does not discriminate on grounds of race, religion or belief, ethnic or national origin, disability, age, citizenship, marital, domestic or civil partnership status, sexual orientation, gender identity, or any other basis as protected by applicable law", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2x1dGlvbiBBcmNoaXRlY3QgKEFXUykiLCJjb21wYW55X25hbWUiOiJBY2NlbnR1cmUgU291dGhlYXN0IEFzaWEiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Im4zUXlmVG9Gc29CZ1RnbEVBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGlua2VkSW4iLCJsaW5rIjoiaHR0cHM6Ly9zZy5saW5rZWRpbi5jb20vam9icy92aWV3L3NvbHV0aW9uLWFyY2hpdGVjdC1hd3MtYXQtYWNjZW50dXJlLXNvdXRoZWFzdC1hc2lhLTI0NTQwNjU2NTI/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "DevOps Lead / Cloud DevOps Architect", "company_name": "Randstad", "location": "Singapore", "via": "via Glassdoor", "description": "• Established client base across varied industries\n• Exposure to latest technologies\n\nAbout the company\n\nOur Client is a fast growing technology service company in the DevOps/Cloud professional services industry. They have established strong partnerships across all markets and has been aggressively diversifying its business to grow its international presence. As part of their global expansion efforts, they are recruiting for an experienced DevOps Architect/ Cloud DevOps Lead to join their team.\n\nAbout the job\n\nReporting into the Software Manager, your responsibility includes:\n• Designing and creating an efficient metrics-driven DevOps model. This includes designing the release strategy for Azure DevOps Git\n• Implementing automation, processes in accordance with required security and IT policies, standards, guidelines and procedures\n• Overseeing the application release and ensuring deliverables adheres to standards and quality\n• Collaborating with different teams (mainly with software... development team) to roll out project implementations.\n\nSkills and experience required\nAs a successful applicant, you will have at least 5 years of experience in Devops Architecture Design Experience. Exposure to Cloud Services (Azure OR AWS OR etc) and certification in AWS/Azure/DevOps is required for this role.\n\nProven track record of working in consulting background will be highly preferred.\n\nWhats on offer\nThis is an uniquie opportunity to grow together with a fast growing company with exposure to latest technology.\n\nTo apply online please use the 'apply' function, alternatively you can reach me at https://www.linkedin.com/in/hoonteck-nologyrecruitment or 6510 3633. (EA: 94C3609/ R1219669", "extensions": ["5 days ago", "Full–time"], "detected_extensions": {"posted_at": "5 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEZXZPcHMgTGVhZCAvIENsb3VkIERldk9wcyBBcmNoaXRlY3QiLCJjb21wYW55X25hbWUiOiJSYW5kc3RhZCIsImNvbXBhbnlfbWlkIjoiL20vMDhwdDF6IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiazRkblhycXlnUUx2b29sM0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVJQkNxSUJRVTVWWDA1eFZIaHlZMDlyZDFsS1FXSm1TSGxEY0MxM1QxbDVNMXBITVhKd1RWWm5aRVppUTJreGNEUk1kMHBTYkV4RFIwSlhlakJvVFhOR04wcFpXR3BDWTJSdlVITjVXazVMTTNaT2RUZFNPRmQ2ZUZsWlpESlJVWFl6WkdJelgwNHlla1ZYZUc5aGJXRTBNM0prTm1ZeFUxSjRSelJ5VFVaMVdtRm1ZMWhQVkcxMlNFOTFVbGhQVDFvd1ZVdFJNMTlDYlhSRFoyMVhaMEpOUkd0c1pFRjNFaGR2V0RaRFdVeHhha1l0Y1hjMVRtOVFhMXB4VDJkQmN4b2lRVTlOV1ZKM1JEaHhXa2wxUVRkT1ZsSndNVmhuVlRSVU9UTllaVEZTZGtsYVFRIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMzMiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gR2xhc3Nkb29yIiwibGluayI6Imh0dHBzOi8vd3d3LmdsYXNzZG9vci5zZy9qb2ItbGlzdGluZy9kZXZvcHMtbGVhZC1jbG91ZC1kZXZvcHMtYXJjaGl0ZWN0LXJhbmRzdGFkLUpWX0lDMzIzNTkyMV9LTzAsMzRfS0UzNSw0My5odG0/amw9NDAwODM0ODY4OFx1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Senior Cloud Solutions Architect (DevOps)", "company_name": "Orange Business Services", "location": "Singapore", "via": "via LinkedIn", "description": "About Orange\n\nOrange Business Services manages and integrates the complexity of international communications & the associated data journey of services, freeing our customers to focus on the strategic initiatives that drive their business. Our extensive experience and knowledge in global solutions, together with our understanding of multinational business and local support in 166 countries and territories, ensure that our customers receive a consistent, global solution wherever they do business.\n\nOrange is currently looking for a senior cloud solutions architect, to join the team in Singapore. The role will have a focus on growing the Orange infrastructure services business, with specific reference to the Cloud and Managed Services portfolio. The role will be supporting countries in APAC.\n\nThe ideal candidate will possess both pre-sales and post-sales experience in architecting applications on with public cloud solutions such as Azure, AWS, and GCP. The Solutions Architect will work as... part of the regional cloud team to meet with customers, act as a subject-matter expert for this portfolio, and subsequently propose, design and implement respective solutions.\n\nPrimary Duties & Responsibilities\n• Provide technical expertise in analysing customer requirements, recommending solutions, and assisting sales and other pre-sales consultants with the development of proposals, quotations, and presentations.\n• Accountable for technical validation of solutions proposed to customers, including liaising with Orange back-end Engineering, Implementation and Operations teams.\n• Assist the delivery teams by performing high level and low level design activities, including best practice recommendations on technologies and vendors.\n• Work with the wider APAC team to assist on opportunities which fall outside primary responsibilities where required.\n• Technical responsibilities include product selection and sizing, complex solution design and multi-vendor integration, and to facilitate product demonstrations and customer proof of concept engagements.\n• Travel is not a major part of the role, but is required from time to time.\n\nRequired Skills & Experience\n• Minimum of 8 years of experience in IT (preferably 10+), including architecture design/implementation experience with multiple compute, storage, networking and virtualization technologies.\n• Experience leading devops team to follow best practice\n• Application architecture experience. Ability to explain how to deploy an application on cloud using some of native services.\n• Will hold a Bachelor’s degree or higher, and be fluent in spoken and written Mandarin (business level) as well as comfortable in spoken English.\n• Ability to work closely with customers and deal with them in a professional manner\n• Excellent verbal and written communication skills, including ability to produce clear and detailed pre-sales and technical documentation.\n• Strong presentation skills, able to articulate both the technical and business value propositions of proposed solutions.\n• Previous experience with a Systems Integrator or Consulting organization would be preferred.\n• Although this is not a ‘hands on’ role, prior technical experience in the following products would be advantageous:\n\no Amazon Web Services (Associate or Professional)\n\no Microsoft Azure (Azure Solution Architect Expert)\n\no Google Cloud Platform (Professional)\n\no VMWare vSphere (preferably VCP certified)\n\no Cisco LAN & IP Routing (preferably CCNA certified)\n\no Microsoft Technologies (preferably MCSE certified)\n\no Enterprise Storage Technologies (experience with NetApp and/or EMC)\n\no Server Technologies (experience with HP, Dell, Huawei and/or Cisco UCS)\n\no Opensource knowledge includes Openstack, chef, Ansible\n\nNote: Successful candidates will be notify within 2 weeks of their application", "extensions": ["11 days ago", "Full–time"], "detected_extensions": {"posted_at": "11 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQ2xvdWQgU29sdXRpb25zIEFyY2hpdGVjdCAoRGV2T3BzKSIsImNvbXBhbnlfbmFtZSI6Ik9yYW5nZSBCdXNpbmVzcyBTZXJ2aWNlcyIsImNvbXBhbnlfbWlkIjoiL20vMDh6dnl6IiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiT0hjQml0anB5cWtZZHhSY0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRW93Q0Nzd0JRVTVWWDA1eFVtNW1VbmRrZG10aFduZFpOMEUyYWpWT2RucEVMVEJWT1haSGRqRnVNVXhWZDJGblduaGhiMVF0ZUZSWlkwNVVjbHB0TkU1eU9HSnZSRnAzWVVoWWIyNXpOakpTUldjNFN6QlZUbWxvTTIxdVVWRlFVblJVTlZNd2QwRTJWM2hEVjNsdlEzVkxaMU0zT0VkMVFXOUpZbGRrV0ZwU2NrMWpOMlZTU25sa1FsOUZWekpFVUVSaGNWWjJlamRFVEVZd1VucFpTVFY1Y0cxWGVuSklaRWszWm1ob1RXOXdTR1ZKWWpsU09HSkdWbTQ1TWpjMVFscGliWFZKVm1oUWRIZERZMDVEWVhkNUVoZHZXRFpEV1V4eGFrWXRjWGMxVG05UWExcHhUMmRCY3hvaVFVOU5XVkozUTBSbWJsSm9UWEYxZFhCcmRrRkdUVzlIY1d0SU5GcDRhMWxhUVEiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY180MSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL3NnLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvc2VuaW9yLWNsb3VkLXNvbHV0aW9ucy1hcmNoaXRlY3QtZGV2b3BzLWF0LW9yYW5nZS1idXNpbmVzcy1zZXJ2aWNlcy0yNDUyNTAwNDUyP3JlZklkPTJkZGUyNThmLTI1YTktNDNmNC05ZGQxLTQzMWI2NzBhNGFjOFx1MDAyNnRyYWNraW5nSWQ9YlhLZGdjNFoxZVIlMkI5bEdZVEtEbUh3JTNEJTNEXHUwMDI2cG9zaXRpb249MTdcdTAwMjZwYWdlTnVtPTBcdTAwMjZ0cms9cHVibGljX2pvYnNfam9iLXJlc3VsdC1jYXJkX3Jlc3VsdC1jYXJkX2Z1bGwtY2xpY2tcdTAwMjZ1dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Systems Analyst (Cloud Solution Architect)  Contract", "company_name": "Housing and Development Board", "location": "Singapore", "via": "via Jobs", "description": "Systems Analyst (Cloud Solution Architect) - ContractAgency: Housing and Development Board\nJob no.: 555752\nWork type: Permanent/Contract\nLocation: Singapore\nCategories:InfoComm, Technology, New Media Communications, Engineering\nWe provide affordable homes of quality and value. We create vibrant and sustainable towns. We promote the building of active and cohesive communities. We inspire and enable all staff to give their best.You will be part of the multi-disciplinary team working on HDB’s adoption of Cloud Transformation.\nResponsibilities\nLead the Cloud Team in the exploration of the Cloud Technologies to be used in HDB and the setting of approach to be taken for HDB to adopt Cloud\nProvide technical leadership in cloud practices and implementation, including architecture, processes, methodology and tool, and guide the team members in meeting the Cloud Team objectives\nProvide technical consultancy to application project team such that the objectives and IT requirement of the project... are successfully met and implemented\nCreate HDB Cloud Roadmap, taking into consideration the Government policies, and the Cloud’s capacity, efficiency and security\nWork with various stakeholders to align HDB Cloud Roadmap to meet business requirements, and the applicable governance\nDesign Cloud Application Architectures, ensure that solutions are designed using Cloud native services and with customer user experience, scale/performance, security and operability in mind\nResponsible for defining and enforcing cloud architecture landscape (design/operation/security architecture)\nRequirements:\nStrong background in IT, Computer Science / Computer Engineering or related discipline\nCertified Cloud Solution Architect\nCompetent on Cloud Architecture with min 3 to 4 years of hands-on experience on their key features, advantages and disadvantages\nInvolve in the architecture design of at least 3 Cloud projects on commercial cloud platform such as AWS, MS Azure or Google Cloud\nGood understanding across Cloud technologies and infrastructure components (server, storage, network, data, and serverless applications) to deliver end to end Cloud Infrastructure architectures and designs\nPossess good interpersonal and communication skills\nHighly motivated and well versed in Agile Methodologies\nSuccessful candidates will be offered a 1+1 year contract.All applicants will be notified on whether they are shortlisted for the position within 4 weeks of the closing date of this job posting.Advertised: 06 Apr 2021\nApplications close: 19 Apr 2021", "extensions": ["17 days ago", "$600 a month", "Contractor"], "detected_extensions": {"posted_at": "17 days ago", "schedule_type": "Contractor", "salary": "$600 a month"}, "job_id": "eyJqb2JfdGl0bGUiOiJTeXN0ZW1zIEFuYWx5c3QgKENsb3VkIFNvbHV0aW9uIEFyY2hpdGVjdCkgIENvbnRyYWN0IiwiY29tcGFueV9uYW1lIjoiSG91c2luZyBhbmQgRGV2ZWxvcG1lbnQgQm9hcmQiLCJjb21wYW55X21pZCI6Ii9tLzAzNHFrcSIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IkJmNW8yTktUaVpyUTE4ZXlBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVvd0NDc3dCUVU1VlgwNXhVVEpNZUVabFJWQnJPRWRYTXpKTGIwY3hYMlF5UTNVdFVWa3hPRkZQUnpsV2QxQlpaakZIYWt4eVh6aFlTRGxxY25GQ2RFWk5SM0EzUlZKVFVHeHpVMHhqYXpCNFRHUktSRXh2ZEVOSmJUbFBTbmRXWTFwMVJUQnZkR2N5TUdoa2NEUjBTMlpXVjA1T01UaE1hVUZhZWw5cVZtcHJRVWwwUTBwZlZrNXVkVFJUZDNSU1V6RklNSE16ZFRCSlEwMUhhR1J5VUVkUFMzaDVaME15UzBnNVNVOW9Oa1p3YVVsR1NtTm5hbFZQWkdjeGNuTjBabTFxZW0wMWFVOVVka1JYVVdnd1gzYzRFaGR2V0RaRFdVeHhha1l0Y1hjMVRtOVFhMXB4VDJkQmN4b2lRVTlOV1ZKM1JHRXhkVnBGUzFSQlkzaEphV0ZqYzFnMVIxVTVlRWxoZEc5c2R3IiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNDkiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9icyIsImxpbmsiOiJodHRwczovL3NnLmZpZGFudG8uY29tL2pvYnMvam9iLW9wZW5pbmcvYXJjaGl0ZWN0cy1leGNlcHQtbGFuZHNjYXBlLWFuZC1uYXZhbC9zeXN0ZW1zLWFuYWx5c3QtY2xvdWQtc29sdXRpb24tYXJjaGl0ZWN0LWNvbnRyYWN0LTI2Nzg3MzA2OT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Solutions Architect", "company_name": "Big Cloud", "location": "Singapore", "via": "via LinkedIn", "description": "Are you a solutions architect with strong web applications experience? Do you have enterprise-scale cloud deployment experience? Are you a business-orientated, solutions architect?\n\nOne of the worlds largest organisations is seeking to recruit a Solutions Architect. You will be responsible for the overhaul and ongoing development of their eCommerce platform.\n\nYou'll be responsible for developing the business and technical strategies and capabilities required to move enterprise-wide web applications into the cloud. This will include overseeing the end to end transformation project, from conception to delivery.\n\nYou will also provide guidance to more junior members of the team through this period of technological change.\n\nYou'll have...\n• 7+ years industry experience\n• 3-5 years of experience as a solutions architect in web applications\n• Strong cloud native experience\n• A proven track record in delivering highly scalable web applications in the cloud\n• Excellent communication and... stakeholder management skills\n\nNice to have:\n• Agile certification\n• TOGAF certification\n\nBig Cloud is a Machine Learning recruiting firm. We’re lucky enough to recruit the best candidates into the most exciting companies all over the world.\n\nWe try to reply to all unsuccessful applications, but we’re human (for now).\n\nCheck out www.bigcloud.io/hotjobs to see what else we're recruiting for", "extensions": ["12 days ago", "Full–time"], "detected_extensions": {"posted_at": "12 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2x1dGlvbnMgQXJjaGl0ZWN0IiwiY29tcGFueV9uYW1lIjoiQmlnIENsb3VkIiwiY29tcGFueV9taWQiOiIvZy8xMWM3NDNsd3NyIiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiQXpKdTByLUU0aHplck5KYkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVJQkNxSUJRVTVWWDA1eFUyWkhlbmN5YzFnMmJXUnZObnB5Ulc5UlIyVjZka05UYlZRMVpWODNURXhhYVROUGNFZFdVRGxDVWpWdk1tTk9NelZSYlhoaGFFb3haa0ZNVEhZNFpHSmpXVU53UkhweU5HeGpSRjk2YmpkNlFrRk1kMkp6YW5wemRucFFVa1EzVFc1a2N6WXlXRlpTZW00d05rNU9TbTR3UkZoSllYWlRMVEZNV0UxMk9IUnBOSE5OYjJaTmQzVndRVEV3UWxkSmFVaE9ka2RsYUVWWFNtOVJFaGR2V0RaRFdVeHhha1l0Y1hjMVRtOVFhMXB4VDJkQmN4b2lRVTlOV1ZKM1ExZFdPRU5UZDBsUFJGaFZkREpTZUZjMWMxaHZNemQxUkc1NlVRIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNTciLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGlua2VkSW4iLCJsaW5rIjoiaHR0cHM6Ly9zZy5saW5rZWRpbi5jb20vam9icy92aWV3L3NvbHV0aW9ucy1hcmNoaXRlY3QtYXQtYmlnLWNsb3VkLTI0OTk1MTI0Mzc/cmVmSWQ9ZWU0ZjI2MzAtZDFmNC00YWRmLTg4YTUtMmI1OTliNTZlZWYwXHUwMDI2dHJhY2tpbmdJZD14RTU1Z09JdXB2Nm5rU1hVa0prRktBJTNEJTNEXHUwMDI2cG9zaXRpb249OFx1MDAyNnBhZ2VOdW09MFx1MDAyNnRyaz1wdWJsaWNfam9ic19qb2ItcmVzdWx0LWNhcmRfcmVzdWx0LWNhcmRfZnVsbC1jbGlja1x1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Marketing Cloud Technical Architect", "company_name": "600-SFDC Singapore", "location": "Singapore", "via": "via Workday", "description": "To get the best candidate experience, please consider applying for a maximum of 3 roles within 12 months to ensure you are not duplicating efforts.\n\nJob Category\nCustomer Success Group\n\nJob Details\n\nMC Technical Architect / Technical Consultant\n\nThe Salesforce Marketing Cloud is a leading global provider of cross-channel digital marketing solutions that empower organizations of all sizes to communicate with their customers through email, mobile, social media, web and marketing automation. We're driven by a deep understanding of marketers' needs - because we're marketers too. No other digital marketing company invests in product innovation the way we do, giving our clients access to truly cutting-edge technology.\nBeing the pioneers in cloud computing, we offer an even more superior experience to our customers and employees. By partnering state-of-the-art technology with the best and brightest employees in the industry, we foster a culture of constant innovation and growth.\n\nAbout the... position\nA Salesforce Marketing Cloud Technical Architect is a strategic position to our customers and within the Marketing Cloud Professional Services team. Serving as the technical subject matter experts within specific domains of the Salesforce Marketing Cloud applications, Heroku and internal tools, you must also be able to articulately consult to clients on them.\nWith a combination of technical knowledge around data, web & email development, scripting, API and/or integrations, you will be working in a project team on client facing engagements. Typically, on the the larger projects, you will be working alongside a Solution Architect (SA) to assist and validate on specific technical areas and overall solution. On smaller engagements, it is possible that you will need to deliver on your own (with a Project Manager) taking on a hybrid role. Therefore, it is important that you are comfortable in taking on the role as a consultative technical lead, which require good consultancy skills and good understanding in\ndigital marketing.\nYou will be consulted on technical solution options with its associated pros and cons under specific client circumstances, while being hands-on in building and testing end to end solutions on the overall digital marketing technology stack. You will guide on technical best practices and facilitate testing and deployment processes with client technical stakeholders during implementation.\n\nResponsibilities\n• Conduct technical requirements gathering, review, and architecture sessions\n• Document technical processes and run analysis between current and future states\n• Own delivery tasks from initial scoping, planning and requirements analysis, through to design, development, testing and deployment\n• Collaborate with other architects and team members to detail, design, document, understand and/or deliver specifically technical specifications and solutions\n• Clearly articulate and provide technical subject matter expertise to customers and project teams\n• Understand out-of-the-box Marketing Cloud functionality, and have the ability to leverage and tailor these based on customer requirements\n• Run workshops, develop and present options based on technology and feasibility trade-offs, and the choices that may be required in order to meet a customer’s objectives\n• Proactively identify and analyse issues / obstacles to determine and recommend appropriate courses of action\n• Deliver and execute on technical design solutions, customising where required, using Salesforce Marketing Cloud and other complementing Salesforce product offerings (eg. Sales, Service, Heroku, etc)\n• Help us refine and improve by identifying, creating, and enhancing internal processes and methodologies based on recurring customer feedback and evolving industry standards\n• Stay ahead of the curve with MarTech innovations, educate yourself and enable others on current and emerging technologies\n• Work collaborative and dynamically across multiple (1-3) engagements at a time\n• Scope, define and manage work packages and tasks.\n• Support documentation on initial solution design and evolve it to a final as- build technical specification.\n• Travel to client sites for onsite workshops and solutions presentations. Not expected to exceed 25%.\n\nRequirements\n• A positive “Can Do” and Customer Success-centric attitude\n• Customer facing technical consulting experience\n• Proven experience in implementing digital marketing technology solutions with other related systems (eg. CRM, Content Management, POS/Commerce, Web Analytics, etc)\n• Proficient with HTML, Javascript, CSS, SSJS, SQL, NodeJS (or similar)\n• Data analysis and database design experience with RDBMS such as MS SQL Server (preferable), MySQL, Postgres or Oracle\n• Experience working with APIs – SOAP and REST based APIs\n• Experience with both client and server side web development design languages, scripting tools, and protocols\n• Experience working with architecture & process flow visualization applications such as MS Visio, Lucid Chart or diagramming tools within Google Slides and PowerPoint\n• Familiarity with SDLC methodologies including requirements, design, implementation, testing and maintenance\n• Demonstrated ability to communicate ideas clearly and concisely\n• Excellent oral and written communication skills including technical documentation and the ability to conceptualise and communicate complex technical concepts to technical and non-technical audiences\n• Ability to scope, define and manage work packages. Support pre-sale qualification with solutions validation.\n• 5+ years hands-on software development and technical consulting experiences\n\nDesirable Experience / Skills\n• Previous Marketing Cloud technical consulting and implementation experience\n• Relevant Salesforce Certifications - Certified Salesforce Marketing Cloud Email Specialist, Certified Salesforce Marketing Cloud Consultant and Certified Salesforce Administrator\n• Experience with at least 2 programming languages such as .NET (C# or VB), JAVA, PHP, Ruby, C++, Visual Basic, Python\n• Experience working with 1 or more modern integrated development environments (i.e. MS Visual Studio, NetBeans, Eclipse or others)\n• Familiarity with security standards such as TLS, SSL, data encryption preferred\n• Familiarity with Agile project delivery methodology, ceremonies and tools\n• Additional language skills are highly desired - Thai, Vietnamese, Indonesian, Malay, Mandarin / Cantonese\n\nAbout Salesforce\nSalesforce is the global leader in customer relationship management (CRM) software. We pioneered the shift to cloud computing, and today we're delivering the next generation of social, mobile and cloud technologies that help companies revolutionize the way they sell, service, market and innovate-and become customer companies. We are the fastest growing of the top 10 enterprise software companies, the World's Most Innovative Company according to Forbes and one of Fortune's 100 Best Companies to Work For. Our \"more human, less corporate\" culture is built around doing work that matters, winning as a team and celebrating success\n\nAloha-style. Ready to find your #dreamjob?\n\nAccommodations - If you require assistance due to a disability applying for open positions please submit a request via this Accommodations Request Form.\n\nPosting Statement\n\nAt Salesforce we believe that the business of business is to improve the state of our world. Each of us has a responsibility to drive Equality in our communities and workplaces. We are committed to creating a workforce that reflects society through inclusive programs and initiatives such as equal pay, employee resource groups, inclusive benefits, and more. Learn more about Equality at Salesforce and explore our benefits.\n\nSalesforce.com and Salesforce.org are Equal Employment Opportunity and Affirmative Action Employers. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status. Salesforce.com and Salesforce.org do not accept unsolicited headhunter and agency resumes. Salesforce.com and Salesforce.org will not pay any third-party agency or company that does not have a signed agreement with Salesfore.com or Salesforce.org.\n\nSalesforce welcomes all", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJNYXJrZXRpbmcgQ2xvdWQgVGVjaG5pY2FsIEFyY2hpdGVjdCIsImNvbXBhbnlfbmFtZSI6IjYwMC1TRkRDIFNpbmdhcG9yZSIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiNTF0LXNvVHJ3QUMtRzVid0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBXb3JrZGF5IiwibGluayI6Imh0dHBzOi8vc2FsZXNmb3JjZS53ZDEubXl3b3JrZGF5am9icy5jb20vZW4tVVMvRXh0ZXJuYWxfQ2FyZWVyX1NpdGUvam9iL1NpbmdhcG9yZS0tLVNpbmdhcG9yZS9NYXJrZXRpbmctQ2xvdWQtVGVjaG5pY2FsLUFyY2hpdGVjdF9KUjc2NjM3P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Cloud Infrastructure Architect - (200001OK)", "company_name": "OCBC Bank (Singapore", "location": "Singapore (+1 other)", "via": "via Jobs | Fidanto", "description": "Cloud Infrastructure Architect - (200001OK) Posted 13 hours ago Cloud Infrastructure Architect - (200001OK)Job DescriptionAt OCBC, we do not just merely provide a working space. We create a culture that allows you to flourish. Across the Bank, our leaders encourage fresh ideas, reward continuous learning and most importantly, we care for not just you but also your family. We recognize your drive, passion and talent. We will bring out the best in you and empower you to excel. Fulfil your life goals and career ambitions with us. Here at Group Operations & Technology, we are on a digital transformation journey to push the boundaries of banking operations and technology, applications development and infrastructure by continuously challenging and improving the way we work. We want to make banking seamless for our customers by creating a culture focused on creating excellent customer and employee experience. Do come and join us today! We are seeking self-motivated, highly experienced, and... dedicated team players who are passionate about building digital infrastructure. The Cloud Infrastructure Architect will be working with an infrastructure modernization team to design and implement OCBC’s vision of a digital infrastructure. He will design OCBC’s multi-Cloud across on premise and hybrid cloud infrastructure, leveraging new technology stacks to support modern application and AI driven IT operations. Responsibilities Develop architectural standards and technical design of modern technology infrastructure stacks which include (not limited to) hybrid cloud, AIOps Define roadmap of new capabilities to deliver multi-Cloud strategy Set and maintain architectural standards, design documents, and governance framework Collaborate and work with the various stakeholder to develop technical solutions, plans and configuration for new technology infrastructure stacks Qualifications Possesses at least a Bachelor's Degree in Computer Science/Information Technology or equivalent Solid experience on large scale infrastructure private and public cloud design, build and migration projects Minimum 5 years hands-on-experience on designing and building both on premise and hybrid cloud infrastructure, AIOps, Infrastructure as Code, DevOps toolset At least 5 years of working experience in cloud technology such as VMWare Cloud Foundation, Microfocus Cloud Management Platform, AWS, Azure, GCP, Terraform, Ansible, Chef, Puppet, Openshift, Kafka, REDIS, etc Demonstrate strong knowledge in technology infrastructure domain such as virtual server technologies, networking, internet protocols, scripting & monitoring tools. Possess good technical knowledge in implementing, troubleshoot, performance tuning of hardware, operating system and system services. Possessing VCDX-CMA, AWS Architect Professional, Azure Solution Architect Expert and or Google’s Professional Cloud Architect certification will be an advantage. Strong analytical skill and creative in problem solving. Excellent command of written and spoken English. A good team player and able to work effectively at all levels of an organization with the ability to influence others to move towards consensus. Additional Information Senior Executive Qualification Bachelor's Degree, Post Graduate Diploma, Professional Degree The OCBC Bank group of businesses comprises a family of companies owned by Singapore’s longest-established local bank. OCBC Bank is the longest established Singapore bank, formed in 1932 from the merger of three local banks, the oldest of which was founded in 1912. Since the time of our founders, we have always understood the financial needs of our customers and developed financial solutions that meet their needs. To address increasingly diverse needs across different communities and geographies, OCBC Bank has expanded and acquired businesses beyond the realm of commercial banking. OCBC Bank has been ranked by Bloomberg Markets magazine as the World's Strongest Bank for two years, 2011 and 2012. Additional Company Information Registration No. 193200032W Company Size More than 5000 Employees Average Processing Time 30 days Benefits & Others Dental, Medical, Sports (e.g. Gym), Subject to designation, Subject to designation", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDbG91ZCBJbmZyYXN0cnVjdHVyZSBBcmNoaXRlY3QgLSAoMjAwMDAxT0spIiwiY29tcGFueV9uYW1lIjoiT0NCQyBCYW5rIChTaW5nYXBvcmUiLCJjb21wYW55X21pZCI6Ii9tLzA1NXIyNyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IkxnbkY3UkkxWnRrQ1I0MXpBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2Y0JDcmNCUVU1VlgwNXhVMEUwUVZwR1dYQjBkbWwwWlY5UU5reGtSakYzYzNkbFVXUXhhak5aTVhsMlVsZFpPRGN3UjB4d05IVmtNWFJHY2pCNmQwRnljbUp2U3pKclowTmZlVVJZVmpZeFZtNVlibDlsVkhCUU9YQmxXaTFRTWpkTFYzWldVMGhDYTJsYVRsaFRkelJVZUZkcmRETnlUV1Z2TTJsblQwOTZaalp2YW1aSE9WaFlXakk0YzNaRmJVWkpVemRNUm05NmRUUnBZM1pzT0ROaWJFcHpWWFJvZVRabFoyaDZVVE5DVkUweFQwWlhia3d4U3pSakVoZHZXRFpEV1V4eGFrWXRjWGMxVG05UWExcHhUMmRCY3hvaVFVOU5XVkozUWxaVGNrUkJlWE5XTmtjMFppMDFSemhZWWpoVVZVd3hNMWx0ZHciLCJmY3YiOiIzIiwiZmNfaWQiOiJmY182OSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIHwgRmlkYW50byIsImxpbmsiOiJodHRwczovL3NnLmZpZGFudG8uY29tL2pvYnMvam9iLW9wZW5pbmcvZW5naW5lZXJzLWFsbC1vdGhlci9jbG91ZC1pbmZyYXN0cnVjdHVyZS1hcmNoaXRlY3QtMjAwMDAxb2stMjc1NTE1OTM4P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}], "chips": [{"type": "Title", "param": "job_family_1", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Solution architect", "value": "solution architect"}, {"text": "Solutions architect", "value": "solutions architect"}, {"text": "Architect", "value": "architect"}, {"text": "Cloud architect", "value": "cloud architect"}, {"text": "Technical architect", "value": "technical architect"}, {"text": "Enterprise architect", "value": "enterprise architect"}, {"text": "Manager", "value": "manager"}, {"text": "Senior", "value": "senior"}, {"text": "Consultant", "value": "consultant"}, {"text": "Financial services", "value": "financial services"}, {"text": "Infrastructure architect", "value": "infrastructure architect"}, {"text": "Application architect", "value": "application architect"}, {"text": "Cloud engineer", "value": "cloud engineer"}, {"text": "It architect", "value": "it architect"}, {"text": "Lead architect", "value": "lead architect"}, {"text": "Network architect", "value": "network architect"}, {"text": "Security architect", "value": "security architect"}, {"text": "Senior architect", "value": "senior architect"}, {"text": "Systems engineer", "value": "systems engineer"}, {"text": "Associate director", "value": "associate director"}, {"text": "Deputy", "value": "deputy"}, {"text": "Engineers", "value": "engineers"}, {"text": "Head", "value": "head"}, {"text": "Infrastructure", "value": "infrastructure"}, {"text": "Lab", "value": "lab"}, {"text": "Network engineer", "value": "network engineer"}, {"text": "Presales consultant", "value": "presales consultant"}, {"text": "Public sector", "value": "public sector"}, {"text": "Senior analyst", "value": "senior analyst"}, {"text": "Senior consultant", "value": "senior consultant"}, {"text": "Senior director", "value": "senior director"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Software architect", "value": "software architect"}, {"text": "Solution consultant", "value": "solution consultant"}, {"text": "System administrator", "value": "system administrator"}, {"text": "System architect", "value": "system architect"}, {"text": "System engineer", "value": "system engineer"}, {"text": "Systems analyst", "value": "systems analyst"}, {"text": "Systems architect", "value": "systems architect"}, {"text": "Technical trainer", "value": "technical trainer"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Accounting", "value": "/business/naics2007/5412"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Management", "value": "/business/naics2007/55"}, {"text": "Real Estate", "value": "/business/naics2007/53"}, {"text": "Wholesale", "value": "/business/naics2007/42"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Amazon", "value": "/m/0mgkg"}, {"text": "Microsoft", "value": "/m/04sv4"}, {"text": "EPAM Systems", "value": "/m/0dlnrc"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "IBM", "value": "/m/03sc8"}, {"text": "Salesforce", "value": "/m/07btr5"}, {"text": "EY", "value": "/m/0g9jc"}, {"text": "Publicis Sapient", "value": "/m/02myjp"}, {"text": "Randstad", "value": "/m/08pt1z"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Alibaba Group Holding Limited", "value": "/m/07s6ctl"}, {"text": "Avanade", "value": "/m/094456"}, {"text": "Capgemini", "value": "/m/03vlk0"}, {"text": "Comtel Solutions Pte Ltd", "value": "/g/11dxpztgnb"}, {"text": "DELL", "value": "/g/11c54ch2jm"}, {"text": "Ericsson", "value": "/m/02kyh"}, {"text": "HTZ Resources", "value": "/g/11h21p9b4d"}, {"text": "Infinite Computer Solutions Pte Ltd", "value": "/g/11g9mj72yz"}, {"text": "Michael Page", "value": "/m/04cxldw"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "Orange Business Services", "value": "/m/08zvyz"}, {"text": "Recruitment Hub Asia Pte Ltd", "value": "/g/11dxpww_0f"}, {"text": "TEKsystems (Allegis Group Singapore Pte Ltd)", "value": "/g/11b6g4bkv0"}, {"text": "Talent Trader Group Pte Ltd", "value": "/g/11dxpmlc5b"}, {"text": "Tata Consultancy Services", "value": "/m/01psx8"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "Verizon", "value": "/m/07_dn"}, {"text": "A-Speed Infotech Pte Ltd", "value": "/g/11g9mxswl4"}, {"text": "ABeam Consulting", "value": "/g/11bc6whr_f"}, {"text": "Amazon Web Services (AWS)", "value": "/g/11dxprr2xv"}, {"text": "Amazon Web Services Singapore", "value": "/m/0rznzt1"}, {"text": "Aon", "value": "/m/0z7n"}, {"text": "Avaya", "value": "/m/01sqlk"}, {"text": "Azendian Solutions Pte Ltd", "value": "/g/11dxpvcjj2"}, {"text": "Big Cloud", "value": "/g/11c743lwsr"}]}]}