{"search_metadata": {"id": "608278dc17f9235151be2997", "status": "Success", "json_endpoint": "https://serpapi.com/searches/88f6b1652649b2cf/608278dc17f9235151be2997.json", "created_at": "2021-04-23 07:35:56 UTC", "processed_at": "2021-04-23 07:35:56 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28system+analyst%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=10", "raw_html_file": "https://serpapi.com/searches/88f6b1652649b2cf/608278dc17f9235151be2997.html", "total_time_taken": 3.98}, "search_parameters": {"q": "(system analyst) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "10"}, "jobs_results": [{"title": "Senior Business Systems Analyst", "company_name": "Xilinx Careers", "location": "Singapore", "via": "via Xilinx - Careers", "description": "Description\n\nAt Xilinx, we are leading the industry transformation to build an adaptable, intelligent world. ARE YOU bold, collaborative, and creative? We develop leaders and innovators who want to revolutionize the world of technology. We believe that by embracing diverse ideas, pushing boundaries, and working together as ONEXILINX, anything is possible.\n\nOur culture of innovation began with the invention of the Field Programmable Gate Array (FPGA), and with the 2018 introduction of our Adaptive Compute Acceleration Platform (ACAP), has made a quantum leap in capability, solidifying our role as the adaptable platform supplier of choice. From the beginning, we have always believed in providing inventors with products and platforms that are infinitely adaptable. From self-driving cars, to world-record genome processing, to AI and big data, to the world's first 5G networks, we empower the world's builders and visionaries whose ideas solve every day problems and improve people's... lives.\n\nIf you are PASSIONATE, ADAPTABLE, and INNOVATIVE, Xilinx is the right place for you! At Xilinx, we care deeply about creating significant development experiences while building a strong sense of belonging and connection. We champion an environment of empowered learning, wellness, community engagement, and recognition, so you can focus on work that matters - world class technology that improves the way we live and work. We are ONEXILINX.\n\nFinance BI & Reporting Analyst\n\nJob description\n\nThe Finance BI & Reporting Analyst will provide both functional support (business process and systems analysis, testing, user support and training) and light technical support (report and dashboard development, maintenance of Tableau views and hierarchies) to the Finance organization from Business Intelligence & Data Analytics perspective. As a key member of our Finance Infrastructure Team the Finance BI & Reporting Analyst will be a first point of contact for Finance BI report troubleshooting and development in our new Snowflake DW solution.\n\nPrimary responsibilities\n• The Finance BI & Reporting Analyst will work closely with key stakeholders across Finance and IT to deliver reporting and analytics capabilities that support our efforts to increase process efficiencies.\n• Responsibilities include business analysis, requirements gathering, output and format evaluation, report creation and automation.\n• In addition to helping to build new reports and automating existing manual and/or duplicate reports, the Finance BI & Reporting Analyst will provide ongoing user support to the Finance organization, including reporting tools training and troubleshooting of BI reporting issues.\n• Individuals will also be responsible for analyzing complex data models and building reports to generate business insights and satisfy evolving management requirements.\n\nDesired skills and experience\n• 3-5 years experience applying analytical techniques to solve real business problems\n• Advanced Tableau skills are a must (preferably with Tableau certification) experience working with Snowflake or other cloud-based data sources is very desirable\n• Ability to retrieve, manipulate, and analyze large datasets\n• Strong interpersonal skills; must be able to effectively work with Finance and IT users and be able to drive projects and reporting improvements\n• Excellent presentation, communication and social skills, with solid attention to detail\n• Ability to comprehensively understand data elements, sources and relationships in business and technical terms\n• Bachelor’s degree preferably in a quantitative field (finance/accounting/statistics/engineering", "extensions": ["8 days ago", "Full–time"], "detected_extensions": {"posted_at": "8 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQnVzaW5lc3MgU3lzdGVtcyBBbmFseXN0IiwiY29tcGFueV9uYW1lIjoiWGlsaW54IENhcmVlcnMiLCJjb21wYW55X21pZCI6Ii9tLzAzZHdrYyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImgwV2FTU0lHbUZuRlcwZWlBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhVVk4zZVdOMlJ6UkdZMWRSWDNBMk9FVjRkMDFLVkY5UGJqRnJPWGRMVlhoeFNVTXhZa3QzY0d4MFFpMHlXRXRPVlVOa1UyMUNjREUwVTBwVk9FMTNPVWhZTVdOaGRXUkllRVp2UXpsRE5sWkZRbW94VGtsSFFYRjFXV1YxWHpZMU9WVnJia3hhUVVNNGR6SlBabWROZEdKbmJrMXVia3hVV1U0dGFVdEJWbXBzV2pGTWEwZHRNVU42UmpCS09FUk9SemRyTlV0M2IxRldSMk5SRWhZelNHbERXVTlsTlU1dk4wbHpVVmM1Y1hGSGIwUlJHaUpCVDAxWlVuZEJTRU53VjFsVE1VbEtlbkJHU3pGa1NETXdTRXN5TTFaaVpGZEIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY183IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFhpbGlueCAtIENhcmVlcnMiLCJsaW5rIjoiaHR0cHM6Ly9jYXJlZXJzLnhpbGlueC5jb20vam9icy82NDE5MTAyLXNlbmlvci1idXNpbmVzcy1zeXN0ZW1zLWFuYWx5c3Q/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Senior IT Business Systems Analyst", "company_name": "Medtronic", "location": "Singapore", "via": "via Bayt.com", "description": "Careers That Change Lives\n\nMedtronic Singapore Operations was among the first international medical technology firms to set up manufacturing operations in Singapore. We are one of the most advanced medical device manufacturing sites and the first manufacturing facility of its kind in the region to make implantable cardiac leads, pacemakers and monitors.\n\nOur Purpose\n\nFounded in 1949, our Mission continues to serve as our ethical framework and inspirational goal for our employees around the world. It guides our day-to-day work and reminds us that our efforts are transforming the lives of millions of people each year. If you have a passion for medical device manufacturing, this opportunity could be for you!\n\nA Day in the Life\n\nAs a Senior IT Business Systems Analyst, you are responsible to supports manufacturing applications and related interfaces, such as FactoryWorks, SPACE, StARS, Loftware, Transform, etc.\n\nResponsibilities may include the following and other duties may be... assigned.\n• Consults with business stakeholders to understand and evaluate current business processes and identify complex business problems and needs turning those needs into system requirements.\n• Provides technical expertise for system functional specifications and deploys new and current systems, processes and procedures in a cost-effective manner.\n• May configure system settings and options; plan and execute unit, system, and integration testing to meet business requirements.\n• May lead cross-functional linked teams to address business or systems issues.\n• Support existing applications and interfaces by diagnosing and fixing problems using general skills and a knowledge of standard Medtronic configurations.\n• Provide application technical support to MES, developers, infrastructure and project leaders.\n• Provide solutions to a variety of technical problems of moderate scope and complexity.\n• Provides training to production floor personnel in the proper operation of the MES.\n• Provides leadership and assistance in MES upgrades which includes system testing, documentation changes, and hyper-care support of new MES releases.\n• Collaborates with operators, engineers, and IT personnel in troubleshooting issues between the MES and ERP systems\n• Install, test and document new software products and recommends their adoption as standards.\n• Build the knowledge bank of support documents for each application and related interfaces.\n• Provides technical assistance in identifying, evaluating, and developing systems and procedures, which are cost effective and meet user requirements.\n• Configures system settings and options; plans and executes unit, integration, and acceptance testing; and creates specifications for systems to meet business requirements.\n• Develop solutions to routine problems of limited scope and complexity following established policies and procedures.\n• Work with department leaders in the designs of automated systems.\n• Ensure proper validation documentation is created for all projects (i.e. Medtronic System Validation Methodology (MSCM).\n• Ensure that Medtronic's systems and the information on them are protected in accordance with Medtronic's Information Protection Policies and Standards, as well as best Information Protection practices\n• Perform other related duties as assigned, to ensure workload coverage within IT department and to fulfill business objective. Follow any other job-related instructions and to perform any other job-related duties requested by respective superior\n• Provide 24x7 support to MSO manufacturing operation\n\nMust Have: Minimum Requirements\n• Minimum of 4 years of relevant experience, or advanced degree with a minimum of 2 years relevant experience\n• BSc in Information Management, Computer Sciences, or equivalent with working experience in a manufacturing environment. A previous experience in the medtech / pharma industry is a plus\n\nNice to Have\n• >5 years of progressive experience as a Business/System Analyst or similar role\n• Knowledge of manufacturing process and related applications\n• Able to mentor junior Business/System Analyst on manufacturing solutions\n• Experience to drive mid-scale projects\n• Good understanding of compliance requirements and experience validating electronic systems in an FDA-regulated environment\n•", "extensions": ["4 days ago", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgSVQgQnVzaW5lc3MgU3lzdGVtcyBBbmFseXN0IiwiY29tcGFueV9uYW1lIjoiTWVkdHJvbmljIiwiY29tcGFueV9taWQiOiIvbS8wM3o0ajMiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJKYUNLaXpJaXFQRjZwTWRqQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VkRSaVJtbFFkVGR1UmpFeFRrTjJka1kwVlV3eGVVSnJaV2RuWVhKWVUxcFhlVU52TTFWTFZHZDVXSGQ0Ulc5VlUwaDVSazlTU0dsdVNtbHBjRmR5Y2t4UVdESTNYemRCVFdsamQxSnlieTFyVUhGWWJGRlFTMDh6Y0VkalluWmtlV2haY2tGdWNHaEVZV3BGYjJRd1pqWlhRV05VTWpSRFkxWTRSbVpyVkZnMmMyaEhZMDlxV2w5U1NubHVSSGRNVVd0NU1rdGtZblZQZEVKQkVoWXpTR2xEV1U5bE5VNXZOMGx6VVZjNWNYRkhiMFJSR2lKQlQwMVpVbmREV1VVMVoyeG9SbXREZW5WSWFEZDBNMGcxZGxGV1UyWXpVRTFCIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMTUiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQmF5dC5jb20iLCJsaW5rIjoiaHR0cHM6Ly93d3cuYmF5dC5jb20vZW4vc2luZ2Fwb3JlL2pvYnMvc2VuaW9yLWl0LWJ1c2luZXNzLXN5c3RlbXMtYW5hbHlzdC01OTUzNjU4OC8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "HRIS Analyst", "company_name": "Oracle", "location": "Singapore", "via": "via Jobs", "description": "Job Description Preferred Qualifications Job Title: HR Services Analyst 2 Reports To: Manager, JAPAC Global HR ServicesOracle’s HR Services team strives to create and deliver a seamless and positive employee experience across the entire employee lifecycle. Leading with care and empathy, we develop efficient and simple processes, systems, policies, and programs. We deliver data that is useful and accurate to create people-related strategies across the business. We manage people data and build project management capability across HR. Our work also ensures Oracle remains protected and compliant. We strive to provide employees the resources and support they need during the most important moments in their careers. Job Summary: This role will be responsible for processing and handling complex, confidential, and time sensitive human resources related data. It will also be looking for problem trends, and seek opportunities for process improvement. Additionally, will need to collaborate across... multiple business functions, as well as globally to ensure team success. Other primary responsibilities will include data analysis, project management, and customer service. There will also be an opportunity to work and collaborate globally, standardizing, simplifying and automating HR operational processes and services. Essential Duties of the Position Work as a key member in JAPAC HR Services. Work with other regional process counterparts, partners, stakeholders, Country HRs, Business HRs, HR Privacy & Security, and Audit teams. Handle minimum two processes of employee lifecycle for 19 countries in JAPAC. Be the first point of contact for Oracle Employees pertaining to operations support, including but not limited to pre/onboarding, employment letters, personal and employment data changes in Oracle HCM, exit pack, HR systems and tools. Analyze data on given processes to produce trends and identify / plan improvement areas. Support in implementing process efficiencies and improvements. Identify and promote best practices. Contribute or lead projects that will improve customer experience, processes and systems in the global HR Organization by partnering with cross regional and functional teams. Act as Process Owner and Queue manager for assigned processes. Handle requests in Oracle Service Cloud ticketing system and meet the Service Level Agreement. • Respond accurately, professionally, and timely to all requests.• Ensure knowledge has been captured, organized, and shared timely.• Build and maintain effective relationships with stakeholders.• Make improvements and adjustments to optimize operational excellence and customer experience. Ensure data privacy and Oracle data standards. Partner with management and key stakeholders to process complex, confidential, time sensitive data Make recommendations, participate in UAT testing, implement systems and process improvements Contribute independently on a variety of processes, with some assistance and normally receive general instructions on routine work Work on problems of moderate scope where analysis of situations require a review of a variety of factors Exercise judgment within defined procedures and practices to determine appropriate action Develop professional expertise, and apply company policies and procedures to resolve a variety of issues Assist others using your own expertise Perform additional related tasks and duties as needed Key Values Integrity Mutual respect Teamwork Communication Innovation Customer satisfaction Quality Fairness Compliance Ethics Job Requirements: Process improvement, training, communication and project management skills Excellent problem solving, critical thinking, and analytical skills Comfortable with full Microsoft office suite, HCM, and other Oracle Cloud applications High attention to detail and the patience to pursue data anomalies Strong internal client facing skills with a flexible communication style and the ability to communicate complex concepts and analytics in a structured manner Passionate about trouble shooting data issues to identify strategic solutions Believe that no jobs are too big; no problems are too complex Communicate effectively – directly and succinctly – across cubicles, organizational boundaries and cultures Volunteer for new experiences, learning opportunities and to help others Contribute and may lead process improvement ideas and innovation At least 3+ years of experience working in a data intensive environment, preferably in human resources, where data entry, record auditing and report generation are primary functions of your role Bachelor’s degree or equivalent practical experience Preferred Qualifications: Experience using Oracle HCM, HRMS, RightNow, Confluence, and Jira. Lean Six Sigma knowledge CAPM or other project management certification Detailed Description and Job Requirements Acts as interface between business and IT organization with regards to HRMS implementation.Supports users in the report generation process. Works closely with the Business HR to ensure all reports in (via HRMS) including SQL queries (both ad hoc and maintenance reports) are accurate. Process Mass Change Spreadsheets. Ensures data integrity in Oracle HRMS database by running regular audits. Conducts high-level HRMS needs analysis, prepares business specifications, implements modifications and enhancements and ensures system documentation are updated. Assists with the development and delivery of HRMS training to users. Provides systems support for HR applications, including Oracle Core HRMS, HR Self Service Applications, Discoverer Reports, etc. Participates in User Acceptance Tests. Undertakes special projects on an as need basis to address specific HRMS issues.Duties and tasks are standard with some variation. Completes own role largely independently within defined policies and procedures. Strong knowledge of Oracle applications, HRMS functionality, set-up tables, table structures, PL/SQL, and Microsoft applications such as Excel. 2 to 3 years Oracle Applications experience. Problem solving skills and strong analytical skills. Good oral and written communication skills. Ability to manage vast amount of data efficiently. Typical experience 2-5 years. Job :Human Resources", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJIUklTIEFuYWx5c3QiLCJjb21wYW55X25hbWUiOiJPcmFjbGUiLCJjb21wYW55X21pZCI6Ii9tLzA1bmp3IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiR01uM3lEVWdmNGY0bnlQNkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXNzQkNvd0JRVTVWWDA1eFZIbElNa2RDTjJKa2RIUnlURGxHVDJveFZESkNTRlJ5TXpJek0ycDVSRE5qUjNSaU1qazRjMXBDYm1aS1IwZHJabGszTkZCV2FFZ3dlRFZRVVRCM09UVXhTR0pWWTFkeWNXNWpkbEpSYzFZNVF6TTVRMWhSWVZKaGJVNVRZV1ZMVlRoUk5YUlpVWEpmTTJSa2IwRnJORTk1YzJ4Wk1GUmZURU5uUVU1a1pWbFFOMEZsYVhFU0ZqTklhVU5aVDJVMVRtODNTWE5SVnpseGNVZHZSRkVhSWtGUFRWbFNkMEptUldwQ1VreHZNR2Q1VUVneWFISnhRVEZwYlROSlozUnJOMUUiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18yMiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIiwibGluayI6Imh0dHBzOi8vc2cuZmlkYW50by5jb20vam9icy9qb2Itb3BlbmluZy9jb21wdXRlci1zeXN0ZW1zLWFuYWx5c3RzL2hyaXMtYW5hbHlzdC0yNzc4ODIxNzA/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Aldon system Analyst", "company_name": "AccionLabs", "location": "Singapore", "via": "via SmartRecruiters Jobs", "description": "Company Description\n\nAccion Labs is a global technology services firm with offering a full range of product life-cycle services in the emerging technology segment. This includes Web 2.0, Open Source, SaaS/Cloud, Mobility, IT Operations Management/ITSM, Big Data and traditional BI/DW.\n\nThrough nine global offices and a rapid-response delivery model, Accion offers a range of engagement models such as turn-key projects, extended-teams, shared-IP development, offshore-leveraged engagements and professional staffing (contract, contract-to-hire & direct perm).\n\nAccion Labs is privately-held, venture-funded and has a hands-on management team that believes in execution and outcome.\n\nJob Description\n\nGreeting from AccionLabs...!!!!\n\nWhy AccionLabs?\n\n• AccionLabs has been listed in the Top 20 Big Data Service Providers by CIO Review Magazine\n\n• Fastest growing technology services firm in Pittsburgh & APAC regions\n\n• Direct client requirements.\n\nRole: Aldon system Analyst\n\nJob Description\n\n•... Bachelor’s degree in computer science/engineering.\n\n• Hands on experience in ALDON and technically proficient.\n\n• Experience in SilverLake banking system, preference is RBK/GTD.\n\n• Experience in AS400/iSeries database and operation system for at least 5 years.\n\n• Experience in system architecture and design.\n\n• Requires superior analytics and problem-solving skills. Must be attentive to details.\n\n• Ability to work in a fast-paced, team-oriented environment.\n\nGood to have :-\n\n• Microsoft Certified Professional (MCP)/Microsoft Certified Technology Specialist (MCTS)\n\n• Broad knowledge of hardware, software and programming;\n\nThanks & Regards\n\nRajitha Reddy Jagapati|Team Lead\n\nin.linkedin.com/in/rajithaj/;http://www.accionlabs.com\n\nDriving Outcomes Through Actions!\n\n------------------------------------------------------------------------------------------\n\nPittsburgh | Atlanta | Santa Clara| Bangalore |Mumbai| Singapore | Malaysia | London | Chicago\n\nAdditional Information\n\nAll your information will be kept confidential according to EEO guidelines", "extensions": ["Over 1 month ago", "Contractor"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Contractor"}, "job_id": "eyJqb2JfdGl0bGUiOiJBbGRvbiBzeXN0ZW0gQW5hbHlzdCIsImNvbXBhbnlfbmFtZSI6IkFjY2lvbkxhYnMiLCJjb21wYW55X21pZCI6Ii9nLzExZHhwcW0xNnYiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJaS0I4UExqeDdTZ0hLQ3NkQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VWtZdE9HSnpNbWRSTkRoNlUzbE1TVWsxTUhsb1ZFcHhTelpCUTBkT1oyVk5iazQyZEdaWmFVUmpjWGt0Tm00M2VIUlVabW93WlVaeU1qSm9SakJyVGpCM2IwaHJaVWRQYm10cmVVaGZSbXRYYTB0U1RtRnFkSEo0YkZBemVXcGpUMUpHZEd0alpsTTNOR2RNZGpSamJsWm5WVEZ6UzNONk1rUmlRWGhpY1V4blNYTjJZekZPV0Zrd1FXdzRURXRJVm5sUllrSmxhRmhKVmpobkVoWXpTR2xEV1U5bE5VNXZOMGx6VVZjNWNYRkhiMFJSR2lKQlQwMVpVbmRCTVZadlZHTkxja1JHV1VsdGR6QnpUMTlhVVRSb1FrWjJRM0ZCIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMjkiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gU21hcnRSZWNydWl0ZXJzIEpvYnMiLCJsaW5rIjoiaHR0cHM6Ly9qb2JzLnNtYXJ0cmVjcnVpdGVycy5jb20vQWNjaW9uTGFiczIvOTIzMDQ4MDctYWxkb24tc3lzdGVtLWFuYWx5c3Q/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Senior / System Analyst ( PEGA)", "company_name": "BGC Group", "location": "Singapore", "via": "via BGC Group", "description": "Job Responsibilities:\n• Perform system analysis, design and testing according to the project goal and needs\n• Gather requirements from users, designing,\n• implementing, maintaining application systems and project management.\n• Deploy, maintain, and troubleshoot core business applications, including application servers, associated hardware, endpoints, and databases\n• Meet and coordinate with internal and external stakeholders to establish project scope, system goals, and requirements\n• Develop, analyze, prioritize, and organize requirement specifications, data mapping, diagrams, and flowcharts for developers and testers to follow\n• Translate highly technical specifications into clear non-technical requirements\n\nRequirements:\n\nThe candidate must have the following requirements:\n• At least 2 years of working experience: Relational Databases: DB2 & MS SQL Server\n• At least 4 years’ in-depth hands on application development experience in Pega PRPC and Pega frameworks.\n\nPreferred:\n• Java... JavaScript, HTML/ CSS, Web Services (REST and/or SOAP).\n• PEGA PRPC configuration, installation, external systems interface and database integration.\n• PEGA PRPC Production BAU Support.\n• Pega PRPC CSA/CSSA/CLSA certification will be an added advantage.\n\nWorking Location:\n• Jurong/ Newton\n\nBenefits:\n• Basic range up to $ 7800\n• 18 Days Annual Leave\n• 14 Medical Leaves\n• Medical Benefits\n• AWS\n• Yearly Increment", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgLyBTeXN0ZW0gQW5hbHlzdCAoIFBFR0EpIiwiY29tcGFueV9uYW1lIjoiQkdDIEdyb3VwIiwiY29tcGFueV9taWQiOiIvZy8xMWcwajNmanY4IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiZjJQZkM1cUNVeFpib1F4cEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFVVeGxOVnA1WDJjM1RrSnJTWFp1YUhkNk4yUmFZMDVTWm5vMlMyOXhkRFJMVEhFNVIybHhSMmxMYlZBME5WWmpOVTlKYmxWbFFVUkNNRTExVVdVeFZFeDZaa1Z0VDNSclVteEhTMDU1UzJ3eVJVSk9NelZpVGtSNmJtUjJNSGxqVGw5SWRrVkpWa052UzBKTFJ6bHRRM2N0TjJ4QlpITlZkR0ZJZW1GWk4zSXRTbVJRTlZadE4yOWtRa0ZqY1ZGNldsOVVSVE4xUlZrelR6UjNFaFl6U0dsRFdVOWxOVTV2TjBselVWYzVjWEZIYjBSUkdpSkJUMDFaVW5kRU1YaGhaVzk2UTBwVVVsQkxhRWRSVEdGWWRqUmxYM1pQUmxwUiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzM1IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJHQyBHcm91cCIsImxpbmsiOiJodHRwczovL3d3dy5iZ2MtZ3JvdXAuY29tL2pvYi9zZW5pb3Itc2xhc2gtc3lzdGVtLWFuYWx5c3QtcGVnYT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior Business Analyst", "company_name": "Activate Interactive Pte Ltd", "location": "Singapore (+1 other)", "via": "via Workable For Job Seekers", "description": "Activate Interactive Pte Ltd (“Activate”) is a leading IT solution and service provider headquartered in Singapore with a presence in Malaysia and Indonesia. The homegrown company was founded in 1997 with the mission of positively impacting the lives of people around us and the environment we live in through the use of technology.\n\nWe offer quality, cost-effective and impactful IT solutions and services, including mobile and web applications and cloud technology. Over the years, we have helped government agencies and enterprises remove technology roadblocks and increase their business efficiency to better serve the communities.\n\nTo amplify our efforts in improving people’s lives, Activate also develops preventive healthcare solutions that serve to increase health awareness and improve population health.\n\nWe believe that the success of a company relies on the strengths of our employees. At Activate, we are committed to provide a conducive environment and develop our employees to... realise their full potential.\n\nFrom a three-person outfit, Activate has grown into a team of more than 150 employees, delivering more than 150 solutions and services to help our clients achieve growth and success.\n\nWe have opportunities for you to grow your career path and are looking for talented professionals to join our team.\n\nJob Description\n\nThe Business Analyst/Senior Business Analyst is the main liaison between the business and IT in translating business needs into system solutions. The candidate is required to conduct research on client’s business needs, processes, requirements and its traceability. Develop and communicate effective system solutions.\n\nThe person should possess an analytical mind and is able to see interconnections in system solutions and usability. Also should adopt a systematic approach in addressing complex issues with good judgement and arrive at effective solutions.\n• Bachelor’s degree in Computer-related discipline or equivalent\n• Minimum 8 years of IT experience\n• Minimum 6 years of IT Business Analysis experience\n• Minimum 2 years working in Agile development projects experience\n• Certified Business Analyst (CBA) certification will be an added advantage\n• Experience in developing Agile and/or UML requirements artifacts is mandatory\n• Preference will be given to candidate with the following skillset,\n• Liaise with stakeholders to identify business needs\n• Review existing business processes to identify opportunities\n• Prepare business cases defining potential benefits, solutions to increase efficiencies of business processes and associated risks\n• Propose alternative solutions to streamline business processes\n• Establish requirements for the implementation of changes in the business processes\n• Conduct in-depth analysis of the business requirements specification and feasibility studies\n• Translate business requirements and user needs into functional specifications\n• Collaborate with developers to ensure requirements are incorporated into system design\n• Guide the team to gather and document existing system specifications\n• Function as the liaison between users and technical staff throughout the solution implementation cycle\n• Supervise User Acceptance Testing when needed\n• Supervise technical documentation and training materials\n• Manage user training to facilitate adoption of new systems features\n• Act as a point of contact for users regarding complex queries\n• Scope out statement of works setting clear expectations of deliverable and exclusions\n\nCommunication: Convey and exchange thoughts, ideas and information effectively through different mediums\n\nBusiness Needs Analysis: Identify and scope business requirements and priorities through information gathering and analysis as well as clarification of the solutions, initiatives and programme to enable effective delivery.\n\nStakeholder Management: Manage stakeholder expectations and needs by aligning those with requirements and objectives of the organisation. This involves planning of actions to effectively communicate with, negotiate with and influence stakeholders\n\nSense Making: Organise and analyse data and information accurately to identify relationships and detect patterns and trends to gain insights for decision-making\n\nBusiness Innovation: Identify and evaluate digitisation and innovative business opportunities provided by new advancements in information and communication technology to establish new services or businesses to bridge the physical and digital worlds\n\nEmerging Technology Synthesis: Monitor and integrate emerging technology trends and developments, structured data gathering for the identification of new and emerging technological products, services and techniques\n\nFun working culture, medical insurance, flexi benefits\n\nIf you love the idea of being part of a growing company with exciting prospects in mobile and web technologies that create positive impact on people’s lives, then we would love to hear from you", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQnVzaW5lc3MgQW5hbHlzdCIsImNvbXBhbnlfbmFtZSI6IkFjdGl2YXRlIEludGVyYWN0aXZlIFB0ZSBMdGQiLCJjb21wYW55X21pZCI6Ii9nLzExZHhxMTkybDUiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJnSS14SWFLVE5JdjlFWGgwQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFb3NDQ3N3QlFVNVZYMDV4VkVGelpubDVOemhwU1ZCR1RGVTNTREZRYzFOVFpGbENiRTlMTnpBeGVYWkJMWFpFTmtaSWFVZE9Ra05QTTNFMVdqRnRkVUpMVG1ZdE1qbEZaRFJZYW1vM1RXbzBNekIwTUZKZmJsaE1jSFpzZEdwd1ZXMURNMWxoVUhWV04xUkNMV0k0UW1WbVpsbHVlVlpaWlRGNlltSnFNMVZHT1hkb1ltUTNVbGRUY2tZMlQxaG1OV2hUVEdOelVEWlJaREZqUkd4M2RYRnFYek5DTjJoRmNIa3pka0Z5V0ZoSlZVWTNibTFIY1RJMlowOVJZVVZ4V1hsZlkxVnVjV1ZrU1dZdGJtWm5hbmxWRWhZelNHbERXVTlsTlU1dk4wbHpVVmM1Y1hGSGIwUlJHaUpCVDAxWlVuZENRek14Uldkd1NVUlVZbWhsUTB4NGNGTkZiRmhtT0UxcFNGOTMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY180MiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBXb3JrYWJsZSBGb3IgSm9iIFNlZWtlcnMiLCJsaW5rIjoiaHR0cHM6Ly9hcHBseS53b3JrYWJsZS5jb20vYWN0aXZhdGUtaW50ZXJhY3RpdmUtcHRlLWx0ZC9qL0ZFQTk5QzA2RTQvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Senior Business Systems Analyst", "company_name": "Rakuten Asia", "location": "Singapore", "via": "via Laimoon.com", "description": "SUMMARY:\n\nThe Senior Business Systems Analyst/PM will understand ‘as-is’ end-to-end business/process cycles, possess the ability to act effectively at various levels of detail, work constructively with cross-functional teams and senior management, facilitate problem-solving and decision-making and be actively involved in multiple project activities, such as owning project plans and requirements elicitation.\n\nThis person will act as an internal consultant to global HR stakeholders and be part of a team of Workday specialists that sit in Human Resource Information Services Group and closely partners with Information Technology and Human Resource peer groups. You will be expected to closely collaborate with teammates across the globe and ensure we are maximizing our Workday investment.\n\nRESPONSIBILITIES:\n\n1. Research and Document Existing End-to End Business Systems/Processes\n• Reviewing how the organizational structure works and what elements impact business performance and... development\n• Explore the current state of the business system and create/document an “as is” model , without paying attention to any changes and improvements\n• Understand end-to-end HR processes and identify/communicate critical dependencies\n\n2. Identify Improvement Opportunities\n• By using the as-is model, identify what gaps need to be removed and then map out a “to-be” model that can help change the current state for the better (desired) situation\n• Leverage use cases and user stories to reflect the user experience\n• Document and socialize all “to-be” process maps\n• Assess benefits to be derived from systems improvements and quantify impact to business units\n• Consider operational impacts of all changes to “to-be” processes\n\n3. Document Business/System Requirements\n• Capture, evaluate, prioritize and understand business needs and translate them into business process and system requirements\n• Evaluate information gathered from multiple sources and reconcile conflicts\n• Communicate complex processes, problems, and solutions in a simple, compelling, accurate, and highly visual manner\n\n4. Manage Projects\n• Work to manage key components of regional and global projects—includes defining tasks, managing work, and being accountable for the deliverables of assigned components\n• Use independent judgement to determine appropriate escalation and resolution of issues within program structure\n• Work with all levels of management to critically evaluate and communicate business issues risks with conviction to campus clients and team members\n• Meet project deadlines to full completion\n• Facilitate meetings and or design sessions to validate, prioritize, and document requirements\n• Make presentations to user groups and key stakeholders\n• Work directly with the HRIS Program Manager to track time, schedule, budgets and compile reports as needed for quality assurance and executive review\n\nREQUIREMENTS:\n• 5-7 years of experience working in the HR technology ecosystem with comprehensive knowledge of Workday\n• 5-7 years of experience doing progressively more complex HR, business or systems analysis; such as scope definition, requirements gathering, business process re-engineering, etc.\n• Experience with system implementation deliverables including fit gap analysis, total cost of ownership, benefits analysis, and business process improvement\n• Self-starter capable of managing multiple priorities and complex tasks in a dynamic work environment\n• Growth mindset, passionate about learning and sharing what you know with others\n• Demonstrated excellent written oral communication skills, technical documentation skills, user liaison skills, and personal interaction abilities\n• Advanced ability to develop efficient and effective analytic methodologies and approaches to generate value, address a broad range of operational and performance issues, execute the analysis in a timely, accurate and reliable manner, communicate findings clearly and concisely to diverse business leaders, key contributors and stakeholders\n• Advanced critical thinking and problem-solving skills\n• Demonstrated ability to work independently and as part of a team in a cooperative effort\n• Ability to lead and work collaboratively within a business unit team and have strong influencing skills\n• Ability to deal with trade-offs, conflict, and change management in a collaborative and positive manner\n• Demonstrated success in facilitating work groups and ability to develop consensus", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQnVzaW5lc3MgU3lzdGVtcyBBbmFseXN0IiwiY29tcGFueV9uYW1lIjoiUmFrdXRlbiBBc2lhIiwiY29tcGFueV9taWQiOiIvZy8xMWc3MDcyejF2IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiOE9kZzdjeDdkSng0QWpiSUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFUwTXhVRll4TUdGNWNWZzJVVFZIZG1keU9GUnRUekZuWlZobVMxVlVlWE41ZEhab1dHWllaalF5V21wMlJEWlBNRmRIUkRJek1WSnhXVXh5VEd4aFJFWk9iVlJCU0RGcFdsOUhSMUp0YjNaRVIwVk5URWRHV0dkclNUQlFUWEJuUVhGU2FqbG5iWGczYWxKSWQxSjJabXh5ZGtkQk1teGlSMWR6TTNJNGJGQkpjMVYzVEVaUGIzUnlUVkF5TkVoMWNGWldUVkl4UWkxU1kxTjNFaFl6U0dsRFdVOWxOVTV2TjBselVWYzVjWEZIYjBSUkdpSkJUMDFaVW5kQlVISldaazlNT0RReVFWWk1OVGh0WlVOcFVFbEljRGxRZHpKbiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzQ5IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExhaW1vb24uY29tIiwibGluayI6Imh0dHBzOi8vam9icy5sYWltb29uLmNvbS9qb2JzL2V4dGVybmFsdmlldy8yNjA1NTg0NT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Security System Analyst", "company_name": "SECURITY & RISK SOLUTIONS PTE. LTD.", "location": "GEMINI@SIMS (+1 other)", "via": "via Learn4Good", "description": "Location: null\nRoles &\n\nResponsibilities\n\nThe main responsibility of the Security Systems Analyst is to support the efficient operation of the physical security systems technologies within the APAC region led by the Security Systems Supervisor and its operating within the Security Operations Centre . These technologies include, Electronic Access Control, Video Surveillance Systems, intrusion detection systems, communication systems and other risk-based technologies or solutions.\n\nPrimary activities include:● Ensures that routine maintenance undertaken in the APEC region maintains the systems integrity & reliability of its connectivity to the SCC by acting as 1st line support.● Reactively troubleshoots and supervises the remediation of any problems identified with any hardware or software within the APAC security portfolio either internally and via approved contracted companies where required.● Responsible for auditing the documentation and administration of the system ensuring... alignment of all configuration, drawings, programming to the company systems standards for the purpose of management, global/regional data compliance and audits.●\n\nProvides end user training to SOC operators to efficiently utilise the system to monitor the APAC portfolio Main responsibilities● Projects Workso Commissions any system changes completed by approved third party contractorso Programmes system configuration in accordance with documentation governed by the TWDC minimum security standards, target operating model, data protection requirements and local legislationo Responsible for ensuring on-boarding to the SCC in an effective mannero Support technical and application integrations across the APAC territory ● Audit & Complianceo Regularly tests and validates system effectiveness in its detection and monitoring capabilitieso Validates and updates where required site documentation detailing changes, schematics, configuration and installed assets.o\n\nEnsures minimal nuisance systems alarmso Confirms with IT department necessary storage, LAN & WAN capacity for operational effectiveness and redundancy capability ● Service Managemento Manages GA [1] case load received from multiple sources and locations and monitors time to resolutiono Scheduling of resources to minimise disruption to TWDC business.o Oversees any reactive maintenance to be conducted as required in accordance with procedures set by TWDC.o\n\nMonitors service performance against respective Service Level Agreementso Ensures resources comply with necessary procedures and requirements of sites to complete remediation works.o Validates resolutions of third party in accordance with TWDC standards and contractual requirementso Ensure, in cooperation with the approved contracted companies, that sufficient spares are on hand throughout the region, to allow for continued operation of systems should an equipment failure occur;\n\n● People Managemento Daily management of contacting companies and internal stakeholders involved with systems;o Have a full understanding of the functions covered at all sites including areas such as Security, CCTV, Reception and systems Support;o Ensure adequate skill sets of all security staff to efficiently identify faults locally or virtually within the system ● System Innovationo Respond to changes in the external environment including legislation, technology and trends.\n\n● Operations Managemento Report on a daily basis with management to ensure effective communication of all systems matters to ensure the delivery of a high standard professional security service;o Ensure all staff are trained to carry out their systems duties in accordance with procedures and policies;o Work in partnership to raise the profile of security and fire prevention by attending meetings with service partners;o\n\nInvestigate incidents and prepare responses in accordance with policies and procedures;o Understand drivers behind systems failures and to take steps to minimise losses. ● Other\n\nDutieso Be aware of policy and procedures owned and changed from time to time by APAC;o Be aware of policy and procedures owned and changed from time to time by the client.● Any additional reasonable duties requested by operational management (APAC Contract Manager, APAC Technical Manager, APAC Security System Supervisor, TWDC Security Systems Senior Manager APAC). Other duties and responsibilities● Work in accordance with:o\n\nSecurity & Risk Solutions(SRS) policies, site procedures and training providedo Customer policies● Carry out any other reasonable request as required by your Line Manager or the Customer. Health and Safety responsibilities\n\nEnsure work is carried out in accordance with site/department procedures and training provided.● Comply with the Health and Safety Policy, procedures and protocols at all times;● Ensure you have received the required training prior to commencing works;● Ensure that you are working in accordance with the safe system of works, as briefed by your Line Manager;● Ensure that you are fit for work prior to reporting for duty each day;●\n\nReport any health and safety concerns to your line manager;● Once Personal Protective Equipment (PPE) has been issued ensure that you keep it serviceable at all times and report any defects to your line manager;● Always ensure while at work you are wearing the correct PPE;● If you are operating machinery/plant/vehicles you must operate safely in accordance with the instruction and training provided;●\n\nSet a good example at all times;● Job specifico Reporting immediately to the Contract Manager any action or inaction which compromises safety;o Maintain a healthy and safe place of work, ensuring all posts are in a clean and tidy condition at all times;o Report missing, damaged or unserviceable equipment to the Contract Manager;o Co-operate with APAC and the client so that the company can carry out its statutory duty under Health & Safety policies and all relevant statutory provisions;o\n\nNot intentionally or recklessly interfere with or misuse any property, equipment IT hardware or systems in the interest of Health & Safety and Welfare. Required skills & Experience\n\nEssential●\n\nAbility to meet all vetting requirements;● Background in Security Systems Management;● Working knowledge in providing security solutions;● Effective interpersonal & communication skills;●\n\nExperience of issue and conflict resolution;●\n\nAbility to work under own initiative, making decisions to benefit APAC and client;●\n\nExperience with raising work orders;● Competent on Microsoft Word/Excel/Outlook/PowerPoint;● Experience and good working knowledge of the following:o Computer Networking and IT systems administration;o Video Surveillance (FLIR/Genetec);o Access control (Lenel, Lobby works, Galaxy);o Reporting software (Global Aware);o Mass notification systems (TRIS, ANVIL, 360, EVERBRIDGE).o Control room SOP’s● Demonstrate the ability to think and act quickly in emergencies or under pressure;● Have an ability to deliver succinct and clear verbal and written reports where necessary;●\n\nMaintain a high standard of personal presentation;● Demonstrate reliability including the ability to deliver high standards of both punctuality and attendance in order to ensure team effectiveness and availability;●\n\nAble to demonstrate an ability to work as part of a team;●\n\nAble to deal calmly and confidently with all demands from the public;● An understanding of the principles of equality and diversity in relation to visitors’ needs;● An interest in and commitment to the work of SRS for its clients. Desirable● Understanding of the International Standards in IT Security;●\n\nExperience with software such as CABS, CONDECO, CARDEX.● AutoCAD, draughtsman Qualifications & Licences\n\nEssential● Certification for Lenel, FLIR, Genetec etc.\n\nDesirable● Systems Certification Licenses● First Aid at Work certificate\n\nTell employers what skills you have\n\nAccess Control\n\nIntegration\n\nMicrosoft Technologies\n\nOperation\n\nProject Management\n\nSecurity\n\nSystems Engineering\n\nTroubleshootingsecurity systems\n\nSystems technology", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZWN1cml0eSBTeXN0ZW0gQW5hbHlzdCIsImNvbXBhbnlfbmFtZSI6IlNFQ1VSSVRZIFx1MDAyNiBSSVNLIFNPTFVUSU9OUyBQVEUuIExURC4iLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IkdFTUlOSUBTSU1TIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiT1ROM2d6QlNnbEZFbHpsU0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMZWFybjRHb29kIiwibGluayI6Imh0dHBzOi8vd3d3LmxlYXJuNGdvb2QuY29tL2pvYnMvc2luZ2Fwb3JlL2luZm9fdGVjaG5vbG9neS8yNzE0MDE1NDEvZS8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Quality Management System Analyst", "company_name": "CONNECT ENERGY SERVICES PTE. LTD.", "location": "Singapore (+1 other)", "via": "via MNC Jobs Singapore | MNC Jobs In Singapore", "description": "Roles & Responsibilities\n\nWe are looking for a QMS ANALYST a perm role to work in SINGAPORE for our client in the Oil & Gas Manufacturing.\n\nThis position is primary responsible for the quality management system. Manage all internal and external audit activities, co-ordinate and execute plans to maintain an ISO/ API-certified quality system, analysis of CARs and NCRs trend; detect areas of improvement; conduct risk analysis; and report findings and conclusions regarding quality performance. Provide training to all employees on quality management practices. Participate and support activities involving compliance with Quality Management System requirements.\n\nKey Responsibilities:\n• Ensures that plant quality assurance policies and procedures are in compliance with regulatory and corporate requirements.\n• Support the maintenance and improvement of the Quality Management System.\n• Schedule and perform internal and external audit activities, to include pre-audit planning, audit execution... and evaluation and post-audit follow-up.\n• Leads Quality training and development programs to promote learning and Quality culture development in the organization.\n• Develop and implement company quality assurance procedures specific to Singapore; train employee in implementing all QA standard; ensure all employees are following QA procedures.\n\nQualifications:\n• Diploma or preferably a degree in Engineering or other relevant disciplines\n• 3+ years experience with Quality Assurance programmes in a corporate environment.\n• 3+ years experience in oilfield applications, manufacturing.\n[CANDIDATES WHO REQUIRE WORK PASSES NEED NOT APPLY]\n\n[CANDIDATES WHO REQUIRE WORK PASSES NEED NOT APPLY", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJRdWFsaXR5IE1hbmFnZW1lbnQgU3lzdGVtIEFuYWx5c3QiLCJjb21wYW55X25hbWUiOiJDT05ORUNUIEVORVJHWSBTRVJWSUNFUyBQVEUuIExURC4iLCJjb21wYW55X21pZCI6Ii9nLzExZHhwdHlsdzYiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJPVEQ5blNlZWZ0eGRJcjFaQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFcUVDQ3VJQlFVNVZYMDV4VVhSR1VEbHhSbUozVTA1NFprdGthRWxPTWpoeE1ESllVbGgzY21wM04wUTNhM2RhY2t4NWN6WTJhMnhRU1dKb09WVnlaazQwYUZjNFJWbENWa1l4UlVZelJuaGFPR3B2ZEZKcFUzbGFPRmxPUmtSeWNtUlZPRFJaY2tKUWFYWlJaMVJ6ZVdsUmRYZFphR2RKZFdOM09XbDNUalJYZEUxMU1sWk1NbE5vWTJkcVpHUTBURUV5YUhwYWFreDFVV1JpVG5nMllsRkZaVmR4WW5Od1JVcHBORWw1TWpSeFNWZEhhWE00VlV0VE4wSlVXVTltY1hGaGFFa3RhWHBZUkhsbGVqbFVlV2cxTmpBd1RFTXdOWHBaYmtGVGIyUXRjVWx5Y0Uwd1VSSVdNMGhwUTFsUFpUVk9iemRKYzFGWE9YRnhSMjlFVVJvaVFVOU5XVkozUW1oa05tUnZZV1JYUjFoRlRVUXdlbGRMTUhBME5UUjBVRmQzWnciLCJmY3YiOiIzIiwiZmNfaWQiOiJmY182MCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNTkMgSm9icyBTaW5nYXBvcmUgfCBNTkMgSm9icyBJbiBTaW5nYXBvcmUiLCJsaW5rIjoiaHR0cHM6Ly9zZy5tbmNqb2J6LmNvbS9qb2JzL3F1YWxpdHktbWFuYWdlbWVudC1zeXN0ZW0tYW5hbHlzdC1zaW5nYXBvcmUtMTQxMTU5P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Pega System Analyst - (200000HH)", "company_name": "OCBC Bank (Singapore)", "location": "Singapore (+1 other)", "via": "via Job Vacancies In Singapore", "description": "Description< strong>< div>\n• Design banking applications using Pega platform and delivering high-quality applications.< li>\n• Responsible and perform end-to-end development for Pega based applications.< li>\n• Work closely with key stakeholders to deliver projects and solutions.< li>\n• Provide support to SIT and UAT, investigate and resolve technical issues reported in projects.< li>\n• Conduct system and performance management, application vulnerability management and control, software release management.< li>\n• Plan and commission production system implementation.< li>\n• Develop and review technical documents and other System Development Life Cycle (SDLC) related documents.< li>\n• Provide thought leadership within own area of responsibility.< li>\n• Integrates applications by interface specification and designing database architecture and server scripting.< li>\n• Able to work independently and be self-motivated< li>< ul>Qualifications< strong>< div>\n• Minimum PCSA (Pega Certified... System Architect) in Pega 7.4 and above, preferably Pega CSSA (certified Senior System Architect). A Pega CLSA (Certified Lead System Architect) will be advantage.< li>\n• Possess working experience in Pega 7 or above with min. 3-4 years working experience in banking applications development< li>\n• Preferably with Information Technology Engineering Computer Science related degree.< li>\n• Strong technical knowledge and development experience in object-oriented languages like Java.< li>\n• Strong competency in design OO pattern and enterprise integration patterns< li>\n• Relevant experience in Java, Spring, or J2EE technologies and Angular JS< li>\n• Possess development experience in ASP or Web REST API, JavaScript, jQuery, and CSS.< li>\n• Strong technical knowledge on database systems such as SQL Server, Oracle, RDBMS design and optimization.< li>\n• Experience with Messaging, Python, NoSQL DB (MongoDB) is a plus.< li>\n• Experience in Software Development Life Cycle (SDLC) and AGILE methodology.< li>\n• Self-motivated and possess drive, and ability to work independently and a good team player.< li>\n• Strong analytical, communications and interpersonal skills as well as able proficient in English language both spoken and written.< li>\n• Passion to learn new technology and deliver high quality deliverables in first go< li>< ul", "extensions": ["14 days ago", "Full–time"], "detected_extensions": {"posted_at": "14 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQZWdhIFN5c3RlbSBBbmFseXN0IC0gKDIwMDAwMEhIKSIsImNvbXBhbnlfbmFtZSI6Ik9DQkMgQmFuayAoU2luZ2Fwb3JlKSIsImNvbXBhbnlfbWlkIjoiL20vMDU1cjI3IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoieG0xckh0ejNTcGE2Vm5kUkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZZQkNyY0JRVTVWWDA1eFVUTldhRlJyVVc5VmEyWjJWbGhDWm1kbmJWUXRNMjFXVEhjMllXRjFWVVpPYWxSemJXeHFhR2RSYjBjeFNIUXRWVzlEV20wNVEzZE9aVTVHU21aM2VXMHpWM0ZoYm5kUFgwbDFVRzFaYmxoS1ZqSjFZMlJQWTI5cExURXhWa2N4WDBsZmVGWk5kVVJyTlc5bFNrUldPRWQ1U1dkUWNXeHdaRGhuYVhvMGRsOVliV0YwVjNOUlRWOXRhVzlCY1dsTFRVcFJTRXh1ZUV0WE9EZHRSMFYyTFVKZlYwUlpOWFI1Wm1sRFdtRTJNMU5uRWhZelNHbERXVTlsTlU1dk4wbHpVVmM1Y1hGSGIwUlJHaUpCVDAxWlVuZEJkbGh0YlVzdGVtbHRaVGhrTFZGYWFYSlJSalV0VkV0SGNsSlIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY182OCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2IgVmFjYW5jaWVzIEluIFNpbmdhcG9yZSIsImxpbmsiOiJodHRwczovL2pvYmVrYS5zZy9qb2JzLzEzNzg0L09DQkMtQmFuay1TaW5nYXBvcmUtUGVnYS1TeXN0ZW0tQW5hbHlzdC0yMDAwMDBISC0yMDIxLTA0LTA5P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Business Operations", "value": "GC06"}, {"text": "Accounting and Finance", "value": "GC01"}, {"text": "Customer Service", "value": "GC10"}, {"text": "Human Resources", "value": "GC15"}, {"text": "Management", "value": "GC18"}, {"text": "Education", "value": "GC11"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Protective Services", "value": "GC23"}, {"text": "Science and Engineering", "value": "GC27"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "System analyst", "value": "system analyst"}, {"text": "Systems analyst", "value": "systems analyst"}, {"text": "Business analyst", "value": "business analyst"}, {"text": "It analyst", "value": "it analyst"}, {"text": "Analyst", "value": "analyst"}, {"text": "Senior", "value": "senior"}, {"text": "Security analyst", "value": "security analyst"}, {"text": "Application analyst", "value": "application analyst"}, {"text": "Engineer", "value": "engineer"}, {"text": "Project manager", "value": "project manager"}, {"text": "Software engineer", "value": "software engineer"}, {"text": "Hris analyst", "value": "hris analyst"}, {"text": "Lecturer", "value": "lecturer"}, {"text": "Manager", "value": "manager"}, {"text": "Senior analyst", "value": "senior analyst"}, {"text": "Soc analyst", "value": "soc analyst"}, {"text": "Sr analyst", "value": "sr analyst"}, {"text": "Support analyst", "value": "support analyst"}, {"text": "Support manager", "value": "support manager"}, {"text": "System", "value": "system"}, {"text": "Systems administrator", "value": "systems administrator"}, {"text": "Technology analyst", "value": "technology analyst"}, {"text": "Test analyst", "value": "test analyst"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Internship", "value": "INTERN"}, {"text": "Part-time", "value": "PARTTIME"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Mining", "value": "/business/naics2007/21"}, {"text": "Research", "value": "/business/naics2007/5417"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Accommodation", "value": "/business/naics2007/721"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Real Estate", "value": "/business/naics2007/53"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "OCBC", "value": "/m/055r27"}, {"text": "Jobline Resources Pte Ltd", "value": "/g/11gp2647pn"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Workato", "value": "/g/11dxpy_3xd"}, {"text": "Avensys Consulting", "value": "/g/11g7022gjf"}, {"text": "Chevron", "value": "/m/01pvx3"}, {"text": "ELITEZ PTE. LTD.", "value": "/g/11dxptfkcf"}, {"text": "ILLUMINA SINGAPORE PTE. LTD", "value": "/m/09mxkxs"}, {"text": "M1 LIMITED", "value": "/m/05n486"}, {"text": "Mantu", "value": "/m/0b6mxkc"}, {"text": "Public Service Division", "value": "/g/11g6__bv10"}, {"text": "Rakuten Asia", "value": "/g/11g7072z1v"}, {"text": "Techcom Solutions", "value": "/g/11c73vztx3"}, {"text": "United Overseas Bank Limited", "value": "/m/04gjd1"}, {"text": "VISA", "value": "/m/01kqjn"}, {"text": "Venture Corporation Limited", "value": "/g/11bc61gglw"}, {"text": "Xilinx", "value": "/m/03dwkc"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "Activate Interactive Pte Ltd", "value": "/g/11dxq192l5"}, {"text": "Aramco", "value": "/m/01qjg2"}, {"text": "Avnet", "value": "/m/0c8xmc"}, {"text": "BGC Group", "value": "/g/11g0j3fjv8"}, {"text": "Bgc Group Pte. Ltd.", "value": "/g/11g9mphr4f"}, {"text": "CONNECT ENERGY SERVICES PTE. LTD.", "value": "/g/11dxptylw6"}, {"text": "Cochlear Ltd", "value": "/m/0kqqgc"}, {"text": "Crédit Agricole Corporate and Investment Bank", "value": "/m/04n1_w"}, {"text": "Ecquaria Technologies Pte Ltd", "value": "/g/11dxq26pxz"}, {"text": "Edwards Lifesciences", "value": "/m/03p20ps"}, {"text": "Equinix", "value": "/m/07btnq"}, {"text": "Experis Singapore", "value": "/g/11dxpnwm3s"}, {"text": "Flintex Consulting Pte Ltd", "value": "/g/11h1z41pzb"}, {"text": "ITCAN Pte Limited", "value": "/g/11dxpstz9t"}, {"text": "Institute of Technical Education", "value": "/m/05_02p"}]}]}