{"search_metadata": {"id": "60827a843bea7b236dcff6be", "status": "Success", "json_endpoint": "https://serpapi.com/searches/e1d9efda50e570e7/60827a843bea7b236dcff6be.json", "created_at": "2021-04-23 07:43:00 UTC", "processed_at": "2021-04-23 07:43:00 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28solution+architect%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=120", "raw_html_file": "https://serpapi.com/searches/e1d9efda50e570e7/60827a843bea7b236dcff6be.html", "total_time_taken": 1.24}, "search_parameters": {"q": "(solution architect) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "120"}, "jobs_results": [{"title": "Cloud Solution Architect", "company_name": "None", "location": "Singapore", "via": "via Jobs", "description": "As Cloud Solution Architect you will be the Senior Technical leader and subject matter expert engaged in the solutioning and delivery of our Cloud-related projects . Working in partnership with the wider project team, you will be responsible for the overall technology strategy and architecture/design for Cloud solutions for your clients. You will also be responsible for the direction of technical resources on the project to implement solutions for your clients.You will also work on optimising resources to meet project constraints taking into account such concerns as Client budget, skills availability, and complexity of the project/solution. From a client perspective you will deal with teams focused on designing, migrating, building, managing, transforming and expanding their services on Cloud. Your role will also be to build trusted and ongoing relationships with key buyers and influencers including cloud developers, CIO's/CTO's and technology procurement.Key Skills and Experience... required: Expert level skills in Cloud to guide technical client side architects on Cloud strategy and solution best practices. This will aid clients to identify high value Cloud entry points (e.g. new applications, transforming existing applications or simply starting a Cloud sandbox that IBM helps them operationalize.) Expert level skills in guiding IBM project technical resources to design and implement Cloud solutions Expert level skill in Cloud technology, including hybrid Cloud solutions Deep understanding of Public Cloud as a PaaS offering including automation of deployment and containers. Deep understanding of the current state of the art for infrastructure automation, continuous integration/deployment, SQL/NoSQL/NewSQL, networking, and cloud-based delivery models. Deep experience in designing and implementing highly available and scalable Cloud solutions Experienced skill level with contemporary engagement methods, including Proof of Concepts. Experienced level skills with Design Thinking, Agile and DevOps methods. Business case modelling skills (i.e. Cloud total cost of Ownership vs Business as Usual purchases) Ability to position Cloud technology against industry solution requirements. Significant experience within any of the major Industries or Government Excellent verbal, written and presentation skills; Self-driven, detail-orientation Ability to work collaboratively and productively with globally dispersed teams Ability to manage ambiguity, yet producing tangible results Ability to effectively manage challenging situations without loss of focus when under pressure *Required Professional and Technical Expertise At least 3+ year experience architecting and solutioning leveraging a major Cloud platform. 8+ years of experience in development consulting Cloud Certification Cloud native solutions TOGAF or equivalent architecture certification Proficiency in programming languages such as: Shell, Java, C, Ruby, Python Knowledge of networking systems and architectures (DNS, TCP, UDP etc) Lead first of a kind and complex solution development Provide end-to-end solution approach guidance and coaching. Create and use intellectual capital to solve diverse client issues in an innovative way Provide training to technical solutioners and sales teams", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDbG91ZCBTb2x1dGlvbiBBcmNoaXRlY3QiLCJjb21wYW55X25hbWUiOiJOb25lIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJSNzhva0V3ZFJyT1lwMENQQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnMiLCJsaW5rIjoiaHR0cHM6Ly9zZy5maWRhbnRvLmNvbS9qb2JzL2pvYi1vcGVuaW5nL2NvbXB1dGVyLXN5c3RlbXMtZW5naW5lZXJzYXJjaGl0ZWN0cy9jbG91ZC1zb2x1dGlvbi1hcmNoaXRlY3QtMjc1NDMwMTUyP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Solution Architect (Cyber Security)", "company_name": "Talent Trader Group Pte Ltd", "location": "Singapore", "via": "via LinkedIn", "description": "Responsibilities\n• Enhance security team accomplishments and competence by planning delivery of cyber security solutions\n• Ability to identify security risks, exposures and exploits within customers' environment. And aspire and shape our customers' cybersecurity architecture design decisions and capture these in high-level, detailed designs.\n• Act as a technical lead for the delivery of proposed security solutions\n• Implement designed or proposed security systems; acting as technical lead to direct equipment and software system installation\n• Managing project schedule for delivery; completing solution documentation and ensure handover to security operations\n\nRequirements\n• Bachelor's Degree in computer science or equivalent\n• 2 years' experience in implementation of cyber security design and project delivery in enterprise environment\n• Strong technical experience in delivery security solutions in term of presentation and project management\n• CISSP certification will be advantageous\n•... Prior experience / certification with any security products/ solutions such as FireEye, CyberArk, Symantec, Tenable, ZScaler/Menlo will be advantageous\n\nInterested candidates who wish to apply for the advertised position, please email us an updated copy of your resume to;\nEmail Address: it@talenttradersg.com\n\nEA License No.: 13C6305\nRegistration ID: R1877348\n\nFor candidate who applied for the advistised position is deemed to have consented to us that we may collect, use or disclosed your personal information for purpose in connection with the services provided by us.\n\nAct as a technical lead for the delivery of proposed security solutions\n\nSkills: Security, Cisco, Cyberark, Symantec Antivirus, Symantec Endpoint Protection, Cissp, Ceh, Network Security, Information Security\n\nExperience: 5.00-10.00 Years", "extensions": ["5 days ago", "Full–time"], "detected_extensions": {"posted_at": "5 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2x1dGlvbiBBcmNoaXRlY3QgKEN5YmVyIFNlY3VyaXR5KSIsImNvbXBhbnlfbmFtZSI6IlRhbGVudCBUcmFkZXIgR3JvdXAgUHRlIEx0ZCIsImNvbXBhbnlfbWlkIjoiL2cvMTFkeHBtbGM1YiIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Ino0SlVuZEFUZnlNYjZFRHVBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVvc0NDc3dCUVU1VlgwNXhVVWxWTUY5Q05WbEZRbXhRYTBndFkxUnZkSEpwWlZCSlluZFdkMEpUWVhVeWMyeEZlVlpFU1ZkNFltaHJNbEJmYlZadlExcEVZVlZoU0V4T1gxVnliSE4zT0V4c1pHRkNaM2x0UjJ0TVVrVklRMXBtUjJFd1dHTTVNVUZPV1dGeGNqUlpWbXR0ZGtoQ09URXpSRU5LYjNWRVVXRTRlbWh3VTFwMU0yZDBaMUpCVkZjd1p5MVRlbUp1Tm14aWQxaElXbVZSTWxkWWVGZDJaVFJtUjNwc2NFaE1lSGhSV1V0Uk1WUnZjSGxXWlRaS09HZHlOek15U2pOcFNsODVObXRyTjNoSmNrRk1FaFpvV0hGRFdWQlBTMGR3UkZoMFFXRldkalUzV1VSbkdpSkJUMDFaVW5kRU5uSmZSVnBvTkZVNFUzTnhOalJsZVV0aFVXaDNaM290WVZCMyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzEwIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExpbmtlZEluIiwibGluayI6Imh0dHBzOi8vc2cubGlua2VkaW4uY29tL2pvYnMvdmlldy9zb2x1dGlvbi1hcmNoaXRlY3QtY3liZXItc2VjdXJpdHktYXQtdGFsZW50LXRyYWRlci1ncm91cC1wdGUtbHRkLTI1MDg5MDMyNjY/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Solution Architect-IT Cyber Security Cloud Computing IT Security", "company_name": "Infinite Computer Solutions Pte Ltd", "location": "Singapore", "via": "via Monster Singapore", "description": "Responsibilities:\n• Plan, manage and operate cloud-based testing sandbox environment\n• Manage cloud infrastructure services, and multiple instances of the cloud servers via management console\n• Provide technical assistance on cloud-based systems to resolve operational problems, including system troubleshooting, network security configurations, patching, and help to maintain system security procedures\n• Maintain multi-user computing environment and optimise usage of cloud resources, identify opportunities for efficiency, e.g. Infrastructures as code\n• Perform backup and recovery of virtual cloud instances, data, etc\n• Support and facilitate POC for companies and potential customers to promote technology adoption within Government and Enterprises\n• Facilitate POC requirement discussion for potential government/enterprise buyers with accredited & spark companies and set realistic customer expectation\n• Assist in POC deployment including install, setup and configurations of Web, App... Database servers on Windows and Linux\n• Plan, manage and execute technical evaluation of innovative tech products as part of quality assurance and risk management process to Government and Enterprise stakeholders\n• Identify product key unique value propositions from technology perspective and perform deep-dive understanding of the product architecture\n• Design testing strategy in collaboration with company tech leaders, and develop test scenarios / test cases to evaluate the product\n• Conduct testing and compliance assessments – in the areas of functional, performance, security, usability, compatibility/portability – with reference to open industry and government standards\n• Experience in Cloud Infrastructure and Cybersecurity will be an advantage\nRequirements:\n(A) Academic\n• Degree in Computer Science, Computer or Electronics Engineering or Information Technology, or related field preferred\n(B) Experience\n• Minimally 6-8 years of ICT/ICM experience in Product Quality & Solution Architect; and at least 3 years of cloud and cybersecurity experience\n• Good knowledge of Active Directory, Exchange, Azure, AWS and GCP.\n• Strong technical knowledge of Infrastructure as Service (IaaS), Platform as Service (PaaS) and Software as Service (SaaS).\n• Experience with hybrid cloud, microservices and on-premise infrastructure, as well as architecture and technology governance aligned to government and enterprise standard.\n• Professional exposure to container platform tools such as Docker and Kubernetes.\n• Professional exposure to Dev Ops release and build management, automation scripts experience with tolls like Git, Bash scripting, PowerShell, AWS Cloud Formation, Puppet, Ansible or Chef.\n• Experience with analysing scanned results of both Static and Dynamic Application Security Testing from assessment software, such as HP Fortify, WebInspect, Performance Center, Parasoft, etc.\n• Knowledge of ISO standards e.g. ISO 17025 / 25010 / 27001 and OWASP – ASVS, etc.\n• Knowledge of security technologies in both IT & OT, etc.\n• Knowledge and experience in information technologies, particularly in Enterprise Software, Cloud Technology, IoT, Robotics, Computer Vision, Future Comms, Big Data and Data Analytics, Artificial Intelligence, Energy Management, Enterprise IT, Cyber Security, etc.\n• Certification in Solution Architect is a plus\n\nEA License No. - 14C6941", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2x1dGlvbiBBcmNoaXRlY3QtSVQgQ3liZXIgU2VjdXJpdHkgQ2xvdWQgQ29tcHV0aW5nIElUIFNlY3VyaXR5IiwiY29tcGFueV9uYW1lIjoiSW5maW5pdGUgQ29tcHV0ZXIgU29sdXRpb25zIFB0ZSBMdGQiLCJjb21wYW55X21pZCI6Ii9nLzExZzltajcyeXoiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJUWWR4YkRBcG5GWEttYnFVQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFcUVDQ3VJQlFVNVZYMDV4VkV0ek9VMUtXVTVWVVhWNGIxVnVOV054ZFdKU1VqQlZTeTFIY0dsQk1rMDNWWEZyVTB3MVFteDNSemhWUlRWdlptMUxXWGhJV1hsdGRITkJUekp4TUV4T09UTTBOWHBKYlZwMVZsZGhSbkJHZGtoSk9EQkdlR290WDBSQ01uWkVVRkpZZDFkUU9YbzJPV1ppVUVadGRVTkNiMFZyYkVONWVWZzFUVFJhVDBaS2IzWXphVXBtWmpsdlh6Uk5Ubm8xZG14bFQweExaMWR4VERkSFRUVnVaMWxZVkVoNFJFUnJTSEZWWjBScmJFWm9VeTFyUlRkeVdGaExUV1pJTVdGSU4xcFFXa2QwWWxCSlJ6a3dYM0pCUmtkeVZqazNWRVZpVEhsMGR4SVdhRmh4UTFsUVQwdEhjRVJZZEVGaFZuWTFOMWxFWnhvaVFVOU5XVkozUTFkblVVTXlla2hKTVUxWGRVNVJOMVIzTFcxdFdsQXROWGR2WnciLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18xNiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNb25zdGVyIFNpbmdhcG9yZSIsImxpbmsiOiJodHRwczovL3d3dy5tb25zdGVyLmNvbS5zZy9qb2Ivc29sdXRpb24tYXJjaGl0ZWN0LWl0LWN5YmVyLXNlY3VyaXR5LWNsb3VkLWNvbXB1dGluZy1pdC1zZWN1cml0eS1pbmZpbml0ZS1jb21wdXRlci1zb2x1dGlvbnMtcHRlLWx0ZC1zaW5nYXBvcmUtMTYxMzg1Nz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Enterprise Security Architect", "company_name": "Accenture", "location": "Singapore", "via": "via Accenture", "description": "The primary responsibility of this role\nis to work closely with the industry leads to create cutting edge security\nsolutions in line with client specifications.\nThe Security architect needs to cover areas such as Cloud & Network\nSecurity, Application Security, Cyber Defense, Security Compliance and Identity\nand Access Management.\n\nKey Responsibilities\n• Contribute to\noverall Enterprise Security Architecture Governance and/or industry specific\ncyber architecture framework\n• Partner with the\nClient Account and Industry Leads to understand client requirements and able to\ndesign an appropriate solution architecture\n• Coach, mentor and\ncollaborate with internal security teams and industry lead to deliver\nsuccessful architecture/solution outcomes\n• Acting as the\nSME, he/she will be accountable to lead and make security architecture\ndecisions on all aspects of Accenture client presales, proposal design and\nintegration with client ecosystems\n• Ability to\nexecute on regional scale and make... pragmatic architecture decisions, quick wins\nwith long term vision\n• Support Sales Leads by serving as a consultant in pre-sales,\nincluding assessment of client needs, project scopes and proposal preparation\n• Design, architect and troubleshoot complex security implementations,\nleading delivery of HLD and LLD documents\n• Advising and shaping security architecture best practices in\nan evolving client environment", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJFbnRlcnByaXNlIFNlY3VyaXR5IEFyY2hpdGVjdCIsImNvbXBhbnlfbmFtZSI6IkFjY2VudHVyZSIsImNvbXBhbnlfbWlkIjoiL20vMDFycDJjIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiU2tYbmQxd0pLQ19JR1l2aEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFVWOXZRVUZDUkdWNGMwSldTMEpOWHpkNVZuWnBWVlJsUVVaNU1GcG1WSEJXTjJzekxVUkJabVUxZHpaVmNFaFNUVmhMVTNkbFVVZEZWVXBMVGxwbWFFUlFTV0YxWWxKbWJubHRVVk5OU1c1bE1HeFRVa0ZHVW13MWQyaHhZVmM1Tms0eGVFMTFha0paYVU5aWF6TjRWbFZEV2twc2VrTnBjbFZNTlY4dGJWRlpTRTQwV2tSbWMxTnVURzgzYmxCRmRGZzBZbDkzZVdGWk1GVkJFaFpvV0hGRFdWQlBTMGR3UkZoMFFXRldkalUzV1VSbkdpSkJUMDFaVW5kRVMxcHljRFpZTXpobmRUbGxWV2sxWkVkR2JXaFVZWE5oVHpCUiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzIzIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEFjY2VudHVyZSIsImxpbmsiOiJodHRwczovL3d3dy5hY2NlbnR1cmUuY29tL3NnLWVuL2NhcmVlcnMvam9iZGV0YWlscz9pZD0wMDgzOTgxNV9lblx1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Ref: 119255 - Staff Architect", "company_name": "Singtel Group", "location": "Singapore", "via": "via Singtel Careers", "description": "Realise your full potential with Asia's leading communications group. While we take pride in our 140-year heritage, our philosophy is to always look forward and evolve. Today, we are a leader in cutting-edge ICT innovation and digital advances, powered by a vast network of offices in countries and territories across Asia Pacific, the Middle East, Europe and the USA. Come be a part of our dynamic organisation as we create the infocomms landscape of the future.\n\nSingtel are at the leading edge of technology development to improve the experience of our customers as they consume services across mobile, voice and data infrastructure, managed services, cloud computing, IT services and professional consulting. To support that journey we are searching for top talent and have an exciting opportunity for a Senior Architect to strengthen our team.\n\nThis is a strategic role focussing on Application Architecture for multiple digital channels and platforms.\n\nKey Responsibilities and Results:\n•... Understands business functions and transform requirements into architecture and blueprint for the solution being created. Need to propose new innovative solutions, updates to existing solutions, negotiate alternative options, build technical and release roadmaps.\n• Construct a solution architecture around Microservices and APIs and be able to decompose monolith applications into meaningful implementable Microservices and APIs in a Cloud/DevOps environment.\n• Work closely with the development team and get their buy-in into accepting the design to be implemented. Also, work with different stake holders, product owner, senior executives, external parties like system integrators, product partners.\n• Provide technology perspective to business to achieve roadmap and prioritization by keeping abreast with industry trends. Where required, help business size the complexity of problem and help simplify and define MVP.\n\nQualifications / Experience / Knowledge Required:\n• Degree in Information Technology, Computer Science, Engineering or its equivalent.\n• 12+ years of experience in the technology industry including 8+ in architecture of scalable and high-performance internet facing systems.\n• Possess strong background and experience as a successful Software engineer/Architect in building large scale, highly available Internet and mobile applications.\n• Have in depth knowledge of cloud computing, microservices architecture (incl. design pattern, rest/grpc, gateway & service mesh etc.), DevOps, streaming architecture, modern data architecture, Mobile and Web application architecture.\n• Good experience in API security including OAuth2/OIDC, Tokens, mTLS etc.\n• Significant experience working on mission critical internet facing applications focusing on scalability, performance, architecture aspects.\n• Passion for architecture and ability to pick up and learn new technological advances very quickly.\n• Exhibits leadership in guiding team members, adapts to changes in technology and business domains, has good knowledge of latest trends in the market and is well respected within the team.\n• Solid understanding of Public Cloud (pref. AWS) architecture. AWS certification is a big plus.\n• Experience in Java, Spring boot, any modern messaging technology, any Traditional and NoSQL database is a big plus.\n• Ability to effectively communicate vision and roadmap to all stakeholders. Exceptional communication skills with diverse audiences. (including non-technical audiences)\n\nIf this description is exciting and you feel that you have the necessary skills and experience to make a difference, then please follow the link to apply. For more information on this and other opportunities please refer to our careers portal under https://groupcareers.singtel.com.\n\nLet’s shape a better world through technology. Join us to lead the change", "extensions": ["8 days ago", "Full–time"], "detected_extensions": {"posted_at": "8 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJSZWY6IDExOTI1NSAtIFN0YWZmIEFyY2hpdGVjdCIsImNvbXBhbnlfbmFtZSI6IlNpbmd0ZWwgR3JvdXAiLCJjb21wYW55X21pZCI6Ii9tLzAyMHpmbCIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjhHMllvaWVONy1rNnRkRkNBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhVell3TlRCVVJUbFBaakoyTUY4NGIzbzNWVlpwT0dONFVuVTRSRlp3YVdONU5WUkVlREJpWlRaTmFHTlVaV1ZuZUVGTGRXSlBSRFJVUWtRMFUyaENiQzFIU0ZFdFFsaHpURkl4Y0RGeVdYUk9aMU5qWTJ4dWEzSkJjbFZJV214cVRXdHlXbkYyVVROYVZWYzNiMGxmZEZaZk5ERnpRbUZzYkdJNVQzVnhObVJST0dWMWNFVXRMVEIwTm0xVk0yWlBYMUZPYldwd1gwOXlRMVozRWhab1dIRkRXVkJQUzBkd1JGaDBRV0ZXZGpVM1dVUm5HaUpCVDAxWlVuZEJRekp3WlVObE5tbG1WMUJ0YW1Wc1JGcDFSVmxtVmxKeFVrdG4iLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18zMCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBTaW5ndGVsIENhcmVlcnMiLCJsaW5rIjoiaHR0cHM6Ly9ncm91cGNhcmVlcnMuc2luZ3RlbC5jb20vam9iL1N0YWZmLUFyY2hpdGVjdC1TaW5nLzU3MTI3NTIxMC8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Solution Architect (Data Management and Analytics)", "company_name": "None", "location": "Singapore", "via": "via Jobs | Fidanto", "description": "We are seeking a very experience Data Management Solution Architect. This Candidate must have extensive experience in architecting large data integration/migration projects, implemented large scale data analytics solutions, end to end. Candidate should also process extensive experience in data modelling design for analytics applications and databases reverse engineering, equip with Agile development methodologies (Scrum, TDD, BDD). Critical Success Factors: a. ETL/ELT Data Migration, file/data manipulation, mapping processes b. Data Modelling c. Data Analytics – Tableau Visualization or others d. Traditional Data Platforms and/or Cloud Data Platforms Key responsibilities may include: a. Act as a subject matter expert on Oak Consulting's technology solutions and provide our clients with the most optimal implementation. b. Lead the design of overall data architecture. c. Setting clear architecture design principles for team to follow. d. Developing and delivering product training... workshops. e. Work closely with stakeholders to unlock and develop new opportunities by developing a deep understanding on business goals and industry trends. f. This is a hands-on role where Candidate is expected to lead/mentor a team of junior data specialists and when necessary provides the technical delivery directly. Qualifications a. Minimum of 5 – 10 years of hands-on experience with Data Management Platforms i.e., Informatica, Talend, SSIS, Pentaho, Amazon Web Services, Azure, GCP etc. b. 5-10 years of hands-on experience with any of the following technologies: Databases (SQL/NoSQL, MongoDB, Cassandra, MariaDB, PostgreSQL), Big Data open-source tools (Hadoop, Spark), Big Data proprietary tools (Hortonworks, Cloudera) programming experience (Java, Python, R, Julia, SQL). Tableau Certification is an advantage c. Candidate with AWS Associate Certifications or AWS Professional Certification or AWS Data Analytics Specialty certification is an advantage. d. Agile development methodologies (Scrum, TDD, BDD) We are seeking a very experience Data Management Solution Architect. This Candidate must have extensive experience in architecting large data integration/migration projects, implemented large scale da Skills: Amazon Cloud, Analytics, Artificial Intelligence, Business Analysis, Data Integration, Data Management, Architecting, Data Modelling Experience: 5.00-7.00 Years", "extensions": ["4 days ago", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2x1dGlvbiBBcmNoaXRlY3QgKERhdGEgTWFuYWdlbWVudCBhbmQgQW5hbHl0aWNzKSIsImNvbXBhbnlfbmFtZSI6Ik5vbmUiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjFWRFBDX3R2VnJDTF84RGRBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9icyB8IEZpZGFudG8iLCJsaW5rIjoiaHR0cHM6Ly9zZy5maWRhbnRvLmNvbS9qb2JzL2pvYi1vcGVuaW5nL2luZm9ybWF0aW9uLXRlY2hub2xvZ3ktcHJvamVjdC1tYW5hZ2Vycy9zb2x1dGlvbi1hcmNoaXRlY3QtZGF0YS1tYW5hZ2VtZW50LWFuZC1hbmFseXRpY3MtMjc2OTc0MjAzP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Senior Solutions Architect", "company_name": "Verizon", "location": "Singapore", "via": "via LinkedIn", "description": "Job # 553838\n\nWhen you join Verizon\n\nVerizon is a leading provider of technology, communications, information and entertainment products, transforming the way we connect across the globe. We’re a diverse network of people driven by our ambition and united in our shared purpose to shape a better future. Here, we have the ability to learn and grow at the speed of technology, and the space to create within every role. Together, we are moving the world forward - and you can too. Dream it. Build it. Do it here.\n\nDiversity and Inclusion at Verizon\n\nAt Verizon, we know that diversity makes us stronger. We are committed to a collaborative, inclusive environment that encourages authenticity and fosters a sense of belonging. We strive for everyone to feel valued, connected, and empowered to reach their potential and contribute their best. Check out our diversity and inclusion page to learn more.\n\nWhat You’ll Be Doing...\n\nAs a Senior Solution Architect, you’ll fulfill the role of trusted... technical adviser for Verizon Enterprise Services (VES) clients. You will also act as the technical solutions lead for internal and external solution development including proposals, RFPs, RFIs, and RFQs by putting together solutions across multi-towers (Cloud, Security, Networking, UCC, Contact Center), supporting literature, diagrams, write-ups, responses, and presentations.\n\nYou may know Verizon only as the company making your smartphone work. But at Verizon Enterprise we're also the company helping 99% of the Fortune 1000 work. In particular, we are recognized by analysts and clients as a leader in global security, voice and data networks, and Software Defined Networking (SDN) and are focused on our client’s success though delivering the connected world Simply, Securely, Reliably.\n• Being an integral part of the sales team to identify and qualify business opportunities, identify key Client technical objections and develop the strategy to resolve technical blockers.\n• Owning the technical relationship with clients, including managing product and solution briefings, proof-of-concept work, coordination of additional technical resources, and obtaining Client requirements and translates these into a (Client specific) Solution Design and/or Verizon Enterprise offer.\n• Leading solution definition and solution design both internal within Verizon Enterprise as well as towards the Client.\n• Leading prioritization of Client solution / technical requirements and champions resolution of solution / product gaps internally (also towards Product Groups).\n• Working with potential Client to analyze IT infrastructure for potential opportunities to demonstrate Verizon Enterprise solution's unique capabilities.\n• Articulating the Verizon Enterprise vision on technologies and solutions towards the Client and positions Verizon Enterprise as thought leader on key technological developments.\n• Developing individual skill sets and expanding product knowledge to maximize value and to deliver quality services to our clients.\n• Attaining designated certification requirements and attending product-specific training, reviewing technical literature, and obtaining hands-on experience.\n• Traveling to Client sites, conferences, and other related events as required.\n\nYou’ll Need To Have\n\nWhat we’re looking for...\n• Bachelor’s degree in engineering, computer science or four or more years of work experience.\n• Six or more years of relevant work experience.\n• Six or more years of experience as a technical sales engineer in an IT infrastructure environment or equivalent experience in a Client-facing or IT staff role (including working as a member of a professional services or IT engineering team).\n• Experience presenting and delivering technical pitches.\n• Willingness to travel.\n\nEven Better If You Have\n• Experience architecting IT infrastructure for scalable, distributed systems.\n• Experience generating solution documentation for both internal stakeholders and clients in the form of diagrams, slides, documents, spreadsheets.\n• Ability to quickly learn, understand, and work with new emerging technologies, methodologies and solutions in the SDN / IT infrastructure space.\n• Technical knowledge of datacenter network architecture, SDN, and large-scale private cloud networks.\n• Multiple security, architecture, and industry certifications such as (CISSP, TOGAFv9, ITIL, Cisco CCNA or CCNP, CCSK, Microsoft, Amazon, etc.).\n• Experience in three or more of the following: Data and IP Services (MPLS, SIP, internet, VPN, SDN, NFV, SDWAN); Network Operations (WLAN, LAN, WAN, IP PBX, Automation/Orchestration); Security (DDOS, FW, IDS, WAF, DDI, SIEM, Analytics, Micro-segmentation); Data Center Outsourcing (application management, storage, virtualization, serverless); Call Center Technologies (ACD, IVR, Call Recording, Chat, Cloud Delivery, toll free, Omni-channel); IT Applications Management (SOA, Web Services).\n• Knowledge of leading technology network and security vendor portfolios such as Cisco, Viptela, Versa, Fortinet, Palo Alto, Riverbed, and Juniper.\n• Experience evaluating prospective IT infrastructure and deliver the appropriate evaluation, ROI, savings, proposed operational evolution and associated process management.\n\nJob Family: SLS\n\nBusiness Unit: VZBIN", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29sdXRpb25zIEFyY2hpdGVjdCIsImNvbXBhbnlfbmFtZSI6IlZlcml6b24iLCJjb21wYW55X21pZCI6Ii9tLzA3X2RuIiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiYmlySjRsRXZ2N1hha1NMQkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXNzQkNvd0JRVTVWWDA1eFUzUlFSVXBtVWsweU9YUjJkMlptU1hGME9UZHpkbk4zUzJGQ1VHZGpXbUZPWlRKNGVFMXpTRkJITnpCRlVra3lSbE10TW5JNWVteENlVFo1U2tKSE4zWTBWVlV0V2xkaFdHUnVVa1JyYlU1Tk4yWTJia0k0UjFGT1FUZHZUM1ZxV0dReFJGQmZlVWczVkcxR1kwZ3plVFp5T0cxVlZ6ZDRUV1JLYjJGSU1EQTFYM00wWWpBU0ZtaFljVU5aVUU5TFIzQkVXSFJCWVZaMk5UZFpSR2NhSWtGUFRWbFNkMEZQVm5SSmFFZFhUSEZpYlVzMGJrSm1OMmxRZFdNM1QxWm9XR2MiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY180MiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL3NnLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvc2VuaW9yLXNvbHV0aW9ucy1hcmNoaXRlY3QtYXQtdmVyaXpvbi0yNTEwOTg1NDI0P3JlZklkPTExZDcyZDZhLWVjNjctNDkyNi05YzhjLWY3NWExZTgyM2U5ZVx1MDAyNnRyYWNraW5nSWQ9UVRSWE04aG10VWdXTVJSczEyM3RpQSUzRCUzRFx1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Alibaba Cloud Intelligence Solutions Architect Singapore", "company_name": "Alibaba Group Holding Limited", "location": "Singapore", "via": "via Neuvoo", "description": "Job Description\nAlibaba Cloud Established In September 2009, Alibaba Cloud (Alibaba Cloud Computing) develops highly scalable cloud computing and data management services providing large and small businesses, financial institutions, governments and other organizations with flexible, cost-effective solutions to their networking and information needs. A business of the Alibaba Group, one of the world’s largest e-commerce companies, Alibaba Cloud operates the network that powers Alibaba’s extensive online and mobile commerce ecosystem, and sells a comprehensive suite of cloud-computing products and services. Background: Solutions Architect (SA) is a key pre-sales technical position in Alibaba Cloud international business division. Our CA’s are experienced cloud architects with comprehensive IT knowledge and industry insight and are, ultimately, the key to success on implementing projects. Solutions Architects are responsible for developing solutions in Alibaba Cloud and helping customers... and partners to develop their applications and services on the Alibaba Cloud platform. Closely work with customers to ensure their cloud architecture is successfully implemented by assisting them in building their applications and services on the Alibaba Cloud platform. - Create and present solution architecture designs to C-level/senior personnel. - Responsible for understanding the unique requirements of customers and partners, and provide appropriate technical cloud solutions and architecture designs based on Alibaba Cloud cloud services. - Provide assistance to Alibaba Cloud customers and partners in migrating their existing IT system onto Alibaba Cloud platforms. This includes providing migration technique support for both applications and databases. - Responsible for demo development and testing Alibaba Cloud services.※Candidate who has ACP(Alibaba Cloud Certification Professional) or ACA(Alibaba Cloud Certification Associate) is preferred.\nJob requirements\n- A background in IT, computer science and/or cloud computing with a good understanding of networking, servers, storage systems, enterprise applications and the cloud. - A minimum of 3 years experience working and consulting on enterprise architecture design and has a strong understanding of customer needs and requirements. Experience working or studying abroad is preferred. - Expert knowledge and understanding of cloud architecture design and familiar with architecture methodology and practice in internet based applications/websites. Must also be familiar with procedures and tools for application migration and cloud/virtualization solutions for enterprise customers. - Experience with Java/PHP/Python/Scala/Go/C++ development, familiar with JDBC, XML, Web Service and design patterns. Experience with Structs, Hibernate, Tomcat or Weblogic server. - Familiar with, and able to setup environments and do testing independently on Redis/MySQL/PostgreSQL/NoSQL DB/Hadoop/Spark... - Excellent writing, proofreading and editing skills. Able to create documentation that can express cloud architectures using text and diagrams. - Able to work under high pressure, a quick learner with a passion for cloud technology. Able to think strategically about businesses, products and technical challenges. - Good communication skills, a good team player and has professional attitude to work - Fluent English is required. 我们鼓励人人践行公益，同学如参与过公益活动，有相关证明，也欢迎附在简历中。参考依据包括但不限于：全国志愿服务信息系统开具的志愿服务证明、“人人3小时”公益平台公益时证书、志愿服务组织（含社会团体、社会服务机构、基金会）授予的志愿服务证明等。\nWork Experience\n五年以上", "extensions": ["7 days ago", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBbGliYWJhIENsb3VkIEludGVsbGlnZW5jZSBTb2x1dGlvbnMgQXJjaGl0ZWN0IFNpbmdhcG9yZSIsImNvbXBhbnlfbmFtZSI6IkFsaWJhYmEgR3JvdXAgSG9sZGluZyBMaW1pdGVkIiwiY29tcGFueV9taWQiOiIvbS8wN3M2Y3RsIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiTzNxc0EzdENPZ20tamJTcEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRW9zQ0Nzd0JRVTVWWDA1eFVtTTBPSE5RYkhZeVNucDBUWFJ2TmtKYVNHcGpiWGRFTkZjeFJWOW1SM0pPVVRKMWMyWXpjbTVVY1RsTFYxZHJibFIxVVZSTGNFVTRNVXhaZUVOeFRIVkVRME5EUzBSVlZGRklabUpGVGpoV2N6aHRObkJmUzNsdFdrTk5kR3QxUWpGRlFWZHRkbUYxV1RWa1owNTFSMDlPYm14d1owaExhakEyTlRaSlZUWkZhMEpJUWkxamJEZEVXV0ZzV2xSWFpXNVplbEJUZEdWa05VZFhWbFZhYzAxdGN5MWxVVXRJUkhBM05UZHVlVFZvY2pOMWVpMXZURGRrVVZwWk1WbEVjWEIwTTNsa0VoWm9XSEZEV1ZCUFMwZHdSRmgwUVdGV2RqVTNXVVJuR2lKQlQwMVpVbmRDT0dSdFUwSnZhSG96VVZsU1FVdzBWell6WTFWcWEyTlNNa2gzIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNTAiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTmV1dm9vIiwibGluayI6Imh0dHBzOi8vc2cubmV1dm9vLmNvbS92aWV3Lz9pZD0zNDk5NDY3YzAzMTJcdTAwMjZ1dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Regional Cloud Solution Architect", "company_name": "Quinnox Solutions Pte. Ltd.", "location": "Singapore (+1 other)", "via": "via Monster", "description": "The Responsibilities\n• Responsible for technical exchanges and key customer opportunity insights during the pre-sales phase of key customers;\n• Based on client's cloud product and solution capabilities, responsible for demand analysis, solution design, POC verification, and traditional IT cloud solution design for public cloud projects;\n• Responsible for the migration and online delivery of public cloud products and solutions; participate in and guarantee the delivery of major projects;\n• Collaborate with sales (BD), R&D, SRE and other teams to ensure the continuous operation of key customers;\n• Combine the characteristics of the region and the industry in which it is located, provide universal demand input for products and solutions, and support competitiveness;\n\nThe Requirements\n• Minimum 3 years of relevant experience, preferably with strong experience in AWS, Azure, Google Cloud, or Alibaba Cloud.\n• APAC Regional experience will be preferred\n• Be familiar with the functions... principles, and architecture of one or more domains of the public cloud or private cloud. Basic programming knowledge or development experience is preferred.\n• Have experience in on- and off-cloud migration methods and processes. Complete project experience is preferred.\n• Experience in providing public cloud solutions for one or more industries, such as finance, Internet (game and video), manufacturing, energy, education, healthcare, and government, is preferred.\n• Experience in planning, implementation, and O&M of virtualization and cloudification projects of IT departments in related industries is preferred.\n\nSkills\n• Be able to support projects and communicate with customers about technical solutions.\n• Have relevant experience in cloud business and IT in a certain industry.\n• Strong technical background and good understanding of cloud, data, platforms, and technologies\n\nTo Apply:\n\n· Please send your latest CV to [Confidential Information]\n\n· Kindly indicate your availability, current and expected remuneration package.\n\n· Due to the pandemic, our client will only consider locally available candidates. We regret only shortlisted candidates would be notified.\n\n· For more job opportunities, please visit our career page:\n\n· Quinnox Solutions Pte Ltd (License Number: 06C3126)\n\n· Registered EA Personnel (Reg. No.:R1981977", "extensions": ["23 days ago", "Full–time"], "detected_extensions": {"posted_at": "23 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJSZWdpb25hbCBDbG91ZCBTb2x1dGlvbiBBcmNoaXRlY3QiLCJjb21wYW55X25hbWUiOiJRdWlubm94IFNvbHV0aW9ucyBQdGUuIEx0ZC4iLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IlRjMk1FVTZZdHFKbjhLZXFBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTW9uc3RlciIsImxpbmsiOiJodHRwczovL3d3dy5tb25zdGVyLmNvbS5zZy9hbXAvam9iLXZhY2FuY3ktcmVnaW9uYWwtY2xvdWQtc29sdXRpb24tYXJjaGl0ZWN0LXF1aW5ub3gtc29sdXRpb25zLXB0ZS1sdGQtc2luZ2Fwb3JlLTI3NTM4MTg5Lmh0bWw/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Solution Architect | Financial Services | Digital Banking (BB-A1CD4)", "company_name": "Publicis Sapient", "location": "Singapore", "via": "via BeBee", "description": "Publicis Sapient is looking for a results-driven Solution Architect with a specialization in cloud-native computing platform consulting, design, and delivery experience to deliver & support digital business transformation in Financial Services. You will provide technical consultancy from pre-sales to project delivery, including systems architecture, translation of business requirements and software platform guidance. You’ll assess, identify and implement disruptive technology applications that will take established companies into the future. Your ImpactLead the architecture definition and technical consultation of digital transformation programsWork with different technology vendors to build a best of breed technology architectureCollaborate with business development and client engagement teams to assist in pre-sales opportunities like RFP responses, proposal delivery, architecture assessments and technical qualificationsAdvise our clients and partners to optimize the recommended... product suite in defining, building and deploying end to end solutionsLead the translation of the client’s business requirements into systems designDrive the development of prototypes and technology demonstrators within microservice architecture, cloud-native solutionsEstimate time frames, quality and quantity of resources required to successfully implement projects and help develop project plans and risk assessmentEstablish measurable criteria concerning deliverability, performance, maintenance, design and costsQualificationsYour Skills & Experience7+ years of technical experience within architecture development, integration of backend systems and developmentIn-depth knowledge of integration approaches and architecturesDeep understanding of the cloud-native solution, microservices-architecture and at least one or more of the following areas: API orchestration architecture, mobile-front end architecture, customer engagement architectureAbility to bridge the gap between technology and businessSelf-driven, curious and a fast-learner, and able to take responsibility for personal growth and developmentPossess strong problem-solving skills and ability to prioritize and manage multiple tasksStrong interpersonal and stakeholder management skills with the ability to coordinate between technical and business teamsKnowledge of backend technologies – Node.JS, Java, SQL, or NoSQL, Spring boot, Kafka, Spark, KongRelevant experience in systems integration and development, package analysis and implementationExperience designing cloud solutions - IaaS / PaaS offerings (e.g. AWS, Google Cloud, Microsoft Azure)Excellent collaborator, working in fully agile product or software delivery teams regionallyExcellent written and verbal communication skills, as well as presentation skillsBachelor’s Degree in Computer Science (or related field)Set Yourself Apart WithIn-depth knowledge of digital banking architectures and architecture approachesExperience with at least one digital banking implementation or comes from the digital or architecture function of a bank or digital bankLearning mindset with developer or architect certification is a plusConsulting experience and a passion for technology", "extensions": ["20 hours ago", "Full–time"], "detected_extensions": {"posted_at": "20 hours ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2x1dGlvbiBBcmNoaXRlY3QgfCBGaW5hbmNpYWwgU2VydmljZXMgfCBEaWdpdGFsIEJhbmtpbmcgKEJCLUExQ0Q0KSIsImNvbXBhbnlfbmFtZSI6IlB1YmxpY2lzIFNhcGllbnQiLCJjb21wYW55X21pZCI6Ii9tLzAybXlqcCIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjNUYzBLaGZldmxTU3QwTjJBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2WUJDcmNCUVU1VlgwNXhValpHZGxKNmRWWlRURkpHT1ZoaWRqVkVlRmRTWVhwbFdraGZiVTlST0VWR1NVVnljblJzVldKV1ZYQnlOV3RYYTBsWVh6QnBVVmd0WVc0emJISlRkWFEyVkcxc01rd3lSbU5wV0hkSmRXWnpSbVZhYUcxT2RWTm1ZMFJsUlVoVVFqaExWMmhJZUVoSFJUUkdhbXc1VFhkU2FYaG9TRXB6TlVKWWFXTkxNRk42UjBGR2NYcEdlR1JmZUd0dGF6QkRSRXhCVTJZelFVOHpYMUZEWWpGSVNGaEZaM1pFY3paWWNuWlVNbUoxWVhWbkVoWm9XSEZEV1ZCUFMwZHdSRmgwUVdGV2RqVTNXVVJuR2lKQlQwMVpVbmREZFVkaWRubE1iR0oxWjBKWVZrRkRORFZFTVhWemVWaDZWbE4zIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNjIiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQmVCZWUiLCJsaW5rIjoiaHR0cHM6Ly9zZy5iZWJlZS5jb20vam9iLzIwMjEwNDIyLWZlNjMxYzY2ODQwODQyY2Q2ZDc1ZWI5YWYwMGExY2Q0P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}], "chips": [{"type": "Title", "param": "job_family_1", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Solution architect", "value": "solution architect"}, {"text": "Solutions architect", "value": "solutions architect"}, {"text": "Architect", "value": "architect"}, {"text": "Cloud architect", "value": "cloud architect"}, {"text": "Technical architect", "value": "technical architect"}, {"text": "Enterprise architect", "value": "enterprise architect"}, {"text": "Senior", "value": "senior"}, {"text": "Consultant", "value": "consultant"}, {"text": "Financial services", "value": "financial services"}, {"text": "Infrastructure architect", "value": "infrastructure architect"}, {"text": "Manager", "value": "manager"}, {"text": "Application architect", "value": "application architect"}, {"text": "Cloud engineer", "value": "cloud engineer"}, {"text": "It architect", "value": "it architect"}, {"text": "Lead architect", "value": "lead architect"}, {"text": "Network architect", "value": "network architect"}, {"text": "Security architect", "value": "security architect"}, {"text": "Senior architect", "value": "senior architect"}, {"text": "Systems engineer", "value": "systems engineer"}, {"text": "Associate director", "value": "associate director"}, {"text": "Deputy", "value": "deputy"}, {"text": "Engineers", "value": "engineers"}, {"text": "Head", "value": "head"}, {"text": "Infrastructure", "value": "infrastructure"}, {"text": "Lab", "value": "lab"}, {"text": "Network engineer", "value": "network engineer"}, {"text": "Presales consultant", "value": "presales consultant"}, {"text": "Public sector", "value": "public sector"}, {"text": "Senior analyst", "value": "senior analyst"}, {"text": "Senior consultant", "value": "senior consultant"}, {"text": "Senior director", "value": "senior director"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Software architect", "value": "software architect"}, {"text": "Solution consultant", "value": "solution consultant"}, {"text": "System architect", "value": "system architect"}, {"text": "System engineer", "value": "system engineer"}, {"text": "Systems analyst", "value": "systems analyst"}, {"text": "Systems architect", "value": "systems architect"}, {"text": "Technical trainer", "value": "technical trainer"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Accounting", "value": "/business/naics2007/5412"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Management", "value": "/business/naics2007/55"}, {"text": "Real Estate", "value": "/business/naics2007/53"}, {"text": "Wholesale", "value": "/business/naics2007/42"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Amazon", "value": "/m/0mgkg"}, {"text": "Microsoft", "value": "/m/04sv4"}, {"text": "EPAM Systems", "value": "/m/0dlnrc"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "IBM", "value": "/m/03sc8"}, {"text": "Salesforce", "value": "/m/07btr5"}, {"text": "EY", "value": "/m/0g9jc"}, {"text": "Publicis Sapient", "value": "/m/02myjp"}, {"text": "Randstad", "value": "/m/08pt1z"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Alibaba Group Holding Limited", "value": "/m/07s6ctl"}, {"text": "Avanade", "value": "/m/094456"}, {"text": "Capgemini", "value": "/m/03vlk0"}, {"text": "Comtel Solutions Pte Ltd", "value": "/g/11dxpztgnb"}, {"text": "DELL", "value": "/g/11c54ch2jm"}, {"text": "Ericsson", "value": "/m/02kyh"}, {"text": "HTZ Resources", "value": "/g/11h21p9b4d"}, {"text": "Infinite Computer Solutions Pte Ltd", "value": "/g/11g9mj72yz"}, {"text": "Michael Page", "value": "/m/04cxldw"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "Orange Business Services", "value": "/m/08zvyz"}, {"text": "Recruitment Hub Asia Pte Ltd", "value": "/g/11dxpww_0f"}, {"text": "TEKsystems (Allegis Group Singapore Pte Ltd)", "value": "/g/11b6g4bkv0"}, {"text": "Talent Trader Group Pte Ltd", "value": "/g/11dxpmlc5b"}, {"text": "Tata Consultancy Services", "value": "/m/01psx8"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "VMware", "value": "/m/01t9k5"}, {"text": "Verizon", "value": "/m/07_dn"}, {"text": "A-Speed Infotech Pte Ltd", "value": "/g/11g9mxswl4"}, {"text": "ABeam Consulting", "value": "/g/11bc6whr_f"}, {"text": "Amazon Web Services (AWS)", "value": "/g/11dxprr2xv"}, {"text": "Amazon Web Services Singapore", "value": "/m/0rznzt1"}, {"text": "Aon", "value": "/m/0z7n"}, {"text": "Avaya", "value": "/m/01sqlk"}, {"text": "Azendian Solutions Pte Ltd", "value": "/g/11dxpvcjj2"}, {"text": "Big Cloud", "value": "/g/11c743lwsr"}]}]}