{"search_metadata": {"id": "608279163bea7b22d9f57c72", "status": "Success", "json_endpoint": "https://serpapi.com/searches/f668d1b25e789f69/608279163bea7b22d9f57c72.json", "created_at": "2021-04-23 07:36:54 UTC", "processed_at": "2021-04-23 07:36:54 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28programmer%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=20", "raw_html_file": "https://serpapi.com/searches/f668d1b25e789f69/608279163bea7b22d9f57c72.html", "total_time_taken": 1.57}, "search_parameters": {"q": "(programmer) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "20"}, "jobs_results": [{"title": "Senior Software Engineer, Chat Platform", "company_name": "Zendesk", "location": "Singapore (+1 other)", "via": "via Bayt.com", "description": "Job Description\n\nZendesk is looking for a Senior Software Engineer to join the Chat Platform team. The team focuses on delivering the best experience for our largest customers and experimenting with opportunities for accelerated growth. Zendesk’s customer base is growing fast and you will be able to make meaningful contributions to a product that is used by millions of people every day.\n\nThe Chat Platform team works with a high degree of autonomy and achieves high velocity by combining designers, test engineers, product managers, and software engineers collaborating together.\n\nSenior Software Engineers at Zendesk are expected to be hands-on technologists who can contribute to application development directly, contribute to the design and implementation of projects, and be involved in technical discussions beyond their teams. You should love finding elegant solutions to complex problems, and care about not only the technical and algorithmic aspects of large systems but the way they... enable other developers to do their jobs. Previous experience with web infrastructure, distributed systems, or component-oriented software engineering is a strong plus.\n\nWhat you’ll be doing\n• Work on a Chat platform backend serving millions of users daily.\n• Guide the team on technical design discussions and propose innovative solutions on backend components.\n• Ensure scalability, performance, maintainability, and security of the technical platform in collaboration with SRE teams.\n• Build POCs to test candidate technologies and make informed decisions.\n• Collaborate closely with the Product Manager, the Team Lead, and the Tech Lead to provide technical insights and early estimates on upcoming projects.\n• Educate other developers through pairing sessions, and code reviews.\n• Become a key contributor to better working practices across Zendesk.\n\nWhat you bring to the role\n• Required:\n• You have delivered enterprise-grade software as part of a cloud-based company or business unit.\n• You are independent, self-motivated, and a good team player at the same time.\n• You have reasonable communication skills: able to explain a technical concept in an accurate and understandable way.\n• You put the customer first and respect your commitment to deliver.\n• Preferred:\n• You have hands-on experience with or knowledge of developing event-driven microservices using technologies similar to Apache Kafka.\n• You have hands-on experience with or knowledge of AWS distributed services.\n• You have personal projects, collaboration with open-source communities, or active learning initiatives to showcase your passion for technology.\n\nTech Stack\n• Java, Javascript, Python\n• Redis, Mysql, AWS Aurora\n• Apache Kafka\n• Docker, Kubernetes\n\nZendesk builds software for better customer relationships. It empowers organizations to improve customer engagement and better understand their customers. Zendesk products are easy to use and implement. They give organizations the flexibility to move quickly, focus on innovation, and scale with their growth.\n\nMore than 150,000 paid customer accounts in over 150 countries and territories use Zendesk products. Based in San Francisco, Zendesk has operations in the United States, Europe, Asia, Australia, and South America.\n\nInterested in knowing what we do in the community? Check out the Zendesk Neighbor Foundation to learn more about how we engage with, and provide support to, our local communities.\n\nZendesk is an equal opportunity employer, and we’re proud of our ongoing efforts to foster global diversity, equity, & inclusion in the workplace. Individuals seeking employment at Zendesk are considered without regard to race, color, religion, national origin, age, sex, gender, gender identity, gender expression, sexual orientation, marital status, medical condition, ancestry, physical or mental disability, military or veteran status, or any other characteristic protected by applicable law.\n\nBy submitting your application, you agree that Zendesk may collect your personal data for recruiting, global organization planning, and related purposes. Zendesk's Candidate Privacy Notice explains what personal information Zendesk may process, where Zendesk may process your personal information, its purposes for processing your personal information, and the rights you can exercise over Zendesk’s use of your personal information", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgRW5naW5lZXIsIENoYXQgUGxhdGZvcm0iLCJjb21wYW55X25hbWUiOiJaZW5kZXNrIiwiY29tcGFueV9taWQiOiIvbS8wd2ttNHBsIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiMTZ0OTFHazloOHduV2pHVUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFZDMUlUbFI1Y2twMFlUaHZhblJ0ZDNaRE9GRXhia3BmYmtwemJYVkhkelF6VVhwUGQxbzRRWFJyVkROcWVtNWhVSFZxVVRkdVNreGpjUzB4U1dWdVdXaFNNR05UWVhSVVZqSjVNMjFOZVV4bE5XNWpaM1ZhU1RaMWNXVmlkblU0VG5kdWFIcE9MVlZpUTJNdGNuSXlTMGh5U1RsdFZUQnFVbmRTVkcxU1VrTnFOR1owUkZwdFpsRlJRMmMwU1VrMVFsaDZUV1pwTVRaeWNGUkJFaFpHYm0xRFdVcFFTVXgwVEZkMFVXRktjbUp5YjBSbkdpSkJUMDFaVW5kQk9UbHNZMFpDTUVaQ1EydHhiRFJ1ZWpOa1YwSnhUVU0xYlRKQiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzciLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQmF5dC5jb20iLCJsaW5rIjoiaHR0cHM6Ly93d3cuYmF5dC5jb20vZW4vc2luZ2Fwb3JlL2pvYnMvc2VuaW9yLXNvZnR3YXJlLWVuZ2luZWVyLWNoYXQtcGxhdGZvcm0tNTk1NTY5NDUvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Application Support and Developer, Group Consumer Banking – (WD17775)", "company_name": "DBS Bank Limited", "location": "Singapore", "via": "via Jobs Guide Hub", "description": "Application Support and Developer, Group Consumer Banking – (WD17775) Jobs in Singapore at DBS Bank Limited\n\nTitle: Application Support and Developer, Group Consumer Banking – (WD17775)\n\nCompany: DBS Bank Limited\n\nLocation: Singapore\n\nType: Full-Time\n\nCategory:\n\nApplication Support and Developer, Group Consumer Banking and Big Data Analytics Technology, Technology and Operations\n\nBusiness Function\n\nGroup Technology and Operations (T&O) enables and empowers the bank with an efficient, nimble and resilient infrastructure through a strategic focus on productivity, quality & control, technology, people capability and innovation. In Group T&O, we manage the majority of the Bank’s operational processes and inspire to delight our business partners through our multiple banking delivery channels.\n\nResponsibilities\n\nTo implement and support DBS Trading platform\n\nPlan, co-ordinate and liaise with users, vendor and the development team on system requirements gathering, documentation and... creating/performing user acceptance tests for successful system implementation\n\nDesign, develop and deploy applications for new business requirements\n\nProvide operational support/troubleshooting for applications and their on-going maintenance\n\nRequirements\n\nExperience in managing medium to large scale application project from beginning to end, with skills in requirement study and functional/detail design, QA, testing, and software change/version control management is advantageous\n\nTechnical knowledge on Webservice (REST/SOAP), Openshift, Postgres, Apache Ignite, AWS, AWS EKS (Amazon Elastic Kubernetes Services), GIT, Jenkins is a must\n\nCertified in AWS\n\nGood hands-on knowledge of Source Code Management tools like Git/GitLab and Subversion, including branching strategies.\n\nGood understanding of DevOps key concepts like cross-team collaboration, automate everything, CI/CD, continuous monitoring, continuous feedback\n\nStrong vendor management and technical skills\n\nBasic Financial product knowledge in equities products\n\nFamiliarity with trade processing/settlement experience is advantageous\n\nAgile practice experience is a must\n\nStrong analytical and problem-solving skill\n\nAbility to work under pressure, handle multiple tasks and work to tight deadlines\n\nHigh sense of ownership of task assigned, deliver applications with high quality and efficiency\n\nGood communication, inter-personnel skills is required\n\nTeam player with strong interpersonal and communications skills\n\nAt least 5 years of working experience in application development and support, preferably in banking environments\n\nA Bachelor’s degree in Computer Science (or equivalent experience)\n\nApply Now\n\nWe offer a competitive salary and benefits package and the professional advantages of a dynamic environment that supports your development and recognises your achievements", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBcHBsaWNhdGlvbiBTdXBwb3J0IGFuZCBEZXZlbG9wZXIsIEdyb3VwIENvbnN1bWVyIEJhbmtpbmcg4oCTIChXRDE3Nzc1KSIsImNvbXBhbnlfbmFtZSI6IkRCUyBCYW5rIExpbWl0ZWQiLCJjb21wYW55X21pZCI6Ii9tLzAxcTduNSIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjhVRWdFVVJKdG5IeW1aVzlBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2WUJDcmNCUVU1VlgwNXhVakZxVVhZNWRIQnFNbkZ5TkdGRWNVZERaWGhCWTNWcVNFRm9YMGx1TkVGU2RreE5TVWRGZEdadFJISXlRa1k0YzFwWFgzUTJka0pPWkdsRVZrUXhTMkYwTW05VlkxRnhaMlpJVm1Ka09VaHBWWEozVWxKeVFsOHRWRVJJYnpKd1l6VXhVRlJ0WW5GMlVXWk5hMEZFYTNsaFdEUTVMVFZ6VERaUk9YaFhVemhzWVU0NE4wRjFhMk5pWWpGVFgyNTFRbXM1WmtSbWNWSkhSMDV4ZVdGMWVYazRaMUptZFhKNk5UTnBhVFp5ZW5OQkVoWkdibTFEV1VwUVNVeDBURmQwVVdGS2NtSnliMFJuR2lKQlQwMVpVbmRFVkRJd1JUSmFhRlZRYm1sdk9FVkhNVEZOVlMxdVozQnBiVWgzIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMTUiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9icyBHdWlkZSBIdWIiLCJsaW5rIjoiaHR0cHM6Ly9qb2JzZ3VpZGVodWIuY29tL2pvYi9hcHBsaWNhdGlvbi1zdXBwb3J0LWFuZC1kZXZlbG9wZXItZ3JvdXAtY29uc3VtZXItYmFua2luZy13ZDE3Nzc1LTIvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Software Engineer (Embedded Operating System)", "company_name": "Wsh experts Pte Ltd", "location": "Singapore (+1 other)", "via": "via Jobs", "description": "Job Description :Job Description & Requirements Job Scopes:- Requirements gathering; Design, development and maintenance of the software; Preparation and submission of deliverables throughout the software development lifecycles such as Business Rules, Software Requirement Specifications, Software Architecture Document, Design Specification, Interface Specifications, Source Codes, Testing Specification, Operation and Maintenance Manual, Training Manual and others documents as required in the standard adopted by the Authority; Assist the Authority with day-to-day application support issues; and Liaise with users on the requirement, design and testing issues. Job Requirements:- Degree in Electrical / Electronics / Computer Engineering or a relevant discipline; At least 5 years' experience in C++, Java programming language in Windows, RTOS systems and multi-tasking OS environment; At least 2 years' experience working in embedded systems, NFC, RFID or smart card technology; Experience in... NFC standards, NFC application development and a broad view of software testing methods; Experience and skilled in embedded firmware development and debugging; Familiar with I2S, SPI, serial communication, interrupt handling and hardware trouble shooting; Knowledge on software security and cryptography; Knowledge on Visa, MasterCard and EMV certification; Knowledge of SDLC with RUP or Agile methodology; Experience in developing test solutions, profiling and visualization of automated test results", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciAoRW1iZWRkZWQgT3BlcmF0aW5nIFN5c3RlbSkiLCJjb21wYW55X25hbWUiOiJXc2ggZXhwZXJ0cyBQdGUgTHRkIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJNNlVzZ2Z2N2ZBTVM2TUlwQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnMiLCJsaW5rIjoiaHR0cHM6Ly9zZy5maWRhbnRvLmNvbS9qb2JzL2pvYi1vcGVuaW5nL2NvbXB1dGVyLW9jY3VwYXRpb25zLWFsbC1vdGhlci9zb2Z0d2FyZS1lbmdpbmVlci1lbWJlZGRlZC1vcGVyYXRpbmctc3lzdGVtLTI3Nzg0MjM2MD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Programmer Analyst 5-it", "company_name": "Techgig", "location": "Singapore", "via": "via Mendeley", "description": "About Job\n\nCTC Undisclosed Job Location Singapore Experience 10 - 13 yrs\n\nDescription\n\nThe Fusion Program Director will report to Director, Fusion Migration to the Oracle Public Cloud (OPC) program, and will be responsible for driving multiple initiatives, programs, and projects at the same time to successful completion. Specific responsibilities:\n\nManage programs and projects simultaneously to successful completion.\nAgile Release Train (ART) Release Train Engineer (RTE): Be a servant leader and coach for the Agile Release Train (ART)\nFacilitate the ART events and processes\nAssist the teams in delivering value\nFacilitate removal of impediments to help the ART and the teams to deliver business values via committed PI objectives\nEngage and communicate with OAL and business stakeholders, help manage risk, and drive relentless improvement\nSynchronize within the ART and across other ARTs\n\nWork closely with OAL development teams, ATG, product development, and other stakeholders to mitigate... risks, resolve issues, and remove impediments\nTrack and communicate program, project, and ART metrics and risks/issues\n\nQualifications:\n\nMinimum of 10 years of experience in software product development or IT program and project management\n\nMinimum of 10 years of experience as a scrum master, program or project manager, or development lead\nSAFe knowledge or implementation experience is a plus\n\nDemonstrated leadership and people management skills\nPossess strong communication and analytical skills and a thorough understanding of product development and product management\nExcellent interpersonal skills, good with people, ability to negotiate\nKnowledge on product management, software development, DevOps, CICD, and Agile methodologies\n\nTools:\n\nAtlassian JIRA, Confluence or other Agile project management tools\n\nEducation, certification, & training experience:\n\nBS degree required; MS, MIS, or MBA is a plus\nPMI PMP, SAFe Agilest, and Certified Scrum Master are ideal\n\nDetailed Description and Job Requirements\n\nWork with Oracle's world class technology to develop, implement, and support Oracle's global infrastructure", "extensions": ["2 days ago", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9ncmFtbWVyIEFuYWx5c3QgNS1pdCIsImNvbXBhbnlfbmFtZSI6IlRlY2hnaWciLCJjb21wYW55X21pZCI6Ii9nLzExYzczZnhnd3QiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJESkM3a2VrUFozODVreVBqQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VVZFMFQxQjNiUzFFUVY5TlUwSjJkMGxpY1dGT1RVRktTMGhZY2tsWFV6VlFVblF3VVZWdWRVaFZPV1owZURsUk5rVm5NR3d4UkRCVVN6SnRSMUZXVVRrdGIycHZNek4wVkd0VFRtcEVkVWxEWkROaFJWUjRWR2xMUjNwYVFsVkJkRXRQWWpOS1dtSTFUbGxQWWxaRVN6RlRjRXhJV25wd05ETTRla1U1TUVwbFFtSmlkVUpWV1MxeGFHd3dPRU5VWkVsSU1WOXpNbTUwZWpKQkVoWkdibTFEV1VwUVNVeDBURmQwVVdGS2NtSnliMFJuR2lKQlQwMVpVbmRCU25adGRtTmZTMUZuWDFjd1VHcEJXWFZyVlc1R00xRlZjWEZCIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMjYiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTWVuZGVsZXkiLCJsaW5rIjoiaHR0cHM6Ly93d3cubWVuZGVsZXkuY29tL2NhcmVlcnMvam9iL3Byb2dyYW1tZXItYW5hbHlzdC01LWl0LTMzNDQzMzM/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "SoC Software Engineer (Malaysia)", "company_name": "Realtek Malaysia", "location": "Singapore", "via": "via Neuvoo", "description": "Job Description\n\nSoC Software Engineer - KL , Malaysia\n\nJob Descriptions\n\n1、Develop APK to meet customer's requirement\n\n2、Handle Live TV and country logo related issues for different countries\n\n3、Handle HDMI CEC, ARC, and compliance test related issues\n\n4、Handle media player related issues\n\n5、Debug Google certification related issues(CTS, GTS, VTS…)\n\n6、Debug OTT certification related issues(Netflix, Youtube, Amazon)\n\n7、Develop TV middleware\n\n8、Support customer factory request and manufacture related issues\n\nJob Requirements\n\n1、Familiar with C/C++, Java programming language\n\n2、Experience on TV, Set-top box, Smart phone, multimedia player products.\n\n3、Better having experience with: Linux kernel driver porting or development、Android APK development、TV related experience(ATSC 1.0/ATSC 3.0/DVB/ISDB)、Android framework (TIF/HAL/HIDL)、Media playback、HDMI CEC/ARC、Android certification debug experience(CTS/GTS/VTS)、OTT certification experience(Netflix/Youtube/Amazon)、Wifi(WOWL)、Middleware... (Ginga/FreeviewHD/HbbTV/CI+/SI)、ATV(NTSC, PAL, SECAM)、Subtitle(CC, TT)、System debug skill(Memory leak, Memory trash, Performance analysis).\n\n4、Work Location: KL Area, Malaysia.\n\nRealtek Malaysia officially opened in June 2020, located in the KL City area, and is a wholly owned subsidiary of Realtek Semiconductor Corp. from Hsinchu, Taiwan. Realtek founded in 1987, and has a track record of delivering uninterrupted profitable growth every year since its inception. We aims to attract top R&D talents in Malaysia and the greater Southeast Asia. We efforts to provide the ultimate in pioneering Multimedia IC technology", "extensions": ["4 days ago", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb0MgU29mdHdhcmUgRW5naW5lZXIgKE1hbGF5c2lhKSIsImNvbXBhbnlfbmFtZSI6IlJlYWx0ZWsgTWFsYXlzaWEiLCJjb21wYW55X21pZCI6Ii9tLzA1d3JtNyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjZXOFNKRERJam5WLVR2NlhBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2WUJDcmNCUVU1VlgwNXhVV3RqV2tWWlUydEtlVmRSTWxrMlpUbHVSRW96YlhGUk16WTVhR1p2UkVKTGJFcHRObTVWU1U5d2JYUnJhRFZJU0dSc1ZFWkNjVmgxZVZKRlREZzVVWGMzVldkWFptMUtkemx4Y0dONVZtOU9UM1o1YkVReFZWbEJlVVpoYTBnelNubDNaRU5tZW5NMWFUSnZNMll5YlhkdFpuRnRhMEZ3YVU5elRsWTNlRVJPTmxwVlpIbHRibEpSY1ZwRVExOTZSVWR6WDBWclptbHlRMDh6WDA0M1FrdE5jM1YwTlZOMldETkRSVE5MVVRnNEVoWkdibTFEV1VwUVNVeDBURmQwVVdGS2NtSnliMFJuR2lKQlQwMVpVbmRDT1RGVlREUjBTelYwYlRCblkxSlFXRFZNVjFaRE1HNTFOVEJCIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMzQiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTmV1dm9vIiwibGluayI6Imh0dHBzOi8vc2cubmV1dm9vLmNvbS92aWV3Lz9pZD0yMGIzYzk2ZTdhOWNcdTAwMjZ1dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Programmer Analyst", "company_name": "AVENSYS CONSULTING PTE. LTD.", "location": "Singapore (+1 other)", "via": "via LinkedIn", "description": "Avensys is a reputed global IT professional services company headquartered in Singapore. Our service spectrum includes enterprise solution consulting, business intelligence, business process automation and managed services. Given our decade of success we have evolved to become one of the top trusted providers in Singapore and service a client base across banking and financial services, insurance, information technology, healthcare, retail and supply chain.\n\nWe are currently looking to hire Technical Architect (Window 10) who has proven track record in IT Industry. This is an exciting opportunity to expand your skill set, achieve job satisfaction and work-life balance. More details as below.\n\nResponsibilities\n• Translate application requirements and use cases into functional applications\n• Design, build, and maintain efficient, reusable, and reliable Java code\n• Ensure the best possible performance, quality, and responsiveness of the applications\n• Identify bottlenecks and bugs, and... devise solutions to these problems\n• Help maintain code quality, organization, and automatization\n\nSkillset\n• 3 years demonstrated advanced proficiency in development methodologies.\n• Proficiency in J2EE, J2SE, EJB, Java Servlets, Java Beans, JMS, JNDI, ANT and Apache Maven.\n• Proficient with Core Java concepts such as OOP concepts\n• In-depth knowledge of HTML, JavaScript including frameworks such as JSON , JQuery, and CSS.\n• Experience with setup and management of large scale application servers.\n• Experience in implementing WOGAA and IM8 Standards\n• Experience with databases such as Oracle Database PL/SQL, Microsoft SQL Server, DB2Self-management and strong organization skills.\n• Experience in Amazon Web Service (AWS) environment. Having AWS certification would be advantage.\n• Experience in CI/CD process. Having knowledge about Bitbucket, Bamboo, Maven and JUnit would be advantage.\n• Proven track record to work to strict client deadlines.\n• Excellent presentation and communication skills (to both technical and non-technical audiences, written and verbal)\n\nWhat’s On Offer\n\nYou will be remunerated with an excellent base salary and entitled to attractive company benefits. Additionally, you will get the opportunity to enjoy a fun and collaborative work environment, alongside a strong career progression\n\nTo submit your application, please apply online or email your UPDATED CV in Microsoft Word format to ******** Your interest will be treated with strict confidentiality.\n\nConsultant Details\n\nConsultant Name : Shilpa Benkin\n\nAvensys Consulting Pte Ltd\nEA Licence 12C5759\n\nPrivacy Statement: Data collected will be used for recruitment purposes only. Personal data provided will be used strictly in accordance with the relevant data protection law and Avensys' privacy policy.\n\nJob originally posted on GrabJobs. If you need to report this job please contact GrabJobs", "extensions": ["2 days ago", "Internship"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Internship"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9ncmFtbWVyIEFuYWx5c3QiLCJjb21wYW55X25hbWUiOiJBVkVOU1lTIENPTlNVTFRJTkcgUFRFLiBMVEQuIiwiY29tcGFueV9taWQiOiIvZy8xMWc3MDIyZ2pmIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoia0RhX1RYZ0hoVk1ybE9vZ0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRW9zQ0Nzd0JRVTVWWDA1eFVWTm5hMUZMYjBneVZuWTRXV1ZHZEVOVU9YTmtiRXRoYlV0bk1FWTFkMGxZWkhkSldXNXljM0ZHY0RaNVFXeFNTR2xKTFVock5FWnFUSEk0YzNSRFZWSkpkbkZSUlZkd1pWaHNZbEJHTVMxR1gybFdMVTlYVWtSeVFYSktkVU5WWVRsTVRHbHJkVjloUm5FM1EzUnhhM04xTlVkR09UQnlWM0I2WldweVoyMURjVWt4VG5sZlpVdG5TazVrUm0xdlFYQmlRelV6YlZjdE4wdE1kVmhaV0ZnMmNFSmlNM3BEUjFaVFVVcDRhR3BGVGt4aFUwY3pVblJyUWxaemRuQlBWR3hKYkhsQkVoWkdibTFEV1VwUVNVeDBURmQwVVdGS2NtSnliMFJuR2lKQlQwMVpVbmREWkhkU2VHOW1hVVpNWm01Q2QwNU1kbEY0Y2tsS1dGSm9RbDluIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNDIiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGlua2VkSW4iLCJsaW5rIjoiaHR0cHM6Ly9zZy5saW5rZWRpbi5jb20vam9icy92aWV3L3Byb2dyYW1tZXItYW5hbHlzdC1hdC1hdmVuc3lzLWNvbnN1bHRpbmctcHRlLWx0ZC0yNTE0NDYxMzUyP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "CNC Programmer​/Mastercam, CAD​/CAM", "company_name": "GOODMAN EMPLOYMENT AGENCY", "location": "Singapore", "via": "via Learn4Good", "description": "Roles &\n\nResponsibilities\n\nCNC Programmer (Mastercam, CAD/CAM)\n\nJob Description· Develop efficient CNC Program for Milling and Turning using Mastercam, CAD/CAM, Solid\n\nCAM.· Monitor and improve production cycle time and cost.· Design simple Tools and Fixtures to support production process.· Provide technical support to production department..\n\nRequirements· Diploma or Technical Vocation Certification or related field.· Minimum 3 years of relevant working experience in precision engineering manufacturing environment.· Candidate having lower academic qualification with more than 10 years of relevant experience will be considered.· Familiar with CAD software like Solidworks & UG is an advantage.\n\n· Ability to muti-task.· Strong team player and able to work independently. We provide:· Clean and air-conditioned workplace· Attractive remuneration and other Incentives- 5 days work week Remark:\n\nWork location:\n\nTuas Area (Transport Pickup at Boon Lay MRT)\n\nTell employers what skills you... have\n\nCADCNCJob Descriptions\n\nMastercam\n\nMulti Tasking\n\nProduction\n\nTeam Workdesignedefficient\n\nSolid\n\nCAM", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDTkMgUHJvZ3JhbW1lcuKAiy9NYXN0ZXJjYW0sIENBROKAiy9DQU0iLCJjb21wYW55X25hbWUiOiJHT09ETUFOIEVNUExPWU1FTlQgQUdFTkNZIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJUSTd0cHlsXzQwbXA3OHBaQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExlYXJuNEdvb2QiLCJsaW5rIjoiaHR0cHM6Ly93d3cubGVhcm40Z29vZC5jb20vam9icy9zaW5nYXBvcmUvc29mdHdhcmVfZGV2ZWxvcG1lbnQvMjcxMzE0ODM2L2UvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Software Engineer (TO-8A7FC)", "company_name": "BitTitan", "location": "Singapore (+1 other)", "via": "via Jobs Trabajo.org", "description": "Quick overview: As a Software Engineer on the MigrationWiz team, you will work as part of a collaborative team with a focus on constant learning and improvement. Our team strives to be cross-functional and there are opportunities to extend your impact and knowledge into new areas. We appreciate engineers who have great ideas to share and the desire to help us on the path to making those ideas a reality. You will help take our industry-leading migration solution to the next level in terms of performance and scalability while implementing new features requested by our large customer base. In this job, you will: Design and implement high-quality and highly scalable code Utilize technologies such as .NET, SQL Server, CosmosDB, Redis and Azure Maintain a high standard of quality by authoring tests; review change requests to identify potential improvements and to prevent errors Own the product features from design to deployment, including monitoring and maintenance Collaborate with the... Product team to synchronize and ensure delivery Provide technical expertise to propose and enable new initiatives such as new technologies, processes or improvements to the product We would love to speak with you if you have: 4+ years experience in software engineering Strong skills in at least one strongly typed, object-oriented programming language such as C#, Java, or C++ Proven ability to design and ship high-quality, scalable SaaS solutions Ability to troubleshoot and solve problems in proactive, optimal and efficient way Precise communication skills A passion for pushing new ideas and features forward Ability to read and communicate effectively in English Understanding of Product Domain and value proposition of the offering Extras that will give you an edge: Experience with 1+ cloud platform (e.g. Azure, AWS, Google Cloud) Azure certification Experience working in a technology start-up environment Knowledge of SQL database / query optimization Site reliability or DevOps experience Bachelor/Master’s degree in Computer Science or Engineering", "extensions": ["7 hours ago", "Full–time"], "detected_extensions": {"posted_at": "7 hours ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciAoVE8tOEE3RkMpIiwiY29tcGFueV9uYW1lIjoiQml0VGl0YW4iLCJjb21wYW55X21pZCI6Ii9nLzExZHhwa3N2ODkiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJBNUZZY3oyYmQ3VVRpSXVMQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VW1wUll6UkxZV1JFVmpVdFJIRjFjRVYyWkdaTFJWTnlTVjlhYWpCeWEwbGFRbGMxTUVGaFowNTVTVjlWWlhseE1WWkJORzlOTTJOTGFHWnBkbFZ1ZDFsdGRtZGxjRXRwY1d4WVZHOXFOM0pRVTBoR1J5MWlSbk5IY1Y5Tk0yNXhaRlZLTFVoTk1tbFBiVWczY21SUlNsaDVkV1l5ZEhwelFXUldPVXh4VjFZMlpqTmpha3BoTW5JNE1VWmlaa3hETWtSemFGbHVPR1E1VERGbkVoWkdibTFEV1VwUVNVeDBURmQwVVdGS2NtSnliMFJuR2lKQlQwMVpVbmRDY2tVdE1rTlRhV1F0YUhKZkxVTmljMUJ1WkZGMlNGQTVkRlIzIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNTQiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9icyBUcmFiYWpvLm9yZyIsImxpbmsiOiJodHRwczovL3NnLnRyYWJham8ub3JnL2pvYi0yNy0yMDIxMDQyMy04YTdmYzU3NWQxYmE0MWM2ZTExMTExYWEwZGZmOGJlYT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Platform Software Engineer @ Science Pk, Up to $5,500 + Performance Bonus", "company_name": "Success Human Resource Centre Pte Ltd", "location": "Singapore (+1 other)", "via": "via Job Vacancies In Singapore", "description": "• 2 Year contract< strong>< li>\n• Jurong East< strong>< li>\n• Normal office hours (Monday to Friday: < strong>8.30am to 6pm)< strong>< li>\n• Up to $5,500 + Performance Bonus + Transport reimbursement capped at $550< strong>< li>< ul>Job Descriptions:< strong>< div>\n• Design, develop, test, deploy, maintain and improve backend platform applications< li>\n• System-to-system Integration development using API, messaging and related technologies.< li>\n• Unit test development and peer review in a Scrum team< li>\n• Full stack developer will be an added advantage.< li>\n• Assist architect team lead on application design, database schema design and integration design< li>\n• Assist development team on integration and security test design. And develop test drivers simulators or stub required< li>\n• Assist PO BA on user stories refinement.< li>\n• Assist QA Tester on test automation and bug fixes.< li>\n• Assist DevOps on build and release automation.< li>\n• Prepare interface specifications and other... design documentations.< li>< ul>\nPeriod:< strong>\n• 2 Years< li>< ul>\nLocation:< strong>\n• Jurong East< li>< ul>\nWorking Hours:< strong>\n• Monday to Friday: 8.30am to 6pm< li>< ul>\nSalary:< strong>\n• Up to $5500 month + Performance Bonus + Transport Reimbursement capped at $550< li>< ul>\nJob Requirements:< strong>\n• Experience with backend system design and development.< li>\n• Experience development using Kubernetes, AKS, Istio Envoy, Spring, Java JEE, RESTful API, messaging (AMQP, MQTT & related technologies), or postgresql mysql MSSQL RDS AzureDB.< li>\n• Experience with development on Microsoft Azure, and or AWS will be an advantage< li>\n• Able to express design using UML notation and derive tasks backlog in SCRUM.< li>\n• A fast learner, have a proactive attitude and an eye for quality works< li>\n• A team player - inclusive mindset to collaborate effectively in a diverse team< li>\n• Familiarity with developing efficient queries and designing schemas for relational databases< li>< ul>Plus points as added advantage for senior post or team lead:< div>\n• Experience with development on a public cloud, e.g. Microsoft Azure, AWS< li>\n• Experience in developing platform level features, such as configuration management, service discovery and routing, feature switch, A B testing, etc.< li>\n• Experience with clustering, stateless stateful, transactions and system integration designs principles< li>\n• Experience with ESB and API Management< li>\n• Experience with security hardening and understanding of security CIA and AAA< li>\n• Experience with LDAP Active Directory and SSO integration< li>\n• Familiarity with Spring Framework< li>\n• Experience with Maven, Nexus or Artifactory< li>\n• Experience with Git or Subversion< li>\n• Experience with Docker< li>\n• Experience with CI CD systems, such as Bamboo, Jenkins< li>\n• Scrum certified, and with experience in a Scrum project< li>< ul>\nIn lieu of physical interviews, we will be conducting virtual interview, i.e. Skype WhatsApp Facetime ZoomInterested applicants, kindly email your detailed resume (MS Word format is preferred):< div>jason@successhrc.com.sg< strong> (Reg No: R2092011)< div>Please ensure that applications sent through email are no bigger than 1Mb.< div>We thank all applicants for your interest but regret to inform that only shortlisted candidates would be notified.< div>Success Human Resource Centre Pte Ltd< strong> (EA License Number: 97C4832)\n3 Shenton Way, Shenton House #19-01, Singapore 068805\nT: 6337 3183 | F: 6337 0329 | W: www.successhrc.com.sg\nâ€ƒ< div>< div", "extensions": ["4 days ago", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQbGF0Zm9ybSBTb2Z0d2FyZSBFbmdpbmVlciBAIFNjaWVuY2UgUGssIFVwIHRvICQ1LDUwMCArIFBlcmZvcm1hbmNlIEJvbnVzIiwiY29tcGFueV9uYW1lIjoiU3VjY2VzcyBIdW1hbiBSZXNvdXJjZSBDZW50cmUgUHRlIEx0ZCIsImNvbXBhbnlfbWlkIjoiL2cvMTFnNzA5XzIwOSIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IlZsZkN6SF9vUUJWUnQxeExBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVxRUNDdUlCUVU1VlgwNXhVbU5VWmxKNmNXb3lSWHBTYjBGNmJFdFpaM0p4UkcwMGFHWjVjRk54ZEMwNFVrcFZlVkZhUzNWTE4xZ3dTMGR2U210VmVrTm9YMlJRZFhOclNGQjJOMDVEU1ZGVGIxbDVhbE5rU2xsM09XOW1NbW95ZDFCS2JHdEdOMmRpZDJaWFlWcFpMVTlOTkMxWlRVSmxhR1puV21vd2VIaFJNbVJsUlRsdFZrWk9RMVYzVVVoSWNHUlVhRWxoTjJSMVJFWkxVMk5aWVdrek5FWjZjbEZtYzNSSFRXbG5ValZVVTFwMlgwOU1lVTR3UlhOa1RrWjJXbUZPWlRWWmNWQkNRMlZKTWxOeGIyVkhMUzF4TjA5TlRsY3RURzVuVmt4U1JYVlVTMFZJUVJJV1JtNXRRMWxLVUVsTWRFeFhkRkZoU25KaWNtOUVaeG9pUVU5TldWSjNRbkJFV0dWb2RHUmtMVkphWmtaTFZuQjFaalZOWkZGRldGVjBkdyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzYxIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYiBWYWNhbmNpZXMgSW4gU2luZ2Fwb3JlIiwibGluayI6Imh0dHBzOi8vam9iZWthLnNnL2pvYnMvMzcxMjYvU3VjY2Vzcy1IdW1hbi1SZXNvdXJjZS1DZW50cmUtUHRlLUx0ZC1QbGF0Zm9ybS1Tb2Z0d2FyZS1FbmdpbmVlci1ALVNjaWVuY2UtUGssLVVwLXRvLSQ1LDUwMC0rLVBlcmZvcm1hbmNlLUJvbnVzLTIwMjEtMDQtMTk/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "SG - Financial Software Engineer", "company_name": "StashAway", "location": "Singapore", "via": "via Bayt.com", "description": "We are currently expanding and looking for an exceptional and motivated Full Stack Engineer with a background in investments/finance/mathematics. You will work on our Economic Regime-based Asset Allocation (ERAA) framework, automating the investment decision process, maintain our financial computation engine and related microservices.\n\nYou will need to leverage the entire technology stack to realise these goals and will be part of a team that is constantly tackling difficult questions of scale, architecture, and interaction. Your contribution to a dynamic Technology team allows you to be exposed to a variety of concepts and technologies. You will enjoy being able to have a direct impact on StashAway's investment framework, and the development of features to support our products.\n\n-----\n\nWe have assembled an agile stack of microservices primarily written in Scala, Kotlin, Python, and JavaScript that is organised in Kubernetes and runs on AWS, communicates via Kafka and persists data in... Cassandra, MongoDB, and Postgres databases. We heavily utilise Event Sourcing as a data modelling and persistency concept for our core trading system.\n\nWe strive to keep most of the services simple and robust so they are easy to develop, test and maintain allowing us to iterate quickly and productively.\n\nDo check out StashAway's Engineering blog to learn more about the technology we use, the challenges we face, and the solutions we deliver!\n\n-----\n\nResponsibilities:\n• Build efficient, scalable, and robust solutions for clients in Python and other related technologies.\n• Portfolio Analytics - Maintaining the business logic code for the information and statistics that are displayed on the web/mobile.\n• Investment Server and Market Data - storing and providing financial data (ETF Prices & Dividends) from Bloomberg, and allocation across portfolios.\n• Write testable, clean, efficient code that can be confidently released in production.\n• Code in a collaborative, agile environment developing many new features.\n• Write well-tested, clean code and review other team members’ contributions.\n• Work closely with Product and Investment teams to produce high-quality results by understanding the investment process.\n• Be part of a team that enables faster internationalisation and the development of new investment products.\n• Must-Haves:\n• Bachelor degree in Computer Science, Engineering, Finance, Mathematics or related field.\n• Have experience in at least one statistical programming language - Python, R, Julia. Our financial stack is mainly in Python.\n• Have at least 1-3 years of experience in building web applications, preferably with a JavaScript-powered modern frontend stack.\n• Strong background in data structures and algorithms.\n• Familiar with agile processes, testing and continuous integration.\n• Eager and willing to learn new things, staying up to date with the latest technologies, and expanding your base skill sets to propose new approaches to your work.\n• We have an annual Learning & Development budget of S$1,000/year for you to take charge of your up-skilling and learning!\n• Able to work independently with minimum supervision.\n• Good-to-Haves:\n• Past work experience working on a B2C product and interest in finance", "extensions": ["5 days ago", "Full–time"], "detected_extensions": {"posted_at": "5 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTRyAtIEZpbmFuY2lhbCBTb2Z0d2FyZSBFbmdpbmVlciIsImNvbXBhbnlfbmFtZSI6IlN0YXNoQXdheSIsImNvbXBhbnlfbWlkIjoiL2cvMTFnNGNwdjNiZyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImgtZmY2MzY4S1Fjb3ZybGxBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhVbnByZVRCeGFWSkNlbFZxUkVabE1sRTBjMk4xZUVwQ1RWbFFNbWh6VGpVeVEyaDZiM0pXZDA5aVFsVnVjWEJqTjBwT2RGVjBiRWxmUlROU1JUazROM1ZTWWxOSVdsaGlXSGsyTUV4VWNGQTRZbUp1Ym01TWNXdHVUazlFY2xaeE9UbHZWa1ZDZGxwdFMxQlBOMDVWUTBoeVdqQjVURVUxTTFjMWIxSkJTRk5IVjNWblZFcE9PRmcyVDBGb2JsSnVWbkpNTVVkU1JYVnlZV1JCRWhaR2JtMURXVXBRU1V4MFRGZDBVV0ZLY21KeWIwUm5HaUpCVDAxWlVuZEJhMjQwVkd0blF6SlNNVWhFY25adVRsVlZNVFpKWVZZM1JHZDMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY182OCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCYXl0LmNvbSIsImxpbmsiOiJodHRwczovL3d3dy5iYXl0LmNvbS9lbi9zaW5nYXBvcmUvam9icy9zZy1maW5hbmNpYWwtc29mdHdhcmUtZW5naW5lZXItNTk1MzAyMDYvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}], "chips": [{"type": "Title", "param": "job_family_1", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Software engineer", "value": "software engineer"}, {"text": "Programmer", "value": "programmer"}, {"text": "Programmer analyst", "value": "programmer analyst"}, {"text": "Senior", "value": "senior"}, {"text": "Cnc programmer", "value": "cnc programmer"}, {"text": "Engineer", "value": "engineer"}, {"text": "Analyst programmer", "value": "analyst programmer"}, {"text": "Science", "value": "science"}, {"text": "Software programmer", "value": "software programmer"}, {"text": "Assistant", "value": "assistant"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Electrical engineer", "value": "electrical engineer"}, {"text": "Executive", "value": "executive"}, {"text": "Java engineer", "value": "java engineer"}, {"text": "Java programmer", "value": "java programmer"}, {"text": "Lecturer", "value": "lecturer"}, {"text": "Manager", "value": "manager"}, {"text": "Operator", "value": "operator"}, {"text": "Project officer", "value": "project officer"}, {"text": "Senior programmer", "value": "senior programmer"}, {"text": "Senior system", "value": "senior system"}, {"text": "Senior technical", "value": "senior technical"}, {"text": "Sr. programmer", "value": "sr. programmer"}, {"text": "Systems programmer", "value": "systems programmer"}, {"text": "Technical", "value": "technical"}, {"text": "Trainee", "value": "trainee"}, {"text": "Trainer", "value": "trainer"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Mining", "value": "/business/naics2007/21"}, {"text": "Rental", "value": "/business/naics2007/532"}, {"text": "Wholesale", "value": "/business/naics2007/42"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "EPAM", "value": "/m/0dlnrc"}, {"text": "VISA", "value": "/m/01kqjn"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "Citi bank", "value": "/m/01dfb6"}, {"text": "TikTok", "value": "/g/11fy265933"}, {"text": "Ubisoft", "value": "/m/02qdyj"}, {"text": "Cognizant", "value": "/m/03bf9h"}, {"text": "HCL SINGAPORE PTE. LTD.", "value": "/g/11fy25ngsv"}, {"text": "Oracle", "value": "/m/05njw"}, {"text": "Credit Agricole Group", "value": "/m/028vbm"}, {"text": "Mindteck (India) Limited", "value": "/m/0cqj8w1"}, {"text": "Nanyang Technological University", "value": "/m/0l49k"}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Zühlke Group", "value": "/g/1hh_rg216"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Avensys Consulting Pte Ltd", "value": "/g/11g7022gjf"}, {"text": "Avnet", "value": "/m/0c8xmc"}, {"text": "GlobalTix Pte Ltd", "value": "/g/11dxpqdhrf"}, {"text": "GovTech", "value": "/g/11gh0528nq"}, {"text": "J.P.Morgan", "value": "/m/01hlwv"}, {"text": "Optimum Solutions (Singapore) Pte Ltd", "value": "/g/11g70hkrbx"}, {"text": "Razer Inc.", "value": "/m/075hc0"}, {"text": "Realtek Malaysia", "value": "/m/05wrm7"}, {"text": "Realtek Singapore Private Limited", "value": "/g/11g9n26trs"}, {"text": "Success Human Resource Centre Pte Ltd", "value": "/g/11g709_209"}, {"text": "TECHNOPALS PTE. LTD.", "value": "/g/11dxpvkynp"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "UST", "value": "/m/08kb8g"}, {"text": "UrbanFox", "value": "/g/11ghs7y0w6"}, {"text": "Adecco GS", "value": "/m/08gz46"}, {"text": "Alphanova Pte. Ltd.", "value": "/g/11f8h_czps"}, {"text": "BioMind", "value": "/g/11dymfr2l6"}, {"text": "Biqmind", "value": "/g/11g21fzhrb"}, {"text": "BitTitan", "value": "/g/11dxpksv89"}]}]}