{"search_metadata": {"id": "6082793da3f4ef496a7058cb", "status": "Success", "json_endpoint": "https://serpapi.com/searches/111416b294a318c9/6082793da3f4ef496a7058cb.json", "created_at": "2021-04-23 07:37:33 UTC", "processed_at": "2021-04-23 07:37:33 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28system+analyst%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=40", "raw_html_file": "https://serpapi.com/searches/111416b294a318c9/6082793da3f4ef496a7058cb.html", "total_time_taken": 3.7}, "search_parameters": {"q": "(system analyst) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "40"}, "jobs_results": [{"title": "SAP MM/SD Analyst", "company_name": "Spring Asia", "location": "Singapore (+1 other)", "via": "via Spring Asia", "description": "Main Duties & Responsibilities\nThis is a regional support role for South East Asia that provides application system support, business analysis, functional design, system implementation, user acceptance test, user training and system documentation\n\nOther Roles & Responsibilities\n• Daily support and problem solving in SAP and other business applications\n• Support & resolve user issues on daily basis and in a timely manner\n• Assist with reporting requirements / exports from SAP / other systems\n• Facilitate system changes according to Business Requirements & Change Requests\n• Gather user's requirements & translate into functional enhancement requests (no coding needed)\n• GAP analysis of businesses process vs requirements vs system capabilities / functionality\n• Participate and support system implementation and enhancement\n• Provide user training and system documentation\n• Prepare testing and conduct user acceptance test with users\n\nCandidate Profile\n• Degree in Business Administration... Computer Science or related subjects\n• At least 3 years experience in SAP (ECC preferred) & Application Support or Consulting\n• Industry experience in Retail/ Wholesale / Sports\n• Strong SAP experience in SD & MM & FI Modules. WM (advantageous)\n• Strong GAP analysis and reporting reconciliation\n• SAP Certification is an advantage\n• Data migration implementation and lifecycle experience\n\nWhat to Expect\nOur client offers the benefits of a work environment that is stimulating, challenging and balanced. You will be working in a fast paced and global organization.\n\nInterest & Apply\nAdvance your career to the next level with this unique opportunity in Singapore. To further consult on this role, please reach out to Jingheng via Jingheng.Sim@Springasia.com for a confidential chat.\n\nPosted By\nSim Jingheng\nManager – Information Technology\nEA License No: 09C5803\nPersonnel Registration Number: R1434838", "extensions": ["11 days ago", "Full–time"], "detected_extensions": {"posted_at": "11 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTQVAgTU0vU0QgQW5hbHlzdCIsImNvbXBhbnlfbmFtZSI6IlNwcmluZyBBc2lhIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiIwTTIwNmZnc3NCaElVS3ZSQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFNwcmluZyBBc2lhIiwibGluayI6Imh0dHBzOi8vd3d3LnNwcmluZ2FzaWEuY29tL2luZm9ybWF0aW9uLXRlY2hub2xvZ3ktam9icy9zYXAtbW0tc2QtYW5hbHlzdC8zMjExNDc0P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Sitecore Business System Analyst", "company_name": "AccionLabs", "location": "Singapore", "via": "via SmartRecruiters Jobs", "description": "Company Description\n\nAccion Labs is a global technology services firm with offering a full range of product life-cycle services in the emerging technology segment. This includes Web 2.0, Open Source, SaaS/Cloud, Mobility, IT Operations Management/ITSM, Big Data and traditional BI/DW.\n\nThrough nine global offices and a rapid-response delivery model, Accion offers a range of engagement models such as turn-key projects, extended-teams, shared-IP development, offshore-leveraged engagements and professional staffing (contract, contract-to-hire & direct perm).\n\nRole: - Project Manager\n\nRequired\n\n· Have managed large transformational Mainframe platform migration / re-hosting projects\n\n· Understanding of Mainframe application related to infra needs\n\n· Knowledge and understanding of UX / Linux\n\n· Should have hands-on experience in projects\n\n· Strong project management skills. PMP certification is an added advantage\n\n· Have run a large complex project of at least 5m++\n\n· Ability in managing and... handling 3P vendors providing application porting services and workload solutions services.\n\n· Experience in contract administrations\n\n· Ability in managing cross-country / regional / virtualization resources in projects\n\n· Managing at CxO level customer\n\nJob Description\n\nRole:- Sitecore Business System Analyst\nJob Description:-\n\n· Typically 1-3 years experience in Sitecore 7.0 and above\n\n· Experience in Classic ASP\n\n· Familiar with Software Development Life Cycle (SDLC)\n\n· Ability to produce specifications for documentations and implementations\n\n· Experience in IT business analysis techniques\n\n· Gather, analyse and formalise user’s business requirements and processes, evaluate on feasibility of implementation and manage scope of project.\n\n· Prepare project documentation such as Requirement Specifications/Use Case Specifications etc Adhere to project scope, update requirement traceability matrix, inform and record out-of-scope issues. Develop technical design specification and translate technical design into process/program specification. Involve in the design review session.\n\nAdditional Information\n\nAll your information will be kept confidential according to EEO guidelines", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTaXRlY29yZSBCdXNpbmVzcyBTeXN0ZW0gQW5hbHlzdCIsImNvbXBhbnlfbmFtZSI6IkFjY2lvbkxhYnMiLCJjb21wYW55X21pZCI6Ii9nLzExZHhwcW0xNnYiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJFdUNLcjRHb2NPbXItMnY0QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VTNoQ1RuSTJPQzAyYVRoc1ZqaHZaVVJQTTFCSGVtNTVYMk5rZGxWQmJURTVUbmhqTTNNd1YwNDNUM1ZPUlVRd2MzbEpkRmREY2tSSmNGaEtaR290T0hwVWNIQlpURWR1ZFZwSmJrOVJja0ZrWlZkNFIxRlJTRFl6UjJkR01IQklNM2xoUmt4dmRIbEtUbE0wT0ZCWWJYZFBhWEJvY0hGb01VZzNhbmxZZUhRdFEyTkhWMjl3Ukc1YU1HVlVOWGs0WjIweGFqbFhNR05sUTJWQkVoWlJTRzFEV1ZCRE9FRmFSR1IwVVdGak16VmxiMEozR2lKQlQwMVpVbmRDTVRaaVNHUm9VbDh0UlhrM2JVVllURlpwWmkwd2FVRmlhRU5SIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMTIiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gU21hcnRSZWNydWl0ZXJzIEpvYnMiLCJsaW5rIjoiaHR0cHM6Ly9qb2JzLnNtYXJ0cmVjcnVpdGVycy5jb20vQWNjaW9uTGFiczIvMTA5MTYxNzcxLXNpdGVjb3JlLWJ1c2luZXNzLXN5c3RlbS1hbmFseXN0P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Systems Analyst (Agile DevOps)", "company_name": "Urban Redevelopment Authority", "location": "Singapore (+1 other)", "via": "via Jobs", "description": "Systems Analyst (Agile DevOps)\nAgency: Urban Redevelopment Authority\nJob no.: 547935\nWork type: Permanent/Contract\nLocation: Singapore\nCategories: InfoComm, Technology, New Media Communications\nThe Urban Redevelopment Authority (URA) is Singapore’s planning authority. Our mission is to make Singapore a great city to live, work and play. We plan and facilitate the physical development of Singapore, in partnership with agencies and the community, to create a vibrant, sustainable and cosmopolitan city of distinction.URA has undergone a digitalization journey to harness Geospatial and Data Analytics for more data-informed planning. URA was recognized as a leading organization in Digital Transformation and was the Asia Pacific 2017 regional DX Leader in Talent Acceleration, as well as the 2019 PSD Public Sector Transformation – Business Transformation Award recipient. URA is embarking on a Digitalization 2.0 effort, to go beyond Urban Analytics to use of Artificial Intelligence (AI) in our... Future Planning Processes.About Information Systems, Applications DepartmentBe part of the URA Information Systems, Application Department, where we partner closely with our Groups to plan, design, develop and deploy enterprise IT systems, e-Services, mobile apps and web portals to support work process transformation and improve service delivery for our external customers. In addition to providing IT advisory and support to continually improve our IT systems to ensure its relevance and capability to meet changing business needs, we also constantly explore new digital technologies and possibilities via collaboration with key industry players to advance strategic deployment of ICT in URA.About the jobYou will be a key member of the Digital Programme and Quality Office team, working closely with passionate Systems Analysts, driven and supportive Director and visionary CIO, to drive and transform IT processes and ensure quality implementation of IT Systems and digital services in an agile approach. If you have the following in your DNA, we would like to hear from you:\nInnovate – Always looking for ways to improve IT processes and feel motivated when your contribution makes a difference to everyone’s work, with focus on ensuring quality delivery of IT Systems and digital services;\nAgile – Lead and embrace the agile values as role of a ScrumMaster to plan, coach and operationalise processes to ensure all teams embrace agile way of application implementation; drive and manage DevOps software delivery automation.\nTech-savvy – Looking out for latest developments in the area of DevSecOps and explore useful tools to facilitate software quality assurance and software delivery automation.\nRequirements:\nDegree in Computer Science, Engineering, or related disciplines. In the alternative, candidates should at least have an additional 4 years of relevant experience\nScrumMaster certified, and any other agile related certification e.g. Product Owner, Agile Coach\nKnowledge and/or at least 3 years of relevant working experience in\nManaging projects as a Scrum Master and leading agile initiatives\nDevOps processes and tools\nSoftware development and quality assurance\nAble to work well within team and willing to learn\nEffective presentation, communication and writing skillsAdded advantage with below skills:\nExperience with project collaboration tools (e.g. Microsoft Sharepoint)\nExperience with application security implementation, OWASP understandingAppointment will commensurate with experience and entry-level applicants are welcome to apply.Advertised: 22 Mar 2021\nApplications close: 18 Apr 2021", "extensions": ["1 month ago", "$2.5K a month", "Full–time"], "detected_extensions": {"posted_at": "1 month ago", "schedule_type": "Full–time", "salary": "$2.5K a month"}, "job_id": "eyJqb2JfdGl0bGUiOiJTeXN0ZW1zIEFuYWx5c3QgKEFnaWxlIERldk9wcykiLCJjb21wYW55X25hbWUiOiJVcmJhbiBSZWRldmVsb3BtZW50IEF1dGhvcml0eSIsImNvbXBhbnlfbWlkIjoiL20vMDRkYzJnIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiRUloRTZFMFMxYkRzUlVxTEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRW9zQ0Nzd0JRVTVWWDA1eFV6bFNaREZhVTNoR2RrUndNbmRpVDNkWFUxSjRhamxyT0RGb00wcGxUa3N4UldKM04zUndWbU50U2sxMWJURjVNamhsV1hSMGJHbzBMWFppTmtocldtOWpVVk5sV25WWlUyUk1ObkZoWDB3MmNXUTRNMUJOTmtWNlgxSTBOamxtYm1sZlEwa3pRM1ZRYlRocWFVSkZiMHRTUTJ4alMxVmpTakUxWDFCdVdUUXpURUZ6TFVreFJrdzVkbHBNY1hCb01GaEJUWFE1WTNwV00zQnljblpOVFhneGRqTXRUbWs0U21oUFNHWjVaSEJmZWs5ZmNVcGlSR1ZCU0dWcWNIcFJkM28zWWxBdEVoWlJTRzFEV1ZCRE9FRmFSR1IwVVdGak16VmxiMEozR2lKQlQwMVpVbmRCVVVWUlUyNTVkRFJPWVZkUGJqZE1RV0V5Ym1SNVdWSXdiWHAzIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMTkiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9icyIsImxpbmsiOiJodHRwczovL3NnLmZpZGFudG8uY29tL2pvYnMvam9iLW9wZW5pbmcvY29tcHV0ZXItc3lzdGVtcy1hbmFseXN0cy9zeXN0ZW1zLWFuYWx5c3QtYWdpbGUtZGV2b3BzLTI1OTg3MTc2MD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "HR Information Systems Analyst / Senior Analyst / Lead Analyst, Workday, Project Cumulus #SGUnitedJobs #WSIP #PublicService", "company_name": "Public Service Division", "location": "Singapore (+1 other)", "via": "via LinkedIn", "description": "As part of Public Sector Transformation, PSD is working with various stakeholders to on-board close to 40 Statutory Boards by phases onto Workday, a Cloud Human Capital Management (HCM) / Enterprise Resource Planning (ERP) SaaS Suite. The roll-out will bring about changes in business processes, systems and technology, job roles and organisation structures, and you will be at the forefront of these changes!\n\nPSD engages a diverse group of stakeholders, including the Systems Integrator, the government in-house Shared Services VITAL, the HR Policy teams and other government agencies, to pla subsequent activities to ensure the successful adoption of the new cloud-based system, transition of workforce and achievement of benefit realization.\n\nWe believe in supporting you to develop professionally and personally. Beyond opportunities for on-the-job training and formal Workday Certification, there are attachment programmes to other stakeholders and involvement in other parts of the project... to gain a more holistic experience.\n\nResponsibilities\n\nFor Statutory Boards in the Implementation Phase\n• Together with central government stakeholders, to work out the on-boarding plan for statutory boards while ensuring alignment with the business objectives and strategic directions.\n• Support process harmonization workshops to harmonise towards common set of requirements while addressing the unique needs of various statutory boards where possible.\n• Operationalise the on-boarding plan, which include the execution of communication and engagement plan with agencies.\n\nFor Statutory Boards in the Maintenance Phase\n• Provide post-implementation support for the initial trouble-shooting and issue identification. If further technical support is necessary, to work with the System Integrator for possible solutioning, system re-configuration or adjustments.\n• Support system enhancement and evaluate the features of new releases to maximise the functionality of the system.\n• To monitor and report value realization metrics to ensure that the business objectives and strategic outcomes for Finance, Human Resources and Payroll transformation are achieved.\n\nOther Project Matters\n• Establish and maintain scalable processes that ensure best practices in HR.\n• Identify opportunities for business process re-engineering (BPR) initiatives for productivity improvement, via transforming, streamlining and continuous improvement of work processes.\n\nRequirements\n\n[Values]\n\nWe are looking for self-motivated individuals who value integrity, teamwork and take pride in going the extra mile to provide excellent service.\n\n[Work Experience & Competencies]\n\nAn Ideal Candidate Should Possess The Following\n• [Thinking Clearly and Making Sound Judgement] Ability to examine complex problems and propose possible solutions, demonstrating good problem solving and root cause identification skills.\n• [Working Effectively with Stakeholders] Strong communication and stakeholder management skills, adept at exploring issues from a user-centric perspective and contributing to a collaborative working environment.\n• [Improving and Innovating Continuously] Possess a mindset of continuous improvement, actively identifying work processes that can be streamlined and highlight potential implementation issues.\n• [Project Management] Good project management skills to effectively manage project milestones, timeline and drive initiatives.\n• [HR and Tech] Keen interest in HR policies, practices and systems, and a passion in leveraging technology to integrate with HR processes.\n• [Experience in HR Enterprise Systems] Prior experience in enterprise systems in HR (SAP, Oracle, Workday) will be an added advantage.\n\nApplicants with no prior experience are also welcome to apply.\n\n[Personal Traits]\n• Passion in HR and technology with a desire for continuous improvement\n• Agile and adaptable\n• Able to proactively develop and manage relationships with key stakeholders\n• Strong negotiation, conflict resolution, influencing, and stakeholder management skills\n• Organised, meticulous and able to multi-task\n• Good team player who is able to thrive in a fast-paced environment\n\nApplicants will typically be notified on whether they are shortlisted or not within 4 weeks of the closing date of the job posting.\n\nSuccessful candidates will be offered on a contract basis", "extensions": ["7 days ago", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJIUiBJbmZvcm1hdGlvbiBTeXN0ZW1zIEFuYWx5c3QgLyBTZW5pb3IgQW5hbHlzdCAvIExlYWQgQW5hbHlzdCwgV29ya2RheSwgUHJvamVjdCBDdW11bHVzICNTR1VuaXRlZEpvYnMgI1dTSVAgI1B1YmxpY1NlcnZpY2UiLCJjb21wYW55X25hbWUiOiJQdWJsaWMgU2VydmljZSBEaXZpc2lvbiIsImNvbXBhbnlfbWlkIjoiL2cvMTFnNl9fYnYxMCIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IklpdlVQRmo5YWpVS0dEb1pBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVvc0NDc3dCUVU1VlgwNXhVV1ZxV2pKVFl6Y3dZbFZWUVVKWlJVMVNaRWszWWpkcFZuWndialp4YURRd2NDMWtUVGgwVm1zNWQyRmZkbTVuUkc1T01VaEZhRUo2YlcxTU5scE9ObGxETldKNVlWSXRVV05IYW0xTGJVaE1OMlZFUW5wTmNtbGFOR0prUldsTWMwWlpibkZaT1c1MlFsOVNNV2RwT1d0blFuWmFiWEJRTTNSaFlsZzNUMjB0ZVdOMlJVTnNTbFZOVFhZM05FUllUVGh0UTBWR1JqWmlZbGRETkU4M01HcGxhMlJUVTBoSFVWUm5VRE5uUXpsc1JIRTJYekJRYjJOeVgxUnJWWEV0V0ZKRFduazNFaFpSU0cxRFdWQkRPRUZhUkdSMFVXRmpNelZsYjBKM0dpSkJUMDFaVW5kQmVXZE9NRzVtUnkxaFNtNUpTME55YVRnMmJWRjRiRmhXY1ZsMyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzI3IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExpbmtlZEluIiwibGluayI6Imh0dHBzOi8vc2cubGlua2VkaW4uY29tL2pvYnMvdmlldy9oci1pbmZvcm1hdGlvbi1zeXN0ZW1zLWFuYWx5c3Qtc2VuaW9yLWFuYWx5c3QtbGVhZC1hbmFseXN0LXdvcmtkYXktcHJvamVjdC1jdW11bHVzLSUyM3NndW5pdGVkam9icy0lMjN3c2lwLSUyM3B1YmxpY3NlcnZpY2UtYXQtcHVibGljLXNlcnZpY2UtZGl2aXNpb24tMjUwNTg3NjMyNz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Payroll Systems Analyst / HRIS systems Analyst", "company_name": "Salesforce.com", "location": "Singapore (+1 other)", "via": "via Bayt.com", "description": "To get the best candidate experience, please consider applying for a maximum of 3 roles within 12 months to ensure you are not duplicating efforts.\n\nJob CategoryProducts and Technology\n\nJob Details\n\nPosition Description:\n\nThe Treasury and Finance Operations (TFO) Technology team is responsible for all operational systems used by the TFO department. The Payroll Business Systems Analyst will have diverse responsibilities primarily focused on technology and system support, improving our operational infrastructure, and supporting key business and operational initiatives. Core operational responsibilities include KPI/metric analysis, and operational/executive reporting, and end user systems support. The role will report to the Manager, Payroll Systems. Salesforce.com is a fast-paced environment and we are looking for someone who can hit the ground running to manage multiple responsibilities and projects while producing high- quality work.\n\nResponsibilities:\n• Support TFO operational needs... including executing SOX controls, configurations for legislative and company requirements and troubleshooting production bugs.\n• Maintain and create business process documents for system improvements and operational initiatives\n• Support systems-related TFO project execution in direct partnership with IT; measure and document business results achieved through solution implementation\n• Support business stakeholders outside TFO, including reporting, compliance, access maintenance, and other day to day duties.\n• Support and facilitate partnership between IT Support (internal and external providers) and functional business leads\n• Identify areas of improvement to increase accuracy, completeness and/or consistency and implement solutions in process, policy, and overall operations of all TFO functions\n\nRequired Skills/Experience:\n• Understanding of systems analysis, including root cause analysis and other process modelling\n• Experience with Workday and ADP systems backend and reporting\n• Understanding of functional disciplines (payroll, HR, benefit, recruiting)\n• Proficient in Microsoft Excel & PowerPoint or Google Sheets & Slides\n• Excellent written and verbal communication skills\n• Ability to multi-task and perform effectively in a fast-paced environment\n• Able to think independently and consider cross-functional and downstream impacts\n\nDesired Skills/Experience:\n• Customer Service experience preferred\n\n#LI-Y\n\nAccommodations - If you require assistance due to a disability applying for open positions please submit a request via this Accommodations Request Form.\n\nPosting Statement\n\nAt Salesforce we believe that the business of business is to improve the state of our world. Each of us has a responsibility to drive Equality in our communities and workplaces. We are committed to creating a workforce that reflects society through inclusive programs and initiatives such as equal pay, employee resource groups, inclusive benefits, and more. Learn more about Equality at Salesforce and explore our benefits.\n\nSalesforce.com and Salesforce.org are Equal Employment Opportunity and Affirmative Action Employers. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status. Salesforce.com and Salesforce.org do not accept unsolicited headhunter and agency resumes. Salesforce.com and Salesforce.org will not pay any third-party agency or company that does not have a signed agreement with Salesfore.com or Salesforce.org.\n\nSalesforce welcomes all", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQYXlyb2xsIFN5c3RlbXMgQW5hbHlzdCAvIEhSSVMgc3lzdGVtcyBBbmFseXN0IiwiY29tcGFueV9uYW1lIjoiU2FsZXNmb3JjZS5jb20iLCJjb21wYW55X21pZCI6Ii9tLzA3YnRyNSIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Ikp5WUxOVEVrUTZETTB0T3FBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhVa3RMZFVjNFYxaGZOM0JPZG5NNFJtWmZTRkJ1ZEdSaFpEVm9lWE13UkRKcmJtMHhXV1o0TWtsYWNFWTRNRmQ1ZWkxbGJFRTJkaTF0ZVRsVWJUUkZkVEkxVkhCamVITkxaMnRJTm1KRk4zUjRMWGgyVWtsTlZIRk9ka0ZwTlV3NWJHTjZUMDF5WW5oYVExbGZRVVpDUWtGaFNFOUxUM0JUVjBSa2JETklXVU5TUWs5V2FXeE1UM2xGTlVkRlJWRnJWR3B6V1RoaVZscE5kMUJSRWhaUlNHMURXVkJET0VGYVJHUjBVV0ZqTXpWbGIwSjNHaUpCVDAxWlVuZEVkemxKY2xwRmFFNWlVR04wTlVaR1pHWklObTFrWTFodmEzcG4iLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18zNSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCYXl0LmNvbSIsImxpbmsiOiJodHRwczovL3d3dy5iYXl0LmNvbS9lbi9zaW5nYXBvcmUvam9icy9wYXlyb2xsLXN5c3RlbXMtYW5hbHlzdC1ocmlzLXN5c3RlbXMtYW5hbHlzdC01ODc4MTg0MS8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "System Analyst", "company_name": "Protosoft Solutions Pte. Ltd.", "location": "Singapore", "via": "via Monster", "description": "Responsibilities\n\n- Maintaining, patching, tuning and upgrading existing systems as required\n\n- Troubleshooting technical issues\n\n- Collaborating with System Analyst to resolve issues and ensuring solutions are viable & consistent\n\n- Creating system guidelines and manuals for the organization\n\nRequirements\n\n- Degree in IT, Computer Science, Computer Engineering or related discipline\n\n- 3+ years of system development experience using Java and front-end web/back-end integration using ExtJS, JQuery, Spring and MyBatis\n\n- 2+ years of SQL development experience and familiarity with optimization techniques\n\n- Good knowledge and experience in Unix/Linux commands/shell scripting\n\n- Good written and spoken English, and spoken Chinese, for liaising between on-shore & off-shore team in China\n\n- Others good to have;\n\n1. Skillset in VBA (Visual Basic for Application in Microsoft Excel)\n\n2. Able to speak & write Japanese\n\n3. Knowledge & experience of cloud computing such as AWS", "extensions": ["25 days ago", "Full–time"], "detected_extensions": {"posted_at": "25 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTeXN0ZW0gQW5hbHlzdCIsImNvbXBhbnlfbmFtZSI6IlByb3Rvc29mdCBTb2x1dGlvbnMgUHRlLiBMdGQuIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJQUlJ3T3NxcDdMc05SaWlTQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1vbnN0ZXIiLCJsaW5rIjoiaHR0cHM6Ly93d3cubW9uc3Rlci5jb20uc2cvYW1wL2pvYi12YWNhbmN5LXN5c3RlbS1hbmFseXN0LXByb3Rvc29mdC1zb2x1dGlvbnMtcHRlLWx0ZC1zaW5nYXBvcmUtMjc1MDc4NTkuaHRtbD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior Systems Analyst", "company_name": "UST GLOBAL (SINGAPORE) PTE. LIMITED", "location": "Singapore (+1 other)", "via": "via MNC Jobs Singapore | MNC Jobs In Singapore", "description": "Develop SFDC APEX Classes, VisualForce programs in Force.com\n\nPrepare design documents with Architecture, API, Custom Objects\n\nUtilize SOQL API’s, Apex controllers, Apex Web Services, Apex\n\ncallouts, and other development tools to build custom functionality\n\nPrimary Skills: * At least 2+ years in Salesforce * Experienced in Pardot and Einstein Analytics * Preferably certified in Einstien Analytics * Excellent communication skills needed to interact with IT/Business stakeholders * Have experience in working closely with the project stakeholders and client in gathering requirements, breaking down the problem statements, designing the solution etc.\n\nminimumYearsExperience : 4\n\n[CANDIDATES WHO REQUIRE WORK PASSES NEED NOT APPLY]", "extensions": ["1 month ago", "Full–time"], "detected_extensions": {"posted_at": "1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU3lzdGVtcyBBbmFseXN0IiwiY29tcGFueV9uYW1lIjoiVVNUIEdMT0JBTCAoU0lOR0FQT1JFKSBQVEUuIExJTUlURUQiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IlZZUDhlb0xKbTdmZnR5c3ZBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTU5DIEpvYnMgU2luZ2Fwb3JlIHwgTU5DIEpvYnMgSW4gU2luZ2Fwb3JlIiwibGluayI6Imh0dHBzOi8vc2cubW5jam9iei5jb20vam9icy9zZW5pb3Itc3lzdGVtcy1hbmFseXN0LXNpbmdhcG9yZS0xODkzNTM/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "IT Analyst for eServices System / Application", "company_name": "People Advantage Pte Ltd", "location": "Singapore (+1 other)", "via": "via Joblum Singapore", "description": "Job Description\n• The overall scope of the works expected from the Contract Staff who is provided by the Contractor shall include the following:-\n• Coordinate and complete activities related to the eServices team projects which deal with customer facing systems such as feedback portals, kiosk and mobile solutions.\n• Plan and oversee projects to ensure they are completed in a timely fashion and within budget. Prepare budget based on the scope of work and system requirements. Track project costs in order to meet the budget.\n• Perform a variety of project management and operational support duties, including disseminating project information to project stakeholders, monitoring the achievement of project activities, engage vendors and systems integrators independently for project implementation, maintenance operations and system troubleshooting activities.\n• Arrange logistics for meetings, conferences, trainings, and other project-related events. Organise project committee meetings and... prepare the necessary materials, including reports, presentations, agendas and other meeting collateral. Transcribe and accurately record key decisions and action items resulting from meetings.\n• Perform analytical, evaluative, research duties. Able to work the direction of the project manager/director, but perform the work independently. Seek assistance from more senior project team members to understand and solve complex project problems.\n• Perform user acceptance testing, troubleshooting and tests on the required systems to assist project stakeholders.\n• Utilize industry best practices, techniques, and standards throughout the entire project execution.\n• Work with internal teams such as legal, security and data in relation to the implementation of any new enhancements to the systems.\nQUALIFICATIONS, SKILLS AND EXPERIENCE REQUIREMENT\n• Minimally with Diploma Certification in Information Systems/Technology or related discipline.\n• At least 5 years of working experience in relevant fields.\n• Good Microsoft Office skills, especially in MS Word, Excel and PowerPoint.\n• Candidate must have a strong understanding of web development, UX/UI, cross-browser compatibility, general web functions and standards.\n• Adequate knowledge of relational database systems, Object Oriented Programming and web application development.\n• Project Management Profession (PMP)/ITIL/SCRUM Master is advantageous.\n• Knowledge of low code development platform (e.g. OutSystems) is advantageous.\n• Good written and verbal communication skills.\n• Team player, independent and self-motivated.\n• Generally IT Savvy and have interest in the latest technologies available in the market.\n• Prior experience running projects and operations of Websites and mobile systems", "extensions": ["16 days ago", "Full–time"], "detected_extensions": {"posted_at": "16 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJJVCBBbmFseXN0IGZvciBlU2VydmljZXMgU3lzdGVtIC8gQXBwbGljYXRpb24iLCJjb21wYW55X25hbWUiOiJQZW9wbGUgQWR2YW50YWdlIFB0ZSBMdGQiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Ik8wclBGXzVWVFdHekdLYXBBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9ibHVtIFNpbmdhcG9yZSIsImxpbmsiOiJodHRwczovL3NnLmpvYmx1bS5jb20vam9iL2l0LWFuYWx5c3QtZm9yLWVzZXJ2aWNlcy1zeXN0ZW0tYXBwbGljYXRpb24vNjAyNjQ5P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Senior System Analyst (HRIS)", "company_name": "Rakuten Asia Pte Ltd", "location": "Singapore", "via": "via Jobsingapore24h.com", "description": "The Senior system analyst will act as the HR, HRIS and IT focal point supporting the Global Human Resources Organization for the program development and deployment of world-class HRIS tools and solutions that support Global HR Strategies. The Senior system analyst will also provide functional assistance in identifying, evaluating, developing and implementing system solutions, that meet user requirements. This position will plan, direct and complete analysis of programs to support business requirements and act as a liaison between the HR community and internal IT resources.\n\nKey responsibilities:\n• Identify, prioritize, and manage projects in the functional area of Human Resources, from inception through completion. Ensure that functional requirements are gathered and translated into appropriate functional specification documents, project plans are created and maintained, and ultimate solutions are identified and deployed as required. Coordinate the completion of tasks with both IT and... HR team members and management teams.\n• Together with the HR Leadership Team, define and analyze program requirements, prepare business cases, and communicate those needs using the proper tools with the HRIS organization.\n• Identify alternatives based on best practices and application functionality. Anticipate and identify issues and develop program recommendations and courses of action which are consistent with business objectives and functional requirements.\n• Act as Global Liaison between HR, HRIS and IT teams, with the ability to present systems information to a non-technical audience, and an ability to understand and interpret business requirements.\n• Develop and deliver change management program support for HR. Maintain the roadmap of tools and technology to support the global HRIS team and global systems.\n• Coordinate all HR programs. Develop and support the yearly HR program calendar of events.\n• Works with HR staff in the development of project scope of work documents and project plans that include analysis of cost, benefit, work schedule, related risks and return on investment\n• Works with functional areas to identify roles of project team members, project reporting structures, frequency of interaction and training requirements.\n• Other related duties and responsibilities as may be assigned\n\nMinimum Basic Qualifications and Experience:\n• Bachelor’s degree or equivalent work experience\n• 5-8 years experience in developing project charters, plans and programs for HR, Payroll, and HRIS\n• 5+ years experience managing complex HR projects to successful completion\n• 3-5 years experience in implementing programs for HRMS in ADP, PeopleSoft or Workday\n• 3+ years experience supporting budgets and managing external consultants\n• 3+ years experience in HR knowledge in any of the various functions of HR such as Compensation, Benefits, Communications, Training, and Recruitment.\n• Strong communication skills and the ability to use a variety of approaches to collaborate with and influence functional counterparts, supplier partners, contract resources, and IT peers\n• Ability to work with a global perspective\n• PMP (Project Management Professional) Certified prefered\n• Experience in supporting programs for both HR and HRIS systems\n• Demonstrated ability to communicate both written and verbally in an organized and concise manner\n\nCompetencies:\n• Ability to express ideas and information clearly and accurately. Proactively and tactfully addresses concerns with others when problems persist.\n• Takes personal responsibility for evaluating and determining the best path forward when responding to a request from various groups in HR.\n• Ability to recognize and acknowledge when something is not working and make necessary changes.\n• Demonstrates respect for others by seeking to understand how one thinks about issues and perceives problems and opportunities.\n• Actively builds relationships and networks with others across organizations, working constructively across organizational boundaries despite differences in interests, perspectives and needs.\n• Recognizes opportunities and/or issues and applies analytical and creative thinking to maximize performance.\n\nRakuten is an equal opportunities employer and welcomes applications regardless of sex, marital status, ethnic origin, sexual orientation, religious belief or age", "extensions": ["Over 1 month ago", "Contractor"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Contractor"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU3lzdGVtIEFuYWx5c3QgKEhSSVMpIiwiY29tcGFueV9uYW1lIjoiUmFrdXRlbiBBc2lhIFB0ZSBMdGQiLCJjb21wYW55X21pZCI6Ii9nLzExZzcwNzJ6MXYiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJwTFdBUE9HS2R5eHk0dVR1QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdllCQ3JjQlFVNVZYMDV4VWxsM09YRlpkRmxKVmpNdFFXZFRTM1JwT0VOa1FUbGZWV3N6TVRCaU4xVXRWM1Y2YTFGVVZtUjZaalJsVmw5U2FtWnhPSEU0VDBsbldIQlJVRTR4V1RCMk4yNVNSVVpKTlZabmFFMUpjV1ZKTURWR1UybDBNa1UyTW1GeE9WUjFkV3BQWmpKblJ6VmFjbVJvVEdOSVRIWjRkM05QUXpCQmVEazBSMTlCUldWTFltcGtSVjlsUXpCRlZWTTFSRUoyZURFMFRHVnpjbW96ZFVSaU9Vc3paRlF6UmxkUFpGZHBhVEZGTFhoWFJFTmpFaFpSU0cxRFdWQkRPRUZhUkdSMFVXRmpNelZsYjBKM0dpSkJUMDFaVW5kRFdVRmlVbkYzTTJobVdsRkJaV0ZvYkRKblZHSkZPR1puUmxkUiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzU1IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnNpbmdhcG9yZTI0aC5jb20iLCJsaW5rIjoiaHR0cHM6Ly9qb2JzaW5nYXBvcmUyNGguY29tL2ZyL3Nlbmlvci1zeXN0ZW0tYW5hbHlzdC1ocmlzLWpvYjQ5NTIwP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Senior Systems Analyst II", "company_name": "Singapore University of Social Sciences", "location": "Singapore", "via": "via Laimoon.com", "description": "Job Description\n\nThe shortlisted candidate will report to the Manager and provide administrative support to the department.\n\nJob Requirements\n• Degree Holder with 1-2 years' relevant working experience\n• Mature, meticulous and possess high level of discretion and integrity\n• Effective interpersonal skills with excellent command of written and spoken English\n• Resourceful team player who is able to work independently and display initiative\n• Proficient in Microsoft Office applications\n• Able to do data analysis and information research\n• Ability to communicate well so as to act as liaison and help reach out to stakeholders, such as faculty and admin staff from other departments and divisions as well as associates and other stakeholders", "extensions": ["23 days ago", "Full–time"], "detected_extensions": {"posted_at": "23 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU3lzdGVtcyBBbmFseXN0IElJIiwiY29tcGFueV9uYW1lIjoiU2luZ2Fwb3JlIFVuaXZlcnNpdHkgb2YgU29jaWFsIFNjaWVuY2VzIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJQRkFmSkV3TE11NEY3NDZfQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExhaW1vb24uY29tIiwibGluayI6Imh0dHBzOi8vam9icy5sYWltb29uLmNvbS9qb2JzL2V4dGVybmFsdmlldy8yNTYxNTc0Nz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Business Operations", "value": "GC06"}, {"text": "Accounting and Finance", "value": "GC01"}, {"text": "Customer Service", "value": "GC10"}, {"text": "Human Resources", "value": "GC15"}, {"text": "Management", "value": "GC18"}, {"text": "Education", "value": "GC11"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Protective Services", "value": "GC23"}, {"text": "Science and Engineering", "value": "GC27"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "System analyst", "value": "system analyst"}, {"text": "Systems analyst", "value": "systems analyst"}, {"text": "Business analyst", "value": "business analyst"}, {"text": "It analyst", "value": "it analyst"}, {"text": "Analyst", "value": "analyst"}, {"text": "Senior", "value": "senior"}, {"text": "Security analyst", "value": "security analyst"}, {"text": "Application analyst", "value": "application analyst"}, {"text": "Engineer", "value": "engineer"}, {"text": "Project manager", "value": "project manager"}, {"text": "Software engineer", "value": "software engineer"}, {"text": "Hris analyst", "value": "hris analyst"}, {"text": "Lecturer", "value": "lecturer"}, {"text": "Manager", "value": "manager"}, {"text": "Senior analyst", "value": "senior analyst"}, {"text": "Soc analyst", "value": "soc analyst"}, {"text": "Sr analyst", "value": "sr analyst"}, {"text": "Support analyst", "value": "support analyst"}, {"text": "Support manager", "value": "support manager"}, {"text": "System", "value": "system"}, {"text": "Systems administrator", "value": "systems administrator"}, {"text": "Technology analyst", "value": "technology analyst"}, {"text": "Test analyst", "value": "test analyst"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Internship", "value": "INTERN"}, {"text": "Part-time", "value": "PARTTIME"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Mining", "value": "/business/naics2007/21"}, {"text": "Research", "value": "/business/naics2007/5417"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Accommodation", "value": "/business/naics2007/721"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Real Estate", "value": "/business/naics2007/53"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "OCBC", "value": "/m/055r27"}, {"text": "Jobline Resources Pte Ltd", "value": "/g/11gp2647pn"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Workato", "value": "/g/11dxpy_3xd"}, {"text": "Avensys Consulting", "value": "/g/11g7022gjf"}, {"text": "Chevron", "value": "/m/01pvx3"}, {"text": "ELITEZ PTE. LTD.", "value": "/g/11dxptfkcf"}, {"text": "ILLUMINA SINGAPORE PTE. LTD", "value": "/m/09mxkxs"}, {"text": "M1 LIMITED", "value": "/m/05n486"}, {"text": "Mantu", "value": "/m/0b6mxkc"}, {"text": "Public Service Division", "value": "/g/11g6__bv10"}, {"text": "Rakuten Asia", "value": "/g/11g7072z1v"}, {"text": "Techcom Solutions", "value": "/g/11c73vztx3"}, {"text": "United Overseas Bank Limited", "value": "/m/04gjd1"}, {"text": "VISA", "value": "/m/01kqjn"}, {"text": "Venture Corporation Limited", "value": "/g/11bc61gglw"}, {"text": "Xilinx", "value": "/m/03dwkc"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "Activate Interactive Pte Ltd", "value": "/g/11dxq192l5"}, {"text": "Aramco", "value": "/m/01qjg2"}, {"text": "Avnet", "value": "/m/0c8xmc"}, {"text": "BGC Group", "value": "/g/11g0j3fjv8"}, {"text": "Bgc Group Pte. Ltd.", "value": "/g/11g9mphr4f"}, {"text": "CONNECT ENERGY SERVICES PTE. LTD.", "value": "/g/11dxptylw6"}, {"text": "Cochlear Ltd", "value": "/m/0kqqgc"}, {"text": "Crédit Agricole Corporate and Investment Bank", "value": "/m/04n1_w"}, {"text": "Ecquaria Technologies Pte Ltd", "value": "/g/11dxq26pxz"}, {"text": "Edwards Lifesciences", "value": "/m/03p20ps"}, {"text": "Equinix", "value": "/m/07btnq"}, {"text": "Experis Singapore", "value": "/g/11dxpnwm3s"}, {"text": "Flintex Consulting Pte Ltd", "value": "/g/11h1z41pzb"}, {"text": "ITCAN Pte Limited", "value": "/g/11dxpstz9t"}, {"text": "Institute of Technical Education", "value": "/m/05_02p"}]}]}