{"search_metadata": {"id": "60827b2eaa6c951a42329e16", "status": "Success", "json_endpoint": "https://serpapi.com/searches/0c45210e74235a6d/60827b2eaa6c951a42329e16.json", "created_at": "2021-04-23 07:45:50 UTC", "processed_at": "2021-04-23 07:45:50 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28solution+architect%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=180", "raw_html_file": "https://serpapi.com/searches/0c45210e74235a6d/60827b2eaa6c951a42329e16.html", "total_time_taken": 0.95}, "search_parameters": {"q": "(solution architect) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "180"}, "jobs_results": [{"title": "Solution Architect", "company_name": "EPAM Systems", "location": "Singapore", "via": "via Glassdoor", "description": "We are looking for an experienced Solution Architect in Singapore to make our team stronger.\nResponsibilities\n• Work in stand-alone mode on technical pre-sale activity and leading it\n• Identify gaps in delivery capabilities and proposes solutions to overcome them\n• Conduct interviews with candidates to Architect position\n• Provide guidance for the most complex or mission critical aspects of the architecture\n• Find and evaluates emerging technologies\n• Hand-on and up-to-date experience with microservices technology domain\n• Initiate and arrange business domain specific knowledge sharing/trainings for the project team, acts as trainer\n• Pro-actively analyze and measure current processes and practices and suggest/drive improvements to time to market/quality/cost\n• Utilize metrics and KPI to make decisions and track project risks\n• Provide timely input of risks and issues, impacting quality, schedule or resources, and recommend effective mitigation plans when applicable\n• Develop work... instructions, trainings, white-papers, case studies\nRequirements\n• Bachelor’s degree or above in Computer Science or related subject, Master’s degree or overseas education background is preferred\n• Having at least 10+ years of experience\n• Technology and Business domain-specific knowledge\n• 2-3 years experience in production architecture designs / solutions and review activities with available track of record\n• Good knowledge of architecture theory of all related technology domain\n• 2-3 years proven successful customer advisory/consultancy cases\n• Can write white papers and blueprints on customer’s request\n• Can create technology road map for Competency/domain\n• Has Enterprise Architecture theoretical knowledge\n• Can process, absorb, retain and reuse knowledge for several of the most popular business domains\n• Can create white papers and blue-prints, commercial proposals\n• True leader with confidence\n• Can lead group of Architects\n• Can lead the meeting of engineers, meeting with customer representatives, and the direction of an architecture\n• Ability to conduct presentation with wide audience (200+ people)\n• Software Engineering experience on any of the following technologies: Java, .NET, Javascript\n• Deep knowledge of any technologies from the following list would be beneficial: Kubernetes, Docker, Istio, Kong API, WSO API Management, PostgreSQL\nNice to have\n• Knowledge of financial business domains\nWe offer\n• Friendly team and enjoyable working environment\n• Work-life balance and flexible schedule\n• Online training library, mentoring, career development and potential partial grant of certification\n• Unlimited access to LinkedIn learning solutions\n• Referral bonuses\n• Compensation for sick leave and paid time off\n• Opportunities for self-realization", "extensions": ["7 days ago", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2x1dGlvbiBBcmNoaXRlY3QiLCJjb21wYW55X25hbWUiOiJFUEFNIFN5c3RlbXMiLCJjb21wYW55X21pZCI6Ii9tLzBkbG5yYyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6InZMYnJyQ0xpNVZPRXByUkNBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhVMngxVlRKSFVVdHNVVXhzT0ZnemQzUTBRV1ZKWW1WR2FrNTBSMmM1UVhZMVpVWXRVRGxMWkZCUlExaFZNVlZaTWw4M2RFZ3lTVFJRYzJ4bFIybFhOMUp3TURrMFRsTk1VazVQWkdsSVVWVlBhbll5WDBkZlgyOUZRMUExY0VKaFJuaHFaazV5ZEc5Q1VGUm1iVjgxZUZsSlFtVlFXbXBvZUMwelh6UTNUbWhzVGt0TlRHdHNlRlV3UTNaaVNqRklNbkJtVEdkS1MyMXBTRzVSRWhaTWJuVkRXVXhsTjBWd2NsZDBRV0o2TjNCTGIwRlJHaUpCVDAxWlVuZENXWGh3TVVSc2RXVmZkMFZzVnpSbU5YUjNWWEJQYTNOU1RDMUIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY183IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEdsYXNzZG9vciIsImxpbmsiOiJodHRwczovL3d3dy5nbGFzc2Rvb3Iuc2cvam9iLWxpc3Rpbmcvc29sdXRpb24tYXJjaGl0ZWN0LWVwYW0tc3lzdGVtcy1KVl9JQzMyMzU5MjFfS08wLDE4X0tFMTksMzEuaHRtP2psPTQwMDY0MzczOTlcdTAwMjZ1dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Principle-Senior Solutions Architect", "company_name": "Ntt Security (singapore) Pte. Ltd.", "location": "Singapore", "via": "via Monster", "description": "We are looking Principle Solution Architect for SOC Tech and operation process as a subject matter expert to join our APAC Presales/Solutions services organization.\n\nKey Responsibilities >\n\n· Leading the presales of the large complex SOCaaS and on-prem SOC build project and providing the consulting service for SOC technical solutions /operation processes, especially SIEM and SOAR implementation\n· Uses in-depth solution knowledge to provide technical expertise to sales staff and the customer through sales presentations and product demonstrations for building new relationships, driving opportunities and defining innovative security solutions to our customers.\n· Own and positively develop the relationships with key technical decision makers and influencers within the target customers\n· Engaging customers and partners, capturing requirements, proposing technical solution and overseeing the selection of technologies/products, scoping and estimating resources and effort needed to deliver... the business value solutions to the customer successfully and achieving high level of customer satisfaction – to own and manage the whole process\n· Engage with customers as a trusted advisor, listening and understanding their challenges and requirement – both technical and business, and clearly articulate and communicate to the sales team, and document them\n· Research and develop appropriate working solution and value proposition, engaging with the respective solution principal and services partner (including our MSS product team and professional services), to address customer requirement\n· Scope and clearly translate defined requirements, proposed solutions and value proposition into proposals/Statement of Work (SOW).\n· Present and articulate our value proposition to customers at all levels within the organization both technical and business audience (including C-levels)\n· Demonstrate a strong knowledge of the solutions and services offered by NTT Security overall\n· Proactively engage customer both new and existing, to provide update on the latest security trend, changes in the threat landscape, and new NTT Security product and services offering\n· Be a trusted advisor who provide sound security advise to customer and help them establish business case, including TCO and ROI justification, and shape requirement\n· Be the solution owner, taking lead and working with cross-functioning team including professional services, product management, sales and marketing to drive the development of market-driven solution and services, and also for marketing events\n· Ensure personal technical, communication and commercial skills are kept up to date to ensure successful execution of role, e.g. maintaining CPE, attending training, webinars.\n\nExperience Skills and Qualifications\n\n· At least 8 years of strong hands-on experience in IT Security with at least 2 years in technical solutioning and presales\n· Working technical knowledge of SIEM presales, design, and implementation including use case/Parsing development.\n· Working technical knowledge of SOAR presales, design, and implementation including playbook development and integration with security devices and IT system to enable the automation.\n· Working experience in providing consulting service for the SOC operation and processes\n· Working technical knowledge of security technologies (across multiple domains such as NG Firewall, Network IPS, DLP, Cloud Security etc), information security concepts and familiar with security products (Checkpoint, Palo Alto, Cisco, Splunk, Microsoft, Fortinet etc) and the security market place.\n· Experience working in a customer-facing role and comfortable presenting to a small to medium audiences on both technical and business related topics\n· Experience in preparing technical architecture blueprint and responding to large scale complex RFP is highly desirable\n· Professional security related qualification such as CISSP, CISM, CRISC, CISA, GIAC or equivalent are highly desirable\n· Broad experience and understanding of security regulatory framework and guidelines in the region are highly desirable\n· Broad experience and understanding of industry standards, framework and best practices such as ISO27001, PCI DSS, NIST, etc is highly desirable\n· Broad experience and understanding of security trend, threat landscape and framework such as the cyber kill-chain\n· Excellent oral and written communication skills", "extensions": ["29 days ago", "Full–time"], "detected_extensions": {"posted_at": "29 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcmluY2lwbGUtU2VuaW9yIFNvbHV0aW9ucyBBcmNoaXRlY3QiLCJjb21wYW55X25hbWUiOiJOdHQgU2VjdXJpdHkgKHNpbmdhcG9yZSkgUHRlLiBMdGQuIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJoMXd5WnFEaTdCY2VDRkhzQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1vbnN0ZXIiLCJsaW5rIjoiaHR0cHM6Ly93d3cubW9uc3Rlci5jb20uc2cvYW1wL2pvYi12YWNhbmN5LXByaW5jaXBsZS1zZW5pb3Itc29sdXRpb25zLWFyY2hpdGVjdC1udHQtc2VjdXJpdHktc2luZ2Fwb3JlLXB0ZS1sdGQtc2luZ2Fwb3JlLTI2NzE1NDQ1Lmh0bWw/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Cloud Solution Architect", "company_name": "Nextwave Partners Pte Ltd", "location": "Singapore", "via": "via Jobs | Fidanto", "description": "Responsibilities:· Lead technical and design discussions with IT executives to help enterprises speed their adoption of new cloud native technologies and practices· Leverage new technology paradigms (e.g., serverless, containers, microservices)· Providing deep software development knowledge with respect cloud architecture, design patterns and programming.· Migrate monolithic applications to micro services architectures· Support the full project lifecycle - to include: strategy, design, implementation and automation, as well as production-readiness and documentation activities.· Participate in the definition of application architecture, technology stack; research new technologies, and prototype new ideas.· Develop future state cloud blueprints for key systems along with a transition plan and a roadmap, prototype solutions as needed.Requirements:- 5+ years of large scale software development or application engineering with at least 3 years hands-on experience as a technical lead and... system architect role- Proven ability to architect, design and implement cloud-based and/or cloud-native solutions - Hands-on experience with containerization platforms and server-less computing like Docker, EKS, Lambda.- Experience with migrations to the cloud from both physical and virtual environments- Good exposure to Agile software development and DevOps practices such as Infrastructure as Code (IaC), Continuous Integration and automated deployment- Knowledge of DevOps methods and CI/CD automation practices- Experience in Configuration Management platforms (e.g. Chef, Puppet, Salt, or Ansible)- Excellent critical thinking and analytical skills.- Excellent written, verbal communication and presentation skills with the ability to present to a variety of external audiences, including being able to interact with senior executives.- Certified solution architect, DevOps in public cloud technologies- BS level technical degree or equivalent experience; Computer Science or Engineering background preferred", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDbG91ZCBTb2x1dGlvbiBBcmNoaXRlY3QiLCJjb21wYW55X25hbWUiOiJOZXh0d2F2ZSBQYXJ0bmVycyBQdGUgTHRkIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJueHZwMnpjd2lsWUlIQzI5QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnMgfCBGaWRhbnRvIiwibGluayI6Imh0dHBzOi8vc2cuZmlkYW50by5jb20vam9icy9qb2Itb3BlbmluZy9jb21wdXRlci1zeXN0ZW1zLWVuZ2luZWVyc2FyY2hpdGVjdHMvY2xvdWQtc29sdXRpb24tYXJjaGl0ZWN0LTI3NTM1NzU3Mj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Partner Solutions Architect - Global Systems Integrator", "company_name": "Amazon Web Services (AWS)", "location": "Singapore", "via": "via LinkedIn", "description": "Description\n\nThis is an ideal role for someone who has experience working for a global systems integrator, a large IT consulting firm, or a Fortune 1000 company. In this role, you will develop the technical capabilities of our Global System Integrators (GSIs) so they can be successful in the cloud. Working with these large partners is a team effort that will require influence and coordination with many stakeholders. You should be just as comfortable talking storage and networking with the VP of Infrastructure or continuous deployment with the DevOps team, TCO with the CFO, and cloud strategy with the CIO. If you are a problem solver with a broad technical skills, and have the ability to drive technical initiatives and cloud migration projects with the GSIs you will enjoy this role.\n\nIn this technical role, you will architect enterprise-grade Amazon Web Services solutions, own the technical relationship and deliverables for a GSI, develop and execute multi-day workshops, lead white... boarding sessions, author white papers and blog posts, and respond to complex technical inquiries including RFPs. You will have the opportunity to dive deep on our Amazon Web Services technologies and will work side by side with some of the top technical talent in the industry. The preferred location for the individual is Singapore.\n\nRoles & Responsibilities\n• Technical leader and trusted adviser in the area of cloud computing for our partners\n• * Work closely with Partner Development Managers to drive field level engagements\n• * Assist global system integrators earn the trust of customers by delivering multi-day technical workshops, lead white boarding sessions, executing on Proof of Concepts, and contributing to the construction of performant, scalable, secure, and highly available AWS solutions\n• * Demonstrate a bias for action and deep technical skills by authoring joint technical whitepapers with GSIs, technical case studies, and enterprise focused blog posts\n• * Dive deep on AWS Services as you develop reference architectures, presentations, and respond to RFPs\n• * Exhibit a combination of technical vision, creativity, technical acumen, and deep AWS technical skills by jointly designing and developing industry and vertical solutions\n• * Assist partners define the approach, tools, and end state architecture as they migrate customers to Amazon Web Services\n\nBasic Qualifications\n• Expertise in four of these technology areas: relational databases, analytics, big data, IoT, enterprise applications, applications and web servers, application security, networking, data encryption, storage, or application development.\n• Past experience leading white boarding sessions and delivering multi-day workshops to architects, operations staff, developers, and cloud technologist\n• Demonstrated ownership of a large IT project or software development effort\n• Experience writing technical training course content, white papers, technical articles, or blog posts\n• Demonstrated ability to think strategically, and act tactically, about business, product, and technical challenges\n\nTechnical Breath And Depth\n• Technology Breadth: Demonstrate architectural best practices applied across a breadth of technologies to solve organizational problems, articulate views/roadmaps for future development, and understand the interaction between infrastructure, operations, and development\u2028\n• Technology Depth: Demonstrate detailed knowledge of concepts, implementation, patterns, and issues of at least four technology areas\n• Experience designing and implementing enterprise-grade architectures for Fortune 1000 companies\n• Highly technical and analytical, possessing 10 or more years of related experience\n• BS level degree required, computer science, business or math background preferred\n\nPreferred Qualifications\n• Broad based technology experience including: cloud computing, data warehousing, applications development, DevOps, IoT, relational databases, noSQL databases, MapReduce, analytics, networking, security, storage, compute, continuous deployment, and management and monitoring\n• Experience executing large scale data center transformation or application migration and modernization projects\n• Cloud and/or AWS experience; AWS Certified Solutions Architect - Professional/Associate Level, AWS Certified Developer - Associate Level, AWS Certified SysOps Administrator - Associate Level\n• Microsoft, Oracle, or SAP hands on experience or certifications\n• Experience working with/for Global Systems Integrators and knowing the market landscape\n• Visible IT Industry thought leadership on relevant topics related to enterprise IT infrastructure\n• International technical sales and delivery experience w/ global F500 enterprise customers and partners\n• Use of AWS services in distributed environments with Enterprise Software\n• Advanced degrees in engineering and/or business\n\nAmazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer, and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, disability, age, or other legally protected status.\n\nCompany - Amazon Web Services Singapore\nJob ID: A1483374", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQYXJ0bmVyIFNvbHV0aW9ucyBBcmNoaXRlY3QgLSBHbG9iYWwgU3lzdGVtcyBJbnRlZ3JhdG9yIiwiY29tcGFueV9uYW1lIjoiQW1hem9uIFdlYiBTZXJ2aWNlcyAoQVdTKSIsImNvbXBhbnlfbWlkIjoiL2cvMTFkeHBycjJ4diIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImxjaXB0dVdHMTRJOUdZZUFBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVvc0NDc3dCUVU1VlgwNXhWRmh6T0VseVNFbExOMHgyVXpkeVl6TlRRMGRqVlhCdFJ5MWlVRjlFWTJWQ2NrOWZXbmR3WVVsaFJsVnJUSEJFV1V0elJVUjJTR3RhU2xsNVMySTNhR056ZERCdGFIQjZSMGhUZFRCcVRGOW1lVXhuVVZWc2RrUkJWR0pHYmxGWVNWTnBkVzlaVkd4MFR6UnJhVjlOTkVaS1ZtcG9jamd6UkhCVU5WTkRSVU01YkUxUVRsTnNXRlJLY25GbVZDMVZXVWd0YlZkM01IQndTVXBUUXpjMWNHeEhVSEJwUkZWWlNFeHdWV3BFV1VnMFVsUkdRblJMVTAxVlpWODFObU5LZWw5blQweFZFaFpNYm5WRFdVeGxOMFZ3Y2xkMFFXSjZOM0JMYjBGUkdpSkJUMDFaVW5kRFMyOU5ObmRLVVVWZlZFSlBaWGRGVVZBMGFESkpPRzlqUVhKQiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzIzIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExpbmtlZEluIiwibGluayI6Imh0dHBzOi8vc2cubGlua2VkaW4uY29tL2pvYnMvdmlldy9wYXJ0bmVyLXNvbHV0aW9ucy1hcmNoaXRlY3QtZ2xvYmFsLXN5c3RlbXMtaW50ZWdyYXRvci1hdC1hbWF6b24td2ViLXNlcnZpY2VzLWF3cy0yNDYwODcxMzQ4P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "SOLUTION ARCHITECT", "company_name": "None", "location": "Singapore", "via": "via Recruit.net", "description": "Be the Technical Solution Lead to engage customers on their IP/MPLS network challenges & programs and to offer a solution to them during both Pre-Sales and Post-sales phases. Knowledge of IP (unicast and multicast technologies and Clock synchronization) as the role will be responsible for designing and implementing IP/MPLS network for IPTV/Triple Play, Metro-E, CORE and Mobile Backhaul, BNG, CGNAT, AA/DPI environments. To support Services Tendering Team on BOM & High-Level Solution reviews; Work with TPM on man-effort estimates on the project and technical services delivery; Assist the Business Development Manager/s and his team in RFP clarification, if needed be to help to secure Orders. Responsible for design validation and POC/Trial/BMT approaches, leads the actual testing & validation with engineers and towards customers. Leads certain IP/MPLS solutioning and domain to create and maintain Test documents, tools and templates for re-usability in POCs, Trials and Projects. Work... closely with the TPM and PM to ensure delivery of the IP/MPLS solution/project so as to recognize Sales. Perform role/s and scope under Professional Services such as Network Audit Service work, Customer Resident Engineer/Resident Consultant, network migration/swap and delivering Customized Training to customers/partners in APAC region. Perform project roles such as Solution/Lead Network Architect or Integration Expert under deployment services to minimally recover cost or to generate services revenue on projects (ION and non-ION) we are supporting in APAC. Support IP/MPLS projects as IPR Solution Architect role championing the High-Level and E2E Architecture and Design Provides mentorship, knowledge transfer and technical support to project team members. About you Bachelor in Telecom/Data/Computer Networking Engineering or equivalent 7-10 years or more experiences in designing or/and implementing IP/MPLS networks and/or IP projects. Good knowledge and strong background in IP technologies, Data Communication, LAN, WAN, MPLS and VPN services. IP Certification and Multi-vendor IOT experiences is advantage. Be in the fore-front for new technologies such as SDN/NFV and have the right aptitude and willingness to acquire new knowledge and skills. Good business understanding in vendor or/and operator/service provider environment. Strong troubleshooting, problem solving skills and working experiences on test equipments. Clearly communicate (verbal and written) in English. Self-motivated and self-development/learning. Comfortable to meet and discuss solutioning/technology and technical escalation (network outage and resolution) with senior management in both company and customers Able to manage activities under high pressure and critical deadlines. Able to handle several important tasks at the same time. Be the Technical Solution Lead to engage customers on their IP/MPLS network challenges & programs and to offer a solution to them during both Pre-Sales and Post-sales phases. Knowledge of IP Skills: Cloud Computing, Enterprise Architecture, Enterprise Software, Integration, Ip, Microsoft Technologies, Mpls, Soa, Software Development, Solution Architecture, Service Oriented, Challenging, Tender Experience: 5.00-7.00 Years", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTT0xVVElPTiBBUkNISVRFQ1QiLCJjb21wYW55X25hbWUiOiJOb25lIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJQTVJSa3J3RGNhWHhpWlRhQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFJlY3J1aXQubmV0IiwibGluayI6Imh0dHBzOi8vd3d3LnJlY3J1aXQubmV0L2pvYi9zb2x1dGlvbnMtYXJjaGl0ZWN0LWpvYnMvN0M5MDMzQjcwQzBGNTEyNz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Solution Architect with BPM", "company_name": "AccionLabs", "location": "Singapore", "via": "via WhatJobs", "description": "Requirements:\n\nAt least 5 years’ experience in banking systems analysis, design and development with good technical JAVA knowledge of IT systems Oracle Java Enterprise Architect certified Familiar with NEWGEN IBPS/ OMNIDOCS/ OMNIExtract Must have IBM BPM (Business Process Management) products implementation experiences Experience in IBM BPM, IBM Filenet Appian (Business process management) workflow tool modelling and coding experience.\n\nPowered by JazzHR", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2x1dGlvbiBBcmNoaXRlY3Qgd2l0aCBCUE0iLCJjb21wYW55X25hbWUiOiJBY2Npb25MYWJzIiwiY29tcGFueV9taWQiOiIvZy8xMWR4cHFtMTZ2IiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiSnVmV09oRnd1bjhNVDV5OUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFVUaDFla2xDVUZCNWNYRmtkV056WlZSa1dXeFhibXQ0WlhrMk5GcHZOMnhDYXpCVlozWkRiVnBLTWxVeldsVmFNMWhrWm0xQ01sWjBUMnhNVUZCNFYwNXNTVGxpY0RFMVJrdEdjamxKZUhrMmNGOWhaSE4wZVZsU2RsbFFOelpyZHpjdFVWOUdiMmgzVFd0NlpERTBRbGx2V2xvdE5HTktkRE4yYTJKM2EwMVlVV05XZUY5S1oxTlhNbTVqTFdnMFVGQXlXVTlzWmxOR1VYbDNFaFpNYm5WRFdVeGxOMFZ3Y2xkMFFXSjZOM0JMYjBGUkdpSkJUMDFaVW5kRFJEVkpPVGxxV1V4aFJXeGthbkp1TlVseWFuSnNhVXhhZW5WQiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzM2IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFdoYXRKb2JzIiwibGluayI6Imh0dHBzOi8vZW4tc2cud2hhdGpvYnMuY29tL2pvYi1mb3ItU29sdXRpb24tQXJjaGl0ZWN0LXdpdGgtQlBNLWluLVNHLWNvb3AxNzU1ODI0NT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "PEGA Lead System Architect", "company_name": "percept-solutions", "location": "Singapore (+1 other)", "via": "via Glassdoor", "description": "Job Description\n\nThe PEGA Lead System Architect (LSA) is responsible for leading the team to design blueprint as baseline of the delivery, guiding the team through the implementation (from design to deployment) of a solution, and defining the specific solution, business, and functional requirements.\n\nUnderstanding the business solution strategy, operating vision, business imperatives, and capabilities, and how they affect technology imperatives\nDefining the specific solution processes and business and functional requirements needed to realize these opportunities\nWorking with other architects to explore and define how the proposed capabilities will fit into the overall solution architecture\nReviewing deliverables within the scope of the initiatives to meet the business imperatives\nManaging the integration requirements across different systems\nWorking closely with the business architect to verify that the outcomes and detailed requirements are aligned to the different benefits... realization phase\nDeveloping the agenda of the workshops and working sessions\nGuiding the team through the implementation from design to deployment of a solution\n\nJob Requirements\n\nAround 8 years of experience in developing large scale technical architectures\nCandidate must have Pega Certified Lead System Architect (LSA)\nSkillsets in Runtime Architecture, Integration Architecture, and Blueprint and Design Solutions are preferred\nProficient in Java, strong experience in development of multi-tier applications using JAVA, Tomcat-5.5, WebLogic servers\nExperience in web services like SOAP 1.2, WSDL 2.0 and XML 1.0 will be an added advantage\nExperience in AWS will be an added advantage\n\nEA Licence No.:18S9405 / EA Reg. No.:R1330864\n\nSkills & Competencies\n\nPega\n• Number of Vacancies:\n2\n• Minimum Years of Experience:\n8\n• Salary:\n$9,000 to $13,500", "extensions": ["2 days ago", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQRUdBIExlYWQgU3lzdGVtIEFyY2hpdGVjdCIsImNvbXBhbnlfbmFtZSI6InBlcmNlcHQtc29sdXRpb25zIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiI1LUxEQnpOTTVaYWtxSVBxQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEdsYXNzZG9vciIsImxpbmsiOiJodHRwczovL3d3dy5nbGFzc2Rvb3Iuc2cvam9iLWxpc3RpbmcvcGVnYS1sZWFkLXN5c3RlbS1hcmNoaXRlY3QtcGVyY2VwdC1zb2x1dGlvbnMtSlZfSUMzMjM1OTIxX0tPMCwyNl9LRTI3LDQ0Lmh0bT9qbD00MDQxMTM4NTUwXHUwMDI2dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Cloud Solution Architect", "company_name": "CapitaLand Group", "location": "Singapore", "via": "via Singapore", "description": "Design and deploy overall solution architecture to meet current and future business and product requirements Create overall architecture blueprints and design patterns to guide development Conduct technical product evaluation and selection Align technical architecture and roadmap with product design Define the principles, guidelines, standards and solution patterns to ensure solution decisions are aligned with the enterprise's future-state architecture vision. Set technical standards and monitor compliance to same Evangelize standardization and architecture practices Conduct technical sessions to establish agreement on development approach Partner with key stakeholders and proactively consult on projects regarding Architecture concerns and direction. Support design of application architecture components, by defining architecture and design, and documentation of architecture relevant system or software changes or enhancements to all assigned systems. Monitor the current-state solution... portfolio to identify deficiencies through aging of the technologies used by the application, or misalignment with business requirements. Leads analysis of complex production support issues that are related to Architecture. You will assess new technologies and develop solutions appropriate to business requirements for Architecture, and that leverage architecture standards. Requirements Degree in Business and IT with professional certification in IT project management and enterprise architecture 5 to 7 years of design/implementation/consulting experience with distributed applications with at least 3 years hands-on experience as a technical lead and system architect role Working knowledge of DevOps software development tools / methodologies and a solid software development background Hospitality domain knowledge preferred Experience with cloud architecture on Azure (preferred) / AWS Solid understanding of Server-side, .Net and/or Java development, Service Oriented Architectures (SOA), web services, microservices and digital services development Experience in designing, developing and deploying large, scalable production applications on cloud/PaaS platforms and Containers, such as AWS, Azure and OpenShift Exposure to middleware and different messaging / API management technologies Able to independently analyze and identify comprehensive solutions considering all functional implications while developing a workable solution Results and customer oriented Team player with strong organization and interpersonal skills Strong written, presentation and stakeholder management skills Preference for candidate with deep domain knowledge in retail, commercial or hospitality sectors Experience with managing teams with prior people development experience At CapitaLand, we advocate fair employment practices, and recruit talents based on merit and fit with our Corporate values. We provide equal opportunity for all qualified persons and build an inclusive workplace regardless of race, gender, age, religious belief or nationality. Only shortlisted candidates will be notified. Additional Information Manager Qualification Professional Certificate/NiTEC, Diploma, Advanced/Higher/Graduate Diploma, Bachelor's Degree, Post Graduate Diploma, Professional Degree CapitaLand Limited (CapitaLand) is one of Asia’s largest diversified real estate groups. Headquartered and listed in Singapore, it owns and manages a global portfolio worth about S$133.3 billion as at 30 September 2020. CapitaLand’s portfolio spans across diversified real estate classes which includes commercial, retail; business park, industrial and logistics; integrated development, urban development; as well as lodging and residential. With a presence across more than 220 cities in over 30 countries, the Group focuses on Singapore and China as its core markets, while it continues to expand in markets such as India, Vietnam, Australia, Europe and the USA. CapitaLand has one of the largest real estate investment management businesses globally. It manages six listed real estate investment trusts (REITs) and business trusts as well as over 20 private funds. CapitaLand launched Singapore’s first REIT in 2002 and today, its stable of REITs and business trusts comprises CapitaLand Integrated Commercial Trust, Ascendas Real Estate Investment Trust, Ascott Residence Trust, CapitaLand Retail China Trust, Ascendas India Trust and CapitaLand Malaysia Mall Trust. CapitaLand places sustainability at the core of what it does. As a responsible real estate company, CapitaLand contributes to the environmental and social well-being of the communities where it operates, as it delivers long-term economic value to its stakeholders. Additional Company Information Registration No. 198900036N Company Size 1001 - 2000 Employees Average Processing Time 24 days Benefits & Others Regular hours, Mondays - Fridays, Business (e.g. Shirts", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDbG91ZCBTb2x1dGlvbiBBcmNoaXRlY3QiLCJjb21wYW55X25hbWUiOiJDYXBpdGFMYW5kIEdyb3VwIiwiY29tcGFueV9taWQiOiIvZy8xMWZ5MjFoeWNoIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoibkJVeDVLUFJHNnFlYWEtMkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZZQkNyY0JRVTVWWDA1eFVtMXhUamhtYUV4Q1dYRnNjakowZUZGR2FFUkpNRGhqTUROSVgzVnVNMHBUT1ZoTFRURXhMV1oxYkVGMlIyaGtkMUJxVFdsZk9UazBiVTV1VkdGQ2MzRkxlbkZKVjBkUlJXWjBlbDloVVZsQ0xXSnhaMTlyWlhWYVRqY3hXbDh4YzFCaGRWcFRUVjl6YjNwUExXTjNUVXhyVEdaRVgwRlhOeTFDVm10WVMyaEhVM1ExWVdSb1VVc3hVMEpqUVhRM1ZuQXpWVmhEUTNKelF6ZG9XWGRCY0ZsWGNUZEpNMlZaUkRZeVVVNVZVSEpKRWhaTWJuVkRXVXhsTjBWd2NsZDBRV0o2TjNCTGIwRlJHaUpCVDAxWlVuZEJUSFZ4V0hCSGFFZGxTakZHTVc5dlExUnJUazloYW5wSVgyOUIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY180OCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBTaW5nYXBvcmUiLCJsaW5rIjoiaHR0cHM6Ly9zZy5maWRhbnRvLmNvbS9qb2JzL2pvYi1vcGVuaW5nL2NvbXB1dGVyLXN5c3RlbXMtZW5naW5lZXJzYXJjaGl0ZWN0cy9jbG91ZC1zb2x1dGlvbi1hcmNoaXRlY3QtMjc1NTE2MDM2P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Cloud Solution Architect", "company_name": "NextWave Partners Pte Ltd", "location": "Singapore", "via": "via LinkedIn", "description": "Responsibilities\n• Lead technical and design discussions with IT executives to help enterprises speed their adoption of new cloud native technologies and practices\n• Leverage new technology paradigms (e.g., serverless, containers, microservices)\n• Providing deep software development knowledge with respect cloud architecture, design patterns and programming.\n• Migrate monolithic applications to micro services architectures\n• Support the full project lifecycle - to include: strategy, design, implementation and automation, as well as production-readiness and documentation activities.\n• Participate in the definition of application architecture, technology stack; research new technologies, and prototype new ideas.\n• Develop future state cloud blueprints for key systems along with a transition plan and a roadmap, prototype solutions as needed.\n\nRequirements:- 5+ years of large scale software development or application engineering with at least 3 years hands-on experience as a technical lead... and system architect role- Proven ability to architect, design and implement cloud-based and/or cloud-native solutions\n• Hands-on experience with containerization platforms and server-less computing like Docker, EKS, Lambda.\n• Experience with migrations to the cloud from both physical and virtual environments\n• Good exposure to Agile software development and DevOps practices such as Infrastructure as Code (IaC), Continuous Integration and automated deployment\n• Knowledge of DevOps methods and CI/CD automation practices\n• Experience in Configuration Management platforms (e.g. Chef, Puppet, Salt, or Ansible)\n• Excellent critical thinking and analytical skills.\n• Excellent written, verbal communication and presentation skills with the ability to present to a variety of external audiences, including being able to interact with senior executives.\n• Certified solution architect, DevOps in public cloud technologies\n• BS level technical degree or equivalent experience; Computer Science or Engineering background preferred\n\nWe are looking for a Cloud Application Architect to be based in Singapore for upcoming projects.\n\nSkills: Cloud, Cloud Architect, Solution Architect\n\nExperience: 5.00-15.00 Years\n\nEducation: Bachelors/ Degree", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDbG91ZCBTb2x1dGlvbiBBcmNoaXRlY3QiLCJjb21wYW55X25hbWUiOiJOZXh0V2F2ZSBQYXJ0bmVycyBQdGUgTHRkIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJDWUJJMDUzNFFyYTVYX01pQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExpbmtlZEluIiwibGluayI6Imh0dHBzOi8vc2cubGlua2VkaW4uY29tL2pvYnMvdmlldy9jbG91ZC1zb2x1dGlvbi1hcmNoaXRlY3QtYXQtbmV4dHdhdmUtcGFydG5lcnMtcHRlLWx0ZC0yNDU5MTY2Mjk4P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "SAP Basis Architect", "company_name": "Techcom Solutions Pte Ltd", "location": "Singapore", "via": "via Monster", "description": "• As a PSR, you are an expert at contributing to different phases of the consulting lifecycle.\n• Plan and coordinate all activities within the responsible SAP Environment of the System Responsible\n• You will plan and coordinate Changes with IT Partners, Application Teams and other Services within the Datacenter.\n• Manage and support multiple landscapes. Should be able to manage and work in the area of SAP operation support, Implementation support, rollouts and Project support.\n• Be the single point of contact for the different landscape for internal Teams as well for the Customer.\n• Proven SAP systems delivery and/or system administration knowledge across the suite of major SAP applications & versions.\n• You will escalate Issues and Risks to the appropriate Team / Management.\n• You will support the L1 / L2 / L3 Team in troubleshooting Incidents.\n• You will optimize the SAP Systems in your responsibility.\n• You will review the monthly EWA Reports, create proposals and discuss them with... the IT Partners and Application Teams.\n• You will be intensely involved in; defining the problem, propose, coordinate and refining the solution.\n• You will also play an important role in the development, configuration and deployment of the overall solution.\n• You will guide teams on project processes, deliverables and contribute to the proposal development, client training and internal capability-building and help detail the project scope.\n• You will have the opportunity to shape value-adding consulting solutions that enable our clients to meet the changing needs of the global landscape\nRequirements:\n• 8-10 years working experience as an SAP Basis Architect\n• Application: SAP Basis, NetWeaver, ABAP/Java-Stack, SAP PI/PO, Avantra, ServiceNow, SAP LaMa\n• Database: SAP HANA, Oracle, MaxDB\n• Operating Systems: Linux, Unix, Windows\n• Technical: Troubleshooting SAP Basis issue, SAP Client Copies, SAP System Copies, Installing SAP System, Updating Databases, Language Pack Installation, Tablespace Management, Backup & Restore/Recovery of Databases, Spool Administration, Live Cache Administration, SSO/SSL Configuration, Kernel Upgrades, SAP Hardening Support Package Upgrade, Shell / Python scripting, experience in driving automation using, Capable of designing and implementing different strategies and procedures (Like System Landscape, System Architecture, Backup Strategy, System Refresh, Patching, Stress/Performance testing etc…). Capacity & Performance Management / Tuning, Proven experience in delivering Automations, Service Improvements Area\n• Certification: Certified in SAP Basis or SAP HANA\nInterested candidates kindly submit your updated CV in Word Format to: [Confidential Information]. Only shortlisted candidates will be notify. Thank you", "extensions": ["7 days ago", "Contractor"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Contractor"}, "job_id": "eyJqb2JfdGl0bGUiOiJTQVAgQmFzaXMgQXJjaGl0ZWN0IiwiY29tcGFueV9uYW1lIjoiVGVjaGNvbSBTb2x1dGlvbnMgUHRlIEx0ZCIsImNvbXBhbnlfbWlkIjoiL2cvMTFjNzN2enR4MyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImYwRUthVnFnT0l4cnUxWlVBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVvc0NDc3dCUVU1VlgwNXhVMFJsTFhsMmFFOWlSRlZNZEZaMGNIVkphbmRDYW1oelVsZE5kbGRGWXpoVVZYRTFNMDFaVm1VdGJIcGpWMWgyWDFSWUxVRTJjbnBTVjBwNk1tcEJlV1ZuTm5KNFgzUklabmRNVkhKUlF6UllTblpWVTAwMlZVdDNhRjlVT1ZBMVRqZGhOazFHUkRkVWFEbFJOMmxyTlRoSVgxWnBkbE5tWVhWSlNGVnJSV1ZPZGtORWVYTkpjalJCTWs5bVFXcFpSM0JHUlUxTVRHdExXVlZWT1RkWFZHazRNR2xCWDFnemJVczNja0ZJVFZaTGJqWmhWVEZ0WW01WlIwSnJSRXgwYlZvNFdFNTNFaFpNYm5WRFdVeGxOMFZ3Y2xkMFFXSjZOM0JMYjBGUkdpSkJUMDFaVW5kQ1UwTlBNVVJ4T1ZWTVVXdEpNa2wxTVdKTGRGOTJWMGczVHpGQiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzU4IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1vbnN0ZXIiLCJsaW5rIjoiaHR0cHM6Ly93d3cubW9uc3Rlci5jb20uc2cvam9iL3NhcC1iYXNpcy1hcmNoaXRlY3QtdGVjaGNvbS1zb2x1dGlvbnMtcHRlLWx0ZC1zaW5nYXBvcmUtMzAxNDQxOD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}], "chips": [{"type": "Title", "param": "job_family_1", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Solution architect", "value": "solution architect"}, {"text": "Solutions architect", "value": "solutions architect"}, {"text": "Architect", "value": "architect"}, {"text": "Cloud architect", "value": "cloud architect"}, {"text": "Technical architect", "value": "technical architect"}, {"text": "Enterprise architect", "value": "enterprise architect"}, {"text": "Senior", "value": "senior"}, {"text": "Consultant", "value": "consultant"}, {"text": "Financial services", "value": "financial services"}, {"text": "Infrastructure architect", "value": "infrastructure architect"}, {"text": "Manager", "value": "manager"}, {"text": "Application architect", "value": "application architect"}, {"text": "Cloud engineer", "value": "cloud engineer"}, {"text": "It architect", "value": "it architect"}, {"text": "Lead architect", "value": "lead architect"}, {"text": "Network architect", "value": "network architect"}, {"text": "Security architect", "value": "security architect"}, {"text": "Senior architect", "value": "senior architect"}, {"text": "Systems engineer", "value": "systems engineer"}, {"text": "Associate director", "value": "associate director"}, {"text": "Deputy", "value": "deputy"}, {"text": "Engineers", "value": "engineers"}, {"text": "Head", "value": "head"}, {"text": "Infrastructure", "value": "infrastructure"}, {"text": "Lab", "value": "lab"}, {"text": "Network engineer", "value": "network engineer"}, {"text": "Presales consultant", "value": "presales consultant"}, {"text": "Public sector", "value": "public sector"}, {"text": "Senior analyst", "value": "senior analyst"}, {"text": "Senior consultant", "value": "senior consultant"}, {"text": "Senior director", "value": "senior director"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Software architect", "value": "software architect"}, {"text": "Solution consultant", "value": "solution consultant"}, {"text": "System architect", "value": "system architect"}, {"text": "System engineer", "value": "system engineer"}, {"text": "Systems analyst", "value": "systems analyst"}, {"text": "Systems architect", "value": "systems architect"}, {"text": "Technical trainer", "value": "technical trainer"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Accounting", "value": "/business/naics2007/5412"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Management", "value": "/business/naics2007/55"}, {"text": "Real Estate", "value": "/business/naics2007/53"}, {"text": "Wholesale", "value": "/business/naics2007/42"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Amazon", "value": "/m/0mgkg"}, {"text": "Microsoft", "value": "/m/04sv4"}, {"text": "EPAM Systems", "value": "/m/0dlnrc"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "IBM", "value": "/m/03sc8"}, {"text": "Salesforce", "value": "/m/07btr5"}, {"text": "EY", "value": "/m/0g9jc"}, {"text": "Publicis Sapient", "value": "/m/02myjp"}, {"text": "Randstad", "value": "/m/08pt1z"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Alibaba Group Holding Limited", "value": "/m/07s6ctl"}, {"text": "Avanade", "value": "/m/094456"}, {"text": "Capgemini", "value": "/m/03vlk0"}, {"text": "Comtel Solutions Pte Ltd", "value": "/g/11dxpztgnb"}, {"text": "DELL", "value": "/g/11c54ch2jm"}, {"text": "Ericsson", "value": "/m/02kyh"}, {"text": "HTZ Resources", "value": "/g/11h21p9b4d"}, {"text": "Infinite Computer Solutions Pte Ltd", "value": "/g/11g9mj72yz"}, {"text": "Michael Page", "value": "/m/04cxldw"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "Orange Business Services", "value": "/m/08zvyz"}, {"text": "Recruitment Hub Asia Pte Ltd", "value": "/g/11dxpww_0f"}, {"text": "TEKsystems (Allegis Group Singapore Pte Ltd)", "value": "/g/11b6g4bkv0"}, {"text": "Talent Trader Group Pte Ltd", "value": "/g/11dxpmlc5b"}, {"text": "Tata Consultancy Services", "value": "/m/01psx8"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "VMware", "value": "/m/01t9k5"}, {"text": "Verizon", "value": "/m/07_dn"}, {"text": "A-Speed Infotech Pte Ltd", "value": "/g/11g9mxswl4"}, {"text": "ABeam Consulting", "value": "/g/11bc6whr_f"}, {"text": "Amazon Web Services (AWS)", "value": "/g/11dxprr2xv"}, {"text": "Amazon Web Services Singapore", "value": "/m/0rznzt1"}, {"text": "Aon", "value": "/m/0z7n"}, {"text": "Avaya", "value": "/m/01sqlk"}, {"text": "Azendian Solutions Pte Ltd", "value": "/g/11dxpvcjj2"}, {"text": "Big Cloud", "value": "/g/11c743lwsr"}]}]}