{"search_metadata": {"id": "608279d31e803f37a1bff755", "status": "Success", "json_endpoint": "https://serpapi.com/searches/fe76b228647da26d/608279d31e803f37a1bff755.json", "created_at": "2021-04-23 07:40:03 UTC", "processed_at": "2021-04-23 07:40:03 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28IT+analyst%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=80", "raw_html_file": "https://serpapi.com/searches/fe76b228647da26d/608279d31e803f37a1bff755.html", "total_time_taken": 1.24}, "search_parameters": {"q": "(IT analyst) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "80"}, "jobs_results": [{"title": "Business Analyst", "company_name": "ValeurHR", "location": "Singapore", "via": "via LinkedIn", "description": "Job Role: Business Analyst\n\nJob Scope: Long term contractual Role of 12 months\n\nWork Location: Singapore\n\nBelow is brief about role:\n\nRoles and Responsibilities:\n• Analyse the Organisation's needs, scope the problem and develop business case to address the problem.\n• Document requirements, source and evaluate alternatives, and recommend solution that best fits the Organisation’s needs.\n• Work with Organisation's vendor and app vendor on the solutions and design to seek clarification and acceptance.\n• Work with Ministry of Manpower users to ensure smooth deployment and adoption of new solution.\n• Perform business analysis:\n\na. Identify stakeholders, techniques and processes to manage, track and trace requirements.\n\nb. Refine and clarify business need, define solution scope and develop business case\n\nc. Explore, identify and document business needs.\n\nd. Assess current state, analyse stated requirements of stakeholders and elaborate to sufficient details that accurately defines business... need within specified scope.\n\ne. Source and evaluate alternatives to identify solution that best fits business need, identify gaps, and determine workarounds/changes to the solution. Assess deployed solutions to see how well they met the original need.\n\nf. Manage conflicts, issues and changes to ensure stakeholders and project team remain in agreement on solution scope, communicate and manage expectations of stakeholders.\n\nRequirements:\n• Tertiary Education in relevant fields is preferred.\n• Hands-on experience in related field is preferred\n• Hands-on experience in at least 1 full project development life cycles.\n• Advantageous to have:\n\na. Consulting or Business Analysis experience\n\nb. Business Analysis certification (Certification of Competency in Business Analysis™ (CCBA®), Certified Business Analysis Professional™ (CBAP®).\n\nc. Up to date on product trends, best practices and technologies.\n• Strong analytical, conceptualisation and problem solving skills.\n• Ability to take a broad, strategic perspective as well as drill deep to understand business needs and challenges.\n• Results and customer oriented.\n• Team player with strong organization and people handling skills.\n• Excellent communication skills, both oral and written, with the ability to pitch ideas and influence stakeholders.\n• Working knowledge of Cloud and Agile\n\nCandidate's who require sponsorship for employment visa need not apply for this", "extensions": ["2 days ago", "Contractor"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Contractor"}, "job_id": "eyJqb2JfdGl0bGUiOiJCdXNpbmVzcyBBbmFseXN0IiwiY29tcGFueV9uYW1lIjoiVmFsZXVySFIiLCJjb21wYW55X21pZCI6Ii9nLzExYzczXzRrczUiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJvY0VhRGJ6MTd6RXFiYnpfQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VTB4d1lYTTFVbVoxWDNGWE5uWnROWEJIZFhoak1tWTNRWHBHU21aRldHOHhUbkl0UmxsUlRFcFdSMUl5TjI5M1IwRndNWE5hZFhKS1dHSTVZV015ZFc1elowVjVVVk5GZG5OMVpub3pXWFJsT1VaV1gwMWFVMXBpYURSbE1WOVFhbmg0U1cxalZsQjNRV0V0TWt0RU1sSjRWRmhSWW5kWWRWazVjRU5EU1VoRVFXWkZkRFJaYTFWRU1YbHFOVm94TFVRMlZsSTViMnhQU0dsbkVoWXdNMjFEV1V4WWNraDBURlowUVdFeWJWbExTVVJuR2lKQlQwMVpVbmRCV0hjelVERkJXREZ6YVMxNlZGUnZOMlp0Vm5Gbk1qbDFhWFpuIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL3NnLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvYnVzaW5lc3MtYW5hbHlzdC1hdC12YWxldXJoci0yNTEzMzU1MDE0P3JlZklkPTljMzQyNmIxLWJkZjYtNGI1YS05Mzk5LWQ3ZWQxNjc5YTBmZVx1MDAyNnRyYWNraW5nSWQ9V0UwYUpUN2lGTG0wSlVyQVZGWmFRZyUzRCUzRFx1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Business Analyst - Digital Transformation (Agile | Up to $8K + AWS )", "company_name": "ScienTec Personnel", "location": "Singapore", "via": "via Joblum Singapore", "description": "Business Analyst - Digital Transformation (Agile | Up to $8K + AWS)\n• Public Sector Working Opportunities!\n• Agile focused!\n• Working Hours: Monday - Friday\n• Working Location: Central\n• Basic up to $8000 (commensurate with experiences and skills)\nJob Responsibilities:\n• Involve in Business Analysis Planning and Monitoring using Agile methodology\n• Analyse stakeholders’ needs, scope the problem and develop business case to address the problem\n• Assess current state, analyse stated requirements of stakeholders and accurately defines business need within specified scope\n• Uncovering and capturing requirements as stories into a master story list\n• Build narratives and acceptance criteria for the highest priority stories in upcoming iterations/sprints\n• Validate the acceptance tests\n• Progressively signoff completed stories with users\n• Provide continual feedback to the development team\nJob Requirements:\n• Knowledge and experience in product / industry’s trends, best practices and... technologies\n• Minimum 2 years of Consulting or Business Analysis experience\n• Business Analysis certification, i.e. Certification of Competency in Business Analysis (CCBA), Certified Business Analysis Professional (CBAP), Agile Certified Practitioner (ACP) from the Project Management Institute (PMI), Certified Scrum Master will be an added advantage\n\nIf you are excited with this opportunity and enjoy making things happen, do apply now!\n\nOR\n\nEmail your updated resume to: speytu@scientecpersonnel.com\nBy submitting any application or resume to us, you will be deemed to have agreed & consented to us collecting, using, retaining & disclosing your personal information to prospective employers for their consideration. If you wish to withdraw your consent or correct any of your personal data, please drop us an email at scientecpdpa@scientecconsulting.com to let us know.\n(Note: Any resumes of job applications sent to this mailbox will not be attended as it is solely for the purpose of personal data protection related matters.)\nWe will contact you if your skills and experience are suitable for the role, or if there is a similar opportunity that is available presently or in the future.\nElane Yap Theng Yu- R1989397\nScienTec Consulting Pte Ltd - 11C5781", "extensions": ["27 days ago", "Full–time"], "detected_extensions": {"posted_at": "27 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJCdXNpbmVzcyBBbmFseXN0IC0gRGlnaXRhbCBUcmFuc2Zvcm1hdGlvbiAoQWdpbGUgfCBVcCB0byAkOEsgKyBBV1MgKSIsImNvbXBhbnlfbmFtZSI6IlNjaWVuVGVjIFBlcnNvbm5lbCIsImNvbXBhbnlfbWlkIjoiL2cvMTFkeHB0ZjAwOSIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Ijg4aFZFY1FsMEs5eU9wN3ZBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2WUJDcmNCUVU1VlgwNXhVV1l4VFV4QldUWnlhVzF4YW5GQ09WVm5UME5PU1dsNU1HcGtheTAyVWt0eU9WWkpNamhqVlRCR1lsWklVWEZIYkcwd2MweDNSMWhoVTA5UlMzaERjRmxtYlRacmEyUlVkV3RxUmxONmVVazFhREpqVG1rMmNrRmxPR2Q1VWpKNFdsYzVSRFI0Ym1oc2FucG9XVXg0Tm5rMWJtRmxaWEUyWWtrelMxcEphemRCTWpWNFpubHdWMjgxUTNOZlMyeHVUazVEYTIxclozcGxNRWcyUVdWd2QyeE1UMDl2V1RWWmJHTk1ORlYyYkZGdkVoWXdNMjFEV1V4WWNraDBURlowUVdFeWJWbExTVVJuR2lKQlQwMVpVbmREVFc1RU9Vd3lZVGR3TkVaZlFrSmxTVE50Y2twVVIzRjZRMU5uIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMTUiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9ibHVtIFNpbmdhcG9yZSIsImxpbmsiOiJodHRwczovL3NnLmpvYmx1bS5jb20vam9iL2J1c2luZXNzLWFuYWx5c3QtZGlnaXRhbC10cmFuc2Zvcm1hdGlvbi1hZ2lsZS81ODU2MDg/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Technical Analyst", "company_name": "Genesis Networks Pte Ltd", "location": "Singapore (+1 other)", "via": "via Neuvoo", "description": "Job Description\n\nA Service Desk Technical Analyst (TA) is an information technology (IT) professional who helps both internal or external users resolve issues with computer hardware or software. They respond to user inquiries, assess problems and issues with IT equipment and applications, and help resolve these issues for users either via remote assistance, email or over the phone. They take detailed notes of the problem the user is experiencing, determine steps they can take to resolve the issue, and manage the flow of incoming support requests. This involves asking questions to determine the full scope of the user’s issue. They also work closely with other IT department personnel to provide assistance on tasks that are outside the scope of their knowledge or expertise.\n\nTechnical Analyst needs to balance creative and technical problem-solving, customer service, and collaboration to ensure that customers can access and utilize the software and resources they need for work.\n\nTechnical... Analyst must be abreast with the latest developments and trends in the industry. They should be technology-savvy and be able to resolve all the technical difficulties remotely. The core skills that employees should possess are:\n• Extensive knowledge of information technologies and systems.\n• Ability to coordinate at multiple levels and provide great customer service.\n• Taking ownership of all IT related issues.\n\nTechnical Analyst needs to train internal and external customers from non-technical backgrounds on information systems. They also have to work with vendors to resolve any technical issues for the clients or organizations.\n\nTechnical Analyst balance direct user support with technical knowledge to resolve software and hardware issues. Hence, Technical Analyst needs to possess the following skills:\n• Technical skills - because TA frequently play a direct role in resolving user issues, TA will need excellent technical and computer skills\n• Problem-solving skills - TA are primarily problem-solvers, so they should be able to devise technical and creative solutions to user issues\n• Communication skills - effective communication is key in this role, since TA needs to gather data about problems, prepare detailed notes and reports, and walk users through the steps they can take to resolve software and hardware issues\n• Time management - TA needs excellent time management skills and should be able to set priorities when handling multiple cases\n• Team collaboration – TA routinely work with other IT personnel to resolve user issues, so they need to successfully collaborate with other team members and co-workers\n\nYour job duties will include but not limited to:\n• monitoring uptime performance and alerts for all Managed Service Customers infrastructure from the NOC\n• handling incoming queries and help requests from customers, either via remote assistance, email or over the phone.\n• determining steps they can take to resolve the issue, and manage the flow of incoming support requests. This involves asking questions to determine the full scope of the user’s issue.\n• resolving user technical issues reported by customers.\n• remotely accessing the user’s computer and making changes to their system and settings.\n• walking the user through steps they can take to resolve the issue on their own.\n• quickly devise a solution to the problem without involving any onsite support.\n• escalating user support requests to higher-level Technical Specialists and experts if they are unable to resolve the issue on their own.\n• detailing and providing the onsite Technical Specialist with notes regarding the problem, steps they have already taken to resolve the issue, and their diagnosis of the user’s problem. For complex cases, the TA may arrange to bring back the customer’s hardware so that Technical Specialists can conduct further analyses and determine how to fix the problem.\n• throughout the user support process, TA maintains detailed records of user issues with software and hardware.\n• analysing and diagnosing complex issues with data regarding recurring issues and problems reported by multiple users.\n• providing recommendations to prevent future problems.\n• support users by performing system tests and updates after completing the troubleshooting and necessary repairs to prevent future issues and service interruptions and ensures that troubleshooting and updates have not caused problems elsewhere within the system.\n• TA may also walk users through update and installation processes for software and peripherals\n• creating, editing, and maintaining IT documents that include FAQ documents for users with common issues and how to resolve them without opening a ticket; and department documents that outline standard operating procedures and practices, and help sheets that can be distributed throughout the Service Desk department.\n\nJob Path & Minimum Requirement\n\nThe following section is intended to serve as a general guideline for each relative dimension of project complexity, responsibility and education/experience within this role.\n\nTechnical Analyst (TA)\n\nSalary Range : S$ 1,800 to S$ 2,500\n\nMinimum Years of relevant experience : 1 Year\n\nMinimum Academic Qualifications : Certificate / Diploma in a computer science or information technology field\n\nRelevant IT Certifications or equivalent :\n\nMTA in one of the following:\n• Networking Fundamentals\n• Windows Server Administration Fundamentals\n• Security Fundamentals\n• Cloud Fundamentals\n\nCOMPTIA or equivalent I.T. Certifications in related field\n\nITIL® Foundation Certification - IT Service Management\n\nOther trainings attended / certifications obtained\n\nAttended any technical courses in software, hardware, operating systems and troubleshooting\n\nAttended basic training of Cloud Management Software such as ManageEngine, BitTitan and etc\n\nSenior Technical Analyst (STA)\n\nSalary Range : S$ 2,500 to S$ 3,500\n\nMinimum Years of relevant experience : 3 Years\n\nMinimum Academic Qualifications :\n\nAssociate degree in engineering, computer science, information technology or related field\n\nRelevant IT Certifications or equivalent :\n\nMCSA Windows Server 2012/2016; or\n\nMCSA Office 365; or\n\nMCSA Windows 10;\n\nObtain at least 2 of the COMPTIA Certifications:\n• CompTIA IT Fundamentals+,\n• CompTIA A+,\n• CompTIA Network+\n• CompTIA Security+\n• CompTIA Server+\n\nITIL® Practitioner Certification - IT Service Management\n\nCisco Certified Entry Networking Technician (CCENT); or\n\nCisco Certified Technician (CCT): Routing and Switching\n\nOther trainings attended / certifications obtained :\n\nAttended any technical courses in systems/network software, hardware, server operating systems and troubleshooting\n\nAttended basic training of any servers management and installation\n\nAttended basic training of any backup solution", "extensions": ["5 days ago", "Full–time"], "detected_extensions": {"posted_at": "5 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJUZWNobmljYWwgQW5hbHlzdCIsImNvbXBhbnlfbmFtZSI6IkdlbmVzaXMgTmV0d29ya3MgUHRlIEx0ZCIsImNvbXBhbnlfbWlkIjoiL2cvMTFkeHExN3M4MCIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IkhEeGVEbG9kTUJuOWxrdVVBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVvc0NDc3dCUVU1VlgwNXhVVTQyWkRVdGRHaHNjSFJJWVd0Mk5EVm1hWEZmWW5CM1kwbzNaVFpWVUc5ZlNWbHllVVU1U0hwd2FTMTVOa2xSWjJnd09VaE1VR2xyWkV4RU0weFpRMHhMZHpaaldHWldRemx4YVhRelpqbEVWVmgwUlZGRmRGSnRZMjVFT1c1dFYweFlTV1JSVkdOalMyVTVXVXQ1Vms1NWMyZGtjVWxIWlZOSmVYWlhjazVIUmxKT1JYbGtXbXQ0WHpsVE1HbExVSGxvVFZkNlNGZEtSRWxZWkhsZmVsUlZRMlp1Y0RSdGFrTllRbFppY21SM2RtMVJhMlZ5UlRjeVZVaExWRFJtYWpkQ2NEbHdFaFl3TTIxRFdVeFlja2gwVEZaMFFXRXliVmxMU1VSbkdpSkJUMDFaVW5kRU0zZ3llSFJNYWpWaVoycFFkRTFVVkZKNlVHbFdRMnB3YzJoQiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzIzIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE5ldXZvbyIsImxpbmsiOiJodHRwczovL3NnLm5ldXZvby5jb20vdmlldy8/aWQ9MmUzMDUyMWFjMTVlXHUwMDI2dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Analyst EUC & Service Desk - ST-FNC210223 004/02", "company_name": "Xcellink Pte Ltd", "location": "Singapore (+1 other)", "via": "via Workable For Job Seekers", "description": "Our client is a multinational information technology and communications engineering company. With their expansion scheme, they are now looking for Analyst EUC & Service Desk.\n\nYour responsibilities will be as under (but not limited to):\n• Incidents and service requests refers to tickets or cases that is logged by end-users through the incident and service request management system. General coverage on the delivery of incidents and service request will be shown respectively under Support Hours and Location, Operation Level Objective, Support Scope, Supported Devices and Other Requirements.\n• To resolve approximately amount of 1200 deskside support related incidents and service requests within 12 months.\n\nKey skills and experience required:\n• Minimum six (6) years of Desktop Support, ICT End User Computing or Service Desk Agent experience with networking and system administration experience as well as exposure in project management in ICT project\n\nPossess at least one (1) of the... following certification or educational qualification:\n• Microsoft Certified Solution Expert (MCSE) in one or more of the following: Desktop Infrastructure, Server Infrastructure, Communication -or equivalent;\n• Microsoft Certified Systems Administrator (MCSA) or equivalent;\n• Desktop: CompTIA A+ 220-801/ 220-802, CompTIA PDI+ or equivalent\n• Microsoft Certified Masters (MCM) or Microsoft Certified Architect (MCA) or equivalent;\n• Cisco Certified Network Associate (CCNA) or Cisco Certified Internetwork Expert (CCIE) or equivalent", "extensions": ["Over 1 month ago", "Contractor"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Contractor"}, "job_id": "eyJqb2JfdGl0bGUiOiJBbmFseXN0IEVVQyBcdTAwMjYgU2VydmljZSBEZXNrIC0gU1QtRk5DMjEwMjIzIDAwNC8wMiIsImNvbXBhbnlfbmFtZSI6IlhjZWxsaW5rIFB0ZSBMdGQiLCJjb21wYW55X21pZCI6Ii9nLzExYzczcHJjcXkiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJHanBOQUhJQ3BrZXEwZXNiQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdllCQ3JjQlFVNVZYMDV4VVVGV2RubFpPSGcyTmw4M2NHRm5SVzFJWldvMExVUTNkSEZKTW1kV2FITnBibTlKWlV0RWJtRkxOR3RvZEZZd1pFRkRSbTF1YlRsS1MxcE5VRWRxWjNobU1sSnJhbE5HYWtaVlRIbFRXbWRHTFVoeFZXSTJXV0l3V0hVNVEydzVYM2hqTVdKT2NqTlpSVXhUV2pSRlkwTldXVlpmWVVoa1VrWnlNbFpUTXpsSlZHcGtjSFV0Wkc5SVlqbFpUa3RuV2xacVFWOUliMmgwY0c1S1UyTklNMWxYTkROWlNrSlVhazFUUmxONlIwZFZFaFl3TTIxRFdVeFlja2gwVEZaMFFXRXliVmxMU1VSbkdpSkJUMDFaVW5kQ1EwSk5NVXQyZUUwMFNIaHZRbTVTVTBSb09XRjFkbHBvY1RKUiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzMwIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFdvcmthYmxlIEZvciBKb2IgU2Vla2VycyIsImxpbmsiOiJodHRwczovL2FwcGx5LndvcmthYmxlLmNvbS94Y2VsbGluay9qLzRDMTIwN0VGRTMvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Cyber Security Analyst", "company_name": "Steenbok", "location": "Singapore", "via": "via Snaphunt", "description": "Over the years, it has cultivated a niche in interconnecting applications from mobile and web frontends to the traditional ERP systems through middleware. Today, its best value to the customer is its experience and ability in cross-application connectivity.\n\nTo date, its business has remained as that of an outsourced IT arm to the industries.\n\nThe Role\n\nWe are looking for Cyber Security Analysts with hands-on experience. If you are keen to work in a bank, this could be a good opportunity for you.\n\nResponsibilities\n• Provide IT Security operations support\n• Manage IT Security incidents, threats, programs and analytics\n• Protect IT asset and data\n• Adhere to IT Security best practices, compliance and regulatory requirements\n\nIdeal Profile\n\nRequirements\n• An IT diploma or degree\n• Familiar with IT Security tools\n• Good analytical skills\n• Good Cyber Security skills with knowledge of security best practices and concepts\n• IT Security certification is advantageous\n\nWhat's on Offer?\n• Work... within a company with a solid track record of success\n• Work alongside & learn from best in class talent\n• Excellent career development opportunities", "extensions": ["9 hours ago", "$48K a year", "Full–time"], "detected_extensions": {"posted_at": "9 hours ago", "schedule_type": "Full–time", "salary": "$48K a year"}, "job_id": "eyJqb2JfdGl0bGUiOiJDeWJlciBTZWN1cml0eSBBbmFseXN0IiwiY29tcGFueV9uYW1lIjoiU3RlZW5ib2siLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IkRKUk1ENlp4aXZPV1ZXX3pBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gU25hcGh1bnQiLCJsaW5rIjoiaHR0cHM6Ly9zdGVlbmJvay5zbmFwaHVudC5jb20vam9iLzEwOTYwODg5P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "SGUnitedJobs SOC Senior Analyst", "company_name": "Itcan Pte. Limited", "location": "Singapore", "via": "via Monster Singapore", "description": "(a) TWO (2) years of experience working in a Security Operation Center with security monitoring and escalation of threats responsibilities;\n\n(b) Relevant training on the proposed products, and has obtained professional certification such as GIAC Information Assurance Certified Intrusion Analyst (GCIA), GIAC Information Assurance Certified Incident Handler (GCIH), or equivalent.\n\n(a) Providing continuous technical monitoring (such as intrusion identification, event correlation and threat containment), detection, correlation, analysis and support involving handling of cyber event such as identifying user security issues;\n\n(b) Performing initial analysis (e.g. analysing and reviewing alerts, eliminating false positives and determining severity of threats) to determine impact of compromise;\n\n(c) Determining the nature, mechanisms and scope of incident by performing event correlation and historical searches to determine the extent of a security compromise;\n\n(d) Performing event correlation... across the In-Scope Institutions to identify similar attack pattern and spread of attack;\n\n(e) Handling case management, generating tickets and reports when required, and tracking open tickets until closure;\n\n(f) Generating incident or investigative reports", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTR1VuaXRlZEpvYnMgU09DIFNlbmlvciBBbmFseXN0IiwiY29tcGFueV9uYW1lIjoiSXRjYW4gUHRlLiBMaW1pdGVkIiwiY29tcGFueV9taWQiOiIvZy8xMWR4cHN0ejl0IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoibEpMRW1oVDh3UFVyanNXa0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZZQkNyY0JRVTVWWDA1eFUzZzVOekE1TVRKaldHeFRRV28xZUhCc1puZGlOVWh3VjIwMVVIaFlZV0ZTTWxoTmNFSnBTR1F0ZEUxQ2NVdFRTWEZzZUV0b1JETmZlbTlCUkZCMlIyWnNUMFJhV0U5QlRucDZXVTlyU2xSSlNVRTJPVlZ0WkVJNWVVeE9lVEpYYzJKNGFuWkhkMHBVYlU5Q2VreDZUMFpoVkdoT1owaHdUV3hvTWpCalIzcFhTazl6Y1VaWFlYWjRkRmhFZDFwU0xWTXhkR2h3VFdNNVVEVlFjR05zVG0xQmVGbElRVVYxYjFGWGVXVlJNVzVWRWhZd00yMURXVXhZY2toMFRGWjBRV0V5YlZsTFNVUm5HaUpCVDAxWlVuZEVSVTFLVmxGVE9HUnBXbVUwVUZoVWJsQTNOa1I2Wm1ORFoyWjMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY180MiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNb25zdGVyIFNpbmdhcG9yZSIsImxpbmsiOiJodHRwczovL3d3dy5tb25zdGVyLmNvbS5zZy9hbXAvam9iLXZhY2FuY3ktLXNndW5pdGVkam9icy1zb2Mtc2VuaW9yLWFuYWx5c3QtaXRjYW4tcHRlLWxpbWl0ZWQtc2luZ2Fwb3JlLTI3NDI2NDc3Lmh0bWw/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "#sgunitedjobs It Business Analyst (avaloq)", "company_name": "STEENBOK PTE LTD", "location": "Singapore (+1 other)", "via": "via MNC Jobs Singapore | MNC Jobs In Singapore", "description": "We are looking for an IT Business Analyst with Avaloq expertise in private banking domain.\n\nResponsibilities\n• Handle all aspects of business analysis, user stories, requirements gathering, BRD, technical analysis and testing.\n• Liaise closely with various business representatives, business users and development teams.\n• Write technical specifications\n• Handle implementation of Avaloq wealth suite\n\nRequirements\n• Diploma/Degree in IT or related discipline\n• Avaloq experience is a must\n• Knowledge in private banking operations and products\n• Technical BA\n• Avaloq Certified Professional (ACP) preferred", "extensions": ["7 days ago", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiIjc2d1bml0ZWRqb2JzIEl0IEJ1c2luZXNzIEFuYWx5c3QgKGF2YWxvcSkiLCJjb21wYW55X25hbWUiOiJTVEVFTkJPSyBQVEUgTFREIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJpS1Q4ZHV1bGN5ckt0TFdhQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1OQyBKb2JzIFNpbmdhcG9yZSB8IE1OQyBKb2JzIEluIFNpbmdhcG9yZSIsImxpbmsiOiJodHRwczovL3NnLm1uY2pvYnouY29tL2pvYnMvc2d1bml0ZWRqb2JzLWl0LWJ1c2luZXNzLWFuYWx5c3QtYXZhbG9xLXNpbmdhcG9yZS0xOTQ5NjM/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Agile Business Analyst - HSBC Life", "company_name": "HSBC Group", "location": "Singapore", "via": "via Jobs", "description": "Agile Business Analyst - HSBC Life:0000F1N7Description The health and safety of our employees and candidates is very important to us. Due to the current situation related to the Novel Coronavirus (2019-nCoV), we’re leveraging our digital capabilities to ensure we can continue to recruit top talent at HSBC. As your application progresses, you may be asked to use one of our digital tools to help you through your recruitment journey. If so, one of our Resourcing colleagues will explain how our video-interviewing technology will be used throughout the recruitment process and will be on hand to answer any questions you might have. Some careers open more doors than others. If you’re looking for a career that will unlock new opportunities, join HSBC and experience the possibilities. Whether you want a career that could take you to the top, or simply take you in an exciting new direction, HSBC offers opportunities, support and rewards that will take you further.HSBC Life is a world-class... institution where you can specialize in Insurance but enjoy the advantages that come with being part of a leading global international bank. Insurance is about people, and the promises they make. At HSBC Life we help deliver on these promises by providing a wide variety of life insurance products and services to our clients throughout the Asia-Pacific region.Our employees enjoy a dynamic and innovative workplace and a world of opportunities to develop their careers in a high-profile growing business segment. We empower our team of high-performing individuals to build skills and explore new experiences to realize the full potential of being part of HSBC.Together we pursue efficient ways of working. We harness the latest data and technology solutions to achieve meaningful outcomes for our clients. The protection we offer creates broad and lasting impact, helping clients to be healthier, more productive and more confident in their futures.We are currently seeking a high calibre professional to join our team as a Vice President, Agile Business Analyst – HSBC Life. Principal Responsibilities As a project lead, manage end to end key Insurance project initiatives and demonstrate good governance to meet exacting timescales necessary to comply with Insurance Portfolio Delivery requirements (including control of resource, timeline, budget, scope and tollgate documentation and risk control) As Scrum Master, responsible for leading and presenting in local project steering committee chaired by Business Lead/sponsor on the progress. Managing multiple work stream in the projects and drive in daily scrum ceremony, weekly working group. Proactively update senior team on the risk/issues/milestone and promptly escalate /recommend path to Green1, ensuring the scope, cost, timeline is effectively managed and within project timeline. Defining the approach and dealing with complex requirements and unique projects, often multiple initiatives/works within Insurance Portfolio. This is not limited to leading multiple initiatives from Idea Outline until benefit realization for product, sale, distribution, digitalization, process streamlining and regulatory/compliance projects. Achieving Business outcome and Customer outcome benefits as per strategic goals which are set out in the business case. Excellent stakeholder Management up to ‘C’ Level (e.g. CEO/COO/CFO/CDO) Well equipped with soft influencing skills to drive effective solutions to meet the aggressive deadline. Hands on, actively lead and engage “POD” business partner teams (including new business, underwriting, product, digital delivery, vendor, IT, distribution, Finance, Actuarial, policy services) to drive multiple and stretch target project outcomes, ensuring Business achieve target AOP. Good understanding of Business requirements for Singapore Insurance Business and drive governance through Business Transformation Management Framework, Business Case, User Story, and tools like Clarity, Status Report and Open Workbench Work under both Waterfall and Agile Methodology to driving a culture of achievement Actively engage in PMO activities, from prioritization of backlogs, seek investment fund and quarterly outcome in Jira and ensure accurate information is being capture via real time reporting. Qualifications Requirements Project management, Business Analyst skills with at least 10 years’ experience as project or programme lead handling large and complex transformation within the Banking or Insurance Industry Experience in managing challenging stakeholders of different work streams In depth and well-rounded experience working on change projects in the banking and Insurance industry. Proven track record in Stakeholder management, requiring impactful communication, influencing and running project governance Implementation, change management and benefits realization. Good prioritization, organizational, time management skills Ability to work in dynamic and fast pace culture. Hands on attitude and being able to cope with a wide range of different requirements and project aspects including data migration, process streamline, finance, pricing, products, vendor and infrastructure. Excellent presentation, verbal and written communication skills. Strong team player promoting and environment of cooperation and trust. PMP or MSP Certified Scrum Master Certified FLMI certified or equivalent Excellent in using Excel, PowerPoint., Jira/Confluence for presentation/reporting To be considered for this role, the relevant rights to work in Singapore is required. You’ll achieve more when you join HSBC. www.hsbc.com/careers HSBC is committed to building a culture where all employees are valued, respected and opinions count. We take pride in providing a workplace that fosters continuous professional development, flexible working and opportunities to grow within an inclusive and diverse environment. Personal data held by the Bank relating to employment applications will be used in accordance with our Privacy Statement, which is available on our website", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBZ2lsZSBCdXNpbmVzcyBBbmFseXN0IC0gSFNCQyBMaWZlIiwiY29tcGFueV9uYW1lIjoiSFNCQyBHcm91cCIsImNvbXBhbnlfbWlkIjoiL20vMDF2cTFmIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiaDQ5WXZaT3VNc3RQWG5CakFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFZHTmpUazVmVTNCV1JGOW1WbnAyZVhjM2QzZGtOVkp3YmtOYVFVOWFhME41YWpKdWRWUk5aekpYVmpOcGJGSTRhVzAxUW01eFRuZHlPRlUzYjNsYVN6Tm9TbHBrUmw5SlRWTkRZMFpwZDBkdmRGbGlYM2xtZVZVMU9WWkZhazVwYlVNMlN6Uk5ORGhoTlRKRmNucFRkVmxKYkhsVU1VVllTR2hLZGkxRVMwMHRlVU55UjA5R2NFOVZhMGRhZERCRVVIcFFZV3hGTWpOcmRHeEJFaFl3TTIxRFdVeFlja2gwVEZaMFFXRXliVmxMU1VSbkdpSkJUMDFaVW5kRE4zZHljMFZCTFZSNmVISkpZbWRTVG1adFpFWjZMVXRoZWxOMyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzUzIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnMiLCJsaW5rIjoiaHR0cHM6Ly9zZy5maWRhbnRvLmNvbS9qb2JzL2pvYi1vcGVuaW5nL2J1c2luZXNzLWludGVsbGlnZW5jZS1hbmFseXN0cy9hZ2lsZS1idXNpbmVzcy1hbmFseXN0LWhzYmMtbGlmZS0yNzc4NjY0MTI/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "AML Business Analyst", "company_name": "AccionLabs", "location": "Singapore", "via": "via SmartRecruiters Jobs", "description": "Company Description\n\nAccion Labs is a global technology services firm with offering a full range of product life-cycle services in the emerging technology segment. This includes Web 2.0, Open Source, SaaS/Cloud, Mobility, IT Operations Management/ITSM, Big Data and traditional BI/DW.\n\nThrough nine global offices and a rapid-response delivery model, Accion offers a range of engagement models such as turn-key projects, extended-teams, shared-IP development, offshore-leveraged engagements and professional staffing (contract, contract-to-hire & direct perm).\n\nRole: - Project Manager\n\nRequired\n\n· Have managed large transformational Mainframe platform migration / re-hosting projects\n\n· Understanding of Mainframe application related to infra needs\n\n· Knowledge and understanding of UX / Linux\n\n· Should have hands-on experience in projects\n\n· Strong project management skills. PMP certification is an added advantage\n\n· Have run a large complex project of at least 5m++\n\n· Ability in managing and... handling 3P vendors providing application porting services and workload solutions services.\n\n· Experience in contract administrations\n\n· Ability in managing cross-country / regional / virtualization resources in projects\n\n· Managing at CxO level customer\n\nJob Description\n\nRole: - AML Business Analyst\nJob Description\n• Minimum 5 years of relevant banking experience as a Business Analyst\n• Knowledge in Database UNIX. Oracle DB knowledge required\n• Mantas and Actimize Knowledge will be a plus. AML experience is required\n• Logical and analytical thinking process.\n• Experience in SIT, UAT Support, Cross sector engagements with other groups such as corporate banking.\n• Ability to interact with cross functional teams and PMs, architects, regional and global stakeholders acroscountries and time zones\n• Ability to write understand verify FRD BRD\n• Experience in end user management skills\n• Broad understanding of financial and technology services industries.\n• Organized structured in approach.\n• Focused on quality of output as well as the speed of delivery.\n• Ability to work effectively in situations requiring analytical, interpretive, and problem solving techniques.\n• Strong interpersonal and verbal written communication skills.\n• Ability to work efficiently within team environments and as an individual contributor.\n• An appreciation for the Technology Analyst role, customer service focus\n\nAdditional Information\n\nAll your information will be kept confidential according to EEO guidelines", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBTUwgQnVzaW5lc3MgQW5hbHlzdCIsImNvbXBhbnlfbmFtZSI6IkFjY2lvbkxhYnMiLCJjb21wYW55X21pZCI6Ii9nLzExZHhwcW0xNnYiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJVbzcyc3VSZk11dlF0UDMwQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VTNJNWVGTlVOVmhpTVhCaFJIQnlOMVF3ZUdzMFNVTkxVVWRaYlZwVWRXUnVMVzV4UlhORk1sRjFaa2R2ZFZWMFgyTnRkMEp6UkdobGRrVjBNMWRGZW5FMFgyUlZNblYwVEV4MFRYQlZSSE5EU1VoWlJHcHBaR3h6VlhkVVRsSTRTbWgxWms5UlIwVlJhalY2VmxKRWQydEVOMVJMVkRoTmEyb3RaVWhpVUVGclQyd3daMGRDZDJ4aFRqSlNNSGhmV0d4NExYUTFSRGhvUlhWQkVoWXdNMjFEV1V4WWNraDBURlowUVdFeWJWbExTVVJuR2lKQlQwMVpVbmRDYmt0NFQzTTRZa2hYVWpWUFVVeEpaV2xaTlZndFNGTkpWR0ZCIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNTkiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gU21hcnRSZWNydWl0ZXJzIEpvYnMiLCJsaW5rIjoiaHR0cHM6Ly9qb2JzLnNtYXJ0cmVjcnVpdGVycy5jb20vQWNjaW9uTGFiczIvMTA5MTYxNzQ3LWFtbC1idXNpbmVzcy1hbmFseXN0P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Management Information System Analyst (MGR/AVP), Service Analytics & Quality, Commercial Service Centre, Global Wholesale Banking Corporate Office", "company_name": "OCBC Bank", "location": "Singapore", "via": "via EFinancialCareers", "description": "Management Information System Analyst (MGR/AVP), Service Analytics & Quality, Commercial Service Centre, Global Wholesale Banking Corporate Office\n\nAs Singapore's longest established local bank, we are constantly on the lookout for exceptional individuals to join our team.\n\nAs a Singapore Quality Class (SQC), Singapore Service Class (S-Class) and People Developer (PD) certified department by Enterprise Singapore, you can be assured that Commercial Service Centre is committed to invest and develop our people.\n\nIf you are a go-getter with high level of drive to gain hands-on experience in a thriving and supportive workplace, do come and join us today.\n\n• Manage department's information repository via touchpoints and CRM\n• Analyse and report on volume & capacity trends, shrinkage, service performances and SLA adherence\n• Provide valuable insights from data to support business/product directives and cost management\n• Improve metrics for operational excellence, including service levels... adherence, forecast versus actual variance and occupancy\n• Work as a team contact for incident management - check call/touchpoint drivers, coordinate with teams and update stakeholders\n• Manage root cause analysis when service goals are missed\n• Manage schedules and daily exceptions to ensure efficient staffing to achieve agreed service targets\n• Work closely with internal stakeholders with required data & analysis to processes\n• LI-VN\n\nQualifications\nRequirements\n• At least Bachelor's degree in Computer Science, Statistics, Mathematics or related field or equivalent\n• At least 4 years of related work experience\n• Strong working knowledge and experience in data management & analytics\n• Knowledge and proficiency in at least Excel Macros, data programming & visualisation tools. Proficiency in workforce management tools is advantageous but not essential\n• Strong project management skills and attention to detail\n• Passionate about customer service with excellent problem solving, communication & collaboration skills to work at all levels\n• Ability to think independently and to work under pressure", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJNYW5hZ2VtZW50IEluZm9ybWF0aW9uIFN5c3RlbSBBbmFseXN0IChNR1IvQVZQKSwgU2VydmljZSBBbmFseXRpY3MgXHUwMDI2IFF1YWxpdHksIENvbW1lcmNpYWwgU2VydmljZSBDZW50cmUsIEdsb2JhbCBXaG9sZXNhbGUgQmFua2luZyBDb3Jwb3JhdGUgT2ZmaWNlIiwiY29tcGFueV9uYW1lIjoiT0NCQyBCYW5rIiwiY29tcGFueV9taWQiOiIvbS8wNTVyMjciLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiI1V0xERHJYSFhwcl9GM21GQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VVdwSVJqUjFSV1pDU1c0eGFGSnpXVlZUYUZOcU5YWkhRVGt3TmxwTVJIZHRObHBHTWxkYU1tUnlVWEZ0Y1dSSk0zWXhTSGRhVkVGcFYyUkZUSEV4ZWt4RGMyOXVhVk5qUTBwWVdXUlplSGQyZVV0b1FVSjFlR2RVZVhKYVZteEJTM1F4Tm5WVmJHRTVhRmxKY3pCMFRIbHBUWGRzVFZKa1Vub3paSGg1TVc0NFpFOXdhM1JyYjNCeWEwZHFURVYyVVhGT1NVNWplUzFUU1ZoQkVoWXdNMjFEV1V4WWNraDBURlowUVdFeWJWbExTVVJuR2lKQlQwMVpVbmREYVdkM2NHdHlZVGhvTVVwRVZXOVRWa0ZEZVZGNGFraFphWEJSIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNjYiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gRUZpbmFuY2lhbENhcmVlcnMiLCJsaW5rIjoiaHR0cHM6Ly93d3cuZWZpbmFuY2lhbGNhcmVlcnMuZnIvZW1wbG9pLVNpbmdhcG91ci1TaW5nYXBvdXItTWFuYWdlbWVudF9JbmZvcm1hdGlvbl9TeXN0ZW1fQW5hbHlzdF9NR1JBVlBfU2VydmljZV9BbmFseXRpY3NfX1F1YWxpdHlfQ29tbWVyY2lhbF9TZXJ2aWNlX0NlbnRyZV9HbG9iYWxfV2hvbGVzYWxlX0JhbmtpbmdfQ29ycG9yYXRlX09mZmljZS5pZDEwNzcwMjY3P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Business Operations", "value": "GC06"}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Accounting and Finance", "value": "GC01"}, {"text": "Science and Engineering", "value": "GC27"}, {"text": "Advertising and Marketing", "value": "GC03"}, {"text": "Customer Service", "value": "GC10"}, {"text": "Legal", "value": "GC17"}, {"text": "Protective Services", "value": "GC23"}, {"text": "Management", "value": "GC18"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Property", "value": "GC24"}, {"text": "Sales and Retail", "value": "GC26"}, {"text": "Social Services and Non-Profit", "value": "GC28"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "Business analyst", "value": "business analyst"}, {"text": "Analyst", "value": "analyst"}, {"text": "Security analyst", "value": "security analyst"}, {"text": "Systems analyst", "value": "systems analyst"}, {"text": "It analyst", "value": "it analyst"}, {"text": "Data analyst", "value": "data analyst"}, {"text": "System analyst", "value": "system analyst"}, {"text": "Support analyst", "value": "support analyst"}, {"text": "Associate", "value": "associate"}, {"text": "Management analyst", "value": "management analyst"}, {"text": "Operations analyst", "value": "operations analyst"}, {"text": "Soc analyst", "value": "soc analyst"}, {"text": "Test analyst", "value": "test analyst"}, {"text": "Intelligence analyst", "value": "intelligence analyst"}, {"text": "Research analyst", "value": "research analyst"}, {"text": "Senior", "value": "senior"}, {"text": "Senior analyst", "value": "senior analyst"}, {"text": "Control analyst", "value": "control analyst"}, {"text": "Manager", "value": "manager"}, {"text": "Project analyst", "value": "project analyst"}, {"text": "Researcher", "value": "researcher"}, {"text": "Risk analyst", "value": "risk analyst"}, {"text": "Service analyst", "value": "service analyst"}, {"text": "Technology analyst", "value": "technology analyst"}, {"text": "Accounting analyst", "value": "accounting analyst"}, {"text": "Application analyst", "value": "application analyst"}, {"text": "Behavior analyst", "value": "behavior analyst"}, {"text": "Business", "value": "business"}, {"text": "Center analyst", "value": "center analyst"}, {"text": "Compliance analyst", "value": "compliance analyst"}, {"text": "Coordinator", "value": "coordinator"}, {"text": "Desk", "value": "desk"}, {"text": "Desk analyst", "value": "desk analyst"}, {"text": "Financial analyst", "value": "financial analyst"}, {"text": "Functional analyst", "value": "functional analyst"}, {"text": "Hr analyst", "value": "hr analyst"}, {"text": "Interns", "value": "interns"}, {"text": "Operations center", "value": "operations center"}, {"text": "Process analyst", "value": "process analyst"}, {"text": "Programmer analyst", "value": "programmer analyst"}, {"text": "Project manager", "value": "project manager"}, {"text": "Qa analyst", "value": "qa analyst"}, {"text": "Senior associate", "value": "senior associate"}, {"text": "Senior consultant", "value": "senior consultant"}, {"text": "Specialist", "value": "specialist"}, {"text": "Sr analyst", "value": "sr analyst"}, {"text": "Support executive", "value": "support executive"}, {"text": "Technical analyst", "value": "technical analyst"}, {"text": "Technical architect", "value": "technical architect"}, {"text": "Trainee", "value": "trainee"}, {"text": "Treasury analyst", "value": "treasury analyst"}, {"text": "Wealth management", "value": "wealth management"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Internship", "value": "INTERN"}, {"text": "Part-time", "value": "PARTTIME"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Research", "value": "/business/naics2007/5417"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Mining", "value": "/business/naics2007/21"}, {"text": "Real Estate", "value": "/business/naics2007/53"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Engineering Services", "value": "/business/naics2007/5413"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Utilities", "value": "/business/naics2007/22"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "SingTel", "value": "/m/020zfl"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "Trustwave", "value": "/m/0n3xjf5"}, {"text": "Government Technology Agency", "value": "/g/11gh0528nq"}, {"text": "OCBC", "value": "/m/055r27"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "Credit Agricole Group", "value": "/m/028vbm"}, {"text": "UL", "value": "/m/01q1gj"}, {"text": "VISA", "value": "/m/01kqjn"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "American Express", "value": "/m/01w6dw"}, {"text": "Avensys Consulting", "value": "/g/11g7022gjf"}, {"text": "Binance", "value": "/g/11hcz1r4wl"}, {"text": "BlueVoyant", "value": "/g/11h1y4qdlf"}, {"text": "Caterpillar", "value": "/m/0319hp"}, {"text": "Cognizant Singapore, Cognizant Technology Solutions", "value": "/m/03bf9h"}, {"text": "DBS Bank Ltd", "value": "/m/01q7n5"}, {"text": "Deloitte SEA", "value": "/g/11f_g4x9d_"}, {"text": "Dyson", "value": "/m/05cskg"}, {"text": "EPAM Systems", "value": "/m/0dlnrc"}, {"text": "Experis Singapore", "value": "/g/11dxpnwm3s"}, {"text": "HSBC", "value": "/m/096k1t"}, {"text": "JPMorgan Chase & Co.", "value": "/m/01hlwv"}, {"text": "Jobline Resources Pte Ltd", "value": "/g/11gp2647pn"}, {"text": "Marina Bay Sands Pte Ltd", "value": "/m/09mhd9q"}, {"text": "Medtronic", "value": "/m/03z4j3"}, {"text": "Mizuho Bank", "value": "/m/022103"}, {"text": "Public Service Division", "value": "/g/11g6__bv10"}, {"text": "RECRUIT EXPRESS PTE LTD", "value": "/g/11g706hzhq"}, {"text": "RHB Singapore", "value": "/g/11c73srg7f"}, {"text": "Randstad", "value": "/m/08pt1z"}, {"text": "Randstad Singapore", "value": "/g/11g70b50mr"}, {"text": "SITA", "value": "/m/06l20z"}, {"text": "Selby Jennings", "value": "/g/11fy2ds3gn"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "Xcellink Pte Ltd", "value": "/g/11c73prcqy"}, {"text": "Xilinx", "value": "/m/03dwkc"}, {"text": "103 Golden Agri International Pte Ltd", "value": "/g/11fy210tb9"}, {"text": "Activate Interactive Pte Ltd", "value": "/g/11dxq192l5"}, {"text": "Amazon", "value": "/m/0mgkg"}, {"text": "Apple", "value": "/m/0k8z"}, {"text": "Aramco", "value": "/m/01qjg2"}]}]}