{"search_metadata": {"id": "60827a27f716ee744dc4445a", "status": "Success", "json_endpoint": "https://serpapi.com/searches/ed82df7f51a8f8e9/60827a27f716ee744dc4445a.json", "created_at": "2021-04-23 07:41:27 UTC", "processed_at": "2021-04-23 07:41:27 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28software+engineer%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=100", "raw_html_file": "https://serpapi.com/searches/ed82df7f51a8f8e9/60827a27f716ee744dc4445a.html", "total_time_taken": 5.08}, "search_parameters": {"q": "(software engineer) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "100"}, "jobs_results": [{"title": "Software Engineer (linux)", "company_name": "CAREER TREND PTE. LTD.", "location": "Singapore (+1 other)", "via": "via MNC Jobs Singapore | MNC Jobs In Singapore", "description": "Roles & Responsibilities\n\nJob Scope:\n\na) User Administration Support\n• Change management\n• Add/ Change/ Remove\n\nb) Software Operation Support\n• Daily application support\n• Incident and Problem analysis\n\nc) Inventory and Entitlement Management\n• Asset Management\n• Application software package version tracking\n• End of support dates tracking\n\nd) Admin/Compliance\n• Appropriate client related courses\n• Email\n• Meetings\n• Service Reporting\n\ne) Vendor Management\n• Handling of all liaisons and escalations to Software vendor\n• Managing Software vendor with respect to problems escalated to them\n\nPrefer RHCE or RHCSA certified Linux engineer.\n\nKindly email resume in MS WORD format with a recent PHOTO and send it to jc@careertrend.com.sg\n\n3 years exp", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciAobGludXgpIiwiY29tcGFueV9uYW1lIjoiQ0FSRUVSIFRSRU5EIFBURS4gTFRELiIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiTEFNWGV5NnJNQ0tobk5WYUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNTkMgSm9icyBTaW5nYXBvcmUgfCBNTkMgSm9icyBJbiBTaW5nYXBvcmUiLCJsaW5rIjoiaHR0cHM6Ly9zZy5tbmNqb2J6LmNvbS9qb2JzL3NvZnR3YXJlLWVuZ2luZWVyLWxpbnV4LXNpbmdhcG9yZS0yMzE5MDQ/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Backend Software Engineer - Senior or Junior", "company_name": "Osim International Pte. Ltd.", "location": "Singapore (+1 other)", "via": "via Monster Singapore", "description": "OSIM is looking for talented BACKEND SOFTWARE ENGINEER (Senior or Junior)who are interested in creating IoT products in an open and flexible agile environment. Depending on your personal capability, you can be either a Tech Leader or Key Team member. We will reward the right person competitively for their service.\n\nWhat are you waiting for!!! If you are able to:-\n\nWork closely with fellow Backend Engineers, Frontend Engineer, Product Owner, UI/UX Designers to define, refine, and implement features on the IoT and AI related product lines.\n\nWork closely with Electronic Engineer on the interface between backend and Communication Daughter Cards (CDC), define interfaces (e.g. REST API andcommunication data structure).\n\nWork closely with DevOps to build frameworks and tools, define standards (e.g. REST API) and improve overall efficiency of the development (e.g., CI/CD) and hygiene of the codebase (i.e., Git).\n\nWork closely with QAs to make sure the key API and UI are covered by automation... testing and manual testing.\n\nWork on complex engineering problems to improve the scalability, security, and reliability of our platform.\n\nHave hands-on programming and architecture design skills with demonstrated willingness and capability to learn new technologies quickly.\n\nThe right talent will have:-\n\n1 ~ 7 years of backend software engineer relevant working experience.\n\nBe able to use programming languages to solve complex problems in a given time with clean code style and modularized code structure. Prefer Python and C#.\n\nExperience of cloud services, (e.g. AWS, Azure), backend frameworks (e.g. .Net Core and Flask), relational database (e.g. MySQL), CI/CD flow (Docker, Circle CI, Travis).\n\nStrong understanding of system performance and scaling, Demonstrated ability to design, build, and deliver complex, successful REST servicesand/or customer experiences efficiently and with quality.\n\nExperience of working in an Agile team, preferably in roles exposed to full cycle scrum product development.\n\nBe able to own the product with proactive and responsible attitudes.\n\nAdditional Advantage:\n\nAI (NLP or CV) knowledge and experience\n\nIoT product knowledge and experience\n\nEntrepreneur experience\n\nBeing able to review the CDC code in C language", "extensions": ["4 days ago", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJCYWNrZW5kIFNvZnR3YXJlIEVuZ2luZWVyIC0gU2VuaW9yIG9yIEp1bmlvciIsImNvbXBhbnlfbmFtZSI6Ik9zaW0gSW50ZXJuYXRpb25hbCBQdGUuIEx0ZC4iLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjZmYmVZVzFuVzBYZU55enpBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTW9uc3RlciBTaW5nYXBvcmUiLCJsaW5rIjoiaHR0cHM6Ly93d3cubW9uc3Rlci5jb20uc2cvYW1wL2pvYi12YWNhbmN5LWJhY2tlbmQtc29mdHdhcmUtZW5naW5lZXItc2VuaW9yLW9yLWp1bmlvci1vc2ltLWludGVybmF0aW9uYWwtcHRlLWx0ZC1zaW5nYXBvcmUtMjczMzM4ODUuaHRtbD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior Software Engineer - Back End", "company_name": "TeamSpirit Singapore Pte Ltd", "location": "Singapore (+1 other)", "via": "via NodeFlair", "description": "Ideal candidate:\n\n● Agile self learner, highly self-motivated with strong sense of product ownership and creative problem solver.\n● Deeply passionate about software coding/development and building great web applications.\n● Ability to perform independent research to solve complex technical problems.\n● Good collaborator and team player, comfortable working in a fast moving, culturallydiverse and globally distributed team environment.\n\n● Currently living in Singapore.\n\nResponsibilities:\n\n● To develop quality programs on assigned tasks and beyond.\n● To work as a dev member of a Scrum team together with other dev engineers, QAs andproduct managers.\n● To maintain consistency, maintainability, scalability, and performance of the productswhile focusing on customer experience and satisfaction.\n● To proactively clarify and understand requirements and estimate work volume.\n● To document specification, design and knowledge sharing information.\n● To actively take part and contribute in meetings... and workshops.\n\nMinimum qualifications:\n\n● At least 3 years working experience as a software engineer developing Java or Salesforce Apex solutions.\n● High coding standards - understanding of test coverage, best practices, clean code.\n● Familiar with Agile (Scrum) development.\n\nPreferred qualifications:\n\n● Solid knowledge on Salesforce Apex development.\n● Prior experience configuring and developing Salesforce solutions for customers.\n● Existing Salesforce certification, preferably Platform Developer 1 or 2", "extensions": ["Over 1 month ago", "$6.5K–$9.5K a month", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time", "salary": "$6.5K–$9.5K a month"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgRW5naW5lZXIgLSBCYWNrIEVuZCIsImNvbXBhbnlfbmFtZSI6IlRlYW1TcGlyaXQgU2luZ2Fwb3JlIFB0ZSBMdGQiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Ikhlc2RjdFk3NDgwRVBkTHlBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTm9kZUZsYWlyIiwibGluayI6Imh0dHBzOi8vd3d3Lm5vZGVmbGFpci5jb20vam9icy9saXN0aW5ncy83NzkwP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Staff Software Engineer - Java", "company_name": "VISA", "location": "Singapore", "via": "via Jobs", "description": "Company Description Common Purpose, Uncommon Opportunity. Everyone at Visa works with one goal in mind – making sure that Visa is the best way to pay and be paid, for everyone everywhere. This is our global vision and the common purpose that unites the entire Visa team. As a global payments technology company, tech is at the heart of what we do: Our VisaNet network processes over 13,000 transactions per second for people and businesses around the world, enabling them to use digital currency instead of cash and checks. We are also global advocates for financial inclusion, working with partners around the world to help those who lack access to financial services join the global economy. Visa’s sponsorships, including the Olympics and FIFA™ World Cup, celebrate teamwork, diversity, and excellence throughout the world. If you have a passion to make a difference in the lives of people around the world, Visa offers an uncommon opportunity to build a strong, thriving career. Visa is fueled... by our team of talented employees who continuously raise the bar on delivering the convenience and security of digital currency to people all over the world. Join our team and find out how Visa is everywhere you want to be. Job Description and Responsibilities This position is an individual contributor role on the Issuer Processing Platform Development Team. The successful candidate will be part of a team to design and develop REST based APIs and perform unit and integration testing on newly developed components. Candidate will assist with troubleshooting and resolving defects during the software development life cycle. This role will also contribute to building and maintaining Continuous Integration and Continuous Delivery Pipelines. Candidate will interface directly with staff members of Development, Product Management, Project Management, and Quality Assurance.As a key member of the development team, the candidate should be comfortable with driving technical ideas and communicating clearly with technical as well as non-technical audiences. Essential Functions: Design and develop API based applications using Java, utilizing spring framwork. Design, develop, document and implement new functionality, as well as build enhancements, modifications, and corrections to existing software. Develop TDD/BDD unit-tests and oversee execution. Create documentation and procedures for installation and maintenance. Build and maintain relationships with global and virtual teams on software development or support issues. Engage with Quality Assurance team members on defect triage and resolution. Lead development and oversee programmingtesting functions to ensure that projects are securely delivered while fulfilling expectations. Work as part of a development team and establish close working relationships with stake holders, quality assurance, architects, management and peers in engineering. Identify opportunities for further enhancements and refinements to standards and processes. Prepare design documents; evaluate and recommend solutions to meet user requirements; define and implement solutions. Participate in the Agile process including stand-up meetings, sprint planning, reviews and retrospectives. Lead by example; demonstrating accountability, mentoring junior team members, and by contributing to departmental procedures, best practices, and standards. Qualifications Basic Qualifications Minimum of Bachelor’s degree or equivalent At least 6 years of working experience in the IT industry, preferably with advanced web development in Java environment Preferred Qualifications 7-10 years of work experience and a Bachelor’s Degree or 6 years of work experience with an Advanced Degree (e.g. Masters, MBA, JD, MD) or 3 years of experience with a PhD Extensive experience in architecting and developing real-time multithreaded Java applications that are fault-tolerant, scalable and can handle high volumes DevOps experience preferred, with Jenkins, Chef, Kubernetes, CICD, Dockers Experience in building and maintaining Continuous Integration and Continuous Delivery Pipelines Experience in best practices for API development and design patterns. Knowledge of .net code base is a plus Knowledgeable of common developer tool sets such as Java, XML, JSON, REST, Spring etc is preferred Experience in utilizing technologies such as GIT, Maven, JUnit Experience with REST services Design, develop, document and implement new functionality, as well as enhancements, modifications, and corrections toexisting software Experience in creating performing tests and produce results to ensure accurate compliance with project design requirements for compliance, load and performance testing Create documentation and procedures for installation and maintenance Ability to develop code that follows established coding guidelines. Service excellence and innovation; create opportunities; consistently think and act 'ahead of the curve.' Quick learner; self-starter, detailed and thorough. Working knowledge NoSQL DB considered a plus Experience in all phases of software development life cycle including project management, functional requirements definition, technical design, development, testing, quality assurance, system certification, systems implementation and system validation. Consistently able to assess and evaluate problems in a production environment and manage risk to the service when recommending change Strong secure coding practices Strong experience working in an Agile environment. Commitment to Agile values and team-based work. Experience in implementing Application Telemetry to help facilitate real time and remote troubleshooting/performance monitoring Should be able to understand and own component security analysis, including code and data flow review. Collaborate with security team to implement and verify secure coding techniques. Experience in virtualized environments, including deployments, maintenance, and troubleshooting Analyze and troubleshoot deployment issues in a timely manner Additional Information Work Hours Incumbent must make themselves available during core business hours. Travel Requirements This position requires the incumbent to travel for work less than 5% of the time. Mental/Physical Requirements This position will be performed in an office setting. The position will require the incumbent to sit and stand at a desk, communicate in person and by telephone, frequently operate standard office equipment, such as telephones and computers, reach with hands and arms, and bend or lift up to 25 pounds. Visa will consider for employment qualified applicants with criminal histories in a manner consistent with EEOC guidelines and applicable local law", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTdGFmZiBTb2Z0d2FyZSBFbmdpbmVlciAtIEphdmEiLCJjb21wYW55X25hbWUiOiJWSVNBIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJONDYtSzg1RHZtbDlhOWoxQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnMiLCJsaW5rIjoiaHR0cHM6Ly9zZy5maWRhbnRvLmNvbS9qb2JzL2pvYi1vcGVuaW5nL3NvZnR3YXJlLWRldmVsb3BlcnMtc3lzdGVtcy1zb2Z0d2FyZS9zdGFmZi1zb2Z0d2FyZS1lbmdpbmVlci1qYXZhLTI3Nzg0Nzg0OT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior Software Developer", "company_name": "Aegis Technologies Pte. Ltd.", "location": "Singapore", "via": "via Neuvoo", "description": "Join our team to work on the frontlines of cybersecurity software development.\n\nJob Description\nTo be involved in the research and development of new software modules and systems for in-house solutions.\nTo be involved in developing modules/systems/solutions using various languages such as C/C++ and python.\nTo be involved in full-stack development.\nWrite high-quality, clean, maintainable code using software engineering best practices, as well as documentation.\nWorking on databases (Postgresql) to optimise data relations and processing speed.\nAssist with unit testing, bug fixing and performance optimisation.\nAssist in performance tuning in various aspect of the processing solutions.\nLearning Opportunities\nTo learn how to develop software plug-in modules into existing software solutions.\nTo learn how to optimise code down to the lowest level.\nTo be able to keep up to date with the changes in the IT landscape.\nGain skills to research on required technologies to implement the assigned... task.\nGain In-depth networking concepts and DPI Engine knowledge.\nGain Secure coding skills.\nDevelop your problem-solving skills and be a team player.\nRequirements\nDiploma or Bachelor Degree in Computer Science or IT-related fields.\nStrong knowledge and experience in back-end programming language C/C++ and Python.\nExperience with Linux and sys admin.\nFamiliar with database systems (Postgresql), data modelling and data structures.\nExperience in dealing with data packet processing knowledge will be an advantage.\nExperience in multi-thread and multi-core programming.\nMinimum 3 years of working experience in software development.\nThe appointment will commensurate with experience", "extensions": ["7 days ago", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgRGV2ZWxvcGVyIiwiY29tcGFueV9uYW1lIjoiQWVnaXMgVGVjaG5vbG9naWVzIFB0ZS4gTHRkLiIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiRGxsUWhvRWdlRVpnUGtzekFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBOZXV2b28iLCJsaW5rIjoiaHR0cHM6Ly9zZy5uZXV2b28uY29tL3ZpZXcvP2lkPWE0ZTgxZTA5Mjk1ZFx1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Software Developer (Mobile apps)", "company_name": "THE TALENT SHARK PTE. LTD.", "location": "Singapore", "via": "via LinkedIn", "description": "Job Description\n\nThe role of the Software Developer will be responsible for designing, developing, and implementing business solutions for the company and its clients. The role also comprises on-site/offsite low-level requirements gathering, understanding client’s needs, and working with the architects to come up with a viable solution.\n\nQualifications\n\nBachelors or Associate degree in IT discipline. 3-5+ years in software development or equivalent.\n\n3-5+ years work experience with the following languages and tools:\n• Good working experience on mobile development by using IOS(Swift), Android (Kotlin), or Xamarin.\n• Familiar with Apple and Google store App deployment\n• Good understanding of development methodologies, testing practices, and tools and knowing when to apply each method to achieve the desired outcomes.\n• Familiarity with architecture styles/APIs (REST, API, MVC)\n• Client/Server scripting framework (JavaScript, Angular.js, React JS, Node.js)\n• Excellent troubleshooting and... communication skills\n• BSc/BA in Computer Science, Engineering or a related field\n• Knowledge of security standards and techniques for web applications\n• Understand browser-specific compatibility issues\n• Expertise in the design, implementation, and deployment of user-centric software, with a focus on usability\n• Added advantages\n• Understanding and practicing Agile methodologies\n• Certification in mobile development or equivalent\n• Familiar with Cloud application deployment such as (azure, AWS or google cloud)\n• Experience in Java-based mobile application\n• Experience in Java/J2EE, .Net, and/or mobile Technologies\n• Good knowledge of DevOps (Jenkins), automated testing would be beneficial.\n\nResponsibilities\n• Report to Development Lead\n• Develops software solutions by studying information needs; conferring with users; studying systems flow, data usage, and work processes; investigating problem areas; following the software development lifecycle.\n• Determines operational feasibility by evaluating analysis, problem definition, requirements, solution development, and proposed solutions.\n• Documents and demonstrates solutions by developing documentation, flowcharts, layouts, diagrams, charts, code comments, and clear code.\n• Prepares and installs solutions by determining and designing system specifications, standards, and programming.\n• Improves operations by conducting systems analysis, recommending changes in policies and procedures.\n• Updates job knowledge by studying state-of-the-art development tools, programming techniques, and computing equipment; participating in educational opportunities; reading professional publications; maintaining personal networks; participating in professional organizations.\n• Protects operations by keeping information confidential.\n• Provides information by collecting, analyzing, and summarizing development and service issues.\n• Accomplishes engineering and organization mission by completing related results as needed.\n• Supports and develops software engineers by providing advice, coaching, and educational opportunities.\n• Provide level 2 and 3 support to business users", "extensions": ["4 days ago", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBEZXZlbG9wZXIgKE1vYmlsZSBhcHBzKSIsImNvbXBhbnlfbmFtZSI6IlRIRSBUQUxFTlQgU0hBUksgUFRFLiBMVEQuIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJNZWlyT3NSMV9INkRuRjE1QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExpbmtlZEluIiwibGluayI6Imh0dHBzOi8vc2cubGlua2VkaW4uY29tL2pvYnMvdmlldy9zb2Z0d2FyZS1kZXZlbG9wZXItbW9iaWxlLWFwcHMtYXQtdGhlLXRhbGVudC1zaGFyay1wdGUtbHRkLTI1MTA4MjQ5MjU/cmVmSWQ9NTNkNWM2YjktOTNlNS00ZTNmLThkOWMtYmI2YWQ2ZDQxYTQ4XHUwMDI2dHJhY2tpbmdJZD1jNVNybFhSOEE2c3hGamxEMUowY2FRJTNEJTNEXHUwMDI2cG9zaXRpb249N1x1MDAyNnBhZ2VOdW09MFx1MDAyNnRyaz1wdWJsaWNfam9ic19qb2ItcmVzdWx0LWNhcmRfcmVzdWx0LWNhcmRfZnVsbC1jbGlja1x1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Senior Software Engineer - Traffic", "company_name": "Twitter", "location": "Singapore (+1 other)", "via": "via Bayt.com", "description": "The Position\n\nThe Traffic team provides infrastructure to enable fast and reliable access to Twitter for anyone, anywhere, on any network. Our mission of shaping the next generation of Twitter traffic control directly impacts the lives of our users, their trust in our platform, and the success of our business. Through software and protocols, traffic steering, global load balancing, and regional content caching and distribution, we remove the barriers that prevent people from participating in the public conversation.\n\nAs a Senior Software Engineer, you will collaborate with highly motivated and wonderful software engineers, data scientists, network architects, and client engineers. You will lead and support innovative solutions to sophisticated and modern engineering challenges, to enhance Twitter’s Edge initiatives. As part of the team, you will learn, teach, grow, and help bring Twitter closer to our users. You will make critical decisions, write designs and code that drives user... growth and satisfaction through reliability and performance improvements.\n\nWhat You’ll Do:\n• Contribute to the team’s vision and articulate strategies to have fundamental impact at our massive scale;\n• Ideate and drive innovative projects that will improve user experience;\n• Provide strong leadership within your very own problem space, through data-driven decisions, robust software designs, and effective delegation;\n• Actively engage with cross-functional teams such as network specialists, data scientists, or client engineers to identify and iterate on game-changing opportunities;\n• Build and maintain high-performance, fault-tolerant and scalable distributed systems;\n• Establish and uphold best engineering practices through thorough code and design reviews and improved processes and tools;\n• Groom junior engineers through mentoring and delegation;\n• Diagnose and solve complex problems in distributed systems, and develop solutions that have a significant impact at Twitter’s massive scale;\n• Drive a culture of trust, respect and inclusion within your team.\n\nWho You Are:\n• You are excited about building massively scalable solutions and top tier services for worldwide impact;\n• You want to iterate quickly and safely on high scale systems;\n• You love to collaborate, mentor, and learn with a great team;\n• Passionate about finding elegant solutions to complex technical problems;\n• Want to challenge yourself, and to work with the best engineers in the industry;\n• You are always looking for opportunities to grow and learn;\n• You enjoy working both collaboratively and independently.\n\nQualifications\n• At least 4 years of software development experience, preferably with backend infrastructure, distributed systems and/or performance analysis;\n• Proven experience with software engineering standard methodologies for iterative development, testing, code reuse, etc…;\n• Strong bias to action, creative problem solving attitude, and proactive communication;\n• Strong design and architecture skills;\n• Excellent written and verbal communication skills;\n• Experience in iOS or Web development is a plus.\n\nCompany Description\n\nTwitter serves the public conversation because conversation is a force for good in the world. The opportunity to help the world connect, debate, learn, and solve problems is what draws us to careers at Twitter, and it’s what keeps us here", "extensions": ["7 days ago", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgRW5naW5lZXIgLSBUcmFmZmljIiwiY29tcGFueV9uYW1lIjoiVHdpdHRlciIsImNvbXBhbnlfbWlkIjoiL20vMGhuMXZjZyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Ikp5Q0J2Wm9zLW9RblBIQ0tBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhWSEExYzBkMk4yZHphMUF6Vm5OdWFUaHpUMTlNYzFFelYyeFFiSFJUU0ZOUFJXNWlOMm8wTlZwZlNVUlRSMnBDZEhKRVV6bEpXV1JWVDBvdFQwZFlVRWhWVGs5SGRXZEJPVGQxV1hWeWRtc3plWFJFYmxwa1duZzNPVlJJTmxkRmVGOU1OWGR4WkZwVVJGZzRUME53ZEhCaVNsZHhWR051YjNvMGRFbDViR2d5YjI5alJuVk9lWFIxVm5sTVFVMUhTR3RMWkMxNVRDMUhZV1puRWhaTVNIRkRXVXBVZVVNNWRVWjBVV0U0TW1GMk5FRlJHaUpCVDAxWlVuZEJjR0pvUTFKTU5YRmZPRUp4WldGaFYxVlhjVFZJYW1GbmIxTlIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18zMyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCYXl0LmNvbSIsImxpbmsiOiJodHRwczovL3d3dy5iYXl0LmNvbS9lbi9zaW5nYXBvcmUvam9icy9zZW5pb3Itc29mdHdhcmUtZW5naW5lZXItdHJhZmZpYy01OTUxMjQ5Mi8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Lead - Autopilot Software", "company_name": "F-drones", "location": "Singapore (+1 other)", "via": "via Glints", "description": "Location\n\nSingapore\n\nRole\n\nYou will join us as a core team member and lead the autopilot software development at F-drones. This is multifaceted and you are expected to build, manage and develop a team as we progress.\n\nThe software stack would be based on either PX4 or Ardupilot and you will be responsible to coordinate with Computer Vision, Embedded and Design teams to build robust autopilot software for the targeted use cases. The target is to build an aviation-standard autopilot with features such as VISLAM (for vision based navigation), detect and avoid, multi-sensor based landing system and smart fail-safes. You are expected to develop/modify control algorithms (based on the feedback from various sub-systems) to suit the flight profile and standard operating procedure.\n\nC/C++ will be the main language used across multiple codebases. ROS may be used by other systems such as VISLAM etc., Development should follow software certification standards (aviation) and you must establish... processes with other teams to ensure that these standards are met. Extensive SIL and HIL simulations must be performed before field testing. Since BVLOS is the main mode of operations, you are required to develop control over LTE capabilities.\n\nYour profile\n• Masters in Electronics/Computer science/Aerospace or similar discipline. Exceptional individuals with lower academic qualifications may be considered.\n• More than 3 years experience working on flight control software development\n• Experience in the entire product development lifecycle, and able to prioritise and meet deadlines\n• Excellent knowledge and understanding of UAV System Dynamics, Flight Mechanics and State Estimation\n• Experience with PX4 or ardupilot\n• Programming experience in C++, Python, ROS, Linux\n• You preach and put into practice the importance of maintainability, relentless testing and enjoy implementing best practices\n• Know-how of RTOS (multi-threading, multi-tasking, POSIX APIs) is a plus\n• Know-how of communication protocols such as MAVLINK, RTPS/DDS\n• Experience with Arm-based microcontrollers (STM32 F4 and F7 families is a plus) and embedded peripherals (USB, SPI, UART, I2C, CAN, DMA, ADC, timers)\n\nWhat do you get\n\nWe are a fast-growing soon to be global tech startup, a first mover in the space, with a potential to revolutionize maritime last mile deliveries. We are well supported by investors around the world who share a common vision!\n\nThis role is located in Singapore, which is one of the best places to live! We embrace flat-hierarchy and you'll get an opportunity to be a leader and chart the company’s strategic directions. You’ll be around a passionate team that offers excellent development opportunities to widen your horizon. You’ll get a chance to make a dent on the universe! Furthermore, we offer a competitive salary, stock options, and career growth opportunities. Learn more about F-drones here", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJMZWFkIC0gQXV0b3BpbG90IFNvZnR3YXJlIiwiY29tcGFueV9uYW1lIjoiRi1kcm9uZXMiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6InRJRUZFM1JkRGNqekFLek5BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gR2xpbnRzIiwibGluayI6Imh0dHBzOi8vZ2xpbnRzLmNvbS9zZy9vcHBvcnR1bml0aWVzL2pvYnMvbGVhZC1hdXRvcGlsb3Qtc29mdHdhcmUvYzlmNTA5MTQtNzI2Ny00MGE0LTgxZmQtYjlkNzFiYjIzNmE5P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Senior Software Engineer", "company_name": "CCRMANAGER PTE. LTD", "location": "Singapore", "via": "via MNC Jobs Singapore | MNC Jobs In Singapore", "description": "We are looking for passionate and talented full-stack Senior Software Engineer to join our team in Singapore. We like team players who are eager to learn, step up to contribute and \"wear different hats\". You will be working in small scrum teams, collaborating with other teams in building and implementing business initiatives in the pipeline. In your role, you will be given a high level of responsibility with flexibility and opportunities to make an impact to a fast-moving team.\n\nJob Responsibilities\n• Participate in sessions with Product Owners to discuss implementation of product backlog items, i.e. new initiatives, product enhancements and feature changes\n• Architect, design, build, and test high-quality products and solutions that are secure, robust, scalable, high-performing and easy to maintain\n• Lead external vendor team in building new applications or modules\n• Collaborate with infrastructure and operations team to deploy solutions across deployment pipeline\n• Propose... technology and tools to improve team productivity and collaboration\n\nRequirements\n• Minimum 7 years of experience in architecting, designing and developing cloud-native web applications for enterprises\n• Skills in Java development, Spring/Spring Boot, JavaScript, React.JS and data modelling\n• AWS certification as Solutions Architect, Developer, or DevOps Engineer (or equivalent skills)\n• Experience and knowledge of SOA and microservices architecture principles\n• Experience in implementing DevOps and having related skills such as CI/CD and Infrastructure-as-Code", "extensions": ["17 days ago", "Full–time"], "detected_extensions": {"posted_at": "17 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgRW5naW5lZXIiLCJjb21wYW55X25hbWUiOiJDQ1JNQU5BR0VSIFBURS4gTFREIiwiY29tcGFueV9taWQiOiIvZy8xMWZodmtieXpyIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiRUFyRTRBc29ENDk1b2h5SEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZZQkNyY0JRVTVWWDA1eFVWaHpZbHBQTVU5aGVGYzNkMjlwWW5adVpVb3pSRGRrVW5WdVgzZEZXSGxsYkV3Mk1WSmFkbXh4YW5WdWFHUnFiRXA0VERGRFdXUkVWSFExUkhWWGFVdG9NbVZJWjI5cFgwdFRTRm8zZVVkMmVYVmFhREpMTTBVME5UVTRNemhNTjA4eWJGVk5lV2MyYVhreE4zaEdkWEU0VFY5aVJWZGFSSFoyYjBRM05uQmFkV3RSVjNKNFlsbzFORnBMWDJoWmJVMHRUM05QWmtkT2EyOXVPVEY1UVZoUU4xWnJNMWRUVFRkYVZXZ3RNM2gzRWhaTVNIRkRXVXBVZVVNNWRVWjBVV0U0TW1GMk5FRlJHaUpCVDAxWlVuZEVPRlIxV0hwcFZGSjZSRWx2ZEhCeWRUWTJkVWxvVm5Ob09FRm4iLCJmY3YiOiIzIiwiZmNfaWQiOiJmY180NyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNTkMgSm9icyBTaW5nYXBvcmUgfCBNTkMgSm9icyBJbiBTaW5nYXBvcmUiLCJsaW5rIjoiaHR0cHM6Ly9zZy5tbmNqb2J6LmNvbS9qb2JzL3Nlbmlvci1zb2Z0d2FyZS1lbmdpbmVlci1zaW5nYXBvcmUtMjIxOTQ1P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Network Engineer", "company_name": "Singtel Group", "location": "Singapore", "via": "via Singtel Careers", "description": "Singtel, Asia’s leading communications technology group, provides an extensive range of telecommunications and digital services to millions of consumers and businesses across Asia, Australia, Africa and the USA. With over 140 years of innovation behind us, we continue to push boundaries in our networks and services, to enrich lives and transform businesses.\n\nOur core values – Customer Focus, Challenger Spirit, Teamwork, Integrity, and Personal Excellence – shape the way we work. We are passionate about making a difference and have an open and inclusive culture where everyone is empowered to do their best. Our diverse business means you will enjoy unique opportunities and rewarding experiences to learn and grow your career in a dynamic industry.\n\nJoin us and experience what it’s like to be with an Employer of Choice*. Together, let’s create a brighter digital future for all. *Awarded at the HR Fest Awards 2020\n\nWe are seeking for a hands-on network engineer, who will be part of the... software development team of the Group Enterprise 5G product house, contributing on the design and implementation for Singtel edge and private cloud. In this position you will work with the 5G product team, to:\n\nResponsibilities:\n• Design a multi-data center edge cloud network including the design of switches, routers and firewall.\n• Understand CIS and IM8 requirements for data centers and private cloud end to end and ensure compliance in the design.\n• Design the security in transportation and routing layer with firewalls and software defined security measures to protect the private datacenter environments.\n• Design fault resilience by planning dual path for all inter and intra data center communications.\n• Manage overall system health and IPMI of servers.\n• Qualify and select the right switches, routers and firewall for private data center setup and expansion.\n• Ensure sound and compliant design\n• Lead and drive the technical design.\n• Understand L2 and L3 networking and design the best routing plan for the private data center.\n• Understand protocols like NAT, BGP, OSPF for designing an optimal routing setup foro the private data center.\n• Own entire Network Architecture Design.\n• Be a team player\n• Be involved in implementation planning, detail design development, as well as UAT/SAT document development\n\nThe ideal candidate should possess:\n• Solid background in network administration and architecture\n• Familiar with campus/building networks and datacentre environment\n• Enterprise Network setup and configuration\n• Practical experience in configuring routers/switches/firewalls\n• Good understanding in Firewall rules configuration and security settings\n• Fine-tuning, problem troubleshooting, interpretation of statistics and traffic patterns\n• Experienced with Structured Cabling (UTP / Fiber)\n• In-depth understanding of communication protocols (mainly TCP/IP) and routing protocols (BGP, OSPF)\n• Knowledge in VLAN, VXLAN technologies, VPN protocols (OpenVPN, WireGuard)\n• Knowledge in SDN/Overlay Networking, Openflow/OVSDB\n• Ability to maintain documentation, diagrams to any changes to the environments and Upto date SOPs\n• Solid understanding of network operating systems\n• Familiar with network tools for administration, maintenance, automation, and visualization/reporting\n• Ability to Participate in the planning, configuration and deployment of client network environment\n• Experience with server’s hardware for HP Blade, VC, SIM, RX integrity series will be advantage\n• Experience with enterprise storage and SANs storage and EMC Powerpath will be advantage\n• Knowledge in Cloud technologies will be an advantage\n\nQualifications\n• Industry-related experience as a Network Engineer\n• Professional certification (e.g. CCNA, CCNP, CCIE)\n\nWe believe in the strength of a vibrant, diverse and inclusive workforce where backgrounds, perspectives and life experiences of our people help us innovate and create strong connections with our customers. We strive to ensure all our people practices are non-discriminatory and provide a fair, performance-based work culture that is diverse, inclusive and collaborative", "extensions": ["20 days ago", "Full–time"], "detected_extensions": {"posted_at": "20 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJOZXR3b3JrIEVuZ2luZWVyIiwiY29tcGFueV9uYW1lIjoiU2luZ3RlbCBHcm91cCIsImNvbXBhbnlfbWlkIjoiL20vMDIwemZsIiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiX19YRW1pME5CMEd3ZDAtQUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFUwOHRSek0xZDA1VU5EbDBXVlJDY2s5cFJuZDZSMjl2VFhRd05rMW9jSHBmV1hnNU16VmplSEo2YzFOeWNUQm5WRkJNVmxwclVqVjNSMDE2TFZoTU1EQm9jRzFzUW1KNU9UazBYemxCV20xeVZIUnlWRVJuWkdSYVpqQk1WRUYyZUZaRWJ6Sm1XbTlPTkRKV00zUlNVWGg1TUhGUlZYaERMVXAzUlZGb2IwaHplVEpXWkRablUyUXllRUZKWVVsemVsWllWRlZDYkdkQk9FbEJFaFpNU0hGRFdVcFVlVU01ZFVaMFVXRTRNbUYyTkVGUkdpSkJUMDFaVW5kRWVGRXpiM0ZYU0VwUlZsRjFYM0l0ZFV4SFJYQnRYMHR6TW10biIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzU0IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFNpbmd0ZWwgQ2FyZWVycyIsImxpbmsiOiJodHRwczovL2dyb3VwY2FyZWVycy5zaW5ndGVsLmNvbS9qb2IvU29mdHdhcmUtRGV2ZWxvcGVyLVNpbmcvNTcyMzI4ODEwLz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}], "chips": [{"type": "Title", "param": "job_family_1", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Software engineer", "value": "software engineer"}, {"text": "Engineer", "value": "engineer"}, {"text": "Senior", "value": "senior"}, {"text": "Cloud engineer", "value": "cloud engineer"}, {"text": "Test engineer", "value": "test engineer"}, {"text": "Research engineer", "value": "research engineer"}, {"text": "Assurance engineer", "value": "assurance engineer"}, {"text": "It engineer", "value": "it engineer"}, {"text": "Java engineer", "value": "java engineer"}, {"text": "Qa engineer", "value": "qa engineer"}, {"text": "System engineer", "value": "system engineer"}, {"text": "Data engineer", "value": "data engineer"}, {"text": "Devops engineer", "value": "devops engineer"}, {"text": "Network engineer", "value": "network engineer"}, {"text": "Principal engineer", "value": "principal engineer"}, {"text": "Quality engineer", "value": "quality engineer"}, {"text": "Solutions engineer", "value": "solutions engineer"}, {"text": "Technical", "value": "technical"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Associate", "value": "associate"}, {"text": "Associate engineer", "value": "associate engineer"}, {"text": "Automation", "value": "automation"}, {"text": "Design engineer", "value": "design engineer"}, {"text": "Development engineer", "value": "development engineer"}, {"text": "Development manager", "value": "development manager"}, {"text": "Engineering manager", "value": "engineering manager"}, {"text": "Firmware engineer", "value": "firmware engineer"}, {"text": "Frontend engineer", "value": "frontend engineer"}, {"text": "Hardware engineer", "value": "hardware engineer"}, {"text": "Lecturer", "value": "lecturer"}, {"text": "Manager", "value": "manager"}, {"text": "Officer", "value": "officer"}, {"text": "Principal", "value": "principal"}, {"text": "Product engineer", "value": "product engineer"}, {"text": "Programmer", "value": "programmer"}, {"text": "Project officer", "value": "project officer"}, {"text": "Research associate", "value": "research associate"}, {"text": "Science", "value": "science"}, {"text": "Security engineer", "value": "security engineer"}, {"text": "Senior engineer", "value": "senior engineer"}, {"text": "Senior lecturer", "value": "senior lecturer"}, {"text": "Senior system", "value": "senior system"}, {"text": "Senior technical", "value": "senior technical"}, {"text": "Services engineer", "value": "services engineer"}, {"text": "Software architect", "value": "software architect"}, {"text": "Software engineering", "value": "software engineering"}, {"text": "Specialist", "value": "specialist"}, {"text": "Stack engineer", "value": "stack engineer"}, {"text": "Systems analyst", "value": "systems analyst"}, {"text": "Systems engineer", "value": "systems engineer"}, {"text": "Technical marketing", "value": "technical marketing"}, {"text": "Testing engineer", "value": "testing engineer"}, {"text": "Trainee", "value": "trainee"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Wholesale", "value": "/business/naics2007/42"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Rental", "value": "/business/naics2007/532"}, {"text": "Staffing", "value": "/business/naics2007/5613"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": ".AB4Jjf.qPB6Vc{padding-right:11px}.qfpP8d{padding:7px 0 7px 11px}.S003Ke{flex:none}.ZoN4Lb{color:rgba(0,0,0,.54)}.nAXVG{color:#70757a}.IxQsL{color:rgba(0,0,0,.26)}.xFO1De{color:#fff}.ooFpK{color:rgba(255,255,255,.30)}.mtnwac{color:#4285f4}.WxeeKb{color:#34a853}.hIVRU{color:#f29900}.EXaTMc{color:#fbbc04}.sxn46d{color:#000}.gqMTF{color:#1a73e8}.zpn8Mb{color:#d93025}.dEUPmd{color:#1e8e3e}.PJNo1{color:#fbbc04}Actively Hiring", "value": "e"}, {"text": "EPAM", "value": "/m/0dlnrc"}, {"text": "VISA", "value": "/m/01kqjn"}, {"text": "Nanyang Technological University", "value": "/m/0l49k"}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Zühlke", "value": "/g/1hh_rg216"}, {"text": "HCL SINGAPORE PTE. LTD.", "value": "/g/11fy25ngsv"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "Experis Singapore", "value": "/g/11dxpnwm3s"}, {"text": "OakTree Consulting", "value": "/g/11g70jfhtq"}, {"text": "Realtek Malaysia", "value": "/m/05wrm7"}, {"text": "TikTok", "value": "/g/11fy265933"}, {"text": "UST", "value": "/m/08kb8g"}, {"text": "UrbanFox", "value": "/g/11ghs7y0w6"}, {"text": "Activate Interactive Pte Ltd", "value": "/g/11dxq192l5"}, {"text": "Cardinal Health", "value": "/m/040vzx"}, {"text": "Cognizant", "value": "/m/03bf9h"}, {"text": "Collins Aerospace", "value": "/m/0kv61y1"}, {"text": "Credit Agricole Group", "value": "/m/028vbm"}, {"text": "DELL", "value": "/m/0py9b"}, {"text": "EPS Consultants Pte Ltd", "value": "/g/11gbxgscvy"}, {"text": "GlobalTix Pte Ltd", "value": "/g/11dxpqdhrf"}, {"text": "HCL Technologies", "value": "/m/0698gv"}, {"text": "Jobline Resources Pte Ltd", "value": "/g/11gp2647pn"}, {"text": "Metropolitan Wireless International Pte Ltd", "value": "/g/11g9m_xbc4"}, {"text": "PALO IT", "value": "/g/11dxpwj75r"}, {"text": "Singapore Press Holdings Limited", "value": "/m/0d7mwh"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "Thales DIS (Singapore) Pte. Ltd.", "value": "/g/11f0197yrz"}, {"text": "Thales Group", "value": "/m/01phj4"}, {"text": "Zendesk", "value": "/m/0wkm4pl"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "Aryan Solutions", "value": "/g/11dxptv4s4"}, {"text": "Atidan Technologies", "value": "/g/11c74f0b8_"}, {"text": "Bee Cheng Hiang Hup Chong Foodstuff Pte Ltd", "value": "/g/11dxpq9hhl"}]}]}