{"search_metadata": {"id": "608279d611c88144b9755724", "status": "Success", "json_endpoint": "https://serpapi.com/searches/3f676894a7561af1/608279d611c88144b9755724.json", "created_at": "2021-04-23 07:40:06 UTC", "processed_at": "2021-04-23 07:40:06 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28solution+architect%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=80", "raw_html_file": "https://serpapi.com/searches/3f676894a7561af1/608279d611c88144b9755724.html", "total_time_taken": 1.04}, "search_parameters": {"q": "(solution architect) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "80"}, "jobs_results": [{"title": "Solutions Architect - Enterprise Business", "company_name": "Tata Communications", "location": "Singapore", "via": "via Neuvoo", "description": "Position Summary\n\nTo provide both a consultancy service to enterprise customers and presales support to the sales teams primarily in Singapore, and secondarily across APAC. SA need to use knowledge of the company's products and services to translate customer requirements into functional, effective and appropriate solutions for the prospective customer base.\n\nMajor Responsibilities\n• Support the development of business opportunities in conjunction with the sales team. Where appropriate provide consultancy to aid customers in the development of their requirements.\n• Understand customer requirements, assist in the qualification processes and by utilizing the company's standard product and services portfolio to create a suitable solution in concept.\n• Actively participate in the RFI/RFP process and development of the technical aspects of proposals in line with customer needs, liaising and qualifying with other colleagues as necessary. Present technical solutions to customers both formally... and informally as required\n• Author the Technical Sections of Proposals for prospective customers for handover to low level design.\n• Participate with sales in winning customer commitment by carrying out specific tasks called for by the sales campaign plan. Generally, this will include presenting the company's technical competence and the customer specific technical solution.\n• Validate appropriate order documentation initiated by sales prior to submission to the order desk or in the case of projects, to brief Project Management and Engineering to ensure they are equipped to deliver the solution.\n• Maintain and develop knowledge of telecommunications products and services, specifically related to an assigned 'Subject Matter Expert' area.\n• Provide product knowledge transfer to other members of the sales organization to enhance their ability to use products to create customer solutions.\n• Stay abreast of technical issues, options and advancements within the industry relevant to the TCL services portfolio.\n\nKey Performance Indicators\n• Provision of sales support to assigned qualified sales opportunities and turning this into successful business wins.\n• Demonstrable maintenance or enhancement of personal technical skills\n• Effective working relationship with other departments participating in the sales process\n• Achievement of ‘Trusted Advisor’ status in customer relationships\n\nSkill requirements (Top 5)\n• Time Management Skills - Ability to multitask and meet multiple timelines.\n• Strong written, oral communication skills (both Mandarin and English) to include presentation skills, interpersonal skills, and a professional business image. Be smart and presentable.\n• Customer focused, Results oriented. Provide a consultative approach to developing customer solutions and design. Demonstrate a high level of maturity and technical knowledge that engenders confidence.\n• Experience of developing long-term business relationships within key decision makers in large organizations. Has a level of maturity and technical knowledge that engenders confidence and is analytical and pragmatic in the understanding of requirements\n• Experience of teaming effectively with others across different disciplines, functions, and organizations. An action-oriented team player with the ability to lead internal and technical discussions.\n\nExperience Requirements\n• Successful track record in the System Integrator/Telecommunications arena, with 10 years industry experience and demonstrable track record in complex customer solution wins.\n• Ability to formulate thorough and compelling technical solutions documentation including detailed diagrams for both customer facing and internal use.\n• The solution architect must possess good customer communication and presentation skills with the ability to progress customer relationship to a ‘trusted advisor’ status. Proven ability is required to assist Sales in strategizing and pitching capabilities and solutions for acquiring new business and growing existing business.\n• Ability to collaborate and work closely with internal Sales, Commercial Management, Product Management, Bid Management and Engineering Teams to put together winning solutions and RFP Responses.\n• Follow through closed deals and solutions to ensure proper order and timely implementation. Detail oriented and very thorough and comprehensive Solution Design Document (SDD) experience required. Ability to self-organize and work within the post sales environment with Project Management and Service Management as necessary", "extensions": ["5 days ago", "Full–time"], "detected_extensions": {"posted_at": "5 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2x1dGlvbnMgQXJjaGl0ZWN0IC0gRW50ZXJwcmlzZSBCdXNpbmVzcyIsImNvbXBhbnlfbmFtZSI6IlRhdGEgQ29tbXVuaWNhdGlvbnMiLCJjb21wYW55X21pZCI6Ii9tLzA0MzM4ayIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Inh6WExZNlpfZDFfUTRXR1JBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2WUJDcmNCUVU1VlgwNXhVWE0xZEhCM2FtVkVTWGc1TFhKc1VFVk9kamMxWlc5cE5HeFROREZDUVZONlpETTViVXB6UjBnd2QwOVpaVmhXWkVOaFluTnpkVU41YVVsR1FYbEVXWEpmYVVKdmMwNXBRazVmZVhwRlZrVlFNbTFtVVRob1gxaEVUM1owYWtJeGVESkdURGhHYVd0MFdHRm1XaTFZT0dKRFpub3dZV0l5UW1ONVpHeHFXalZJY0RZME0yMVdTbk13Ykd4b2FrY3dlVUkyWjB0emVuaHBOR016WVdjMFpYQjZUVFJwT0dSWUxXaEdWM1JrTmxSSkVoWXhNMjFEV1U4eVRrSnpOMHQwVVdFMk0yOXRRVVIzR2lKQlQwMVpVbmRFTXkxbWVWRmlUVVJOU1RoRVdWcG1TRVpDWVVVd2RrTlFaR1ZuIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBOZXV2b28iLCJsaW5rIjoiaHR0cHM6Ly9zZy5uZXV2b28uY29tL3ZpZXcvP2lkPWQyMjRkYWMxMTM3Mlx1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "CRM Solutions Architect (S&I Asia - Tech)", "company_name": "TeleChoice International Limited", "location": "Singapore (+1 other)", "via": "via Snaphunt", "description": "TeleChoice International Limited (“TeleChoice”) is a regional diversified provider and enabler of innovative info-communications products and services. It is a subsidiary of ST Telemedia, a strategic investor in communications and media, data centres and infrastructure technology businesses, across Asia, the US and Europe.\n\nIncorporated in Singapore on 28 April 1998, and listed on the Mainboard of the Singapore Exchange Securities Trading Limited on 25 June 2004, TeleChoice offers a comprehensive suite of info-communications services and solutions for the Consumer and Enterprise Groups under three business divisions.\n\nS & I Systems, established in 1998, is a leading service provider offering end-to-end IT services. We lead digital transformations for clients by modernising their mainstream IT and deploying digital solutions at scale to drive growth and performance.\n\nThrough our key service pillars around cloud, applications, analytics and managed services, we have helped Fortune 500... clients in Asia to optimise and modernise their IT to produce better business outcomes. Together with our ecosystems of valued partners and S&I’s two decades of proven skill sets and methodology, we are confident to help businesses and governments thrive in the digital world.\n\nThe Role\n\nYou will be responsible for :\n• Drive Dynamics CRM implementations through all project phases including discovery, definition, build, test and deploy.\n• Design and lead the system architecture process, in partnership with the Development Team, to create, define specifications for and implement customizations for any custom code or data migration requirements using SQL Server Reporting Services\n• Lead all aspects of the technical sales process and provide guidance to both internal and external stakeholders on overall architect solutions.\n• Serve as clients' main point of contact throughout all project phases, effectively manage associated issues and risks and ensure on-time and on-budget implementation delivery that meets clients' needs and requirements.\n• Identify the client's sales, marketing, and customer service requirements through discovery meetings.\n• Provide scoping work on client’s technical requirements for accurate estimation of cost and effort\n• Present tailored demonstrations of the technology solution.\n• Conduct end-user training and create and maintain knowledge transfer documentation.\n• Facilitate client’s understanding of technical solutions through presentations, design architecture diagrams, user demonstration and benchmarks.\n• Support the development and expansion of the solution by applying specialist knowledge in business processes and Dynamics 365 (including relevant applications and technologies).\n• Develop and continue to refine CRM implementation standards and tools.\n\nIdeal Profile\n• Bachelor's degree in engineering, computer science, mathematics, or equivalent.\n• Certifications in Microsoft Technologies preferably in Dynamics 365 (CRM)\n• Solid proficiency with Microsoft Dynamics 365(CRM)\n• 5 years of working experience in CRM projects for enterprise customers\n• Working knowledge of at least two of the following: C#, ASP.Net, JScript, XML, HTML, SharePoint, Windows Server 2003/SBS 2003 related technologies, data migration & application integration techniques.\n• Communication skills: Ability to effectively communicate technical & business concepts to clients on all levels, presentation skills, ability to disagree with others and explain your position.\n• Excellent presentation, communication, leadership and client development skills to effectively present information to C-level management, public groups and/or board of directors\n• Excellent organizational and multi-tasking skills, attention to quality, self-motivation and a strong desire to succeed.\n• Microsoft CRM Application certification a plus\n• Microsoft SharePoint and Business Intelligence experience a plus\n\nWhat's on Offer?\n• Work within a company with a solid track record of success\n• Great work environment\n• Work alongside & learn from best in class talent", "extensions": ["9 hours ago", "$60K a year", "Full–time"], "detected_extensions": {"posted_at": "9 hours ago", "schedule_type": "Full–time", "salary": "$60K a year"}, "job_id": "eyJqb2JfdGl0bGUiOiJDUk0gU29sdXRpb25zIEFyY2hpdGVjdCAoU1x1MDAyNkkgQXNpYSAtIFRlY2gpIiwiY29tcGFueV9uYW1lIjoiVGVsZUNob2ljZSBJbnRlcm5hdGlvbmFsIExpbWl0ZWQiLCJjb21wYW55X21pZCI6Ii9tLzBjcDVyZHAiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiIxRWY0ZXZuQm5tdDQzaktoQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFcUVDQ3VJQlFVNVZYMDV4VkZwSFZHOW9VM2RJY1hGSVprcFVkVlUxWTBSVlh6bENiV2x2WmxwcVYyOU5MVXRHVFRCcGJXNUZlbmR5U1Y5dlUzSmlOVE5hWlhsYVRHWk5aRmxJTFUxb1JWQkJMVTAxT1V0T1ZteHlUMDVOY2paTlZGbzRkamh0Y25GUmMwNUZUVlZvVVZSQ04xcHNhVE5hY1RoS2VVb3lUbXc0YnkxYWJHcDRkVXAxTjNCQ1FWSkZlVTV4TFdSWU9HSlBlbXBCWWw5UFJ6RktkMU5qTjJsdFJYVk1ZbFZCYkdGbE9WaHFVSHBIWDNCZlNtUmZTRTFGYlRoWllWQjRPRTlaUTFaM1NqRTFWbHBvTWpGTVUzQmZkMVJuT1hNeVNIZHJORWQzVm5sRFVSSVdNVE50UTFsUE1rNUNjemRMZEZGaE5qTnZiVUZFZHhvaVFVOU5XVkozUVhKR1gwMDRVRVJwTWpnd1ZrcEpXbXRTU1dGbk1GSXlSVzFFWnciLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18xNSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBTbmFwaHVudCIsImxpbmsiOiJodHRwczovL3RlbGVjaG9pY2Uuc25hcGh1bnQuY29tL2pvYi81NDE4MDgwOD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Network Architect", "company_name": "Recruitment Hub Asia Pte Ltd", "location": "Singapore (+1 other)", "via": "via Joblum Singapore", "description": "Responsibilities:\n• Practical experience in configuring routers/switches (e.g., CISCO and Alcatel), firewalls(PaloAlto and Checkpoint), and intrusion detection/protection systems.\n• Administration, support & maintenance of campus-wide network infrastructure including the following (but not limited to):\n• Cisco and Alcatel Switches\n• PaloAlto, Checkpoint, Cisco, Juniper Firewalls.\n• Cisco Lightweight Access Points\n• Wireless controller and devices (Cisco and/or Alcatel/Aruba)\n• Aruba ClearPass (CPPM) – Network Access Control Appliance\n• Structured Cabling (UTP / Fiber)\n• Ensure that the campus network is in optimum performance by continually reviewing areas of improvement.\n• Recommend the optimum or alternative solutions\n• Monitor and maintain service availability\n• Accountable for network operations\n• Network fine-tuning, problem troubleshooting, interpretation of statistics and traffic pattern.\n• Firewall rules configuration and security setting.\n• Maintaining and upgrading Firmware... / OS on Network Devices\n• Configuration and maintenance of Layer 2 and Layer 3 Switches\n• Configuration and Implementation of Core Firewalls\n• Configuration and Implementation of Network Access Control Appliance\nRequirements:\n• Degree or diploma in IT, Engineering or Computer science\n• Network support engineer shall have at least three (3) years hands-on\n• Possess industry standard certifications minimally have CISCO Certified Network Engineer certification, or equivalent.\n• Windows applications software skills like MS Word, Excel, Power point, Visio, FTP, TFTP, etc\n• Knowledge of Managed Services and hands on experience on LAN/WAN technologies\n• Knowledge of Layer 2 & 3 Technologies: Good knowledge of Switching technologies like VLAN's, HSRP, Devices: Alcatel & Cisco switches,\n• Experience in managing / administration of Aruba ClearPass.\nInterested candidates please send resumes to asmita.chauhan＠recruitmenthubasia.com to apply.\nWe regret to inform that only shortlisted candidates will be contacted.\nAsmita Chauhan R1980706\nRecruitment Hub Asia Pte Ltd 12C6135", "extensions": ["4 days ago", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJOZXR3b3JrIEFyY2hpdGVjdCIsImNvbXBhbnlfbmFtZSI6IlJlY3J1aXRtZW50IEh1YiBBc2lhIFB0ZSBMdGQiLCJjb21wYW55X21pZCI6Ii9nLzExZHhwd3dfMGYiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJRWHdTcXJWbVNQclVBZEtSQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFb3NDQ3N3QlFVNVZYMDV4VVZjelIzcDBSbVozWmxGRU56Wkdibk5UUm1KVE9WQTRhbVpQU1ZwRE9IWlRSbTVvUmpkcWVFNVRSMWgwYmpKV1QzRktaelEwZEhoalNtWjJlazV2VmxWUGJHdEVZbU5vWWpWdlpuWlZjVzlaV1hOdGIzbENaMk5XUWpaMWNFaHpjbGRoWjNsWldFdG9aSE0wUWsxTFZGUXhTWGh5WDA5emMyTnhRVUV6VkZWeVdXazJSblZRU2toRFptVmxSMVJyZVRCVk1qZHVSRXByVVVoTVJXWkxWVGN4YTBzeFFuRXRkbEk1YlRKS01rNXlaa0UwZGsxTmFHdEdObmxUZUhabmVYUm9NbDlGRWhZeE0yMURXVTh5VGtKek4wdDBVV0UyTTI5dFFVUjNHaUpCVDAxWlVuZEVla0ZJUTJaSllVbEdNUzFDZFZoS1UxSjJaMVpGY1hsUlIwVkIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18yMiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JsdW0gU2luZ2Fwb3JlIiwibGluayI6Imh0dHBzOi8vc2cuam9ibHVtLmNvbS9qb2IvbmV0d29yay1hcmNoaXRlY3QvNjI1NTE0P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Pega Solutions Architect / Senior Developer", "company_name": "Techgig", "location": "Singapore", "via": "via Mendeley", "description": "About Job\n\nCTC Undisclosed Job Location Singapore Experience 4 - 7 yrs\n\nDescription\n\nJ18SGP#SGUnited, Pega Solutions Architect / Senior Developer #SGUnited Location:\nSingapore Date posted:\n28/12/2020 Multiple roles Email:\nHR@YMGIT.com We are looking for a strong PEGA Solutions Architect / Developers with good experience in banking Domain. Idle candidate must have a first class degree in Information Technology, strong Pega implementation knowledge, hands on experience and open to work on Pega Implementation / Development or support projects.\n\nMust have:\nPega PRPC CSA/ /CLSA certification At least 4 years in-depth hands on application development experience in Pega PRPC and Pega frameworks Strong communication and analytical skills Able to work independently in gathering requirements from users, designing, implementing, maintaining application systems and project management Experience in Java, strong experience in development of multi-tier applications using JAVA, Tomcat-5.5, WebLogic... servers. Familiar with web services like SOAP 1.2, WSDL 2.0 and XML 1.0. Good experience in an IT Application Support/Maintenance or Development environment Strong analytical and communication skills Candidate having Banking domain will have an advantage SingaporeOpen", "extensions": ["10 days ago", "Full–time"], "detected_extensions": {"posted_at": "10 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQZWdhIFNvbHV0aW9ucyBBcmNoaXRlY3QgLyBTZW5pb3IgRGV2ZWxvcGVyIiwiY29tcGFueV9uYW1lIjoiVGVjaGdpZyIsImNvbXBhbnlfbWlkIjoiL2cvMTFjNzNmeGd3dCIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IlFLc09VamhwWFFLRXpwWDNBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhVM1I0VGpaaVYyRldaMGRCWVdSeGVWTnlObVZwUlhWZk5FcFNaM2h2WTBSNmFXdzBXbmRRU0VjM1ZqUkhXRVJ1UkVWME5sRlJhbXBFYzFreWVHZFpSVXh3VmtSa2RrbFVMVkF6YlZReFVtTk9OMnhUZDNOVE9WbDJPRUpWT1c5T1pFMHpkbUpYVDE5UlZHOUdhR2hKUzFvM04wSm1XRTlsZVV4SVFtaHNkMjUwVUVrdGR6TTNjSEUxY1ZKR2FsWnFRMTlNVFRCMVIzVTVOWEYzRWhZeE0yMURXVTh5VGtKek4wdDBVV0UyTTI5dFFVUjNHaUpCVDAxWlVuZEJkRlYwTFVKSGNuWnRkMEZZZVdGR1MyeEZhMlV6Y0RNeFVYcEIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18yOSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNZW5kZWxleSIsImxpbmsiOiJodHRwczovL3d3dy5tZW5kZWxleS5jb20vY2FyZWVycy9qb2IvcGVnYS1zb2x1dGlvbnMtYXJjaGl0ZWN0LXNlbmlvci1kZXZlbG9wZXItMTk4MTgwNz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "AWS Solution architect", "company_name": "Oliver James", "location": "Singapore", "via": "via LinkedIn", "description": "Opportunity for an experienced Solutions Architect with AWS certification to join a leading and global organisation in the Insurance/FS industry!\n\nLooking for an individual to work with the technical leadership team to propose and design the system application architecture.\n\nExperience Required:\n• AWS certified Solutions Architect\n• Experienced in the solution architecture- including an understanding of the security\n• Hands on full stack development experience- web applications- angular, CSS, js, .NET, ASP.NET\n\nRegistration No: R1661132\nEA Licence No: 20C0336", "extensions": ["28 days ago", "Full–time"], "detected_extensions": {"posted_at": "28 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBV1MgU29sdXRpb24gYXJjaGl0ZWN0IiwiY29tcGFueV9uYW1lIjoiT2xpdmVyIEphbWVzIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiIyWXl2aE45YjBGVGF1VVJpQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExpbmtlZEluIiwibGluayI6Imh0dHBzOi8vc2cubGlua2VkaW4uY29tL2pvYnMvdmlldy9hd3Mtc29sdXRpb24tYXJjaGl0ZWN0LWF0LW9saXZlci1qYW1lcy0yNTEwODcyNjgyP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "#sgunitedjobs Software Architect(java, Azure)", "company_name": "KG INFORMATION SYSTEMS PTE. LTD.", "location": "Singapore (+1 other)", "via": "via MNC Jobs Singapore | MNC Jobs In Singapore", "description": "The Software Architect shall have at least a Diploma in Computer Studies or related discipline with at least 3yrs of experience as a Software Architect.\n• Shall have attained some recognition of his competency as a Software Architect, e.g. Cloud certification in Azure Solutions Architect Expert or equivalent, Certified Enterprise Java Architect for J2EE platforms, SEI Software Architect Certification or IASA Certified IT Architect Profession or equivalent", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiIjc2d1bml0ZWRqb2JzIFNvZnR3YXJlIEFyY2hpdGVjdChqYXZhLCBBenVyZSkiLCJjb21wYW55X25hbWUiOiJLRyBJTkZPUk1BVElPTiBTWVNURU1TIFBURS4gTFRELiIsImNvbXBhbnlfbWlkIjoiL2cvMTFkeHBncmd6ciIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IlptS3dwTkdyMzlkTkN4NFFBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVxRUNDdUlCUVU1VlgwNXhVVTV6TXpKTVR6Vk5TMDl6ZUMxc0xWSlFUVTVpY0hOVlEyaGtRM2xRYldjM2RXd3RiVE5RWjB4R05VVnNMVnBCVjI1eE9XOHpiakJPY0RrdFMzTnpVRVpXVUdVemQyMHRYelJ5VFVRME5WcGxSbmhoV2xFNU9EaEVOM2hNWldsVWJHNU1hakYxVG05M05ERXhPRVpOYjI5blptaFdSblEwZEUxcVUzQkhPVlpIVG5CSFkyaDNlbkZOZWtGVldVNUdjRzVNTkVjelVFZzFZVGxSVVVGc1dHcFdlRzkzVWxabFUwVlhOWGxFUVd4ak1ua3RiMWRRV21WQ1NUTTFVVkZDV0RkTlZtZzNSRlJPZHpSV2NIRTFhMVpDUzE5ZmNrRmpkRWxFVVJJV01UTnRRMWxQTWs1Q2N6ZExkRkZoTmpOdmJVRkVkeG9pUVU5TldWSjNRelpETmtoS2R6VkNVVVpXVkhkUFlsOUtTV2xJUTBNMVlXb3lkdyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzQxIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1OQyBKb2JzIFNpbmdhcG9yZSB8IE1OQyBKb2JzIEluIFNpbmdhcG9yZSIsImxpbmsiOiJodHRwczovL3NnLm1uY2pvYnouY29tL2pvYnMvc2d1bml0ZWRqb2JzLXNvZnR3YXJlLWFyY2hpdGVjdGphdmEtYXp1cmUtc2luZ2Fwb3JlLTE1NDE5ND91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Google Cloud Platform Architect - Contract", "company_name": "NTT Singapore Digital Business Solutions Pte Ltd", "location": "Singapore", "via": "via Monster Singapore", "description": "Role & Responsibilities.\n• Total experience of 12+ years with Google Cloud Platform (GCP) platform architecture experience of 6+ years\n• Responsible for overall platform architecture\n• Responsible for Capacity estimation and infra & platform services sizing\n• Responsible for defining security strategy of platform (authentication, access control, key management, auditing, log management, etc.) and implementing the strategy\n• Responsible for scalability and performance of system / solution\n• Responsible for defining overall DevOps strategy and implementation\n• Responsible for data archival policy and implementation\n• Architect the ingestion and processing layer\n• Guide the team for the analytics /visualization set up for a new project\n• Hands-on with GCP Compute, Storage, Data, Network, Security, AI Platform and Devops\n• Good hand-on coding experience with Python and PySpark\n• Good hands-on experience with Big Data and ML services on Google cloud - Bigquery, Cloud Data Flow, Cloud Pub... Sub, Cloud BigTable, ML APIs, AutoML and Cloud ML\n• Good knowledge and experience in Serverless Architecture and Security Cloud Functions, Cloud IAM\nNTT Singapore Digital Talent Services.\nEA Reg. No. R1330510 | EA License No. 12C6296", "extensions": ["Over 1 month ago", "Contractor"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Contractor"}, "job_id": "eyJqb2JfdGl0bGUiOiJHb29nbGUgQ2xvdWQgUGxhdGZvcm0gQXJjaGl0ZWN0IC0gQ29udHJhY3QiLCJjb21wYW55X25hbWUiOiJOVFQgU2luZ2Fwb3JlIERpZ2l0YWwgQnVzaW5lc3MgU29sdXRpb25zIFB0ZSBMdGQiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImtJYk5SZFJKWG5zM1NqZC1BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTW9uc3RlciBTaW5nYXBvcmUiLCJsaW5rIjoiaHR0cHM6Ly93d3cubW9uc3Rlci5jb20uc2cvam9iL2dvb2dsZS1jbG91ZC1wbGF0Zm9ybS1hcmNoaXRlY3QtY29udHJhY3QtbnR0LXNpbmdhcG9yZS1kaWdpdGFsLXRhbGVudC1zZXJ2aWNlcy1wdGUtbHRkLXNpbmdhcG9yZS0xNjgwNDQ4P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Enterprise Architect", "company_name": "Capgemini", "location": "Singapore (+1 other)", "via": "via EFinancialCareers", "description": "The role of Enterprise Architect role will generally focus on Infra & Apps related presales solution architecture and technical sales support, with an appreciation of Engineering and Subject Matter Expert skills and capabilities needed. This job description covers all requirements, expanding on the experience and skillsets required for each.\n\nType of Project\n\nThe APAC COE works on a wide range of accounts & projects, across a wide range of clients in all sectors. COE will focus & work very closely across all the Business Units to fulfilling the Cloud and Infrastructure requirements as they arise.\n\nAs an Enterprise Architect you will get exposure to the following types of roles responsibilities\n• PreSales Architecture – responsible for the specification, design, cost and proposal of cloud solutions to meet formal client requirements. Significant client facing work is required.\n• Bid technical leadership – responsible for the technical leadership coordination and solution proposition on... large outsourcing hosting deals. Experience and evidence of architecting and leading delivery of complex cloud projects must be a core capability.\n• Responsible for Billing(50%) & generate revenue via order booking, focus on CM% (Contribution Margin)\n• Technical ownership of COE driven programs/projects & provide/mediate technical consultation\n\nKey Responsibilities\n\nThese are some of the standard responsibilities that we would expect you to be able to have experience delivering.\n• Responsibility for supporting the development and closing of Cloud/Infra/Apps service opportunities for the COE\n• Define and implement a structured way of handling each services opportunity – client meeting/solution pitch/RFP response/RFI response/presentation/etc.\n• Take the lead/participate in opportunity assessment, qualification, developing response strategy, proposal development, review and feedback process, competitive positioning, pricing/commercial decisions.\n• Lead client visits – from the stage of planning, identifying key participants, story board for the meeting, reviewing content, planning demos/team discussions and front ending the discussion.\n• Assist the sales team in prospecting with relevant technical pitch and market/company specific data.\n• Generate collaterals, case studies, white papers, and assist sales in service evangelism.\n• Take on complex project delivery roles, as required, to ensure service quality and to support individual and team billable utilization targets.\n• Support the development of project and consultancy portfolio items and offers for the practice.\n• Provide training and guidance on the cloud including public cloud as well as related platform engineering to sales and account teams.\n• Be recognized as one of the go-to cloud and platform engineering experts in the UK business.\n\nSkills & Experience required\n• Demonstrable experience of selling and/or delivering Cloud/Infra/Apps related transformations\n• Detailed knowledge and experience of some of the following:\n• Migrating to or operating in the cloud with certification in at least one major cloud service provider (AWS, Azure, or Google)\n• Architecture Framework (TOGAF/IAF) is desirable\n• Solutioning technologies like Paas,IaaS, DevOps, DevSecOps, CI-CD\n• AWS and/or Azure platform features and capabilities\n• Kubernetes and Containers\n• Automation and orchestration tooling such as Packer, Terraform, Cloud Formation\n• Proven track record of selling infrastructure services projects and consultancy bids during the pre-sales perspective.\n• Demonstrated performance in complex solutioning and innovative deal construct.\n• Consultative, value-proposition/business case driven pre-sales methodology experience.\n• Strong techno-commercial/business orientation and cost sensitive.\n• Self-driven and motivated, comfortable with change/ambiguity\n• Financial management experience: estimating, budgeting, pricing, risk assessment.\n• Execute on assigned RFP/RFI/proposals/proposal sections and deliver a high-quality response in terms of content, formatting and value-adds.\n• Hands on experience in writing proposals and delivering customer presentations.\n• Hard-working, detailed, quality and deliverable-oriented.\n• Excellent communication and written skills.\n• Excellent presentation and proposal/RFP skills.\n• Completely flexible and mobile to travel globally, as required.\n• Provide technical leadership across the programme of work or project both from Infra and application level\n• Own the overall technical elements on a solution/programme\n• Development of architectural solutions within the programme\n• Worked on bids and costing of architecture solutions\n• Point of contact to senior stakeholders (internal and external) related to technical Architecture\n• Manage any dependencies, risks and requirements between stakeholders\n• Excellent awareness of current IT trends (Cloud/Agile/DevOps) and products that can influence client’s decisions\n• In depth strategic view on outcomes, methodologies and process\n• Provide and manage an effective Architecture governance model\n• Experience working on and have delivered complex Cloud, EUC or Datacentre transformations for large clients", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJFbnRlcnByaXNlIEFyY2hpdGVjdCIsImNvbXBhbnlfbmFtZSI6IkNhcGdlbWluaSIsImNvbXBhbnlfbWlkIjoiL20vMDN2bGswIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoieXJERHBmUGRHdVRSTU9EWkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFZDMVJha2RsVVhaR1pTMHhibWQ2WkVaRlZIRkJNR0pYT1hkVFZYQlZjVU5MYW5kNlMwcG9ZVGxxZEROS2F6UnNXa3BqY25oUlFrZFZVVzFtY0hWVVZuVTNlVmh0YURBeFFWTjVibkkwWlVka2JWQkxlbUp6VURSSkxWQk5hVFZPTlVwbmJEaFRlbEpyY21vMFRVNW1Sa0p5TlROcVJ5MVlPVGQ2Ym1oaGEwODBTakpYZFZOM2MyOTRRM0JXWWtsNVYwczNXR0pYVG5oUk9VRjNFaFl4TTIxRFdVOHlUa0p6TjB0MFVXRTJNMjl0UVVSM0dpSkJUMDFaVW5kQlV6aHNaR3BGV25WaGQzUkRkSGh6TFc5RGVTMVVhMTlHVkZkbiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzUzIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEVGaW5hbmNpYWxDYXJlZXJzIiwibGluayI6Imh0dHBzOi8vd3d3LmVmaW5hbmNpYWxjYXJlZXJzLnNnL2pvYnMtU2luZ2Fwb3JlLVNpbmdhcG9yZS1FbnRlcnByaXNlX0FyY2hpdGVjdC5pZDA4MzI2NDI0P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Solution architect", "company_name": "Wsh experts Pte Ltd", "location": "Singapore", "via": "via Jobs", "description": "Job Description :Job Roles & Responsibilities: Responsible for studying the requirements and developing an implementation strategy to transform the requirements into workable solutions. Guides the developer to ensure proper implementation and act as link between the project team and developers. Ensuring solution developed is cross-browser compatible Smooth integration with other systems Meets accessibility, usability and vulnerabilities guidelines International best practices and government standards. Job Requirements: Shall have at least (3) years of experience as a Solution Architect. Attained some recognition of his/her competency as a Solution Architect, e.g. Microsoft Certified Architect, Certified Enterprise Java Architect for J2EE platforms SEI Software Architect Certification or IASA Certified IT Architect Profession. Shald hold Bachelor Degree and above", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2x1dGlvbiBhcmNoaXRlY3QiLCJjb21wYW55X25hbWUiOiJXc2ggZXhwZXJ0cyBQdGUgTHRkIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJhWHFQbGo2dXZaVzk5UVZ2QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnMiLCJsaW5rIjoiaHR0cHM6Ly9zZy5maWRhbnRvLmNvbS9qb2JzL2pvYi1vcGVuaW5nL2FyY2hpdGVjdHMtZXhjZXB0LWxhbmRzY2FwZS1hbmQtbmF2YWwvc29sdXRpb24tYXJjaGl0ZWN0LTI3NTM2OTk0Nz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Google Cloud Architect", "company_name": "Accenture", "location": "Singapore", "via": "via Accenture", "description": "About Accenture\n\nAccenture is a global professional services company with leading capabilities in digital, cloud and security. Combining unmatched experience and specialized skills across more than 40 industries, we offer Strategy and Consulting, Interactive, Technology and Operations services—all powered by the world’s largest network of Advanced Technology and Intelligent Operations centres. Our 506,000 people deliver on the promise of technology and human ingenuity every day, serving clients in more than 120 countries. We embrace the power of change to create value and shared success for our clients, people, shareholders, partners and communities. Visit us at www.accenture.com.\n\nAccenture is an Irish-domiciled multinational professional services company that provides services in:\n\n1) Technology\n\n2) Strategy & Consulting\n\n3) Interactive\n\n4) Operations\n\nAs a Fortune Global 500 company, it has been incorporated in Dublin, Ireland since September 1, 2009.\n\nWith more than 500,000... employees worldwide—in 200 cities across 51 countries—Accenture also operates more than 100 “innovation hubs,” developing solutions for cloud, finance, and other industries.\n\nAccenture Technology combines business and industry insights with innovative technology services to transform your business. Join one of the world’s largest independent providers of technology services to grow your expertise and help clients worldwide to innovate at scale and transform their businesses. Help change how the world works and lives through technology innovation.\n\nRole: Google Cloud Architect (Associate Manager-Manager)\n\nAccenture's Google Cloud Business Group (AGBG) helps customers transform and modernize their business through the use of Google’s technologies and offerings including global network, web-scale data centers and software infrastructure. You will be an integral member in our entrepreneurial team in this rapidly growing business, helping to shape the future of businesses of all sizes use Google technology to connect with key stakeholders across all levels.\n\nResponsibilities\n• Serve as the Google Cloud Platform (GCP) architect to clients within Accenture team engagements for design, architecture, and deployment in the GCP cloud space using automated orchestration and configuration management techniques\n• Hands-on deployment of enterprise servers, network infrastructure, boundary protection, and cloud architectures using Infrastructure-as-Code\n• Design and develop infrastructure for large scale migration efforts to GCP.\n• Be part of agile project team for implementing Google technologies for client engagements", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJHb29nbGUgQ2xvdWQgQXJjaGl0ZWN0IiwiY29tcGFueV9uYW1lIjoiQWNjZW50dXJlIiwiY29tcGFueV9taWQiOiIvbS8wMXJwMmMiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJyYTJra24zWTNXSndNSWpfQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VWs1UVlucFZRa1Z1VlVKWFJURkVTbkJTY0Vkbk5rVjZjbVZEWVZNMVJITmFUbGczU2tKRmVVbEJZMk4xVDNKRlQyTmZlbDk2VGpFd1ZYTkpha2hvVVVnelNqWldXV05uTVZoSlpYaGpiVEZ1TmpsdVgyaFFOMUJxUVVaVGVsTjVMVU0zWlc5RFEzcHdWRkJFY3pGcE56VnpibHBXYzBkU1RsUTJkbUZsWDJ4MmIzQnRNamRNV2s1VmQyTnVZWHBMTjNaV2Vrd3hNbWR5V1hoUkVoWXhNMjFEV1U4eVRrSnpOMHQwVVdFMk0yOXRRVVIzR2lKQlQwMVpVbmREVWxaV09UVjBjRVF5ZW1oamNIaHBhMUozV2trd1oyaHJiV1ZuIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNjUiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQWNjZW50dXJlIiwibGluayI6Imh0dHBzOi8vd3d3LmFjY2VudHVyZS5jb20vc2ctZW4vY2FyZWVycy9qb2JkZXRhaWxzP2lkPTAwOTI0MDUyX2VuXHUwMDI2dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}], "chips": [{"type": "Title", "param": "job_family_1", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Solution architect", "value": "solution architect"}, {"text": "Solutions architect", "value": "solutions architect"}, {"text": "Architect", "value": "architect"}, {"text": "Cloud architect", "value": "cloud architect"}, {"text": "Technical architect", "value": "technical architect"}, {"text": "Enterprise architect", "value": "enterprise architect"}, {"text": "Senior", "value": "senior"}, {"text": "Consultant", "value": "consultant"}, {"text": "Financial services", "value": "financial services"}, {"text": "Infrastructure architect", "value": "infrastructure architect"}, {"text": "Manager", "value": "manager"}, {"text": "Application architect", "value": "application architect"}, {"text": "Cloud engineer", "value": "cloud engineer"}, {"text": "It architect", "value": "it architect"}, {"text": "Lead architect", "value": "lead architect"}, {"text": "Network architect", "value": "network architect"}, {"text": "Security architect", "value": "security architect"}, {"text": "Senior architect", "value": "senior architect"}, {"text": "Systems engineer", "value": "systems engineer"}, {"text": "Associate director", "value": "associate director"}, {"text": "Deputy", "value": "deputy"}, {"text": "Engineers", "value": "engineers"}, {"text": "Head", "value": "head"}, {"text": "Infrastructure", "value": "infrastructure"}, {"text": "Lab", "value": "lab"}, {"text": "Network engineer", "value": "network engineer"}, {"text": "Presales consultant", "value": "presales consultant"}, {"text": "Public sector", "value": "public sector"}, {"text": "Senior analyst", "value": "senior analyst"}, {"text": "Senior consultant", "value": "senior consultant"}, {"text": "Senior director", "value": "senior director"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Software architect", "value": "software architect"}, {"text": "Solution consultant", "value": "solution consultant"}, {"text": "System architect", "value": "system architect"}, {"text": "System engineer", "value": "system engineer"}, {"text": "Systems analyst", "value": "systems analyst"}, {"text": "Systems architect", "value": "systems architect"}, {"text": "Technical trainer", "value": "technical trainer"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Accounting", "value": "/business/naics2007/5412"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Management", "value": "/business/naics2007/55"}, {"text": "Real Estate", "value": "/business/naics2007/53"}, {"text": "Wholesale", "value": "/business/naics2007/42"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Amazon", "value": "/m/0mgkg"}, {"text": "Microsoft", "value": "/m/04sv4"}, {"text": "EPAM Systems", "value": "/m/0dlnrc"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "IBM", "value": "/m/03sc8"}, {"text": "Salesforce", "value": "/m/07btr5"}, {"text": "EY", "value": "/m/0g9jc"}, {"text": "Publicis Sapient", "value": "/m/02myjp"}, {"text": "Randstad", "value": "/m/08pt1z"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Alibaba Group Holding Limited", "value": "/m/07s6ctl"}, {"text": "Avanade", "value": "/m/094456"}, {"text": "Capgemini", "value": "/m/03vlk0"}, {"text": "Comtel Solutions Pte Ltd", "value": "/g/11dxpztgnb"}, {"text": "DELL", "value": "/g/11c54ch2jm"}, {"text": "Ericsson", "value": "/m/02kyh"}, {"text": "HTZ Resources", "value": "/g/11h21p9b4d"}, {"text": "Infinite Computer Solutions Pte Ltd", "value": "/g/11g9mj72yz"}, {"text": "Michael Page", "value": "/m/04cxldw"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "Orange Business Services", "value": "/m/08zvyz"}, {"text": "Recruitment Hub Asia Pte Ltd", "value": "/g/11dxpww_0f"}, {"text": "TEKsystems (Allegis Group Singapore Pte Ltd)", "value": "/g/11b6g4bkv0"}, {"text": "Talent Trader Group Pte Ltd", "value": "/g/11dxpmlc5b"}, {"text": "Tata Consultancy Services", "value": "/m/01psx8"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "VMware", "value": "/m/01t9k5"}, {"text": "Verizon", "value": "/m/07_dn"}, {"text": "A-Speed Infotech Pte Ltd", "value": "/g/11g9mxswl4"}, {"text": "ABeam Consulting", "value": "/g/11bc6whr_f"}, {"text": "Amazon Web Services (AWS)", "value": "/g/11dxprr2xv"}, {"text": "Amazon Web Services Singapore", "value": "/m/0rznzt1"}, {"text": "Aon", "value": "/m/0z7n"}, {"text": "Avaya", "value": "/m/01sqlk"}, {"text": "Azendian Solutions Pte Ltd", "value": "/g/11dxpvcjj2"}, {"text": "Big Cloud", "value": "/g/11c743lwsr"}]}]}