{"search_metadata": {"id": "60827b05d3aba21372ee9f8b", "status": "Success", "json_endpoint": "https://serpapi.com/searches/11f3b1dd1c7a936f/60827b05d3aba21372ee9f8b.json", "created_at": "2021-04-23 07:45:09 UTC", "processed_at": "2021-04-23 07:45:09 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28IT+analyst%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=170", "raw_html_file": "https://serpapi.com/searches/11f3b1dd1c7a936f/60827b05d3aba21372ee9f8b.html", "total_time_taken": 1.0}, "search_parameters": {"q": "(IT analyst) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "170"}, "jobs_results": [{"title": "Principal Agile Analyst, Investment", "company_name": "Schroders Investment Management", "location": "Singapore (+1 other)", "via": "via EFinancialCareers", "description": "Principal Agile Analyst, Investment\n\nWho we're looking for\n\nWe're looking for an experience IT business analyst to join our Capability aligned agile delivery team who are responsible for contributing to all aspects of the analysis, design, development, building and testing of solutions within a sprint cadence. Each team member will be aligned to a single Capability aligned agile team and, while the Principle Agile Analyst's core contribution will be to lead the analysis and design aspects of software development, they also contribute to development and testing activities. The Principle Agile Analyst should have domain working experience supporting Front office investment systems within the asset management industry and has a strong knowledge around Data Management Processes - Securities, Classifications, Analytics and Reference Data. Strong working knowledge of data vendors like Bloomberg, Refinitiv, MarkIT and interfaces for interactions are preferred. Exposure to back office... operations, investment operations and portfolio performance/attribution is an advantage.\n\nAbout Schroders\n\nWe're a global investment manager. We help institutions, intermediaries and individuals around the world invest money to meet their goals, fulfil their ambitions, and prepare for the future. We have around 4,000 people on six continents. And we've been around for over 200 years, but keep adapting as society and technology changes. What doesn't change is our commitment to helping our clients, and society, prosper. The base This role will be based in our Singapore Schroders' office.\n\nWhat you'll do\n\n• Support Capability (Product) Owners and Epic Owners/Analysts to ensure that features and stories to be delivered by the Capability team are well defined and structured\n• Lead analysis tasks which contribute to the delivery of working software required by the Capability [Product] Owner\n• Contribute to the analysis, development, build and testing of working software required by the Capability [Product] Owner\n• Accountable for ensuring user stories are delivered to the 'working system' definition of 'done' within an agreed sprint\n• Accountable for ensuring committed PI Objectives and Sprint Objectives are met\n• Responsible for contributing to agile planning, including sizing stories, parsing user stories into tasks etc.\n• Working with colleagues from other agile teams and shared service teams to both communicate and accept dependencies\n• Supporting the System Team in readiness for the System Demo\n• Participate enthusiastically and effectively in Schroders Agile ceremonies\n• Ensuring continued improvement through conducting regular retrospective reviews and executing high priority actions that emerge\n• Committing to increasing their skills and experience in non-core specialisms (Dev, Test)\n• Supporting other team members to improve their analysis skills and experiences\n• Performing the role of Scrum Master for the agile team if required to do so\n• Supporting the development of the wider Global Technology organisation through leadership of communities, guilds or key involvement in other non-core activities\n• Conduct and lead business requirements gathering workshops\nThe knowledge, experience and qualifications you need\n\n• A university degree graduate with at least 5 - 7 years of business analyst experience\n• Strong domain working experience in supporting Investment Front office system, Investment Data & Analytics in the Finance Asset Management industry i.e. asset managers, custodians, fund administrators, etc.\n• Working knowledge of financial instruments, setup and processing characteristics of products such as Equities, Fixed Income, Money Market, FX Forwards including NDFs; OTC Derivatives - Rates and Credits, CFD products.\n• Exposure to any of Investment front office processes -Asset allocations, Portfolio Constructions, Portfolio rebalancing, Portfolio Performance & Attribution reporting, Dealing Desk, Risk assessment, etc., portfolio performance and attribution is an added advantage.\n• Working knowledge of systems such as BlackRock Aladdin, MarkIT EDM, Eagle PACE and Market Data Vendors like Refinitiv, Bloomberg, Factset, etc.\nThe knowledge, experience and qualifications preferred\n\n• Lean Agile credentials; Certified Safe Agilist (SA)\n• Basic professional qualifications relating to the asset management industry (such as IMC) and business analysis (such as ISEB)\n• CBAP / CFA or Agile practitioner\n• Familiarity with Agile delivery methodologies, ideally SAFe\nWhat you'll be like\n\n• Extensive knowledge and experience of contributing to the development of technology solutions, both in-house developed bespoke applications and commercially available off-the-shelf solutions\n• Excellent communications to stakeholders of various level, in a clear and concise manner as well to the Capability teams on work (features/stories)\n• Wide experience of business analysis across several different capabilities, systems or teams; number of different (positive) experiences is valued higher than length of experience\n• High level of technical skill in use of business analysis techniques, methodologies and artefacts to support agile software development\n• Knowledge and experience of using various tools - SQL, Power BI, Alteryx, Tableau, MS Power Suite.\n• Experience of working with global colleagues and stakeholders and sensitivity to cultural differences, time zones etc\n• Passionate about mastering and innovating best practice in business analysis\n• Inspiring and collaborative leader, model of agile leadership approach\n• Continuous improvement mind-set, challenges the status quo and seeks self-improvement\n• Problem solver, comfortable taking the initiative in challenging and ambiguous circumstances\n• Proactive and has a driven, growth mind-set\n", "extensions": ["22 hours ago", "Full–time"], "detected_extensions": {"posted_at": "22 hours ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcmluY2lwYWwgQWdpbGUgQW5hbHlzdCwgSW52ZXN0bWVudCIsImNvbXBhbnlfbmFtZSI6IlNjaHJvZGVycyBJbnZlc3RtZW50IE1hbmFnZW1lbnQiLCJjb21wYW55X21pZCI6Ii9tLzA2NjNkNyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6InB4WUEzZlY1NDRYXzFHYnFBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVvc0NDc3dCUVU1VlgwNXhWRlF0YkRWdmMxbzNRV1pSU2tSWFMyUkpWMFpYWkV0U2QwTldNMWxpY1dkZlVrRllUMHBrTjJSSmJVdExjVVl3V2pGb1RHUm5iRmhET1RaSU5VWnpRV1ZTUkhOMFoycE1hSFpqVVVzMFQwdHRPRlIzTVY5WVpuVXlVbGxxTm1sRFlVbDFYMHRHVjBsTk1tSklPVUpKTTI1eExWSldhekJpV1V4RGJYVTRNSFZPTjNJM01qSmtUbEZVVjNGR1JrOU5iazk2UlZCeGRHTTBkR1ZSY1cxbWNVSldORXMzYVRodGNuUXRjV05pVjBKTVVXOHpRMVV6VjNFelYyOVRNVlpQTjFKTVZIVXdFaFpDV0hWRFdVeDFUVXh3UkZCMFVXRkVhMXB0YjBOM0dpSkJUMDFaVW5kQ2VWRlpXbXBoYlZkdGJIUmZlRUpQVFZSRldGOUZVSFpuV1hKUiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzciLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gRUZpbmFuY2lhbENhcmVlcnMiLCJsaW5rIjoiaHR0cHM6Ly93d3cuZWZpbmFuY2lhbGNhcmVlcnMuc2cvam9icy1TaW5nYXBvcmUtU2luZ2Fwb3JlLVByaW5jaXBhbF9BZ2lsZV9BbmFseXN0X0ludmVzdG1lbnQuaWQxMDc3ODUxND91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Threat and Intel Analyst - Singapore", "company_name": "Trustwave", "location": "Singapore", "via": "via LinkedIn", "description": "• The responsibilities shall include, but not limited to the following tasks:\n• Performing detailed system analysis and correlation to identify pattern of intrusion\n• Creating use cases for detecting similar intrusion\n• Identifying new or useful Indicator of Compromise\n• Conducting researches and evaluating trends in remediation approaches\n• Creating and maintaining procedures for utilising the EDR and NDR tools\n\nRequirements/Qualifications\n• At least FOUR (4) years of experience working in a Security Operation Center with security monitoring and escalation of threats responsibilities\n• Relevant training on the proposed products, and has obtained professional certification such as GIAC Information Assurance Certified Intrusion Analyst (GCIA), GIAC Information Assurance Certified Incident Handler (GCIH), or equivalent\n• The necessary soft skills. The Incident Investigation Analyst shall be continually assessed on his/her interpersonal skills and strong communication... skills\n\nEducation\n\nWe prefer college-educated applicants, but at minimum, high school diploma or equivalent is required for employment", "extensions": ["8 days ago", "Full–time"], "detected_extensions": {"posted_at": "8 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJUaHJlYXQgYW5kIEludGVsIEFuYWx5c3QgLSBTaW5nYXBvcmUiLCJjb21wYW55X25hbWUiOiJUcnVzdHdhdmUiLCJjb21wYW55X21pZCI6Ii9tLzBuM3hqZjUiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJYQmItRnVQcnlDLXVWX0l2QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VkdWTlpIcElXa010YWtabWMySnBNa1ZZU2xVM2VYZHJZVlZOUlVwcE5YVnJMVGxIWjNkbFgwaDBhRXBoZEZWc0xXRTVlRmxYYjFNdFRVcERWV2xNVm1KQ1NEVTFlRmhCWkRWMWIzZ3lRbGhQWTJ0TWRVSkxSRlk0YW5jd01UaHpjVWhFWkdSNWVWcFBVamRSYWtsSGJGWm1TMGRYTmw4M1pEbHVhekJUYUhsNk0wWlFNMEZCT0RaTk1VVllUa0pCWVd3eVZIbExVamRKUmtkM0VoWkNXSFZEV1V4MVRVeHdSRkIwVVdGRWExcHRiME4zR2lKQlQwMVpVbmRFUW10Q1dHZ3pXbFl4VURSSVFWUjZXazAyU1V4WVgxTkRiSEZSIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMTUiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGlua2VkSW4iLCJsaW5rIjoiaHR0cHM6Ly9zZy5saW5rZWRpbi5jb20vam9icy92aWV3L3RocmVhdC1hbmQtaW50ZWwtYW5hbHlzdC1zaW5nYXBvcmUtYXQtdHJ1c3R3YXZlLTI1MTU3NDY5MjM/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Business Analyst", "company_name": "Techbridge Market Holdings Pte Ltd", "location": "Singapore", "via": "via Jobs", "description": "Looking for Business Analyst with one of our clients in Singapore.\n\nRESPONSIBILITIES:\n\nYour primary focus will be on the Business Requirements and Functional Solution aspects of the\nproject. In this role, you will work in a project team, in collaboration with Agency users, to:\nelicit, scope and manage the Agency's business requirements apply appropriate human-centric tools and techniques, including plan, design and facilitate workshops, to map customer journeys, identify challenges and opportunities prioritise product backlog through rigorous information gathering and analysis with stakeholders, and contribute to the development of the Functional/ Design specifications\n\nDevelop the business case and Tender Specifications\n\nEvaluate and recommend ICT solutions that best address the needs\n\nUndertake sprint planning, write user stories and define acceptance criteria with stakeholders\n\nReview testing and data conversion documents to verify that specifications are met\n\nDrive smooth... deployment, adoption and operations of the solution\n\nAnalyse impact of requested changes (Operations & Maintenance phase)\n\nWork with developers to understand and troubleshoot technical problems, as needed (Operations & Maintenance phase)\n\nUndertake root cause analysis for problems in order to implement preventive and corrective\n\nMeasures to meet business and performance needs (Operations & Maintenance phase)\n\nEXPECTATIONS:\n\nAs a Business Analyst, you are:\npro-active, resourceful and self-motivated to innovate and take smart risks to achieve\nbusiness goals and customer satisfaction\nable to take a broad, strategic perspective as well as drill deep to understand business needs and challenges\nable to facilitate discussions/workshops to elicit, manage and prioritize key business needs\na team player with strong influencing and people handling skills\n\nREQUIREMENTS:\n\nDegree or Diploma in Computer Science, Information Systems, Information/Infocomm\nTechnology, Computer or Electronics Engineering or related discipline\nMinimum 3 years of working experience for Consultant and 5 years of working experience for Senior Consultant role\nParticipated in at least one full software or product development cycles, preferably using\nAgile Methodology with past development experience\nProven experience in IT business analysis, application solutioning and design, and testing\nBasic knowledge of Cloud, Data Analytics, Service Design/Design Thinking\nStrong analytical, conceptualisation and problem solving skills\nExcellent communication skills, both oral and written, with the ability to pitch ideas and influence stakeholders\nAdvantageous to have:\nConsulting or Business Analysis experience Business Analysis certification (Certification of Competency in Business AnalysisTM (CCBA®), Certified Business Analysis ProfessionalTM (CBAP®)).\n\nKnowledge of, or experience in implementing projects in at least one of the following areas (Data Analytics, Agile Methodologies, Internet and Mobile Technologies, Customer Relationship Management, Knowledge Management, Service Design, Business Process Reengineering (BPR))\n\nInterested candidates pl mail your CV to Pradeepa.mangalasamy@techbridgemarket.com\nWith below required details.\n\nCurrent salary:\nExpected salary:\nNotice Period:\nReason for job change:\nCurrent location:\nVisa/Nationality:\nYears of IT experience?\nYears of experience as Business Analyst?\nYears of experience in Agile methodology?\nYears of experience in application solutioning and design, and testing?\nYears pf experience in any one is required?( Any Cloud, Data Analytics/Management/ETL, Service Design/Design Thinking\n\nRegards\nPradeepa M\nSr.Talent Manager-APAC", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJCdXNpbmVzcyBBbmFseXN0IiwiY29tcGFueV9uYW1lIjoiVGVjaGJyaWRnZSBNYXJrZXQgSG9sZGluZ3MgUHRlIEx0ZCIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiNFhESDRtaHVSa282azZfaEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIiwibGluayI6Imh0dHBzOi8vc2cuZmlkYW50by5jb20vam9icy9qb2Itb3BlbmluZy9idXNpbmVzcy1pbnRlbGxpZ2VuY2UtYW5hbHlzdHMvYnVzaW5lc3MtYW5hbHlzdC0yNzUyMTg2ODc/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "IT Compliance Analyst", "company_name": "Sciente Inc", "location": "Singapore", "via": "via SCIENTE", "description": "An excellent opportunity to be part of the IT Governance and Compliance team in a leading financial services organisation as an IT Compliance Analyst.\n\nMandatory Skill(s)\n• Diploma/ Degree in Computer Science, Information Systems, Engineering;\n• At least 5 years of experience in IT Security, audit and/or compliance;\n• Deep knowledge and understanding of internal controls, IT security controls risks assessment, management and governance, auditing techniques and methodologies;\n• Strong technical competencies in audit of infrastructure, network and applications;\n• Proficient in MS Office Applications;\n• Possess good interpersonal skills to engage various stakeholders;Excellent verbal and written communication skills.\n\nDesirable Skill(s)\n• CISSP, CISA certification;\n• Experience in regulatory guidelines on risk management practices.\n\nResponsibilities\n• Manage, conduct and monitor IT compliance with regulatory requirements and internal policies and record and report on compliance lapses;\n•... Develop new IT governance documents and ensure timely revisions;\n• Regularly review IT controls to identify & report noncompliance of relevant processes, systems & action items;\n• Closely monitor the changes and provide insights on technology related legislation and regulation and develop a governance/compliance program to address potential gaps;\n• Responsible to track IT issues arising from regulatory and management meetings;\n• Manage internal and external auditors and supervise the entire IT audits for closure / reporting;Perform any other related duties as assigned by the management", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJJVCBDb21wbGlhbmNlIEFuYWx5c3QiLCJjb21wYW55X25hbWUiOiJTY2llbnRlIEluYyIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiNk1WRFRFRlBjUVhlTE9fU0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBTQ0lFTlRFIiwibGluayI6Imh0dHBzOi8vd3d3LnNjaWVudGUuY29tL3NjaWVudGUtaW5jL3RlY2hub2xvZ3ktam9icy81MzM1L2l0LWNvbXBsaWFuY2UtYW5hbHlzdC8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Graduate Technology Associate Programme - AI/ML Business Analyst - CIT - Intake JUN/JUL 2021", "company_name": "Credit Agricole Group", "location": "Singapore", "via": "via Bayt.com", "description": "Crédit Agricole Corporate & Investment Bank (“CA-CIB”) Graduate Technology Associate Programme is an exciting career gateway into the financial services sector. We are seeking highly motivated graduates and aspiring tech-innovators to offer an accelerated induction experience and fast-tracked career in the banking industry.\n\nMain Responsibilities\n\nThe Corporate IT (CIT) team is supported by its four main functions to ensure a compliant and secure delivery of its internal banking operations, data analytics reporting as well as the key delivery of innovative applications across CA-CIB’s international network.\n\nAs a Business Analyst for Artificial Intelligence/Machine Learning (AI/ML) within the Technology Innovation team of CIT department, you are responsible of managing functional IT activities within the team, documenting the business cases and needs, explaining solutions with good presentation liaising with respective team in-charge.\n\nThe business cases are mostly on AI / semantic... analysis or cognitive services. This position requires to work with project managers, AI/ML developers, Data scientists and fellow counterparts in Crédit Agricole CIB. It is vital to upload clear and effective communication with everyone.\n\nScope of Work\n\n· Involve at project ideation / initiation phase and contribute to do preliminary business study\n\n· Analyze, assess and clarify functional specifications\n\n· Write specifications and ensure validation and adherence of project's stakeholders\n\n· Follow up the implementation of the solution with data scientists and AI/ML engineers and provide clarifications when necessary\n\nBusiness Data Analysis and Validation\n\n· Enhancing data collection procedures to include information that are relevant\n\n· Processing, cleansing and verifying the integrity of data used for analysis\n\n· Participate in functional analysis and keep the documentation up to date with respect to any new changes.\n\nCollating Business Requirements, Analysis and Testing\n\n· Gather business requirements and clarify needs if required.\n\n· Prepare specification documentations and validate with business as per project requirements.\n\n· Implement and test components from functional specifications.\n\n· Conduct integration testing before handing over product for UAT.\n\n· Provide functional support during UAT activities.\n\n· Elaborate or review user's documentations (user guides, release notes etc.)\n\nCo-ordination and Communication\n\n· Collaborate with business subject matter experts, business analysts, functional leads, architects and technical leads from other disciplines to come up with end-to-end solutions to meet the assigned business requirements\n\n· Organize meetings on any functional topics under control as needed", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJHcmFkdWF0ZSBUZWNobm9sb2d5IEFzc29jaWF0ZSBQcm9ncmFtbWUgLSBBSS9NTCBCdXNpbmVzcyBBbmFseXN0IC0gQ0lUIC0gSW50YWtlIEpVTi9KVUwgMjAyMSIsImNvbXBhbnlfbmFtZSI6IkNyZWRpdCBBZ3JpY29sZSBHcm91cCIsImNvbXBhbnlfbWlkIjoiL20vMDI4dmJtIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoidVVxQjcyVjBZcF8zTVdZREFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZZQkNyY0JRVTVWWDA1eFVsSkZiMHhNTWs0MFZuUmlRMlJDYXpCMlJ6SkVhbnBvU2t0bVQwTTVRVnA1VG5abmVYUkpaSGd4ZFRKaGEwOVZSRlJQVFU5bFJWQnNkVFJVVFdScloyRnhObVozTUZCNlJuVlNaa2xxTlMxRVYwRnNOemRGZFZjeFVVRm1iWGhhU1ZBd01tRTRNV1ZxT0VwUmJHVnRWMmxyZDNOSWVUaEViMjVaVVRGUVp6RkhaSE16UVRGdE5uQTRNMnBIZWxCRlQwcFNka0ZtWjFaTVpqTkphM3BtYlc5T1IzcEJaVGt0UzJsQk4wVlFNVm8wRWhaQ1dIVkRXVXgxVFV4d1JGQjBVV0ZFYTFwdGIwTjNHaUpCVDAxWlVuZEVYM2hWVmxFeFRWbFBOWGgyWDA5ck5HdHJjalJKYjJkNVduZG4iLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18zMCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCYXl0LmNvbSIsImxpbmsiOiJodHRwczovL3d3dy5iYXl0LmNvbS9lbi9zaW5nYXBvcmUvam9icy9ncmFkdWF0ZS10ZWNobm9sb2d5LWFzc29jaWF0ZS1wcm9ncmFtbWUtYWktbWwtYnVzaW5lc3MtYW5hbHlzdC1jaXQtaW50YWtlLWp1bi1qdWwtMjAyMS01OTUwOTAxMS8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Risk Analyst", "company_name": "Binance", "location": "Singapore", "via": "via Glassdoor", "description": "Binance is the global blockchain company behind the world’s largest digital asset exchange by trading volume and users, serving a greater mission to accelerate cryptocurrency adoption and increase the freedom of money.\n\nAre you looking to be a part of the most influential company in the blockchain industry and contribute to the crypto-currency revolution that is changing the world?\n\nResponsibility:\n• Working in a fast growing product team under Binance Card and Payment Business Unit\n• Responsible for the prevention and detection of potential fraud & risk across Binance Pay and Binance Card Product.\n• Being the 1st risk specialist in the Business Unit, coordinate with centralized risk team to assess the customer fraud & risk from organization level.\n• Identify fraud patterns through the monitoring of high-risk countries, merchants and customers.\n• Contribute to the creation of fraud rules by providing analytical data to support decisions.\n• Review all alerts from external sources... including VISA CAMS, FICO, etc. and ensure that appropriate actions are taken to mitigate fraud.\n• Responsible for maintaining knowledge of fraud situation in the industry.\n• Report risk information and findings to the immediate supervisor in a timely manner.\n• Compiling and implement security measures and fraud prevention strategies and the ability to pick up on irregularities on Binance Card/Pay transactions.\n• Maintain fraud analysis models to improve efficiency and effectiveness of company systems.\n• Identify system improvements to prevent fraudulent activities.\n\nRequirement:\n• At least 2 years of experience at payments processor, card acquirer, bank (risk department), or e-commerce platform.\n• Experience with different alternative payment methods and risks.\n• Certification: It is a plus for individuals to be certified under an accredited body such as the Association of Certified Fraud Examiners (ACFE).\n• Cryptocurrency industry background is a plus.\n• SQL is necessary.\n• Java & R is preferred to enhancing the existing models. Other programming languages are welcome.\n• They also require an understanding of financial crimes, in particular cyber fraud means and threats; and an in-depth knowledge of the card/payment business and risk management concepts and practices, and performance implications of policies/actions.\n• Computer skills: They must possess advanced computer skills, including but not limited to proficiency in Microsoft Office (Word, Excel, Power Point, Access, etc. They also require an analytical ability and competency in SQL query language and working with relational databases.\n• Analytical skills: They require strong analytical skills to detect and identify weaknesses in the bank’s systems; as well as identify the root cause of the weakness.\n• Attention to detail: They require strong attention to detail and accuracy to factor every piece of information in the investigation of cases.\n• Result orientation: They must be goal oriented individuals with a strong focus on completing tasks and producing high quality results within a fast-paced environment.\n\nConditions\n• Do something meaningful; Be a part of the future of finance technology and the no.1 company in the industry\n• Fast moving, challenging and unique business problems\n• International work environment and flat organisation\n• Great career development opportunities in a growing company\n• Possibility for relocation and international transfers mid-career\n• Competitive salary\n• Flexible working hours, Casual work attire", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJSaXNrIEFuYWx5c3QiLCJjb21wYW55X25hbWUiOiJCaW5hbmNlIiwiY29tcGFueV9taWQiOiIvZy8xMWhjejFyNHdsIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiYjVKRkFtdzhXZEJVcWRLOEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFVYVXlZVUU0T0RGclZFcHdVRkl0YTNsdE5qaFlZbXhXTkVveFJERldRa3hPYkhWa04yWkdSbUpRZVZaQk0ydDFWMWRMVDIweVIzTlpWM1p6UWsxNU9EQk5WMlo1V2tWRlVtbENUalJ1T0dWSWFuWlRWbGRaWjBOUWNuTlpXbkp3TFhkT1NVUkxiMU0zYjBNNVIwMW9hMncyVG5oTVozcHJVRXBMU201WGVYaHdkMlp3YkhsNWFGUkJUREo2Vm1JMlFqVlpSRkExUTA5a1pUQlJFaFpDV0hWRFdVeDFUVXh3UkZCMFVXRkVhMXB0YjBOM0dpSkJUMDFaVW5kQ2MzUlphRmxMUmxCMVJVcFViMnhQYTA1WlRtWk5SRFp2YUVKUiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzM4IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEdsYXNzZG9vciIsImxpbmsiOiJodHRwczovL3d3dy5nbGFzc2Rvb3Iuc2cvam9iLWxpc3Rpbmcvcmlzay1hbmFseXN0LWJpbmFuY2UtSlZfSUMzMjM1OTIxX0tPMCwxMl9LRTEzLDIwLmh0bT9qbD0zODA3MzQyMDAyXHUwMDI2dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "IT Security Analyst – Perm - East", "company_name": "GMP Technologies", "location": "Singapore (+1 other)", "via": "via Monster", "description": "Responsibilities:\n• Monitoring security logs sources and alerts from the SIEM and other threat detection systems for threats activity. Interpreting, conducting analysis and making recommendations for resolution.\n• Hunting potential internal and external threats and developing detection mechanisms and reports.\n• Handling security incidents in line with the incident response processes.\n• Assuring the prompt and adequate follow-up on priority action items with resolver groups.\n• Producing security incidents reports and recommendations.\n• Following, maintaining and helping in the evolution of the SOC processes and procedures, including use case, SOP, etc.\n• Working with resolver groups to evaluate and recommend new security practices and solutions.\n• Providing security advices and promoting security awareness to other IT teams and clients.\n• Working actively on evolving our threats detection and team efficiency by acting on noise and false positive.\n• Helping in the production of threat... intelligence and IoC by leveraging threats information from past incidents, sandboxes reports, malware reversing and data forensic.\n\nRequirements:\n• Degree in Computer Science, Data Communications, Engineering or equivalent.\n• Experience in using SIEM technologies, endpoint protection, IDS and other security technologies.\n• Over 3 years of working experience within a mature SOC organization or as a security threat analyst in an equivalent security environment.\n• Experience in the pen testing/ethical hacker field is a plus.\n• Technical expertise in multiple security technologies would be an advantage including security incident handling experience.\n• Skills in network analysis, sandboxing, malware reversing or forensic is an asset.\n• Strong knowledge of vulnerabilities, CVE, 0day and their potential impacts.\n• Good knowledge of threat intelligence data, IoC, threat actors, kill chain, Stix/Taxii, etc.\n• Experience with IT compliance assessments (ISO 27000 etc.).\n• Keeping aware and continually informed of the worldwide security landscape: new threats, actors, du jour attack, as well as the new security technologies and products.\n• Functional skills with regex, IDS signature, SPL and SQL is a plus.\n• Certified Information Systems Auditor\n• Global Information Assurance Certifications (GIAC) e.g. Certified Incident Handler (GCIH), Certified Intrusion Analyst (GCIA), Certified Enterprise Defender (GCED) or other relevant GIAC certifications.\n\nAdditional info:\n• Working location at East area\n• Interested candidates must be open to support staggered shift hours (Mondays to Fridays, no overnight shift), and weekends support.\n\nTo apply, please visit and search for Job Reference: 17957\nTo learn more about this opportunity, please contact Yingying at\nWe regret that only shortlisted candidates will be notified.\nGMP Technologies (S) Pte Ltd | EA Licence: 11C3793 | EA Personnel: Lai Yingying | Registration No: R1110239", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJJVCBTZWN1cml0eSBBbmFseXN0IOKAkyBQZXJtIC0gRWFzdCIsImNvbXBhbnlfbmFtZSI6IkdNUCBUZWNobm9sb2dpZXMiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Illjb0NFQkxmNXY3RVlIeHRBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTW9uc3RlciIsImxpbmsiOiJodHRwczovL3d3dy5tb25zdGVyLmNvbS5zZy9qb2IvaXQtc2VjdXJpdHktYW5hbHlzdC1wZXJtLWVhc3QtZ21wLXRlY2hub2xvZ2llcy1zaW5nYXBvcmUtMjcyMDQ3Mz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Programmer Analyst 5-IT (BB-DC792)", "company_name": "NetSuite Inc", "location": "Singapore", "via": "via BeBee", "description": "Return to job searchPrintable FormatJob Description - Programmer Analyst 5-IT (21000H73)Job DescriptionAll over the world, people's lives are better because of Oracle. Want to make a difference? Join our company of change-makers.From Oracle to culinary school and back again. Bonnie Carlson Kaypaghian uses the skills she learned to create recipes for her daughter’s Type 1 Diabetes and has written a cookbook to share with the world. #LifeatOracleProgrammer Analyst 5-IT-21000H73Applicants are required to read, write, and speak the following languages:EnglishPreferred QualificationsOracle Applications Lab (OAL) runs the applications that run Oracle. ERP New Initiative is a global organization within OAL and is responsible for the Fusion Migration to the Oracle Public Cloud (OPC) program, a multi-year corporate initiative to move Oracle's internal business applications to the OPC. The OAL Corporate Programs and Operations (CPO) PMO drives OAL's development of custom solutions... implementation of Oracle Applications Cloud services, testing, production transition, and post go-live stability support.Responsibilities: The Fusion Program Director will report to Director, Fusion Migration to the Oracle Public Cloud (OPC) program, and will be responsible for driving multiple initiatives, programs, and projects at the same time to successful completion. Specific responsibilities: Manage programs and projects simultaneously to successful completion. Agile Release Train (ART) Release Train Engineer (RTE): Be a servant leader and coach for the Agile Release Train (ART) Facilitate the ART events and processes Assist the teams in delivering value Facilitate removal of impediments to help the ART and the teams to deliver business values via committed PI objectives Engage and communicate with OAL and business stakeholders, help manage risk, and drive relentless improvement Synchronize within the ART and across other ARTs Work closely with OAL development teams, ATG, product development, and other stakeholders to mitigate risks, resolve issues, and remove impediments Track and communicate program, project, and ART metrics and risks/issues Qualifications: Minimum of 10 years of experience in software product development or IT program and project management Minimum of 10 years of experience as a scrum master, program or project manager, or development lead SAFe knowledge or implementation experience is a plus Demonstrated leadership and people management skills Possess strong communication and analytical skills and a thorough understanding of product development and product management Excellent interpersonal skills, good with people, ability to negotiate Knowledge on product management, software development, DevOps, CICD, and Agile methodologies Tools: Atlassian JIRA, Confluence or other Agile project management tools Education, certification, & training experience: BS degree required; MS, MIS, or MBA is a plus PMI PMP, SAFe Agilest, and Certified Scrum Master are ideal Detailed Description and Job RequirementsWork with Oracle's world class technology to develop, implement, and support Oracle's global infrastructure. As a member of the IT organization, lead the design, development, modification, debugging, and evaluation programs for extremely complex internal systems. Provide expertise to analyze existing programs or formulate logic for new internal systems. Develop conversion and system implementation plans. Recommend changes to development, maintenance, and system standards. Provide leadership and expertise in extremely complex internal systems, frequently operating at the leading edge of technology. Recommend and justify major changes to existing internal systems. BS or MS degree or equivalent experience relevant to functional area. Ten or more years of related experience recommended.Job:Information TechnologyTravel:Yes, 25 % of the TimeLocation:SG-SingaporeJob Type:Regular Employee HireOrganization:Oracle", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9ncmFtbWVyIEFuYWx5c3QgNS1JVCAoQkItREM3OTIpIiwiY29tcGFueV9uYW1lIjoiTmV0U3VpdGUgSW5jIiwiY29tcGFueV9taWQiOiIvbS8wNW45NTIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiI5N0hva2dwd29nWG5rVEVIQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VkUxa2NYcDFTelprVW0xQ2FtYzVZV3RJV1dSaWJYTXlaVGgxV0VZMGVsaFVhbDlQWVZCNWNrZHpkWGRxYTJJMlZHcFRTSGxFVm5SR2VHRlFSVXBDYWtwNVRuQlllVkZCYXpaVU1XMVZlRmhLY1hscU1FMWxkRkpxWkhkYWJrbDVSMUZVWWtGblVWSkhSa2wyWjNwYWNXeHhNbGhmYVd0aFZHWkdaVEptVUhOS09EYzFSMHh4YkRGT00wMDVPRXRMTUVkbU0zSldYM1JpTlZaUkVoWkNXSFZEV1V4MVRVeHdSRkIwVVdGRWExcHRiME4zR2lKQlQwMVpVbmRFZG10NmVWbHpOM2xIY1hGVlVuWk1jbE5LTFZvd1ZqQkJhRnBSIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNTAiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQmVCZWUiLCJsaW5rIjoiaHR0cHM6Ly9zZy5iZWJlZS5jb20vam9iLzIwMjEwNDE3LTc5MDUxYjMzY2VlZWVhOGUwOGU4ZmUwNGNhMWRjNzkyP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Analyst, Network Technical Ops", "company_name": "American Express", "location": "Singapore", "via": "via LinkedIn", "description": "Network Solutions and Operations (NSO) is a critical organisation within American Express as it runs the Network used by our Global Partners (Acquirers and Issuers) to process card transactions. NSO also provides the platforms, defines the policies and creates exciting new products consumed by our Global Partners.\n\nThis job opportunity will reside within Network Certification & Servicing (NCS), which is an arm of NSO dedicated to certify and onboard new customers and products. This entails securely connecting our Proprietary Merchants, Processors and Network Partners to the American Express Network and certifying the authorisation and clearing messages developed by them before they are enabled in production. NCS also supports and certifies existing customers when deploying new and existing products such as EMV Chip Processing, Safekey, Quick Response Code, Mobile Wallets and Secure Remote Commerce, to name a few.\n\nGeographically, NCS operates and functions as a global organization... with hubs in locations such as Phoenix, UK, Gurgaon, Tokyo, Sydney and Singapore.\n\nWithin the above context, a Certification Analyst opportunity has arisen, to be based in Singapore, to manage certification projects requested by Amex customers, as well as managing internal initiatives that impact the certification processes.\n\nResponsibilities\n• Manage assigned projects related to the certification of link connectivity, financial settlement and authorisation messages that support new and existing payment products such as EMV Chip Processing, Safekey, Quick Response Code, Mobile Wallets and Secure Remote Commerce.\n• Manage the setup of file transfers between Amex customers and Amex.\n• Provide testing support and technical consultancy to internal and external customers pertaining to Amex technical specifications and certification processes.\n• Develop and document certification processes and procedures for new initiatives.\n• Work with various American Express Technology groups to support the installation of network connectivity and implementation of authorisation and settlement solutions.\n• Lead and drive regional or global internal projects, specifically ensuring that NCS test tools, test plans and certification processes are updated or enhanced.\n• Participate in calls that can be held outside of office hours in order to support regional or global projects that span different time zones.\n• Support all project types - simple or complex to help the team manage project volumes throughout the year.\n• Participate or lead employee related activities within the local campus.\n\nMinimum Qualifications\n• Knowledge of Payments industry including but not limited to EMV, Express Pay, SafeKey, mobile wallets, POS products, is essential.\n• Can readily understand technical specifications, decipher the technical contents and use that knowledge to validate test results. Can independently identify root causes that can arise during certification & resolve them.\n• Knowledge of telecommunication and networking components such as TCP/IP & SFTP, Router capabilities, VPN and Web Services, are pluses.\n• Demonstrates strong relationship management skills used to influence without authority both internally and externally, across multiple international territories with different cultural considerations.\n• Must be able to communicate effectively both orally and in written form, with internal and external customers at both a technical and business level.\n• Highly self-motivated, growth mindset and results driven with the ability to work without supervision in a matrix organization and demonstrating strong teamwork.\n• Ability to work flexibly in an ever-changing environment, demonstrating adaptability & a keen interest to learn.\n• Proven business analysis and project planning experience including strong problem solving and analytical skills.\n• Proven ability to support multiple projects simultaneously in a fast paced, multi-time zone environment.\n• Must be willing to work outside office hours whenever the project calls for it.\n• A minimum of 3 years of experience working in the payment industry with hands on payment product certification experience being essential.\n• Ability to speak Mandarin, Japanese or both, are pluses.\n\nOffer of employment with American Express is conditioned upon the successful completion of a background verification check, subject to applicable laws and regulations.\n\nAmerican Express has been awarded Aon Hewitt Best Employer Singapore six times. Join us and you’ll soon see why.\n\nAs an employee, you can expect challenging work, with purpose. Be more than just your job. Be the voice of inspiration and transform the way the world does business for a living. By joining American Express, you are choosing to become a part of the dynamic team that is recognized as Singapore's \"Best Employer 2018\".\n\nWhy American Express?\nThere’s a difference between having a job and making a difference.\n\nAmerican Express has been making a difference in people’s lives for over 160 years, backing them in moments big and small, granting access, tools, and resources to take on their biggest challenges and reap the greatest rewards.\n\nWe’ve also made a difference in the lives of our people, providing a culture of learning and collaboration, and helping them with what they need to succeed and thrive. We have their backs as they grow their skills, conquer new challenges, or even take time to spend with their family or community. And when they’re ready to take on a new career path, we’re right there with them, giving them the guidance and momentum into the best future they envision.\n\nBecause we believe that the best way to back our customers is to back our people.\n\nThe powerful backing of American Express.\nDon’t make a difference without it.\nDon’t live life without it.\n\nReqID: 21004498\nSchedule (Full-Time/Part-Time): Full-time\nDate Posted: Apr 15, 2021, 2:14:55 AM", "extensions": ["8 days ago", "Full–time"], "detected_extensions": {"posted_at": "8 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBbmFseXN0LCBOZXR3b3JrIFRlY2huaWNhbCBPcHMiLCJjb21wYW55X25hbWUiOiJBbWVyaWNhbiBFeHByZXNzIiwiY29tcGFueV9taWQiOiIvbS8wMXc2ZHciLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJ6TGp6VHlWcEJ4czAzVldmQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdllCQ3JjQlFVNVZYMDV4VkRBd2JsWTFRWGRqWjJSRFV6aDVSRXBtUVV0bGNIRXhXSGRUZW1KR1lVbG5hWFppZEdsNFpGb3dkVWgyYjBsMVZ6UkdTWGR2ZFdocVVIaGtXRkpvTURnM1dITlROakJrYVRKRVVYcEViVlpmWlRKUlMwaGFRbFV4TkRFeVltMDBXV0ZMV1RaS2JVZFdUMGgwZERka2R6bHFaemhHTlZkdVZFeExjRlJMWmpWWWFreHBiUzAwTTBwUGFrMW5hRUpmWkhnM1dIRjRlRTB3UjFwMWNrVktXR0ZMU0RCQ01YaDVZbFp6YVc4MVJXYzRFaFpDV0hWRFdVeDFUVXh3UkZCMFVXRkVhMXB0YjBOM0dpSkJUMDFaVW5kRVRUQkthSFJSV2t4UE0wTk5Na0pCUkU1T09GOW1lSEpLTWpGbiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzU4IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExpbmtlZEluIiwibGluayI6Imh0dHBzOi8vc2cubGlua2VkaW4uY29tL2pvYnMvdmlldy9hbmFseXN0LW5ldHdvcmstdGVjaG5pY2FsLW9wcy1hdC1hbWVyaWNhbi1leHByZXNzLTI0ODM2MjIwNTg/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Associate/Analyst, Investment Service Centre Dealer (Mid Shift), Consumer Platform Management, Consumer Banking Group", "company_name": "DBS Bank Limited", "location": "Singapore", "via": "via EFinancialCareers", "description": "Associate/Analyst, Investment Service Centre Dealer (Mid Shift), Consumer Platform Management, Consumer Banking Group\n\nResponsibilities\n\n• Perform Equities and Bonds execution in various local and foreign exchanges for internal and external customers.\n• Assist clients with all trading and settlement issues involving payment and collection of debts.\n• Able to manage incoming calls from trading hotline, and email queries from clients.\n• Manage external clients on account matters enquiries from all channels (ie phone, email or web)\n• Assist external clients on corporate action and equities transfer matters.\n• Perform trade reconciliation and investigation across regional offices.\n• Assist in planning and execute UAT and Regression testing.\n• Review clients' credit limit permanently and on ad hoc basis.\n• Assist in planning and execution of dealing and operation process change to align with Regulatory changes, and new products and services launches. Requirements\n\n• Degree Holder in... Finance, Business or Accounting preferably with 2 -3 years of relevant work experience.\n• Additional certification such as CMFAS is preferred. Certificates required are CMFAS Module 1A, 6 and 6A\n• Team player with good organizational and communication skills.\n• Able to work under pressure in a fast-moving environment.\n• Role is on perm Mid Shift but the selected candidate must be flexible to work on different shift hours and public holidays if required\n• Singapore/ Hong Kong/ Australia/ Japan shift (Regular Hours): 6.30am to 4.00pm/ 8.30am to 6.00pm\n• London Shift (Mid Shift): 2.30pm to 12.00am\n• United States/ Canada Shift (Night Shift): 9.30pm to 7.00am\n• Able to handle work's pressure under BCP situation.\n• Good customer orientationand able to handle client's issues promptly.\n• Understand and observance of control, risk and banking regulations.\n• Equity knowledge in JP/AU/SG/HK/UK/US/CA markets will be an advantage.\n• Banking knowledge preferred", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBc3NvY2lhdGUvQW5hbHlzdCwgSW52ZXN0bWVudCBTZXJ2aWNlIENlbnRyZSBEZWFsZXIgKE1pZCBTaGlmdCksIENvbnN1bWVyIFBsYXRmb3JtIE1hbmFnZW1lbnQsIENvbnN1bWVyIEJhbmtpbmcgR3JvdXAiLCJjb21wYW55X25hbWUiOiJEQlMgQmFuayBMaW1pdGVkIiwiY29tcGFueV9taWQiOiIvbS8wMXE3bjUiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJQaEcxZlJVQWNZSXZidE14QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdllCQ3JjQlFVNVZYMDV4VkdzM1JsVXlkVkZPWVZad01XNVpXamx6TldVNVh6Wm5jMHhhVm1oRGRGWkhObVpsYkhkaU1uaDRURTg0T0dkc1kzbGhRMEkxZGtvMGVIZDJPSHBZYUd3MWVsWlZRMEZFUVc1RU1FMVlObkJFWDJ3eWFISmFjM1l6Yld4VlUxWTRabFZYWld0TE1FZEpURGw1UVZObGFFZFhRV2x5YzJZdExUZzVhVkJDUjA4eU1XaFZUbkpvTVV0T04wMDRTa2RVUmw5R2JXaHhWelJCYzJOaVowdHlNVk56YTFCc1NXZHNTbEl0Y1dReFVIb3dFaFpDV0hWRFdVeDFUVXh3UkZCMFVXRkVhMXB0YjBOM0dpSkJUMDFaVW5kQ2QyUlVaRGt6UkRsb1IwbG1hME5uWkdoelgySkRTelUyYzBaUiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzY2IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEVGaW5hbmNpYWxDYXJlZXJzIiwibGluayI6Imh0dHBzOi8vd3d3LmVmaW5hbmNpYWxjYXJlZXJzLnNnL2pvYnMtU2luZ2Fwb3JlLVNpbmdhcG9yZS1Bc3NvY2lhdGVBbmFseXN0X0ludmVzdG1lbnRfU2VydmljZV9DZW50cmVfRGVhbGVyX01pZF9TaGlmdF9Db25zdW1lcl9QbGF0Zm9ybV9NYW5hZ2VtZW50X0NvbnN1bWVyX0JhbmtpbmdfR3JvdXAuaWQxMDc5NDczOT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Business Operations", "value": "GC06"}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Accounting and Finance", "value": "GC01"}, {"text": "Science and Engineering", "value": "GC27"}, {"text": "Advertising and Marketing", "value": "GC03"}, {"text": "Customer Service", "value": "GC10"}, {"text": "Legal", "value": "GC17"}, {"text": "Protective Services", "value": "GC23"}, {"text": "Management", "value": "GC18"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Property", "value": "GC24"}, {"text": "Sales and Retail", "value": "GC26"}, {"text": "Social Services and Non-Profit", "value": "GC28"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "Business analyst", "value": "business analyst"}, {"text": "Analyst", "value": "analyst"}, {"text": "Security analyst", "value": "security analyst"}, {"text": "Systems analyst", "value": "systems analyst"}, {"text": "It analyst", "value": "it analyst"}, {"text": "Data analyst", "value": "data analyst"}, {"text": "System analyst", "value": "system analyst"}, {"text": "Support analyst", "value": "support analyst"}, {"text": "Associate", "value": "associate"}, {"text": "Management analyst", "value": "management analyst"}, {"text": "Operations analyst", "value": "operations analyst"}, {"text": "Soc analyst", "value": "soc analyst"}, {"text": "Test analyst", "value": "test analyst"}, {"text": "Intelligence analyst", "value": "intelligence analyst"}, {"text": "Research analyst", "value": "research analyst"}, {"text": "Senior", "value": "senior"}, {"text": "Senior analyst", "value": "senior analyst"}, {"text": "Control analyst", "value": "control analyst"}, {"text": "Manager", "value": "manager"}, {"text": "Project analyst", "value": "project analyst"}, {"text": "Researcher", "value": "researcher"}, {"text": "Risk analyst", "value": "risk analyst"}, {"text": "Service analyst", "value": "service analyst"}, {"text": "Technology analyst", "value": "technology analyst"}, {"text": "Accounting analyst", "value": "accounting analyst"}, {"text": "Application analyst", "value": "application analyst"}, {"text": "Behavior analyst", "value": "behavior analyst"}, {"text": "Business", "value": "business"}, {"text": "Center analyst", "value": "center analyst"}, {"text": "Compliance analyst", "value": "compliance analyst"}, {"text": "Coordinator", "value": "coordinator"}, {"text": "Desk", "value": "desk"}, {"text": "Desk analyst", "value": "desk analyst"}, {"text": "Financial analyst", "value": "financial analyst"}, {"text": "Functional analyst", "value": "functional analyst"}, {"text": "Hr analyst", "value": "hr analyst"}, {"text": "Interns", "value": "interns"}, {"text": "Operations center", "value": "operations center"}, {"text": "Process analyst", "value": "process analyst"}, {"text": "Programmer analyst", "value": "programmer analyst"}, {"text": "Project manager", "value": "project manager"}, {"text": "Qa analyst", "value": "qa analyst"}, {"text": "Senior associate", "value": "senior associate"}, {"text": "Senior consultant", "value": "senior consultant"}, {"text": "Specialist", "value": "specialist"}, {"text": "Sr analyst", "value": "sr analyst"}, {"text": "Support executive", "value": "support executive"}, {"text": "Technical analyst", "value": "technical analyst"}, {"text": "Technical architect", "value": "technical architect"}, {"text": "Trainee", "value": "trainee"}, {"text": "Treasury analyst", "value": "treasury analyst"}, {"text": "Wealth management", "value": "wealth management"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Internship", "value": "INTERN"}, {"text": "Part-time", "value": "PARTTIME"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Research", "value": "/business/naics2007/5417"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Mining", "value": "/business/naics2007/21"}, {"text": "Real Estate", "value": "/business/naics2007/53"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Engineering Services", "value": "/business/naics2007/5413"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Utilities", "value": "/business/naics2007/22"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "SingTel", "value": "/m/020zfl"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "Trustwave", "value": "/m/0n3xjf5"}, {"text": "Government Technology Agency", "value": "/g/11gh0528nq"}, {"text": "OCBC", "value": "/m/055r27"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "Credit Agricole Group", "value": "/m/028vbm"}, {"text": "UL", "value": "/m/01q1gj"}, {"text": "VISA", "value": "/m/01kqjn"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "American Express", "value": "/m/01w6dw"}, {"text": "Avensys Consulting", "value": "/g/11g7022gjf"}, {"text": "Binance", "value": "/g/11hcz1r4wl"}, {"text": "BlueVoyant", "value": "/g/11h1y4qdlf"}, {"text": "Caterpillar", "value": "/m/0319hp"}, {"text": "Cognizant Singapore, Cognizant Technology Solutions", "value": "/m/03bf9h"}, {"text": "DBS Bank Ltd", "value": "/m/01q7n5"}, {"text": "Deloitte SEA", "value": "/g/11f_g4x9d_"}, {"text": "Dyson", "value": "/m/05cskg"}, {"text": "EPAM Systems", "value": "/m/0dlnrc"}, {"text": "Experis Singapore", "value": "/g/11dxpnwm3s"}, {"text": "HSBC", "value": "/m/096k1t"}, {"text": "JPMorgan Chase & Co.", "value": "/m/01hlwv"}, {"text": "Jobline Resources Pte Ltd", "value": "/g/11gp2647pn"}, {"text": "Marina Bay Sands Pte Ltd", "value": "/m/09mhd9q"}, {"text": "Medtronic", "value": "/m/03z4j3"}, {"text": "Mizuho Bank", "value": "/m/022103"}, {"text": "Public Service Division", "value": "/g/11g6__bv10"}, {"text": "RECRUIT EXPRESS PTE LTD", "value": "/g/11g706hzhq"}, {"text": "RHB Singapore", "value": "/g/11c73srg7f"}, {"text": "Randstad", "value": "/m/08pt1z"}, {"text": "Randstad Singapore", "value": "/g/11g70b50mr"}, {"text": "SITA", "value": "/m/06l20z"}, {"text": "Selby Jennings", "value": "/g/11fy2ds3gn"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "Xcellink Pte Ltd", "value": "/g/11c73prcqy"}, {"text": "Xilinx", "value": "/m/03dwkc"}, {"text": "103 Golden Agri International Pte Ltd", "value": "/g/11fy210tb9"}, {"text": "Activate Interactive Pte Ltd", "value": "/g/11dxq192l5"}, {"text": "Amazon", "value": "/m/0mgkg"}, {"text": "Apple", "value": "/m/0k8z"}]}]}