{"search_metadata": {"id": "60827e2c3bea7b236dcff6ef", "status": "Success", "json_endpoint": "https://serpapi.com/searches/6ee02bf5d802cbb6/60827e2c3bea7b236dcff6ef.json", "created_at": "2021-04-23 07:58:36 UTC", "processed_at": "2021-04-23 07:58:36 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28data+analyst%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=0", "raw_html_file": "https://serpapi.com/searches/6ee02bf5d802cbb6/60827e2c3bea7b236dcff6ef.html", "total_time_taken": 1.07}, "search_parameters": {"q": "(data analyst) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "0"}, "jobs_results": [{"title": "Data Analyst", "company_name": "Sciente International", "location": "Singapore (+1 other)", "via": "via Jobs", "description": "8 April 2021 We are in search for a Data Analyst who can leverage his/her analytics skills to support automation and data analytics projects. Mandatory Skill(s) Degree holder majoring in Finance, Analytics, Computer Science or equivalent; Experience and hands on skills in Python, SQL, Tableau; Proficient in data analysis, data visualization and working with large scale datasets; Experience in data modelling , data mining as well as machine learning; Proficient in Microsoft and VBA; Strong communication skills with an analytical mindset. Desirable Skill(s) Experience working in Unix/Linux environment; Python certified; Tableau or Qlik certified. Responsibilities Collaborate with different stakeholders to understand data needs, gather requirements and implement data solutions to deliver business goals; Responsible for raw data analysis and data profiling for data integration; Build and maintain data queries as well as data pipelines using SQL and Python; Provide technical solutions... design scalable data models and suggest visualizations to meet the business objectives; Take part in designing and executing user acceptance testing; Build and improve regulatory reporting dashboards and conduct monthly reporting; Ensure documentation and traceability of requirements and, process flow diagrams, and other project documents", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEYXRhIEFuYWx5c3QiLCJjb21wYW55X25hbWUiOiJTY2llbnRlIEludGVybmF0aW9uYWwiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Ii0zNE9ZN2xidjlfUlR5clhBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9icyIsImxpbmsiOiJodHRwczovL3NnLmZpZGFudG8uY29tL2pvYnMvam9iLW9wZW5pbmcvZGF0YWJhc2UtYWRtaW5pc3RyYXRvcnMvZGF0YS1hbmFseXN0LTI3Nzg3NTA2ND91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Data Analyst", "company_name": "Surbana Jurong Private Limited", "location": "Singapore (+1 other)", "via": "via LinkedIn", "description": "Job Responsibilities\n\nThe Data Analyst will perform a variety of duties around data lifecycle management and data value chain related to sourcing, analysing, and presenting data. As part of this role, you will extract, normalise, and transform data for derivation of business and performance insights through data science techniques and dashboard visualization The role is required to facilitate the discovery of integration points in entities, attributes, relationships, and business rules by engaging various business units and support teams within SJ and to operationalize data analytics initiatives and generate data insights from numerous data sources in support of key stakeholders.\n• Translate pain-points into problem statements, develop analytics solutions, and present results and learnings to both technical and non-technical audiences in an engaging manner.\n• Build and maintain data queries as well as data pipelines through tools such as SQL, NoSQL\n• Build sophisticated dashboards and... automated reports for core business metrics and performance trends using visualization tools such as Tableau, Qlik or Power BI\n• Contribute to the data architecture engineering decisions to support analytics.\n• Help to identify the right data sources and data features that will be used to develop data science algorithms.\n• Work closely with project manager and technical leads to provide statistics or features that will drive business objectives and derive business insights\n• Work closely with project manager and technical leads to provide regular status reporting and support them to refine issues/problem statements and propose/evaluate relevant analytics solutions\n• Work in interdisciplinary teams that combine technical skills, business savviness and data science competencies to deliver work in a waterfall or agile software development lifecycle methodologies\n• Ability to analyse and break down complex concepts and technical findings into clear and simple language for communication to team members and clients\n\nRequirements\n• Candidate must possess at least a Bachelor's Degree in Computer Science, Software Engineering or equivalent.\n• Hands on experience with AWS, Azure, Cloudera, (or other Cloud & Big Data services),Data pipeline and/or database development experience\n• Knowledge of statistical modelling, predictive analytics or machine learning\n• Minimum 5 years’ experience in Data Analytics with competency in three or more of the following areas:\n• Data visualization tool (e.g. Tableau, Qlik, PowerBI )\n• SQL knowledge & Data modelling tools (e.g Erwin, Denodo)\n• Programming or scripting language (e.g. Python, R, Java)\n• Analytical software (e.g. SPSS, SAS)\n• Distributed architectures (e.g. HDFS, Hive, Spark)\n• Certification in leading data analytics platforms such as Qlik, Tableau, PowerBI, Informatica, Talend, SAS, etc.\n\nQualification\n\nBachelor's Degree, Post Graduate Diploma, Professional Degree", "extensions": ["19 hours ago", "Full–time"], "detected_extensions": {"posted_at": "19 hours ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEYXRhIEFuYWx5c3QiLCJjb21wYW55X25hbWUiOiJTdXJiYW5hIEp1cm9uZyBQcml2YXRlIExpbWl0ZWQiLCJjb21wYW55X21pZCI6Ii9nLzExZHhwcGc5Y2MiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJKekpKazdwWTdmcnlhUlFvQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFcUVDQ3VJQlFVNVZYMDV4VVhocE5WazBiMFJ5VlRob1lUTjFTRVZPWVZCRUxWbFJlbTE1YmtWUWNpMVhRbVJ6ZVc1eFpXNURia05FTTNkc2MxQmhNWGQyUWpkclZ6UkVjMUZoV1hNMVVYZFljMDVKYkZZMVowWlVkalpvYjB4Sk1IWTJTelpaVEZSVVJsWk1lVUZKTjBGWFNYbEVZMEpYV1VkWmFTMXVZVFYyVVhSMldsOVpjbU5yY2tSNlRuQlpaWEoyZDJ0alRXcEpjMHBTUTNsc05qTm5SeTFxYlVkek9XUnJVekJHTWxWTmFUVktTRWczWHpaQlozUjBjalJOUnpsbFJtTlRTRGg0UjFab2JUVllUMHRPWTNoclZUUXlTblJNTTI1Q1RWOVBSeTEzUWxSQmR4SVdURmcyUTFsUVQzbEJaSFUzZEVGaVExODBkbTlDZHhvaVFVOU5XVkozUkRNelJYZHJOMmRhUkc4eVdERnJjaTE1VkRGRFZVdHJhbXh5ZHciLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18xMSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL3NnLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvZGF0YS1hbmFseXN0LWF0LXN1cmJhbmEtanVyb25nLXByaXZhdGUtbGltaXRlZC0yNDk3NzI4NDM0P3JlZklkPTAzMDY2MzE2LWNkY2ItNGRkNC1iZjhjLWJjMDFjYjVjY2FmMVx1MDAyNnRyYWNraW5nSWQ9bmRObHgzTnhlSGtTaFB3MmFUclZUdyUzRCUzRFx1MDAyNnBvc2l0aW9uPTFcdTAwMjZwYWdlTnVtPTBcdTAwMjZ0cms9cHVibGljX2pvYnNfam9iLXJlc3VsdC1jYXJkX3Jlc3VsdC1jYXJkX2Z1bGwtY2xpY2tcdTAwMjZ1dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior Data Analyst", "company_name": "Burpple", "location": "Singapore", "via": "via NodeFlair", "description": "Burpple is seeking a Data Scientist. We are looking for a passionate certified Data Analyst. The successful candidate will turn data into information, information into insight and insight into business decisions. The job is to be the\"data eyes and ears\" guiding the product team.\n\nThe Role Objective\n• Defining new opportunities for product impact Influencing product and sales to solve the most impactful market problems.\n• Apply your expertise in quantitative analysis and the presentation of data to see beyond the numbers and understand how our users interact with our products.\n• Work as a key member of the product team to solve problems and identify trends and opportunities.\n• Inform, influence, support, and execute our product decisions and product launches.\n• Set KPIs and goals, design and evaluate experiments, monitor key product metrics, understand root causes of changes in metrics.\n• Exploratory analysis to discover new opportunities: understanding ecosystems, user behaviours, and... long-term trends Identifying levers to help move key metrics.\n\nResponsibilities\n• Product Strategy : Evaluate and define product and business KPIs and metrics along with Product Managers and Product Designers.\n• Data Visualization: Democratize data by building customized dashboards & reports for relevant stakeholders.\n• Analysis: Offer deep dive analysis to key stakeholders across all teams and products, in order to determine product features and UX optimization strategies.\n• Respond to data and product related inquiries in real-time to support business and technical teams\n• Provide data solutions, tools, and capabilities to enable self-service frameworks for data consumers\n• Responsible for developing and executing tools to monitor and report on data quality\n• Responsible for establishing appreciation and adherence to the principles of data quality management, including metadata, lineage, and business definitions\n• Build Machine Learning models to predict behaviour of users\n\nRequired Qualifications\n• Overall, 5 years of experience with at least 1 year of experience specifically in Product Analytics, preferably in e-commerce\n• You've master’s degree in Business Analytics, statistics, mathematics, economics, computer science or an equivalent education or possess relevant practical experience\n• Strong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracy\n• Strong knowledge of and experience with reporting packages (Business Objects etc), databases (SQL etc), programming (Python,R & ETL frameworks)\n• A/B Testing: Experience designing experiments and analyzing results with a solid background in statistics\n• Tracking Technologies: Google Analytics (Preferably IQ certified) or similar alternatives e.g. Adobe Analytics, Mixpanel, Amplitude\n• Should understand Machine Learning Algorithms\n• Excellent attention to detail can-do attitude with a relentless focus to get things done. Data needs to be precise. Conclusions drawn from data analysis will drive critical client decisions.\n• Demonstrated analytical skills. Ability to work with large amounts of data: facts, figures, and number crunching. Ability to see through the data and analyze it to find conclusions", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgRGF0YSBBbmFseXN0IiwiY29tcGFueV9uYW1lIjoiQnVycHBsZSIsImNvbXBhbnlfbWlkIjoiL2cvMTFkeHBzNXl2NSIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Im1DcDYweW0tZWhiUmtDLUFBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhVV2R2UkdSRk9ESmFkVzFwT1d0bk5WSXpRWE5pZUhoRWVVd3pVMWQ0V0dKR2RIbHljaTAxVVZvNVl6QXROVFU1ZEcxcUxUVnRRVnBpWDJRM1dtSkRiMVpwVDFCTmRqRnFORUZGTmpCMVYwcFlkRnB4WlRkQ1dVZEJlVmxvVm0xVVl6VnVOSGhpWkRWRlJsRmZhelJPTkU1NmJEbHhXamhZWHpWUVVEQjRWMnhYU0hoQmJtcFhXRUZqYTNSb1gyMXRVazlUWldWcGFuSTVSMHBSRWhaTVdEWkRXVkJQZVVGa2RUZDBRV0pEWHpSMmIwSjNHaUpCVDAxWlVuZENPVGs0YkVSVloydzFjVTVHUm5ONWNTMUlkM0p3Um0wM1dsaDMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18xOCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBOb2RlRmxhaXIiLCJsaW5rIjoiaHR0cHM6Ly9ub2RlZmxhaXIuY29tL2pvYnMvbGlzdGluZ3MvMTI3OTE/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Market Data Business Analyst", "company_name": "Goldman Sachs", "location": "Singapore (+1 other)", "via": "via EFinancialCareers", "description": "Market Data Business Analyst\n\nMORE ABOUT THIS JOB\nYOUR IMPACT\n\nThe Market Data Business Analyst team at Goldman Sachs are responsible for coordinating with internal business teams on the selection of products and ongoing management of the Firm's market data spend with third party vendors. The team provide guidance to internal users on data services appropriate for specific roles, coordinate expense management initiatives and provide data analytics to enable users to manage costs effectively.\n\nThe role provides the opportunity to directly contribute to managing the firms operating costs by building data analytics and automated workflow that help end-users to manage their market data subscriptions effectively. You will be responsible for developing data collection, modelling and visualization analytics that correlate usage with user inventories. The role will provide the opportunity to partner with divisional management and business unit leadership teams to implement expense management... initiatives.\n\nRESPONSIBILITIES AND QUALIFICATIONS\nHOW WILL YOU FULFILL YOUR POTENTIAL\n\n• You will thrive in a work environment that requires strong problem solving skills and independent self-direction, coupled with an aptitude for team collaboration and open communication\n• Driving strategic initiatives and deliver key programs of work across Market Data and the broader division\n• Your detailed knowledge of market data vendor products and an understanding of the Goldman Sachs business functions will enable you to formulate strategies to reduce operating expenses\n• Building data analytics using popular storage and visualization technologies to empower market data users to manage their costs\n• Interface with divisional leadership and front office users to implement expense management initiatives\n• Continually evaluate the vendor landscape to identify new offerings that may increase value and efficiency for our employees who require access to market data BASIC QUALIFICATIONS\n\n• 2 years minimum experience in Market Data\n• Python and SQL programming skills\n• Experience of publishing and modeling data with distributed storage platforms such as Hadoop\n• Experience with using visualization software (Tableau, Qlikview or equivalent)\n• Japanese language PREFERRED QUALIFICATIONS\n\n• FISD's Financial Information Associate certification\n• Proficient use of tier 1 market data vendor desktop software\n• General understanding of the capital markets\n• Experience of the MDSL MDM inventory system\n\nABOUT GOLDMAN SACHS\nABOUT GOLDMAN SACHS\n\nAt Goldman Sachs, we commit our people, capital and ideas to help our clients, shareholders and the communities we serve to grow. Founded in 1869, we are a leading global investment banking, securities and investment management firm. Headquartered in New York, we maintain offices around the world.\n\nWe believe who you are makes you better at what you do. We're committed to fostering and advancing diversity and inclusion in our own workplace and beyond by ensuring every individual within our firm has a number of opportunities to grow professionally and personally, from our training and development opportunities and firmwide networks to benefits, wellness and personal finance offerings and mindfulness programs. Learn more about our culture, benefits, and people at GS.com/careers .\n\nWe're committed to finding reasonable accommodations for candidates with special needs or disabilities during our recruiting process. Learn more: https:// www.goldmansachs.com/careers/footer/disability-statement.html\n\n© The Goldman Sachs Group, Inc., 2021. All rights reserved.\nGoldman Sachs is an equal employment/affirmative action employer Female/Minority/Disability/Veteran/Sexual Orientation/Gender Identity", "extensions": ["2 days ago", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJNYXJrZXQgRGF0YSBCdXNpbmVzcyBBbmFseXN0IiwiY29tcGFueV9uYW1lIjoiR29sZG1hbiBTYWNocyIsImNvbXBhbnlfbWlkIjoiL20vMDF4ZG4xIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiYmJpMml1UzZFTHh6OUJkdkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFUzVlJRa0ZZYzJwNlVrOVdaRTlrY1dkVVJra3RiMmxSZGsxNlZXMXNlbVJCZFVoM1dFTlpNSFZxVkZsV1oySTFOVTg1Y1ZOVk5sZDZjekZWZFRoR09FUlVPRVZUYUc1TmVXVlFiVkZoVkhkUWNrUlJUbXhRZEc5U2NrVlRkbXRMWVROb1RWWk9hVTV1VURrM1J6VlNRbHA2UVZOWFYyeFVPVEpVTjNkVGJFNUNURzFtUWtoUWFXRlROR0ZvVGxCTGVVc3lkM0ZUTkRFMFNVeG5FaFpNV0RaRFdWQlBlVUZrZFRkMFFXSkRYelIyYjBKM0dpSkJUMDFaVW5kQ1dsQmxaRk0zVG5aSWFGQnlSVkZ4VkhsWU9FdDNabUoxU25KUiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzI1IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEVGaW5hbmNpYWxDYXJlZXJzIiwibGluayI6Imh0dHBzOi8vd3d3LmVmaW5hbmNpYWxjYXJlZXJzLnNnL2pvYnMtU2luZ2Fwb3JlLVNpbmdhcG9yZS1NYXJrZXRfRGF0YV9CdXNpbmVzc19BbmFseXN0LmlkMTA4MDk1NTg/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Analyst - Analytics & Cognitive - SG", "company_name": "Deloitte SEA", "location": "Singapore", "via": "via Jobs At Deloitte Southeast Asia - Deloitte", "description": "At Deloitte, we offer a unique and exceptional career experience to inspire and empower talent like you to make an impact that matters for our clients, people and community. Deloitte offers you a highly inclusive, collaborative workplace and unrivalled opportunities to realize your full potential. We are always looking for people with the relentless energy to push themselves further, and to find new avenues and unique ways to reach our shared goals.\n\nWork you will do\n\nThe Analytics & Cognitive team leverages the power of data, analytics, robotics, science and cognitive technologies to uncover hidden relationships from vast troves of data, generate insights, and inform decision-making. Together with the Strategy practice, our Strategy, Growth & Innovation portfolio helps clients transform their business by architecting organizational intelligence programs and differentiated strategies to win in their chosen markets. This role sits within the Analytics & Cognitive team of Deloitte... Southeast Asia, which encompasses data, analytics and cognitive automation.\n\nEnough about us, let's talk about you\n\nIf you are someone with:\n• Strong academic performance in your undergraduate degree from any academic majors preferably Data Analytics, Engineering, Information Technology, Computer Science or Mathematics\n• Team player with effective interpersonal and communication skills, demonstrated leadership and teamwork within or outside a work setting\n• Exceptional problem-solving ability., logical reasoning, creative thinking, comfort with numbers, and the ability to untangle complex issues\n• Understanding of Artificial Intelligence and Machine Learning\n• Understanding of SDLC Waterfall and Agile Development Methodologies\n• Strong analytical skills, excellent oral and written communication skills in English\n• Drive, tenacity, entrepreneurship, client focused and results oriented\n• Proven demonstration of sound business acumen & teamwork, confidence in public speaking and presentation preparation is appreciated\n• Strong passion for consulting, ability to adapt and cope in a fast pace and a sense of humor!\n\nFor our Intelligent Automation practice:\n• Certification with Automation Anywhere, BluePrism, UiPath or WorkFusion will be advantageous.\n• Mastery of one programming language: C, Java, .Net, Python\n\nFor our Data Modernisation & Advanced Analytics practice:\n• A certification with Amazon Web Services (AWS), Google Cloud Platform (GCP) or Microsoft Azure is highly recommended\n• Experience with one or more non-relational data stores such as Pivotal, Cloudera, Hortonworks, MapR, Oracle BDA would be an advantage\n• Experience with one or more relational data stores using SQL, Oracle DB, Microsoft SQL Server, IBM Netezza, Teradata, MySQL or LibreSQL would be an advantage\n• An interest in data ingestion and transformation pipelines using Big Data technologies, including one or more of the following: Spark, Hive, Pig, Kafka, MapReduce, HBase, Sqoop, Flume or Storm\n• General knowledge of Linux/Unix based operating systems and Shell scripting would be an advantage\n• A demonstrated interest for all the latest technologies, libraries & languages. To name a few: ML, NLP, AI, Python, IoT, Blockchain, etc.\n\nNext Steps\n\nSo what are you waiting for? Join the winning team now. You can submit your application here:\n\nDue to volume of applications, we regret only shortlisted candidates will be notified", "extensions": ["13 days ago", "Full–time"], "detected_extensions": {"posted_at": "13 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBbmFseXN0IC0gQW5hbHl0aWNzIFx1MDAyNiBDb2duaXRpdmUgLSBTRyIsImNvbXBhbnlfbmFtZSI6IkRlbG9pdHRlIFNFQSIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiUmUtNm96Q1NkTmw1VV9DVkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIEF0IERlbG9pdHRlIFNvdXRoZWFzdCBBc2lhIC0gRGVsb2l0dGUiLCJsaW5rIjoiaHR0cHM6Ly9qb2JzLnNlYS5kZWxvaXR0ZS5jb20vam9iL1NpbmdhcG9yZS1BbmFseXN0LUFuYWx5dGljcy1cdTAwMjYtQ29nbml0aXZlLVNHLzU3OTcxNjExMC8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "L&D Data Analyst (Manager)", "company_name": "PwC Singapore", "location": "Singapore (+1 other)", "via": "via LinkedIn", "description": "Line of Service\nInternal Firm Services\n\nIndustry/Sector\nNot Applicable\n\nSpecialism\nIFS - Human Capital (HC)\n\nManagement Level\nManager\n\nJob Description & Summary\n\nA career at PwC is more than “just” a job. It’s about being part of a purpose-led firm that builds trust in society and solve important problems. We help our clients to make informed decisions and operate effectively within them. At PwC, we are committed to making a difference for each other, our clients, and our community — by empowering you to be the best version of yourself and investing in your growth. You’ll be able to develop as a leader, be well-connected, work in a great environment, explore our benefits and make a positive contribution.\n\nWith PwC, you’ll ignite a meaningful career while being supported by a strong coaching and people-oriented culture, our Flex policies (Flex Space, Flex Dress and Flex Time), innovative learning and development programs (training programs, digital upscaling) as well as mobility... opportunities. If you would like to be connected to like-minded individuals outside of work, we highly encourage you to be part of our people clubs and committees such as the Sports and Recreational Club, Toastmasters Club and more\n\nHow will you value add?\n\nA highly matured and independent individual responsible for performing analytics with learning data to generate insights on effectiveness of learning strategies, measure learning ROI, and propose learning solutions and design.\n\nThis individual will work cohesively with various client stakeholder groups across PwC, and display strong interpersonal and organizational skills, as well as business acumen.\n\nAdditionally, This Individual Will\n• Collaborate with learning stakeholders on issue statements, and thereafter determine, design, propose and present data-validated solutions\n• Design data workflow for seamless data collection and reporting process\n• Prepare reports and create data visualisation dashboards for executive leadership that effectively communicate learning & development trends, patterns, and predictions using relevant data\n• Collaborate with programmers and organizational leaders to identify opportunities for process improvements, recommend system modifications, and develop policies for data governance.\n• Liaise with Global/Regional L&D and HR teams to introduce data solution and digital initiatives locally\n• Support any ad-hoc projects as may be required or assigned\n\nAbout You\n\nWhat we need to see in you:\n• Degree in Computer Science / Information Technology or its equivalent\n• Minimum 5 years of relevant work experience in the L&D environment and possess good data analytics skills\n• Certification in Alteryx, PowerBI, Tableau, Qlikview or UIPath preferred\n• A critical thinker with strong analytical and problem solving skills\n• Strong interpersonal and communication skills with ability to understand and communicate business needs\n• A team player with a high level of agility\n• Only shortlisted candidates will be notified due to the high number of applicants for this role.\n\nEducation (if blank, degree and/or field of study not specified)\n\nDegrees/Field Of Study Required\n\nDegrees/Field of Study preferred:\n\nCertifications (if blank, certifications not specified)\n\nDesired Languages (If blank, desired languages not specified)\n\nTravel Requirements\n\nNot Specified\n\nAvailable for Work Visa Sponsorship?\nYes\n\nGovernment Clearance Required?\nNo\n\nJob Posting End Date", "extensions": ["2 hours ago", "Full–time"], "detected_extensions": {"posted_at": "2 hours ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJMXHUwMDI2RCBEYXRhIEFuYWx5c3QgKE1hbmFnZXIpIiwiY29tcGFueV9uYW1lIjoiUHdDIFNpbmdhcG9yZSIsImNvbXBhbnlfbWlkIjoiL2cvMTFkeHB6MmxoOCIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IklEeWtvcjgzRUJ5VFI0WURBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhWR3B4TTNSUldrVkVRa2QwUkVWMVFuUTRlVEpmZVY5QlltWjFXR0p6YlRrMGRsUmtZMjQwYTJWa1JEYzNkamhtVERaM1lWaHBjbkJWVVhjeGJ6WnpOMGxtZEVSVmIyNWxOV1l5UmxGa1IwVk9NemhuTmxWa1ltUnVWV1ZvVGpaNWIwSldla0ZGV2toa2JVbEhPRkZCYUZreU5IRlBiRTFpUm1Gb0xXeE5WVlJIWjBGbVFWQklRVnBpY25kSE1UVmxWMUpKYVZOUU1ubDVZWEYzRWhaTVdEWkRXVkJQZVVGa2RUZDBRV0pEWHpSMmIwSjNHaUpCVDAxWlVuZERURVZUWlZnMldWSXdRMDlsY0V4NFltZDZNMHN6TjFkR2JVVjMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18zNiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL3NnLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvbC1kLWRhdGEtYW5hbHlzdC1tYW5hZ2VyLWF0LXB3Yy1zaW5nYXBvcmUtMjQ5OTExMzg2OD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Digital Business Analyst (Data Analytics (TO-CF21A)", "company_name": "Government Technology Agency (GovTech)", "location": "Singapore (+1 other)", "via": "via Jobs Trabajo.org", "description": "Digital Business Analyst (Data Analytics) The Government Technology Agency (GovTech) seeks to transform the delivery of Government Digital Services by taking an \"outside-in\" view, putting citizens and businesses at the heart of everything we do. We also develop the Smart Nation infrastructure and applications, and facilitate collaboration with the public to co-develop technologies.Join us as we support Singapore’s vision of building a Smart Nation - a nation of possibilities empowered through info-communications technology and related engineering.Do you want to apply your skills, knowledge and energy to implement cutting-edge infocomm technology and digital solutions that will change the lives of Singaporeans and the public? In GovTech, you canAs a Digital Business Analyst, you will work in a Government Agency as a key member of the GovTech project team. You will support the Chief Information Officer at the Agency and collaborate with fellow project managers, solution architects and... technical services consultants to deliver leading-edge digital solutions. You are a pro-active, self-motivated and resourceful team member with good tech/digital knowledge and possess strong influencing and people handling skills. You are also adept at balancing multiple projects concurrently while constantly looking for new ways to apply digital technologies to meet identified Agency and citizen/business needs.What to Expect:You will be involved in a range of tasks including the following:partner with the Agency’s business teams to elicit citizen/business needs through human-centric, visual methods such as service journeys and develop the appropriate business caseapply Design Thinking / Service Design methodology and tools to develop and execute the approach to derive current state gaps and challenges, and future state design and solutionswork with fellow Govtechies and the Agency's project teams to develop user stories, functional/technical specifications and acceptance criteriaadopt best practices in data governance, perform data cleansing, pre-processing and feature engineering that facilitate meaningful analysisdesign interactive visualisation dashboards for data exploration and provide insights to Agency’s business teamsevaluate and recommend suitable technology while aligning with GovTech’s technology directions (such as cloud-based, enterprise architecture and modernization of legacy systems, adoption of SG Tech Stack )identify and adopt the appropriate development methodology (e.g. Agile or Waterfall) in an Outsourced, Co-Sourced or In-house development environmentensure system or product readiness for smooth deployment, adoption and operationsanalyse impact of requested changes and propose improvements to continuously address changing business needs, and work with support team to understand and address technical problems (Operations & Maintenance phase)assist the CIO to identify new opportunities for the Agency’s digital transformationHow to Succeed:Diploma/Degree in Computer Science, Infocomm Technology, Computer or Electronics Engineering or related subject area with minimum 3 years of relevant experience. Candidates with more years of experience will be considered for more senior rolesPrior working experience in IT business analysis, application solutioning design and testingParticipated in at least one full software or product development cycle, preferably using Agile MethodologyStrong analytical, conceptualisation and problem-solving skillsGood communication skills with the ability to pitch ideas and influenceA driven and motivated personality with an inquisitive mindAbility to learn and applyPreferred Skills:Business Analysis certification, e.g. Certified Business Analysis Professional (CBAP)Past development or consulting experienceRelevant experience in one or more of the following areas:Data manipulation using scripting languages like Python or using ETL tools Visual analytics technologies like Tableau, Power BI End-to-end analytics architecture, preferably with some working knowledge of big data stackWe are an equal opportunity employer and value diversity at our company as we believe that diversity is critical to innovation. We do not discriminate on the basis of race, religion, color, national origin, sex, gender, gender expression, sexual orientation, age, marital status, veteran status, or disability status. We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation. The Singapore Public Service plays a key role in the economic growth, progress and stability of Singapore by formulating and implementing government policies, as well as providing key public services. Whether you are a fresh graduate joining the workforce or an experienced professional, the Singapore Public Service offers a great variety of job opportunities for you. The work in the Public Service can be broadly categorised into the following sectors: Economic, Social, Security & External Relations, and Administration & Corporate Development. Be part of the team that shapes the future of Singapore. Log on and take your first step towards a career that matters", "extensions": ["12 hours ago", "Full–time"], "detected_extensions": {"posted_at": "12 hours ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEaWdpdGFsIEJ1c2luZXNzIEFuYWx5c3QgKERhdGEgQW5hbHl0aWNzIChUTy1DRjIxQSkiLCJjb21wYW55X25hbWUiOiJHb3Zlcm5tZW50IFRlY2hub2xvZ3kgQWdlbmN5IChHb3ZUZWNoKSIsImNvbXBhbnlfbWlkIjoiL2cvMTFnaDA1MjhucSIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImhCUmktQ2ZlWThFSzk1VUlBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVyWUNDdmNCUVU1VlgwNXhWRFZSWVRaNVMyUm1SWEptY0ZadFVteExkbkV6YVVWRU5EaENXbDlaWkRGeVdETk9MV1oxYm1GVlJtVmthRXAwTjBKVk9UbENUMjFTTVZBM2RqQmtRa2xCTmxnMlZYSkJjWHBrWWt0dGNFeEJaUzFQTlVsaFdXaFFjbEJxTlRGbFozRnliVnBVYlZsVU0xbzFRMWRET0ZCbVVFOWplRGRJYmxsWFlXZGlkVXN4V0VWQ1RVeDNaSFpmZVVzNFpEWlBNVFJHTFZCRFJHUXRlWGR0WDJWd1puTm1XVWxpUVZSMGF6ZFdYME5uYzAxaU9HVnpkR0Z3WTI5NmRWVkxXalpTVDIwMVMyUktVVzFqWXpsd09UZG1MVWxJV0ZsT1J6bGxUMmw2UmprNVJuVXlkakZ2VG10T1JrTkNjVFZKTkUxbGR4SVdURmcyUTFsUVQzbEJaSFUzZEVGaVExODBkbTlDZHhvaVFVOU5XVkozUW1welozUnhUSFZSUVcxU1gxQkNhRGhSZDA1MWJXdE9SbkpwWnciLCJmY3YiOiIzIiwiZmNfaWQiOiJmY180MyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIFRyYWJham8ub3JnIiwibGluayI6Imh0dHBzOi8vc2cudHJhYmFqby5vcmcvam9iLTQzOC0yMDIxMDQyMi1jZjIxYTM0YTZlZjgyYWVhNjllNjBlY2E5NWRmNjQzND91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Control and Metrics External Data Analyst (Associate Director)", "company_name": "Bank of Singapore", "location": "Singapore", "via": "via Laimoon.com", "description": "At Bank of Singapore, we are constantly on the lookout for exceptional individuals to join our team. We promote a culture of openness, teamwork and fairness. Most importantly, we invest in our people through our programmes that develop them on both professional and personal levels. Besides attractive remuneration packages, we offer non-financial benefits and opportunities to develop your potential within OCBC Group's global network of subsidiaries and offices. If you have passion, drive and the will to succeed, rise to the challenge today!\n\nBank of Singapore opens doors to new opportunities.\nStart your career with Bank of Singapore as a Control and Metrics External Data Analyst in our Data Management team! !\nTo pursue its ambition to become a data-driven company, BOS is looking to empower each users of the organization with self-service reporting capabilities. As part of this data transformation, BOS has set-up an Hub & Spoke Organization: Data Hub is a central team managing the... tools, governance, methodology and knowledge sharing among the various business Data Spoke from all departments (Finance, Risk, Compliance, HR, Marketing).\nGeneral Description\nThe Control and Metrics External Data Analyst will support the Chief Data and Innovation Officer in delivering the Bank of Singapore Data Strategy. The strategy includes enterprise wide implementation of the Hub & Spoke data organization (including External Data), Data Quality framework, the data science blueprint and will combine domain, organizational and industry skills with analytical tools and communication tactics, to help the Bank achieve low total cost of ownership (TCO) and rapid return on investment (ROI) for its Data and Innovation initiatives.\nThe External Data Unit is newly established in BOS Data Hub to:\n• Centralize the commercial negotiation with External Data Vendors\n• Collaborate with IT on overall target data infrastructure\n• Analyse and rationalize Bank's External Data consumption\n• Govern Bank's External Data Inventory / Dictionary\n• Coordinate with Group for synergies and implement a cohesive / efficient market data strategy.\nAs the Control and Metrics External Data Analyst, you are part of the Data Hub team on the mission to accelerate the adoption of data analytics tools and best practice across the organization through the following core activities:\nPrimary Responsibilities:\nA) Managing External Data vendors\n• Relationship Management of strategic vendors including Exchanges and Brokers\n• Manage and coordinate vendor activities such as notifications on changes, trials, demos, training and recontract discussions\n• Evaluate potential new solutions / products and implement to maximise External Data value\nB) Managing External Data requests and solutions\n• Provide advice and support for external data requests\n• Review of Business Unit External Data Inventory / Dictionary\n• Endorse the external data requests across platforms, applications and desktops\n• Regular interaction with Business Units to review external data costs optimization initiatives\n• Collaborating with Group including Procurement, Treasury, Technology & functions to maximise market data usage\n• Consolidate existing external data access across divisions to establish the current data usage requirements\n• Distribute analysis and reporting usage to establish key requirements and metrics to support and assist contract negotiations\n• Regular analysis on cost and usage\n• External Data Billing and Cost Reallocation Management\n\nQualifications\nRequirements:\n• Market Data knowledge within large financial institution or bank; with 3-5 years relevant experience\n• Banking industry data infrastructure knowledge\n• Vendor knowledge such as Bloomberg, Refinitiv, Morningstar, Allfunds etc\n• Knowledge on requirements related to FTP/ APIs/ Microservice (data integration / distribution capabilities) will be a plus\n• Ability to work independently and execute with a sense of urgency\n• Attention to details and able to work under pressure\n• Proactive, self-motivated and proven ability to use own initiative and judgment to work with internal stakeholders in a positive manner and help deliver solutions that benefit the business\n• Proven ability to operate effectively at all levels in a collaborative manner\n• Proficient in Excel, and Powerpoint\n• Knowledge in coding language will be a plus\nAccounting & Finance", "extensions": ["8 hours ago", "Full–time"], "detected_extensions": {"posted_at": "8 hours ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDb250cm9sIGFuZCBNZXRyaWNzIEV4dGVybmFsIERhdGEgQW5hbHlzdCAoQXNzb2NpYXRlIERpcmVjdG9yKSIsImNvbXBhbnlfbmFtZSI6IkJhbmsgb2YgU2luZ2Fwb3JlIiwiY29tcGFueV9taWQiOiIvbS8wcjN2Y3ptIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiUHJhbjBBRUI5d3NmcjdGaEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZZQkNyY0JRVTVWWDA1eFVteGlibWwwVm5Kdk4ycEpUR05xYmtwM2ExTTRTa00xWlhCRk5IZHlNWEJPZDFneWFqbGFVV1kwY2xnMmIxWkhhRWhGVXpVMk9VTXpXSEJhTVRocldFVllOSFpCY1c1RWRXRkpZMnQ0Vm1wck0zVkhOR05hTjBselR6RmhVMDloYTNkdVlteE1OMFZFVFdNMldqSk9lRTVuZDNZd1kxVkVWRmRHVUVSUWRXVTNaVkZWTW5GVVVXeEhPVjlwYUdKR2JWSlpOek5JYzJoVlIzSmFkbkJUTlRkRFpGbHVSRWhYT1ZORk1HVkxlbmhaRWhaTVdEWkRXVkJQZVVGa2RUZDBRV0pEWHpSMmIwSjNHaUpCVDAxWlVuZEJkbUZSWkRjMVlUQkhhM3BsYTFsTVlrMDFPV05hYkZCSVgyaG4iLCJmY3YiOiIzIiwiZmNfaWQiOiJmY181MSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMYWltb29uLmNvbSIsImxpbmsiOiJodHRwczovL2pvYnMubGFpbW9vbi5jb20vam9icy9leHRlcm5hbHZpZXcvMjYxMzk5MjY/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Data Engineer (Data Analytics) - Contract", "company_name": "SMRT Trains Ltd", "location": " (+1 other)", "via": "via Joblum Singapore", "description": "Job Purpose:\nWe are looking for an experienced data engineer to join our rapidly growing data team. You will be joining the team at an early stage of data warehouse development and your contributions will influence key design choices for the data warehouse. The role will require you to work with data owners to build data ingestion pipelines, construct data models for the warehouse and to maintain the operational stability of processes created. You will also work with data end users to expose data as required by decision support tools. Overall, you will strive for excellence by aligning the data systems created with business goals presented.\n\nResponsibilities:\nThe duties and responsibilities are listed below. The list is not comprehensive and related duties and responsibilities may be assigned from time to time.\n• Understand the data landscape to formulate and complete end-to-end data strategy that includes data gathering, data processing, analysis, ongoing scaled deliverables, and... presentations to facilitate decision-making and forward planning.\n• Identify opportunities for data acquisition, work with system owners to automate data connection.\n• Analyse and organize raw data, combine raw information from different sources, build data systems and data pipelines, perform extract transform and load (ETL) to prepare data for prescriptive and predictive modeling.\n• Build algorithms and prototypes, explore ways to enhance data quality and reliability; Develop analytical tools and programs\n• Collaborate with data scientists and architects on several projects\n\nRequirement:\n• Tertiary qualification with experience in data engineering or in a similar role\n• Experience in enterprise scale data migration and/or integration\n• Hands-on experience working with Azure Data Factory & SQL Server Integration Service with SAP, IBM or Microsoft SaaS and/or PaaS data sources\n• Data engineering certification is a plus\n• Experience in building a data system front-end is a plus\nTechnical skills include:\n• Strong analytical skills with the ability to collect, clean, organise, analyse, and disseminate significant amounts of information with attention to detail and accuracy\n• Ability to understand and explain complex data and effective working as a liaison between technical and non-technical groups\n• Technical expertise with data models, data mining, and segmentation techniques\n• Hands-on experience with SQL database design\n• Advanced knowledge of SQL is required and familiarity with other languages (C#/.NET, Python, Java, JavaScript) is a plus\n• Great numerical and analytical skills, experience with data visualisation tools such as Power BI, Tableau, Qliksense, etc. would be an advantage\nGeneric skills include:\n• Detail-oriented, with excellent organizational skills and experience\n• Critical thinker and problem-solving skills\n• Team player\n• Good time-management skill\n• Great interpersonal and communication skills", "extensions": ["2 days ago", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEYXRhIEVuZ2luZWVyIChEYXRhIEFuYWx5dGljcykgLSBDb250cmFjdCIsImNvbXBhbnlfbmFtZSI6IlNNUlQgVHJhaW5zIEx0ZCIsImNvbXBhbnlfbWlkIjoiL20vMGIzNWxfIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiR2kxRm1fSmxsN1VHZVB5aEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFZIVlhWMkkyT1dsYWVtUldOblU1WmxWVGJVNDJjMlpxVWtaRWVWQm1PRGxTWmxKa05VMURORWszTlcxcU5HWlJVVFZ0VHpWM1gyWlNaMmRhVDJSRk5HWXpZazkzVlRkalJUZG9hWFEyUW5sc01rTXlkMU5MYW5WSlEzQkJlRFpGTjNWSVpYVldWRmxVU0hsVWRUTlNibVpKWVhOdUxVVnhjRk5VUjIxbk9UZGlkbE5SYXpKU2NrOWtTRmxxV1hCVkxYbGtWbmhFU25nMlMxbDNFaFpNV0RaRFdWQlBlVUZrZFRkMFFXSkRYelIyYjBKM0dpSkJUMDFaVW5kRGNYWm9jVFJCVVdjd1VHZHdlSFJJVWtkQlNIbEpiRUV5YjFkbiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzU5IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYmx1bSBTaW5nYXBvcmUiLCJsaW5rIjoiaHR0cHM6Ly9zZy5qb2JsdW0uY29tL2pvYi9kYXRhLWVuZ2luZWVyLWRhdGEtYW5hbHl0aWNzLWNvbnRyYWN0LzYyNzk1OD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Analyst Admin Finance ​/dashboard", "company_name": "People Profilers", "location": "Singapore (+1 other)", "via": "via Learn4Good", "description": "Position: Analyst & Application Admin (1 yr contract /Finance / dashboard / up to 5k)\nJob\n\nDescription:\n\n√ Contract Renewable √ MNC √ Completion Bonus\n\nResponsibilities: ·In charge of administrating our Internal Audit and Internal\n\nControl tool, in close contact with worldwide Internal Auditors and Internal\n\nControllers. ·Provide efficient tool and support to the world-wide network ofInternal Control (administrator of the application with another colleague) ·Develop macros to improve the application and dashboard Visualization, data analytics, VBA, SQL and excel macros\n\nRequirements •Min Diploma / data analytics certification (example ACDA) with 2years experience in Data analytics & dashboard visualization and projectmanagement •Advanced level in office tools and analytics. •Excellent verbal and written communication skills\n\n•Ability to interact effectively with various levels of management isrequired. Outstanding verbal, presentation & facilitation skills pluseffective listening... skills, high energy and engaging. •Team Player Cindy\n\nChar Sin Yi EALicense Number: 02C4944 Registration\n\nNumber: R1765345 People\n\nProfilers Pte Ltd 11\n\nCollyer Quay, The Arcade, #13-01, Singapore 049317 Required\n\nSkills:\n\nRemuneration Dashboard Bonus Audit Facilitation Data Analytics Excel Resume Internal Audit Analytics Energy LTD Email SQL Project Management Finance Communication Management", "extensions": ["8 hours ago", "Full–time"], "detected_extensions": {"posted_at": "8 hours ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBbmFseXN0IEFkbWluIEZpbmFuY2Ug4oCLL2Rhc2hib2FyZCIsImNvbXBhbnlfbmFtZSI6IlBlb3BsZSBQcm9maWxlcnMiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Ik82dmhRcXFGZ2FCbFRaRmpBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGVhcm40R29vZCIsImxpbmsiOiJodHRwczovL3d3dy5sZWFybjRnb29kLmNvbS9qb2JzL3NpbmdhcG9yZS9maW5hbmNlLzI3MTk3NDM5OS9lLz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Business Operations", "value": "GC06"}, {"text": "Science and Engineering", "value": "GC27"}, {"text": "Management", "value": "GC18"}, {"text": "Accounting and Finance", "value": "GC01"}, {"text": "Advertising and Marketing", "value": "GC03"}, {"text": "Admin and Office", "value": "GC02"}, {"text": "Human Resources", "value": "GC15"}, {"text": "Legal", "value": "GC17"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Sales and Retail", "value": "GC26"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "Data analyst", "value": "data analyst"}, {"text": "Business analyst", "value": "business analyst"}, {"text": "Analyst", "value": "analyst"}, {"text": "Associate", "value": "associate"}, {"text": "Senior", "value": "senior"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Data scientist", "value": "data scientist"}, {"text": "Insights analyst", "value": "insights analyst"}, {"text": "Intelligence analyst", "value": "intelligence analyst"}, {"text": "Operations analyst", "value": "operations analyst"}, {"text": "Project manager", "value": "project manager"}, {"text": "Project officer", "value": "project officer"}, {"text": "Administrators", "value": "administrators"}, {"text": "Builder", "value": "builder"}, {"text": "Business", "value": "business"}, {"text": "Cloud consultant", "value": "cloud consultant"}, {"text": "Control analyst", "value": "control analyst"}, {"text": "Data engineer", "value": "data engineer"}, {"text": "Executive", "value": "executive"}, {"text": "It analyst", "value": "it analyst"}, {"text": "Performance manager", "value": "performance manager"}, {"text": "Product analyst", "value": "product analyst"}, {"text": "Research analyst", "value": "research analyst"}, {"text": "Research assistant", "value": "research assistant"}, {"text": "Research engineer", "value": "research engineer"}, {"text": "Senior analyst", "value": "senior analyst"}, {"text": "Senior associate", "value": "senior associate"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Solution architect", "value": "solution architect"}, {"text": "Support analyst", "value": "support analyst"}, {"text": "Technology consulting", "value": "technology consulting"}, {"text": "Unit", "value": "unit"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Internship", "value": "INTERN"}, {"text": "Part-time", "value": "PARTTIME"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Accounting", "value": "/business/naics2007/5412"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Mining", "value": "/business/naics2007/21"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Travel", "value": "/business/naics2007/5615"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "DBS Bank", "value": "/m/01q7n5"}, {"text": "SingTel", "value": "/m/020zfl"}, {"text": "Nanyang Technological University", "value": "/m/0l49k"}, {"text": "United Overseas Bank", "value": "/m/04gjd1"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "Bank of Singapore", "value": "/m/0r3vczm"}, {"text": "Binance", "value": "/g/11hcz1r4wl"}, {"text": "Citi", "value": "/m/01dfb6"}, {"text": "Cognizant Singapore, Cognizant Technology Solutions", "value": "/m/03bf9h"}, {"text": "Dyson", "value": "/m/05cskg"}, {"text": "EPAM Systems", "value": "/m/0dlnrc"}, {"text": "Ernst & Young", "value": "/m/0g9jc"}, {"text": "Goldman Sachs Services Private Limited", "value": "/g/11g9mm5tzn"}, {"text": "GovTech Singapore", "value": "/g/11dxpkfs_6"}, {"text": "PEOPLE PROFILERS", "value": "/g/11dxq43n_6"}, {"text": "PwC Singapore", "value": "/g/11dxpz2lh8"}, {"text": "Sciente International", "value": "/g/11c73gj19n"}, {"text": "AIR LIQUIDE INDUSTRIAL SERVICES PTE LTD", "value": "/g/11hg55y1rb"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Accounting and Corporate Regulatory Authority", "value": "/m/09g7_b3"}, {"text": "Agency for Integrated Care", "value": "/g/11c73jd3yt"}, {"text": "Amazon", "value": "/m/0mgkg"}, {"text": "Amazon Web Services Singapore", "value": "/m/0rznzt1"}, {"text": "BeathChapman Pte Ltd", "value": "/g/11f01b3y2c"}, {"text": "Big Cloud", "value": "/g/11c743lwsr"}, {"text": "Bloomberg", "value": "/m/027sm6"}, {"text": "Burpple", "value": "/g/11dxps5yv5"}, {"text": "CPF Board", "value": "/m/0615qb"}, {"text": "ClearanceJobs", "value": "/g/11fy1pft9v"}, {"text": "Comfort Transportation Pte Ltd", "value": "/g/11f01gw2xt"}, {"text": "Credit Agricole Group", "value": "/m/028vbm"}, {"text": "DYSON OPERATIONS PTE. LTD.", "value": "/g/11fy29mc6g"}, {"text": "Deloitte", "value": "/m/02spfd"}, {"text": "Direct Search Asia", "value": "/g/11fy260nhz"}, {"text": "EngageRocket", "value": "/g/11c73p5x97"}, {"text": "Epson Singapore", "value": "/g/11dxpfq_tf"}, {"text": "Expedia Group", "value": "/m/03gq420"}, {"text": "Forizons", "value": "/g/11hbm3kyzd"}, {"text": "GLOBALFOUNDRIES Singapore", "value": "/m/05pcrz0"}, {"text": "Goldman Sachs", "value": "/m/01xdn1"}, {"text": "Google", "value": "/m/045c7b"}, {"text": "Government Technology Agency (GovTech)", "value": "/g/11gh0528nq"}, {"text": "Ideallss", "value": "/g/11g70fpjm5"}, {"text": "IoTalents", "value": "/g/11dxq187wm"}]}]}