{"search_metadata": {"id": "60827957defa13287b460387", "status": "Success", "json_endpoint": "https://serpapi.com/searches/e24e071cc064895c/60827957defa13287b460387.json", "created_at": "2021-04-23 07:37:59 UTC", "processed_at": "2021-04-23 07:37:59 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28software+developer%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=50", "raw_html_file": "https://serpapi.com/searches/e24e071cc064895c/60827957defa13287b460387.html", "total_time_taken": 5.2}, "search_parameters": {"q": "(software developer) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "50"}, "jobs_results": [{"title": "Senior Software Engineer", "company_name": "Biqmind", "location": "Singapore (+1 other)", "via": "via LinkedIn", "description": "We are on the lookout for software engineers excited about working on today’s cloud native and\n\nKubernetes challenges. You enjoy solving the complexities of cloud native development and are\n\npassionate about bringing excellent solutions to market. You are an effective communicator,\n\nunafraid to question assumptions and enjoy being part of a larger cloud native ecosystem and\n\ncommunity.\n\nAs a member of the software development team, you will have the opportunity to build significant breadth and depth in your cloud native portfolio; from working on development of Biqmind’s advanced Kubernetes tools to participating in transformative client projects.\n\nPreferably you have relevant recent experience and have worked for at least 4 years. Beyond\n\nformal credentials, we are seeking talented people with the heart and the self-drive to grow. If\n\nyou have participated in hackathons, start-up product builds, open-source software projects or\n\ntechnology communities, we want to hear from you. You... can expect competitive compensation,\n\na results-oriented work environment and work-life balance.\n\nABOUT BIQMIND\n\nBiqmind provides specialist services and software tools to make cloud native possible through\n\ntechnologies such as Biqmind CAPE, Kubernetes and container platforms such as Red Hat\n\nOpenShift and Azure Kubernetes Service. Our mission is to make life easier for companies, teams\n\nand developers seeking to be cloud native. We enable execution of new approaches and augment skills, closing the gaps that are holding back strategies to push ahead with transformation and application modernization efforts.\n\nWe are a Microsoft Gold Partner, Red Hat APAC Business Partner for Professional Services and\n\nCloud Native Computing Foundation (CNCF) Silver Member. We are also one of the first partners to be invited to participate in the Microsoft Cloud Native Acceleration Program.\n\nIt is a fast-paced environment with a healthy balance between independent contribution and\n\ncollaboration. As an international community of experienced and emerging talent, what drives our work are fearless reinvention, collective brilliance and delivering solutions that are elegantly simple.\n\nROLE DESCRIPTION\n\nResponsibilities:\n\n• Build, maintain, and evolve core libraries, services, and/or platforms\n\n• Build and operate scalable, fault tolerant, distributed systems\n\n• Utilize cloud-based solutions\n\n• Research and implement innovative solutions which can increase the value of Biqmind products\n\n• Ensure that the Software Definition of Done is adhered to when delivering User Stories\n\n• Work on client engagements\n\n• Participate in Scrum or related Agile process and ensure the rules are adhered to\n\n• Address complex architectural problems with simple, intuitive design\n\n• Compile and write documentation related to program development\n\n• Train users to work with our products or systems\n\n• Any related other duties that we reasonably require you to undertake\n\nREQUIREMENTS\n\n• Bachelor's degree in Computer Science, Software Engineering or related discipline\n\n• Strong problem-solving skills\n\n• Expert level understanding of engineering development processes and working\n\nenvironments including Scrum, XP, Kanban, Lean etc.\n\n• Hands-on experience with full stack development\n\n• Experience with Golang, JavaScript, React, Databases, Storage & REST\n\n• Experience with Docker, Kubernetes, Linux OS\n\n• Operational experience running API services at scale\n\n• Strong architecture skills in web applications development\n\n• Experience with version control tools and continuous deployment\n\nPersonal Attributes:\n\n• Excellent interpersonal, analytical, communication and written and verbal English Language skills\n\n• Able to interact positively, clearly, and professionally with peers\n\n• Flexible, open-minded and a quick learner\n\n• Self-motivated with the initiative to problem solve\n\n• Accountable, reliable and a team player\n\n• Able to multi-task, prioritize activities, work independently and calmly under pressure\n\n• Able to adapt and thrive with changes in techniques and tools\n\n• Comfortable collaborating across teams and contributing to open source", "extensions": ["4 days ago", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgRW5naW5lZXIiLCJjb21wYW55X25hbWUiOiJCaXFtaW5kIiwiY29tcGFueV9taWQiOiIvZy8xMWcyMWZ6aHJiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiUlRTWTcyUFFpazRjZy15ZkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFUxTjZZV1p2U2xvMFdHUXhZa2x4Y21KV2EzWkJZMFZvUVZoNloxaElUemgwU1hKQ1NEWlpORzF6WVRCdFkyVkhUVTVJY1ZoTk16TXdXSGxaZUhWeU9HRkpPVU5UYTJsVlNWRmZiRVJ3TW5KaldYVnRTamc0ZUVSdmVTMWlaWEkzVjNWVk56aEhPV2x0WkhNemRqUm1Ua2RNT1VsclMwTlBlRVk1UkhWSk4waEZWa0ZKWTJ4NFlUSkVOM1pVYTB0c1JscDBVVnA0U0dGSVYyUjNFaFpZU0cxRFdVNVlWa1paUjE5MFVXSlpjelZoU1VSUkdpSkJUMDFaVW5kRFN6TlNWbWxFZDFWd1UwMWtXalZDVVdSUE5GaE9NRWxNYUVkUiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzciLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGlua2VkSW4iLCJsaW5rIjoiaHR0cHM6Ly9zZy5saW5rZWRpbi5jb20vam9icy92aWV3L3Nlbmlvci1zb2Z0d2FyZS1lbmdpbmVlci1hdC1iaXFtaW5kLTI0OTE2NDU4NDk/cmVmSWQ9MTM0ZGQzZmItYTczMy00OWUwLTgwYWYtMWQ2NzJlNzQ3OTcyXHUwMDI2dHJhY2tpbmdJZD1mUmxycmR3T1NXZDdKU2hyRG1TVzB3JTNEJTNEXHUwMDI2cG9zaXRpb249MTVcdTAwMjZwYWdlTnVtPTBcdTAwMjZ0cms9cHVibGljX2pvYnNfam9iLXJlc3VsdC1jYXJkX3Jlc3VsdC1jYXJkX2Z1bGwtY2xpY2tcdTAwMjZ1dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "High Frequency Trading System Infrastructure Software Engineer", "company_name": "DUOTECH", "location": "Singapore", "via": "via NodeFlair", "description": "• Understand server-side networking and typical network protocols, has the capacity of networking design and optimization for the High Frequency Trading system\n• Familiar with the HFT system architecture, has the ability to optimize the HFT system architecture\n• Familiar with the basic operation of various cloud services (e.g. cloud server, cloud database etc.) with various cloud service providers (e.g. AWS, Ali-cloud, Google Cloud etc.)\n• Perform routine operations of trading system, and resolve any problems identified\n• Improve the client experience for HFT system, conduct the trading system data security projects\n• Liaising with external associates for problem solving\n\nQualifications\n• At least 3 years of working experience in HFT system maintenance, familiar with various HFT system architecture\n• Must have knowledge of financial instruments including equities, commodities, credit, interest rates, foreign exchange, cryptocurrencies and futures\n• BSc/MSc in Information Technology... Data security, networking or any other relevant field\n• Prefer to have networking and information security related certification\n• Excellent problem solving and troubleshooting skills\n• Good learning capacity for new knowledge/area\n• Ability to multitask, prioritise and work independently\n• Excellent communication skills\n• Bilingual English and Mandarin in order to handle queries, concerns and feedbacks from English and Mandarin speaking headquarters and branch offices colleagues in other countries", "extensions": ["7 days ago", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJIaWdoIEZyZXF1ZW5jeSBUcmFkaW5nIFN5c3RlbSBJbmZyYXN0cnVjdHVyZSBTb2Z0d2FyZSBFbmdpbmVlciIsImNvbXBhbnlfbmFtZSI6IkRVT1RFQ0giLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6InU3azhtSjhkaE9WRXNUeG9BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTm9kZUZsYWlyIiwibGluayI6Imh0dHBzOi8vd3d3Lm5vZGVmbGFpci5jb20vam9icy9saXN0aW5ncy8xMjQxMz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Software Engineer", "company_name": "Hatcher Plus Pte. Ltd.", "location": "Singapore", "via": "via Monster", "description": "About Hatcher+:\n\nHeadquartered in Singapore, Hatcher+ is a global data-driven early-stage venture firm and we have analyzed over 600,000 VC transactions and constructed over 4 billion virtual VC portfolios to explore the return profiles of various strategies. The insights have led us to build a data-driven approach to venture investing that delivers robust, predictable returns, global deal flows and co-investment opportunities.\n\nAbout VAAST platform:\n\nHatcher+ VAAST™, the world's most advanced Venture-as-a-Service Technology platform incorporates AI-based application analysis and deal scouting, portfolio management and reporting, and comprehensive support for the daily operations of accelerators and venture capital firms. VAAST™ has been designed from the ground up to enable quantitative analytics and big data to play a role alongside traditional, more subjective decision-making for the first time. Through its inclusion of AI/ML, deal scouting capability and predictive scoring ... technologies VAAST™ helps VCs identify potential startup opportunities based on an investor defined mandate. Using the Deal Scout feature, users can scout startups using Natural Language Processing and use the Hatcher+ Opportunity Score to determine the best fit.\n\nTechnology:\n\nHatcher+ VAAST™ platform is built using HTML, JavaScript, Vue.js, CSS, PHP (Laravel), MySQL and 3rd party API integrations etc. We are in the midst of scaling up our technical architecture and adopting Vue.js as our frontend framework. The platform is supported by data tools and a predictive AI engine for scoring deals built using python and ML libraries.\n\nHatcher+ software engineering team:\n\nAt Hatcher+, we are looking for smart, tenacious and hardworking individuals who can challenge themselves in a highly collaborative environment. We welcome frontend engineers who are passionate about their craft, interested in the Venture Capital and FinTech industries and take the initiative to develop highly reusable front-end systems for Venture as a Service web application.\n\nRequirements:\n\n· Degree in computer science, computer engineering or similar\n\n· Experience with development in HTML, CSS, JavaScript and any of the modern frontend frameworks.\n\n· Collaborate with backend engineers on creating APIs for use with the frontend.\n\n· Comfortable working with relational database (MySQL)\n\n· Familiar with using git\n\n· Able to write clean, reusable, well-documented, and easily maintainable code", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciIsImNvbXBhbnlfbmFtZSI6IkhhdGNoZXIgUGx1cyBQdGUuIEx0ZC4iLCJjb21wYW55X21pZCI6Ii9nLzExZ3htNV9iZGciLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJHUlBERzhDOGhQU3Z4M3A3QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFb3NDQ3N3QlFVNVZYMDV4VXkxV05qTm9XbVJJYnpSUVUxWlpRWFV4Y0ZseFNWaDJjRGh3TmpWTU9IVlJiWFF5ZFdkSExYUXphRWx6U21Ob1RrRnJOREZ1YVd4YVJHY3lUbWczWW5ZdGF5MTZkRlkwU25WRVh6VmtWMFpHU1RaQlZtSjRUVU5NVkUxNFIyVndNME5LTXkxNlVFUlFTMGhWVURJNVZuQnhZUzF1Yld0Q05Yb3llbnB4VVdVMFdUSkxXWFpPUVdWemJFMWlWalV4ZUZZeGMxOHROM3BWTmsxSVNqbEZZa3hPYVZOR1EwZEhRbXhoZVVkb1lYQTNkRlJrZDBkM1gweEpaRVJ2VlhGRE1VZGZPVWhCRWhaWVNHMURXVTVZVmtaWlIxOTBVV0paY3pWaFNVUlJHaUpCVDAxWlVuZEVhVkpLU1VRNGFUVjRORU53UzJGS1dqRnFVemswZDBKalZtNTMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18xOCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNb25zdGVyIiwibGluayI6Imh0dHBzOi8vd3d3Lm1vbnN0ZXIuY29tLnNnL2FtcC9qb2ItdmFjYW5jeS1zb2Z0d2FyZS1lbmdpbmVlci1oYXRjaGVyLXBsdXMtcHRlLWx0ZC1zaW5nYXBvcmUtMjc4MDI1NTEuaHRtbD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "QA Test Engineer - Automated & Manual Testing #FastHire", "company_name": "PrimeStaff Management Services Pte Ltd", "location": "Singapore", "via": "via FastJobs", "description": "ResponsibilitiesDesign and implement conventional test i.e. System Integration and User Acceptance TestDesign and implement functional and non-functional software validation test on iOS, Android and web platformsDesign and implement static and dynamic security testing (SAST & DAST)Design and implement Performance TestDesign and implement Test CaseDesign and maintain test environmentsCarry out test activities according to Test PlanConduct Test Execution and prepare Test ReportsMaintain requirement traceability matrixDevelop automation test scripts in Python languageSupport the integration of test script with the Continuous Integration and Continuous Delivery (CICD) pipelineDrive product quality and Quality Assurance practicesRequirements:Minimum 6 years experience in conventional testMinimum 3 years experience in automation testing scripting for web-portals and mobile applicationsExperience working in Agile Scrum projectsExperience in developing automation testing scripts i.e. mobile... (Appium) and web (Selenium)Knowledge and/or Experience in Test-Driven Development (TDD) i.e. Unit TestingExperience in Behaviour-Driven Development (BDD) TestExperience in Non-Functional Testing i.e. security and performance testStrong and effective interpersonal and communication skills, motivated, good attitude, responsible, proactive and an energetic team player will be a plusSystematic, meticulous and able to work independentlyQualifications and skills:Diploma/Bachelor's degree or higher in Electronics Engineering, Computer Engineering, Computer Science or related disciplineA natural tenacity, resiliency and determinationCertifications such as Certified Software Testing Professional, Certified Software Quality Analyst and/or CREST certification will be advantageousPassionate in learning and working with new technologies EA License No: 95C5411 EA Personnel No: R1982267 EA Personnel Name: Tan Chia Ye", "extensions": ["1 day ago", "$5K a month", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time", "salary": "$5K a month"}, "job_id": "eyJqb2JfdGl0bGUiOiJRQSBUZXN0IEVuZ2luZWVyIC0gQXV0b21hdGVkIFx1MDAyNiBNYW51YWwgVGVzdGluZyAjRmFzdEhpcmUiLCJjb21wYW55X25hbWUiOiJQcmltZVN0YWZmIE1hbmFnZW1lbnQgU2VydmljZXMgUHRlIEx0ZCIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoicGdsb2NnenlyRWtWdnpsSkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBGYXN0Sm9icyIsImxpbmsiOiJodHRwczovL3d3dy5mYXN0am9icy5zZy9zaW5nYXBvcmUtam9iLWFkLzExNzE2MjkvcmVjLWpvYj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Programmer (.net", "company_name": "ADECCO PERSONNEL PTE LTD", "location": "Singapore (+1 other)", "via": "via Learn4Good", "description": "Position: Programmer (.net)\nLocation: null\nRoles &\n\nResponsibilities\n\nWORKS SPECIFICATIONSSCOPE OF WORK(a) The overall scope of the works expected from the from the Contract Programmer shall include the following:\n\n-i. Gather user requirements and prepare specifications and other relevant documentation according to the documentation standard required and etc;ii. Design, develop, implement and maintain web-based and other applications;iii. Perform project administrative duties, including disseminating project information to project stakeholders and monitoring the progress of project milestones;iv. Trouble-shoot, diagnose and rectify reported application problems while at the same time, resolving the related diagnosed application problems within a satisfactory time period;v.\n\nConduct End User briefings and training entailing the use of the software applications when required;vi. Assist in rolling out new projects/applications or enhancements of existing systems/applications; andvii... Arrange logistics for meetings, conferences, trainings, and other project-related events. Organise project committee meetings and prepare the necessary materials, including reports, presentations, agendas and other meeting collateral. Transcribe and accurately record key decisions and action items resulting from meetings.\n\n(b) The personnel to be provided must have at least 5 years of working experience in the design, development, programming, implementation and maintenance of large scale web-based and general application systems. They should preferably hold a certification in Microsoft Certified Application Developer (MCAD) and Sun Certified Java Programmer (if possible). (c) The personnel must have working knowledge and experience in the following environment :\n\n- i. Development Languages/Tools\n\nVB.NET, C#.NET, Visual Basic 6 (At least 5 years)\n\nOO Analysis and Design (At least 2 years) ii. Internet Technologies\n\nASP.NETHTML, Java Script, AJAXMS SharePoint Online\n\nMS Power\n\nAppMS Power\n\nAutomate iii. Database and Others\n\nMS SQL Server 2008 (At least 5 years)\n\nMS SQL Server 2016MS Visual Studio 2008 (At least 5 years)\n\nMS Visual Studio 2017.NET Framework 3.5 (At least 5 years).NET Framework 4.5\n\nIIS, SSLWindows 2003 or above / Windows XP Next Steps\n\nIf interested, you can click on “Apply here” or write an e-mail to (Please contact us using the \"Apply for this Job Posting\" box below) with your updated resume.\n\nNOTE:\n\n- Only shortlisted candidates will be contacted back.\n\nAsha Yadav| EA LIcence No.91C2918 | Personnel Registration No. R1876730\n\nTell employers what skills you have.NETASP.NETC#.NETMS SQLVB.NETWeb Application Design\n\nWeb Applications\n\nWeb Development\n\nWeb Services\n\nXMLWeb based", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9ncmFtbWVyICgubmV0IiwiY29tcGFueV9uYW1lIjoiQURFQ0NPIFBFUlNPTk5FTCBQVEUgTFREIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJFaUkxOGszOUc5Yk01Ylo3QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExlYXJuNEdvb2QiLCJsaW5rIjoiaHR0cHM6Ly93d3cubGVhcm40Z29vZC5jb20vam9icy9zaW5nYXBvcmUvc29mdHdhcmVfZGV2ZWxvcG1lbnQvMjcxMjU5NDYwL2UvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Software Developer", "company_name": "None", "location": "Singapore", "via": "via Jobs", "description": "Responsibilities: 1) Software Development a) Be a Scrum development team member; Ability to collaborate with team effectively Able to support storyboarding effort of the team Capability to contribute in all phases of the development cycle b) Develop and enhance applications; Development activities are expected to be carried out with minor supervision Able to deliver working software on time Able to design and develop high quality code as per standards and guidelines c) Peer-Review of code; Can perform peer-review to ensure code quality and requirements are met 2) Software Support a) Support SIT and UAT activities; Able to assist smooth delivery of software to SIT and UAT environments b) Provide support for production; Capable to fix assigned bugs quickly • Able to update status and work details in Bug/Issue Tracking System Requirements: Candidate must possess at least Bachelor's Degree/Post Graduate Diploma/Professional Degree in Computer Science/Information Technology or equivalent... Minimum of 2 years of experience in software development Possessing any of the certifications or equivalent would be an added advantage a) Certified JAVA Developer b) Certified Scrum Developer (CSD) Strong analytical skills, able to solve complex problem Good knowledge and implementation of REST APIs Knowledge of Agile and Scrum Experience with modern web technologies, HTML5, CSS3 Experience with Javascript and frontend frameworks e.g. Angular Experience with JDK 1.5 and above, J2EE and Spring, Hibernate framework, Grails/Groovy Knowing C, C++ and C# is advantageous Experience with J2EE application servers GlassFish, Jetty or equivalent Working with Databases – MySQL, Oracle, SQL Server or equivalent Knowledge of Design Patterns e.g. MVC Familiar with source control management system such as SVN, GIT or equivalent. Familiar with usage of bug tracking system such as BugZilla, JIRA or equivalent. Experience with mobile hybrid development as well as native e.g. Cordova/Phonegap Able to communicate in English fluently both verbal and written", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBEZXZlbG9wZXIiLCJjb21wYW55X25hbWUiOiJOb25lIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJEbjNiLU14bDF0UG1Ca29rQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnMiLCJsaW5rIjoiaHR0cHM6Ly9zZy5maWRhbnRvLmNvbS9qb2JzL2pvYi1vcGVuaW5nL3NvZnR3YXJlLWRldmVsb3BlcnMtYXBwbGljYXRpb25zL3NvZnR3YXJlLWRldmVsb3Blci0yNzU0MzI5ODQ/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Software Engineer (Web, Frontend, Backend, Full-Stack)", "company_name": "Surer", "location": "Singapore", "via": "via Glints", "description": "Get a more meaningful career with us 🚀\n\nSurer is an InsurTech startup that will revolutionise the way the General Insurance industry manages their entire workflow, from an agent advising their clients (the end policyholder) to how the Insurer distributes their products.\n\nAnd as a Software Engineer, you get to be a part of the revolution! We are building delightful experiences for insurance intermediaries and some of the biggest insurers out there, and this role at Surer only means you design, build, and ship for them! At Surer, you can take on big responsibilities to solve some of today's greatest problems in the Insurance industry.\n\nIt does not matter if you're stronger in frontend, backend, or both; as long as you're passionate about and skilled at building web products, there's a place for you!\n\nResponsibilities\n\nWe are looking for a talented and self-driven Software Engineer who has the nous to think out-of-the-box and make use of the great flexibility we provide to our team - to... make a big difference for the Insurance industry and empower the parties within this ecosystem.\n\nYour day to day task will be focused on working directly with our CTO and the founding team and be on the leading front to develop new features, suggest better processes, re-engineering and testing of functionalities.\n\nIn summary, you will:\n• Design, develop, test, deploy, maintain and improve our full-stack web software\n• Coding: consistently write production-ready code that is testable, easily understood by other developers, and accounts for edge cases and errors, with scalability and performance in mind.\n• Testing: write unit tests as well as higher-level tests in accordance with it.\n• Debugging: proficient at debugging systematically to diagnose all issues located to a single service\n• Collaborate closely with our product designer, product owner, and other engineers based on Agile principles and work with tool sets such as JIRA (or similar issues management systems) while keeping an eye out for emerging technology trends and developments.\n• Technical documentation\n\nExperience and Skill Sets\n\nMust have:\n• Bachelor’s Degree in Information Technology, Computer Science or equivalent\n• Preferably at least 1 year of experience in software development, working on business applications, however fresh grads will be considered as well\n• Knowledge or experience in full stack web application development with a variety of languages including but not limited to .Net Core, Javascript, HTML and CSS\n• Knowledge or experience in the concept of web development such as HTTP, HTTPS protocols, backend code integration with frontend code via RESTful APIs\n• Experience in dealing with Git repo\n• Value high quality code and you want to satisfy your thirst for knowledge of the latest technologies every day\n• Strong understanding of good software engineering practices (version control, code reviews, testing, refactoring etc.)\n• Able to understand and communicate ideas clearly with team members\n\nNice to Have:\n• Knowledge or experience in DevOps and in using the surrounding ecosystem of tools\n• Knowledge or experience in working in an agile development environment and familiar with being in a SCRUM team\n• Good grasp of security principles, and develops with a security-first mindset\n• CI/CD practices\n• Familiar with frameworks such as jQuery, Bootstrap\n• Able to work independently as well as in a team\n• Able to multitask in a demanding, fast paced environment and work with minimal supervision to meet deadlines\n• Knowledge or experience in TDD (Test Driven Development) and/or BDD (Behaviour Driven Development)\n• Knowledge or experience in building Microservices\n• Knowledge or experience in Domain Driven Design (DDD)\n\nWhat you can get out of us\n• Exposure to a fast-paced, yet fun, startup culture\n• Work directly with the founding team and have autonomy to make certain decisions\n• Opportunity to develop industry-changing products\n• Gain knowledge and experience in the InsurTech and FinTech industry\n• Flat team structure with no office politics\n• You will be engaged in conversations about the business to have a broader perspective of the value of your work as an engineer\n• We are a young startup and so have many interns in the team - they will look to you for guidance, which is an opportunity to hone your leadership skills\n\n---\n\nAbout Surer\n\nSurer is a cloud-based, web platform with a market-first technology in the region, that helps all parties in the General Insurance industry automate processes and drive network collaborations, enabling them to provide better service and support to their clients. Launched in August 2020 in Singapore, Surer was founded by a group of professionals with years of experience in the Insurance industry who are passionate about solving inefficiencies within the General Insurance industry as it was a problem they had faced as well. Surer is certified by the Singapore FinTech Association as an InsurTech service provider and is one of the portfolio companies funded by Antler, a global early-stage venture capital firm that invests in the defining technology companies of tomorrow. Visit https://surer.sg/ for more information or read about us in the media at https://surer.sg/category/in-the-news/.\n\nAbout the founders\n\nFounded by Gordon, Derren and Renfred, we have held positions to grow the business in highly successful startups like PropertyGuru and Carousell, successfully founded and exit-ed from a VendTech startup, ShakeSalad, while also having careers in major insurance companies like AIG, MSIG and QBE. One of us is even an Asian Games Gold Medalist", "extensions": ["10 days ago", "$3.5K–$5K a month", "Full–time"], "detected_extensions": {"posted_at": "10 days ago", "schedule_type": "Full–time", "salary": "$3.5K–$5K a month"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciAoV2ViLCBGcm9udGVuZCwgQmFja2VuZCwgRnVsbC1TdGFjaykiLCJjb21wYW55X25hbWUiOiJTdXJlciIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoidUltZGJnN0tWMGp6U19GN0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBHbGludHMiLCJsaW5rIjoiaHR0cHM6Ly9nbGludHMuY29tL3R3L29wcG9ydHVuaXRpZXMvam9icy9zb2Z0d2FyZS1lbmdpbmVlci13ZWItZnJvbnRlbmQtYmFja2VuZC1mdWxsLXN0YWNrLzJiOWUyNzM3LTgyYTAtNDE1ZC1iYTFhLTU0MTUzNzg5ZTJlZj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Software Engineer - Singapore : Edenstep (H/F), Edenred, Singapore, Singapore", "company_name": "Edenred", "location": "Singapore", "via": "via BizLINKS Resources Pte Ltd", "description": "Employer Referral\n\nSoftware Engineer - Singapore : Edenstep (H/F) ----Edenred is a leading services and payments platform and the everyday companion for people at work, connecting 50 million employees and 2 million partner merchants in 46 countries via more than 850,000 corporate clients. Edenred offers specific-purpose payment solutions for food (meal vouchers), fleet and mobility (fuel cards, commuter vouchers), incentives (gift vouchers, employee engagement platforms) and corporate payments (virtual cards). These solutions enhance employee well-being and purchasing power, improve companies’ attractiveness and efficiency, and vitalize the employment market and the local economy. Edenred’s 10,000 employees are committed to making the world of work a connected ecosystem that is safer, more efficient and more user-friendly every day. In 2019, thanks to its global technology assets, the Group managed €31 billion in business volume, primarily carried out via mobile applications, online... platforms and cards. Edenred is listed on the Euronext Paris stock exchange and included in the following indices: CAC Next 20, FTSE4Good, DJSI Europe and MSCI Europe. What is Edenstep? Edenstep is Edenred's Graduate Program. It offers international opportunities for fresh graduates in Digital, Business Development, Finance, Marketing and Strategy! You are looking for challenge, international experience? Join this 24 months’ program where you will have the opportunity to get 2 experiences of 12 months in 2 of our 45 countries! What kind of mission? You would be a Software Engineer in Singapore for the first year. Context: Edenred APAC zone covers 7 countries and it represents about 150 employees in the IT Department across APAC. Edenred has a multiple range of IT systems from back-offices, middle-offices and front-offices which are delivered to international customers. This gives a mix of systems used by Professional, end users and Edenred internal users. As a Software Developer you’ll be working with Senior Developers on various exciting projects, involving Analysis, Development and testing. You will join the regional team based in Singapore. A multicultural team, multi-skilled, dynamic, curious and passionate about learning new technologies and applying them to solve Business challenges. You will be working under the leadership of Gautier Bourgeois, Enterprise Architect of this region, who is looking for the kind of person who wants a challenging position in a fast-paced environment where there is always something new happening. The ideal candidate can assimilate into a professional environment and make immediate, positive contributions. Your key responsibilities would be to: • Document functional and technical specification documents • Develop, maintain and enhance multiple systems • Investigate, analyse, document and maintenance correction of reported defects • Perform related duties as assigned Profile: Professional experience / Knowledges • Demonstrable and certified software development experience • Knowledge of Agile/Scrum development process • Knowledge of DevOps (Azure DevOps is a plus) • JIRA/Confluence experience is a plus • Comprehensive knowledge of database architecture and design • Good understanding and hands-on experience in OOP techniques and methodologies, coding of a separated, multi-layers (data layer, business layer, and user interface layer, etc.) architecture • Ability to interpret and identify requirements and document functional and technical specifications • An understanding of REST API fundamentals, including prior API design experience will be an advantage Education: • MS degree in Computer Science, Engineering or a related subject (graduation in 2018,2019 or 2020) Technical skills • Coding using Java or C# • Microsoft SQL Server • Microsoft development tools including: Microsoft Visual Studio, .Net framework, C#, high concurrency services oriented programing, multithreads programing, and windows service programing, WCF, high performance SQL statement/procedure based on MS SQL Server • Web development with HTML, CSS, JavaScript, Bootstrap and JQuery • Restful JSON API • Coding PHP is a plus Soft skills • Autonomous • Critical thinker and problem-solving skills • Team player • Good time-management skills • Great interpersonal and communication skill • Flexible attitude and ability to perform under pressure How to apply? Send your applications in English to : This email address is being protected from spambots. You need JavaScript enabled to view it. document.getElementById('cloak1bdca42d8606806f54584e2fcd2ee95c').innerHTML = ''; var prefix = 'ma' + 'il' + 'to'; var path = 'hr' + 'ef' + '='; var addy1bdca42d8606806f54584e2fcd2ee95c = 'graduate.program' + '@'; addy1bdca42d8606806f54584e2fcd2ee95c = addy1bdca42d8606806f54584e2fcd2ee95c + 'edenred' + '.' + 'com'; var addy_text1bdca42d8606806f54584e2fcd2ee95c = 'graduate.program' + '@' + 'edenred' + '.' + 'com';document.getElementById('cloak1bdca42d8606806f54584e2fcd2ee95c').innerHTML += ''+addy_text1bdca42d8606806f54584e2fcd2ee95c+''; specifying “Singapore: Edenstep Application”. Your application will include a resume in English and one PowerPoint slide introducing yourself – be creative! Graduate Program start date: September 1st, 2020 This program is only accessible through a V.I.E contract. Please refer to the section what is a V.I.E contract for more information. More information on our website : https://www.edenred.com/en/edenstep", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciAtIFNpbmdhcG9yZSA6IEVkZW5zdGVwIChIL0YpLCBFZGVucmVkLCBTaW5nYXBvcmUsIFNpbmdhcG9yZSIsImNvbXBhbnlfbmFtZSI6IkVkZW5yZWQiLCJjb21wYW55X21pZCI6Ii9tLzBrdjlmYnIiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJXaURfZmxWbk8zMWVRQlkxQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VTNSWGQyOXFWVUpOTVVaSGRrVktSM1I0WVhaT2NURnJUMUUyWm5WMFJqbHRWV1JYWkRreloyeFpRbGxSYTFWYVFXZHlaWGhOTm1GWVdYRmplRXBxYW1oMlNGRldXa2R4WjNCcFpWTnpSbVkyYmtOaVkzSmFWM2w0ZEROS2JrMVBOV0ZrYTBKNFZqQlRWR2htUjBodFFqaElkSGt4TjBGUlVVUllaMWhZVHpST1RqVlhWbFJIVmxSdFUwOU1WMWhoUldSUWRVNXVXVFZOZEdoQkVoWllTRzFEV1U1WVZrWlpSMTkwVVdKWmN6VmhTVVJSR2lKQlQwMVpVbmRDZEhsWWJtRjRNVzR6VFdaRlZFZHZkVU56WW1wdUxUazRhV3BCIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNDMiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQml6TElOS1MgUmVzb3VyY2VzIFB0ZSBMdGQiLCJsaW5rIjoiaHR0cHM6Ly93d3cuYml6bGlua3NyZXNvdXJjZXMuY29tLnNnL2luZGV4LnBocC9qb2ItbGlzdGluZ3MtcHVibGljLzkyLXNvZnR3YXJlLWVuZ2luZWVycy8xOTExLWVkZW5yZWQ/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Software Engineer (Back-End) – Accounting Firm", "company_name": "3E Accounting Pte Ltd", "location": "Singapore (+1 other)", "via": "via 3E Accounting", "description": "3E Accounting Singapore is currently looking to appoint a Software Engineer (Back-End) to join their company digital R&D team in Singapore office.\n\n3E Accounting Pte Ltd aims to be the leading corporate service provider and top accounting firm in Singapore providing One-Stop Solution services for our clients.\n\n3E Accounting Pte Ltd, Singapore is the global headquarters of 3E Accounting International, an International Accounting network with a global presence in more than 80 countries worldwide.\n\nOur Mission\nTo offer the Three Es: efficiency, effectiveness and economy, all part of our One-Stop Solution services for our clients.\n\nOur Vision\nThe World’s leading corporate service provider, offering services beyond excellence.\n\nRemuneration is commensurate with qualifications and work experience. Qualified and interested candidates should email their resume to info@3ecpa.com.sg\n\nPlease state your current and expected salary.\n\nJob Responsibilities:\n\n• Responsible in supporting the full... software development of new and existing applications.\n• Work with internal team to explore and create new design/architectures (but not limited to) for better scaling and performance of back-end services\n• Define and prototype feature specifications\n• Create prototype to explore feasibility of new solution\n• Optimise application for maximise speed and scalability.\n• Develop, construct, analyse and troubleshoot large-scale systems.\n• Develop, integrate and maintain in-house Artificial intelligence and cognitive solutions.\n• Maintaining the system, new feature, bug fixing, code refactoring and performance optimisation.\n• Possess the ability to translate ideas into functioning features\n• Deliver high quality application and system support\n• Any other ad-hoc duties as required or assigned\n\nRequirements:\n\n• Degree in Computer Science, Information Technology or related degrees with at least 2-3 years of related experience\n• Experience in back-end software development preferred\n• Experience in system design and architecture with experience in system performance and scaling\n• Ability to adapt quickly to new technology and in-house application", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciAoQmFjay1FbmQpIOKAkyBBY2NvdW50aW5nIEZpcm0iLCJjb21wYW55X25hbWUiOiIzRSBBY2NvdW50aW5nIFB0ZSBMdGQiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IkVVa1NRTFdqNXQwUTVZUGpBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gM0UgQWNjb3VudGluZyIsImxpbmsiOiJodHRwczovL3d3dy4zZWNwYS5jb20uc2cvY2FyZWVycy9zb2Z0d2FyZS1lbmdpbmVlci1iYWNrLWVuZC8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Software Applications Developer (.Net) #SGUnitedJobs at PetroChina", "company_name": "PetroChina", "location": "Singapore", "via": "via BizLINKS Resources Pte Ltd", "description": "Software Applications Developer (.Net) #SGUnitedJobs at PetroChina\n\nEmployer Referral\n\nJob Description\n\nResponsibilities Performs requirements gathering, alternative analysis and applies modelling & systems design techniques, develops test cases and plans, executes system testing & validation of results leading to the development of “fit-for-purpose” solutions that address the business needs. Assists in requirements study, documentation and analysis of end-users needs required in the capturing/identification/conception of business problem and use cases. Develop alternatives and drive the selection analysis of a fit-for-purpose solution to address the users' requirements. Create detailed systems designs, apply .NET or suitable programing languages in the development of the components, modules and interfaces leading to the system/application that meets the functional specifications that fulfil the users' requirements. Applies information protection standards, defines & develops test... cases and plans, executes system testing & validation of results, in the acceptance of the developed system/application by the users. Performs error logging and maintenance of systems with correction of reported bugs and other works required in the upkeep of the system/applications in production. Other relevant software development tasks or duties assigned as part of PCSG IT Application Team and contract staff of PCSG. Requirements Diploma/Degree in Computer Science or Information Technology or related studies. At least 2 - 5 years of software and application development & support experience as a coder and s/w designer with substantial know-how and hands-on experience in areas of work such as: - Software Application programming using .NET languages (C#, VB .NET) with knowledge of SQL and working with databases, API and other systems interfaces in the implementation of web, desktop or mobile applications. Microsoft Certified Professional Developer (MCPD) or other professional software qualifications relevant in software/application development is a plus. Working knowledge of RESTful web services, MVC architecture, Data Visualization tools such as PowerBI & low code development technologies such as Microsoft Power Platform of Applications. Experience on the following is a definite advantage: Entity Framework, WCF, MVC, WPF, AngularJS, Bootstrap. Participated in project and change management of IT systems using Agile and Scrum principles and processes. Full stack, frontend/backend software development Please write in with a full resume, present and expected salary, contact telephone number(s) and any other relevant information to: Email: This email address is being protected from spambots. You need JavaScript enabled to view it. document.getElementById('cloak85a93f6068ab8a7482bf54568d2ae5d1').innerHTML = ''; var prefix = 'ma' + 'il' + 'to'; var path = 'hr' + 'ef' + '='; var addy85a93f6068ab8a7482bf54568d2ae5d1 = 'hr' + '@'; addy85a93f6068ab8a7482bf54568d2ae5d1 = addy85a93f6068ab8a7482bf54568d2ae5d1 + 'petrochina' + '.' + 'com' + '.' + 'sg'; var addy_text85a93f6068ab8a7482bf54568d2ae5d1 = 'hr' + '@' + 'petrochina' + '.' + 'com' + '.' + 'sg';document.getElementById('cloak85a93f6068ab8a7482bf54568d2ae5d1').innerHTML += ''+addy_text85a93f6068ab8a7482bf54568d2ae5d1+''; Only shortlisted candidates will be notified. Personal Data Protection In submitting your personal data and/or resume, you shall be deemed to consent to us collecting, using and disclosing your personal data for the purpose of assessing your job application. Information collected may also be disclosed to the PetroChina Group of Companies (which includes PetroChina International (Singapore) Pte. Ltd., Singapore Petroleum Company Limited, Chinaoil (Singapore) Pte. Ltd.) for this purpose. Show more\n\nOriginal Joblink : https://sg.linkedin.com/jobs/view/software-applications-developer-net-%23sgunitedjobs-at-petrochina-2202440408", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBBcHBsaWNhdGlvbnMgRGV2ZWxvcGVyICguTmV0KSAjU0dVbml0ZWRKb2JzIGF0IFBldHJvQ2hpbmEiLCJjb21wYW55X25hbWUiOiJQZXRyb0NoaW5hIiwiY29tcGFueV9taWQiOiIvbS8wNHF4aHYiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiI3d0dGOE5aTTVESDdsNjRvQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VXpOM1JuSTVlREozT1hkaFpISlVaV3h6VjNnNFJsRXpNMjV5UlhsWlpYRkdNWEpRT0hZdFpIZzJRVEJxTVVRMGIyeHhkMjVRV1VsWVUzWlViMVYxWHpnM1JIaHNXalZxZFdoSlUzSnNObTFHYURoUVdtVkpPVUkxV25GelowczJhbFJwVkZGUWNrUTVOVkUzYW5kdFpqaEhTakEwZVMwNWNubEpTRzlhTms1NmN6QkZWbUl4Y2xRM09VOXpUamh4YUY5S2QyMTFOMEZ5V2pKUkVoWllTRzFEV1U1WVZrWlpSMTkwVVdKWmN6VmhTVVJSR2lKQlQwMVpVbmRCVWs5QmFGUTJRWFJOUlRWbE1HVjBOekZoWjJ4TFgxSk1SMFozIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNTUiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQml6TElOS1MgUmVzb3VyY2VzIFB0ZSBMdGQiLCJsaW5rIjoiaHR0cHM6Ly93d3cuYml6bGlua3MuY29tLnNnL2luZGV4LnBocC9qb2ItbGlzdGluZ3MtcHVibGljLzkyLXNvZnR3YXJlLWVuZ2luZWVycy8zOTcxLXNvZnR3YXJlLWFwcGxpY2F0aW9ucy1kZXZlbG9wZXItbmV0LXNndW5pdGVkam9icy1hdC1wZXRyb2NoaW5hP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}], "chips": [{"type": "Title", "param": "job_family_1", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Software engineer", "value": "software engineer"}, {"text": "Senior", "value": "senior"}, {"text": "Test engineer", "value": "test engineer"}, {"text": "Cloud engineer", "value": "cloud engineer"}, {"text": "Engineer", "value": "engineer"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Assurance engineer", "value": "assurance engineer"}, {"text": "Programmer", "value": "programmer"}, {"text": "Coach", "value": "coach"}, {"text": "Qa engineer", "value": "qa engineer"}, {"text": "Devops engineer", "value": "devops engineer"}, {"text": "Frontend engineer", "value": "frontend engineer"}, {"text": "Java engineer", "value": "java engineer"}, {"text": "Solutions engineer", "value": "solutions engineer"}, {"text": "Testing engineer", "value": "testing engineer"}, {"text": "Analyst", "value": "analyst"}, {"text": "Data engineer", "value": "data engineer"}, {"text": "Design engineer", "value": "design engineer"}, {"text": "Development manager", "value": "development manager"}, {"text": "Devops consultant", "value": "devops consultant"}, {"text": "Firmware engineer", "value": "firmware engineer"}, {"text": "Lead engineer", "value": "lead engineer"}, {"text": "Lecturer", "value": "lecturer"}, {"text": "Manager", "value": "manager"}, {"text": "Network systems", "value": "network systems"}, {"text": "Principal", "value": "principal"}, {"text": "Principal engineer", "value": "principal engineer"}, {"text": "Quality engineer", "value": "quality engineer"}, {"text": "Science", "value": "science"}, {"text": "Scrum master", "value": "scrum master"}, {"text": "Security architect", "value": "security architect"}, {"text": "Security engineer", "value": "security engineer"}, {"text": "Senior engineer", "value": "senior engineer"}, {"text": "Senior lecturer", "value": "senior lecturer"}, {"text": "Senior system", "value": "senior system"}, {"text": "Senior technical", "value": "senior technical"}, {"text": "Software architect", "value": "software architect"}, {"text": "Specialist", "value": "specialist"}, {"text": "Stack engineer", "value": "stack engineer"}, {"text": "System engineer", "value": "system engineer"}, {"text": "Technical", "value": "technical"}, {"text": "Trainee", "value": "trainee"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Wholesale", "value": "/business/naics2007/42"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Mining", "value": "/business/naics2007/21"}, {"text": "Rental", "value": "/business/naics2007/532"}, {"text": "Retail", "value": "/business/naics2007/44"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": ".AB4Jjf.qPB6Vc{padding-right:11px}.qfpP8d{padding:7px 0 7px 11px}.S003Ke{flex:none}.ZoN4Lb{color:rgba(0,0,0,.54)}.nAXVG{color:#70757a}.IxQsL{color:rgba(0,0,0,.26)}.xFO1De{color:#fff}.ooFpK{color:rgba(255,255,255,.30)}.mtnwac{color:#4285f4}.WxeeKb{color:#34a853}.hIVRU{color:#f29900}.EXaTMc{color:#fbbc04}.sxn46d{color:#000}.gqMTF{color:#1a73e8}.zpn8Mb{color:#d93025}.dEUPmd{color:#1e8e3e}.PJNo1{color:#fbbc04}Actively Hiring", "value": "e"}, {"text": "EPAM", "value": "/m/0dlnrc"}, {"text": "VISA", "value": "/m/01kqjn"}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Zühlke", "value": "/g/1hh_rg216"}, {"text": "Cardinal Health", "value": "/m/040vzx"}, {"text": "Credit Agricole Group", "value": "/m/028vbm"}, {"text": "GlobalTix Pte Ltd", "value": "/g/11dxpqdhrf"}, {"text": "HCL SINGAPORE PTE. LTD.", "value": "/g/11fy25ngsv"}, {"text": "Jobline Resources Pte Ltd", "value": "/g/11gp2647pn"}, {"text": "Mediacorp", "value": "/m/03qtz1"}, {"text": "Realtek", "value": "/m/05wrm7"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "TECHNOPALS PTE. LTD.", "value": "/g/11dxpvkynp"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "Thales", "value": "/m/01phj4"}, {"text": "UST", "value": "/m/08kb8g"}, {"text": "UrbanFox", "value": "/g/11ghs7y0w6"}, {"text": "Activate Interactive", "value": "/g/11dxq192l5"}, {"text": "Cognizant", "value": "/m/03bf9h"}, {"text": "DELL", "value": "/m/0py9b"}, {"text": "HCL Technologies", "value": "/m/0698gv"}, {"text": "ORACLE", "value": "/m/05njw"}, {"text": "Singapore Press Holdings Limited", "value": "/m/0d7mwh"}, {"text": "Temasek Polytechnic", "value": "/m/098s73"}, {"text": "TikTok", "value": "/g/11fy265933"}, {"text": "Zendesk", "value": "/m/0wkm4pl"}, {"text": "A-it Software Services Pte Ltd", "value": "/g/11dxpy_gl_"}, {"text": "ACCENTURE PTE LTD", "value": "/m/09n8w94"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "Adecco GS", "value": "/m/08gz46"}, {"text": "Atidan Technologies", "value": "/g/11c74f0b8_"}, {"text": "Autodesk", "value": "/m/018nm3"}, {"text": "Avnet", "value": "/m/0c8xmc"}]}]}