{"search_metadata": {"id": "60827e22c90e0a5835c6350d", "status": "Success", "json_endpoint": "https://serpapi.com/searches/065ea9f5ddc81184/60827e22c90e0a5835c6350d.json", "created_at": "2021-04-23 07:58:26 UTC", "processed_at": "2021-04-23 07:58:26 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28project+manager%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=0", "raw_html_file": "https://serpapi.com/searches/065ea9f5ddc81184/60827e22c90e0a5835c6350d.html", "total_time_taken": 2.91}, "search_parameters": {"q": "(project manager) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "0"}, "jobs_results": [{"title": "Project Manager", "company_name": "ABS Group", "location": "Singapore", "via": "via Jobs", "description": "Description Job Capsule The Project Manager has overall responsibility for the technical, budget, schedule administrative and financial execution of individual projects. Depending on business needs, this may be a collateral duty. The Project Manager functionally reports to the Director/Manager of Projects. The Project Manager may be assigned to several projects concurrently and may also be assigned to perform specific marketing-related functions including presentation of company qualifications for project opportunities and preparation of proposals. The Project Manager position is a management-level position, with both technical and management responsibilities. Projects are typically executed on an independent basis, with assistance by assigned staff, though subject to independent quality assurance and financial/management performance audits. Job Duties/Roles Participates in the development of budgets, schedules and profit objectives for assigned projects, within requirements of... contracts and subject to the approval of Director/Manager of Projects. Participates in negotiating budgets, schedules, project terms and conditions on specific proposal opportunities. Provides input to staffing requirements in support of the project execution plan. Sets up the project initiates project management files, and maintains project files and documentation for assigned projects. Provides project direction to and oversight of Engineers and Surveyors assigned to projects. Assures projects are executed within the approved budget and schedule. Prepares technically accurate and timely reports related to the project as required by the client. Actively monitors client feedback and service delivery status and serves as a supplementary point of contact for clients on assigned projects. Assists management in identifying employee training and development needs. Responsible, for monitoring progress of the project relative to actual time expended, fees invoiced and expenses incurred versus those budgeted. Responsible for monitoring project accounts receivable concerning the client’s account and working with the client to maintain timely payments. Assists in the preparation and submission of time charge records, expense reports, invoice approvals, and collections status notices in accordance with company procedures. Qualifications Knowledge, Skills and Abilities Required (KSAR) Project Management Professional (PMP) Certification or equivalent certification and/or licenses in the area of specialization is preferred. Able to effectively speak and write in fluent English. Ability to organize, plan, monitor and control project contractual requirements, budgets, schedules and technical work. Ability to utilize basic personal computer applications including spread sheets, word processors, email, and internet browsers. Ability to communicate technical aspects of projects and of work assignments to peers, subordinates and clients. Ability to direct the execution of complex projects. Working knowledge of the ABS Health, Safety, Quality & Environmental Management System. Minimum Years of Experience A minimum of five (5) years of project management for ERP/software implementation or related experience. Required/Preferred Education Requirements Bachelor’s degree in a related technical discipline or equivalent experience and training preferred Required/Preferred Professional Requirements Project Management Professional (PMP) Certification or equivalent certification and/or licenses in the area of specialization is preferred.#LI-GHS1Company: ABS GROUP", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJBQlMgR3JvdXAiLCJjb21wYW55X21pZCI6Ii9nLzExZHhwbGoxejYiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJ2V000bTg1RGxiU1lETDlvQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VTNwR04ycHNXbVpmUVhKclVIWXdkSGxLU0RCb1kwdHBWRWs1U1dwYVgwcDJUMU5zWjFFeWFUSkljRmhDUkVGTVRYWkpiMHRKYjBkeWFHeHNTVkZDYVUxMU1VcEZaSGQ2U2xaMVZXNXVNbEZ5VkZoTlNXWjFVRVI1WlY5bWRYSTRiVk5NWlRBM2JUWnlkMUpQY1U0MmFVUmFWMWx6TW1ad1dqZHBXVlpZVmxrM1ptdHFkMlF0U2xFNVpqTmxRa1ppV0cxWGJYZDNhRFpwV0hoQkVoWktTRFpEV1ZCdUxVbFplVWQwVVdGTmMySk1aMFJSR2lKQlQwMVpVbmRDUnpkTU9UUjBlblJCTVRkdVpsbGxWek5PTWxOeldUY3haRWwzIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIiwibGluayI6Imh0dHBzOi8vc2cuZmlkYW50by5jb20vam9icy9qb2Itb3BlbmluZy9pbmZvcm1hdGlvbi10ZWNobm9sb2d5LXByb2plY3QtbWFuYWdlcnMvcHJvamVjdC1tYW5hZ2VyLTI3Nzg4MjkxMj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Project Manager SGUnitedJobs", "company_name": "None", "location": "Singapore", "via": "via Jobs", "description": "Job Requirements Degree in the field of Computer Science or related study. 2-3 years direct work experience in a project management capacity for software development. PMP certification will be an added advantage. Strong familiarity with project management software, such as Microsoft Project. Experience at working both independently and in a team-oriented, collaborative environment is essential. Ability to effectively prioritize and execute tasks in a high-pressure environment is crucial. Strong analytical and problem-solving capabilities. Strong written and oral communication skills. Strong interpersonal skills. Must be able to learn, understand, and apply new technologies. Singaporean or Permanent Resident Main Job Responsibilities Ensure projects are delivered on schedule and within budget. Creates and executes project work plans and revises as appropriate to meet changing needs and requirements. Identifies resources needed and assigns individual responsibilities. Conduct user... requirement gathering, review and training. Manages day-to-day operational aspects of a project and scope. Reviews deliverables prepared by team before passing to client. Effectively applies SDLC methodology and enforces project standards. Prepares for engagement reviews and quality assurance procedures. Minimizes our exposure and risk on project. Ensures project documents are complete, current, and stored appropriately. Job Requirements Degree in the field of Computer Science or related study. 2-3 years direct work experience in a project management capacity for software development. PMP certification Skills: Business Analysis, Change Management, Collaboration, Information Technology, Leadership, Management, Program Management, Project Management, Project Planning, Strategy, Software Developing, Environment, Analytical Thinking, high pressure Experience: 2.00-5.00 Years", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIgU0dVbml0ZWRKb2JzIiwiY29tcGFueV9uYW1lIjoiTm9uZSIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiVktQUnJJYzRMcnhkVDdUTUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIiwibGluayI6Imh0dHBzOi8vc2cuZmlkYW50by5jb20vam9icy9qb2Itb3BlbmluZy9pbmZvcm1hdGlvbi10ZWNobm9sb2d5LXByb2plY3QtbWFuYWdlcnMvcHJvamVjdC1tYW5hZ2VyLXNndW5pdGVkam9icy0yNzg1MDY5MzI/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Manufacturing Project Manager (PMP) – US MNC / EAST / Contract to Perm", "company_name": "Achieve Career Consultant Pte Ltd", "location": "Singapore", "via": "via Joblum Singapore", "description": "►Basic UP TO S$12K + Good Bonuses!!\n►Proven experience in project management\n►Project management certification (e.g PMP)\n►Experienced in a Manufacturing environment\n►Leading Manufacturers of Life Science productsOur client is one of the Leading Manufacturers of science products and are looking for suitable candidates to join their growing business as a Manufacturing Project Manager.\nRESPONSIBILITIES:\n• Manages complex projects and ensures they are completed on time and on budget\n• Coordinates across multiple functions and teams to move forward on strategic goals while managing dependencies and removing obstacles that stand between the team and business success\n• Manages and leads project review meetings ensuring the needs of internal and external stakeholders are consistently met\n• Able to facilitate team decision making process at the management team level\n• Enforce project scope limitations at the project team level to ensure projects remain on schedule\n• Authority to mediate and... resolve disagreements between functional core team members in support of project managers\n• Verbal and written communication skills, effective and diplomatic mediation, problem solving, good judgment in decision making, good time management, organization, effective partnerships with non-co-located teams. Deliver communication with transparency and visibility\n• Creativity in finding solutions. Able to look within, across and outside the organization.\nREQUIREMENTS:\n• Bachelor's Degree in any disciplines\n• Min. 7 years of project management experience\n• Proven track record of the ability to effectively lead and motivate others towards a given objective.\n• Demonstrated entrepreneurial drive with the ability to operate independently while seeking opportunities to improve the business (across all functions).\n• Tenacious in ensuring deliverables are achieved.\n• Demonstrates practical creativity by offering process improvements, solving complex problems, and troubleshooting\n• Attention to Detail – meticulous focus on costs, budgets and complex cash flow models. Careful to provide clear and concise budgets\n• Manufacturing and Technical Knowledge – a detailed knowledge of manufacturing processes, MRP and stock control, automation knowledge, knowledge of plastics, formulation skills, efficiency monitoring\n• Technical Awareness – an ability to understand the complexities of new product development, product improvement and complex data analysis\n• Project management training and certification (e.g., PMP) desired\n• Lean & Six Sigma certification desired\nOTHER INFORMATION:\n• Location: East\n• Working days: Monday – Friday: 8am – 5pm\n• Salary: Basic UP TO S$12K + Good Bonuses (Salary will commensurate according to experience & qualifications).\nHOW TO APPLY:\nIf you are a team player, meticulous & organized, and more importantly, believe that YOU CAN MAKE A DIFFERENCE, we would like to hear from you.\nSimply submit your application by emailing a detailed copy of your updated Resume in MS Word Format to Brandon Lee Hong Lee (Reg. No.: R1983786)Email: brandon.lee@achievegroup.asia\nor call your friendly Consultant, at 6590 9918 or for a confidential discussion.\nPlease indicate the below information in your resume:\n• Current & Expected Salary\n• Reason(s) for leaving\n• Notice Period / Availability to commence work\nWe regret only short listed candidate will be notified. All applications will be treated with the strictest confidence.\nBy submitting any application or resume to us, you will be deemed to have read & agreed to the terms of our Privacy Policy, and consented to us collecting, using, retaining and disclosing your personal information to prospective employers for their consideration, and for our marketing EDMs which you may opt out by unsubscribing in the mailer. You may refer and access our website at www.achievegroup.asia/privacy-policy/ for more information.\n\nCessation of Collection of full NRIC Numbers:\nIn compliance with the Personal Data Protection Act and commitment to protect candidates’ personal data, Achieve Group will cease to collect, process or use full NRIC numbers during our screening and job application process.Kindly ensure your resumes provided to us does not contain your full NRIC number and full home address during your job application.\nYOUR SUCCESS IS OUR ACHIEVEMENT", "extensions": ["20 hours ago", "$9K–$12K a month", "Full–time"], "detected_extensions": {"posted_at": "20 hours ago", "schedule_type": "Full–time", "salary": "$9K–$12K a month"}, "job_id": "eyJqb2JfdGl0bGUiOiJNYW51ZmFjdHVyaW5nIFByb2plY3QgTWFuYWdlciAoUE1QKSDigJMgVVMgTU5DIC8gRUFTVCAvIENvbnRyYWN0IHRvIFBlcm0iLCJjb21wYW55X25hbWUiOiJBY2hpZXZlIENhcmVlciBDb25zdWx0YW50IFB0ZSBMdGQiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Ikh6RjhYa0RlaVA3NDM3ajFBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9ibHVtIFNpbmdhcG9yZSIsImxpbmsiOiJodHRwczovL3NnLmpvYmx1bS5jb20vam9iL21hbnVmYWN0dXJpbmctcHJvamVjdC1tYW5hZ2VyLXBtcC11cy1tbmMvNjMxNjkxP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Project Manager", "company_name": "ACI HR Solutions Ltd", "location": "Singapore", "via": "via ACI HR Solutions", "description": "The Company\n\nOur client is a leading lifestyle entertainment brand that is synonymously known on a global stage and has ambitious growth plans with new and exciting locations opening.\n\nThe Role\n\nTo be responsible for the overall direction, coordination, implementation, execution, control and completion of specific projects ensuring consistency with company strategy, business objectives, commitments and goals. This role will report into the CEO with dotted lines into key corporate associates.\n• Oversees strategic plan, monitoring and adapting as needed\n• Total and wholistic responsibility over project P&L\n• Creates project plans\n• Maintains project objectives\n• Lead the planning and implementation of project\n• Facilitate the definition of project scope, goals and deliverables\n• Manage project budget and resource\n• Plan and schedule project timelines\n• Monitor and manage project deliverables\n• Provide direction and support to project team\n• Project quality assurance\n• Prepare report... defining project progress, problems and solutions\n• Reporting on progress of the project to Project Steering Committee and Stakeholders\n• Implement and manage project changes and interventions to achieve project outputs\n• Proper handover and closure of project to respective stakeholders and operational team\n• Project evaluations and assessment of results\n• Need to travel overseas\n\nThe Person\n• Bachelors degree required\n• 10+ years experience in project management\n• Project management professional (PMP) certification preferred\n• Experience in people management\n• Critical thinking and problem solving skills\n• Able to plan and organise independently\n• Decision-making skills\n• Strong communication and team work abilities\n• Strong negotiation skills\n• Conflict management skills\n• Adaptability and stress tolerant\n• Analytical and able to manage multiple objectives and budgets", "extensions": ["2 days ago", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJBQ0kgSFIgU29sdXRpb25zIEx0ZCIsImNvbXBhbnlfbWlkIjoiL2cvMTFjNzNyeWgzcCIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IlQxNlh0R3Fhdi1CZzZMZUhBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2WUJDcmNCUVU1VlgwNXhVM0pyT0hZd1psOXZORlZoZG10aWJVRnFkM2gyWVdWZlN6WkpkSFpDWW5wTWExUnlhV1JvUzBSS1duQnZOM1JUUldaSGNqaFdNV1IzVVVkMFMzZGtVM0puTW5sRk1EVm1TSEozVGxWWmRFbG5ZM1IzV2taU1UwdzFSazR5ZDBOM1RscDJRMHMwU1VsSlNGQkdZbEJETnpZeVlrTjZabk5XY2tSbmJuVjZiMjFrT1c1c2EwcDVNRTFOVEhKS1l5MTVOMm96VFVaeWJVdzRjMHhqTVZjdFVFTm1YM2hUWjNOMVgwODBaRGhIYTFJNEVoWktTRFpEV1ZCdUxVbFplVWQwVVdGTmMySk1aMFJSR2lKQlQwMVpVbmRDVUVrMWRXczBVVXRPYTIxVVVrWmFhM0pSUjI1RGFsSjNSVmwzIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMjIiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQUNJIEhSIFNvbHV0aW9ucyIsImxpbmsiOiJodHRwczovL3d3dy5hY2loci5jb20vam9icy9wcm9qZWN0LW1hbmFnZXI/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "PROJECT MANAGER (PRINCE2 / PMP, Infocomm Technology Sector)   $4K - $10K / 5 DAYS / BONUS", "company_name": "OakTree Consulting", "location": "Singapore (+1 other)", "via": "via JobsCentral", "description": "Benefits:\n\n-$4K - $10K\n\n-5 DAYS\n\n-BONUS\n\nResponsibilities:\n\n-Determine the requirements and scheduling of project resources to ensure that projects are delivered successfully\n\n-Management of assigned WAN projects and transitions complying to PMM\n\n-Communication to stakeholders and project reporting\n\n-Management of assigned T&T programmes and projects, plus provide regular updates to customers\n\n-Provide weekly/monthly project status reports to management\n\n-Manage change to project scope and schedule to maintain customer satisfaction\n\n-Ensure that customer projects are completed with high quality\n\n-Provide Project Completion Handover Documentation\n\n-Facilitate project handover meeting to Operations\n\nRequirements:\n\n-PMP / PRINCE2 Certification\n\n-With experiences in Infocomm Technology Industries\n\n-Good communication and interpersonal skills\n\nInterested candidates, please submit your resume in MS Word format to [Click Here to Email Your Resume]\n\nPlease provide following information in the... resume\n\n1) Reasons for leaving current and/or last employment\n\n2) Last drawn and/or current salary\n\n3) Expected salary\n\n4) Date of availability and/or Notice Period\n\nPerson-In-Charge: Jeffrey Chua Kay Hwee\n\nEmail: [Click Here to Email Your Resume]\n\nEA License No : 06C4642\n\nEA Reg No : R1110624\n\nAll applications will be treated in strictest confidence and only short-listed candidates will be notified", "extensions": ["18 hours ago", "$4K–$10K a month", "Full–time"], "detected_extensions": {"posted_at": "18 hours ago", "schedule_type": "Full–time", "salary": "$4K–$10K a month"}, "job_id": "eyJqb2JfdGl0bGUiOiJQUk9KRUNUIE1BTkFHRVIgKFBSSU5DRTIgLyBQTVAsIEluZm9jb21tIFRlY2hub2xvZ3kgU2VjdG9yKSAgICQ0SyAtICQxMEsgLyA1IERBWVMgLyBCT05VUyIsImNvbXBhbnlfbmFtZSI6Ik9ha1RyZWUgQ29uc3VsdGluZyIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiY3FVRlI0VVVXMjZQLWtOSUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzQ2VudHJhbCIsImxpbmsiOiJodHRwczovL2pvYnNjZW50cmFsLmNvbS5zZy9qb2IvcHJvamVjdC1tYW5hZ2VyLXByaW5jZTItcG1wLWluZm9jb21tLXRlY2hub2xvZ3ktc2VjdG9yLTRrLTEway01LWRheXMtYm9udXMtajN2N2d3NjIzbmttMXQwamczZz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "IT Project Manager", "company_name": "OCBC Bank", "location": "Singapore", "via": "via EFinancialCareers", "description": "IT Project Manager\n\nIT Project Manager\n\nAs part of the Project Office of Operations, the Project Manager holds the overall responsibility and accountability for IT project management for Operation related projects. He/she should work in partnership with operation users and common service teams to deliver projects to agreed scope, schedule, budget and quality.\n\n• Create project plans of scope, resource, budget, schedule and assign tasks\n\n• Identify, track and communicate project progress, milestones, deliverables changes and dependencies within the schedule, costs, issues and risks\n\n• Manage team's performance of project tasks, provide technical advice and guidance, schedule assignments and training for development, prepare performance appraisals\nCoordinate project activities across multiple development, product management\n\nQualifications\nDomain Knowledge:\n\n• Knowledge in Consumer/Corporate Banking product/service/process is essential\n\n• Experience in operation related projects in... payment and/or trade finance and/or treasury operation is necessary\n\n• Understanding of technical aspects of system integration in a mix technology environment.\n\n• Well versed with Agile methodology of delivery project\n\nQualifications/Experience\n\n• Tertiary education required\n\n• 8 years in project management in bank environment\n\n• PMP certified and Certified Scrum Master\n\n• Experience managing scrum projects and virtual scrum team is preferred\n\n• Self starting with excellent leadership and team building skills\n• Ability to independently manage concurrent projects, lead team to resolve complex problems\n• Ability to influence people to get job done, with whom he/she does not have reporting relationship\n• Good communication skills with senior stakeholders, users and peers", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJJVCBQcm9qZWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJPQ0JDIEJhbmsiLCJjb21wYW55X21pZCI6Ii9tLzA1NXIyNyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Im5fYWNxdlpfNE1qSE5LZ2pBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV1RUJDcUlCUVU1VlgwNXhVa2RUWTNKcFdFcFBhbU5VVVdGclVqWjRiV3RKYTBrM05rODBSV1Z2ZEhaaFMydFRObmh6Ym5SalVrbGpOa1pUWjFOUU1FMW1XV2MzUlZWWVVIaFVXV3hFVUU5WWRWWjFSRGwzYkRJM1ozcDVRM1E1YmpFMVZIbHZRMWxLYW10SmFtNHRUR1E0VEhwb2VHNXdXRlppZWpCSFducEVTMVJhZUZCb01WUk1jMHhxUm5SVmRuWXRhakJ6VFhnd1lrTnViV0pMZFc5TGNrSnZUV2QzRWhaS1NEWkRXVkJ1TFVsWmVVZDBVV0ZOYzJKTVowUlJHaUpCVDAxWlVuZENORGxaV21GaExUbDFjRFZxVlU1YWRWUjFSMVI2Y0Vvd2NqZFIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18zNCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBFRmluYW5jaWFsQ2FyZWVycyIsImxpbmsiOiJodHRwczovL3d3dy5lZmluYW5jaWFsY2FyZWVycy5zZy9qb2JzLVNpbmdhcG9yZS1TaW5nYXBvcmUtSVRfUHJvamVjdF9NYW5hZ2VyLmlkMTA3NzAyNzA/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Project Manager", "company_name": "None", "location": "Singapore", "via": "via Jobs", "description": "The Project Manager is accountable for the delivery of the project scopes / deliverables to the external customers of our client. He/she must work closely with our client's stakeholders to determine the requirements and scheduling of project resources to ensure that the projects are delivered successfully. Professional Services to be provided but not limited to the following: Management of assigned Wide Area Network (WAN) projects and transitions complying to Project Management Methodology (PMM) that covers Initiation, Define, Organize & Plan, Implement & Control and Handover & Closure. Management of assigned Transition and Transformation (T&T) programmes and projects Manage change to project scope and schedule to maintain customer satisfaction. Record risk and issue and timely escalation to relevant stakeholders for resolution. Communication to stakeholders and project reporting. Manage customer relationship during the projects through strong governance. Provide regular updates on... progress of the project to the customers. Provide weekly/monthly project status reports to management. Ensure that customer projects are completed with high quality and to the customer's satisfaction. Provide Project Completion Handover Documentation to customer. Facilitate project handover meeting to Operations. Requirements: Attained PMP Certification or PRINCE2 Certification At least 2 years of Project Management work experience, preferably in ICT Industries. Able to commit at least 6 months of contract Fluent in English", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJOb25lIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJxR2RTWXFXUTQtTUlDel9mQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnMiLCJsaW5rIjoiaHR0cHM6Ly9zZy5maWRhbnRvLmNvbS9qb2JzL2pvYi1vcGVuaW5nL2luZm9ybWF0aW9uLXRlY2hub2xvZ3ktcHJvamVjdC1tYW5hZ2Vycy9wcm9qZWN0LW1hbmFnZXItMjc3ODM2NDkyP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Senior Application Project Manager", "company_name": "NTT Ltd.", "location": "Singapore", "via": "via LinkedIn", "description": "In a constantly changing world, we work together with our people, clients and communities to enable them to fulfill their potential to do great things. We believe that by bringing everyone together, we can solve problems using innovative technology that can create a world that is sustainable and secure. At NTT, we encourage you to remain continuously curious, as that is what keeps you fast, flexible and relevant. No two days will be the same but that is what will help you grow and realize your full potential. The power is in your hands to do great things. It’s time to lead the change, be the authentic you, to solve difficult challenges, to set the pace of change and to unleash your potential. Want to be a part of our team?The Senior Client Project / Programme Manager leads and directs concurrent client projects classified as standard or complex. They may also be involved in larger scale programmes and responsible for delivery across domains, business areas, geographies and... technologies. The primary responsibility of the Senior Client Project / Programme Manager will be to interface with all project stakeholders to take projects from original concept through to final implementation, including handing over to Operations (whether internal to NTT or to the client's support operations). He / she may take responsibility for the management of projects and programmes within more complex / partnership accounts and collaborate and engage with senior members involved in programme delivery at the client site. In this instance the Senior Client Project / Programme Manager will lead the coordinated management of multiple related projects within a programme to achieve the business objectives and ensure the strategic benefits are transitioned to the client organisation. Radford information: Coordinates all aspects of a product or service offering project for a client, from inception to installation. Installations may involve acceptance of capitalized equipment or enterprise software systems, or system integration or consulting projects/engagements. May work at client site from time to time. Typically involves extensive interaction with sales, systems engineering, product development, and other members of cross-functional teams. Project is typically focused on the delivery of new or enhanced products to improvement of customer satisfaction through the use of technology. Project management skills, rather than technical skills, are key, but a strong technical background is often required to manage competing interests. Typically oversees schedules and budgets to ensure goal attainment. Survey Tip: This role is most common in a software or professional services organization in which the individual does not have responsibility over product development, but does have overall project management responsibility. This job manages specific projects that have a distinct beginning and end. Working at NTT Key Roles and Responsibilities: Lead and direct concurrent standard or complex projects and in the case of programme management, ensure the management of multiple related projects directed towards a common objective Engage with stakeholders to deliver projects from original concept through final implementation Ensure client satisfaction and manages escalations, acting as single point of contact to the client Ensure that the project / programme delivers as-sold solution, remains within the baselined budget and is delivered on time whilst maintaining quality criteria and client satisfaction Manage delivery of the project/programme, including rigorous scope control and change management Ensure client satisfaction and manages escalations, acting as single point of contact to the client Documentation and management of risks and issues Ensuring clear and concise communications to all stakeholders Provide pre-sales support by working with sales teams to scope and cost a project or programme solution which includes the completion of a proposal. This may include Client presentations of our delivery approach as part of a tender process. Identification of opportunities and influence the sale by conducting a business conversation with the client positioning NTT Ltd consulting and technical services offerings Coordinate activities of the project teams through task delegation, resource assignment and programme management Knowledge, Skills and Attributes: Ability to establish strong relationships with internal stakeholders and external clients Strategic thinking capability with an outcomes-focussed and results orientation Excellent client centricity skills Ability to manage customer satisfaction, commitment and expectations to high service levels and manage escalations adequately Ability to work on client sites for an extended period Excellent team building and skills Mentoring of junior members of the Project Services Community Excellent written and verbal communication skills Ability to work in high-pressure environments Ability to manage urgent and complex tasks simultaneously Excellent business acumen and commercial skills Passionate, strong initiative, self-driven with commitment to succeed Good influencing ability whilst taking a collaborative approach Detailed, meticulous and highly organised Proactive in approach with excellent facilitation skills Academic Qualifications and Certifications: Advanced Project Management degree or equivalent with significant related experience Relevant project management certifications preferably PMP ITIL certification is preferable Required Experience: Demonstrated project / programme management experience preferably in a multi-national Professional Services environment Proven client engagement experience Demonstrated understanding of the project/programme life cycle Demonstrated competency in project/programme change management Proven experience managing expectations when balancing alternatives against business and financial constraints What will make you a good fit for the role? Standard career level descriptor for job level:\n• Have wide-ranging experience\n• Uses professional concepts and company objectives to solve complex issues in creative ways\n• Networks with others outside own area of expertise\n• Exercises judgment in selecting methods, techniques and evaluation criteria to obtain results\n• May coordinate others’ activities\n• Typically requires significant related experience with a Bachelor’s or equivalent degree", "extensions": ["14 hours ago", "Full–time"], "detected_extensions": {"posted_at": "14 hours ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQXBwbGljYXRpb24gUHJvamVjdCBNYW5hZ2VyIiwiY29tcGFueV9uYW1lIjoiTlRUIEx0ZC4iLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjB1bktoOEQ1SzYtLTJDVXFBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGlua2VkSW4iLCJsaW5rIjoiaHR0cHM6Ly9zZy5saW5rZWRpbi5jb20vam9icy92aWV3L3Nlbmlvci1hcHBsaWNhdGlvbi1wcm9qZWN0LW1hbmFnZXItYXQtbnR0LWx0ZC0yNTE1NzUzMDQ1P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Assistant Manager (Dy Project Manager)", "company_name": "ST Engineering Mission Software & Services Pte Ltd", "location": "Singapore", "via": "via Singapore Job Mela", "description": "Responsibilities:Provide and implement solutions to projects and tendersDefine project scope and objectivesTrack project costs in order to meet budgetDevelop and manage detailed project schedule and work planManage contracts with vendors and suppliersCoordinate and guide team throughout all project management phasesManage communication with external and internal stakeholdersEnsure compliance with client requirements and business needsQualifications:Bachelor’s degree in computer science or equivalentMore than 2 years of project management and related experienceProject Management Professional (PMP) certification preferredSolid understanding of a variety of software programming tools and development platformsExperience seeing projects through full life cycleExcellent analytical and problem solving skillsStrong interpersonal skills and resourcefulGood client oriented communication skills", "extensions": ["8 hours ago", "Full–time"], "detected_extensions": {"posted_at": "8 hours ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBc3Npc3RhbnQgTWFuYWdlciAoRHkgUHJvamVjdCBNYW5hZ2VyKSIsImNvbXBhbnlfbmFtZSI6IlNUIEVuZ2luZWVyaW5nIE1pc3Npb24gU29mdHdhcmUgXHUwMDI2IFNlcnZpY2VzIFB0ZSBMdGQiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Ilg5RUZLN0xOQm9udG9iYkZBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gU2luZ2Fwb3JlIEpvYiBNZWxhIiwibGluayI6Imh0dHA6Ly93d3cuc2luZ2Fwb3Jlam9ibWVsYS5jb20vc2luZ2Fwb3JlLWpvYnMvYXNzaXN0YW50LW1hbmFnZXItZHktcHJvamVjdC1tYW5hZ2VyLTExMzMxOD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Project Director", "company_name": "JOBLINE RESOURCES PTE. LTD.", "location": "Singapore (+1 other)", "via": "via Learn4Good", "description": "Position: Project Director (Ref 24157)\nLocation: null\nRoles &\n\nResponsibilities\n\nResponsibilities:• Manage project managers in their delivery of services to the customers• Ensure that qualified resources are in place to meet project requirements• Establish responsive business relationship with customers• Engage customers on security solutions and posture discussion• Manage risk and impact of change requests• Manage the delivery team for preventive and timely system issue resolution• Manage budget and costs to ensure that project financials are healthy• Implement technology risk and control framework• Develop performance reports and communicate delivery status• Ensure that service is delivered with quality and in accordance to SLAs Requirement :•\n\nBachelor’s Degree in Information Technology• IT Project Management experience• Good understanding of cyber security concepts• Enterprise Network and Security Solutions deployment experience• Possessed excellent technical aptitude and a desire... to learn constantly• Excellent written, verbal and presentation skills• Enthusiastic, action oriented• Capable of independently solving technical problems•\n\nAble to communicate clearly and effectively to both technical and businessaudiences• Project Management Professional (PMP) certification• Certified Information Security Manager (CISM) or Certified Information Systems\n\nSecurity Professional (CISSP) Certification License No.: 12C6060\n\nTell employers what skills you have\n\nCISSPCloud Security\n\nCyber Security\n\nCyber-security\n\nLeadership\n\nNetwork Security\n\nProgram Management\n\nProject Management\n\nSecurity\n\nSecurity Audits\n\nSecurity Policy\n\nStrategic Planningmanage projectproject requirementschange requests\n\nRisk Mgmtresponsive\n\nSecurity solutionsdelivery of servicesengage customers", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IERpcmVjdG9yIiwiY29tcGFueV9uYW1lIjoiSk9CTElORSBSRVNPVVJDRVMgUFRFLiBMVEQuIiwiY29tcGFueV9taWQiOiIvZy8xMWdwMjY0N3BuIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiM1VWWE00T3U5SFpCNnBGYUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRW9zQ0Nzd0JRVTVWWDA1eFVsUlJhVXBvYTJFeGFYVnZNblU1YW5CeGNrbElZblJyWmw5MmNIVjRaVkExTTNaTlowaEhkRU53WVVVMmFrczVXVmhTV0cxR01XRkNaMUJ1YUZKTlkyZFdURU5YYms4MFJWWlJWVkk1VDBkRU1WRlFXR2RPVVdwUWFrcHpTRlJ0V0VJNVZUWTNRMkkxWlZsTGJtSmFlbnA0TjI1SmNFMDNhRTR3YUVoSWFYY3dVMFpaYjBFM09GWkJaM05OTlZkaU5FNHlSV3QwWkVVMWJUZEZRVzFpUm0xMk1FRmxhVk14VXpkdE9EbEpNRVJQWmxFeWVUVjNaR1ZGZFRoM1pXNXhhVU52VW5kd0VoWktTRFpEV1ZCdUxVbFplVWQwVVdGTmMySk1aMFJSR2lKQlQwMVpVbmRDU1ZSamNURjFTR3BxVTNSTldXaHBVM2gyZFhZNFJqRkxNM3BSIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNTMiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGVhcm40R29vZCIsImxpbmsiOiJodHRwczovL3d3dy5sZWFybjRnb29kLmNvbS9qb2JzL3NpbmdhcG9yZS9zZWN1cml0eS8yNzEzMDc1MTEvZS8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Management", "value": "GC18"}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Media, Communications and Writing", "value": "GC20"}, {"text": "Advertising and Marketing", "value": "GC03"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Transportation and Logistics", "value": "GC30"}, {"text": "Art, Fashion and Design", "value": "GC05"}, {"text": "Construction", "value": "GC09"}, {"text": "Education", "value": "GC11"}, {"text": "Human Resources", "value": "GC15"}, {"text": "Protective Services", "value": "GC23"}, {"text": "Property", "value": "GC24"}, {"text": "Science and Engineering", "value": "GC27"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "Project manager", "value": "project manager"}, {"text": "Program manager", "value": "program manager"}, {"text": "Manager", "value": "manager"}, {"text": "Project director", "value": "project director"}, {"text": "Delivery manager", "value": "delivery manager"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Senior", "value": "senior"}, {"text": "Consultant", "value": "consultant"}, {"text": "Coordinator", "value": "coordinator"}, {"text": "Deputy director", "value": "deputy director"}, {"text": "Director", "value": "director"}, {"text": "Group manager", "value": "group manager"}, {"text": "Operations", "value": "operations"}, {"text": "Scrum master", "value": "scrum master"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Services", "value": "services"}, {"text": "Vice president", "value": "vice president"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Engineering Services", "value": "/business/naics2007/5413"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Entertainment", "value": "/business/naics2007/71"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Management", "value": "/business/naics2007/55"}, {"text": "Real Estate", "value": "/business/naics2007/53"}, {"text": "Research", "value": "/business/naics2007/5417"}, {"text": "Retail", "value": "/business/naics2007/44"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": ".AB4Jjf.qPB6Vc{padding-right:11px}.qfpP8d{padding:7px 0 7px 11px}.S003Ke{flex:none}.ZoN4Lb{color:rgba(0,0,0,.54)}.nAXVG{color:#70757a}.IxQsL{color:rgba(0,0,0,.26)}.xFO1De{color:#fff}.ooFpK{color:rgba(255,255,255,.30)}.mtnwac{color:#4285f4}.WxeeKb{color:#34a853}.hIVRU{color:#f29900}.EXaTMc{color:#fbbc04}.sxn46d{color:#000}.gqMTF{color:#1a73e8}.zpn8Mb{color:#d93025}.dEUPmd{color:#1e8e3e}.PJNo1{color:#fbbc04}Actively Hiring", "value": "e"}, {"text": "Michael Page", "value": "/m/04cxldw"}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Nanyang Technological University", "value": "/m/0l49k"}, {"text": "Jobline Resources Pte Ltd", "value": "/g/11gp2647pn"}, {"text": "Randstad Singapore", "value": "/g/11g70b50mr"}, {"text": "GECO Asia", "value": "/g/11gk72_bt_"}, {"text": "Facebook", "value": "/m/0hmyfsv"}, {"text": "HP", "value": "/m/03mnk"}, {"text": "IoTalents", "value": "/g/11dxq187wm"}, {"text": "NCS Group", "value": "/m/0282746"}, {"text": "National University of Singapore", "value": "/m/01q460"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "OPTIMUM SOLUTIONS (SINGAPORE) PTE LTD", "value": "/g/11g70hkrbx"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Apple", "value": "/m/0k8z"}, {"text": "Avensys Consulting", "value": "/g/11g7022gjf"}, {"text": "BNP Paribas", "value": "/m/02qhk4"}, {"text": "Ceridian", "value": "/m/07f8h6"}, {"text": "Ensign InfoSecurity", "value": "/g/11g4jhymjr"}, {"text": "Humanica Asia Pte. Ltd", "value": "/g/11h1y98c9z"}, {"text": "Kerry Consulting", "value": "/g/11c73vtzc8"}, {"text": "Marsh and McLennan", "value": "/m/053rw"}, {"text": "NSEARCH GLOBAL", "value": "/g/11dxpksll4"}, {"text": "NTT", "value": "/m/05mybp8"}, {"text": "OakTree Consulting", "value": "/g/11g70jfhtq"}, {"text": "Salesforce", "value": "/m/07btr5"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "TEKsystems", "value": "/g/11b6g4bkv0"}, {"text": "Teradyne", "value": "/m/04bzqp"}, {"text": "Toshiba Tec Singapore Pte. Ltd", "value": "/g/11g9n9q547"}, {"text": "Trustwave", "value": "/m/0n3xjf5"}, {"text": "Wood Plc", "value": "/m/07vv9s"}, {"text": "Workiva", "value": "/m/0113m1rd"}, {"text": "A-it Software Services Pte Ltd", "value": "/g/11dxpy_gl_"}, {"text": "ABS Group", "value": "/g/11dxplj1z6"}, {"text": "ACI HR Solutions Ltd", "value": "/g/11c73ryh3p"}, {"text": "AIA", "value": "/m/02r5cgx"}]}]}