{"search_metadata": {"id": "60827abbdc02f13fc87d6cb2", "status": "Success", "json_endpoint": "https://serpapi.com/searches/b1f32643ef272801/60827abbdc02f13fc87d6cb2.json", "created_at": "2021-04-23 07:43:55 UTC", "processed_at": "2021-04-23 07:43:55 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28project+manager%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=140", "raw_html_file": "https://serpapi.com/searches/b1f32643ef272801/60827abbdc02f13fc87d6cb2.html", "total_time_taken": 1.12}, "search_parameters": {"q": "(project manager) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "140"}, "jobs_results": [{"title": "Project Manager (ID)", "company_name": "EXPONENT PTE. LTD.", "location": "Singapore (+1 other)", "via": "via Joblum Singapore", "description": "Project Manager who will work closely with clients on confirmed projects and will be responsible for assigning and managing the projects starting from the initial design conception, through construction, to completion and handing over to clients. The goal is to manage projects, from budget, timeline, quality to clients’ satisfaction.\n\nJob Responsibilities\n• Meet potential clients with Business Development Managers to enquire and understand clients’ needs\n• Co-ordinate layout plan, design plan and visuals, sketch, 3D-dawings, product specifications etc prepare project schedule and quotations to clients and submit tenders for the project to clients.\n• Preparation of contracts, negotiation of revisions/amendments, changes and additions to contractual agreements with architects, consultants, clients, suppliers and subcontractors.\n• Arrange submission of plans to local authorities for approval and arrange inspections of building work\n• Prepare costing report for management’s approval and... manage budget accordingly\n• Work closely with project and operation teams and contractors to ensure timely delivery of the project and excellent quality of work done\n• Being the key single interface between the company and clients, obtain client's feedback and resolve project related issues such as payments, etc.\n\nJob Requirements\n• Diploma/Degree in Interior Design, Architecture, Project Management, Construction Management or equivalent\n• Candidate must possess minimum 8 years’ experience in corporate office design and build project management. Those with PMP Certification have an added advantage.\n• Able to interpret architectural plans and familiar with building and safety regulations\n• Experience in leading and managing multiple projects within tight timelines\n• Excellent project, presentation, leadership and people management skills\n• Highly self-motivated, positive working attitude with a high level of professionalism and integrity\n• Good communication & interpersonal skills\n• Fluent in both spoken and written English (in order to handle feedbacks and issues from English & Mandarin speaking associates", "extensions": ["10 days ago", "$4K–$5.5K a month", "Full–time"], "detected_extensions": {"posted_at": "10 days ago", "schedule_type": "Full–time", "salary": "$4K–$5.5K a month"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIgKElEKSIsImNvbXBhbnlfbmFtZSI6IkVYUE9ORU5UIFBURS4gTFRELiIsImNvbXBhbnlfbWlkIjoiL2cvMTFnNzBmbjA3XyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjRfNURpVmNTZUh6QUVyT3RBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2WUJDcmNCUVU1VlgwNXhVekJKUlRKM1ZFMWtNVWxFZGtSdGVGOXViVE4wU1d0alMxQnhWV2c1WDJwaVZqWnNVSGRmYWtKamFVRlFlbWhoZFdaUlYxOVhRMGRJVVU5U1ZYVmlPVmRyVVRkTlFtZENaVE5SWjBsRFZERjNOMk14T0ZJMFZraEhXamRUYlhKWE0wRkJhamhvYlMxQmJrcEdSa2xEUm5Sb1ZFMURkVXB3WDJsSWNHOTFlVWhXVjIxQ1ltRnNXRTl5U0ZwYWJuQjNNakpEWlZoSFYybDVNbWRDU0VsQ2VtOHhkbHBMUjBwTlZWQm5kMHRVVFRoWkVoWjJTSEZEV1UwelRrSnpSMU4wUVdFd2REWmZaMEpSR2lKQlQwMVpVbmREWWw5V1ZUVjBkbEJFUW1aS0xYRTNhbGRWT1hSeVRWSndZMDUzIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JsdW0gU2luZ2Fwb3JlIiwibGluayI6Imh0dHBzOi8vc2cuam9ibHVtLmNvbS9qb2IvcHJvamVjdC1tYW5hZ2VyLWlkLzYxMjc1MT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Project Manager", "company_name": "EUROSTOP SINGAPORE PRIVATE LIMITED", "location": "Singapore (+1 other)", "via": "via MNC Jobs Singapore | MNC Jobs In Singapore", "description": "Responsibilities :\n• Ensure that all projects are delivered on-time, within scope and within budget\n• Conduct project kick-off and project progress meeting\n• Conduct business requirement scoping session and business function documentation\n• Understand customer requirements and provide solutions\n• Involve and conduct system demo with sales team\n• Lead and manage Project team\n• Conduct system training for customers and team member\n• Perform risk management to minimize project risks\n• Prepare project plan and manage project activities\n• Create and maintain comprehensive project documentation\n• Project roll out support\n\nRequirements/Skills :\n• Diploma/Degree in Computer Science or related project management and business analyst related field\n• .Min 5 years of project management or business analyst working experience in retail software industry\n• Excellent written and verbal communication skills\n• The candidate must possess interpersonal skills, highly numerate and commercially aware with... strong business, organizational, planning and analytical skills\n• Good communication, team working skills and ability to motivate people with management and leadership skills would be an advantage\n• Solid organizational skills including attention to detail and multi-tasking skills\n• Strong working knowledge of Microsoft Office, Project Plan, PowerPoint, PMP certification is a plus\n\nminimumYearsExperience : 6\n\n[CANDIDATES WHO REQUIRE WORK PASSES NEED NOT APPLY", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJFVVJPU1RPUCBTSU5HQVBPUkUgUFJJVkFURSBMSU1JVEVEIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJpR3dVS0RGWmU2cWlUZnZTQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1OQyBKb2JzIFNpbmdhcG9yZSB8IE1OQyBKb2JzIEluIFNpbmdhcG9yZSIsImxpbmsiOiJodHRwczovL3NnLm1uY2pvYnouY29tL2pvYnMvcHJvamVjdC1tYW5hZ2VyLXViaS0yMjAxOTU/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Gic L&k Program Manager (strategic Education)", "company_name": "Techgig", "location": "Singapore", "via": "via Mendeley", "description": "About Job\n\nCTC Undisclosed Job Location Singapore Experience 0 - 3 yrs\n\nDescription\n\nMax Salary:\nIntroduction\nAt IBM, work is more than a job - it's a calling: To build. To design. To code. To consult. To think along with clients and sell. To make markets. To invent. To collaborate. Not just to do something better, but to attempt things you've never thought possible. Are you ready to lead in this new era of technology and solve some of the world's most challenging problems? If so, lets talk.\n\nYour Role and Responsibilities\nAs part of the GIC Learning & Knowledge shared services team, this profile will be directly working under the GIC Learning & Knowledge leader and liaise across learning domains and centers to project manage strategic education deployments, manage key activities, and help coordinate and support the GIC Learning & Knowledge leader.\nYou will ensure the smooth running of the end-to-end program through working flexibly across the following areas: Project management... support; including change management, risk and issue management, reporting, status tracking, and project reporting.\nCreate program strategies covering Communication, Deployment, Governance and Reporting.\nStakeholder management and reporting to them on the progress of the key programs.\nMaintaining and supporting the GIC L&K Leader with the recurring cadence and on critical follows up from it.\nProvision of standard documents and tools\n\nKey Responsibilities\nYou will be responsible for: Work as Project lead for key strategic projects and deployments across the globe.\nReviewing and challenging reports provided for adherence to standards, completeness, and reasonableness.\nManaging the initiative governance structure, assisting in the preparation and co-ordination of materials\nLead key meetings such as the Review meetings, Steering Committee/Forums and working group meetings.\nWorking to create and track Programme Tasks/ Budget including management and Reporting against the signed off Project plan.\nAssisting in the development and management of a communication strategy, preparing status reporting, providing visibility on status and transparency of risks and issues for multiple levels of stakeholders\nMaintaining and actively managing the initiative stakeholder map and communications plan\n\nQualifications and Skills Requirements Experienced PMO with a demonstrable track record working on strategic/complex initiatives with cross functional delivery impact.\nDeep Expertise in Learning & Knowledge functions in a Global organization.\nExperience and Knowledge of Deploying large skilling programs across complex organisational structure.\nExperience in Current Technologies, programming, and platforms (Cloud, AI, Software Engineering)\nExperience in building data models and corresponding Data Analysis and visualization.\nExperience in Executive stakeholder management, presentation, and communication\nIn-depth Knowledge of Project Office and Project Management function\nExcellent communication, interpersonal and stakeholder management skills with the ability to work with and present to senior stakeholders.\nExperience of delivering large scale transformation programs (preferably in Change management/ Talent transformation areas but not mandatory)\nExperience of working with Technology to deliver complex projects.\nAbility to execute quickly and effectively strong influencing skills and ability to get things done in a complex matrix organizational structure.\nShould have carried out Process improvement initiatives for a function/program to bring about simplification in managing operations, automation of tasks.\nShould have carried out client stakeholder management with direct interfacing.\nShould be a keen learner, proactive, enthusiastic, takes accountability, have demonstrated capability to be a differentiator in challenging environment.\nPMP Certified (Required), Any other technical certifications (Preferred).\n\nKey Supporting Competencies Command Skills - Relishes leading; takes unpopular stands if necessary; encourages direct and tough debate but is not afraid to end it and move on; is looked to for direction in a crisis; faces adversity head on; energized by tough challenges.\nOrganizational Agility - Knowledgeable about how organizations work; knows how to get things done both through formal channels and the in formal network; understands the origin and reasoning behind key policies, practices, and procedures; understands the cultures of organizations.\n\nBusiness Acumen - Knows how businesses work; knowledgeable in current and possible future policies, practices, trends, technology, and information affecting his/her business and organization; knows the competition; is aware of how strategies and tactics work in the marketplace.\nDealing with Ambiguity - Can effectively cope with change; can shift gears comfortably; can decide and act without having the total picture; is not upset when things are up in the air; does not have to finish things before moving on; can comfortably handle risk and uncertainty.\nProcess Management - Good at figuring out the processes necessary to get things done; knows how to organize people and activities; understands how to separate and combine tasks into efficient workflow; knows what to measure and how to measure it; can see opportunities for synergy and integration where others cannot; can simplify complex processes; gets more out of fewer resources.\n\nRequired Technical and Professional Expertise\nAs above\n\nPreferred Technical and Professional Expertise\nAs above", "extensions": ["5 days ago", "Full–time"], "detected_extensions": {"posted_at": "5 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJHaWMgTFx1MDAyNmsgUHJvZ3JhbSBNYW5hZ2VyIChzdHJhdGVnaWMgRWR1Y2F0aW9uKSIsImNvbXBhbnlfbmFtZSI6IlRlY2hnaWciLCJjb21wYW55X21pZCI6Ii9nLzExYzczZnhnd3QiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJCeXptTndjR1c1VWpVSC1qQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VkUxR1dHeGFOMjl5Y0Y5TFJYbExWMDVDUmpCd1ZtZDJMV1ZKU2w4M1VYRkRiM0J1ZUZjNU5XUjFUMDVDYVhsRFQweHFVSEJDU0Y5blpUUXpObWt0VGxGbmJuZGlORVZ1Y2toa2JUTnVVa05hY25oWFlucDRXV2hLZVhKcVMyZGtRbVJFWVVVNFlVaFRTVlZXTUVoVmFuTnpVR2R1Vldoek1ubExNMFpCUldGbU5EWkdSMHhSWVZsTU5UVTBPRzFvVm05WWFEaDNlV2xLVW1wbkVoWjJTSEZEV1UwelRrSnpSMU4wUVdFd2REWmZaMEpSR2lKQlQwMVpVbmRFZVVkbFRYUndaa3hJV1RKdFFuUkhXVTF1YTNWVVRHSnlSbTlCIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMTkiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTWVuZGVsZXkiLCJsaW5rIjoiaHR0cHM6Ly93d3cubWVuZGVsZXkuY29tL2NhcmVlcnMvam9iL2dpYy1say1wcm9ncmFtLW1hbmFnZXItc3RyYXRlZ2ljLWVkdWNhdGlvbi0yNjc0ODQwP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Project Manager (Data Analytics)", "company_name": "Sciente Inc", "location": "Singapore", "via": "via SCIENTE", "description": "An excellent job opportunity that utilize your Project Management expertise and experience in Data Analytics.\n\nMandatory Skill(s)\n• Degree in Computer Science, Engineering or Information Systems;\n• Has at least 8 years of Project Management experience, with proven track record of project implementation and managing project teams within financial services industry;\n• Prior experience in development;\n• Good business knowledge in corporate banking and data projects;\n• Well exposed to Data Analytic, Data Warehouse and Business Intelligence best practices, concepts and data architecture to support analytic and operational reporting and information delivery;\n• Good understanding of key analytics platforms (Qlikview, PowerBI or Tableau);\n• Has strong leadership abilities and interpersonal skills;\n• Familiar with project budgeting, project financials / projections, monitoring of project costing and regular project reporting;\n• Focus in meeting time lines, firm hold of project budget, ensuring... that internal/external work together to achieve the objectives of the project;\n• Excellent communication skills and emotional intelligence to influence key decisions, mediate conflicts and build consensus.\n\nDesirable Skill(s)\n• Agile and PMP certification;\n• Experience with cloud computing.\n\nResponsibilities\n• Responsible for end to end implementation of data initiative projects across the region;\n• Engage in project conceptualization, defining project scope and providing business solutions;\n• Work with business team to identify KPIs and visualizations required in delivery the business solutions;\n• Document regular project meetings, and provide regular status monitoring on all project activities;\n• Participate in system integration testing and user acceptance testing and support project documentations;\n• Highlight potential risks, gaps, technical challenges to the team and provide mitigations / alternatives;\n• Establish best practices for coding standards and code review process;\n• Manage the scope change process with identification of risks and issues, and facilitate resolution, mitigation and prioritization;\n• Liaise with stakeholders, providing regular project status update", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIgKERhdGEgQW5hbHl0aWNzKSIsImNvbXBhbnlfbmFtZSI6IlNjaWVudGUgSW5jIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJ2YUI0aGFiaER5c1ViMWhfQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFNDSUVOVEUiLCJsaW5rIjoiaHR0cHM6Ly93d3cuc2NpZW50ZS5jb20vc2NpZW50ZS1pbmMvdGVjaG5vbG9neS1qb2JzLzUzMTkvcHJvamVjdC1tYW5hZ2VyLShkYXRhLWFuYWx5dGljcykvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Project Manager - Healthcare Domain (Immediate Notice) - Contract  12 months", "company_name": "None", "location": "Singapore", "via": "via Jobs", "description": "This is a 12 months contract assigned to our client Max Salary : $10,000 Notice Period : Immediate /Short Notice Period Job Description IT Project Manager with previous experience in delivering mid to large-scale IT projects. You will bring strong expertise in managing stakeholders, external vendors, internal teams with proven capabilities of delivering project objectives in an ambiguous environment. • Define, plan, and direct the execution of a broad range of projects while balancing the competing demands of scope, time, cost, quality, resources and risk to produce high IT solutions • Identify, acquire, and lead multifunctional, global project teams • Ensure project objectives/requirements are clear and agreed to by all stakeholders • Manage relationships with various IT and business stakeholders to achieve project objectives • Facilitate project management activities across the entire project management methodology • Ensure successful and timely completion of deliverables • Track... progress against baseline schedule • Plan, baseline and control costs to ensure projects are completed within approved budget • Manage project priorities and ensure adherence to the agreed scope • Monitor, document and gain approval for changes to schedule, cost or project scope • Identify and apply systematic quality activities to ensure that projects employ all processes needed to meet Computer System Validation directives • Conduct risk and issue management planning, identification, analysis and monitoring on projects • Formulate risk and issue mitigation strategies; recommend and implement solutions • Ensure delivery of project in compliance with CSV and PMM guidelines • Must effectively manage the projects across global locations and different time zones Requirements: • 3-7 years of related experience. Experience working in Healthcare industry is a highly desirable • Prior experience implementing IT Projects across a variety of platforms • Experience in project organization and resource mobilization, and management of stakeholders • Strong understanding of Project Management Methodology concepts, including waterfall (PMP certification preferred) and agile practitioner knowledge (SCRUM / SAFe preferred) • Strong understanding of Computer System Validation (CSV) concepts • Familiarity with HP ALM or other Application Lifecycle Management tool preferred • Familiarity with global rollouts/releases preferred • Experience dealing with stakeholder management issues on a global level (including multiple cultures) • Strong interactive and influencing skills • Strong customer and service management focus • Excellent communication, organization and multi-tasking skills • Experience in leading virtual teams • Strong technical writing skills (project documentation/deliverables) • Understanding of Electronic Document Management System concepts • Understanding of IT Infrastructure concepts This is a 12 months contract assigned to our client Max Salary : $10,000 Notice Period : Immediate /Short Notice Period Job Description IT Project Manager with previous experience in delivering Skills: Healthcare, Healthcare Information Technology, Healthcare It, Information Technology, Plan, Environment, It Projects Experience: 7.00-10.00 Years", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIgLSBIZWFsdGhjYXJlIERvbWFpbiAoSW1tZWRpYXRlIE5vdGljZSkgLSBDb250cmFjdCAgMTIgbW9udGhzIiwiY29tcGFueV9uYW1lIjoiTm9uZSIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoieE5ESFVOSUtuNlZoR2FJN0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIiwibGluayI6Imh0dHBzOi8vc2cuZmlkYW50by5jb20vam9icy9qb2Itb3BlbmluZy9pbmZvcm1hdGlvbi10ZWNobm9sb2d5LXByb2plY3QtbWFuYWdlcnMvcHJvamVjdC1tYW5hZ2VyLWhlYWx0aGNhcmUtZG9tYWluLWltbWVkaWF0ZS1ub3RpY2UtY29udHJhY3QtMTItbW9udGhzLTI3ODUxOTg1ND91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "IT Project Manager- Application", "company_name": "Michael Page", "location": "Singapore (+1 other)", "via": "via Michael Page Singapore", "description": "About Our Client\n\nOur client is a leading organisation within the technology space. With the growing business needs and demand they are looking to hire an IT Project Manager-Application.\n\nJob Description\n\nAs a IT Project Manager-Application, you will be responsible for the following:\n• Identifying, planning, organising and defining time-line for the projects and providing support post implementation.\n• Working with the developers to deliver solutions on time and working with clients on project feasibility and budgets.\n• Gathering requirements from the clients and translating them into solutions as per the needs.\n• Tracking and reporting project performance from time to time.\n• Sharing reviews and feedback with the clients on the projects and mentoring the team internally.\n• Managing the project budget, delivery and making sure time-lines are being followed.\n• Providing solutions and making sure overall productivity is enhanced.\n\nThe Successful Applicant\n\nAs a successful consultant you... should have a Bachelor's degree in computer science or equivalent with at least 8 years of experience in IT project management within the application space. You will also have experience in working within the software development with managing large scale projects. You will also have experience in managing budgets and resources . PMP or CITPM certification will be an added advantage.\n\nWhat's on Offer\n• Great Working Environment\n• Newly Created Role", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJJVCBQcm9qZWN0IE1hbmFnZXItIEFwcGxpY2F0aW9uIiwiY29tcGFueV9uYW1lIjoiTWljaGFlbCBQYWdlIiwiY29tcGFueV9taWQiOiIvbS8wNGN4bGR3IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiZ3Baa0I2alc0T0xHTzNCTkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFVraHJaSE5LZERFeE1IRjZlWHB1TjFCUGIwVnpUVlJQVGxWMVZHaExSbGd3V1RacFdEZElTMVZEVDBwSmVYQjRkRU5KV1d0WmFtYzNVbnBJTkVKdmFrcFlVR3B1WlVSNGQwNWxPVVYxUkRsRGVHaGhZMjFsTVRZdFduaFNabnA0T0c4NVNGVklXRk41ZDBkamVXUlRUbmxITW5oeGJGTmhOMDVPWlRaVExXaG1SbGxxVHprMFR5MWhlRzFyVlZsaVdYWndWVmhoV0VKV1lsZG5FaFoyU0hGRFdVMHpUa0p6UjFOMFFXRXdkRFpmWjBKUkdpSkJUMDFaVW5kQ04ycEZkRVpNUVV0V1kwVm9YM2xxV2kxaVNXbGplR0p1VjJkbiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzM1IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1pY2hhZWwgUGFnZSBTaW5nYXBvcmUiLCJsaW5rIjoiaHR0cHM6Ly93d3cubWljaGFlbHBhZ2UuY29tLnNnL2pvYi1kZXRhaWwvaXQtcHJvamVjdC1tYW5hZ2VyLWphdmFuZXQvcmVmLzQxNDQ2NzY/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "IT PROJECT MANAGER", "company_name": "Terra Systems Pte. Ltd.", "location": "Singapore (+1 other)", "via": "via Monster", "description": "PROJECT MANAGER\n\nJob Description & Requirements\n\nMust have PMP, CITPM Certification\n\n1. At least 2 years working experience in IT/PM, fluent in both Chinese\n\nand English\n\n2: Be responsible for coordinating customer, arranging work in an\n\norderly manner, managing IDC site engineers in a unified way and\n\ncontrolling site construction progress and quality.\n\n3: Be responsible for IDC work order management, and be responsible\n\nfor the timeliness and quality of work orders.\n\n4: Responsible for IDC asset management, inventory, and statistics\n\n5: Be responsible for assisting customer to coordinate the on-site\n\nconstruction of the computer room and the operator, and control the\n\non-site construction progress and quality\n\n6: Be responsible for the unified management of all documents\n\ngenerated by the project and daily operation and maintenance\n\naccording to customer's requirements\n\n7: Submit monthly service report on a monthly basis\n\n8: Propose service improvement plans regularly on a quarterly... basis\n\n9: Summarize the work of the resident personnel on a regular basis on\n\na monthly basis\n\n10: Carry out quarterly inspection on the equipment, construction\n\nquality and computer room environment of each point", "extensions": ["15 days ago", "Full–time"], "detected_extensions": {"posted_at": "15 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJJVCBQUk9KRUNUIE1BTkFHRVIiLCJjb21wYW55X25hbWUiOiJUZXJyYSBTeXN0ZW1zIFB0ZS4gTHRkLiIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiTk9rOERUSk9PMVlRWHB1bUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNb25zdGVyIiwibGluayI6Imh0dHBzOi8vd3d3Lm1vbnN0ZXIuY29tLnNnL2pvYi9pdC1wcm9qZWN0LW1hbmFnZXItdGVycmEtc3lzdGVtcy1wdGUtbHRkLXNpbmdhcG9yZS0yOTQ5NjQ4P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Technical Program Manager, APAC Infrastructure at Facebook", "company_name": "Facebook", "location": "Singapore", "via": "via BizLINKS Resources Pte Ltd", "description": "Technical Program Manager, APAC Infrastructure at Facebook\n\nJob Description\n\nFacebook's mission is to give people the power to build community and bring the world closer together. Through our family of apps and services, we're building a different kind of company that connects billions of people around the world, gives them ways to share what matters most to them, and helps bring people closer together. Whether we're creating new products or helping a small business expand its reach, people at Facebook are builders at heart. Our global teams are constantly iterating, solving problems, and working together to empower people around the world to build community and connect in meaningful ways. Together, we can help people build stronger communities - we're just getting started. Facebook is seeking a Technical Program Manager (TPM) with large-scale network infrastructure experience. This person will be involved in evolving and enhancing the global network that supports all Facebook... products and services. They will manage programs and solve some of the most challenging networking problems in the industry, drive innovative, creative and ground-breaking solutions, and utilize automation to scale. This person will partner closely with engineering and other cross-functional teams to understand the problem space and domain in depth, create roadmaps, prioritize based on impact and drive them through to completion.This person will report to the Group Technical Program Manager. Responsibilities Uses project management expertise, technical expertise and company objectives to resolve complex issues in creative and effective ways. Drive and manage multiple programs covering a range of areas (PoP, datacenter network & backbone networks, subsea cable networks) with a team of cross functional partners towards predictable execution without supervision. Provide hands on program management during analysis, design, development, testing, implementation, and post implementation phases. Identifies dependencies and gaps, unblocks issues and drives consensus amongst teams. Builds productive working relationships, and increasing level of trust, with engineers, stakeholders, and management inside and outside program areas. Continuously assess and review processes and seek to scale through better engineering & automation across multiple teams and functions. Drive regional and global program strategies and initiatives. Perform risk management and change management on projects. Define and track key metrics and key quality and performance indicators. Develop and own communication plans and to proactively communicate to stakeholders. Ensure consistency across projects, regions globally and alignment with other TPMs Ensure lessons learnt are captured comprehensively, acted on and communicated out for each project. Ability to mentor and grow others Minimum Qualification B.S. in a technical discipline or equivalent experience. 8+ years in telecom and/or data network infrastructure space, focusing on engineering, design and delivery. Experience managing and driving large scale programs of high complexity (related to data networks and/or telecom networks) from inception to delivery. Experience operating autonomously across multiple teams, demonstrated critical thinking, and thought leadership. Experience working with technical management teams to develop systems, solutions, and products. Experience establishing work relationships across multi-disciplinary teams and multiple partners in different time zones. Preferred Qualification PMP Certification (PMI) and experience with project management tools would be an advantage. Show more\n\nOriginal Joblink : https://sg.linkedin.com/jobs/view/technical-program-manager-apac-infrastructure-at-facebook-2401578929\n\nGoogle Company: https://www.google.com/search?q=Technical%20Program%20Manager,%20APAC%20Infrastructure%20at%20Facebook", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJUZWNobmljYWwgUHJvZ3JhbSBNYW5hZ2VyLCBBUEFDIEluZnJhc3RydWN0dXJlIGF0IEZhY2Vib29rIiwiY29tcGFueV9uYW1lIjoiRmFjZWJvb2siLCJjb21wYW55X21pZCI6Ii9tLzBobXlmc3YiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiI5U0ttMTltQWNWOE45cUIzQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VWpkZlNWRlhOalo2ZEVKVU0wZGxlblZrVHpCYWVtVlNNazVNWW5WUmNHSlVaVGd3UzJoUFkySjBRazVET1c4MVNGZHlaM05RVVZkeFZUSkJhekpCU2xBellqSTRiaTFsVEZsbE4yeHRUa0V4TlRZMWVuRTNXRmhRVFZKVVdFeHdYMmhuU1RWV1RFczJVMGhWWDNZNWNEUkhkak16Ukd4eVZVRmZOWEZxYlZseU1Fb3hObDl0VGxGSlFtSklaSGRMZVd4amNsZ3pOV3hTVGpGUkVoWjJTSEZEV1UwelRrSnpSMU4wUVdFd2REWmZaMEpSR2lKQlQwMVpVbmRDVVd0d1RsY3lWbnBxT0Zwd1dFdHZXRkJmYUhWb2NtWkNjVlJSIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNDUiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQml6TElOS1MgUmVzb3VyY2VzIFB0ZSBMdGQiLCJsaW5rIjoiaHR0cHM6Ly93d3cuYml6bGlua3NyZXNvdXJjZXMuY29tLnNnL2luZGV4LnBocC9qb2ItbGlzdGluZ3MtcHVibGljLzkwLXByb2plY3QtbWFuYWdlci81NjY1LXRlY2huaWNhbC1wcm9ncmFtLW1hbmFnZXItYXBhYy1pbmZyYXN0cnVjdHVyZS1hdC1mYWNlYm9vaz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Infrastructure Project Manager, Cloud and Security", "company_name": "Randstad Singapore", "location": "Singapore", "via": "via Randstad Singapore", "description": "• Concrete project timeline\n• Exposure to wide range of technology\n\nAbout the company\n\nOur Client is a market leader within their industry. They have a well-established presence of more than 20 years. With rapid expansion plan, they are now looking for an IT Infrastructure Project Manager (Data centre, System and Networks) – APAC to roll their key infra projects\n\nAbout the job\n\nReporting to the Head of Infrastructure, your role involves:\n• Leading infrastructure projects (Cloud, Cyber Security, Networks, System). This includes milestone planning, budgetting and risk management across Asia\n• Guiding the project delivery teams throughout the lifecycle to provide continuity of technical governance from inception through design, build, test, piloting, migration and implementation.\n• Supporting the demand process in solution assessment and selection, overseeing the design process for approved projects while supporting the implementation process by driving consistency and standards into the... new or enhanced applications.\n• Establishing service level management practices to ensure that the level of service from internal and external service providers are defined. This includes managing IT Incident, Problem, and change management processes\n• Ensuring the infrastructure continuous improvement plans are supported by latest technologies and subjected to security compliance/governance. This includes managing budget/resources, ensuring that appropriate resources are assigned to key project initiatives.\n\nSkills and experience required\n\nAs a successful applicant, you will have at least 7 years of experience in Infrastructure (Server/Systems, networks/LAN/WAN) project management. Exposure to cloud / AWS / Azure or Cyber Security is required for this role. You will have led at least 2 end to end infra projects regionally/globally.\n\nCandidate with PMP or Prince2 certification will be highly preferred. Proven track record of working in end user will be of added advantage.\n\nWhats on offer\n\nThis is an excellent opportunity to join a leading end user environment with concrete project timelines. You will get the opportunity to lead high value projects with exposure to latest technology.\n\nTo apply online please use the 'apply' function, alternatively you can reach me at https://www.linkedin.com/in/hoonteck-nologyrecruitment or 6510 3633. (EA: 94C3609/ R1219669)\n\nskills\ninfra, cloud, security, pmp. project management\n\nqualification\nno additional qualifications required\n\nworking hours\nFull-Time\n\neducational requirements\nAssociate Degree/Diploma", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJJbmZyYXN0cnVjdHVyZSBQcm9qZWN0IE1hbmFnZXIsIENsb3VkIGFuZCBTZWN1cml0eSIsImNvbXBhbnlfbmFtZSI6IlJhbmRzdGFkIFNpbmdhcG9yZSIsImNvbXBhbnlfbWlkIjoiL2cvMTFnNzBiNTBtciIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6InE3YVkxTVpCdjdZMi1qdGlBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2WUJDcmNCUVU1VlgwNXhVbEo0VEVkaVZTMWFSRUZLZUdGTFVrMVZiMGhIVVhJMmJrbExkMHRuWWpKamJrSlNhRGR1Y0RRMmRFTkZNRTVGV0U5b2FGVlhNSGgxVjNaWmVqTjJPRzU1VTBSU01YWnZNazl2Vm5aZlVUaHdjMDVGVWpOdVUyWkRZamROZVY5MVdHVmFaVEI2V21KWFFXODFSM2RLY0dscVZYRktTbUo0WjFCa2RWRjRSak5EUzA5dFZsQnFiVFZWY0hVMlJsUkZRblpxWm01NFQweFBibGMyVGxSdUxXYzRSMjVITUZGNlJqQnVWRU56T0RGRkVoWjJTSEZEV1UwelRrSnpSMU4wUVdFd2REWmZaMEpSR2lKQlQwMVpVbmREZUVnelRXUjBjMDVLZUhFM2IxVjNja1ZtY2xwdFJsQlFRVE5uIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNTIiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gUmFuZHN0YWQgU2luZ2Fwb3JlIiwibGluayI6Imh0dHBzOi8vd3d3LnJhbmRzdGFkLmNvbS5zZy9qb2JzL2luZnJhc3RydWN0dXJlLXByb2plY3QtbWFuYWdlci1jbG91ZC1hbmQtc2VjdXJpdHlfc2luZ2Fwb3JlXzM2NDkxNDIxLz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Project Manager (BB-6BD1F)", "company_name": "Emerson Holdings", "location": "Singapore", "via": "via BeBee", "description": "The position of Project Manager calls for a candidate with at least +10years of experience in Project Management, preferrable in the field of Oil & Gas / Mining / Energy. Job Responsibilities:Manages multiple Measurement Systems Project (within Asia Pacific - Fiscal Metering & Analytical Systems) to meet customers specification, project schedule, financial goals and quality standards.Manages the communication & expectation of the various stakeholders in the Project. Works with various stakeholders; Vendors, Colleagues, Factories etc to deliver on the project requirement Accountable for the various reporting requirements (both internal & external) wrt Project ExecutionAccountable towards the project for its entire lifecycle; from Pursuit handover to Service / Site handover. Additional Information:Intermittent travel (regional) based on the requirements of the project, to attend meetings etc with the various stakeholder. Local travelling from home office to vendor premises... manufacturing / fabrication location, expediting visits will be required. Job Requirements:Degree in Instrumentation, Electrical, Electronics, Chemical, Process, Mechanical, Control or Computer Engineering.Minimum of 10-15 years’ experience in process control industry and project management, with at least 5 years in managing of concurrent system projects – Project Management experience on Custody Transfer metering or Blending & Transfer Projects is preferred.PMP Certification is essential.Good knowledge of Oil & Gas Industry equipment, Instruments, Piping and structural work.Familiarity in application of various types of meters for gas & liquids measurement, good working knowledge of ASME, ANSI, API, API MPMS, ISO & other industry standards related to Oil and Gas measurement services.Solid people management skills with excellent communication and interpersonal skills at all levels.Strong leadership, organizational and planning skills.Knowledge of commercial and financial issues.Excellent analytical skills and results-oriented.Decisive, drive and ability to deliver effective, innovative solutions.Proven skills in the use of project tools (such as MS Project) and techniques", "extensions": ["20 hours ago", "Full–time"], "detected_extensions": {"posted_at": "20 hours ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IE1hbmFnZXIgKEJCLTZCRDFGKSIsImNvbXBhbnlfbmFtZSI6IkVtZXJzb24gSG9sZGluZ3MiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjlZaU93anVTd2NIMTg3SzlBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQmVCZWUiLCJsaW5rIjoiaHR0cHM6Ly9zZy5iZWJlZS5jb20vam9iLzIwMjEwNDIyLWU5N2IzNzA4Nzc5ODMwZGQwYWZiZjllODc2YzZiZDFmP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Management", "value": "GC18"}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Advertising and Marketing", "value": "GC03"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Media, Communications and Writing", "value": "GC20"}, {"text": "Transportation and Logistics", "value": "GC30"}, {"text": "Art, Fashion and Design", "value": "GC05"}, {"text": "Construction", "value": "GC09"}, {"text": "Education", "value": "GC11"}, {"text": "Human Resources", "value": "GC15"}, {"text": "Protective Services", "value": "GC23"}, {"text": "Property", "value": "GC24"}, {"text": "Science and Engineering", "value": "GC27"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "Project manager", "value": "project manager"}, {"text": "Program manager", "value": "program manager"}, {"text": "Manager", "value": "manager"}, {"text": "Delivery manager", "value": "delivery manager"}, {"text": "Project director", "value": "project director"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Senior", "value": "senior"}, {"text": "Consultant", "value": "consultant"}, {"text": "Coordinator", "value": "coordinator"}, {"text": "Deputy director", "value": "deputy director"}, {"text": "Director", "value": "director"}, {"text": "Group manager", "value": "group manager"}, {"text": "Operations", "value": "operations"}, {"text": "Scrum master", "value": "scrum master"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Services", "value": "services"}, {"text": "Vice president", "value": "vice president"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Engineering Services", "value": "/business/naics2007/5413"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Entertainment", "value": "/business/naics2007/71"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Management", "value": "/business/naics2007/55"}, {"text": "Real Estate", "value": "/business/naics2007/53"}, {"text": "Research", "value": "/business/naics2007/5417"}, {"text": "Retail", "value": "/business/naics2007/44"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": ".AB4Jjf.qPB6Vc{padding-right:11px}.qfpP8d{padding:7px 0 7px 11px}.S003Ke{flex:none}.ZoN4Lb{color:rgba(0,0,0,.54)}.nAXVG{color:#70757a}.IxQsL{color:rgba(0,0,0,.26)}.xFO1De{color:#fff}.ooFpK{color:rgba(255,255,255,.30)}.mtnwac{color:#4285f4}.WxeeKb{color:#34a853}.hIVRU{color:#f29900}.EXaTMc{color:#fbbc04}.sxn46d{color:#000}.gqMTF{color:#1a73e8}.zpn8Mb{color:#d93025}.dEUPmd{color:#1e8e3e}.PJNo1{color:#fbbc04}Actively Hiring", "value": "e"}, {"text": "Michael Page", "value": "/m/04cxldw"}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Nanyang Technological University", "value": "/m/0l49k"}, {"text": "Jobline Resources Pte Ltd", "value": "/g/11gp2647pn"}, {"text": "Randstad Singapore", "value": "/g/11g70b50mr"}, {"text": "GECO Asia", "value": "/g/11gk72_bt_"}, {"text": "Facebook", "value": "/m/0hmyfsv"}, {"text": "HP", "value": "/m/03mnk"}, {"text": "IoTalents", "value": "/g/11dxq187wm"}, {"text": "NCS Group", "value": "/m/0282746"}, {"text": "National University of Singapore", "value": "/m/01q460"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "OPTIMUM SOLUTIONS (SINGAPORE) PTE LTD", "value": "/g/11g70hkrbx"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Apple", "value": "/m/0k8z"}, {"text": "Avensys Consulting", "value": "/g/11g7022gjf"}, {"text": "BNP Paribas", "value": "/m/02qhk4"}, {"text": "Ceridian", "value": "/m/07f8h6"}, {"text": "Ensign InfoSecurity", "value": "/g/11g4jhymjr"}, {"text": "Humanica Asia Pte. Ltd", "value": "/g/11h1y98c9z"}, {"text": "Kerry Consulting", "value": "/g/11c73vtzc8"}, {"text": "Marsh and McLennan", "value": "/m/053rw"}, {"text": "NSEARCH GLOBAL", "value": "/g/11dxpksll4"}, {"text": "NTT", "value": "/m/05mybp8"}, {"text": "OakTree Consulting", "value": "/g/11g70jfhtq"}, {"text": "Salesforce", "value": "/m/07btr5"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "TEKsystems", "value": "/g/11b6g4bkv0"}, {"text": "Teradyne", "value": "/m/04bzqp"}, {"text": "Toshiba Tec Singapore Pte. Ltd", "value": "/g/11g9n9q547"}, {"text": "Trustwave", "value": "/m/0n3xjf5"}, {"text": "Wood Plc", "value": "/m/07vv9s"}, {"text": "Workiva", "value": "/m/0113m1rd"}, {"text": "A-it Software Services Pte Ltd", "value": "/g/11dxpy_gl_"}, {"text": "ABS Group", "value": "/g/11dxplj1z6"}, {"text": "ACI HR Solutions Ltd", "value": "/g/11c73ryh3p"}, {"text": "AIA", "value": "/m/02r5cgx"}]}]}