{"search_metadata": {"id": "60827b1a87a0ee3bedbb7bf2", "status": "Success", "json_endpoint": "https://serpapi.com/searches/623cf22bdf6a8a3a/60827b1a87a0ee3bedbb7bf2.json", "created_at": "2021-04-23 07:45:30 UTC", "processed_at": "2021-04-23 07:45:30 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28consultant%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=170", "raw_html_file": "https://serpapi.com/searches/623cf22bdf6a8a3a/60827b1a87a0ee3bedbb7bf2.html", "total_time_taken": 5.15}, "search_parameters": {"q": "(consultant) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "170"}, "jobs_results": [{"title": "Infrastructure Support Consultant (BB-E963E)", "company_name": "RECRUIT EXPRESS PTE LTD", "location": "Singapore (+1 other)", "via": "via BeBee", "description": "Roles & ResponsibilitiesJob Description:· Strong knowledge in VMWare setup,· Hands-on expertise in VM OS hardening as per organization standards· Expert in Cloud and Infrastructure Solutioning Requirements:· Presentation skills· Knowledge on ITSM· Certification in VMWare, Azure & AWS is preferred though not essential· ITIL Certification preferred Interested applicants, please email your resume to Serene Lim See Min (Ms)Email: Reg No: R1872248EA Licence No: 99C4599Recruit Express Pte LtdTell employers what skills you haveAWSCloudITILNetwork InfrastructureSQL AzureVMwareVMware InfrastructureWindows AzureStrong presentation skillshands-on experienceVM", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJJbmZyYXN0cnVjdHVyZSBTdXBwb3J0IENvbnN1bHRhbnQgKEJCLUU5NjNFKSIsImNvbXBhbnlfbmFtZSI6IlJFQ1JVSVQgRVhQUkVTUyBQVEUgTFREIiwiY29tcGFueV9taWQiOiIvZy8xMWc3MDZoemhxIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiS0tUaUczeTZGR20wQlhTYUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRW9zQ0Nzd0JRVTVWWDA1eFZERlhUVVY1VjNVM1ZUbDBOVU0zUmtKQk5GRllkazFRZWs1RlkxQlVOM1ZoYm5KTGR6WkRNVUpDTmxKQ056RkdPVGcyTUVnMGJHTkNPVFpIZGtkRlMyMW5PRzk1ZVhGdldHWk5kMm8wUjNvM1VFTmFOa1YzVEV0d2JrOWZkemxRZEVGWFRFdERaVkI2T0RWS2FGWlhhMW93TkU1MWNFRklMVXQ0TjNwWGJUSjZSV1pGY0hKUE5IbDNVRmt3V1dSa1pGUjVNVVYyVW0xcVVHbGhWMWxCTmpSS1pFeDRPWEp2U1hKNlNHTlVNRmhsT1V4dFUzVkJlR1I1WkRsa1owRTRkRkZHUzNJdEVoWkliblZEV1U1eU1FOUpVMUYwUVdGUWRXOWlTVUYzR2lKQlQwMVpVbmREYjA4elYyeE5XbWxMUVc5SFMydHJhRmxFV1hJM1ltRmxUVXBCIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCZUJlZSIsImxpbmsiOiJodHRwczovL3NnLmJlYmVlLmNvbS9qb2IvMjAyMTA0MjAtMjQ0MjQ2NzNkOGUwNjBhN2RkMWZlZTU1NjNmZTk2M2U/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Regional Sustainability & Net Zero Lead Consultant", "company_name": "Turner & Townsend", "location": "Singapore", "via": "via SmartRecruiters Jobs", "description": "Company Description\n\nAt Turner & Townsend we’re passionate about making the difference. That means delivering better outcomes for our clients, helping our people to realise their potential, and doing our part to create a prosperous society.\n\nEvery day we help our major global clients deliver ambitious and highly technical projects, in over 110 offices worldwide.\n\nJob Description\n• South East Asia\n• Full-time\n• Department: Advisory\n\nThis is an opportunity for real impact and career progression, joining a global professional services company and take a leading role in the South East Asia net-zero carbon transition.\n\nWe are a growing team of sustainability consultants that support Turner & Townsend clients across Asia and globally with their transition to low-carbon, sustainable future models. The size of Turner & Townsend offers opportunities to work across a range of projects across Real Estate, Infrastructure and Natural Resources/Renewables.\n\nThis role is focused on building our... sustainability capability in South East Asia, with potential to expand across Asia, working closely with Turner & Townsend’s multidisciplinary teams – from our regional hub in Singapore. We are seeking candidates who bring sustainability consultancy capabilities and networks and are excited by the opportunity to build a new team within this growing sector.\n\nAs part of our national Sustainability team, you will be supported by our team who run major existing commissions across the Real Estate, Infrastructure and Natural Resources Sector.\n\nOverview of the role\n\nThe aim is both to develop a locally-relevant & present service to support Turner & Townsend’s business in region – as well as to support other global Sustainability initiatives as required.\n\nThe successful candidates are will need to be able to competently deliver Sustainability and Net Zero/Energy Efficiency consultancy advice as the basis for growing a team. For this you’ll need experience and understanding of some or all of the following subject matter:\n• Regional and/or corporate decarbonisation programmes\n• Energy efficiency and carbon emissions reductions for existing assets\n• Low carbon & sustainable design & certification for new construction\n• Strategy/project delivery experience in the built environment\n• Programme and project management and leadership\n\nKey outcomes\n\nWorking with regional strategic leadership and our existing local teams to develop and deliver a growing pipeline of sustainability consultancy in the region, responding to a significant level of interest from existing clients.\n\nApproximately 50% of your time is expected to be spent delivering consultancy services, with the other 50% work winning and team development, with an aim to grow a team within 12 months.\n\nTypical Consultancy Services\n\nTurner & Townsend’s support for clients extends throughout the full consultancy life-cycle and whichever lifecycle stage may cover diagnostics, strategy, consulting, delivery management, assurance and continuous improvement. We operate across Real Estate, Infrastructure and Natural Resources/Renewables and support both the public and private sectors with their existing assets and new-build capital programmes.\n\nAcross the Sustainability Team, and within these growth roles, we wish to build-out our regional capability to support clients with:\n• Net Zero programme management\n• Net Zero baselining, strategy & action plans\n• Energy efficiency & renewables\n• Certification – BREEAM, LEED, WELL\n• Social value\n• Embodied carbon\n• City-wide/Regional Energy Accelerator Programmes\n• UK/Global client support programmes\n\nAdditional services that we would be interested in:\n• Waste/circular economy\n• Heat networks & smart energy\n• Policy & research\n• Digital solutions for management and reporting\n• Sustainable procurement\n• Training & leadership\n\nQualifications\n\nCandidates should have strong experience and a good applied knowledge of sustainability, energy management and carbon reduction projects, covering a number of the consultancy areas outlined above.\n\nKey background includes\n• Public sector (including housing, local, regional and/or central government)\n• Private sector (including developers and/or large corporates)\n• Team building, management and leadership\n• Consultancy and business growth\n\nWe have existing consultancy services that could be expanded in social housing, local government and health sector so experience would be particularly advantageous.\n\nCompetencies\n\nEssential\n• Firm professional grasp of the wider sustainability agenda\n• Ability to lead this service regionally, supporting clients and colleagues to understand and maximise sustainability in projects and programmes\n• Good understanding of low and zero carbon technologies and strategies to reduce emissions in buildings (e.g. Renewable energy, heat pumps and fabric measures)\n• Effective relationship management\n• Enthusiasm for growing a team and business in a fast moving environment\n\nDesirable\n• Ability to develop and convey strong business cases to support investment in carbon reduction and sustainability\n• Structured approaches to environmental management (e.g. ISO14001/EMS/ISO50001)\n• Experience in new build or retrofit of buildings (domestic or non-domestic)\n\n#LI-RT1\n\nAdditional Information\n\nOur inspired people share our vision and mission. We provide a great place to work, where each person has the opportunity and voice to affect change.\n\nWe want our people to succeed both in work and life. To support this we promote a healthy, productive and flexible working environment that respects work-life balance.\n\nTurner & Townsend is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees and actively encourage applications from all sectors of the community.\n\nPlease find out more about us at www.turnerandtownsend.com", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJSZWdpb25hbCBTdXN0YWluYWJpbGl0eSBcdTAwMjYgTmV0IFplcm8gTGVhZCBDb25zdWx0YW50IiwiY29tcGFueV9uYW1lIjoiVHVybmVyIFx1MDAyNiBUb3duc2VuZCIsImNvbXBhbnlfbWlkIjoiL20vMGNmeTZ4cCIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Ii1hUHo0QWdlSTFaT0QxOVNBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2WUJDcmNCUVU1VlgwNXhVVmRPZEhWcGFrWktWa2RHTjNVeU1sZGFkRVI1WDNBMk1sQktSbTk0UjNkalRERTFiR000Y2pKYVFYSlpORXRvU1hWTFpuWTJPSFZuWW5aWVRGZHVjM2RXZEc1blRHWTJPSEIxYlVSTllUQnJXblF3U0V0VVdFZ3RSVkJJV1cxVVVVd3dSbFJ2TjNoZmFYQTNPVlZhYmpKYWFEZzBPRzVWTTBwdFJUTjVPVkZYTTBWUlEwbGhPRkpxY1hKdWREVnJhVk5TTkROWmREaExUMnM1TmpWSVNXVjZRbVJYVEc5NVUwaFBjVFpvTkhNd0VoWkliblZEV1U1eU1FOUpVMUYwUVdGUWRXOWlTVUYzR2lKQlQwMVpVbmRDYmtwV1ZFWllWbXcwUW10eFV6TlZObTQwVEROMVV6SjVkRGRSIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMTMiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gU21hcnRSZWNydWl0ZXJzIEpvYnMiLCJsaW5rIjoiaHR0cHM6Ly9qb2JzLnNtYXJ0cmVjcnVpdGVycy5jb20vVHVybmVyVG93bnNlbmQvNzQzOTk5NzM3NjYwMDUyLXJlZ2lvbmFsLXN1c3RhaW5hYmlsaXR5LW5ldC16ZXJvLWxlYWQtY29uc3VsdGFudD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "#sgunitedjobssalesforce Consultant", "company_name": "RANOSYS TECHNOLOGIES PTE. LTD.", "location": "Singapore", "via": "via MNC Jobs Singapore | MNC Jobs In Singapore", "description": "Roles and Responsibilities\n\nAs a Salesforce Consultant, you will be responsible for gathering requirements, solution and design reviews, integration and data approach, release management methodology, fit/gap analysis of product capabilities, adoption approach, and best practices related to use of the Salesforce.com platform and guidance around adoption of Salesforce functionality.\nKey Responsibilities Include\n• Proactively work with enterprise customers to improve their adoption roadmap and return on investment.\n• Support sales team as a pre-sales consultant.\n• Develop Integrations, security and accessibility with complex development requirements.\n• Implement and Improve Salesforce DevOps processes in projects.\n• Develop training materials and conduct training to customers\n• Write configuration documents, prepare technical and functional specification documents, and deliver documentation to be used for future reference.\n\nRequired Skills and Experience\n• 6+ years of experience... implementing and integrating enterprise systems\n• Computer Science, Software Engineering, Computer Engineering Degree or equivalent experience\n• Must be a Certified Salesforce Administrator.\n• Certifications as Salesforce Sales/Service/Community/Marketing/Pardot Consultant will be a big plus.\n• Ability to define and deliver custom Force.com enterprise applications.\n• Strong customer facing experience\n• Hands on development experience with Apex, Visualforce and/or the salesforce.com API\n• Experience with data extraction, transformation and load tools will be an advantage", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiIjc2d1bml0ZWRqb2Jzc2FsZXNmb3JjZSBDb25zdWx0YW50IiwiY29tcGFueV9uYW1lIjoiUkFOT1NZUyBURUNITk9MT0dJRVMgUFRFLiBMVEQuIiwiY29tcGFueV9taWQiOiIvZy8xMWR4cHZubTJsIiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiSHVOckZhMGMxNVBQTUpyOEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXFFQ0N1SUJRVTVWWDA1eFVXSkZOREpuTlhNd05Wa3dNblpGYkZwWVVqZ3RORlJhYlhSV1JsWnRaMVkwVEc1YVdHRjJNMU5TZVhkMGJHSlFNVFV0VVhWNVUxRnFlRzE1WWxZNFJIVjNWMEZaTUd0Nk5tOHliRzV5VlZaV1pXZDVOVFpMWVdaSE5ETnhPR05uYjBzMlVXMTVUa1ZHUlc1TGExTnlla2czYlZSMVQxQklOekptZVRWQmN6TXpTRFExTFdGTE1taFBTblJUYmkxNFYwMW1aR0puZVdKVlJYRmhabVZuYmxoNVEydFRWM0JhTldWbmMyczBOMDVMTkRRMmNTMXlWMUpLU25WTE5qaE5WVGRxVmpKb1NrSjBkVXBOUW5WZlNYQmxOVTlETURsVlR6VXhaeElXU0c1MVExbE9jakJQU1ZOUmRFRmhVSFZ2WWtsQmR4b2lRVTlOV1ZKM1EwNWxkbE0wVFZSWlZYRTNjMjEwYUVkSk1Fc3lWM2htTUhob1p3IiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMjEiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTU5DIEpvYnMgU2luZ2Fwb3JlIHwgTU5DIEpvYnMgSW4gU2luZ2Fwb3JlIiwibGluayI6Imh0dHBzOi8vc2cubW5jam9iei5jb20vam9icy9zZ3VuaXRlZGpvYnNzYWxlc2ZvcmNlLWNvbnN1bHRhbnQtZ2V5bGFuZy0yNDg1NTc/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "IT Technology Senior Consultant", "company_name": "SAP", "location": "Singapore", "via": "via Jobs At SAP", "description": "Requisition ID: 269580\n\nWork Area: Information Technology\n\nExpected Travel: 0 - 10%\n\nCareer Status: Professional\n\nEmployment Type: Regular Full Time\n\nCOMPANY DESCRIPTION\n\nSAP started in 1972 as a team of five colleagues with a desire to do something new. Together, they changed enterprise software and reinvented how business was done. Today, as a market leader in enterprise application software, we remain true to our roots. That’s why we engineer solutions to fuel innovation, foster equality and spread opportunity for our employees and customers across borders and cultures.\n\nSAP values the entrepreneurial spirit, fostering creativity and building lasting relationships with our employees. We know that a diverse and inclusive workforce keeps us competitive and provides opportunities for all. We believe that together we can transform industries, grow economics, lift up societies and sustain our environment. Because it’s the best-run businesses that make the world run better and improve... people’s lives.\n\nSUMMARY\n\nAs a member of the Secure Workstation Services Team in Workplace Delivery, you and your fellow colleagues are responsible for delivering, managing and supporting the secure administrative workstation environment across all SAP environments. The team utilizes the latest Windows 10 operating system, Microsoft security toolsets and Microsoft Endpoint Management services to provide next level security for administrators accessing SAP's most critical infrastructure services. As a senior team member, you will be a subject matter expert in one or more topics (Windows OS hardening, supply logistics, Patching, deployment, etc) while supporting the day to day operations during the Asia Pacific time zone.\n\nThe ROLE:\n• The position requires great analytical and communication skills in combination with a genuine service-oriented approach with the ability to anticipate changes and recommend service improvements\n• Workplace Delivery provides the key services and infrastructure to support SAP's digital transformation globally. We are a diverse and global team focused on using the latest technology to deliver extraordinary results.\n\nROLE REQUIREMENT\n• Bachelor’s degree in Science, Technology, Engineering, and Mathematics (STEM) disciplines or similar work experience\n• Security + certification or equivalent\n• Microsoft 365 Certified: Enterprise Administrator Expert or equivalent\n• Minimum 5 years experience configuring and delivering Microsoft Windows devices to end users, with recent experience hardening the Windows 10 operating system\n• Minimum 5 years experience deploying Microsoft Windows with System Center Configuration Manager or Microsoft Intune (Microsoft Endpoint Manager)\n• Powershell, Advanced Level\n• Microsoft Windows OS troubleshooting, Expert Level\n• Previous experience working in a large organization supporting users across mulitple time zones and countries\n\nWHAT YOU GET FROM US\n\nSuccess is what you make it. At SAP, we help you make it your own. A career at SAP can open many doors for you. If you’re searching for a company that’s dedicated to your ideas and individual growth, recognizes you for your unique contributions, fills you with a strong sense of purpose, and provides a fun, flexible and inclusive work environment – apply now.\n\nSAP'S DIVERSITY COMMITMENT\n\nTo harness the power of innovation, SAP invests in the development of its diverse employees. We aspire to leverage the qualities and appreciate the unique competencies that each person brings to the company.\n\nSAP is committed to the principles of Equal Employment Opportunity and to providing reasonable accommodations to applicants with physical and/or mental disabilities. If you are in need of accommodation or special assistance to navigate our website or to complete your application, please send an e-mail with your request to Recruiting Operations Team (Americas: Careers.NorthAmerica@sap.com or Careers.LatinAmerica@sap.com, APJ: Careers.APJ@sap.com, EMEA: Careers@sap.com).\n\nSuccessful candidates might be required to undergo a background verification with an external vendor.\n\nAdditional Locations", "extensions": ["10 days ago", "Full–time"], "detected_extensions": {"posted_at": "10 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJJVCBUZWNobm9sb2d5IFNlbmlvciBDb25zdWx0YW50IiwiY29tcGFueV9uYW1lIjoiU0FQIiwiY29tcGFueV9taWQiOiIvbS8wMXBmNGwiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJpXy1CV1RGM3VYWkxrQ052QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFc3NCQ293QlFVNVZYMDV4VTFSTmNVNVNiRUpVY21sbVpGbzRTRkF5WlVWcVdURnlhMnBpVm14eVZFSjFaakE1WTJKSlZWRnZWRzVCT1dkVk1VTnpiSE5YVVhaWVZGZDFlbXBJT0hwelUyVnBMVEUyZEhZd1gxSTJWVFI2TmxWcVUzUmxWVUphUW5wNU5rdEdjVk5XWkZKTWIyeG9kWE5OV21od1JIVllka3gyZFcweE4wRnBTekZIV2pCMVJtbGxlVEVTRmtodWRVTlpUbkl3VDBsVFVYUkJZVkIxYjJKSlFYY2FJa0ZQVFZsU2QwTkZVbGx3TUdKMGJIbFNaRGhqV0dSdFpsVTJOUzF4YVRsZmVuYyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzI5IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnMgQXQgU0FQIiwibGluayI6Imh0dHBzOi8vam9icy5zYXAuY29tL2pvYi9TaW5nYXBvcmUtSVQtVGVjaG5vbG9neS1TZW5pb3ItQ29uc3VsdGFudC0wMS82NTgzNzU5MDEvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "SOX ITGC Compliance Senior Consultant", "company_name": "Encora", "location": "Singapore", "via": "via Glassdoor", "description": "Skills:\n• Should have worked on consulting/implementation & audit of SOX IT General Controls associated with IT Operations (Mandatory)\n• CGEIT, COBiT Experience & COSO ERM execution (preferred)\n• Excellent understand & experience in IT applications & infrastructure management which includes SDLC, App Security, DevOps, Networks, Data Centre Operations, Service Management/Service Desk, Server Management etc.\n• Excellent understanding of IT Service Management processes. ITIL certified.\n• Should be able to identify & report risks related to SOX ITGC design effectiveness & operational effectiveness gaps\n• Should have experience in executing end-to-end SOX ITGC audit life cycle\n• Exposure to other regulatory compliances such as Data Protection Act\n• Candidate should have client facing experience", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTT1ggSVRHQyBDb21wbGlhbmNlIFNlbmlvciBDb25zdWx0YW50IiwiY29tcGFueV9uYW1lIjoiRW5jb3JhIiwiY29tcGFueV9taWQiOiIvZy8xMWR5bWZsM3YwIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiS3N3UG5wcXh1bE83YlFpbkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFVXOXJUbTVOYnpJMlJqVTNXbk5hYWxwWVdWOTFXRzV3VWxRNVMzTk5RVnB6VEdGMFJESjZlVkpqZG1wTlVrNWxkWFV6WjBGa2N6Tm9VR05TTUZoSldEZERaRzh4WlRsMVppMUJMVkUwU0dSWlZtSlROR2hTZUdkWWJsOVJVMHgxVEZOd2VpMTFPVU53VGpaUVVGaHZSbGxrU21GQmJWbFVSMmd5TWkxUk1GWlJWbmg0T0ZSMGJVSXRZbGhDYlRoaVIwUlNlbHBpWm5OVk9HbDNFaFpJYm5WRFdVNXlNRTlKVTFGMFFXRlFkVzlpU1VGM0dpSkJUMDFaVW5kQ1VHWXlNM0ZFYkRSV1dFRklZMkZhTkdzMVFXMU9kVzlJT1hoUiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzM3IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEdsYXNzZG9vciIsImxpbmsiOiJodHRwczovL3d3dy5nbGFzc2Rvb3Iuc2cvam9iLWxpc3Rpbmcvc294LWl0Z2MtY29tcGxpYW5jZS1zZW5pb3ItY29uc3VsdGFudC1lbmNvcmEtSlZfSUMzMjM1OTIxX0tPMCwzN19LRTM4LDQ0Lmh0bT9qbD00MDYzOTM4NjU4XHUwMDI2dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Inhouse Recruitment Consultant", "company_name": "Transcendent Business Services Pte Ltd", "location": "Singapore", "via": "via Joblum Singapore", "description": "Our client specialising in contact centre. Due a major expansion program, is seeking an Inhouse Recruiter to join its team. This role will allow you to have the experience of working for a major corporation which is also your client.\nResponsiblities\n\n• Recruitment and selection; job advertisements, shortlist and arrange interviews\n• Prepare manpower reports and liaise with respective division on their manpower needs\n• Coordinate recruitment activities e.g. career fair\n• Prepare contracts/letters of employment for new hire\n\nRequirements\n• A minimum of 1 year experience in recruitment preferably in mass recruiting\n• Ability to conduct face to face interview would be an added advantage\n• Candidate with CEI certification will be an added advantage\nInterested applicant please send your resume to recruit1@tbs.com.sg. We thank you for your application but only shortlisted candidates will be notified.\nWoon Yun Shia(Fion Karis)\nTranscendent Business Services Pte Ltd\nEA:R1110743/10C5505", "extensions": ["7 days ago", "$3K–$4.5K a month", "Full–time"], "detected_extensions": {"posted_at": "7 days ago", "schedule_type": "Full–time", "salary": "$3K–$4.5K a month"}, "job_id": "eyJqb2JfdGl0bGUiOiJJbmhvdXNlIFJlY3J1aXRtZW50IENvbnN1bHRhbnQiLCJjb21wYW55X25hbWUiOiJUcmFuc2NlbmRlbnQgQnVzaW5lc3MgU2VydmljZXMgUHRlIEx0ZCIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiay0tT3Noa1dmSDVBZFdDVUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JsdW0gU2luZ2Fwb3JlIiwibGluayI6Imh0dHBzOi8vc2cuam9ibHVtLmNvbS9qb2IvaW5ob3VzZS1yZWNydWl0bWVudC1jb25zdWx0YW50LzYyMTAzMj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Executive Search Consultant", "company_name": "SearchAsia Consulting Pte Ltd", "location": "Singapore (+1 other)", "via": "via Glints", "description": "Have you ever been curious about the hiring process?\n\nOpen to learn more about the legal industry?\n\nInterested to know more about networking and establishing connections between firms and talents in the legal industry?\n\nIf having a hands-on internship experience is of importance to you, and if you’re an individual willing and keen to learn more about corporate life in Recruit Legal, wait no longer and apply for an internship with us!\n\nWhat can you take away from us?\n\n· Greater understanding of the legal industry\n\n· Improved interpersonal and communication skills\n\n· How to be resourceful and efficient\n\n· To perform and prioritize under stress\n\n· A real insight into, and personal experience with corporate life – life as a legal recruitment consultant\n\nResponsibilities – of a legal recruiter\n\n1. Recruitment\n\na. To actively source for potential candidates for different legal placements via many channels\n\nb. Communicating with professionals in the legal industry who hold managerial roles... and above\n\n2. Administrative\n\na. Posting of job advertisements\n\nb. Updating of documents\n\nRequirements:\n\n· Minimum “A” Level Certification\n\n· Minimum 3 months commitment\n\nOur Preferred Skills:\n\n· Driven and Self-motivated\n\n· Willing to learn; open minded\n\n· Well-versed in MS Office\n\n· Efficient at work\n\n· Outgoing personality\n\nKate Chang Chu Yan\n\nEA License No.: 16S8107\n\nEA Personnel Registration NO.: R1332479", "extensions": ["Over 1 month ago", "Internship"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Internship"}, "job_id": "eyJqb2JfdGl0bGUiOiJFeGVjdXRpdmUgU2VhcmNoIENvbnN1bHRhbnQiLCJjb21wYW55X25hbWUiOiJTZWFyY2hBc2lhIENvbnN1bHRpbmcgUHRlIEx0ZCIsImNvbXBhbnlfbWlkIjoiL2cvMTFmeTI2MG5oeiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjZJNHpCSkwwVmxCbVhkRVlBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVvc0NDc3dCUVU1VlgwNXhVbTFsUVdwVk0yNUlhblpYT1Mxa1luSnhUSHBSYVY4MmNEQXhZVEZQVmtaT2IxOUZYMWhPU0djMU1uUk9NVzFaTms5b09UUlZWSEo2VW5kaFNTMHlNVzV3YTFsTFVXaFBabUZuUjBFNVFXWnlOMmRPUlhWMVFucFBXa2N0VWxsdlMzaHdkbVZJVlZsVFZuRjZkVGhVUmxVMmNrWlRWa0oxV2pWTlJFSlllbHBFY0dWa05XNHplRlZSWkRKV1pqTnlPVVk1UWxVNVMxbHlTRmROU1VWamNEUndVa2hyZWw5bk5VNTVjUzF2YkhKbGR6Qm9RVmh5ZW5OUVVUUndkRWRLUTJvMVdIRjVFaFpJYm5WRFdVNXlNRTlKVTFGMFFXRlFkVzlpU1VGM0dpSkJUMDFaVW5kQ1NEWXlWalZOYTBKNlpsbFpPVWRYTm1KaGIxaFpWVU0zYkRGMyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzUxIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEdsaW50cyIsImxpbmsiOiJodHRwczovL2dsaW50cy5jb20vc2cvb3Bwb3J0dW5pdGllcy9qb2JzL2V4ZWN1dGl2ZS1zZWFyY2gtY29uc3VsdGFudC9iYjMxOGFhYS05Nzk1LTRmM2QtOWZhNy1hZjI5OWJkOTA4YjE/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Functional Consultant – Microsoft Dynamics ERP – Finance", "company_name": "HITACHI SOLUTIONS ASIA PACIFIC PTE. LTD.", "location": "Singapore", "via": "via LinkedIn", "description": "JOB OBJECTIVES\n\nTo be able to provide full cycle implementation, consulting, configuration, training, installation and support for clients using Microsoft Dynamics ERP. It is expected that the Functional Consultant has deep knowledge of GL, AP, AR, FA and Bank Management experience and exposure to other modules such as Inventory, Supply Chain, Project Accounting.\n\nJob Responsibilities\n• Work through client teams across different business units to gather requirements and communicate effectively.\n• Configure Microsoft Dynamics ERP Financial Modules based on the requirements\n• Advise customer organization on solution usage and help minimize gaps between standard product customer's business processes with creative configuration.\n• Prepare Business Process Discovery Requirements and functional specification for customizations required\n• Work with Management Reporter 2012 and configure reports\n• Demonstrate Microsoft Dynamics ERP in Conference Room Pilots\n• Understand multiple enterprise... systems, their high level functions and put together process flows, gap analysis, and create business mapping.\n• Test the functions and the features being developed and confirm that they fulfil the business requirements.\n• Plan and perform data migration using DIXF into Microsoft Dynamics ERP\n• Prepare User Manuals and deliver training to end users\n• Provide pre-go live and post go live end user support.\n• Other duties as deemed necessary for the job.\n\nJob Qualifications\n• Bachelor’s Degree\n• CPA or Cost Accounting certification is highly desired\n• Microsoft Dynamics AX certification and/or experience in Microsoft Dynamics 365 for Finance and Operations, AX 2012 R2, R3 or AX 7/D365FO are a plus\n• At least two years’ experience in ERP implementation, configuration, system design or related business experience\n• Experience in configuring General Ledger, Bank Management, Accounts Receivable, Accounts Payable, Fixed Assets, Management Reporter is required\n• Experience in Expense Management, Multi-company, Project Accounting, Trade and Logistics is a plus.\n• Knowledge on Localization Requirements / Financial Policies and Procedures is a Plus\nProficient with Excel, PowerPoint, Outlook and Word.\n• Excellent writing and verbal skills\n• Locally-based candidates are preferred\n\nJob originally posted on GrabJobs. If you need to report this job please contact GrabJobs", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJGdW5jdGlvbmFsIENvbnN1bHRhbnQg4oCTIE1pY3Jvc29mdCBEeW5hbWljcyBFUlAg4oCTIEZpbmFuY2UiLCJjb21wYW55X25hbWUiOiJISVRBQ0hJIFNPTFVUSU9OUyBBU0lBIFBBQ0lGSUMgUFRFLiBMVEQuIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiIwWmZIUk1uNlVCYjItVm8zQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExpbmtlZEluIiwibGluayI6Imh0dHBzOi8vc2cubGlua2VkaW4uY29tL2pvYnMvdmlldy9mdW5jdGlvbmFsLWNvbnN1bHRhbnQtJUUyJTgwJTkzLW1pY3Jvc29mdC1keW5hbWljcy1lcnAtJUUyJTgwJTkzLWZpbmFuY2UtYXQtaGl0YWNoaS1zb2x1dGlvbnMtYXNpYS1wYWNpZmljLXB0ZS1sdGQtMjUxNjExMTI0Nz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Financial Consultant", "company_name": "Great Eastern Life", "location": "Singapore", "via": "via Jobs", "description": "About our Principal – The Great Eastern Life Assurance Company Limited Great Eastern Holdings and a member of OCBC Group, is the most established life insurance group in Singapore and Malaysia. Great Eastern Life Assurance Company has financial strength and counterparty credit ratings of 'AA’ by Standard & Poor's, which is one of the highest among Asian life insurance companies. About Our Agency We are a group of financial representatives from one of the top agencies in Great Eastern Life offering financial advisory services to our clients.We are recruiting people who are self-motivated and are keen to make their 1st million in the early stages of their life.We are more than willing to provide you with training and assist you to be financially independent.Be trained to provide personalized services and expertise in the area of financial planning for protection, healthcare, savings, and investments, etc.Assist clients in achieving their financial goals and aspirations.Build a trusting... and lifetime relationship between you and your clients.Are you looking to escape from a “normal’ career and looking to realize your own dreams and aspirations? You could start your own business, or join us to build and grow your business as a financial consultant. As a financial representative, it provides a range of opportunities not widely available in other career fields. In addition to offering valuable advice to client, our financial consultant enjoys huge income potential flexibility. Roles and Responsibilities:· Assessing clients’ financial situations and help client to achieve their long term and short term financial goals.· Advising clients on retirement planning, investments and insurance decisions, depending on client’s financial goals.· Explaining pros & cons of various investment strategies· Answering all finance-related questions and addressing to client’s concerns to maintain strong relationship with clients· For more enquiry please contact Ms Goh 64176561 Job highlight:• A winning strategy for the selected few• A training program to equip you for the highly competitive financial and wealth management industry.• you can be selected be trained and certified as a Chartered Financial Consultant, ChFC, or a Certified Financial Planner, CFP designationsRequirements:· Minimum full certificate in GCE “A” level, International Baccalaureate Diploma qualification, Diploma awarded by a polytechnic in Singapore or equivalent.· At least 21 years old and above (MAS requirement)· Sociable and coachable· Good interpersonal and communication skillsCandidates who are interested can click “Apply Now”.Interested applicants can visit greatalliance.sg to find out more.Only shortlisted candidate will be contacted.Additional Information Entry Level Qualification Higher Secondary/Pre-U/'A' Level, Diploma, Advanced/Higher/Graduate Diploma We are one of the top agencies in an established insurance company offering financial advice to our clients.We are recruiting people who are self-motivated and are keen to make their 1st million in the early stage of their life.We are more than willing to provide you with training and assist you to be financially independent.Be trained to provide personalised services and expertise in the area of financial planning for protection, healthcare, savings, and investments, etc.Assist clients in achieving their financial goals and aspirations.Build a trusting and lifetime relationship between you and your clients.Additional Company Information Registration No. TMH200080341 Company Size 1 - 50 Employees Average Processing Time 8 days Benefits & Others Dental, Miscellaneous allowance, Medical, Business (e.g. Shirts), Flexible hours", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJGaW5hbmNpYWwgQ29uc3VsdGFudCIsImNvbXBhbnlfbmFtZSI6IkdyZWF0IEVhc3Rlcm4gTGlmZSIsImNvbXBhbnlfbWlkIjoiL20vMDJxbmZwNyIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6InpzWjBvRFk4T0taYmlVS3hBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2WUJDcmNCUVU1VlgwNXhVMFV6TFhrdGRWQTVWRlJhZFdoWFNrRjVNVkF5YzNGaVUzUlJVbkJyUlhaeWExOXNVMDkwUTBkTllWODBORVV3T0dKdmNWcHFaMkUxY0VGVGFXa3hjRlk1VjFOWFJHMW5iakpqWVZST2JXcFlVRlZyVjI5VmMyRmxibXBUZDBkRmRHOVliRE5ZVWxGc01rbENVakpuT1ROdE5XdEJRVXhVV21sclRYSTVjMDB3TkRCRWJUSjRTMFZwZVZOdFQzQklZbGsxU0Y5cGFFSkRjbnA0Ukc1bFNIZHRNRmswTm5kc1gwMUlVMlJPT0RkSkVoWkliblZEV1U1eU1FOUpVMUYwUVdGUWRXOWlTVUYzR2lKQlQwMVpVbmRDUlVwcGVGRkJkelV3ZVVkTVRqRXdTbGRhVTJWb1lsQnJVR3huIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNjMiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9icyIsImxpbmsiOiJodHRwczovL3NnLmZpZGFudG8uY29tL2pvYnMvam9iLW9wZW5pbmcvZmluYW5jaWFsLXNwZWNpYWxpc3RzLWFsbC1vdGhlci9maW5hbmNpYWwtY29uc3VsdGFudC0yNzU0OTE3NjM/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Junior / Senior Business Analyst (CCBA/CBAP Certified) (BB-09B18)", "company_name": "Thatz Resources Pte Ltd", "location": "Singapore", "via": "via BeBee", "description": "Job Description Are you seeking the new norm career opportunities? We are assisting Thatz International Pte Ltd to identify suitable talents to grow their business in the new norm. Talent selected will be placed with them to carry out their Next-Generation ICT Engagement and Consultancy (Thatz 2.0) or Outsourcing business. Who we are Thatz Resources Pte Ltd (Agency License No. 04S4557)has been established since the Year 2000 to recruit the right IT candidate that meets our clients’ requirements at all levels. We always have great success in matching the best candidate with the job openings. Our DELIVERIES: Quality Speed Technology Right Pricing User eXperience Our CORE VALUES: Integrity System Consistency Forward Looking Humanity, and Environmental Friendly Junior / Senior Business Analyst Job Title: Junior / Senior Business Analyst Work Location: Central Singapore Job Type: 3 Years Contract, subject to renewal About the Job Primary Responsibilities: Elicit, scope and manage the... Agency’s business requirements Develop the business case and Tender Specifications Evaluate and recommend ICT solutions that best address the needs Prioritise product backlog through rigorous information gathering and analysis with stakeholders, and contribute to the development of the Functional/ Design specifications Review testing and data conversion documents to verify that specifications are met Drive smooth deployment, adoption and operations of the solution analyse impact of requested changes (Operations & Maintenance phase) Work with developers to understand and troubleshoot technical problems, as needed (Operations & Maintenance phase) Job Requirements: Degree or Diploma in Computer Science, Information Systems, Information/Infocomm Technology, Computer or Electronics Engineering or related discipline Minimum 3 years of working experience for Consultant and 5 years of working experience for Senior Consultant Participated in full software or product development cycles, preferably using Agile Methodology with past development experience Proven experience in IT business analysis, application solutioning and design, and testing Strong analytical, conceptualisation and problem-solving skills Excellent communication skills, both oral and written, with the ability to pitch ideas and influence stakeholders Advantageous to have Consulting or Business Analysis experience Business Analysis certification (Certification of Competency in Business AnalysisTM (CCBA®), Certified Business Analysis ProfessionalTM (CBAP®)). Knowledge of, or experience in implementing projects in at least one of the following areas (Data Analytics, Agile Methodologies, Internet and Mobile Technologies, Customer Relationship Management, Knowledge Management, Service Design, Cloud Solutioning. Locals preferred (SPRs are welcome to apply). What’s in it for you? It’s important each and every employee feels they are supported and can complete their life’s best work today and in the future. We are investing in each person not only with competitive compensation, but also with industry benefits and perks. A few ways we support our employees is by offering: Competitive Salary H&S Insurance Coverage Annual Leave and Medical Benefits Company events and annual awards (subject to Covid-19 situation) Community and sustainability support Other benefits The key objective of this role: To deliver an Awesome User Experience through result-oriented outcomes with friendly service disposition call it Thatz Way! ARE YOU THATZ ONE? Get in touch Prepare your updated resume (please include your notice period, current salary package with full breakdown such as base, incentives, annual wage supplement, etc.), and expected package. Apply through this application or send", "extensions": ["6 days ago", "Contractor"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Contractor"}, "job_id": "eyJqb2JfdGl0bGUiOiJKdW5pb3IgLyBTZW5pb3IgQnVzaW5lc3MgQW5hbHlzdCAoQ0NCQS9DQkFQIENlcnRpZmllZCkgKEJCLTA5QjE4KSIsImNvbXBhbnlfbmFtZSI6IlRoYXR6IFJlc291cmNlcyBQdGUgTHRkIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiI1b0ZRZ1dIU3AwcF9qa1g5QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJlQmVlIiwibGluayI6Imh0dHBzOi8vc2cuYmViZWUuY29tL2pvYi8yMDIxMDQxNy0wOGM5NmUwYjQxZmYwMzRkMjQ3MTdiZjdiZGMwOWIxOD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Business Operations", "value": "GC06"}, {"text": "Human Resources", "value": "GC15"}, {"text": "Accounting and Finance", "value": "GC01"}, {"text": "Sales and Retail", "value": "GC26"}, {"text": "Protective Services", "value": "GC23"}, {"text": "Science and Engineering", "value": "GC27"}, {"text": "Management", "value": "GC18"}, {"text": "Advertising and Marketing", "value": "GC03"}, {"text": "Legal", "value": "GC17"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Customer Service", "value": "GC10"}, {"text": "Social Services and Non-Profit", "value": "GC28"}, {"text": "Art, Fashion and Design", "value": "GC05"}, {"text": "Healthcare", "value": "GC14"}, {"text": "Energy and Mining", "value": "GC21"}, {"text": "Sports Fitness and Recreation", "value": "GC29"}, {"text": "Education", "value": "GC11"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "Consultant", "value": "consultant"}, {"text": "Senior consultant", "value": "senior consultant"}, {"text": "Security consultant", "value": "security consultant"}, {"text": "Recruitment consultant", "value": "recruitment consultant"}, {"text": "Lead consultant", "value": "lead consultant"}, {"text": "Associate consultant", "value": "associate consultant"}, {"text": "Principal consultant", "value": "principal consultant"}, {"text": "Associate", "value": "associate"}, {"text": "Financial consultant", "value": "financial consultant"}, {"text": "Functional consultant", "value": "functional consultant"}, {"text": "Presales consultant", "value": "presales consultant"}, {"text": "Technical consultant", "value": "technical consultant"}, {"text": "Application consultant", "value": "application consultant"}, {"text": "Devops consultant", "value": "devops consultant"}, {"text": "Pre-sales consultant", "value": "pre-sales consultant"}, {"text": "Consultants", "value": "consultants"}, {"text": "Development consultant", "value": "development consultant"}, {"text": "Engineer", "value": "engineer"}, {"text": "Hr consultant", "value": "hr consultant"}, {"text": "It consultant", "value": "it consultant"}, {"text": "Senior", "value": "senior"}, {"text": "Services consultant", "value": "services consultant"}, {"text": "Solution consultant", "value": "solution consultant"}, {"text": "Solutions consultant", "value": "solutions consultant"}, {"text": "Business", "value": "business"}, {"text": "Business consulting", "value": "business consulting"}, {"text": "Consulting", "value": "consulting"}, {"text": "Director", "value": "director"}, {"text": "Education consultant", "value": "education consultant"}, {"text": "Hcm consultant", "value": "hcm consultant"}, {"text": "Infrastructure", "value": "infrastructure"}, {"text": "Investment consultant", "value": "investment consultant"}, {"text": "Manager", "value": "manager"}, {"text": "Project manager", "value": "project manager"}, {"text": "Recruitment consultants", "value": "recruitment consultants"}, {"text": "Sap consultant", "value": "sap consultant"}, {"text": "Software engineer", "value": "software engineer"}, {"text": "Specialist", "value": "specialist"}, {"text": "Support consultant", "value": "support consultant"}, {"text": "Systems consultant", "value": "systems consultant"}, {"text": "Technology consulting", "value": "technology consulting"}, {"text": "Academy", "value": "academy"}, {"text": "Accountant", "value": "accountant"}, {"text": "Architect", "value": "architect"}, {"text": "Cloud consultant", "value": "cloud consultant"}, {"text": "Consultancy", "value": "consultancy"}, {"text": "Data engineer", "value": "data engineer"}, {"text": "Deputy director", "value": "deputy director"}, {"text": "Electrical engineer", "value": "electrical engineer"}, {"text": "Employee", "value": "employee"}, {"text": "Finance consultant", "value": "finance consultant"}, {"text": "Financial services", "value": "financial services"}, {"text": "Gastroenterologist", "value": "gastroenterologist"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Internship", "value": "INTERN"}, {"text": "Part-time", "value": "PARTTIME"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Accounting", "value": "/business/naics2007/5412"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Engineering Services", "value": "/business/naics2007/5413"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Real Estate", "value": "/business/naics2007/53"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Wholesale", "value": "/business/naics2007/42"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "SingTel", "value": "/m/020zfl"}, {"text": "EY", "value": "/m/0g9jc"}, {"text": "Infosys", "value": "/m/01k8x6"}, {"text": "SearchAsia Consulting Pte Ltd", "value": "/g/11fy260nhz"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "Deloitte SEA", "value": "/g/11f_g4x9d_"}, {"text": "Geco Asia", "value": "/g/11gk72_bt_"}, {"text": "OAKTREE CONSULTING", "value": "/g/11g70jfhtq"}, {"text": "Central Provident Fund Board", "value": "/m/0615qb"}, {"text": "NCS", "value": "/m/0282746"}, {"text": "Trustwave", "value": "/m/0n3xjf5"}, {"text": "Ensign InfoSecurity", "value": "/g/11g4jhymjr"}, {"text": "HCL SINGAPORE PTE. LTD.", "value": "/g/11fy25ngsv"}, {"text": "Horangi", "value": "/g/11fm41wdh3"}, {"text": "LINKBYNET", "value": "/g/11f00s44gb"}, {"text": "NTT", "value": "/m/05mybp8"}, {"text": "RECRUIT EXPRESS PTE LTD", "value": "/g/11g706hzhq"}, {"text": "Randstad", "value": "/m/08pt1z"}, {"text": "Randstad Singapore", "value": "/g/11g70b50mr"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "UBS", "value": "/m/031rxp"}, {"text": "Xcellink Pte Ltd", "value": "/g/11c73prcqy"}, {"text": "Alight", "value": "/g/11fj9r012s"}, {"text": "Avanade", "value": "/m/094456"}, {"text": "Avensys Consulting", "value": "/g/11g7022gjf"}, {"text": "CBRE", "value": "/m/090r7m"}, {"text": "Golder", "value": "/m/02qx9bq"}, {"text": "Hitachi Solutions", "value": "/g/121lyvj9"}, {"text": "IBM", "value": "/m/03sc8"}, {"text": "Marsh & McLennan", "value": "/m/053rw"}, {"text": "Mott MacDonald", "value": "/m/043l4j"}, {"text": "NTT Ltd.", "value": "/m/01c3fq"}, {"text": "Qualtrics", "value": "/m/080nnft"}, {"text": "SAP", "value": "/m/01pf4l"}, {"text": "Techcom Solutions Pte Ltd", "value": "/g/11c73vztx3"}, {"text": "Turner & Townsend", "value": "/m/0cfy6xp"}, {"text": "Thatz", "value": "/g/11dxpx4g1l"}]}]}