{"search_metadata": {"id": "60827e2579627cfe7346d25e", "status": "Success", "json_endpoint": "https://serpapi.com/searches/678e4c06e7cae440/60827e2579627cfe7346d25e.json", "created_at": "2021-04-23 07:58:29 UTC", "processed_at": "2021-04-23 07:58:29 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28product+manager%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=0", "raw_html_file": "https://serpapi.com/searches/678e4c06e7cae440/60827e2579627cfe7346d25e.html", "total_time_taken": 2.05}, "search_parameters": {"q": "(product manager) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "0"}, "jobs_results": [{"title": "Product Manager", "company_name": "Cargobase", "location": "Singapore (+1 other)", "via": "via LinkedIn", "description": "Cargobase is looking for a Product Manager who can help us sustain and grow our enterprise platform.\n\nCargobase, is the platform for on-demand logistics, and hard at work disrupting the international freight community. Our team of talented engineers and logisticians has been inventing smart ways for our clients to buy, manage and track international freight. It's exciting times at Cargobase. We are growing fast and have some of the largest companies in the world already using our technology.\n\nAre you a product visionary who can translate any kind of improvement opportunity into actionable user stories - with a real focus on a smooth User Experience? Join us!\n\nWork hard, play hard: our perks include an annual fitness reimbursement, flexible working arrangements, TGIF drinks, and of course a fun working environment!\n\nUnfortunately, due to the effects of the COVID-19 pandemic, we are currently only looking for individuals that are already based in Singapore.\n\nResponsibilities\n• Translate... (customer) feedback into bite-sized user stories for the product team to work on.\n• Prototype / mockup platform functionality.\n• Define and nurture improvement roadmaps and initiatives.\n• Manage overall platform improvements and track progress.\n• Actively participate in design decisions to keep our platform future-proof.\n\nRequirements\n• At least 4 years in a product-oriented role, where you translated ambitions into reality.\n• Experience in gathering and analysing product usage statistics.\n• Experience in defining and managing technical product roadmaps.\n• A Bachelors Degree in a related field.\n• You must be in Singapore and available to work from our office in Katong.\n\nIs a plus\n• Experience in working in an ISO 27001 certified organisation.\n• Experience in working in co-located Agile teams.\n• Experience with client-side frameworks (Bootstrap, jQuery, React).\n\nWe offer\n• Competitive compensation.\n• A positive no-nonsense work environment.\n• Flexible working arrangements.\n• Passionate colleagues", "extensions": ["18 hours ago", "Full–time"], "detected_extensions": {"posted_at": "18 hours ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9kdWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJDYXJnb2Jhc2UiLCJjb21wYW55X21pZCI6Ii9nLzExZHhwcGZzam4iLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJlVEZ6NXBJdF9FWGpKU2ltQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VW5oTk5FeGFRWGQ2VlV0c2JsVmhOSGM1WDBac2JrRXdUMDlyWlhKTk1WaDRUVUZQVjNGU01rbzNUSFJhZUV3NVYycFVlWEJDVkVsTGNYQkxhbkJ3ZGw5MVMwdFZWMWwwWjJOeVoyOTNNMWxCTldGU2NERTRSM1JOU1hobWJXRjRiemw1ZVhGcVFqUkVTSEk1V2kxUlVGbzJVRkZPU2pBNWMxSTFNbE5EZDJsd09DMXlRV0ZJUzJwSVYxVnVTbkZmUldaUGVWUmFOVEpoVVVaM0VoWktNelpEV1VsaVgwRnZWRmQwVVdKdk1uRkViME5SR2lKQlQwMVpVbmRDTWpaelUwRnhPWG8wUTJKd1dtNW5ibmRWWm14TllVZExUbTVuIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL3NnLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvcHJvZHVjdC1tYW5hZ2VyLWF0LWNhcmdvYmFzZS0yNTE1NTQ4NDYyP3JlZklkPWY4ODdkYTE5LTA5MDAtNGFlMC04ZGZmLWEwOTlhMjI3M2NiNlx1MDAyNnRyYWNraW5nSWQ9MUZQenRSeWRFa05BdE5KZzhyNG5DdyUzRCUzRFx1MDAyNnBvc2l0aW9uPTE4XHUwMDI2cGFnZU51bT0wXHUwMDI2dHJrPXB1YmxpY19qb2JzX2pvYi1yZXN1bHQtY2FyZF9yZXN1bHQtY2FyZF9mdWxsLWNsaWNrXHUwMDI2dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Product Manager", "company_name": "PAYMENT OPTIONS PTE. LTD.", "location": "Singapore (+1 other)", "via": "via LinkedIn", "description": "Job Description\n\nAt Payment Options Pte Ltd, we’re proud to offer innovative products that meet the needs and wants of our customers. To help us continue to grow our offerings, we’re in search of an experienced product manager to lead our multi-disciplinary development team. As an ideal candidate, you will have a keen eye for gaps in consumer product offerings and the innovative mindset to fill them. You’re a highly skilled market analyst with a proven ability to strategize the full lifecycle of product production — from conception through release. You may already be a confident leader who has experience guiding cross-functional teams in the successful creation of products that improve consumer experience and grow market share.\n\nObjectives Of This Role\n• Drive the product and business-planning process across cross-functional teams of the company\n• Analyze consumer needs, current market trends, and potential partnerships from an ROI and build vs. buy perspective\n• Assess current... competitor offerings, seeking opportunities for differentiation\n• Analyze product requirements and develop appropriate programs to ensure they’re successful achieved\n• Develop, implement, and maintain production timelines across multiple departments\n• Appraise new product ideas and strategize appropriate to-market plans\n\nResponsibilities\n• Thorough analysis on existing system, create end to end Business and Functional Requirement documentation, business use cases, identify and document Risk and QA scope, and ROI\n• Good presentation skill to internal and external stakeholders, create status reports with metrics to management, able to communicate effectively\n• Good in product management, multi-task management, vendor management, negotiation, coordination, track and deliver daily tasks\n• Being pro-active, quick self-learner, able to work independently with very less support, deliver taking ownership at the earliest\n• Review and provide input to development design document, QA documents, select best suitable SDLC for various projects\n• Product Manager with Business Analyst experience in ETL, Business Intelligence reports, API, App and web-based application\n• Good in payment domain knowledge, motivated to learn new modules and take up more responsibilities\n• Expected to work as an individual contributor and manage internal and external development and QA team to support their deliverables\n• Certification related to Product Management, Business Analyst, QA and experience working in startup is a plus.\n\nQualifications\n• Bachelor’s degree in product design or engineering\n• Exceptional writing and editing skills combined with strong presentation and public speaking skills", "extensions": ["12 hours ago", "Full–time"], "detected_extensions": {"posted_at": "12 hours ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9kdWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJQQVlNRU5UIE9QVElPTlMgUFRFLiBMVEQuIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJUSzl6NmhzQzh5d2JmS3hjQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExpbmtlZEluIiwibGluayI6Imh0dHBzOi8vc2cubGlua2VkaW4uY29tL2pvYnMvdmlldy9wcm9kdWN0LW1hbmFnZXItYXQtcGF5bWVudC1vcHRpb25zLXB0ZS1sdGQtMjUxNTgwNjA2MT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Product Manager", "company_name": "ITFORTE STAFFING SERVICES PRIVATE LTD", "location": "Singapore", "via": "via Jobs", "description": "Required Skills Our client is a leading business service provider in Singapore. The company is looking for an experienced and full-time Product Manager for onsite role in Singapore. Key Job Responsibilities - Ensures completion of documentations and filings to facilitate software development. - Continuously finds means and ways to improve operations, streamline work processes and work cooperatively and jointly with various users' departments to provide quality service. - For smaller projects, double hat as Product Manager with following responsibilities - Create project status report and other communication materials - Craft project proposal to secure project funding and justify resource allocations - Manage project scope and stakeholders expectations - Issue escalation to the right people in timely manner - Maintain and continuously refine Product Backlog - Maintain Project RAID Log and follow up on action items - Work with user experience designers (UXDs) and business users to plan... for UAT, coordinates and monitor progress and acceptance of UAT. - Ensures completion of documentations and filings to facilitate software development. - Continuously finds means and ways to improve operations, streamline work processes and work cooperatively and jointly with various users' departments to provide quality service. Key Skills/Qualifications - Degree or Diploma in Computer Science, Computer or Electronics Engineering, Information Technology or related disciplines - Work with user experience designers (UXDs) and business users to plan for UAT, coordinates and monitor progress and acceptance of UAT. - More than 6 years of business analyst experience in software development projects - Experiences with web-based and business process software systems implementation - Good written and verbal communication, including minute taking and technical writing skills - Possess business case and user-stories development skills - Ability to work effectively and independently under pressure, meet deadlines, multitask and to prioritize tasks effectively - Motivated to learn new skills and technologies - Highly meticulous and tenacious, follow up with things to closure - Experience with Agile project methodology (Scrum / Extreme Programming) and UX development environment will be an added advantage - Experience with focus group and workshop facilitation will be an added advantage - Experience with Confluence, JIRA and Balsamiq will be an added advantage - Experience with BPM modelling techniques and methods will be an added advantage - Certified Scrum Master or Certified Product Owner and/or Certified Business Analysis Professional will be an added advantage", "extensions": ["2 days ago", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9kdWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJJVEZPUlRFIFNUQUZGSU5HIFNFUlZJQ0VTIFBSSVZBVEUgTFREIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJodUoxQVZsZVpfN3hZbmV0QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnMiLCJsaW5rIjoiaHR0cHM6Ly9zZy5maWRhbnRvLmNvbS9qb2JzL2pvYi1vcGVuaW5nL2ZpcnN0bGluZS1zdXBlcnZpc29ycy1vZi1wcm9kdWN0aW9uLWFuZC1vcGVyYXRpbmctd29ya2Vycy9wcm9kdWN0LW1hbmFnZXItMjc3NDY2NDQxP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "CFS Product Development & Client Solutions Product Manager", "company_name": "Citi", "location": "Singapore", "via": "via Laimoon.com", "description": "Job Purpose\n• Product Development across the range of Custody & Fund Services products within APAC, leading initiatives for the development and integration of new or enhanced products and services in support of both the CFS Product Strategy or to meet specific client needs.\n• Solutioning for complex client requirements from analysis to deployment; particularly where technical development, operating model change and cross CFS product solutioning is required.\n• Actively look for opportunities to provide improved products, services and client experiences through innovative enhancement and integration of existing core CFS products.\n• Contribute to the regional CFS Innovation and CFS Product strategy and in particular ensuring that the specific needs of APAC clients across all markets and sectors are considered.\n• Employ a client-focused strategic approach in developing businesses cases for new and enhanced service offerings in the marketplace through in-depth analyses of client segments... competitive landscape, and industry environment.\n• Oversees product governance process through effective documentation, project management, stakeholder engagement, approvals/signoffs, and internal communications.\n• Provide expert support for the resolution of issues and challenges in support of clients where CFS Product intervention is required and desirable\n• Drive the development of innovative product solutions for existing clients and prospects and provide specialist input into responses to client RFPs and the CFS sales strategy.\n• Lead engagement with Implementations to ensure appropriate adaptation to on-boarding processes for new products and services\n• Lead engagement with Operations in the refinement/improvement of regional and global Target Operating Model in support of strategic initiatives.\n\nKey Responsibilities\n• Leading strategic and tactical product development projects and initiatives in support of Custody & Funds Services product expansion initiatives;\n• Responsible for leading the design and implementation cross-product client solutions and managing these through the full product development lifecycle.\n• Responsible for ensuring that all initiatives are managed with appropriate governance and project management disciple;\n• Responsible for ensuring that all new product initiatives obtain all required internal approvals as defined in the New Product approvals process;\n• Work directly with sales and CEs in development/refinement of sales strategy and sales material in support of new product & service enhancements;\n• Provide specialist CFS product support for client engagements and sales pitches;\n• Review and update of CFS Product material for Clients as well as internal documentation including Product Catalogues; RFP responses;\n• Participate and provide thought leadership in relevant industry and working groups;\n• Support market advocacy and best practice initiatives\n\nExperience\n• Prior experience of one or more Custody and Fund Services products essential.\n• Custody/Fund Accounting /Transfer Agency/Middle Office experience highly desirable\n• Minimum 7-12 years' experience\n\nSkills\n• BS/BA degree required\n• Ability to deliver to a high standard under extreme client relationship/ time pressure\n• Self-starter, good problem solver, results oriented\n• Possesses strong data and process analytical skills\n\nJob Family Group:\nProduct Management and Development\n\nJob Family:\nProduct Management\n\nTime Type:\nFull time\n\nCiti is an equal opportunity and affirmative action employer.\n\nQualified applicants will receive consideration without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.\n\nCitigroup Inc. and its subsidiaries (\"Citi\") invite all qualified interested applicants to apply for career opportunities. If you are a person with a disability and need a reasonable accommodation to use our search tools and/or apply for a career opportunity review Accessibility at Citi .\n\nView the \" EEO is the Law \" poster. View the EEO is the Law Supplement .\n\nView the EEO Policy Statement .\n\nView the Pay Transparency Posting Technology", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDRlMgUHJvZHVjdCBEZXZlbG9wbWVudCBcdTAwMjYgQ2xpZW50IFNvbHV0aW9ucyBQcm9kdWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJDaXRpIiwiY29tcGFueV9taWQiOiIvbS8wMWRmYjYiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiIyRWFJM1R6VHVlNjBOX2RIQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFc3NCQ293QlFVNVZYMDV4VkRsbVoyWnRabEZGY0ZZNWVtRnJielZMZFhwTVpYQTRYMGs1V0ZRd1RHRm1OMFEyV0U1V05VOTVVbUp4U2xWd05uaFFXWGN6TUhVM01WTlZhMjlWVm5FM01XNUlhMjF0WTJwblRtWkdhV0ZvVVhJMVQyRTBkREJpYjNGcWNWSnhRbTUxWmpsTE5YSjBaR1ZLY1d4YVRHRmxXRkpzTjBKT01FRlpOMEZIT0dwSVlVVnlUMk1TRmtvek5rTlpTV0pmUVc5VVYzUlJZbTh5Y1VSdlExRWFJa0ZQVFZsU2QwRnVZVTB3VnpSRWN6TkplVWxWWkV0T2NWWlhiazU0ZWxsTU1HYyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzIzIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExhaW1vb24uY29tIiwibGluayI6Imh0dHBzOi8vam9icy5sYWltb29uLmNvbS9qb2JzL2V4dGVybmFsdmlldy8yNjEwOTMxOD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Product Manager - Singapore", "company_name": "Cargobase Pte Ltd", "location": "Singapore", "via": "via LinkedIn", "description": "Job Description\n\n& requirements\nCargobase is looking for a Product Manager who can help us sustain and grow our enterprise platform.\n\nCargobase, is the platform for on-demand logistics, and hard at work disrupting the international freight community. Our team of talented engineers and logisticians has been inventing smart ways for our clients to buy, manage and track international freight. It's exciting times at Cargobase. We are growing fast and have some of the largest companies in the world already using our technology.\n\nAre you a product visionary who can translate any kind of improvement opportunity into actionable user stories - with a real focus on a smooth User Experience? Join us!\n\nWork hard, play hard: our perks include an annual fitness reimbursement, flexible working arrangements, TGIF drinks, and of course a fun working environment!\n\nUnfortunately, due to the effects of the COVID-19 pandemic, we are currently only looking for individuals that are already based in... Singapore.\n\nResponsibilities\n• Translate (customer) feedback into bite-sized user stories for the product team to work on.\n• Prototype / mockup platform functionality.\n• Define and nurture improvement roadmaps and initiatives.\n• Manage overall platform improvements and track progress.\n• Actively participate in design decisions to keep our platform future-proof.\n\nRequirements\n• At least 4 years in a product-oriented role, where you translated ambitions into reality.\n• Experience in gathering and analysing product usage statistics.\n• Experience in defining and managing technical product roadmaps.\n• A Bachelors Degree in a related field.\n• You must be in Singapore and available to work from our office in Katong.\n\nIs a plus\n• Experience in working in a ISO 27001 certified organisation.\n• Experience in working in co-located Agile teams.\n• Experience with client-side frameworks (Bootstrap, jQuery, React).\n\nWe offer\n• Competitive compensation.\n• A positive no-nonsense work environment.\n• Flexible working arrangements.\n• Passionate colleagues.\n\nRequired Skills\n\nProduct Management SaaS Product Design", "extensions": ["2 days ago", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9kdWN0IE1hbmFnZXIgLSBTaW5nYXBvcmUiLCJjb21wYW55X25hbWUiOiJDYXJnb2Jhc2UgUHRlIEx0ZCIsImNvbXBhbnlfbWlkIjoiL2cvMTFmeTI0MG54bSIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Ik9FZGM2RFRPUDk4Qi1ucThBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2WUJDcmNCUVU1VlgwNXhVMHRVZDJ4bWRGUllUbXQyZGt4RFluVmhTVlp5TURoWFdXOUdVMEY0ZFhaT1NEVnBZa2RHWlVwTFJrSkhPSE50WTJsRmFIUk1UVnBMYlU5SVlWOTBOSHBwTkZacVdsQmlXVk56T1dKME9IZEVNRFV4TjBSWVMxRlhOM0pPUzFsTFExbG5ia0ZuUldsemIyUlJlV0pZVW1WemVDMUdhbWg0ZDJSS1UyVmxNRU5tVlhGNE1URnFUbVJzVmpWQ00zYzVOVGxhVmpsWk9EUXlTVVp1VkVOWmJIZGhVRlZEZFhSSlRtWlVlbkF0YVRkVkVoWktNelpEV1VsaVgwRnZWRmQwVVdKdk1uRkViME5SR2lKQlQwMVpVbmRFYm5NMVVucFRjMmRyVlhKc09XWTFVbXBYUTBaSmFuVlpOSFZuIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMzAiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGlua2VkSW4iLCJsaW5rIjoiaHR0cHM6Ly9zZy5saW5rZWRpbi5jb20vam9icy92aWV3L3Byb2R1Y3QtbWFuYWdlci1zaW5nYXBvcmUtYXQtY2FyZ29iYXNlLXB0ZS1sdGQtMjUxNDA3MTAyNj9yZWZJZD1lYTU4N2UzNS05MTkwLTQ2NjktYTVmOS02OGRkODZhZWU5NTZcdTAwMjZ0cmFja2luZ0lkPTdsbTVzZ0dkMEZrUEE3ZHlmVDlFUGclM0QlM0RcdTAwMjZwb3NpdGlvbj0xOFx1MDAyNnBhZ2VOdW09MFx1MDAyNnRyaz1wdWJsaWNfam9ic19qb2ItcmVzdWx0LWNhcmRfcmVzdWx0LWNhcmRfZnVsbC1jbGlja1x1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Product Manager", "company_name": "Techgig", "location": "Singapore", "via": "via Mendeley", "description": "About Job\n\nCTC Undisclosed Job Location Singapore Experience 6 - 9 yrs\n\nDescription\n\nRequired Skills: Our client is a leading business service provider in Singapore. The company is looking for an experienced and full-time Product Manager for onsite role in Singapore.\n\nKey Job Responsibilities:\n\n- Ensures completion of documentations and filings to facilitate software development.\n\n- Continuously finds means and ways to improve operations, streamline work processes and work cooperatively and jointly with various users' departments to provide quality service.\n\n- For smaller projects, double hat as Product Manager with following responsibilities\n\n- Create project status report and other communication materials\n\n- Craft project proposal to secure project funding and justify resource allocations\n\n- Manage project scope and stakeholders expectations\n\n- Issue escalation to the right people in timely manner\n\n- Maintain and continuously refine Product Backlog\n\n- Maintain Project RAID Log and... follow up on action items\n\n- Work with user experience designers (UXDs) and business users to plan for UAT, coordinates and monitor progress and acceptance of UAT.\n\n- Ensures completion of documentations and filings to facilitate software development.\n\n- Continuously finds means and ways to improve operations, streamline work processes and work cooperatively and jointly with various users' departments to provide quality service.\n\nKey Skills/Qualifications:\n\n- Degree or Diploma in Computer Science, Computer or Electronics Engineering, Information Technology or related disciplines\n\n- Work with user experience designers (UXDs) and business users to plan for UAT, coordinates and monitor progress and acceptance of UAT.\n\n- More than 6 years of business analyst experience in software development projects\n\n- Experiences with web-based and business process software systems implementation\n\n- Good written and verbal communication, including minute taking and technical writing skills\n\n- Possess business case and user-stories development skills\n\n- Ability to work effectively and independently under pressure, meet deadlines, multitask and to prioritize tasks effectively\n\n- Motivated to learn new skills and technologies\n\n- Highly meticulous and tenacious, follow up with things to closure\n\n- Experience with Agile project methodology (Scrum / Extreme Programming) and UX development environment will be an added advantage\n\n- Experience with focus group and workshop facilitation will be an added advantage\n\n- Experience with Confluence, JIRA and Balsamiq will be an added advantage\n\n- Experience with BPM modelling techniques and methods will be an added advantage\n\n- Certified Scrum Master or Certified Product Owner and/or Certified Business Analysis Professional will be an added advantage", "extensions": ["9 days ago", "Full–time"], "detected_extensions": {"posted_at": "9 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9kdWN0IE1hbmFnZXIiLCJjb21wYW55X25hbWUiOiJUZWNoZ2lnIiwiY29tcGFueV9taWQiOiIvZy8xMWM3M2Z4Z3d0IiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiN29kVTN5NFhUbFd1aEt2bEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFUzcHZZMHMyYkVJMlZVMXdiRVZQYUY5bGFrTTVlRkpWV0doV1ZGOW9aSGR1UlZwTmFrVlFSbEZ4WlVzdE9VZDJNR3RpTTFWV2IycENXSGN0Vmt0TlpVd3RUemt4V1dSWE4zSlROMGRpUlhaVFpFOVNUWGxYUzFOVVdsUk5PR2RpTFZacFgwdHVMVFZLVXpZM1UwaHBaWE5VTm1sTk5UZHVkR1pLZURaeE1HMWlTREYyTjJGbU5EVkphMnR0YVRNMmVrUmFlVmd5ZFhjMFNtVm5FaFpLTXpaRFdVbGlYMEZ2VkZkMFVXSnZNbkZFYjBOUkdpSkJUMDFaVW5kQ04ybzJiVlJKVEVaYWQyMDFaa28yYUZscVFVeExZV3M0WmxSQiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzM3IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1lbmRlbGV5IiwibGluayI6Imh0dHBzOi8vd3d3Lm1lbmRlbGV5LmNvbS9jYXJlZXJzL2pvYi9wcm9kdWN0LW1hbmFnZXItMTMxMTQzMz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior Product Manager, Compliance Platform", "company_name": "Paypal", "location": "Singapore", "via": "via Association Of Certified Fraud Examiners (ACFE)", "description": "Who we are\nFueled by a fundamental belief that having access to financial services creates opportunity, PayPal (NASDAQ: PYPL) is committed to democratizing financial services and empowering people and businesses to join and thrive in the global economy. Our open digital payments platform gives PayPal's 325 million active account holders the confidence to connect and transact in new and powerful ways, whether they are online, on a mobile device, in an app, or in person. Through a combination of technological innovation and strategic partnerships, PayPal creates better ways to manage and move money, and offers choice and flexibility when sending payments, paying or getting paid. Available in more than 200 markets around the world, the PayPal platform, including Braintree, Venmo and Xoom, enables consumers and merchants to receive money in more than 100 currencies, withdraw funds in 56 currencies and hold balances in their PayPal accounts in 25 currencies.\n\nWhen applying for a job you... are required to create an account, if you have already created an account - click Sign In.\n\nCreating an account will allow you to follow the progress of your applications. Our system does have some requirements that will help us process your application, below are some guidelines for creation of your account:\n• Provide full legal First Name/Family Name - this is important for us to ensure our future hires have the right system set up.\n• Please Capitalize first letter of your First and Last Name.\n• Please avoid using fully capitalized text for your First and/or Last Name.\n• NOTE: If your name is hyphenated or has multiple capitalization, please use the same format as your government ID.\n\nJob Description Summary:\nPayPal's Global Compliance Platform team is hiring a Senior Product Manager to drive the next generation RegTech solutions to meet PayPal's global regulatory needs. The Senior Product Manager will be responsible to lead problem & solution discovery across various geographies to devise scalable and flexible product solutions. As a Product Manager in this space, you will manage the end to end development of complex features that will make Paypal compliant with the best customer experience. You will partner with technology team to scale the existing infrastructure and collaborate with cross functional stakeholders from marketing, operations, policy, legal, sales to effectively understand business needs, devise solutions and communicate the value proposition of product roadmap.\nJob Description:\nGeneral Responsibilities\n• Lead the discovery phases of new feature rollouts with a set of cross functional stakeholders from various business teams, engineering, and other product managers across the organization.\n• Evaluate trade-offs amongst multiple solutions and influence roadmap for one or more service/feature areas based on technical feasibility, business timelines and customer impact.\n• Articulate and write product strategies for Product, Marketing, Operations and/or BU teams to achieve alignment and support as necessary for new feature rollouts.\n• Author product requirements, epics, user stories across multiple complex and cross-functional feature/ service areas and create flow documents to ensure solutions are architected to cover Business needs and requirements.\n• Scope and prioritize activities based on business and customer impact and work with implementation teams to deliver multi sprint roadmaps while optimizing time to market.\n• Devise strategy and support product launch and Go-to-Market plans.\n• Establish deep understanding of platform and technology in product area to create scalable & flexible solutions.\n• Recommend new processes, workarounds, and flow changes to ensure constant improvement and evolution of the Consumer experience.\n• Conduct market research , gather feedback from internal regional & operations teams and analyze existing product flows, contact reasons and net-promoter-scores to identify experience gaps.\n• Viewed as a service or product expert for a single product/service area or as having broad experience that is helpful on new initiatives.\n\nJob Requirements\n• 8+ years of related professional experience or Master's Degree and 6+ years of experience.\n• Skilled at working with cross functional groups and matrix organizations in multiple geographies\n• Ability to multitask and manage multiple projects simultaneously.\n• Demonstrated data driven approach to draw insights and influence decisions.\n• Outstanding communication and organization skills.\n• Proven ability to deliver on a new product challenge quickly and valuably.\n• Thrives in an environment of continuous change and complexity.\n• \"Can do\" attitude, team player, fun, energetic personality, works well under pressure.\n• Successfully negotiates and defends his or her position.\n• MBA preferred\n\nSubsidiary:\nPayPal\nTravel Percent:\n0\nPrimary Location:\nSingapore, Central Singapore, Singapore\n\nAdditional Locations:\n\nWe're a purpose-driven company whose beliefs are the foundation for how we conduct business every day. We hold ourselves to our One Team Behaviors which demand that we hold the highest ethical standards, to empower an open and diverse workplace, and strive to treat everyone who is touched by our business with dignity and respect. Our employees challenge the status quo, ask questions, and find solutions. We want to break down barriers to financial empowerment. Join us as we change the way the world defines financial freedom.\n\nPayPal provides equal employment opportunity (EEO) to all persons regardless of age, color, national origin, citizenship status, physical or mental disability, race, religion, creed, gender, sex, pregnancy, sexual orientation, gender identity and/or expression, genetic information, marital status, status with regard to public assistance, veteran status, or any other characteristic protected by federal, state or local law. In addition, PayPal will provide reasonable accommodations for qualified individuals with disabilities. If you are unable to submit an application because of incompatible assistive technology or a disability, please contact us at paypalglobaltalentacquisition@paypal.com ", "extensions": ["22 days ago", "Full–time"], "detected_extensions": {"posted_at": "22 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgUHJvZHVjdCBNYW5hZ2VyLCBDb21wbGlhbmNlIFBsYXRmb3JtIiwiY29tcGFueV9uYW1lIjoiUGF5cGFsIiwiY29tcGFueV9taWQiOiIvZy8xMjJzOTFfNSIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IldoQ3BaSmdEU25ZdFNzdGZBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVzc0JDb3dCUVU1VlgwNXhVbXhEUVZNeWFVUmtPWGw1UVY5eFRYZHliR1l0YUZJd1VGTjNZM0pJVkVkSFoyaEZZVWN0VEVGUFEyOU9hM1pwVmxoTk9XOHpVVVJUTldaT1NrbHpiRzFQY1ZKSFl5MTVWeTB5VkVoUWVsZzBNVXd4Y1dkT1JVVk1jMkZMTm1WR1oxYzNlVTFtY0dWWWRWbzBaMGQ0ZFVONU0waGhVV014V0ZsNFZWaHBWbEIzYmw5VVFYb1NGa296TmtOWlNXSmZRVzlVVjNSUlltOHljVVJ2UTFFYUlrRlBUVmxTZDBOSWQyc3RTV1ZNVTIxeGRFZ3liRFY2T0VWc1RISlpWbGhEZDJjIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNDUiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQXNzb2NpYXRpb24gT2YgQ2VydGlmaWVkIEZyYXVkIEV4YW1pbmVycyAoQUNGRSkiLCJsaW5rIjoiaHR0cHM6Ly9jYXJlZXJzLmFjZmUuY29tL2pvYi9zZW5pb3ItcHJvZHVjdC1tYW5hZ2VyLWNvbXBsaWFuY2UtcGxhdGZvcm0vNTYzOTczMDAvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Product Manager – based in Singapore", "company_name": "Kerry Consulting Pte Ltd", "location": "Singapore (+1 other)", "via": "via Jobs", "description": "Job Description :DescriptionA Global leader in Electronic Materials is looking for a Product manager who will be in charge of driving the business strategies as well as development and execution of product line strategies and related business plan linked to key corporate objectives.Responsibilities• Establish strong working relationships with key partners (Sales, Procurement, Supply Chain, Technology, etc), and ensure appropriate support and resources to successfully execute business plans.• Demonstrate the leadership on coordinating/leading the collaboration amongst different functions to complete tasks, resolve issues, and take the lead for the revenue growth.• Develop the product strategies and tactic plans. Communicate with key functional partners and execute the plan to achieve revenue and profitability targets for both the near and long terms.• Lead and drive the critical initiative projects for business growth• Develop and execute the long-range plan for the EM business... including key pivotal initiatives and a tactical plan for execution.Requirement• 10+ years of sales and business management, or related product / project management experience, semiconductor or electronic materials market is strongly preferred• Proven track record to influence and lead people across geographies, time-zones and organizational levels and drive multiple projects across different countries simultaneously and deliver to deadline and budget targets• Be able to self-start, quick-learn, and provide insights with strong critical thinking and sales marketing analysis skills• Strong technology perspective particularly related to semiconductor materials through prior experience and/or academic training (engineering, science or equivalent)• Having B.S. in Chemical Engineering or Chemistry is preferred.To ApplyTo apply, please submit your resume (in MS Word format) to Michelle Lee at ml@kerryconsulting.com, quoting the job title and reference number ML 20119", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9kdWN0IE1hbmFnZXIg4oCTIGJhc2VkIGluIFNpbmdhcG9yZSIsImNvbXBhbnlfbmFtZSI6IktlcnJ5IENvbnN1bHRpbmcgUHRlIEx0ZCIsImNvbXBhbnlfbWlkIjoiL2cvMTFjNzN2dHpjOCIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6ImpIYVc4M1ZPd3RxbGNDNDZBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVvc0NDc3dCUVU1VlgwNXhVak5mWVZCaVNtZHpWVlF5U1RCalRVVXRaRUYwV0dSc05rNUZSek5UY0dwaGNsbDVSbEptWlMwM1JYWnRSMlpzTW01bGNFdzNZbFJyZVU1U2JYTlhabDh5WDBSSmFETjZTbTVLV1RaeVMzaFdUaTB0ZG5aM01qSXRZM0Y2VTJkT1prUXhjVTFYUzFkaGNrVTBVWEpDY1dsMk1YaDBOMkpITkZsdlVVVmtWMFZSYW14emFHNDRRekkxVjI1U1dsaG9kbFo2ZEUxWlNIaEhTV3RxWkdaR2VsZEthMlJoUkVSa1NsQm5XV0ZhTkROa2VGSjZZME56VXpGMWNTMDRibVJUTTNaUWJESnBFaFpLTXpaRFdVbGlYMEZ2VkZkMFVXSnZNbkZFYjBOUkdpSkJUMDFaVW5kRGNrTnBUMnN3UzAxWFYxOUxaazAxVURGbk4zcDVjRk4wV1ZabiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzUxIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnMiLCJsaW5rIjoiaHR0cHM6Ly9zZy5maWRhbnRvLmNvbS9qb2JzL2pvYi1vcGVuaW5nL21hbmFnZXJzLWFsbC1vdGhlci9wcm9kdWN0LW1hbmFnZXItYmFzZWQtaW4tc2luZ2Fwb3JlLTI3Nzg0MjcwND91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "VP/AVP, Digital Product Manager, Consumer Banking Group", "company_name": "DBS Bank Limited", "location": "Singapore", "via": "via Laimoon.com", "description": "Business Function\n\nAs the leading bank in Asia, DBS Consumer Banking Group is in a unique position to help our customers realise their dreams and ambitions. As a market leader in the consumer banking business, DBS has a full spectrum of products and services, including deposits, investments, insurance, mortgages, credit cards and personal loans, to help our customers realise their dreams and aspirations at every life stage. Our financial solutions are not only the best in the business - they were made just right for you.\n\nKey Accountabilities\n• End to end ownership of the entire lifecycle of product features and enhancements from business and strategic value to cost vs. benefit analysis to design and development to post launch monitoring of impact.\n• Ensure that products launched meet the key revenue targets and make enhancements to achieve them.\n• Fully own the customer experience and issues and ensure high customer ratings for digibank across app & web.\n• Create a high benchmark for... product quality within the organization and inspire all teams to continuously develop best-in-class customer experience.\n• Drive product innovation & radical thinking to help exceed customer expectations of a 'digital bank'.\n\nRoles & Responsibilities\n• Drive building and launching of product features and enhancements by working with business owners, designers, developers and testers across geographies.\n• Track and monitor impact of new features and/or changes in customer journeys & use that data to continuously improve conversions.\n• Be the voice of the customer in the team to drive superior customer experience. Essentially, build features which customers love.\n• Be the voice of the product and drive product driven thinking across the organization.\n• Improve structure and ways of working to ensure we continue to deliver quality features with minimum defects and in least amount of time.\n• Identify opportunities via product for increasing revenues, reducing costs.\n\nRequirements\n• 5-7 years of experience in building, launching or managing digital consumer products\n• Demonstrated ability to pitch and present new product ideas and/or change in product strategy to senior management\n• Experience guiding and executing cross-functional initiatives to completion, while remaining hands-on\n• Proven experience in a regional role, managing multiple stakeholders and teams\n• Strong communication and interpersonal skills\n• Passionate about customer experience and product quality\n• Makes data driven decisions & and has strategic thinking skills\n• Effective in driving and building consensus internally and externally\n• Self-starter with a high energy level and entrepreneurial mindset\n• Have the ability to collaborate across multiple stakeholders and teams\n• Understands both business & technology\n• Relevant Experience (Indicate nature and extent of work experience including number of years required, if applicable)\n\nApply Now​\n\nWe offer a competitive salary and benefits package and the professional advantages of a dynamic environment that supports your development and recognises your achievements. Technology", "extensions": ["8 hours ago", "Full–time"], "detected_extensions": {"posted_at": "8 hours ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJWUC9BVlAsIERpZ2l0YWwgUHJvZHVjdCBNYW5hZ2VyLCBDb25zdW1lciBCYW5raW5nIEdyb3VwIiwiY29tcGFueV9uYW1lIjoiREJTIEJhbmsgTGltaXRlZCIsImNvbXBhbnlfbWlkIjoiL20vMDFxN241IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiSFBvRm00dmVLQmtMNGFRR0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZZQkNyY0JRVTVWWDA1eFVVTjNlRFEzUzJGRFRYWXROR0pYUW1WdlpGVnpXSHBJWTBNeFN6UldWME5wWkdoU1h6Vk5OemhTYUZSQmQwNWtka1F6Wm1SNVJ6TjJSakJXVjIwd1VVbDNUemRaT0dKc09FMXdNWEl5Wms0dFpYQmpUM293WlRWTlUyOTNiek5EVm5SMVVYVTRaVXN5V1RkVldreFFjVU5CVmxwd2NUVXdaRmRMUVVKMFVrdENhM2swVTBGRE5raHVjR0ZZTW5KWWMwcDBjV042TkRSdmFFdG5NWGR5V2tONFYyNTJZM05GU1d4RGMzWTBOSFkwRWhaS016WkRXVWxpWDBGdlZGZDBVV0p2TW5GRWIwTlJHaUpCVDAxWlVuZENNRTlGVGsxNlVtMUNNQzFHY25KallVOXZTMmMwYm1WRExVTlIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY181OCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMYWltb29uLmNvbSIsImxpbmsiOiJodHRwczovL2pvYnMubGFpbW9vbi5jb20vam9icy9leHRlcm5hbHZpZXcvMjYxMzk5NTE/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Lead Product Manager, Exchange and Financial Products", "company_name": "GEMINI", "location": "Singapore", "via": "via Jobs", "description": "The Role: Lead Product Manager, Exchange and Financial Products In this role, you'll work with leadership and project execution teams on listed derivatives products and other trading products at Gemini, helping to define the scope and objectives of projects, and working directly with engineering teams to deliver production systems. The ideal candidate is an expert cross-functional collaborator, with the ability to balance and communicate priorities across multiple internal teams. The ideal candidate can draw on domain expertise but also operate with a beginner's mind on projects to deliver compelling and at times novel derivatives and other trading products in the crypto space. Responsibilities: Work closely with engineers and internal stakeholders and use data-driven approaches to identify potential areas of improvement within the business. Collaborate closely with stakeholder groups to understand business needs and set and manage priorities. Engage in work with regulators and other... external partners related to regulated products. Regularly engage in performance analysis, specifically to analyze the successful completion of short and long-term goals. Minimum Qualifications: 5+ years of experience in product management, or equivalent experience in other roles on project teams. Note that candidates with 10+ years of experience will also be considered for this role. Proven track record of delivering production software products in an agile development environment. Excellent organizational skills, attention to detail, and proven ability to manage complex projects. Strong written and verbal communication skills, proven experience driving product and business decisions. Team-oriented and demonstrated willingness to roll up sleeves and get into the weeds of a project. Preferred Qualifications: Experience with derivatives in an exchange, brokerage, or other professional trading context. Demonstrated experience and knowledge from working in the CFTC and/or SEC regulated space. Understanding of the cryptocurrency exchange trading ecosystem and its evolution over the past 5 years is a plus. Familiarity with cryptocurrency protocol technology is a plus. Experience with financial exchange operations is a plus. Experience with automated risk management systems and clearing systems is a plus. It Pays to Work Here We take a holistic approach to compensation at Gemini, which includes: Competitive base salaries across all departments Ownership in the company via profit sharing units Amazing benefits, 401k match contribution, and flexible hours Snacks, Perks, Wellness Outings & Events Gemini is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity, or Veteran status. If you have a disability or special need that requires accommodation, please let us know", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJMZWFkIFByb2R1Y3QgTWFuYWdlciwgRXhjaGFuZ2UgYW5kIEZpbmFuY2lhbCBQcm9kdWN0cyIsImNvbXBhbnlfbmFtZSI6IkdFTUlOSSIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiT3Uwd1pwQ3g0Tkh0a1lzcUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIiwibGluayI6Imh0dHBzOi8vc2cuZmlkYW50by5jb20vam9icy9qb2Itb3BlbmluZy9tYW5hZ2Vycy1hbGwtb3RoZXIvbGVhZC1wcm9kdWN0LW1hbmFnZXItZXhjaGFuZ2UtYW5kLWZpbmFuY2lhbC1wcm9kdWN0cy0yNzc4NTA2OTk/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Management", "value": "GC18"}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Business Operations", "value": "GC06"}, {"text": "Advertising and Marketing", "value": "GC03"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Accounting and Finance", "value": "GC01"}, {"text": "Legal", "value": "GC17"}, {"text": "Farming and Outdoors", "value": "GC13"}, {"text": "Human Resources", "value": "GC15"}, {"text": "Sales and Retail", "value": "GC26"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "Product manager", "value": "product manager"}, {"text": "Manager", "value": "manager"}, {"text": "Project manager", "value": "project manager"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Development manager", "value": "development manager"}, {"text": "Director", "value": "director"}, {"text": "Manufacturing manager", "value": "manufacturing manager"}, {"text": "Marketing manager", "value": "marketing manager"}, {"text": "Plant manager", "value": "plant manager"}, {"text": "Production manager", "value": "production manager"}, {"text": "Program manager", "value": "program manager"}, {"text": "Regional", "value": "regional"}, {"text": "Senior", "value": "senior"}, {"text": "Sr. manager", "value": "sr. manager"}, {"text": "Account manager", "value": "account manager"}, {"text": "Admin manager", "value": "admin manager"}, {"text": "Affairs manager", "value": "affairs manager"}, {"text": "Assistant", "value": "assistant"}, {"text": "Brand manager", "value": "brand manager"}, {"text": "Commodity manager", "value": "commodity manager"}, {"text": "Communication", "value": "communication"}, {"text": "Customer", "value": "customer"}, {"text": "Dealer", "value": "dealer"}, {"text": "Devops engineer", "value": "devops engineer"}, {"text": "Engineering", "value": "engineering"}, {"text": "Executive", "value": "executive"}, {"text": "Product specialist", "value": "product specialist"}, {"text": "Production supervisor", "value": "production supervisor"}, {"text": "Risk manager", "value": "risk manager"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Transactional", "value": "transactional"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Internship", "value": "INTERN"}, {"text": "Part-time", "value": "PARTTIME"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Toiletries", "value": "/business/naics2007/3256"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Foods & Beverages", "value": "/business/naics2007/311"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Management", "value": "/business/naics2007/55"}, {"text": "Research", "value": "/business/naics2007/5417"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "Citi", "value": "/m/01dfb6"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "Amazon", "value": "/m/0mgkg"}, {"text": "Binance", "value": "/g/11hcz1r4wl"}, {"text": "Standard Chartered", "value": "/m/02hszk"}, {"text": "United Overseas Bank", "value": "/m/04gjd1"}, {"text": "Apple", "value": "/m/0k8z"}, {"text": "Tata Communications", "value": "/m/04338k"}, {"text": "Workato", "value": "/g/11dxpy_3xd"}, {"text": "BNY  Mellon", "value": "/m/02vps5x"}, {"text": "DBS Bank", "value": "/m/01q7n5"}, {"text": "EPAM Systems", "value": "/m/0dlnrc"}, {"text": "GVT Government Technology Agency (GovTech)", "value": "/g/11gh0528nq"}, {"text": "Grab", "value": "/m/0134c_p9"}, {"text": "Paypal", "value": "/g/122s91_5"}, {"text": "PeopleSearch Pte Ltd", "value": "/g/11c73ngn0w"}, {"text": "Randstad", "value": "/m/08pt1z"}, {"text": "Singapore Airlines", "value": "/m/015f2x"}, {"text": "TEKsystems (Allegis Group Singapore Pte Ltd)", "value": "/g/11b6g4bkv0"}, {"text": "ABBOTT LABORATORIES (SINGAPORE ) PRIVATE LIMITED", "value": "/m/09m57z3"}, {"text": "ADVANCE INTELLIGENCE PTE. LTD.", "value": "/g/11dymfkxss"}, {"text": "AXA", "value": "/m/04mn99"}, {"text": "Adecco Personnel Pte Ltd", "value": "/m/08gz46"}, {"text": "Adidas Group", "value": "/m/01jtml"}, {"text": "Aetna, a CVS Health Company", "value": "/m/0kg8x"}, {"text": "Agency for Science, Technology and Research", "value": "/m/0gmjcg"}, {"text": "Alibaba", "value": "/m/07s6ctl"}, {"text": "Argyll Scott", "value": "/g/11dxpk2374"}, {"text": "Autodesk", "value": "/m/018nm3"}, {"text": "Barry Callebaut", "value": "/m/03clky2"}, {"text": "BioMind", "value": "/g/11dymfr2l6"}, {"text": "CHUBB ASIA PACIFIC PTE. LTD.", "value": "/m/09m8xyh"}, {"text": "Cargobase", "value": "/g/11dxppfsjn"}, {"text": "Cargobase Pte Ltd", "value": "/g/11fy240nxm"}, {"text": "DKSH", "value": "/m/0dj2nh"}, {"text": "Dathena", "value": "/g/11dxprdn6y"}, {"text": "Dyson", "value": "/m/05cskg"}, {"text": "Enggsol Pte Ltd", "value": "/g/11g9mnfmm1"}, {"text": "Ethos BeathChapman", "value": "/g/11c73z0xm0"}, {"text": "Eu Yan Sang", "value": "/m/03cl9hn"}, {"text": "Flintex Consulting Pte. Ltd.", "value": "/g/11h1z41pzb"}, {"text": "GIVAUDAN SINGAPORE PTE LTD", "value": "/g/11f00wn519"}, {"text": "Goldman Sachs", "value": "/m/01xdn1"}, {"text": "GovTech Singapore", "value": "/g/11dxpkfs_6"}]}]}