{"search_metadata": {"id": "6082794796f5d740b029887c", "status": "Success", "json_endpoint": "https://serpapi.com/searches/e7a2b7d2a97d43af/6082794796f5d740b029887c.json", "created_at": "2021-04-23 07:37:43 UTC", "processed_at": "2021-04-23 07:37:43 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28solution+architect%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=40", "raw_html_file": "https://serpapi.com/searches/e7a2b7d2a97d43af/6082794796f5d740b029887c.html", "total_time_taken": 1.9}, "search_parameters": {"q": "(solution architect) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "40"}, "jobs_results": [{"title": "Solution Architect", "company_name": "GETRONICS SOLUTIONS (S) PTE LTD", "location": "Singapore (+1 other)", "via": "via MNC Jobs Singapore | MNC Jobs In Singapore", "description": "Job description:\n• Designs and delivers solutions that align with enterprise architecture standards and advance the architecture toward the target state.\n• Performs the leadership, facilitation, analysis and design tasks required to ensure that information systems are designed and evolve appropriately.\n• Works with our business groups to understand their business processes and information needs and works with other members of our informatics organization to identify and design solution options that support the business needs.\n• Creates and maintains a solution lifecycle roadmap based on gap analysis for transitioning from current to future-state, including the technology lifecycle management. Is aware and actively applies business & enterprise technology roadmaps during the design of new IT solutions.\n• Documents and maintains the solution as-is IT landscape in the Enterprise Architecture Management Tool.\n• Oversees or consults on technical architecture implementation activities... particularly for new and/or shared solutions.\n• Collaborates with the broader architecture community to ensure that the solutions align with target architectures and technology roadmaps.\n• Stays abreast of emerging technologies and trends and how to apply them to benefit the business.\n\nJob requirement:\n• Expertise in driving / enabling digital transformation (customer facing) through technologies\n• Experience in managing customer journey end-to-end is a plus.\n• Expertise in APAC digital ecosystem, especially in customer engagement perspective\n• Expertise in the commercial domain (like Sales, Marketing, Market Access, etc.). Biotech / Pharma industry and TOGAF certification is a plus.\n• Experience with Customer Identity Management. Familiar with the tool “SAP Customer Data Cloud” (Gigya) is a strong plus.\n• Experience with Micro-service Architecture design is a plus.\n• Experience with digital and/or web content management is a plus", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2x1dGlvbiBBcmNoaXRlY3QiLCJjb21wYW55X25hbWUiOiJHRVRST05JQ1MgU09MVVRJT05TIChTKSBQVEUgTFREIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJZMXAxNjd5MlVFYUxmcUVxQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1OQyBKb2JzIFNpbmdhcG9yZSB8IE1OQyBKb2JzIEluIFNpbmdhcG9yZSIsImxpbmsiOiJodHRwczovL3NnLm1uY2pvYnouY29tL2pvYnMvc29sdXRpb24tYXJjaGl0ZWN0LXNpbmdhcG9yZS0yODk5Mzg/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Solutions Architect", "company_name": "Databricks", "location": "Singapore", "via": "via Bayt.com", "description": "Mission\n\nSolutions Architects at Databricks are in charge of leading the adoption of Apache Spark and Databricks. They engage with the developer community to train them and evangelize Spark, meet with customers to suggest solutions that they can build with the technology, and see customers through implementing and troubleshooting production systems. Every Solutions Architect is expected to become an Apache Spark expert and to be excellent at interacting with Spark and Databricks users. At Databricks we work on some of the most complex distributed processing systems and our customers challenge us with interesting new big-data processing requirements. As the complexity grows for both us and our customers, we are looking to our Solutions Architects to fully understand the architecture that powers our product and how it can be implemented. Our Solutions Architects not only work with technologies such as Apache Spark, Hadoop and Kafka but they also recommend product features and contribute... to open source community. This is a pre-sales and post-sales position where you will work with customers to identify use cases for Databricks, and see them through using the product. Our customers are highly technical, so you must be too.\n\nOutcomes\n• Provide technical leadership in a pre-sales and post-sales capacity for our customers to support successful understanding, evaluation and adoption of Databricks\n• Consult on architecture and design, bootstrap, and/or implement strategic customer projects\n• Build references architectures, how-tos, and demo applications for customers\n• Provide escalated level of support for critical customer operational issues\n• Architect, implement, and/or validate integrations with 3rd party applications\n• Evangelize Spark and Databricks across developer community through meetups and conferences\n• Traveling to Customers\n• Become an Apache Spark expert\n\nCompetencies\n• Outstanding verbal and written communication skills\n• Excellent presentation and whiteboarding skills\n• Comfortable with traveling to multiple customer locations\n• 3-5 years in customer-facing pre-sales, technical architecture or consulting role\n• Ability to design and architect distributed data systems\n• Comfortable writing code in either Python, Scala or Java\n• Experience with Big Data Technologies such as Spark, Hadoop, Kafka, and Storm\n• [Desired] Experience working with open source and/or AWS/cloud\n\nBenefits\n• Medical, dental, vision\n• Gym reimbursement\n• Employee referral bonus program\n• Awesome coworkers\n\nAbout Databricks\n\nDatabricks' mission is to accelerate innovation for its customers by unifying Data Science, Engineering and Business. Databricks' founders started the Spark research project at UC Berkeley that later became Apache Spark. Databricks provides a Unified Analytics Platform powered by Apache Spark for data science teams to collaborate with data engineering and lines of business to build data products. Users achieve faster time-to-value with Databricks by creating analytic workflows that go from ETL and interactive exploration to production. The company also makes it easier for its users to focus on their data by providing a fully managed, scalable, and secure cloud infrastructure that reduces operational complexity and total cost of ownership. Databricks, venture-backed by Andreessen Horowitz, NEA and Battery Ventures, among others, has a global customer base that includes Viacom, Shell and HP. For more information, visit www.databricks.com.Apache, Apache Spark and Spark are trademarks of the Apache Software Foundation.\n\nOur Commitment to Diversity and Inclusion\n\nAt Databricks, we are committed to fostering a diverse and inclusive culture where everyone can excel. We take great care to ensure that our hiring practices are inclusive and meet equal employment opportunity standards. Individuals looking for employment at Databricks are considered without regard to age, color, disability, ethnicity, family or marital status, gender identity or expression, language, national origin, physical and mental ability, political affiliation, race, religion, sexual orientation, socio-economic status, veteran status, and other protected characteristics", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2x1dGlvbnMgQXJjaGl0ZWN0IiwiY29tcGFueV9uYW1lIjoiRGF0YWJyaWNrcyIsImNvbXBhbnlfbWlkIjoiL20vMDEyMHdnbmMiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiIyYWhmWFpQT21ueFdhb25FQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VkhvdE4ycGhXRmhVU25SbFVXZzJiWEl6TUVkUU1GUldiRlpIYVdObk9YWnRUa1UwUzBwUlpVMDVXVlJCZUdoeGJEUjBURVpNYjJsbFYxaHJhRzkxV2pOSWQzRlpaRXhsUW5sRFJWb3hSVGhuUkZkd1prWm9NbmhVZEd4MFdUTlVSVWsxVlZaT05IWk5XVzFYU2xoRVMzb3dibmxsZVVRelNqbE5iRFZTYlZvNVFUVTFkWGR5UVZaT1MwVk1WeTF5V2xCSlJreHNlWGgwV2xabkVoWlRTRzFEV1VwbFprUjBiVWQwVVdFMGRHSlBTVUYzR2lKQlQwMVpVbmRFYVVOMFVVeEVjRzFHWHpGTVdIcElhemszY1RORVVqVnRaSEozIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMTEiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQmF5dC5jb20iLCJsaW5rIjoiaHR0cHM6Ly93d3cuYmF5dC5jb20vZW4vc2luZ2Fwb3JlL2pvYnMvc29sdXRpb25zLWFyY2hpdGVjdC01ODQzNDk0NC8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Systems Engineer (Cloud) - Singapore at Fortinet", "company_name": "Fortinet", "location": "Singapore", "via": "via BizLINKS Resources Pte Ltd", "description": "Systems Engineer (Cloud) - Singapore at Fortinet\n\nJob Description\n\nThe Principle Systems Engineer will be the expert for Fortinet's cloud security solutions and technologies offerings. Will be the expert resource that have good in-depth domain knowledge of both private and public cloud technologies to provide technical consultation to design, develop and implement secure infrastructure solutions in complex Cloud Architecture. Responsibilities Provide pre-sales technical guidance and sales support for the development, adoption and implementation of Fortinet's cloud security solutions in major accounts opportunities in various industry sectors Understand the business operations requirements for major accounts clients base and be able to translate them into technical requirements, for the creation of solution design and proposals with Fortinet's cloud security solutions and services offerings. Recognizes, builds and develops business cases for high-impact cloud security opportunities... Serve as a technical consultant in cloud infrastructure technologies to designing large scale, highly complex, cyber security architecture integration with Fortinet's cloud security solutions Responsible for defining cloud security architecture standards, best practices and guidelines for cloud infrastructure security services Perform in-depth and complex technical presentations, solution showcases and proof of concepts (POCs) for major accounts clients and prospects Serves as a trusted advisor for the clients by exhibiting strong reputation in solution architecture, solution implementation and best practices consultation; in order to build strategic relationships with key decision makers and influencers Create proposals, test plans and writing of RFI/RFP or tender documents templates in the advantages of Fortinet's cloud security solutions and offerings Plan and delivery of technical workshops for clients, channels partners and prospects Help drive technical events, seminars and webinars In addition to the role as a Principle Systems Engineer in cloud security, the individual will have to take on the additional duties and responsibilities to educate the Channels Partners that are cloud security focused to position and adopt Fortinet's solutions by providing technical, consultative and architectural pre-sales support Participate in performance assessment of the channel partners technical readiness and progression Requirements University degree in a technical discipline or equivalent At least 12 years field experience working with public and private cloud platforms and networks security, preferably in an IT vendor environment At least 8 years of field experience working with major or named accounts as a Systems Engineer or equivalent Certification such as AWS Certified Solutions Architect, AWS Certified Security, Microsoft Azure Solutions Architect, Google Cloud Platform “ Professional Cloud Architect, VMware Certified Advanced Professional; is preferred Security Certifications like CEH, CISSP, CCSP, CISA, GIAC Security Essentials (GSEC), OCSP will be an advantage Strong technical knowledge and working experience in one or more of the following portfolios of public cloud platforms, such as Amazon Web Services, Microsoft Azure or Google Cloud Platform, VMware-based cloud. Automation, Orchestration, Provisioning tools, like Terraform, Ansible, Chef, and Puppet Strong working knowledge with Software Defined Networking Data Center technologies, such as VMware NSX, Openstack and Cisco ACI, etc Good working knowledge in container platforms such as Docker, Kubernetes, Openshift, VMware Tanzu, etc; that can automate the provisioning, management and scaling of applications Fortinet is an Equal Opportunity employer. We will only notify shortlisted candidates. Fortinet will not entertain any unsolicited resumes, please refrain from sending them to any Fortinet employees or Fortinet email aliases. Should any Agency submit any resumes to Fortinet, these resumes if considered, will be assumed to have been given by the Agency free of any related fees/charges. Show more\n\nOriginal Joblink : https://sg.linkedin.com/jobs/view/systems-engineer-cloud-singapore-at-fortinet-2389018888\n\nGoogle Company: https://www.google.com/search?q=Systems%20Engineer%20(Cloud)%20-%20Singapore%20at%20Fortinet", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTeXN0ZW1zIEVuZ2luZWVyIChDbG91ZCkgLSBTaW5nYXBvcmUgYXQgRm9ydGluZXQiLCJjb21wYW55X25hbWUiOiJGb3J0aW5ldCIsImNvbXBhbnlfbWlkIjoiL20vMDZscWJ0IiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiSGJ0ZzlXS1JFYm5PandxR0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFUzbFRPRGRoVW1ObVVWaFdWVlZUU21OelprUlpOMEZ6VkcxVlVESXhjSE5MTVVwMlRubzVUMjlRYWtaQlNsSk9ZV0pJU0Mxa1ZISkVObFI2TFZObGVtZG1UMTlTVTNBNE5qWjRkVUpRVFdGMVZFSllWRzQxVFdOck5GbFdVM0ZXUlRrNVZGOTRiMUZ3YjJJME5GSlBZVlZTYTNodk5UZGtXVkZKUTNSR1NsOWpZbkIzZFhRMFNUQXRSRVptWkc5RFVsVkZjM2xpYkd4elRtMVJFaFpUU0cxRFdVcGxaa1IwYlVkMFVXRTBkR0pQU1VGM0dpSkJUMDFaVW5kRU0zazVYMEpFV1d4ZmNrOUhja0Y0VjNWS2FHTjJjVXBKZDA1biIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzE5IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEJpekxJTktTIFJlc291cmNlcyBQdGUgTHRkIiwibGluayI6Imh0dHBzOi8vd3d3LmJpemxpbmtzcmVzb3VyY2VzLmNvbS5zZy9pbmRleC5waHAvam9iLWxpc3RpbmdzLXB1YmxpYy84OC1zeXN0ZW1zLWVuZ2luZWVycy81MTM3LXN5c3RlbXMtZW5naW5lZXItY2xvdWQtc2luZ2Fwb3JlLWF0LWZvcnRpbmV0LTUxMzc/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Cloud Solution Architect", "company_name": "DELL", "location": "Singapore", "via": "via Dell Careers", "description": "In the Cloud Services team, we are responsible for the success of VMware Cloud Services sales to both Enterprise, Commercial customers and Cloud Provider Partners across South East Asia and Korea. Our solutions include VMware Cloud Provider Program (VCPP) and VMware Cloud on AWS. The VCPP team's primary objective is to drive adoption of VMware Products, services and technologies into Service Provider accounts and provide expert guidance to Service Providers enabling them to go to market with VMware based cloud services.\n\nWe are passionate about our customers and our team. We're passionate about culture, diversity and flexibility because we know this drive high-performing teams who achieve outstanding results. We are looking for a talented individual to join the team as a Cloud Solution Architect, based in Singapore. Are you passionate about phenomenal customer outcomes? Are you curious to find innovative ways of working? Are you authentic, hardworking and transparent? Do you want to... join one of the worlds top software companies and a recognised Great Place to work? We have the solutions, we are passionate about success and nurture extraordinary talent.\n\nAs a VCPP Cloud Solution Architect, your overall responsibility will be to provide in-depth technical product overview, roadmap and prescriptive mentorship to Cloud Providers. This will enable the Cloud Providers sell public facing cloud services built on VMware Cloud solutions. As they sell more of their services, it will in turn drive revenue through VMware product usage (subscription licensing).\n\nResponsibilities:\n• Collaborating with service provider technical product teams as a trusted advisor and assist in leading and handling the technical agenda. This will include assisting in running initial product/solution proof-of-concepts and pilots\n• Handling support requests (as needed) and promote participation in VMware beta programs.\n• Drive collaboration with VMware product Teams and SME’s to provide Service Provider product feedback which will help develop VMware's product roadmap.\n• Maintain deep technical and business knowledge of Cloud solutions, industry directions and trends.\n• Maintain working knowledge of competitor products and services and how to position against them\n• Document standard methodologies & architectural references in designing and deploying VMware cloud solutions.\n\nRequirements:\n• Experience in technical sales for cloud and managed services either with Hyperscaler/CSPs/MSPs\n• 8+ years of experience in technology related areas including: enterprise IT and infrastructure (datacenter) architecture experience with significant depth around designing, implementing, and running critical business infrastructure. Engagement experience should include IT strategy initiatives, middleware implementations, and demonstrating overall technical architecture knowledge across multiple industries.\n• Shown success and knowledge in developing and leading Service Provider Partners/Customers.\n• Enthusiastic, self-starter with a trustworthy personality.\n• Excellent social, interpersonal and presentation skills.\n• You are able work effectively in both independent and team setting.\n• Strong listening and question based selling skills. Able to uncover business challenges and develop a custom solution to meet those challenges.\n• You should be an accomplished presenter of sales and technical material to both small and large groups. The ability to present extemporaneously is desirable.\n• Ability to travel up to 30% of the time.\n\nQualifications\n• He or She should have Bachelor’s Degree in Computer Science, Engineering, Mathematics, related field or equivalent experience.\n• Should have strong VMware knowledge (vSphere, VSAN, NSX, at a minimum)\n• VMware and other technical certification of next generation application & cloud platforms including but not limited to: Amazon Web Services, IBM Softlayer, Microsoft Azure, Google Cloud Platform, etc. is a definite plus.\n\nCategory : Sales\nSubcategory: Systems Engineering\nExperience: Manager and Professional\nFull Time/ Part Time: Full Time\nPosted Date: 2021-04-05\n\nVMware Company Overview: At VMware, we believe that software has the power to unlock new opportunities for people and our planet. We look beyond the barriers of compromise to engineer new ways to make technologies work together seamlessly. Our cloud, mobility, and security software form a flexible, consistent digital foundation for securely delivering the apps, services and experiences that are transforming business innovation around the globe. At the core of what we do are our people who deeply value execution, passion, integrity, customers, and community. Shape what’s possible today at http://careers.vmware.com.\n\nEqual Employment Opportunity Statement: VMware is an Equal Opportunity Employer and Prohibits Discrimination and Harassment of Any Kind: VMware is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at VMware are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. VMware will not tolerate discrimination or harassment based on any of these characteristics. VMware encourages applicants of all ages. Vmware will provide reasonable accommodation to employees who have protected disabilities consistent with local law", "extensions": ["18 days ago", "Full–time"], "detected_extensions": {"posted_at": "18 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDbG91ZCBTb2x1dGlvbiBBcmNoaXRlY3QiLCJjb21wYW55X25hbWUiOiJERUxMIiwiY29tcGFueV9taWQiOiIvbS8wcHk5YiIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjBrWlFWbmpYQ3VwVUdyY1hBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVzc0JDb3dCUVU1VlgwNXhVamxhUVhwT1ZVa3hPR3BMZUU1bVQxTldTWHBJYXpKZlZEVjJYMUV4Y1dWWmJqaEhUVkJtUjBkRlFqaFVXVlE0Vmt4bFZFeFpNVXRJVjNSV1RHSmpjSFpYY1ZkcWNsSmpNWEk0V0ZBd01UZExSa3M1WWtWcVJuVTBSVU41ZEV3dFRtbDFPR2hYWkhOb1dTMTNkbGw1TFZObWVIcHlRelJNYzNaNmRERm1PVGswZEdkalpXZ1NGbE5JYlVOWlNtVm1SSFJ0UjNSUllUUjBZazlKUVhjYUlrRlBUVmxTZDBSTFRHczNZeTFIWW5rMVprbDJlRTVOYkZKUWMyUk9Na1l0VDNjIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMjciLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gRGVsbCBDYXJlZXJzIiwibGluayI6Imh0dHBzOi8vam9icy5kZWxsLmNvbS9qb2Ivc2luZ2Fwb3JlL2Nsb3VkLXNvbHV0aW9uLWFyY2hpdGVjdC8zNzUvMTkxNDcxMDA/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Data & AI Solution Architect - Data Platform Modernization", "company_name": "Avanade", "location": "Singapore", "via": "via Avanade Jobs", "description": "As a part of the Global Data & AI Center of Excellence, and in a highly visible role, you will leverage a client-centric approach to translate our client’s business strategy into solutions and services that lead to successful business outcomes.\n\nAs a Data & AI Solution Architect aligned to our Global Azure CoE, you will design Big Data Analytics solutions on Azure. You will serve as a functional expert on projects, contributing to use case development, assessments, technical architecture across data platform, AI & IoT initiatives and stakeholder management to ensure stakeholder satisfaction and return on investment.\n\nYou demonstrate innovation and ambition to achieve performance targets and establish Avanade as a leader in Data & AI and as a #1 Employer of Choice.\n\nWithin a Highly Collaborative Environment You Will:\n• Design and Drive reusable assets, growing Analytics and DevOps capability\n• Solution & Deliver Modern Data Platform and Advanced Analytics solutions for clients\n•... Leverage technical acumen and build knowledge of business and IT strategy, the Azure ecosystem, data platform and AI/IoT use cases across many verticals, thereby ensuring that client’s investments achieve rapid business results\n• Participate in the working session to discover and understand business strategy and objectives, Data & AI landscape, challenges, and prioritize & refine use cases\n• Partner with key business stakeholders, data owners, solution architects, end users, application designers, and data architects in executing and delivering business use cases and help client realize value\n\nAdditionally, You Will:\n• Engage with leadership and clients in strategic discussions to assess business requirements and use cases and input into the solution architecture and roadmap to drive outcomes\n• Perform assessments to determine the technical feasibility of building a D&AI solution\n• Contribute to and define the high-level solution and act as functional expert on the project\n• Build Data &AI offerings and assets in conjunction with senior Data &AI stakeholders\n• Own and drive offerings in the market, effectively positioning those offerings (and sub-offerings) with sales teams, channels, and target clients (direct and indirect)\n• Develop overall solution plans and strategic vision for solutions, providing a comprehensive roadmap for clients’ needs\n\nRequired Experience:\n• Experience in roles with growing responsibility within professional services/management consulting or technology firms\n• Passionate about the development and delivery of Data & AI solutions\n• Ability to develop capabilities and to continue to support client deliveries\n• Experience delivering business technology solutions to client organizations\n• Participate in the pursuit of engagements, maintaining the relationship through the delivery phase resulting in repeat client business\n• Experience of using Data & AI tools including Azure Storage, Stream Analytics, CosmosDB, SQL DW, Azure Databricks, Azure Machine Learning, Azure Data Catalog, and Azure Data Factory (ADF), Blob, Azure SQL, Polybase, Delta\n• Engineering Pipeline Design, Azure Technical Architect, and Data Lake Design\n• Certifications: DP200, DP201, Databricks Certified, Associate Developer for Apache Spark 2.4", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEYXRhIFx1MDAyNiBBSSBTb2x1dGlvbiBBcmNoaXRlY3QgLSBEYXRhIFBsYXRmb3JtIE1vZGVybml6YXRpb24iLCJjb21wYW55X25hbWUiOiJBdmFuYWRlIiwiY29tcGFueV9taWQiOiIvbS8wOTQ0NTYiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJrVVZXUEppOGxxNlNYVVI4QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFc3NCQ293QlFVNVZYMDV4VTNJNVJFcDJMV1EyTjJwdVdtVlpUREJFYmxsd1lYTTNUa1JFT1ROZmFraGZiVjlDTldzeFMyTndOVXRvY0hkWFpHeFhTbkpzYzNwTE4xUjRZVWwwTFdFeE5tbENXRGxPU1VOcFZVMXpkRkY1V1dWQ09HNVlNMWhTYjBKTFVreDFXbXczZERoZlExYzNaMEZNT1VGdlVsUkZRMFowVldsVE16aGFjWGQyTWpGbk5GUlJSbDhTRmxOSWJVTlpTbVZtUkhSdFIzUlJZVFIwWWs5SlFYY2FJa0ZQVFZsU2QwUXlXRlJqVVV0UGRGaG1TMlp2U21WME5tTkJlREZ3UVhoZk9IYyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzM1IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEF2YW5hZGUgSm9icyIsImxpbmsiOiJodHRwczovL2NhcmVlcnMuYXZhbmFkZS5jb20vam9ic3poc2cvSm9iRGV0YWlsL0RhdGEtQUktU29sdXRpb24tQXJjaGl0ZWN0LURhdGEtUGxhdGZvcm0tTW9kZXJuaXphdGlvbi8yNTU1Nz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Advanced Solution Architect", "company_name": "Avaya", "location": "Singapore (+1 other)", "via": "via Careers @ Avaya", "description": "About Avaya\n\nBusinesses are built by the experiences they provide, and every day millions of those experiences are delivered by Avaya Holdings Corp. (NYSE: AVYA). Avaya is shaping what's next for the future of work, with innovation and partnerships that deliver game-changing business benefits. Our cloud communications solutions and multi-cloud application ecosystem power personalized, intelligent, and effortless customer and employee experiences to help achieve strategic ambitions and desired outcomes. Together, we are committed to help grow your business by delivering Experiences that Matter. Learn more at www.avaya.com.\n\nAbout the Opportunity\n\nAvaya is looking for an experienced Solution Architect with software architect skills to make intuitive high-level decisions. They will see the “big picture” and create architectural approaches for software design and implementation within the customer engagement solution portfolio that support our customer strategy for service... excellency.\n\nThe Solution Architect will be responsible of designing, developing and guiding the implementing team for delivering software solutions to address complex business issues. They will work with the development team from Avaya, partners and customer to elaborate the full potential of Avaya platforms. They should have a strong technical background and excellent IT skills and it is expected that they will be experienced in designing and possess ability to develop a unified vision for software characteristics and functions.\n\nAbout the Responsibilities\n• Analyse business requirements to develop technical Avaya solutions and their framework.\n• Design, test, and inspect customer data and voice topology, helps with modelling, analysis, and planning.\n• Works with appropriate parties to resolve discrepancies between proposed systems and enterprise quality and security standards.\n• Manage multiple technology vendors providing integration analysis and test plans.\n• Provides technical and administrative direction for personnel performing software development tasks, makes recommendations, and approval of major systems installations.\n• Be a self-starter and able to pick new things on the go.\n• Designs and develops computer software possessing a wide range of capabilities, including numerous engineering, business, and records management functions.\n• Write functional and non-functional requirements/specifications documents\n• Determine production direction and roadmaps.\n• Acts as an advisor and proposes changes to the ETA based on analysis of requirements and new technology.\n• This is a regional role so candidate must be willing to travel around 30% of employment time.\n\nAbout the Experience\n• Experience with market leading public Cloud solutions (AWS, Google, Azure)\n• Experience with SaaS, PaaS, IaaS Cloud Technologies\n• Experience with core data networking and network management knowledge is a plus.\n• Experience with cloud automation, cloud design patterns and microservices is a plus.\n• Experience with Java SE 7/8 and open source programming.\n• Experience with Python, with at least single web framework in-depth knowledge.\n• Experience with Mobile development is plus\n• Knowledge of different database technology MSQL, PostgreSQL, Oracle, Cache.\n• Knowledge of Customer engagement technology via Voice, Video communications and data network requirements for optimal performance, Data Network & Video certificates is a Bonus\n• Good to have 2-3 Avaya or other vendor with communication background, experience in the techniques that lead to, the production and design of complex Avaya Communication systems. Including, requirements discovery and analysis, formulation of solution context, identification of solution alternatives and their assessment, technology selection, and design configuration.\n\nAbout the Skills and Competencies\n• Strong Skills in Applications development mainly within Web communication and customer engagement technology.\n• Security Architecture and Design – signaling and media encryption is plus\n• Proficient in Microsoft Visio and Microsoft Office (Word, Excel, Power Point)\n• Create architecture design artifacts for the solution – Power Point high level architecture and vision, technical Visio drawings, configuration details /test plans in Excel and detailed descriptions in Microsoft Word.\n• Integration of user-facing elements developed by front-end developers with server-side logic.\n• Excellent knowledge of software and application design and architecture\n• Excellent knowledge of UML and other modelling methods, TOGAF certified is a Bonus.\n• Basic understanding of front-end technologies, such as JavaScript, HTML5, and CSS3\n• Strong communications and relationship skills.\n• Skilled in socializing technical architectures among customer organization within Business, IT and operations\n• Strong negotiation and problem-solving skills are also required. The architect must work with the PMO team to make decisions in a timely manner to keep projects on track.\n• Knowledge of all phases of software development including design, coding, testing, debugging, implementation, and support of large-scale, business centric and process based applications.\n• Design ability to integrate multiple data sources and databases into one system for advanced analytics and data management solutions.\n\nFooter\n\nAvaya is an Equal Opportunity employer and a U.S. Federal Contractor. Our commitment to equality is a core value of Avaya. All qualified applicants and employees receive equal treatment without consideration for race, religion, sex, age, sexual orientation, gender identity, national origin, disability, status as a protected veteran or any other protected characteristic. In general, positions at Avaya require the ability to communicate and use office technology effectively. Physical requirements may vary by assigned work location. This job brief/description is subject to change. Nothing in this job description restricts Avaya right to alter the duties and responsibilities of this position at any time for any reason. You may also review the Avaya Global Privacy Policy (accessible at https://www.avaya.com/en/privacy/policy/) and applicable Privacy Statement relevant to this job posting (accessible at https://www.avaya.com/en/documents/info-applicants.pdf).\n\n#LI-DNI", "extensions": ["25 days ago", "Full–time"], "detected_extensions": {"posted_at": "25 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJBZHZhbmNlZCBTb2x1dGlvbiBBcmNoaXRlY3QiLCJjb21wYW55X25hbWUiOiJBdmF5YSIsImNvbXBhbnlfbWlkIjoiL20vMDFzcWxrIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoicTc4alQ4dE5VVC1lRHdiY0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXNzQkNvd0JRVTVWWDA1eFVrTlVaMFZaZG5rNWRFOWtjbTlxWkZwSmQzZFFaamMyZWtSWVozUlFUV0ZmYmtKV1kyRnZNMGQwVmw5WmMyOVplVVpYTUZreGNuQkhOMHR2TlhOTlpXOXpRMjVUVEU0NU4xQk1UMDAxZDBOaFZ6TlNlREI0Y1dWMk9XUlVTVjgyVGtSak1uZFlZVFpJY0hGNGVuZFFNR2N4Tld0clEybzBUbXRzT0VkcGFrcDNhVEpEUjFRU0ZsTkliVU5aU21WbVJIUnRSM1JSWVRSMFlrOUpRWGNhSWtGUFRWbFNkMEl0YjFCVlJWVnRUWGxRYkhGTGFrZG5aa2xCTFZwbU9GUlliR2MiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY180MyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBDYXJlZXJzIEAgQXZheWEiLCJsaW5rIjoiaHR0cHM6Ly9jYXJlZXJzLmF2YXlhLmNvbS9qb2IvU2luZ2Fwb3JlLUFkdmFuY2VkLVNvbHV0aW9uLUFyY2hpdGVjdC0wMS82Mjg0NTA2MDEvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "M&E Specialist Solutions Architect", "company_name": "Amazon", "location": "Singapore", "via": "via LinkedIn", "description": "Job Description\n\nDo you like helping customers implement challenging video workflows? Would you like to do this using the latest encoding and cloud computing technologies? Do you have the consultative and leadership skills to help customers succeed with their cloud adoption initiatives? AWS Elemental builds cloud-based and on-premises video encoding, origin, packaging, and management solutions for Live and Video-On-Demand workflows for customers worldwide. These solutions are integrated into larger AWS or other workflows. The AWS Elemental Specialised Solutions Architect is an expert in building architectures to support video processing and delivery workflows. In this role the Solutions Architect is expected to assist customers, partners, and AWS account teams with optimizing these workflows to best fit the application and use case.\n\nThe AWS Elemental Specialist SA will work closely with customers as well as our internal development teams on creating new blueprints and best practices... for helping customers transition to AWS cloud services. Building next generation architectures requires both a depth and breadth of understanding of the technical, operational and business challenges each Media & Entertainment (M&E) customer is facing.\n\nWe are looking for a Solutions Architect to guide customers through this disruptive shift to cloud based video processing and delivery, utilizing best of breed AWS services as well as partner solutions.\n\nHere Are Some Other Qualities We Are Looking For\n\nAt AWS, we have a credo of \"Work hard. Have fun. Make history.\" In this role, you will love what you do, be a great teammate and instinctively know how to make work fun. You will be dynamic and creative, and willing to take on any challenge and make a big impact.\n\nYou need to have a passion for educating, training, designing, and building new cloud solutions for video workflows for a variety of different markets. You should be ready to embrace the challenge and have fun doing it.\n\nResponsibilities Include\n• Ensure customer success in building architectures to support video processing and delivery workflows\n• Act as the primary technical interface for customer evaluations and provide responsive and knowledgeable pre-sales support\n• Work with to design and integrate our products and services into both new and legacy video workflows for our customers\n• Conduct one-to-few and one-to-many training sessions to transfer knowledge to customers, partners and system integrators on best practices\n• Capture and share best-practice knowledge amongst the AWS solutions architect community\n• Author or otherwise contribute to AWS customer-facing publications such as whitepapers\n• Communicate customer feedback to Product Management and the Services team (feature requests, market trends, etc.)\n• Work closely with the Software Engineering team to verify technical requirements for customer-requested features and defect fixes\n\nBasic Qualifications\n• A BS in computer science, electrical engineering or other related field\n• Strong communication skills\n• Experience working with Broadcast or OTT workflows\n• Experience with video compression and packaging, especially H.264, HEVC, HLS and MPEG DASH\n• 3-5 years' experience with Linux operating systems\n• Occasional international travel required (2-3 per year).\n• Demonstrated proficiency in written and spoken English\n\nPreferred Qualifications\n• 3-4 years' experience using at least one Linux-based scripting language (e.g. Perl, Ruby, Bash, Python)\n• Experience with cloud-based services (S3, EC2, Cloudfront, etc.) or AWS SA Professional certification strongly preferred\n• Experience working with broadcast, distribution, or content creation customers and demonstrated in-depth knowledge of their requirements and workflows\n\nJob Description : Do you like helping customers implement challenging video workflows? Would you like to do this using the latest encoding and cloud computing technologies? Do you have the consultative and leadership skills to help customers succeed\n\nExperience: 3.00-5.00 Years", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJNXHUwMDI2RSBTcGVjaWFsaXN0IFNvbHV0aW9ucyBBcmNoaXRlY3QiLCJjb21wYW55X25hbWUiOiJBbWF6b24iLCJjb21wYW55X21pZCI6Ii9tLzBtZ2tnIiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoicVpYMzVpVFJtY3h2dEhQTEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXNzQkNvd0JRVTVWWDA1eFZFWlFSRWxoT0hjMVEzYzRhelYyZFZVemFVaGFZWGh4U2pkbE1GQXdWMGhCZEZadWNHRmtXV3RsYlVzelRHaGpORnBvVW1oSU5rOTZZME5RYXpWRE1uSm1Zbk0yTjBweU5FdFZSR3RVTm5SRWFHVk1SRE5hVUdKUmVVa3pSV0p2U0VwMGRHczRhRGRCT1ZCcVkwNTRVVUZmYVdKRExWbEJVRmg1Tm04eFNsbGpVRjlLV1dJU0ZsTkliVU5aU21WbVJIUnRSM1JSWVRSMFlrOUpRWGNhSWtGUFRWbFNkMEZ6T1VGSFRreHBSa1V4U0hKb1lqVmFkR1ZWVWtWS2QxVlVNMUUiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY181MCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL3NnLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvbS1lLXNwZWNpYWxpc3Qtc29sdXRpb25zLWFyY2hpdGVjdC1hdC1hbWF6b24tMjUxNDUxMjc3ND91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Solution Architect - Cyber Security", "company_name": "Talent Trader Group Pte Ltd", "location": "Singapore", "via": "via Monster", "description": "Responsibilities:\n• Enhance security team accomplishments and competence by planning delivery of cyber security solutions\n• Ability to identify security risks, exposures and exploits within customers’ environment. And aspire and shape our customers’ cybersecurity architecture design decisions and capture these in high-level, detailed designs.\n• Act as a technical lead for the delivery of proposed security solutions\n• Implement designed or proposed security systems; acting as technical lead to direct equipment and software system installation\n• Managing project schedule for delivery; completing solution documentation and ensure handover to security operations\n\nRequirements:\n• Bachelor’s Degree in computer science or equivalent\n• 2 years’ experience in implementation of cyber security design and project delivery in enterprise environment\n• Strong technical experience in delivery security solutions in term of presentation and project management\n• CISSP certification will be... advantageous\n• Prior experience / certification with any security products/ solutions such as FireEye, CyberArk, Symantec, Tenable, ZScaler/Menlo will be advantageous\n\nInterested candidates who wish to apply for the advertised position, please email us an updated copy of your resume to;\nEmail Address: [Confidential Information]\nEA License No.: 13C6305\nRegistration ID: R1877348\nFor candidate who applied for the advistised position is deemed to have consented to us that we may collect, use or disclosed your personal information for purpose in connection with the services provided by us", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2x1dGlvbiBBcmNoaXRlY3QgLSBDeWJlciBTZWN1cml0eSIsImNvbXBhbnlfbmFtZSI6IlRhbGVudCBUcmFkZXIgR3JvdXAgUHRlIEx0ZCIsImNvbXBhbnlfbWlkIjoiL2cvMTFkeHBtbGM1YiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IlpxcU9KTEMzZVpoUnE4Z1NBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVvc0NDc3dCUVU1VlgwNXhVMDlDVjFkWGIzVTBVRlJ3WTFoQ1NWazJRMlpMWmt4V1NqUXdiM2xwY3pOeWJrVlZkalZIYkdGTFN6RmxaRnBOZVhwa1ZVZFRjbk51Y0VReFNWVmhZbU5QTlZCVk5VTXhiM0pFVERKdVJURXlaM1ZCYjBJeWVXZFFMVWgyVDJGQlprUjJNbE4zTVdwYU1FVmhkbTFhWkU1U1RXSjZNa2RxUmxJMVIyNTBVakZDYkRZeGVFWkpjMkZXWW5kVmEwZGpVblJQUkVGUE9HdDJZWFI0U2tnMU5WbFlTV0p2Y0hJdFVVbFRlVk5aY2xKV2FURlpOMlEwVERGQ2MyUXpVRzlHVWxkZlQwVllFaFpUU0cxRFdVcGxaa1IwYlVkMFVXRTBkR0pQU1VGM0dpSkJUMDFaVW5kQmVrRnJkMjV1WTJKS2NqQnZiVW96ZWpBM016WXdaVEZMY25KUiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzU3IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1vbnN0ZXIiLCJsaW5rIjoiaHR0cHM6Ly93d3cubW9uc3Rlci5jb20uc2cvam9iL3NvbHV0aW9uLWFyY2hpdGVjdC1jeWJlci1zZWN1cml0eS10YWxlbnQtdHJhZGVyLWdyb3VwLXB0ZS1sdGQtc2luZ2Fwb3JlLTE2ODk0Nzg/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Lead 5G Core Solution Architect", "company_name": "Ericsson", "location": "Singapore", "via": "via Ericsson Jobs", "description": "Functional Area: Service Delivery\n\nLocation: Singapore/Thailand/Philippines (no relocation)\n\nTravel: up to 50% of the time\n\nBackground Checks: All employment offers to join Ericsson are subject to satisfactory completion of our global pre-employment check\n\nAs the tech firm that created the mobile world, and with more than 54,000 patents to our name, we’ve made it our business to make a mark. When joining our team at Ericsson you are empowered to learn, lead and perform at your best, shaping the future of technology. This is a place where you're welcomed as your own perfectly unique self, and celebrated for the skills, talent, and perspective you bring to the team. Are you in?\n\nCome, and be where it begins.\n\nOur Exciting Opportunity\n\nWe are now looking for a Lead 5G Core Solution Architect, to drive assigned opportunities and deliveries across the Market Area. You will be involved in driving 5G Core deployments in the region by supporting in the design and development of commercially... viable end-to-end technical solutions for the customers across 5GC sub-domains such as Packet Core, Unified Data Management and Policy, VoLTE and Evolved Communication, Mobile Switching, Signaling Solutions, Cloud Native Infrastructure, NFVI and Software Defined Infrastructure. You will be dealing closely with Service Delivery Units, Customer Units & BDGS Solution Area Core & Cloud by providing strong technical leadership and experiences to navigate the complexities of 5G Core deliveries, dealing with technical escalations and promoting best practices. The role will report to The Digital Services Head of Network Transformation.\n\nIn this role, you would:\n• Work across the region in multiple and diverse programs\n• Define the technical solutions for Core & Cloud projects in the 5GC Domain and primarily drive the delivery of 5GC Programs across the Market Area\n• Support our Market Area and Country Unit teams in pre-sales activities via technical reviews and customer demonstrations\n• Act as a SPOC for 5GC solution engagements towards the customer and the CU teams across the Market Area as part of a central team\n• Establish thought leadership through delivering customer presentations and webinars\n• Collaborate with your peers to drive best practices and promote technical excellence\n• Support operational activities by working closely with the team responsible for deployment, upgrade, integration and testing\n• Support MOAI Strategic Initiatives for CICD/Automation and Industrialization by identifying and promoting high value assets for scaled use\n\nAs our ideal candidate, you will have:\n• Education: University degree or equivalent\n• Proven experience in 5GC technologies and adept Experience with Kubernetes/Containerization concepts with E2E technical understanding\n• Extensive experience as a Core & Cloud Solution Architect. Proven experience in domains such as Packet Core (EPC), vIMS (VoLTE, VoWiFi) UDM/UDC, DSC, PCRF/SAPC, NFVi/virtualization\n• Decision making and \"can do\" attitude and can lead, present and communicate with internal and external partners at C-level\n• Excellent team work and collaboration skills including coaching & mentoring Skills\n• Business and Commercial acumen and motivation to continuously self-develop core competences\n• *Post covid there may be occasions requiring travel to other countries in the region or design unit\n\nWhat's in it for you?\n\nWith over 90,000 employees across 180+ countries, we have a culture that respects and supports your ambitions, in alignment with our values of Respect, Professionalism and Perseverance. Ericsson is very passionate about learning and development, supports mobility and flexible working hours. We are also committed to diversity and inclusion and to be a responsible and relevant driver of positive change. We also offer some awesome benefits, amazing career development and training programs to provide an empowered career in a connected world.\n\nEvery year, more than 10,000 organizations from over 60 countries partner with the Great Place to Work® Institute for assessment, benchmarking and planning actions to strengthen their workplace culture. Great Place to Work® Institute’s methodology is recognized as rigorous and objective and is considered as the gold standard for defining great workplaces across business, academia and government organizations. Ericsson Singapore has been Great Place to Work - Certified™ in 2020.\n\nEricsson Australia has been endorsed as a WORK180 Employer for Women in 2020. WORK180 is an advocate for working women, who provide job applicants with a transparent directory of endorsed employers who support diversity, inclusion and equality.\n\nEricsson Australia has also been awarded WORK180 Flex Able Certification in 2020 after an evidence-based audit to ensure we have the cultural, structural and technological enablers in place to allow genuine flexible work arrangements to flourish.\n\nWhat happens next once you apply?\n\nWhat happens next once you apply? Read about the next steps here\n\nFor your interview preparation, here are a few \"Tips&Tricks\" from our recruiters\n\nFor your prep and reference, here is our overall Brand video and some insights about our innovations in 5G\n\nEricsson is continuing to hire for all open roles with all interviewing and on-boarding done virtually due to COVID-19. Everyone new to the team, along with our current staff, will temporarily work from home until it is safe to return to our offices.\n\nDo you believe that an organization fostering an environment of cooperation and collaboration to execute with speed creates better business value? Do you value a culture of humanness, where fact based decisions are important and our people are encouraged to speak up? Do you believe that diverse, inclusive teams drive performance and innovation? At Ericsson, we do.\n\nWe provide equal employment opportunities without regard to race, color, gender, sexual orientation, transgender status, gender identity and/or expression, marital status, pregnancy, parental status, religion, political opinion, nationality, ethnic background, social origin, social status, indigenous status, disability, age, union", "extensions": ["8 days ago", "Full–time"], "detected_extensions": {"posted_at": "8 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJMZWFkIDVHIENvcmUgU29sdXRpb24gQXJjaGl0ZWN0IiwiY29tcGFueV9uYW1lIjoiRXJpY3Nzb24iLCJjb21wYW55X21pZCI6Ii9tLzAya3loIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiYVBmZWtJdVcwSE1Cb2RJNEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVFQkNxSUJRVTVWWDA1eFVXbzJRemhTV1dzMU9WZEpiRUpoU1d0ME5rd3lNekV5WDJWamVUUnVZbGxDVVZkTGRFODVkbkIyY3pZdFMyazFkalJKWDJkeWNISndiVGxFYW5kNE9GUXlhVTV6YVZJdFFuRmFRazlyVUMxV2JsWndkekJKUmtWaVNIaHZSekJpYW5kUUxXYzJTVUo0VFRrM04zZFVUR1ozUzFvNWJubG1kbEYwVDNkQlVUQlhjak5mVlZaV1QyMVJRVU5HV0ZKUFVqRk5RbWszUjNWS1JuZFJFaFpUU0cxRFdVcGxaa1IwYlVkMFVXRTBkR0pQU1VGM0dpSkJUMDFaVW5kQldGTm1PSEpmU0ZaYWJuSmZaVGxmZUV0T2RqZHFNVVZFYVdOUiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzY0IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEVyaWNzc29uIEpvYnMiLCJsaW5rIjoiaHR0cHM6Ly9qb2JzLmVyaWNzc29uLmNvbS9qb2IvU2luZ2Fwb3JlLUxlYWQtNUctQ29yZS1Tb2x1dGlvbi1BcmNoaXRlY3QtMDEvNzIwMjgwNTAwLz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Cloud Solution Architect - Infrastructure", "company_name": "Microsoft", "location": "Singapore", "via": "via Microsoft Careers", "description": "Microsoft is on a mission to empower every person and every organization on the planet to achieve more. Our culture is centered on embracing a growth mindset, a theme of inspiring excellence, and encouraging teams and leaders to bring their best each day. Growth mindset encourages each of us to lean in and learn what matters most to our customers, to create the foundational knowledge that enables us to make customer-first decisions in everything we do. In doing so, we create life-changing innovations that impact billions of lives around the world. You can help us achieve our mission. To learn more about Microsoft’s mission, please visit: https://careers.microsoft.com/mission-culture.\n\nThrough our partners, Microsoft brings digital ambitions to life by helping companies empower their employees, engage their customers, optimize their operations, and transform their products. We are looking for a highly motivated and passionate individual to join the Microsoft One Commercial... Partner\n\n(OCP) team as a Cloud Solution Architect (CSA) for Azure Infrastructure. Joining the OCP team as a CSA means you will be playing a critical role helping Microsoft Partners to capitalize on the $2.2 trillion-dollar Digital Transformation market opportunity by 2019 – a 60% increase since 2016. Working in OCP means you are shaping the world’s largest eco-system of technology companies working to digitally transform the world’s most innovative companies, large and small.\n\nAzure CSAs play a critical role in working with partners to provide deep Azure technical support through solution build and first mile customer engagements including Proof of Concepts, Architectural Design Sessions (ADS), and Hackathons. The CSAs build relationships with partner technical and development resources, designing and architecting new solutions based on Microsoft’s Azure cloud platform and technologies. They deliver value via a portfolio of service delivery engagements optimized to accelerate partner solution builds and first mile customer wins and stand out as a Technology expert due to deep solutions knowledge. They can go toe-to-toe with Microsoft engineering teams and blackbelts often surfacing product issues, providing feedback and insights\n\nthat accelerate fixes and updates", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJDbG91ZCBTb2x1dGlvbiBBcmNoaXRlY3QgLSBJbmZyYXN0cnVjdHVyZSIsImNvbXBhbnlfbmFtZSI6Ik1pY3Jvc29mdCIsImNvbXBhbnlfbWlkIjoiL20vMDRzdjQiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJ0Y3EtcDM0U1VGVU9xdFBIQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUVCQ3FJQlFVNVZYMDV4VW1NMlIxSXhXSFJXUW1KYU5sZGxWMmw0WlcxdGRGaHphMmt0VW5OUWNHTTRUVEJ4YlhkU2QwUk1WWGM0Wm5oRE1IcHpaelZOV1Y5ZlRHbEZjMjVrZWpKcllYRXRRMVppUzAxelIzSmlObGhaUWpOT1ZVTTFPWGRpV0c5T1dXc3pla2g2UW14SFJtSmxZemxWVFY5MFdEUlljbVU1VTNGRVNqSTRNa2R2U1dab2JrbDBWMFpLV0Zrek1GQmhTa3gxYUZsUmJ5MDNORGR5UTFkUkVoWlRTRzFEV1VwbFprUjBiVWQwVVdFMGRHSlBTVUYzR2lKQlQwMVpVbmREWjB4ME5XWmhjM2xXUm14aWNtWkNhREk0ZW5OeVpEWlRWbWgzIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNzIiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTWljcm9zb2Z0IENhcmVlcnMiLCJsaW5rIjoiaHR0cHM6Ly9jYXJlZXJzLm1pY3Jvc29mdC5jb20vcHJvZmVzc2lvbmFscy91cy9lbi9qb2IvMTAxMTgzMS9DbG91ZC1Tb2x1dGlvbi1BcmNoaXRlY3QtSW5mcmFzdHJ1Y3R1cmU/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}], "chips": [{"type": "Title", "param": "job_family_1", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Solution architect", "value": "solution architect"}, {"text": "Solutions architect", "value": "solutions architect"}, {"text": "Architect", "value": "architect"}, {"text": "Cloud architect", "value": "cloud architect"}, {"text": "Technical architect", "value": "technical architect"}, {"text": "Enterprise architect", "value": "enterprise architect"}, {"text": "Senior", "value": "senior"}, {"text": "Consultant", "value": "consultant"}, {"text": "Financial services", "value": "financial services"}, {"text": "Infrastructure architect", "value": "infrastructure architect"}, {"text": "Manager", "value": "manager"}, {"text": "Application architect", "value": "application architect"}, {"text": "Cloud engineer", "value": "cloud engineer"}, {"text": "It architect", "value": "it architect"}, {"text": "Lead architect", "value": "lead architect"}, {"text": "Network architect", "value": "network architect"}, {"text": "Security architect", "value": "security architect"}, {"text": "Senior architect", "value": "senior architect"}, {"text": "Systems engineer", "value": "systems engineer"}, {"text": "Associate director", "value": "associate director"}, {"text": "Deputy", "value": "deputy"}, {"text": "Engineers", "value": "engineers"}, {"text": "Head", "value": "head"}, {"text": "Infrastructure", "value": "infrastructure"}, {"text": "Lab", "value": "lab"}, {"text": "Network engineer", "value": "network engineer"}, {"text": "Presales consultant", "value": "presales consultant"}, {"text": "Public sector", "value": "public sector"}, {"text": "Senior analyst", "value": "senior analyst"}, {"text": "Senior consultant", "value": "senior consultant"}, {"text": "Senior director", "value": "senior director"}, {"text": "Senior manager", "value": "senior manager"}, {"text": "Software architect", "value": "software architect"}, {"text": "Solution consultant", "value": "solution consultant"}, {"text": "System architect", "value": "system architect"}, {"text": "System engineer", "value": "system engineer"}, {"text": "Systems analyst", "value": "systems analyst"}, {"text": "Systems architect", "value": "systems architect"}, {"text": "Technical trainer", "value": "technical trainer"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Accounting", "value": "/business/naics2007/5412"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Management", "value": "/business/naics2007/55"}, {"text": "Real Estate", "value": "/business/naics2007/53"}, {"text": "Wholesale", "value": "/business/naics2007/42"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Amazon", "value": "/m/0mgkg"}, {"text": "Microsoft", "value": "/m/04sv4"}, {"text": "EPAM Systems", "value": "/m/0dlnrc"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "IBM", "value": "/m/03sc8"}, {"text": "Salesforce", "value": "/m/07btr5"}, {"text": "EY", "value": "/m/0g9jc"}, {"text": "Publicis Sapient", "value": "/m/02myjp"}, {"text": "Randstad", "value": "/m/08pt1z"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Alibaba Group Holding Limited", "value": "/m/07s6ctl"}, {"text": "Avanade", "value": "/m/094456"}, {"text": "Capgemini", "value": "/m/03vlk0"}, {"text": "Comtel Solutions Pte Ltd", "value": "/g/11dxpztgnb"}, {"text": "DELL", "value": "/g/11c54ch2jm"}, {"text": "Ericsson", "value": "/m/02kyh"}, {"text": "HTZ Resources", "value": "/g/11h21p9b4d"}, {"text": "Infinite Computer Solutions Pte Ltd", "value": "/g/11g9mj72yz"}, {"text": "Michael Page", "value": "/m/04cxldw"}, {"text": "OCBC Bank", "value": "/m/055r27"}, {"text": "Orange Business Services", "value": "/m/08zvyz"}, {"text": "Recruitment Hub Asia Pte Ltd", "value": "/g/11dxpww_0f"}, {"text": "TEKsystems (Allegis Group Singapore Pte Ltd)", "value": "/g/11b6g4bkv0"}, {"text": "Talent Trader Group Pte Ltd", "value": "/g/11dxpmlc5b"}, {"text": "Tata Consultancy Services", "value": "/m/01psx8"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "VMware", "value": "/m/01t9k5"}, {"text": "Verizon", "value": "/m/07_dn"}, {"text": "A-Speed Infotech Pte Ltd", "value": "/g/11g9mxswl4"}, {"text": "ABeam Consulting", "value": "/g/11bc6whr_f"}, {"text": "Amazon Web Services (AWS)", "value": "/g/11dxprr2xv"}, {"text": "Amazon Web Services Singapore", "value": "/m/0rznzt1"}, {"text": "Aon", "value": "/m/0z7n"}, {"text": "Avaya", "value": "/m/01sqlk"}, {"text": "Azendian Solutions Pte Ltd", "value": "/g/11dxpvcjj2"}, {"text": "Big Cloud", "value": "/g/11c743lwsr"}]}]}