{"search_metadata": {"id": "60827ed0c56d932264e268b0", "status": "Success", "json_endpoint": "https://serpapi.com/searches/0fa61d4c4c2c590d/60827ed0c56d932264e268b0.json", "created_at": "2021-04-23 08:01:20 UTC", "processed_at": "2021-04-23 08:01:20 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28software+engineer%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=230", "raw_html_file": "https://serpapi.com/searches/0fa61d4c4c2c590d/60827ed0c56d932264e268b0.html", "total_time_taken": 2.16}, "search_parameters": {"q": "(software engineer) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "230"}, "jobs_results": [{"title": "Professional Services Engineer", "company_name": "None", "location": "Singapore", "via": "via Singapore", "description": "Jewel Paymentech is looking for a highly-motivated and self-driven engineer who is detail oriented and enjoys building lasting solutions for customers. We are looking for a well-rounded engineer with business and technical installation and deployment experience. The ideal candidate will have experience with enterprise software installation/configuration, software troubleshooting/debugging, business analysis, and project management.Professional services platform deployment engineers interface closely with our customers' technical points of contact and work very closely with engineering and product management teams. Your insights and interaction with our customers will exert great influence on the functionality and design of the product. Professional services engineers utilize a diverse technical skill set.Core responsibilities include: Ensure member success with thorough project management, meeting deadlines and frequent communication. Install and update core software, interfaces... database and web services. Identify and resolve issues related to activation and implementation of software. Assess member's technical needs and capabilities during implementations. Provide sound recommendations to ensure success. Provide implementation scheduling, resolutions to technical issues and general advice as technical consultant. Provide highly responsive customer service and maintain high level of member satisfaction. Correspond and fulfil all commitments for internal and external customers. Engineer, record and document solutions to common and difficult problems. Learn, implement and teach best practices for implementation and configuration of company products. Collaborate with engineering to improve implementation and configuration of professional service processes. Involve and participate in an on-call rotation for urgent customer needs. Produce and review product documentation and training materials to ensure content accuracy and supportability of Company products. Develop software, tests and tools to ease integration in professional service field. Develop software design and architecture documentation. Requirements BSc/Ba in Information Technology, Computer Science or a related discipline; professional certification (e.g. Microsoft Certified Systems Engineer (MCSE) is a plus Prior experience deploying enterprise class software systems in customer environments Experience with databases, networks (LAN, WAN), VMware Familiarity with various operating systems and platforms Resourcefulness and problem-solving aptitude Excellent communication skills Background in Linux with certifications is a plus Experience in AWS , Azure or Google Cloud is a plus Highly motivated to explore new technologies", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQcm9mZXNzaW9uYWwgU2VydmljZXMgRW5naW5lZXIiLCJjb21wYW55X25hbWUiOiJOb25lIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJmZ1dNYVRLZVZyT0VNdG4zQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFNpbmdhcG9yZSIsImxpbmsiOiJodHRwczovL3NnLmZpZGFudG8uY29tL2pvYnMvam9iLW9wZW5pbmcvZW5naW5lZXJzLWFsbC1vdGhlci9wcm9mZXNzaW9uYWwtc2VydmljZXMtZW5naW5lZXItMjc1NDUxMDUwP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Network Software Engineer", "company_name": "None", "location": "Singapore", "via": "via WhatJobs", "description": "ENTIIS is a total solutions provider specialising in IT Infrastructure and Security Management across all industries.\n\nAt ENTIIS, we dedicate ourselves together with our world class business partner such as CA technologies, Quest One software, RSA and Optimum Path Inc. in helping our customers in digital transformation to streamline and simplify all the business IT processes, such as database management, resource management and allocation, service level management, and ensuring the security of the IT networks and critical business data. The solutions we implement provide our clients with the real-time data and business intelligence they need to make effective business decisions.\n\nDuties and Responsibilities:\n\n· Responsible for provisioning, installation, configuration, operation, and maintenance of network (both wired and wireless) including hardware, software and related infrastructure.\n\n· Responsible to support and maintain the daily network operations (inclusive of LAN, WAN... Security, Connectivity and Monitoring)\n\n· Administer infrastructure system and network services (Firewall, routers, VPN, internet proxy, wireless, etc.)\n\n· Perform regular maintenance to network infrastructure to ensure its' smooth operation\n\nHigh Level Capabilities/Experience:-\n\n· Diploma or higher in Computer Science or Software Engineering\n\n· Possess a strong interest and self-motivation to install, configure and maintain system/network services, equipment and devices.\n\n· Competent and having a sound knowledge (Configure and troubleshoot) of various network protocols and topologies, including a broad knowledge of WLAN, switches, routers, servers, IPS/IDS and firewalls\n\n· Able to perform network monitoring, verifying the integrity and availability of all hardware.\n\n· Relevant experience in monitoring and reviewing performance of network and ability to perform capacity planning\n\n· Familiarity with applying OS patches, firmware and utilities.\n\n· Certification in Network (CCNA) is preferred. Knowledge in Firewalls CISCO, FORTIGATE and CHECKPOINT is preferred.\n\n· Working experience in Virtualization, Windows, Active Directory, DHCP and TCP/IP networking.\n\nInterested and qualified applicants for the above position, please submit comprehensive resumes stating current & expected salary and a recent photograph to:\n\nENTIIS Pte. Ltd.\n\n150, Kampong Ampat, #06-06A KA Centre Singapore 368324\n\nTel: +65 62837378\n\nFax: +65 62826236\n\nEmail: hr\n• Only short-listed candidates will be notified for interviews\n• No phone calls regarding the positions will be entertained, please send in your applications via email", "extensions": ["2 days ago", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJOZXR3b3JrIFNvZnR3YXJlIEVuZ2luZWVyIiwiY29tcGFueV9uYW1lIjoiTm9uZSIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiM1ctVndzUl81Y1cyTWFKV0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBXaGF0Sm9icyIsImxpbmsiOiJodHRwczovL2VuLXNnLndoYXRqb2JzLmNvbS9qb2ItZm9yLU5ldHdvcmstU29mdHdhcmUtRW5naW5lZXItaW4tU2luZ2Fwb3JlLWNvb3AxNzU1NTc5Mj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "System Engineer", "company_name": "Nanyang Technological University", "location": "Singapore (+1 other)", "via": "via Glassdoor", "description": "Reporting to Manager – Infocomm Infrastructure, you will be part of a team assisting in areas of support and maintenance for Lee Kong Chian School of Medicine (LKCMedicine)’s IT infrastructure, digital learning systems, office productivity software, video conferencing and audio-visual systems.\n\nThe details of the duties are as follows:\n• Setup and configure users’ IT-AV systems, including hardware, software, setting up new accounts and disabling expiring accounts.\n• Update all office productivity and security software with latest patches and updates.\n• Manage servicing by vendors on encountered problems and defects.\n• Create purchase requisitions (PR) and ensuring delivery of new hardware and software.\n• Update inventory of assets, including issuance of new assets and write-off of unserviceable assets.\n• Provide immediate response to inquiries by users with regards to IT-AV systems, hardware, and software operations.\n• Interact with users and personnel to establish requirements for... new systems or modifications.\n• Provide administrative support and maintain accuracy of records in daily interactions for the department.\n• Perform any other duties as and when required and/or assigned by Manager/HOD.\n\nRequirements:\n• Minimum diploma or equivalent. Industry certification training in Apple (Apple Certified Support Professional) and/or Microsoft (Microsoft Office Specialist or Microsoft Certified Solutions Expert) or their equivalent would be advantageous.\n• Experience with electronic inventory record-keeping and in performing IT systems support together with customer relations.\n• Proficient in computer productivity software; Microsoft Office 365 suite, Adobe products, Mac OSX office applications, ZOOM, Teams and other similar video conferencing applications and modern web browsers; Edge, Google Chrome, Firefox, Safari and Opera.\n• Proficient in Operating systems; Microsoft Windows 10 and above, Mac OSX 10.13, and mobile operating systems, like Apple IOS and Google Android.\n• Ability to adhere to standard industry IT protocols, including sourcing relevant reference materials.\n• Good written and spoken English.\n• Ability to keep abreast with latest development in IT industry\n• Innovate and always on a lookout for new solutions to problems.\n• Ability to work in a dynamic environment.\n• Team player with excellent interpersonal, communication and presentation skills.\n\nHiring Institution: LKC", "extensions": ["1 day ago", "Full–time"], "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTeXN0ZW0gRW5naW5lZXIiLCJjb21wYW55X25hbWUiOiJOYW55YW5nIFRlY2hub2xvZ2ljYWwgVW5pdmVyc2l0eSIsImNvbXBhbnlfbWlkIjoiL20vMGw0OWsiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJUVkgtejZuTDJwSHlwZWVuQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFcUlDQ3VJQlFVNVZYMDV4VkRKRlRYWnBRMVZaZUU1WlZ6VnFaMVZvZFdaS1pUUjZiVFJKVEVwcGIzcGFUekZJYVVSUE5XRmpXbVUyTTNOd1dtMW1XRzR0T0RRNE0yOXFUV05sTlZGMlpHSlBRa3R4UmtwMFQyZG9iamMyVFcxeFNFdHZXazh3ZVRGbFJsaE9OR05SWjJaNExUTnBkVVJOU0RSM09YaHRWRzk2VUhWRlJsZEhiUzB5YUdGV1IwOVJZM2czVjFGWmNFMVBSMEpmYlhaWFNWUjFXVVJVVG1kMlNXWXhWREJzWXpodWNqVnhiVVZWV1U1aVpGUlFlRFZXVVVReVdYaFVXR05pVjA5NFpXeGtSV2hXVkhaTFpIbDZWaTB6ZFVkTFJGaEdSVXBSWVZSd2R4SVhNRmcyUTFsT1QzcEVaV1ZwTlU1dlVIUjBVeTF4UVRnYUlrRlBUVmxTZDBKSFYwdFZaVE50WmpCTVp6aHlTbWxZTW10YVJsSmhZV3QyWVZFIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMTUiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gR2xhc3Nkb29yIiwibGluayI6Imh0dHBzOi8vd3d3LmdsYXNzZG9vci5zZy9qb2ItbGlzdGluZy9zeXN0ZW0tZW5naW5lZXItbmFueWFuZy10ZWNobm9sb2dpY2FsLXVuaXZlcnNpdHktSlZfSUM0ODQxMTI1X0tPMCwxNV9LRTE2LDQ4Lmh0bT9qbD0zNzMzNjI3NzI5XHUwMDI2dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Senior / Software Engineer (Android+ Kotlin)", "company_name": "EPAM Systems", "location": "Singapore (+1 other)", "via": "via Bayt.com", "description": "EPAM is committed to providing our global team of more than 41,150 EPAMers with inspiring careers from day one. EPAMers think creatively and lead with passion and honesty. Our people are the source of our success. We value collaboration, work in partnership with our customers, and strive for the highest standards of excellence. In today’s market conditions, we’re supporting operations for hundreds of clients around the world remotely. No matter where you are located, you’ll join a dedicated, diverse community that will help you discover your fullest potential.\n\nDESCRIPTION\nWe are looking for an experienced Senior / Software Engineer (Android+ Kotlin) in Singapore to make the team stronger.\n\nExperience in design and implementation of mobile applications for Android is written on React Native using Android and Kotlin. If you’re right for this role, you should have a background in native Android development and be comfortable developing with React Native.\n\nWe Value\nValue the individuals... – We encourage and motivate people to grow. We perceive our people as a source of our success;\nStrive for excellence – We strive for the highest standards of excellence and continuously learn. We take pride in our engineering and accomplishments;\nAct as a team – We treat one another with respect and encourage the best ideas to come from anywhere within the organization. We value our diversity;\nFocus on Customers – We build long term customer relationships, as we strive to always understand our customers' business and needs;\nAct with integrity – We operate legally, honestly and ethically. We take responsibility for our actions.\nResponsibilities\n• Design and development of the public APIs and internal library services\n• New feature implementation, bug fixing, and performance tuning\n• Working closely with the Frontend and Engine teams to integrate new features and unique consumer-facing products\n• Exploring and evaluating new stack components and architecture ideas as necessary\n• Regularly reviewing code\n• Collaborate with product managers & designers, prototyping and bringing breakthrough experiences to our users\n• Add strength to our engineering culture by meeting & setting new standards of engineering, via participating in code review, team discussion & leading by example with solid coding practices\n• Guarantee a smooth user experience by writing well tested & highly performant code\n• Development of the BitMEX React Native mobile application\n• Development of native Android components for the React Native application\n• Maintenance, scaling, and performance tuning for Android\n• Mentoring other engineers on coding practices, design philosophies, and engineering craft\n• Exploring and evaluating new stack components and architecture ideas as necessary\n• Regularly reviewing code\n• iOS experience a plus\nRequirements\n• Bachelor Degree in Computer Science, information technology or relevant\n• Senior Developer - Min 6 – 8 years of Android development experience and at least 2-3 years of experience in kotlin\n• Developer - Min 4 - 6 years of Android development experience and at least 1 year of experience in kotlin\n• Significant experience building native Android applications using Java\n• Significant experience scaling Android applications to a large diversity of devices\n• Experience with Javascript and/or React Native\n• Experience with mobile end-to-end testing\n• Experience making complex, data-driven products accessible to consumers\n• Ability to simultaneously develop several products and concepts in development\n• Familiarity with current UX trends and curiosity for new UX concepts (conversational UI, etc)\n• Demonstrable ability to work in small teams and is willing to take ownership over product features\n• Detail oriented, able to focus, and is comfortable submerging into the depths of code in order to emerge with new insights & a way forward\n• Have passion for technological innovation, with a keen interest in what’s happening in the crypto space\n• Fluent in written and verbal English\n• Ability to communicate at all levels, with both business and technology staff\n• Ability to work independently\n• Open minded, eager to learn and self-motivated\n• Good understanding of Agile methodologies, especially Scrum\nNice to have\n• Familiar with API performance improvements\n• Experience building scalable systems that deliver real-time data over the web\n• Working with databases, AWS/Azure/Cloud\nWe offer\n• Friendly team and enjoyable working environment\n• Work-life balance and flexible schedule\n• Online training library, mentoring, career development and potential partial grant of certification\n• Unlimited access to LinkedIn learning solutions\n• Referral bonuses\n• Compensation for sick leave and paid time off\n• Opportunities for self-realization", "extensions": ["23 days ago", "Full–time"], "detected_extensions": {"posted_at": "23 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgLyBTb2Z0d2FyZSBFbmdpbmVlciAoQW5kcm9pZCsgS290bGluKSIsImNvbXBhbnlfbmFtZSI6IkVQQU0gU3lzdGVtcyIsImNvbXBhbnlfbWlkIjoiL20vMGRsbnJjIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiTTJkbll3WG4xaklRVWUybUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVJQkNxSUJRVTVWWDA1eFUwTXRZbkYxWmxwRU1HeHJRMjFZTVVOcldtdENiVXBQT0ZveFgxQldaa3haYTJoNlNGcFZiMDVzVUZveFJERlNkVjk2VEhaUVdtdHFNbWQ0YkZaeGNuWlFUbWxMVW5sRFRtWmpObm81Y1ZKV2FGWnhUSGczYldOSVVYVldaRmx4Tms1UmNtRmlRMFZXTVZGTVkyNDVURGh6TmtkSFYwRlhZakk1WVhGSVkxcENkRmh0VVdWd2FFcHFUMUpEUldwcFF6aHFhR3czYmpoUGJuTjNFaGN3V0RaRFdVNVBla1JsWldrMVRtOVFkSFJUTFhGQk9Cb2lRVTlOV1ZKM1EyOUtTM2RsVUZGRVgzaEthV0pIVURGSGNIbFZVV3hGVkhaV1VRIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMjMiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQmF5dC5jb20iLCJsaW5rIjoiaHR0cHM6Ly93d3cuYmF5dC5jb20vZW4vc2luZ2Fwb3JlL2pvYnMvc2VuaW9yLXNvZnR3YXJlLWVuZ2luZWVyLWFuZHJvaWQta290bGluLTU5MzAyNjExLz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior Software Engineer", "company_name": "None", "location": "Singapore", "via": "via Jobs | Fidanto", "description": "·Have BS Computer Science or equivalent with minimum 5+ years or more experience in core Service-now implementation, support· ITIL v3 Foundation Certification preferred.· Strong Experience in ServiceNow Customer Service Management implementation, ITSM workflows · Strong Experience (MUST HAVE) in Service Portal · Extensive hands-on experience of working with script-based ServiceNow components such as business rules, script includes, client scripts, UI pages etc .· Good knowledge of ServiceNow development best practices.· Good knowledge of ServiceNow platform administration.· Experience in creating ServiceNow costume applications.· Customizing ServiceNow applications.· Good knowledge on service portal with experience coding in AngularJS.· Architectural and hands-on Integrations experiencewith Enterprise suite applications.· Experience with integrations to other systems using the MID server and direct/Scripted web services.· Knowledge and experience with JavaScript, PowerShell, JSON... REST and SOAP.· Monitor health, environment upgrade/clone, usage and overall compliance of the application.· Good functional knowledge on ITSM,ITOM,CSM and other ServiceNow functions.· Desired ServiceNow Trainings/Certifications: ServiceNow System Administration, ServiceNow Advanced System Administration, Scripting in ServiceNow, ServiceNow Orchestration, Application Development in ServiceNow, ServiceNow Customer Service Management· Strong engineering leadership skills with a proven track record of success on large/highly complex projects preferably in the area of Enterprise Apps and Integration. Must have the ability to communicate technical issues and observations", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgRW5naW5lZXIiLCJjb21wYW55X25hbWUiOiJOb25lIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJSVkRBcS1NNmRWel9QWTMyQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYnMgfCBGaWRhbnRvIiwibGluayI6Imh0dHBzOi8vc2cuZmlkYW50by5jb20vam9icy9qb2Itb3BlbmluZy9zb2Z0d2FyZS1kZXZlbG9wZXJzLXN5c3RlbXMtc29mdHdhcmUvc2VuaW9yLXNvZnR3YXJlLWVuZ2luZWVyLTI3NTQ2ODczMz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Performance QA & Test Engineer", "company_name": "Binance", "location": "Singapore", "via": "via Glassdoor", "description": "Binance is the global blockchain company behind the world’s largest digital asset exchange by trading volume and users, serving a greater mission to accelerate cryptocurrency adoption and increase the freedom of money.\n\nAre you looking to be a part of the most influential company in the blockchain industry and contribute to the crypto-currency revolution that is changing the world?\n\nWe are looking for a talented Performance Test Engineer to join the back-end team of our world class trading platform and work on designing and executing various performance tests.\n\nWith over 10M users and our platform is already the most used crypto-currency trading platforms in the world. We are expanding quickly and hope to encourage adoption of the technology that is positively changing the world.\n\nResponsibilities\n• Collaborate with QA and tech teams to identify system requirements and design performance tests\n• Plan and develop the methodology and approach for regression, base-line, comparison... benchmarking tests\n• Execute various performance tests including load, stress, latency, soak, scalability\n• Define the test strategy to include designing, writing, and executing performance test cases and procedures\n• Drill into performance issues and identify metrics, bottlenecks, and propose solutions\n• Continuously analyze and propose solutions on how application performance can be improved\n\nRequirements\n• 3-5+ years of experience working in a Performance Testing Engineer capacity on high-availability platforms\n• In-depth knowledge and experience working with tools such as: JMeter, LoadRunner, or Neoload\n• Experience executing various performance tests including load, stress, latency, soak, scalability\n• Experience in defining test metrics, conducting the analysis and results reporting\n• At least BS degree in Computer Science, Math or similar\n• Proficiency with Linux\n• Proficiency in any scripting language such as Bash, Python, etc\n• RabbitMQ, Kafka, or similar\n• Ability to conduct Linux performance profiling would be a plus\n• Experience in AWS and distributed applications would be a plus\n\nConditions\n• Do something meaningful; Be a part of the future of finance technology and the no.1 company in the industry\n• Fast moving, challenging and unique business problems\n• International work environment and flat organisation\n• Great career development opportunities in a growing company\n• Possibility for relocation and international transfers mid-career\n• Competitive salary\n• Flexible working hours, Casual work attire", "extensions": ["4 days ago", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJQZXJmb3JtYW5jZSBRQSBcdTAwMjYgVGVzdCBFbmdpbmVlciIsImNvbXBhbnlfbmFtZSI6IkJpbmFuY2UiLCJjb21wYW55X21pZCI6Ii9nLzExaGN6MXI0d2wiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiIyM1NNc24xLXQwa0dBTmp3QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUlCQ3FJQlFVNVZYMDV4VVhST1MzWlJSRXRVU25Vd1pXeDFWVFZWY3pjNU1YVnVMVlEzVTFoUldYTXhZWFppVDFoWVlXSTRVRTlYUm04M2RFZFNkRFpIWDIxbFpTMTJWVmxVTm0xdWJFcEpTMTlTWlZKRWFuTXpjVlUzVm1jMmJGUm1aaloyVUVWR1owaE9PVGt0ZFdoVE9XZzVYM0ZLUm5OMVFYazJUa1JyT1dkR1dHbEVjMEZ3VUZCV1JIRTFjbnBoT0RsTFdqQmFUWFp3VHpGS1h6bFBNa2MzWkhwM0VoY3dXRFpEV1U1UGVrUmxaV2sxVG05UWRIUlRMWEZCT0JvaVFVOU5XVkozUkdkRk1VODRXWEZMWlhaTFNtVnlUbkl4ZVMxYU9FZE9WWGgyZHciLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18zNSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBHbGFzc2Rvb3IiLCJsaW5rIjoiaHR0cHM6Ly93d3cuZ2xhc3Nkb29yLnNnL2pvYi1saXN0aW5nL3BlcmZvcm1hbmNlLXFhLXRlc3QtZW5naW5lZXItYmluYW5jZS1KVl9JQzMyMzU5MjFfS08wLDI4X0tFMjksMzYuaHRtP2psPTQwMTAyNDc5NzdcdTAwMjZ1dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "DevOps Engineer", "company_name": "SnapHunt Pte Ltd", "location": " (+1 other)", "via": "via Monster Singapore", "description": "The Offer\n• Work with best in class talent to design innovative solutions that will disrupt various industries\n• Attractive salary & benefits\n\nThe Employer\n\nOur client is a venture capital firm that invests in startups with significant impact on society. They are committed to helping them reach the next level with highly unique perspective from investing in startups across 9 countries. With a wide range of startups, they are seeking for talented individuals for roles in their portfolio companies.\n\nThe Job\nYou will be responsible for :\n• Providing expertise on all matters related to CI, CD and DevOps\n• Administering cloud-based Infrastructure deployment including provisioning/de-provisioning of resources, maintaining security posture, user administration, monitoring computing resource utilization, network setup, backup/restore and incident management.\n• Building and maintaining highly available production systems.\n• Creating and maintaining documentation pertaining to architecture.\n•... Developing and maintaining release related documents, such as release plan, release notes etc.\n• Ensuring quality releases and managing release and configuration change conflicts to resolution.\n• Tracking release and publishing release notes.\n• Investigating and resolving technical issues by deploying updates/ fixes.\n• Working with the team to identify and implement new technologies.\n\nThe Profile\n• You possess a Degree/Diploma in Computer Science, Engineering or related field and have previously worked as a DevOps Engineer or Backend Engineer.\n• You have solid experience within release management, infra architecture, CI&CD.\n• Having a AWS certification is a plus.\n• You are highly goal driven and work well in fast paced environments\n• You pay strong attention to detail and deliver work that is of a high standard\n• You possess strong analytical skills and are comfortable dealing with numerical data\n\nRef: 76800075", "extensions": ["3 days ago", "Full–time"], "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJEZXZPcHMgRW5naW5lZXIiLCJjb21wYW55X25hbWUiOiJTbmFwSHVudCBQdGUgTHRkIiwiY29tcGFueV9taWQiOiIvZy8xMWM3NHQ2MXc4IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiTkxQV3FKMGU3dk9BVkNsU0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZjQkNyY0JRVTVWWDA1eFVsUlNOMU5yYkc1Rk5Fb3hhVmcxYVZWcllrWnJUelJrYWpoeFFucFVaVkEyVWsxQ1FtcHFWSGxhY25OZmNqUmZiMnN0TnpKS1kycEVaV2huUzFSQmFYSlZXakpqY205T2FFbE9RbU5vTkRCeVMwcEhkMVZmYTBsc1FqRkNSa3ByY21rd1prSmtNMHRSU2s0eGNXZGFRV3hhZG5KTVdVOW5jRkpVTXpGSE1rTnBWSHBxYWpCMlQyMWZjbUZVZFRWWFJISlhNRWhaTWpRM2VUaHJlR3haWWsxM1JVeGlaVWh1UkU1bk5uSTBkRjl2RWhjd1dEWkRXVTVQZWtSbFpXazFUbTlRZEhSVExYRkJPQm9pUVU5TldWSjNSR1oyY1cxTGRXaHpZbXhQY21aSVdHMUJaV0puWlV0MFNYQjNRUSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzQzIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1vbnN0ZXIgU2luZ2Fwb3JlIiwibGluayI6Imh0dHBzOi8vd3d3Lm1vbnN0ZXIuY29tLnNnL2pvYi9kZXZvcHMtZW5naW5lZXItc25hcGh1bnQtcHRlLWx0ZC1zaW5nYXBvcmUtMTU1ODc5Mz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Software Developer", "company_name": "ACP Computer Training & Consultancy Pte Ltd", "location": "Singapore (+1 other)", "via": "via Jobs", "description": "ACP Computer Training & Consultancy Pte Ltd Ang Mo Kio SGD 5,000 - SGD 7,000 Posted on 6-Apr-21 Software Developer ACP Computer Training & Consultancy Pte Ltd Job DescriptionThink you have what it takes to be a good Software Developer? Join LOOP now and be involved in driving our expansion into the Learning Management System (LMS) market globally! Our company ACP has an extensive presence across the South East Asia and are at the front line of providing a diversified range of Educational Technology solutions for our clients. The Software Developer will provide solutions in development and maintenance, as well as rapid prototyping and technical documentation support. With this role, you will be exposed to numerous opportunities for personal and professional growth. LOOP (A.I. & mobile learning) is an e-learning brand under ACP and we play a role in this new digital market. Our experienced team seeks to seize the opportunity to build a simple and yet, easy to use learning management... system that can be easily adopted by all organizations, big and small. Opportunity to be involved in a project to provide LMS access to 4 million users by 2024! High performing team consisting of Developers, UX Specialist and Business Analyst Results-based, not time based approach Develop proof of concepts and technical designs Installation and configuration of plug-ins Manage software development, enhancement, debugging, testing and maintenance of the backend application Make design, code, testing and system quality improvement to backend application programming interface (API) Technical documentation Mandatory requirements IT, Computer Science background or equivalent Good communication skills to liaise with internal and external stakeholders Provide tangible solutions and work-arounds to complex issues Highly motivated with sense of ownership Relentless in nature to oversee tasks from end-to-end towards completion Candidates with 5 or more years of relevant experience may be considered for Senior Software Engineer role which will involve managing a team of developers and interfacing with customer on requirements and deliverables Preferred requirements Strong in both front-end and back-end Experience in developing PHP or web-based applications Prior experience with LMS projects Familiar with Moodle, Totara or similar platforms Additional Information Junior Executive Qualification ACP was incorporated in 1997 as an Information Communications & Technology (ICT) Service Provider. ACP set the vision to adopt technology in classroom training for the students Singapore. Hence, with the evolving technology landscape, we have grown and expanded our services. At ACP we remain our passion in training and have served corporates, individual adults and students. With our years of classroom training experience, we have also developed and customised online training platforms for trainers. This would help us to truly understand their needs. ACP believe that both training and learning are important to everyone. We are constantly improving our training methodologies and delivery to better engage our learners.ACP is customer centric and believes that customers’ testimonials are fundamental to our growth. We are proud to be the first Small Medium Enterprise (SME) to attain the Quality Management System (QMS) ISO 9001 certification back in 2010. Since then, we continue our passion in serving and uphold our QMS standard as ISO 9001: 2015. In addition to that, recently we are awarded Bizsafe Level 3.We work with many reputable partners, striking win-win strategic alliance to excel in ICT field. Our partners include SingTel, Adobe, Microsoft, Articulate and many more. Having built our stronghold in Singapore, we have also extended our presence to other countries. We can now be seen in Philippines, China as well as Indonesia. ACP is committed to sustain Singapore branding in overseas.We are excited with the ever-changing digital landscape. Moreover we are dedicated in our mission:Bring Training To You and Bring You To Training.Additional Company Information Registration No. 199800956M Company Size 51 - 200 Employees Average Processing Time 18 days Computer / Information Technology (Software) Benefits & Others Education support, Miscellaneous allowance, Medical, Loans, Vision, Regular hours, Mondays - Fridays, Casual (e.g. T-shirts), Health Incentive", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBEZXZlbG9wZXIiLCJjb21wYW55X25hbWUiOiJBQ1AgQ29tcHV0ZXIgVHJhaW5pbmcgXHUwMDI2IENvbnN1bHRhbmN5IFB0ZSBMdGQiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Ik1IVGdKNDJDMnRJdF9KQXJBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9icyIsImxpbmsiOiJodHRwczovL3NnLmZpZGFudG8uY29tL2pvYnMvam9iLW9wZW5pbmcvc29mdHdhcmUtZGV2ZWxvcGVycy1hcHBsaWNhdGlvbnMvc29mdHdhcmUtZGV2ZWxvcGVyLTI3NTQ5MTI1OD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Testing Engineer", "company_name": "Fusion Worldwide", "location": "Singapore (+1 other)", "via": "via Glassdoor", "description": "Position Summary:\n\nAs a member of our organization, you are responsible for CPU/IC testing and go/no-go decisions on CPU/IC's that go through the test center. Completes testing process and ensure that proper actions are being taken to screen for part quality/counterfeit and conformity. Exhibits proper use and maintenance use of all test tools and equipments\n\nWhat we can do for you!\n• Provide training to give you the knowledge to thrive in a fast-paced environment\n• Offer support through a collaborative, and open environment with proven professionals with decades of QC expertise\n• Enable growth through direct and focused mentorship\n\nWhat can you do for us!\n• Responsible for testing of CPU/IC product based on customer requirements or results of incoming inspection.\n• Conducts tests on inbound CPU/IC according to the process doc and customer requirements. Reports results to Quality, Warehouse, and Commodity Managers as well as recording in RMS.\n• Proper disposition of CPU/IC once testing... is completed to ensure that CPU/IC that pass go into good locations and those that fail are quarantined.\n• Maintain and update proper software revisions and bios updates for all CPU/IC tests.\n• Ensure proper completion of all test processes.\n• Provide maintenance on boards and equipment as needed to maintain proper operation of the boards.\n• Proper handling and ESD protection of all CPU's\n• Maintaining board database as new platforms are brought into operation.\n• Review metrics related to test results.\n• Provide monthly updates on activities and improvements made on processes.\n• Work with the team to further strengthen and improve test processes with a goal of 0 defects\n• Suggest improvements in workflow and equipment to make testing more efficient and effective.\n\nWho we're looking for!\n• At least 3 years of work experience in the Semicon/Electronics or related industry\n• Good knowledge of quality systems and QA principles, practices and standards\n• A high-energy, smart, and persistent individual, driven to succeed and revolutionize an industry\n• Proficient with standard business tools (email, voicemail, MS Office 365, etc.)\n• Ability to juggle multiple tasks and inputs in a fast-moving environment\n\nEstablished in 2001, Fusion Worldwide is a premier, global open market distributor of electronic components with an established reputation of excellence in sourcing, quality, and outstanding customer support. Solving supply chain disruptions is where we are truly able to provide key service to all our customers, and we are looking for motivated individuals like you to join this rapidly growing industry! With our company headquarters located in the scenic Boston Seaport area, we also have key locations in Amsterdam, Singapore, Munich, Guadalajara, Seoul, and San Francisco. At our current rate of growth, we are continuously expanding our global footprint to reach all corners of the world, and we are dedicated to finding top talent to help us grow in all regions", "extensions": ["4 days ago", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJUZXN0aW5nIEVuZ2luZWVyIiwiY29tcGFueV9uYW1lIjoiRnVzaW9uIFdvcmxkd2lkZSIsImNvbXBhbnlfbWlkIjoiL2cvMWhmdDJrZl8wIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiSW0zTU9BZnFZM0pHazRZekFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXZjQkNyY0JRVTVWWDA1eFUyeHhOV0Z6VEU5eGFuUnJhV0ZGU2toTWFFWkJiSGx0ZVVFd2JHdE9NVTlCZDA5VlRTMW1OSFE1VGxoU1UyUkxZMGhIUkZsalpEUnBXVXhLYkROaUxXODVlSFIwUnkxa09WTm5XV1ppUW5KNVQwRXpSMWhDZUVSc1IxQk1iR2xxT0dsWWVHbHFiV1ZJU3pnM1NWTTJWbFpCUWpaSVVUaFNTVkpHYlRGdk5YWTBZa0ZXYld4QmJWZENkMjk0YnpsSWNVdG1UR3hHWDNkdmNFOHpTbXB5VW5GSFUwdFNhR0p0Y1c5aFlrOXNjMVpKRWhjd1dEWkRXVTVQZWtSbFpXazFUbTlRZEhSVExYRkJPQm9pUVU5TldWSjNRa2RHYUdSMFgyWTJiVlV4ZEc1U1NHOXRUR3RTYUdOb01GUkhRUSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzU0IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEdsYXNzZG9vciIsImxpbmsiOiJodHRwczovL3d3dy5nbGFzc2Rvb3Iuc2cvam9iLWxpc3RpbmcvdGVzdGluZy1lbmdpbmVlci1mdXNpb24td29ybGR3aWRlLUpWX0lDMzIzNTkyMV9LTzAsMTZfS0UxNywzMy5odG0/amw9MzcwNDYyMjU5OFx1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Senior Software Engineer (Fullstack) - Data Product Development", "company_name": "VISA", "location": "Singapore", "via": "via Bayt.com", "description": "Job Description and Responsibilities\n\nQualifications", "extensions": ["28 days ago", "Full–time"], "detected_extensions": {"posted_at": "28 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgRW5naW5lZXIgKEZ1bGxzdGFjaykgLSBEYXRhIFByb2R1Y3QgRGV2ZWxvcG1lbnQiLCJjb21wYW55X25hbWUiOiJWSVNBIiwiY29tcGFueV9taWQiOiIvbS8wMWtxam4iLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJfLVdILXl1R3J5WGJJb1FpQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFc3dCQ293QlFVNVZYMDV4VkdOUFIxVkNhM0ZWZDNGRmFWbFdiRlp6Wm1WRmNHdGtWWEZKY1ZOS04zTlJXVlJKYW14MVpXSmxaVWhhUkc5MWJsZFNNVWxMUjB0WkxWSmplREUyVkhRelJtcEZjekZtUkRobGFrMWtNazF0YmsxV1ExTkZVa0pyUkV0c2ExcEJUR2xEWlZreWRHSlhTRmhNTTJwZmQyMXRkelZUVURkWWVYQTFVM05ZY2w5YWFVeHFabEVTRnpCWU5rTlpUazk2UkdWbGFUVk9iMUIwZEZNdGNVRTRHaUpCVDAxWlVuZERaMlZ1T0ZaRFNHVkJORTVTWDB0VWVDMXlORWt0ZEdRNVprSjMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY182MSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCYXl0LmNvbSIsImxpbmsiOiJodHRwczovL3d3dy5iYXl0LmNvbS9lbi9zaW5nYXBvcmUvam9icy9zZW5pb3Itc29mdHdhcmUtZW5naW5lZXItZnVsbHN0YWNrLWRhdGEtcHJvZHVjdC1kZXZlbG9wbWVudC01OTI0ODUzMS8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}], "chips": [{"type": "Title", "param": "job_family_1", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Software engineer", "value": "software engineer"}, {"text": "Engineer", "value": "engineer"}, {"text": "Senior", "value": "senior"}, {"text": "Cloud engineer", "value": "cloud engineer"}, {"text": "Test engineer", "value": "test engineer"}, {"text": "Research engineer", "value": "research engineer"}, {"text": "Assurance engineer", "value": "assurance engineer"}, {"text": "It engineer", "value": "it engineer"}, {"text": "Java engineer", "value": "java engineer"}, {"text": "Qa engineer", "value": "qa engineer"}, {"text": "System engineer", "value": "system engineer"}, {"text": "Data engineer", "value": "data engineer"}, {"text": "Devops engineer", "value": "devops engineer"}, {"text": "Network engineer", "value": "network engineer"}, {"text": "Principal engineer", "value": "principal engineer"}, {"text": "Quality engineer", "value": "quality engineer"}, {"text": "Solutions engineer", "value": "solutions engineer"}, {"text": "Technical", "value": "technical"}, {"text": "Assistant manager", "value": "assistant manager"}, {"text": "Associate", "value": "associate"}, {"text": "Associate engineer", "value": "associate engineer"}, {"text": "Automation", "value": "automation"}, {"text": "Design engineer", "value": "design engineer"}, {"text": "Development engineer", "value": "development engineer"}, {"text": "Development manager", "value": "development manager"}, {"text": "Engineering manager", "value": "engineering manager"}, {"text": "Firmware engineer", "value": "firmware engineer"}, {"text": "Frontend engineer", "value": "frontend engineer"}, {"text": "Hardware engineer", "value": "hardware engineer"}, {"text": "Lecturer", "value": "lecturer"}, {"text": "Manager", "value": "manager"}, {"text": "Network systems", "value": "network systems"}, {"text": "Officer", "value": "officer"}, {"text": "Principal", "value": "principal"}, {"text": "Product engineer", "value": "product engineer"}, {"text": "Programmer", "value": "programmer"}, {"text": "Project officer", "value": "project officer"}, {"text": "Research associate", "value": "research associate"}, {"text": "Science", "value": "science"}, {"text": "Security engineer", "value": "security engineer"}, {"text": "Senior engineer", "value": "senior engineer"}, {"text": "Senior lecturer", "value": "senior lecturer"}, {"text": "Senior system", "value": "senior system"}, {"text": "Senior technical", "value": "senior technical"}, {"text": "Services engineer", "value": "services engineer"}, {"text": "Software architect", "value": "software architect"}, {"text": "Software engineering", "value": "software engineering"}, {"text": "Specialist", "value": "specialist"}, {"text": "Stack engineer", "value": "stack engineer"}, {"text": "Systems analyst", "value": "systems analyst"}, {"text": "Systems engineer", "value": "systems engineer"}, {"text": "Technical marketing", "value": "technical marketing"}, {"text": "Testing engineer", "value": "testing engineer"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Advertising", "value": "/business/naics2007/5418"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Wholesale", "value": "/business/naics2007/42"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Rental", "value": "/business/naics2007/532"}, {"text": "Staffing", "value": "/business/naics2007/5613"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": ".AB4Jjf.qPB6Vc{padding-right:11px}.qfpP8d{padding:7px 0 7px 11px}.S003Ke{flex:none}.ZoN4Lb{color:rgba(0,0,0,.54)}.nAXVG{color:#70757a}.IxQsL{color:rgba(0,0,0,.26)}.xFO1De{color:#fff}.ooFpK{color:rgba(255,255,255,.30)}.mtnwac{color:#4285f4}.WxeeKb{color:#34a853}.hIVRU{color:#f29900}.EXaTMc{color:#fbbc04}.sxn46d{color:#000}.gqMTF{color:#1a73e8}.zpn8Mb{color:#d93025}.dEUPmd{color:#1e8e3e}.PJNo1{color:#fbbc04}Actively Hiring", "value": "e"}, {"text": "EPAM", "value": "/m/0dlnrc"}, {"text": "VISA", "value": "/m/01kqjn"}, {"text": "Nanyang Technological University", "value": "/m/0l49k"}, {"text": "Singtel", "value": "/m/020zfl"}, {"text": "Zühlke", "value": "/g/1hh_rg216"}, {"text": "HCL SINGAPORE PTE. LTD.", "value": "/g/11fy25ngsv"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "Experis Singapore", "value": "/g/11dxpnwm3s"}, {"text": "OakTree Consulting", "value": "/g/11g70jfhtq"}, {"text": "Realtek Malaysia", "value": "/m/05wrm7"}, {"text": "TikTok", "value": "/g/11fy265933"}, {"text": "UST", "value": "/m/08kb8g"}, {"text": "UrbanFox", "value": "/g/11ghs7y0w6"}, {"text": "Activate Interactive Pte Ltd", "value": "/g/11dxq192l5"}, {"text": "Cardinal Health", "value": "/m/040vzx"}, {"text": "Cognizant", "value": "/m/03bf9h"}, {"text": "Collins Aerospace", "value": "/m/0kv61y1"}, {"text": "Credit Agricole Group", "value": "/m/028vbm"}, {"text": "DELL", "value": "/m/0py9b"}, {"text": "EPS Consultants Pte Ltd", "value": "/g/11gbxgscvy"}, {"text": "GlobalTix Pte Ltd", "value": "/g/11dxpqdhrf"}, {"text": "HCL Technologies", "value": "/m/0698gv"}, {"text": "Jobline Resources Pte Ltd", "value": "/g/11gp2647pn"}, {"text": "Metropolitan Wireless International Pte Ltd", "value": "/g/11g9m_xbc4"}, {"text": "Microsec", "value": "/g/11f00w21ts"}, {"text": "NCS PTE. LTD.", "value": "/m/0282746"}, {"text": "PALO IT", "value": "/g/11dxpwj75r"}, {"text": "Singapore Press Holdings Limited", "value": "/m/0d7mwh"}, {"text": "Techgig", "value": "/g/11c73fxgwt"}, {"text": "Thales DIS (Singapore) Pte. Ltd.", "value": "/g/11f0197yrz"}, {"text": "Thales Group", "value": "/m/01phj4"}, {"text": "Zendesk", "value": "/m/0wkm4pl"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "Aryan Solutions", "value": "/g/11dxptv4s4"}]}]}