{"search_metadata": {"id": "608279eb34ff9546d63aed39", "status": "Success", "json_endpoint": "https://serpapi.com/searches/ff86ec003a424dcd/608279eb34ff9546d63aed39.json", "created_at": "2021-04-23 07:40:27 UTC", "processed_at": "2021-04-23 07:40:27 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28system+analyst%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=90", "raw_html_file": "https://serpapi.com/searches/ff86ec003a424dcd/608279eb34ff9546d63aed39.html", "total_time_taken": 3.89}, "search_parameters": {"q": "(system analyst) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "90"}, "jobs_results": [{"title": ".NET IT Analyst, Senior, Lead", "company_name": "Ethos Search Associates Pte Ltd", "location": "Singapore", "via": "via Jobs", "description": "These will be continuously renewable contract positions. There are multiple positions ranging from IT Analyst, Senior IT Analyst, and Technical Lead depending on skills. Please indicate which position you are interested in when applying. Thank you. Job Scope: ensure all the applications systems remain in good working order. support new application systems when they become operational. respond to production emergencies in a timely manner. This includes bringing up the server (in a crash) or system processes, fixing problems or finding workarounds. diligently perform routine checks and to escalate any anomaly detected, to alert and conduct troubleshooting together with other system engineers, database administrator (DBA) and outsourced vendors. meet the Service Level Agreement (SLA) timelines. follow through every issue / problem till closure; and complete the necessary documentation. assist users and answer queries regarding the supported operationalsystems. interact with the helpdesk... agents, end-users and external vendors during application support and problem resolution. standby support on weekends / public holidays. In the event of scheduled downtime or during a crash, required to be in office during off-office-hours to support the systems. make some code changes/enhancements that arise from service requests. tracking and management of the project timelines and resources that he/she has been assigned to undertake. understudy and undertake the development of new applications and maintenance of any existing systems work independently with minimum supervision, also work effectively as a team member among the system support and application development teams. Core Requirements: Bachelor Degree in Information Technology (IT), Computer Engineering, Computer Science or equivalent. 2 (5 for Senior, 8 for Lead) years of work experience in IT development with full SDLC exposure. Additional skill Requirements: IT Analyst 1 system analysis and design; designing, developing and maintaining web applications. IT Operational Support, Service Desks/Help Desk, service level agreement. Microsoft .Net framework (ASP.NET), .NET Core framework, MVC and be proficient in C#.NET. JavaScript, AJAX, JQuery, JSON and XML. Microsoft SQL Server, relational database schema design, SQL queries/stored procedures. SOAP and/or REST based web services and APIs. analytical tools, preferably Splunk. supporting mobile applications. using marketing communications products to send Electronic Direct Mailers (EDM). AWS services including AWS S3, AWS Kinesis Firehose and AWS Athena. AWS Pinpoint. 2 years of work experience in Singapore IT Analyst 2 system analysis and design; designing, developing and maintaining web applications. analysis, design and integration for integrated systems, including developing file interfaces. development and maintenance support on: a) ASP .NET, C# .NET, JavaScript, AJAX, HTML 5, CSS, JQuery, JSON, XML, BOOTSTRAP b) Web Services development and integration using SOAP and/or REST based web services c) Framework including .Net Core and MVC (preferably with .Net Framework 4.7.2 and above) Microsoft SQL Server; SQL queries/stored procedures. database design and encryption methodologies. designing and development of Proof-Of-Concept. logging framework, such as Serilog. RabbitMQ and Redis message-broker implementations. Microsoft certifications MCTS and/or MCPD in C# .NET. analytical tools, preferably Splunk. cloud-based (AWS/Azure/GCP) implementations. batch scripting (.bat and .vbs). 1 year of work experience in Singapore. Senior IT Analyst 1 certified in Amazon Web Services like AWS Certified Cloud Practitioner or better. certified in Microsoft Azure platform. Google Cloud services. container technology like Docker, Docker Swarm or Kubernetes. C# (NET) or other C-based programming language (e.g. PHP, PERL, C++) front-end technologies like HTML5, jQuery, JavaScript and CSS. front-end framework like Angular, AngularJS, REACT, or equivalent. NodeJS or Python. SQL technology like MSSQL, MySQL, PostgreSQL, MariaDB, or equivalent; SQL queries or stored procedures. NoSQL like MongoDB, CouchDB, or equivalent. Service Oriented Architecture (SOA); integrating application using SOAP or REST. mobile app development, e.g. Android Development Platform or iOS Development Platform. chatbot technology like Dialogflow, Google Action, LUIS. WIT.AI, AWS Lex, or equivalent. continuous integration and continuous delivery. agile projects using SCRUM or equivalent. Data Analytics tools like QlikSense, Google Data Studio, Amazon QuickSight, or Microsoft PowerBI. working experience in government agency environment; exposure to IM8, WOGAA, Digital Standards. 1 year of work experience in Singapore. Senior IT Analyst 2 certified in Amazon Web Services like AWS Certified Cloud Practitioner or better. certified in Microsoft Azure platform. Google Cloud services. container technology like Docker, Docker Swarm or Kubernetes. C# (NET) or other C-based programming language (e.g. PHP, PERL, C++) front-end technologies like HTML5, jQuery, JavaScript and CSS. front-end framework like Angular, AngularJS, REACT, or equivalent. NodeJS or Python. SQL technology like MSSQL, MySQL, PostgreSQL, MariaDB, or equivalent; SQL queries or stored procedures. NoSQL like MongoDB, CouchDB, or equivalent. Service Oriented Architecture (SOA); integrating application using SOAP or REST. mobile app development, e.g. Android Development Platform or iOS Development Platform. chatbot technology like Dialogflow, Google Action, LUIS. WIT.AI, AWS Lex, or equivalent. continuous integration and continuous delivery. agile projects using SCRUM or equivalent. Content Search technology like Alfresco Content Management System, EBSCOHOST Discovery Services, Google Enterprise Search, or equivalent. working experience in government agency environment; exposure to IM8, WOGAA, Digital Standards. 1 year of work experience in Singapore. Senior IT Analyst 3 & 4 Microsoft .NET and front-end technologies (i.e. ASP.NET, C#, HTML/DHTML, CSS, JavaScript, JQuery and AJAX). Service Oriented Architecture (SOA), development and integration using SOAP and/or REST based web services. Microsoft SQL Server; relational database schema design; SQL queries/stored procedures on Microsoft SQL Server. implementing web application that is able to handle both Unicode (e.g. English) and non-Unicode (e.g. Myanmar script) based languages. harvesting and parsing web pages for targeted information. implementing web application using Responsive Web Design. development interacting with Alfresco Content Management System using Lucene queries. application running on Linux, Apache, MySQL,PHP (LAMP) or Java. analytical tools, preferably Splunk. code scanning tools, preferably Fortify. streaming technology (e.g. media streaming) batch scripting (.bat and .vbs). Requirements and impact analysis IT operational support Project management support 5 years of work experience in Singapore Technical Lead 1 application systems with large volumes of transactions (100,000) per day. configuration management, and thus be able to track specifications; control and streamline changes; maintain and improve system performance by using suitable tools and methodologies; and manage project documentations. planning, executing and leading testing team for integrated systems. inventory management; liaise with system/network teams and/or vendors for infrastructure maintenance. ITIL V3 Foundations certification. ASP .NET, C# .NET, JavaScript, AJAX, HTML 5, CSS, JQuery, JSON, XML, BOOTSTRAP Web Services development and integration using SOAP and REST based web services file interfaces and batch jobs, downstream impact and data flow with other systems. Library metadata standards such as MARC and/or MARC21 format. test strategy for web-based and mobile applications. 3 years of work experience in Singapore Technical Lead 2 designing, developing and maintaining web applications using Microsoft .NET and front-end technologies, specifically ASP.NET, C#, HTML/DHTML, CSS, JavaScript, JQuery and AJAX, Service Oriented Architecture (SOA), developing applications and integration using web services in C# .NET with SOAP, REST, WSDL, XML and JSON based web services. designing, developing and maintaining web widgets/components using AngularJS, HTML5, CSS4 and WebComponent. designing, developing and maintaining website that support Responsive Web Design (RWD) using front-end open-source framework such as Twitter Bootstrap and UX web technologies such as CSS3, Media Queries and AngularJS. development and system support on SOLR search engine. Digital Library Standard using METS/ALTO formats. data analytics, with experience using automated tools in the area of personalization and recommendation. Schema.org implementation. social media development. lead and guiding team members/peers/developers. cloud-based (e.g. AWS/Azure/GCP) implementations. Linux/Apache/MySQL/Php/Perl (LAMP). Requirements and impact analysis IT operational support Project management support 5 years of work experience in Singapore Multiple .NET Developer contract positions Skills: .NET, Asp.net, C#, Dotnet, Soap, Rest, Mysql, Json, Jquery, Ajax, Mvc, Edms, Aws, Web Service, Amazon Web Service, Azure, Bootstrap, Html, Css, Batch Scripting, Mcts, Splunk, Php Mysql, Pearl, React Native, Angular Js, Mariadb, Docker, Javascript, Scrum, Agile, Android, Iphone, Ios Experience: 2.00-12.00 Years Education: Bachelors/ Degree", "extensions": ["22 days ago", "Contractor"], "detected_extensions": {"posted_at": "22 days ago", "schedule_type": "Contractor"}, "job_id": "eyJqb2JfdGl0bGUiOiIuTkVUIElUIEFuYWx5c3QsIFNlbmlvciwgTGVhZCIsImNvbXBhbnlfbmFtZSI6IkV0aG9zIFNlYXJjaCBBc3NvY2lhdGVzIFB0ZSBMdGQiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IllSNnN2QmJiUDgwRG45ODVBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9icyIsImxpbmsiOiJodHRwczovL3NnLmZpZGFudG8uY29tL2pvYnMvam9iLW9wZW5pbmcvaW5mb3JtYXRpb24tdGVjaG5vbG9neS1wcm9qZWN0LW1hbmFnZXJzL25ldC1pdC1hbmFseXN0LXNlbmlvci1sZWFkLTI2NTA0NDczMT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior IT Analyst-NET", "company_name": "Rma Contracts Pte. Ltd.", "location": "Singapore", "via": "via Monster", "description": "Title: Senior IT Analyst\n\nJob Type: Contract- 12 Months\n\nLocation: East, Singapore\n\nRequirements\n• Bachelor’s degree in Information Technology (IT), Computer Engineering, Computer Science, or equivalent.\n• The Candidate shall have a minimum of FIVE (5) years working experience in working experience in the IT industry, with exposure to end-to-end software development lifecycle (SDLC), system analysis and design, application development, and operational support and maintenance.\n• Minimum of ONE (1) year of work experience in Singapore, and thus to have minimally equipped well in understanding and meeting the user requirements.\n• The Candidate shall have be certified in Amazon Web Services like AWS Certified Cloud Practitioner or better. Please provide verifiable evidence, like YourAcclaim.com, or equivalent.\n• The Candidate is preferred to be certified in Microsoft Azure platform. Please provide verifiable evidence, like YourAcclaim.com, or equivalent. The Candidate is preferred to have... experience or certification in Google Cloud services. Please provide verifiable evidence, like YourAcclaim.com, or equivalent.\n• Preferred to have working experience with container technology like Docker, Docker Swarm or Kubernetes.\n• Proficient in C# (NET), or equivalent C-based programming language like PHP, PERL, C++, and C.\n• Proficient in front-end technologies, like HTML5, jQuery, JavaScript, and CSS.\n• The Candidate is preferred to be experienced with front-end framework like Angular, AngularJS, REACT, or equivalent.\n• Preferred to have working experience with NodeJS.\n• Proficient in SQL technology like MSSQL, MySQL, PostgreSQL, MariaDB, or equivalent and be proficient in writing optimized SQL queries or stored procedures.\n• Preferred to have working experience with NoSQL like MongoDB, CouchDB, DynamoDB, or equivalent.\n• Working experience in Service Oriented Architecture (SOA) by having integrating application using SOAP or REST services before.\n• Preferred to have working experience with chatbot technology like Dialogflow, Google Action, LUIS. WIT.AI, AWS Lex, or equivalent.\n• Preferred to have working experience in continuous integration and continuous delivery like Jenkin, Spinnaker, Bamboo, CodePipeline, or equivalent.\n• Preferred to have working experience with Content Search technology like Alfresco Content Management System, EBSCOHOST Discovery Services, Google Enterprise Search, CloudSearch, Apache Solr/Lucene, or equivalent.\n• Preferred to have working experience with EZProxy access and authentication software.\n• The Candidate is preferred to have working experience in agile projects using SCRUM, or equivalent.\n• The Candidate is preferred to have working experience in government agency environment in the past 5 years with exposure to IM8, WOGAA, Digital Standards, and/or other Singapore government security policies compliance requirements\n• Shall have a good command of English and effective communications skills to be able to interface with project teams, end-users to gather user requirements, communicate the proposed solution, conduct user acceptance testing, end-user training, and trouble resolution with helpdesk agents and external vendors", "extensions": ["15 days ago", "Full–time"], "detected_extensions": {"posted_at": "15 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgSVQgQW5hbHlzdC1ORVQiLCJjb21wYW55X25hbWUiOiJSbWEgQ29udHJhY3RzIFB0ZS4gTHRkLiIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiNkEzWnRHalUwbGJ0Nm5hdUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNb25zdGVyIiwibGluayI6Imh0dHBzOi8vd3d3Lm1vbnN0ZXIuY29tLnNnL2FtcC9qb2ItdmFjYW5jeS1zZW5pb3ItaXQtYW5hbHlzdC1uZXQtcm1hLWNvbnRyYWN0cy1wdGUtbHRkLXNpbmdhcG9yZS0yNzYyNzUzMS5odG1sP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Senior Software Engineer - 19386-JOB", "company_name": "ILLUMINA SINGAPORE PTE. LTD", "location": "Singapore", "via": "via Jobs | Fidanto", "description": "Work as part of Agile scrum team (geographically distributed) to design, implement, and test our bioinformatics software that enables researchers, scientists, geneticists and clinicians manage the complex workflows required to successfully sequence the genome Transform operational/customer needs into technical description and design specification for a software system Lead the requirement gathering process and perform requirement analysis and risk analysis Assume the role of a product owner in an agile scrum team Develop, manage and prioritize the team’s product backlog Act as the primary liaison to product manager, customer support and other development teams to coordinate inter-dependencies to fulfill overall product delivery Work with overall system owner and project office to align team’s delivery with overall project plan Verify team’s delivery against requirements to ensure the right functionality Assist in troubleshooting system problems during development and sustaining of... product Develop and review project artefacts defined in the software life cycle in conformance to regulatory requirements Required Educational Background: At least a Bachelor’s degree in Computer Science, Computer Engineering, Bioengineering or engineering related area Desired Profile: At least 4 years of working experience in Life Science industry with knowledge in DNA Sequencing or at least 4 years of experience as a Business/System Analyst. (Medical Device is preferred) Certified Scrum Master or Product Owner or working experience in regulated product development environment (SDLC and ISO 13485) Strong analytical skills, problem solving and troubleshooting Strong verbal and written communication skills A track record that includes being part of a team which completed and shipped successful products Must thrive in fast-paced, dynamic environment Experience in participating in cross-organizational or inter-company collaboration Experience in developing full stack web applications in Java is a plus Experience in working with offshore teams is a plus Experience in working with customer support is a plus Experience with Lab Information Management Systems is a plus Do you want to make a difference? Illumina’s mission is to improve human health by unlocking the power of the genome. If that inspires you, let’s talk. We’ve built a culture fueled by innovation, collaboration and openness, and established ourselves as the global leader in DNA sequencing and array-based technologies. Our people and our technology change lives by driving advancements in life sciences, oncology, reproductive health, agriculture and other emerging markets. We are deeply passionate about what we do, because we know that our work has the power to improve lives. We’re an established company with a track record of phenomenal growth. Our revenue grew from $10 million in 2002 to approximately $2.2 billion in 2015. Our growth isn’t just revenue, we’ve been hiring the best and the brightest. Perhaps that’s why MIT has ranked Illumina near the top of its World’s Smartest Companies list three years running, including #1 in 2014. If you thrive in a brilliant, fast-paced, and mission-driven environment, Illumina is the place for you – imagine the possibilities. Additional Company Information Registration No. 200310311H Company Size 2001 - 5000 Employees BioTechnology/Pharmaceutical/Clinical research Benefits & Others Dental, Education support, Miscellaneous allowance, Medical, Vision, Regular hours, Mondays - Fridays, Casual (e.g. T-shirts", "extensions": ["6 days ago", "Full–time"], "detected_extensions": {"posted_at": "6 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgRW5naW5lZXIgLSAxOTM4Ni1KT0IiLCJjb21wYW55X25hbWUiOiJJTExVTUlOQSBTSU5HQVBPUkUgUFRFLiBMVEQiLCJjb21wYW55X21pZCI6Ii9tLzA5bXhreHMiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiI5a2RSZlJQU2V2QVI5YzIwQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFb3NDQ3N3QlFVNVZYMDV4VWpGNGRWVmFjR2sxZVdSZmJqSldkMVZmUzI4eGJHcExjR00zTUd4TE1XUkZVMjR3UWtOMVVteElRak5sZDJaU1owc3dZMHRTTW1wNlgwSllkVkZzT0dsV1lsUkllWEJRYjNsdFdqbFRUVzR5TkVSNFkwRTVZMjlTVDA4dFJHVTFURTVYZVdkU1ExRnZaakp5UTAxNFNUVTFSV1JJTVRsdWVGVXpjRWd4WjFaQlUxWkJia1JZYVZwR00xRlZkVGxZYkZCcmMwVTJhRFpHYWtWcmVISmlTbG8yTTNKa2VWZDZXR2QxTVRSalNtZEtSV2hOTFRSMlZYbHFla3gzWld0ek1WOTRUV3R3RWhZM1NHMURXVTl0ZDBVMGFqQjBRV0pRTkdKUFowTjNHaUpCVDAxWlVuZEVOa2xKYjJodWJHZDJUMmhQVlhOc1VYY3hUMUZpTmtRMGFWUkIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18xNCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIHwgRmlkYW50byIsImxpbmsiOiJodHRwczovL3NnLmZpZGFudG8uY29tL2pvYnMvam9iLW9wZW5pbmcvc29mdHdhcmUtZGV2ZWxvcGVycy1zeXN0ZW1zLXNvZnR3YXJlL3Nlbmlvci1zb2Z0d2FyZS1lbmdpbmVlci0xOTM4NmpvYi0yNzU0OTE2OTc/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "System Analyst (SAP-FIN)", "company_name": "WSH Experts Pte Ltd", "location": "Singapore (+1 other)", "via": "via LinkedIn", "description": "Job Description\n\nJob Responsibilities:\n• Enhancements (changed requirements)\n• Maintenance (troubleshooting, defect fixing)\n• Development (new requirements)\n• Testing\n• Support\n• Analysis and proposal\n\nJob Requirements\n• At least 3 years of working experience under the following environment:\n• SAP R/3, FI, CO and MM modules\n• S/4HANA, Simple Finance, SAP Business Warehouse, SAP BOBJ\n• At least 3 years of working experience in following areas:\n• FI/CO/MM Functional\n• ABAP Programming\n• Able to work independently in gathering requirements from users, designing,configuring, implementing and maintaining SAP FI/CO/MM system.\n• Developing reports and dashboards using SAP BOBJ/BW tools like Lumira,WEBI,BEX queries, CDS views, Crystal reports.(Preferred)\n• SAP FI/CO/MM certification(Preferred)\n\nJob Description : Job Responsibilities: * Enhancements (changed requirements) * Maintenance (troubleshooting, defect fixing) * Development (new requirements) * Testing * Support * Analysis and proposal... Job Requirements: * At lea\n\nSkills: System Analyst, SAP R/3, Fi, Co\n\nExperience: 0.00-50.00 Years", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTeXN0ZW0gQW5hbHlzdCAoU0FQLUZJTikiLCJjb21wYW55X25hbWUiOiJXU0ggRXhwZXJ0cyBQdGUgTHRkIiwiY29tcGFueV9taWQiOiIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJobEd5c0p5OWh6NzVvOElxQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExpbmtlZEluIiwibGluayI6Imh0dHBzOi8vc2cubGlua2VkaW4uY29tL2pvYnMvdmlldy9zeXN0ZW0tYW5hbHlzdC1zYXAtZmluLWF0LXdzaC1leHBlcnRzLXB0ZS1sdGQtMjQ3MTQ4MzU5MT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Business System Analyst (sitecore)", "company_name": "ALPHAEUS", "location": "Singapore", "via": "via MNC Jobs Singapore | MNC Jobs In Singapore", "description": "Roles & Responsibilities\n\nParticipate in all phases of development from definition and design through implementation, debugging, testing and deployment of application software across multiple systems on a fast-paced, agile development schedule.\nWork directly with developers, project leads and project stakeholders to understand and resolve issues and clarify requirements.\n• Experience with: Object-oriented programming and computer science foundations\n• Software security best practices\n• .Net Framework, Visual Studio, C#, ASP.NET, WCF, Web API/REST Services.\n• HTML5, CSS, JSON, XML, AJAX, JavaScript and JavaScript frameworks (JQuery, Angular, React etc.)\n• Current Web UI frameworks such as Bootstrap and Foundation\n• Relational database design and development\n• Agile methodologies and tools, unit testing, content management systems\n• Experience w/ the following is a plus: Helix\n• Done installation of Sitecore 9 and/or above with setup of the search functionality\n• Was involved in any... Sitecore version upgrade\n\nRequirements:\n• Bachelor’s Degree in Computer Science or equivalent\n• 5+ years of experience developing on the Sitecore platform (working knowledge of Sitecore 9.0 preferred; Sitecore 8.2+ required)\n• Sitecore Certification of 8.2 and above\n• 5+ years of experience designing and developing software using C# and ASP.NET MVC\n• 2+ years as a Sitecore developer with excellent communication skills and proven ability to setup/code in Sitecore best practices\n• Experience building, inspecting, and managing deployments using AWS DevOps\n• Experience with modern Sitecore technologies and features such as SXA, JSS", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJCdXNpbmVzcyBTeXN0ZW0gQW5hbHlzdCAoc2l0ZWNvcmUpIiwiY29tcGFueV9uYW1lIjoiQUxQSEFFVVMiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IiIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IkpKV1VIOS1oa3phODh5bU9BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTU5DIEpvYnMgU2luZ2Fwb3JlIHwgTU5DIEpvYnMgSW4gU2luZ2Fwb3JlIiwibGluayI6Imh0dHBzOi8vc2cubW5jam9iei5jb20vam9icy9idXNpbmVzcy1zeXN0ZW0tYW5hbHlzdC1zaXRlY29yZS1vdXRyYW0tMzQxNjkwP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Application Analyst", "company_name": "Sciente International Pte Ltd", "location": "Singapore (+1 other)", "via": "via Monster", "description": "Mandatory Skill-set\n• Degree in Information Systems or related field;\n• At least 5 years of hands-on support experience for fiduciary system or web based financial system;\n• Experience with programming languages such as Java or .Net;\n• Has experience supporting regional systems and stakeholders in maintaining system upgrades/ enhancements;\n• Familiar with incident management, problem management, release management, root cause analysis and monitoring;\n• Ability to work efficiently under pressure and meet tight deadlines;\n• Good written and verbal communication skills.\nDesired Skill-set\n• Prior working experience in the financial industry.\nResponsibilities\n• Manage the enhancements and implementations of internal fiduciary and wealth systems;\n• Provides L2 support to end-users for IT applications, not limited to web technologies (e.g. Java, .Net) as well as client-server applications;\n• Work with Service Desk, Infrastructure support, database administrator, applications development... teams to identify and correct core issues;\n• Identify and resolve problems from both incidents and BAUs;\n• Perform user acceptance testing for successful system implementation and support related activities across IT teams;\n• Provide insights to continuous improvements & innovation to increase productivity;\n• Provide reports on defects and other status report for tracking /resolution purposes.\n• Ensure adherence to the best practices of the development processes", "extensions": ["Over 1 month ago", "Contractor"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Contractor"}, "job_id": "eyJqb2JfdGl0bGUiOiJBcHBsaWNhdGlvbiBBbmFseXN0IiwiY29tcGFueV9uYW1lIjoiU2NpZW50ZSBJbnRlcm5hdGlvbmFsIFB0ZSBMdGQiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IjFmNTlQRmN4SXROWW5PNWhBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTW9uc3RlciIsImxpbmsiOiJodHRwczovL3d3dy5tb25zdGVyLmNvbS5zZy9qb2IvYXBwbGljYXRpb24tYW5hbHlzdC1zY2llbnRlLWludGVybmF0aW9uYWwtcHRlLWx0ZC1zaW5nYXBvcmUtMTgzMzMyND91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Middleware Engineer", "company_name": "percept-solutions", "location": "Singapore (+1 other)", "via": "via Glassdoor", "description": "Job Description\n\nYou will be a middleware engineer that will work with IT teams to provide operation and project support.\nYou must be able to communicate well with both internal and external partners.\n\nPRIMARY RESPONSIBILITIES\nMiddleware administration to provide operation and project support for middleware (WebLogic, JBoss EAP, Apache/JBoss Web Server etc).\nSupport service request for middleware section\nOperation support for batch/ftp/DR exercise etc\n\nJob Requirements\n\n5 years of experience engineering and/or administering middleware platforms\nSelf-motivated with the ability to work in a fast-paced, challenging environment\nOracle WebLogic, JBoss EAP/Web, Apache web, Apache Tomcat\nDynatrace APM/DC RUM\nWindows, Unix, Linux\nMiddleware certification is preferred\n\nEA License No: 18S9405 Reg No: R1330864\n\nSkills & Competencies\n\nWebLogic, JBoss EAP, Apache/JBoss Web Server\n• Number of Vacancies:\n3\n• Minimum Years of Experience:\n5\n• Salary:\nS$5000-S$7500", "extensions": ["16 days ago", "Full–time"], "detected_extensions": {"posted_at": "16 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJNaWRkbGV3YXJlIEVuZ2luZWVyIiwiY29tcGFueV9uYW1lIjoicGVyY2VwdC1zb2x1dGlvbnMiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IlE2b0VDbnpodE5uLWVEQ3ZBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gR2xhc3Nkb29yIiwibGluayI6Imh0dHBzOi8vd3d3LmdsYXNzZG9vci5zZy9qb2ItbGlzdGluZy9taWRkbGV3YXJlLWVuZ2luZWVyLXBlcmNlcHQtc29sdXRpb25zLUpWX0lDMzIzNTkyMV9LTzAsMTlfS0UyMCwzNy5odG0/amw9MzY1NzI1Mjg3Nlx1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "HR Business Analyst (BB-8254F)", "company_name": "NTT Ltd.", "location": "Singapore", "via": "via BeBee", "description": "In a constantly changing world, we work together with our people, clients and communities to enable them to fulfill their potential to do great things. We believe that by bringing everyone together, we can solve problems using innovative technology that can create a world that is sustainable and secure. At NTT, we encourage you to remain continuously curious, as that is what keeps you fast, flexible and relevant. No two days will be the same but that is what will help you grow and realize your full potential. The power is in your hands to do great things. It’s time to lead the change, be the authentic you, to solve difficult challenges, to set the pace of change and to unleash your potential. Want to be a part of our team?The Business Analyst’s key function is to work with internal and external clients to determine requirements and to define solutions to address complex business, process and systems problems, and improvements in the organization. They act as a liaison among... stakeholders in order to understand the structure, policies, and operations of an organization, and to recommend solutions that enable the organization to achieve its goals. Radford reference: \"Analyzes complex business problems to be solved with automated systems. Identifies gaps and provides technical expertise in business requirements for system functional specifications and scales new and current systems, processes and procedures in a cost effective manner. Configures system settings and options; plans and executes unit, integration and acceptance testing to meet business requirements. Designs details of automated systems. May provide consultation to users in the area of automated systems. May lead cross-functional linked teams to address business or systems issues. Survey Tip: May be client-focused, working in conjunction with Professional Services and Outsourcing functions. May include company-wide, web-enabled solutions.\" Working at NTT Key Roles and Responsibilities: Act as a bridge between the business problems and the technology solutions. Analyse, transform and ultimately resolve the business problems with the help of technology. Work with internal clients and apply best practice methodologies to determine business requirements and to define solutions to address business, process, information and system problems, improvements or change. Deliver business projects in line with sponsor requirements and enterprise architecture. Proactive development and deployment of enhanced services and platforms, covering all the functional aspects from service/product definition through to build and deployment. Ensure the identification and documentation of operational gaps including user guides, templates, test cases and related user training. Assist with the resolution of issues pertaining to the service. Adhere to and follow the relevant development and support processes. Communicate and escalate if any issues arise or deliverables cannot be met and request assistance to ensure closure of issues. Take responsibility for delivery of project elements with minimal supervision Knowledge, Skills and Attributes: Broad understanding of business practices and processes Excellent team player who displays good client service orientation with well-developed administrative and organization skills Deep expertise in specific systems, processes and technologies that they will be required to analyze Meticulous attention to detail whilst working under pressure Excellent verbal and written communication skills Ability to listen empathetically Ability to build rapport and engage effectively with a variety of stakeholders Knowledge of project management methodology Excellent analytical skills with the ability to convert business requirements into operational deliverables (functional requirements) to meet business objectives Excellent documentation skills, in particular, functional requirements, test cases, system user documentation, processes and procedures and presentations Very good working knowledge of Microsoft Exchange, Word, Excel Project, PowerPoint and Visio Academic Qualifications and Certifications: Typically requires Bachelor’s degree or equivalent with related demonstrable experience Project management certification would be advantageous Relevant technology certification(s) Required Experience: Demonstrable experience as a Business Analyst gained within a technology services environment Experience as a system administrator or developer would be advantageous Demonstrable experience in coordinating and managing tasks, and small projects What will make you a good fit for the role? Standard career level descriptor for job level: • Seasoned and experienced professional • Has full understanding of specialisation area • Resolves wide range of issues in creative ways • Fully qualified, career level, career journey-orientated • Uses good judgement in selecting tools and methods to solve problems • Networks with senior internal and external people in own area of expertise • Receives little instruction on day-to-day work, receives general instructions on new assignments • Typically requires demonstrable related experience with a Bachelor’s or equivalent degree; or moderate level experience and a Master’s or equivalent degree; or a PhD or equivalent degree without experience; or equivalent work experience", "extensions": ["4 days ago", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJIUiBCdXNpbmVzcyBBbmFseXN0IChCQi04MjU0RikiLCJjb21wYW55X25hbWUiOiJOVFQgTHRkLiIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiY05SRjRINHY0R1lSdWdzUEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCZUJlZSIsImxpbmsiOiJodHRwczovL3NnLmJlYmVlLmNvbS9qb2IvMjAyMTA0MTktMjZmMTljZDg3MzJiOGFjNDFiYWM3ZjZiZmJlODI1NGY/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Senior System Analyst (Virtualization-Architecture)", "company_name": "RGF International Recruitment", "location": "Singapore", "via": "via LinkedIn", "description": "Our Client\n\nJob Description\n\nOur client is one of the largest systems integrator with its headquarters in Japan. The client offers services in IT strategy planning, implementation and outsourcing for a broad range of industries and activities.\n\nThe Responsibilities\n\nTechnical Expertise\n• Demonstrate good knowledge and technical proficiency in virtualization technologies such as VDI, VSI, vSAN and supporting technologies such as Hyperconverged, Enterprise Cloud.\n• Plan, Design and Implement virtualized Infrastructure, ensuring the right architecture and functionality are aligned with business requirements and existing IT policies and governance.\n• Provide expertise to regional teams on security and network infrastructure domain.\n\nRisk and Control\n• Provide timely escalation and resolution of major issues to Management and Head Office teams.\n\nClient and Stakeholder Engagement\n• Partner with IT Steering Group to ensure alignment of all platform architecture processes, standards... strategies and roadmap.\n• Required to function as technical lead with the responsibility to review and manage technical deliverables and coordinate with internal teams, partners/vendors and key stakeholders.\n• Responsible for the proper planning, communication and coordination with external vendors to ensure they deliver the required SLA for smooth delivery of various systems and applications.\n\nProjects & Other Responsibilities\n• Prepare and present regular project reports and documentations. Ensure that the project status and progress are communicated across to all stakeholders, members and contributors in a meaningful manner.\n\nClear understanding of ITIL Change, Problem and Incident management frameworks.\n\nThe Requirements\n\nSkill Requirements\n• Good knowledge of security and vulnerability-based approach to security hardening.\n• Good hands-on experience in VMWare ESX, vSphere, vSAN, Horizon and other VMWare products.\n• Knowledge in Hyperconverged and Storage Infrastructure (e.g. Nutanix, UCS, HDS) is an advantage.\n\nExperience\n• 6-8 years of experience supporting IT infrastructure in a large organization with at least 3 years of technical delivery experience.\n• Proven experience in architecting enterprise virtualization, server and storage systems.\n• Prior working experience as an IT professional in banking or financial institution is an advantage.\n\nEducation/Qualifications\n• Bachelor's Degree in information technology, Computer Science and equivalent.\n• VMWare Certification is preferred\n\nDisclaimer: The Company complies with the Tripartite Guidelines on Fair Employment Practices (TGFEP), including the prevailing guidelines on recruitment. All qualified applicants will be considered for the position regardless of their age, race, religion, nationality, marital status, or family responsibilities. A more detailed discussion of the TGFEP is available on the Tripartite Alliance for Fair and Progressive Employment Practices (TAFEP) website at https://www.tal.sg/tafep", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU3lzdGVtIEFuYWx5c3QgKFZpcnR1YWxpemF0aW9uLUFyY2hpdGVjdHVyZSkiLCJjb21wYW55X25hbWUiOiJSR0YgSW50ZXJuYXRpb25hbCBSZWNydWl0bWVudCIsImNvbXBhbnlfbWlkIjoiIiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiWjdPRXVnWU9BY1VSRlBSdkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiIsImxpbmsiOiJodHRwczovL3NnLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvc2VuaW9yLXN5c3RlbS1hbmFseXN0LXZpcnR1YWxpemF0aW9uLWFyY2hpdGVjdHVyZS1hdC1yZ2YtaW50ZXJuYXRpb25hbC1yZWNydWl0bWVudC0yNDY4NjU2NDI5P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Senior IT Analyst (AWS, .NET)", "company_name": "None", "location": "Singapore", "via": "via Jobs", "description": "This will be a continuously renewable contract position based in Bedok. Scope of Work: ensure all the applications systems remain in good working order. support new application systems when they become operational. respond to production emergencies in a timely manner. This includes bringing up the server (in a crash) or system processes, fixing problems or finding workarounds. perform routine checks and to escalate any anomaly detected, to alert and conduct troubleshooting together with other system engineers, database administrator (DBA) and outsourced vendors. meet the Service Level Agreement (SLA) timelines. follow through every issue / problem till closure; and complete the necessary documentation as required by NLB. assist users and answer queries regarding the supported operational systems. interact with the helpdesk agents, end-users and external vendors during application support and problem resolution. standby support on weekends / public holidays. In the event of scheduled... downtime or during a crash, required to be in office during off-office-hours to support the systems. make some code changes/ enhancements that arise from service requests. tracking and management of the project timelines and resources that he/she has been assigned to undertake. understudy and undertake the development of new applications and maintenance of any existing systems work independently with minimum supervision, also work effectively as a team member among the system support and application development teams Requirements: bachelor's degree in Information Technology (IT), Computer Engineering, Computer Science or equivalent. FIVE (5) years working experience in working experience in the IT industry, with exposure to end-to-end software development lifecycle (SDLC), system analysis and design, application development, and operational support and maintenance. ONE (1) year of work experience in Singapore, and thus to have minimally equipped well in understanding and meeting the user requirements. certified in Amazon Web Services like AWS Certified Cloud Practitioner or better. certified in Microsoft Azure platform. experience or certification in Google Cloud services. experience with container technology like Docker, Docker Swarm or Kubernetes. proficient in C# (NET) or other C-based programming language (e.g. PHP, PERL, C++) proficient in front-end technologies like HTML5, jQuery, JavaScript and CSS. experienced with front-end framework like Angular, AngularJS, REACT, or equivalent. have experience with NodeJS or Python. proficient in SQL technology like MSSQL, MySQL, PostgreSQL, MariaDB, or equivalent and be proficient in writing optimized SQL queries or stored procedures. working experience with NoSQL like MongoDB, CouchDB, or equivalent. working experience in Service Oriented Architecture (SOA) by having integrating application using SOAP or REST services before. working experience with EZProxy access and authentication software. working experience with chatbot technology like Dialogflow, Google Action, LUIS. WIT.AI, AWS Lex, or equivalent. working experience in continuous integration and continuous delivery like Jenkin, Spinnaker, Bamboo, CodePipeline, or equivalent. working experience in agile projects using SCRUM or equivalent. working experience with Content Search technology like Alfresco Content Management System, EBSCOHOST Discovery Services, Google Enterprise Search, or equivalent. working experience in government agency environment in the past 5 years with exposure to IM8, WOGAA, Digital Standards, and/or other Singapore government security policies compliance requirements. This will be a continuously renewable contract position based in Bedok. Scope of Work: ensure all the applications systems remain in good working order. support new application systems whe Skills: .NET, Amazon Web Services, Angular Js, Asp.net, Aws, C#.net, Css, Html, Javascript, Ms Sql, Mysql, Nosql, Php, Rest, Soap Experience: 5.00-7.00 Years", "extensions": ["12 days ago", "Contractor"], "detected_extensions": {"posted_at": "12 days ago", "schedule_type": "Contractor"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgSVQgQW5hbHlzdCAoQVdTLCAuTkVUKSIsImNvbXBhbnlfbmFtZSI6Ik5vbmUiLCJjb21wYW55X21pZCI6IiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6InVkczREOUM1VnFLZEprN0ZBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9icyIsImxpbmsiOiJodHRwczovL3NnLmZpZGFudG8uY29tL2pvYnMvam9iLW9wZW5pbmcvaW5mb3JtYXRpb24tdGVjaG5vbG9neS1wcm9qZWN0LW1hbmFnZXJzL3Nlbmlvci1pdC1hbmFseXN0LWF3cy1uZXQtMjcyMDIyMzMwP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Business Operations", "value": "GC06"}, {"text": "Accounting and Finance", "value": "GC01"}, {"text": "Customer Service", "value": "GC10"}, {"text": "Human Resources", "value": "GC15"}, {"text": "Management", "value": "GC18"}, {"text": "Education", "value": "GC11"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Protective Services", "value": "GC23"}, {"text": "Science and Engineering", "value": "GC27"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "System analyst", "value": "system analyst"}, {"text": "Systems analyst", "value": "systems analyst"}, {"text": "Business analyst", "value": "business analyst"}, {"text": "It analyst", "value": "it analyst"}, {"text": "Analyst", "value": "analyst"}, {"text": "Senior", "value": "senior"}, {"text": "Security analyst", "value": "security analyst"}, {"text": "Application analyst", "value": "application analyst"}, {"text": "Engineer", "value": "engineer"}, {"text": "Project manager", "value": "project manager"}, {"text": "Software engineer", "value": "software engineer"}, {"text": "Hris analyst", "value": "hris analyst"}, {"text": "Lecturer", "value": "lecturer"}, {"text": "Manager", "value": "manager"}, {"text": "Senior analyst", "value": "senior analyst"}, {"text": "Soc analyst", "value": "soc analyst"}, {"text": "Sr analyst", "value": "sr analyst"}, {"text": "Support analyst", "value": "support analyst"}, {"text": "Support manager", "value": "support manager"}, {"text": "System", "value": "system"}, {"text": "Systems administrator", "value": "systems administrator"}, {"text": "Technology analyst", "value": "technology analyst"}, {"text": "Test analyst", "value": "test analyst"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Internship", "value": "INTERN"}, {"text": "Part-time", "value": "PARTTIME"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Mining", "value": "/business/naics2007/21"}, {"text": "Research", "value": "/business/naics2007/5417"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Accommodation", "value": "/business/naics2007/721"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Real Estate", "value": "/business/naics2007/53"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "OCBC", "value": "/m/055r27"}, {"text": "Jobline Resources Pte Ltd", "value": "/g/11gp2647pn"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Workato", "value": "/g/11dxpy_3xd"}, {"text": "Avensys Consulting", "value": "/g/11g7022gjf"}, {"text": "Chevron", "value": "/m/01pvx3"}, {"text": "ELITEZ PTE. LTD.", "value": "/g/11dxptfkcf"}, {"text": "ILLUMINA SINGAPORE PTE. LTD", "value": "/m/09mxkxs"}, {"text": "M1 LIMITED", "value": "/m/05n486"}, {"text": "Mantu", "value": "/m/0b6mxkc"}, {"text": "Public Service Division", "value": "/g/11g6__bv10"}, {"text": "Rakuten Asia", "value": "/g/11g7072z1v"}, {"text": "Techcom Solutions", "value": "/g/11c73vztx3"}, {"text": "United Overseas Bank Limited", "value": "/m/04gjd1"}, {"text": "VISA", "value": "/m/01kqjn"}, {"text": "Venture Corporation Limited", "value": "/g/11bc61gglw"}, {"text": "Xilinx", "value": "/m/03dwkc"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "Activate Interactive Pte Ltd", "value": "/g/11dxq192l5"}, {"text": "Aramco", "value": "/m/01qjg2"}, {"text": "Avnet", "value": "/m/0c8xmc"}, {"text": "BGC Group", "value": "/g/11g0j3fjv8"}, {"text": "Bgc Group Pte. Ltd.", "value": "/g/11g9mphr4f"}, {"text": "CONNECT ENERGY SERVICES PTE. LTD.", "value": "/g/11dxptylw6"}, {"text": "Cochlear Ltd", "value": "/m/0kqqgc"}, {"text": "Crédit Agricole Corporate and Investment Bank", "value": "/m/04n1_w"}, {"text": "Ecquaria Technologies Pte Ltd", "value": "/g/11dxq26pxz"}, {"text": "Edwards Lifesciences", "value": "/m/03p20ps"}, {"text": "Equinix", "value": "/m/07btnq"}, {"text": "Experis Singapore", "value": "/g/11dxpnwm3s"}, {"text": "Flintex Consulting Pte Ltd", "value": "/g/11h1z41pzb"}, {"text": "ITCAN Pte Limited", "value": "/g/11dxpstz9t"}, {"text": "Institute of Technical Education", "value": "/m/05_02p"}]}]}