{"search_metadata": {"id": "60827984224db156e95da50d", "status": "Success", "json_endpoint": "https://serpapi.com/searches/390d06ba44b477bc/60827984224db156e95da50d.json", "created_at": "2021-04-23 07:38:44 UTC", "processed_at": "2021-04-23 07:38:44 UTC", "google_jobs_url": "https://www.google.com.sg/search?q=%28IT+analyst%29+%28certified+%7C+certification%29&ibp=htl;jobs&uule=w+CAIQICIJU2luZ2Fwb3Jl&hl=en&gl=sg&start=60", "raw_html_file": "https://serpapi.com/searches/390d06ba44b477bc/60827984224db156e95da50d.html", "total_time_taken": 2.24}, "search_parameters": {"q": "(IT analyst) (certified | certification)", "engine": "google_jobs", "location_requested": "Singapore", "location_used": "Singapore", "google_domain": "google.com.sg", "hl": "en", "gl": "sg", "start": "60"}, "jobs_results": [{"title": "Research Analyst, Asian Institute of Digital Finance", "company_name": "NATIONAL UNIVERSITY OF SINGAPORE", "location": "Singapore (+1 other)", "via": "via Times Higher Education", "description": "Job Description\n\nThe Credit Research Initiative (CRI) is a non-profit undertaking under the Asian Institute of Digital Finance (AIDF) of the National University of Singapore. It was launched in July 2009 at the Risk Management Institute (RMI) by then the RMI director Professor Duan Jin-Chuan with the able assistance from Dr. Oliver Chen. Over the course of its development, the CRI has been dedicating to promoting the research on credit risk and offering directly useful credit analytics to the market participants. An opportunity exists to join CRI’s Market Monitoring Team (MMT) as a Research Analyst.\n\nShort Description\n\nThe Market Monitoring Team (MMT) is a window to continually observe financial markets and conduct relevant studies by using proprietary methods with the aim to promote CRI’s products and relate to current market events. As a member in the MMT, the candidate will quickly gain knowledge to CRI models as well as develop a greater understanding on financial markets from a... credit perspective. The main tasks will be to conduct researches and financial/credit analysis on industries and companies, market surveillance for credit events and working on projects with other teams. You will have ample opportunities to improve your writing and analytical skills. Through working with other teams, you will also learn quantitative modelling and acquire useful IT and database knowledge preparing you to become a better functioning analyst who can leverage modern analytical tools.\n\nResponsibilities for this role include:\n• Conduct and publish credit/investment research reports on companies and industries in a timely manner and assist in writing quarterly and other special reports on credit market issues.\n• Carry out market surveillance and to look for credit events in accordance with CRI’s credit event definition, to file credit event data in the database, etc.\n• Initiate and manage inter-team projects.\n• Deal with urgent and/or ad-hoc requests from supervisors.\n\nQualifications\n• Academic background or industry experience of any of the following subjects is preferred: finance, accounting, economics, banking, business strategy, and business law. Certification of CFA or CPA is a plus. Candidates working in non-financial industry are also welcome.\n• Have a proven ability to conduct financial analysis and independently analyze and write financial research reports.\n• Have strong interest in the fields of investment/ credit/ risk management analysis.\n• Good team player with a strong sense of responsibility.\n• Able to coordinate and manage group projects between teams.\n• Able to handle pressure and meet deadlines.\n• Fluent in English.\n\nMore Information\n\nLocation: Kent Ridge Campus\n\nOrganization: Asian Institute of Digital Finance\n\nDepartment : Credit Research Initiative\n\nEmployee Referral Eligible: No", "extensions": ["1 month ago", "Full–time"], "detected_extensions": {"posted_at": "1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJSZXNlYXJjaCBBbmFseXN0LCBBc2lhbiBJbnN0aXR1dGUgb2YgRGlnaXRhbCBGaW5hbmNlIiwiY29tcGFueV9uYW1lIjoiTkFUSU9OQUwgVU5JVkVSU0lUWSBPRiBTSU5HQVBPUkUiLCJjb21wYW55X21pZCI6Ii9tLzAxcTQ2MCIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6Ikh4emdkYjVHY2lmR0ZOSUtBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVxSUNDdUlCUVU1VlgwNXhVbDlsTVRkS1dGQldVR3h2YzA0ek4xRTViR1E0YTFrMVZuaFdZVzlFY2t3MFFrTjFXRE13VldWcVVXOW1jelpSU1hoaVRWQjFiVE5uTkVSTFQwWkNVSEZ0U21wNk1EQjBXVFZuUzBsUGNGQnFWR3RLYkU1d2RVWllaRTl4TTNKQmQwMW5USGc0TVZabVZHRktVM1IxYkhNMloyODFOa0pFUVhCdFUyZENkV1l0YlZwRFRsbzNRM0l6ZWtJNWVXTmZZaTFPYkcxZmFITnNXWGd4VlZSdWRIRnRkVFpWVWpneWRUTlRVRGcxVlhOMVpqTnVRM0ZLU1VOcVJqSllPVzlKZFdveE9VbDZjRlJ3VG5kS1ZHOHhkVUpmTUdkdVQzbG5PRWRsZHhJWGFGaHRRMWxKTTJWTE9VTndNV1pCVUdnMmNVNXBRVzhhSWtGUFRWbFNkME0zZGpJemRHNTFObEZNYWpOWGNrdHdTelJZV0VSRVIzaFFaMmMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY183IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFRpbWVzIEhpZ2hlciBFZHVjYXRpb24iLCJsaW5rIjoiaHR0cHM6Ly93d3cudGltZXNoaWdoZXJlZHVjYXRpb24uY29tL3VuaWpvYnMvbGlzdGluZy8yNDk3NzMvcmVzZWFyY2gtYW5hbHlzdC1hc2lhbi1pbnN0aXR1dGUtb2YtZGlnaXRhbC1maW5hbmNlLz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Financial Crime and Sanctions Analyst (Contract)", "company_name": "Morgan McKinley", "location": "Singapore (+1 other)", "via": "via EFinancialCareers", "description": "Financial Crime and Sanctions Analyst (Contract)\n\nJob Summary\n• Singapore\n• Contract\n• BBBH780104\n• Apr 16, 2021\n• Competitive Job Description\nMy client, a prestigious and well-known international bank is looking to hire a Sanctions Analyst for its Financial Crime team.\n\nFinancial Crime and Sanctions Analyst (Contract - highly extendable and convertible)\n\nMorgan Mckinley is working in partnership with a leading international bank on a contract to support their Financial Crime Compliance Team.\n\nJob Description\n• Monitor Trade, Economic and Financial Sanctions to meet legislative and regulatory requirements in Singapore.\n• Collate and prepare relevant Sanctions MI, governance committee submissions, and reports and submit such information as required to relevant stakeholders\n• Assist Head of Sanctions and Transaction Monitoring in providing oversight and management of all aspects of Financial Crime Risk on Sanctions including discharge of risk stewardship responsibilities, preparation... and review of applicable risk metrics, and impact analysis of regulatory changes within Singapore.\n• Collate potential breaches of sanctions from across the business lines & subsidiaries in Singapore, report management and escalate to Head of Sanctions and Transaction Monitoring.\n• Stay at the forefront of key regulatory changes to ensure proactive communication with business and implement appropriate policy and framework to manage the changes.\n• Provide advice, as assigned by the Head of Sanctions and Transaction Monitoring on an adhoc basis, to business across Singapore on sanctions risk associated with prospective business, products and service and design mitigation controls and implement strategies as appropriate The Successful Applicant\n\nAs a successful applicant, you would have the following skills & qualifications:\n• Degree holder with experience in financial crime risk compliance roles, ideally to include Sanctions experience.\n• Knowledge of Sanctions regulations and guidance.\n• Added advantage with certification from International Compliance Association (ICA) or Association of Certified Anti-Money Laundering Specialist (ACAMS))\n• Relevant experience in the financial services industry.\n• Lateral thinker with an ability to interpret and solve complex issues.\n• Excellent communicator with strong interpersonal and influencing skills. If you're interested in this role, please send your updated CV (word format) to smalhotra@morganmckinley.com for a confidential discussion\n\nReferrals are greatly appreciated.\n\nMorgan McKinley Pte Ltd\n\nEA Licence No: 11C5502\n\nRegistration No: R1770166\n\nRegistration Name: Suhani Malhotra\n\nOnly shortlisted candidates will be responded to, therefore if you do not receive a response within 14 days please accept this as a notification that you have not been shortlisted", "extensions": ["2 days ago", "Full–time"], "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJGaW5hbmNpYWwgQ3JpbWUgYW5kIFNhbmN0aW9ucyBBbmFseXN0IChDb250cmFjdCkiLCJjb21wYW55X25hbWUiOiJNb3JnYW4gTWNLaW5sZXkiLCJjb21wYW55X21pZCI6Ii9nLzExYzU4cmY1MHMiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJxemVJVjg1WWo5WmxuV2lkQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdmNCQ3JjQlFVNVZYMDV4VTNjNFRqQmZlV3hPUkVGa1EyUndhbk10VVZRM01FMXhjVXRwTTJNNWJFWjBWa3RpUkVZMllsbFBNM1J4YlhWeVQxRm9iVGd6UTJwc2NtMUhaazFJY1ZvMmFVNUxNVXRRWkdJeGVreEtSbHBmZVhGTmRUVjFhR3c1Wmw5M2QzRjZTME0xWjBobmNrdGlhMXBKTVVsMlJXZExjRXhhV2xZelVubHlTRzE0UVdkZllqQlZaMHRxZW01UFVIVkhNakZXUVcxQmFrTnBNa0ZZUm5aZmRHVkdTV1owU1VGVlFrWnVXVmRuUTNoalpISXdFaGRvV0cxRFdVa3paVXM1UTNBeFprRlFhRFp4VG1sQmJ4b2lRVTlOV1ZKM1JEUlFaRVI0V0VkaGRWVlZZV0psYUMxUlpVRmlTVWRGYWpKTmR3IiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMTUiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gRUZpbmFuY2lhbENhcmVlcnMiLCJsaW5rIjoiaHR0cHM6Ly93d3cuZWZpbmFuY2lhbGNhcmVlcnMuY29tL2pvYnMtU2luZ2Fwb3JlLUZpbmFuY2lhbF9DcmltZV9hbmRfU2FuY3Rpb25zX0FuYWx5c3RfQ29udHJhY3QuaWQxMDc4NDI4NT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "IT Service Delivery Analyst, ITP - Associate", "company_name": "BNP Paribas", "location": "Singapore", "via": "via BNP Paribas", "description": "In Asia Pacific, BNP Paribas is one of the best-positioned international financial institutions with an uninterrupted presence since 1860. Currently with over 17,000 employees* and a presence in 13 markets, BNP Paribas provides corporates, institutional and private investors with product and service solutions tailored to their specific needs. It offers a wide range of financial services covering corporate & institutional banking, wealth management, asset management, insurance, as well as retail banking and consumer financing through strategic partnerships.\n\nWorldwide, BNP Paribas has a presence in 73 markets with more than 196,000 employees. It has key positions in its three main activities: Domestic Markets and International Financial Services (whose retail-banking networks and financial services are covered by Retail Banking & Services) and Corporate & Institutional Banking, which serves two client franchises: corporate clients and institutional investors. Asia Pacific is a key... strategic region for BNP Paribas and it continues to develop its franchise in the region.\n\nBNP Paribas offers you an exciting career in an international business environment that is fast-paced, diverse and focuses on creating high-value relationships with our clients. We offer competitive salary and benefits, as well as a working environment where you’re valued as part of the team.\n• excluding partnerships\n\nhttps://careers.apac.bnpparibas/\n\nPosition Purpose\n\nBe part of the dynamic support organization responsible to ensure Global Banking Application Production Support (APS) and our partners maintain and exceed IT performance objectives for our businesses across Asia Pacific. The Service Delivery Analyst plays a vital role in ensuring the highest level of IT service delivery including service management, project management and continual service improvement.\n\nKey Responsibilities\n\n• Generate data, analyze trends and conduct reviews on service levels and team’s performance\n• Prepare regulatory, incident and business reports\n• Present monthly APS Steering Committee metrics on Project, Incident, Change and Problem Management for each site in APAC\n• Drive continual process and service improvements in order to achieve greater operational efficiency and effectiveness, and improve service availability\n• Act as a point of escalation for Service Delivery or Operational issues\n• Summarize and communicate incident resolution, root cause and action plans to stakeholders\n• Follow up closely on specific action items and requests by stakeholders\n• Ensure tasks performed and applications supported are in compliance with all applicable controls\n• Build and maintain long term working relationships with business and country stakeholders/partners\n• Manage internal/external audits and assessments by providing relevant supporting documents and information\n• Ensure audit recommendations are addressed in a timely manner and provide evidence for closure\n• Act as a point of contact for Global Banking projects, including Disaster Recovery exercises and improvement initiatives\n• Liaise with project managers and/or technical management teams to fulfill project deliverables\n• Coordinate project schedules, resources, information, communications and application health checks\n• Create and maintain comprehensive project documentations, plans and reports\n• Monitor project progress, send regular status updates and handle any issues that arise\n\nCompetencies (Technical / Behavioral)\nThe candidate should demonstrate a combination of technical and functional skills together with excellent communication and interpersonal skills. He/she must have a genuine willingness to work in a team whereby primary function ensures the availability of critical systems is routine.\nThe following knowledge and experience are required:\n• 3-5 years IT Service Management and/or Project Management experience\n• Strong understanding of IT Service Management processes, particularly Change, Incident, Problem, Asset Management and Service Request Fulfilment, and have working experience in these areas\n• Good understanding of MAS 644 Notice\n• Experience in managing internal/external audits\n• High proficiency in PowerPoint and Excel (including Macro)\n• Knowledge of Power BI, Tableau or other reporting method/tool is a plus\n• Must have prior experience using Service Now tool or equivalent\n• Experience working with virtual teams and counterparts located in other regions\n• Must possess and display strong verbal and written communication skills\n• Ability to interpret technical reports and summarize in an easy-to-understand manner for business\n• Excellent organizational skills, including multitasking, collaboration and time management\n• Good relationship builder with strong diplomacy skills\n• Able to remain professional and tactical in stressful situations\n• Demonstrate flexibility to adapt to changes and accept new tasks or challenges\n• Aspire to a culture of service excellence, always putting the customer, our people and our business at the center of everything they do\n\nSpecific Qualifications Required\n\n• Bachelor degree in computer or engineering related field or equivalent work experience\n• ITIL Foundation certification or demonstrated experience\n• Project Management certification or demonstrated experience", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJJVCBTZXJ2aWNlIERlbGl2ZXJ5IEFuYWx5c3QsIElUUCAtIEFzc29jaWF0ZSIsImNvbXBhbnlfbmFtZSI6IkJOUCBQYXJpYmFzIiwiY29tcGFueV9taWQiOiIvbS8wMnFoazQiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJmajlVeTBfYXlvTE5pbkNSQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdUlCQ3FJQlFVNVZYMDV4VVdkaVh6RmlaazQ1TmpCYWFHdzFOalExVUZwU1EyeDRiakZFVkZJelJYWTJhekF0YjBaTFpGa3pXRXBoWm00NWIwVnBNV2R1YWpKU1ozUndNMk5XTURWUVlVSTJWR1pNUmxKWVpXbDZTVEV0U1hsdmRWY3lMVWxNVkhsSlUzbGliV2Q0TkdwNlozcDZMWGh3ZVc1b05GUjJTRmhHTjNWVVNteExOV1o2ZEZSNFJHVTRWV3RWTjFKelRtODJkVGhNTTJFNU9VWlJZblk0U2pWQkVoZG9XRzFEV1VrelpVczVRM0F4WmtGUWFEWnhUbWxCYnhvaVFVOU5XVkozUkhaM05rOVNZVTF5TUcxU2VtNVdMVjh0Ym5SSVdUQkdORWhHZHciLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18yMyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCTlAgUGFyaWJhcyIsImxpbmsiOiJodHRwczovL2dyb3VwLmJucHBhcmliYXMvZW4vY2FyZWVycy9qb2Itb2ZmZXIvc2VydmljZS1kZWxpdmVyeS1hbmFseXN0LWl0cC1hc3NvY2lhdGU/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Laboratory Analyst", "company_name": "SGS Testing & Control Services / SGS International Certification Services", "location": "Singapore", "via": "via Singapore Job Mela", "description": "Perform analyses on consumer products, raw materials, food and/or water according to international standards and/or Standard Operating Procedures.Maintain good housekeeping of equipments, workspace and upkeep safety and environmental procedures in the laboratory.Prepare samples and carry out photo taking of samples for testing.Ensure tests are carried out to the requirements of test methods and quality policies of the laboratory.Operate and maintain laboratory equipment ensuring that they are maintained at optimal condition.Standardize reagent/equipment, prepare titration solvents and test solutions when necessaryUpkeep cleanliness of work areas, apparatus and equipments after use.Perform the required standard quality checks and basic calibration of equipments.Ensure that tests are performed accurately in a timely manner without compromising integrity and standards.Ensure that chemical wastes are properly disposed into the appropriate waste containers.Perform on-site sampling for... water and food testing when requiredPrepare legible and accurate data for further reviewReview, question and repeat tests if encounter suspicious results.Assist in practical training and provide guidance to new analysts when assignedAt all times, adopt a safe behavior by exercising due regard for the Health and Safety of SGS employees and clients, in line with SGS policies and proceduresExecute the job with strict observance to the SGS Code of IntegrityPerform any other duties as assigned by Supervisor and/or ManagementRequirements:Diploma in Chemistry or equivalent Strictly adhere to test protocols and safety procedures.Good understanding of wet chemistry testingStrong attention to detailsMust be able to multi-task and work effectively in fast –paced environmentTeam player with good initiative and drive.Willing to perform shift workWE REGRET TO INFORM THAT ONLY SHORTLISTED CANDIDATES WILL BE NOTIFIED", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJMYWJvcmF0b3J5IEFuYWx5c3QiLCJjb21wYW55X25hbWUiOiJTR1MgVGVzdGluZyBcdTAwMjYgQ29udHJvbCBTZXJ2aWNlcyAvIFNHUyBJbnRlcm5hdGlvbmFsIENlcnRpZmljYXRpb24gU2VydmljZXMiLCJjb21wYW55X21pZCI6Ii9tLzA2NXkxOCIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IkRyQ1VGY3JSTDdNTjNLYjZBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVvd0RDc3dDUVU1VlgwNXhVbFp4VWpoall6RnFkMDVqT1hWeGNWZFJhR2h4U0U1eWFrMVJiR0o2T1hkNVNYUlpTVmxrY1U1dFFVbDVaRGcxZFRWNVJTMVhTa2N4ZGxwRGJqZFNXRTFXZUV0aVZGaExSMFIyUzIxcU1WbEdSVmd0Vm5aNWRWUkhVbXBtY0dkcWN6VkRla1ZXYkhGTlRqRlNlSGx3Um10WVlXaHZUVTh0YkROTWVrNXJlbXR2TjBGaVgwbHNPVWxuWWpkRUxVODJZbTE2ZDFGSVMzSklkVUZJZGxWdmNtODVUMFpoYkdoWlZXeFhVamN0TUhSVUxXOWlTRFV6ZDFkUmJVNVhkVGREWkhoRFluTjNNVmRhTFhkUU56ZE5kMGhVYm1oZlVXTnNMV1JZYUZaZllqZGFTMVpDUmtnMGVUbEpYek01YUZCUVZqSmZlVmhuYTNwcFlrRnZNMFo0Wm14QmNVY3hMV3d4YzJjNVREZHJOMFZzZGxadFpWRlNWbE0zVVZBeGQycE9VMDAyTUVseE4wcFJhV00zVURsRWRITlFNR05HYVdkM01taERVblZRT0VoVFFtNTFlVTBTRjJoWWJVTlpTVE5sU3psRGNERm1RVkJvTm5GT2FVRnZHaUpCVDAxWlVuZEJZVloyYTE5UU5GSlNVM1ZLTWtJeFMyZzJOakU1ZFhGMVUydEIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18zMSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBTaW5nYXBvcmUgSm9iIE1lbGEiLCJsaW5rIjoiaHR0cDovL3d3dy5zaW5nYXBvcmVqb2JtZWxhLmNvbS93ZXN0LWpvYnMvbGFib3JhdG9yeS1hbmFseXN0LTkwMjA3P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Business Analyst - Global Private Banking", "company_name": "HSBC", "location": "Singapore", "via": "via HelpOneBillion", "description": "The health and safety of our employees and candidates is very important to us. Due to the current situation related to the Novel Coronavirus (2019-nCoV), we're leveraging our digital capabilities to ensure we can continue to recruit top talent at HSBC. As your application progresses, you may be asked to use one of our digital tools to help you through your recruitment journey. If so, one of our Resourcing colleagues will explain how our video-interviewing technology will be used throughout the recruitment process and will be on hand to answer any questions you might have.\n\nSome careers have more impact than others.\n\nIf you're looking for a career where you can make a real impression, join If you're looking for a career where you can make a real impression, join HSBC and discover how valued you'll be. Whether you want a career that could take you to the top, or simply take you in an exciting new direction, HSBC offers opportunities, support and rewards that will take you further.\n\nIT... Operations manages the IT infrastructure and supporting services that are critical for HSBC employees and customers, such as cost-efficient hardware, system software, middleware and databases, data centres, voice and data networks, ATMs, desktops and other devices.\n\nThe area comprises five functions: Client Services, Enterprise Services and Architecture, Data Centre and Service Management, Relationship Management, Project Management and Risk and Administration. Collectively, these areas define and deliver HSBC's technology strategy to support the Group's goals.\n\nWe are currently seeking a high calibre professional to join our team as a Business Analyst.\n\nPrincipal Responsibilities\n• The Business Analyst is responsible for user requirement gathering, and detailed requirement documentation by working closely with the project stakeholders including IT and business users\n• Responsible for the overall Core Banking solution and alignment with Global and local IT solutions\n• The Business Analyst will be working with the development team to clarify the user requirements, conduct system testing, prepare test plan, test cases\n• Work with business users on the UAT execution and defects follow-up with application development team\n• Conduct user training session on system functionalities\n\nRequirements\n• A university graduate with degree in finance or a related discipline\n• Avaloq experiences (coding and business process) is required\n• Avaloq Certified Professional would be an advantage\n• Experience in Securities trading, Cash operations, Foreign exchanges, Structured products, Settlement or SWIFT messages\n• Familiar with languages such as database SQL\n• Familiarity with CRM process and framework would be an advantage\n• Business and technical knowledge on banking system and application integration would be an advantage\n• Familiarity with the HSBC standards and processes would be useful\n• Production Support experience on banking systems would be an advantage\n• Able to work independently, under pressure and proactively in a fast paced environment with multiple deadlines.\n• Strong interpersonal, communication and presentation skills with good command of written and spoken English\n\nTo be considered for this role, the relevant rights to work in Singapore is required.\n\nYou'll achieve more when you join HSBC.\n\nwww.hsbc.com/careers\n\nHSBC is committed to building a culture where all employees are valued, respected and opinions count. We take pride in providing a workplace that fosters continuous professional development, flexible working and opportunities to grow within an inclusive and diverse environment. Personal data held by the Bank relating to employment applications will be used in accordance with our Privacy Statement, which is available on our website.\n\nIssued by The Hongkong and Shanghai Banking Corporation Limited", "extensions": ["4 days ago", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJCdXNpbmVzcyBBbmFseXN0IC0gR2xvYmFsIFByaXZhdGUgQmFua2luZyIsImNvbXBhbnlfbmFtZSI6IkhTQkMiLCJjb21wYW55X21pZCI6Ii9tLzA5NmsxdCIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IkhVRThqVHBDRWJyaG9DVlVBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkVzd0JDb3dCUVU1VlgwNXhWRVJXUVRsWVZIQlVaMkZoT1ZsRU5TMVpkbVJPWjNocVRHcEZiMjFUWjJOSk1HcDZNWGREVVRaTlZVOTViV2xJYUV0ellUa3dUVWMyUlVKeWVGQndiakZZWmtKMlRHUkVRWEJuYXpaWU5uSkZkemRCT1Rrd2RsZFhlSFJ0WjA5WFYycFJOVU4zYlRCSlYybzNOMUJNWTBsc1RFTnRTVTlJYVVGMVQwSndlWGwyZEhCdmFTMFNGMmhZYlVOWlNUTmxTemxEY0RGbVFWQm9ObkZPYVVGdkdpSkJUMDFaVW5kQmMxa3lNREpZZFVkSFRqZGpSeTFxWVRKWVJsTXllR2c1ZW1aMyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzM5IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEhlbHBPbmVCaWxsaW9uIiwibGluayI6Imh0dHBzOi8vaGVscG9uZWJpbGxpb24uY29tL2pvYi9hOTBjYjZkOTUyMDc0MmE5OWJjNDE0ZGRkMmMwZGVhNC9CdXNpbmVzcy1BbmFseXN0LUdsb2JhbC1Qcml2YXRlLUJhbmtpbmc/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "Security Analyst at SITA", "company_name": "SITA", "location": "Singapore", "via": "via BizLINKS Resources Pte Ltd", "description": "Security Analyst at SITA\n\nJob Description\n\nAs Security Analyst, you will work within the Security Operation Center (SOC) on identifying/evaluating risks, conduct log analysis and act upon security threats across a complex and disperse IT estate. You will carry out threat analysis and handling process to ensure the efficient and timely mitigation of security threats, as well as understanding the threats' risks and potential business impacts of both threats and mitigation measures. By leveraging the SIEM and the current security toolset, the SOC team members are expected to investigate security issues and conduct root analysis, as well as resolving or escalating security incidents. Their responsibilities also involve communicating the agreed action plan and to do the follow-up with the resolver groups, clients and production teams. The world is changing. Are you ready to define with future of travel with us? What You Will Do Monitoring security logs sources and alerts from the SIEM and... other threat detection systems for threats activity. Interpreting, conducting analysis and making recommendations for resolution. Hunting potential internal and external threats and developing detection mechanisms and reports. Handling security incidents in line with the incident response processes. Assuring the prompt and adequate follow-up on priority action items with resolver groups. Producing security incidents reports and recommendations. Following, maintaining and helping in the evolution of the SOC processes and procedures, including use case, SOP, etc. Working with resolver groups to evaluate and recommend new security practices and solutions. Providing security advices and promoting security awareness to other IT teams and clients. Working actively on evolving our threats detection and team efficiency by acting on noise and false positive. Helping in the production of threat intelligence and IoC by leveraging threats information from past incidents, sandboxes reports, malware reversing and data forensic. Who you are Significant experience (3 years +) of working within a mature SOC organization or as a security threat analyst in an equivalent security environment. Experience in using SIEM technologies, endpoint protection, IDS and other security technologies. High level of analytical and problem-solving skills. Mini mum of2-3 of experience in information technology in Windows servers, Linux or network. Good understanding of system, and application logs from a variety of platforms, from firewall, domain controllers to IDS, etc. Technical expertise in multiple security technologies would be an advantage including security incident handling experience. Good knowledge of threat intelligence data, IoC, threat actors, kill chain, Stix/Taxii, etc. Having experience in the pen testing/ethical hacker field is a plus. Functional skills with regex, IDS signature, SPL and SQL is a plus. Skills in network analysis, sandboxing, malware reversing or forensic is an asset. Strong knowledge of vulnerabilities, CVE, 0day and their potential impacts. Keeping aware and continually informed of the worldwide security landscape new threats, actors, du jour attack, as well as the new security technologies and products. Ability to comprehend the priority on enabling the business, while working on security incidents mitigation/containment and possible impacts on the production environment. Strong customer/client focus, interact with a variety of stakeholders in a well-mannered, positive, and professional way, and building long-term relationships. Strong written/verbal communication skills. Ability to effectively prioritize and execute tasks in a high-pressure environment. Experience with IT compliance assessments (ISO 27000 etc.). Certified Information Systems Auditor Global Information Assurance Certifications (GIAC) e.g. Certified Incident Handler (GCIH), Certified Intrusion Analyst (GCIA), Certified Enterprise Defender (GCED) or other relevant GIAC certifications. What We Offer SITA's workplace is all about diversity many different countries and cultures are represented in our workforce, and colleagues who've been working here for decades collaborate with those just out of college and early in their careers. SITA is a place of change and constant improvement, where we're always pushing ourselves to find better ways of doing things smarter, quicker, easier, for us and our customers and for their customers too. And we offer all the good stuff you'd expect like holidays, bonus, flexible benefits, medical policy, pension plan and access to world class learning. Welcome to SITA SITA is the world's leading specialist in air transport communications and information technology. We don't just connect the global aviation industry. We apply decades of experience and expertise to address almost every core business, operational, baggage, and passenger process in air transport. We design, build, and support technology solutions all with one vision to create easy air travel every step of the way. As an organization, we cover 95% of all international air travel destinations and work with over 2,800 air transport and government customers in every corner of the globe. Are you ready to explore the opportunities? Keywords SOC Engineer, Security Analyst, Security Operations Centre In case of issues with uploading your CV or accessing the application system, please contact us @ This email address is being protected from spambots. You need JavaScript enabled to view it. document.getElementById('cloak7bb78316797eff230ef1482694a18a12').innerHTML = ''; var prefix = 'ma' + 'il' + 'to'; var path = 'hr' + 'ef' + '='; var addy7bb78316797eff230ef1482694a18a12 = 'careers' + '@'; addy7bb78316797eff230ef1482694a18a12 = addy7bb78316797eff230ef1482694a18a12 + 'sita' + '.' + 'aero'; var addy_text7bb78316797eff230ef1482694a18a12 = 'careers' + '@' + 'sita' + '.' + 'aero';document.getElementById('cloak7bb78316797eff230ef1482694a18a12').innerHTML += ''+addy_text7bb78316797eff230ef1482694a18a12+''; Profession Service Operations Work Location Asia Pacific-Singapore-Singapore Schedule Full-time Job Posting Jan 25, 2021, 14906 AM Show more\n\nOriginal Joblink : https://sg.linkedin.com/jobs/view/security-analyst-at-sita-2403637763\n\nGoogle Company: https://www.google.com/search?q=Security%20Analyst%20at%20SITA", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZWN1cml0eSBBbmFseXN0IGF0IFNJVEEiLCJjb21wYW55X25hbWUiOiJTSVRBIiwiY29tcGFueV9taWQiOiIvbS8wNmwyMHoiLCJhZGRyZXNzX2NpdHkiOiIiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJOZ0oteVlEMEVZaEFSMGJUQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFc3dCQ293QlFVNVZYMDV4VWtoalgyTTJkRkJWZG5GbFNHdFVkSG80TjBSTWRGRjJhek5xWjNkbk4ycG9UamczVlZoaVZHTnlhbW95UjNsRFZrSk1iMkpmZHpKd1VGWnJaRk5pT0dKVlZIaFhjWEkwUVdkR1dXbzVORlI2TW1KUExYUTBWMUpOT1c1Wk5FVTVUak5vYTBoNE56SllZWGhMT1dKcFVYcE1aWHBuWmxOWldWWk9VVXQzTTBSdlJGQlBRaklTRjJoWWJVTlpTVE5sU3psRGNERm1RVkJvTm5GT2FVRnZHaUpCVDAxWlVuZEViM2hhYW5SSlozVjJSVGRpVkdka1JFTlRlVUo2U0ZrNE9ETkIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY180NiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCaXpMSU5LUyBSZXNvdXJjZXMgUHRlIEx0ZCIsImxpbmsiOiJodHRwczovL3d3dy5iaXpsaW5rc3Jlc291cmNlcy5jb20uc2cvaW5kZXgucGhwL2pvYi1saXN0aW5ncy1wdWJsaWMvOTQtc2VjdXJpdHktZW5naW5lZXJzLzUyNTMtc2VjdXJpdHktYW5hbHlzdC1hdC1zaXRhP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}, {"title": "Business Analyst", "company_name": "McKinsey & Company", "location": "Singapore", "via": "via Bayt.com", "description": "QUALIFICATIONS\n• Undergraduate or master’s degree or have 1 –3 years of work experience after completing your undergraduate degree\n• Outstanding record of academic achievement\n• Demonstrated aptitude for analytics\n• Proven record of leadership in a work setting and/or through extracurricular activities\n• Exceptional analytical and quantitative problem-solving skills\n• Ability to work collaboratively in a team environment\n• Ability to work effectively with people at all levels in an organization\n• Ability to communicate complex ideas effectively – both verbally and in writing – in English and the local office language(s)\n• Willingness to travel\nWHO YOU'LL WORK WITH\n\nBusiness Analysts join our offices and practices (e.g. Digital, Marketing & Sales, Operations, etc.) around the world to work in teams and directly with our clients.\n\nWhen you join McKinsey as a Business Analyst (BA), you are joining a firm that will challenge you and invest in your professional development. In this role... you will work on the best teams to help the best organizations in the world – in private, public, and social sectors – solve their most difficult problems. You will also work with many experts, from data scientists and researchers to software and app designers.\n\nIf you are interested in joining a specific practice, please indicate this in your office/practice preference (combinations are possible). To learn more about how we help our clients and where you fit in, visit our careers site.\n\nWHAT YOU'LL DO\n\nYou’ll work in teams of typically 3 – 5 consultants, playing an active role in all aspects of the client engagement.\n\nThis includes gathering and analyzing information, formulating and testing hypotheses, and developing and communicating recommendations. You’ll also have the opportunity to present results to client management and implement recommendations in collaboration with client team members.\n\nYou’ll gain new skills and build on the strengths you bring to the firm. Business Analysts receive exceptional training as well as frequent coaching and mentoring from colleagues on their teams. This support includes a Partner from your local office or practice assigned to you to help guide your career as well as several weeks of formal training in your first two years as a Business Analyst. Additionally, you’ll receive guidance and support from your local office in the selection of client projects, helping you to develop your skills and build your network.\n\nWe view the Business Analyst position as the start of a rewarding, challenging, and highly flexible career with McKinsey. During your first few years with the firm, you will serve as a BA on multiple client engagements and work with a number of colleagues and clients in a range of industry and functional areas. We encourage you to explore different content areas or geographies through a year-long rotation with one of our practices (e.g., corporate finance, social sector, healthcare, operations) or global offices; many do this after two years as a generalist BA. For all BA's, you will likely intersect with many elements of our firm's work including Digital, Implementation, Analytics - either by collaborating on teams or working with colleagues from these groups.\n\nFollowing your BA tenure, assuming good performance, you will move into a post-graduate school role. Some BAs will take advantage of the opportunity to get outside experience through a secondment (externship) with a private sector or social sector client with the firm’s support. Others may choose to pursue graduate school with support from the firm", "extensions": ["4 days ago", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJCdXNpbmVzcyBBbmFseXN0IiwiY29tcGFueV9uYW1lIjoiTWNLaW5zZXkgXHUwMDI2IENvbXBhbnkiLCJjb21wYW55X21pZCI6Ii9tLzAyenQ5MiIsImFkZHJlc3NfY2l0eSI6IlNpbmdhcG9yZSIsImFkZHJlc3Nfc3RhdGUiOiIiLCJodGlkb2NpZCI6IkJfRkI2aDB0d2RzU3c4SWhBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVTJsdVoyRndiM0psIiwiZ2wiOiJzZyIsImhsIjoiZW4iLCJmYyI6IkV2Y0JDcmNCUVU1VlgwNXhVMFZvTVROSk5tMXlSakZUWjJsTFlqTjVka0Z0VVZOc2NVVkhhMDlQY2paek1rdzFRVzF4YTE5TldGOTNja0Y1VDJ0RU5sYzRVMDFxYUVOYVpDMU5lVkIwTVhoU2RpMXZhVXRNWm1keU9HVnRaR1pMT1RRdFluWnJSVXh5VVVSTU1YRXhXVVkzY0ZSeVdXVTBhemhIUVdkM2VYVlFORVUzYUZWS1RHaGFiM0pqVUdoR00zUkhUVGxXT1ZOWk0xSnNWM1UwV0RsQmFWSjVXbVF4VFVwSGVqaFBXSE0xUkZoNFJXaHJTWFZWWlRGM0VoZG9XRzFEV1VrelpVczVRM0F4WmtGUWFEWnhUbWxCYnhvaVFVOU5XVkozUTFSbVowTTJUbVZSTVcxS09IYzBYMWRUUjBScE9IaGZVM2d4UVEiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY181MyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCYXl0LmNvbSIsImxpbmsiOiJodHRwczovL3d3dy5iYXl0LmNvbS9lbi9zaW5nYXBvcmUvam9icy9idXNpbmVzcy1hbmFseXN0LTU5NTM1MjIzLz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "KYC Analyst - Corporate Banking (Contract)", "company_name": "Randstad Singapore", "location": "Singapore (+1 other)", "via": "via Randstad Singapore", "description": "about the company\n\nEstablished for over 90 years, the Client is a global bank offering full suite of global financial services and capabilities around the world. With more than 80 years of history and a wide range of business units, our Client is the employer of choice for more than 35,000 people around the world.\n\nabout the role\n• Perform KYC on-boarding and periodic review of Corporate clients, FIs and NBFIs\n• Perform validation of completeness and accuracy of KYC documentation including but not limited to client’s identity, beneficial ownership, and bearer share information\n• Perform adverse news searches as well as evaluate information available through public sources or through vendors\n• Process KYC by enriching KYC requests in the system and input data onto Excel spread sheets\n• Liaise with sales teams on documentation deficiencies and requirements\n• Ensure Due Diligence and Client Data are documented in appropriate systems\n• Participate in projects with relation to regulatory... changes, new processes, system enhancements, remediation exercises as well as audits\n\nskills and experience required\n• Minimum Degree\n• At least 2 years of KYC experience within Corporate Banking\n• Possess strong working knowledge in Anti-Money Laundering (AML) functions\n• Ability to review and understand business as well as legal documents required for KYC process\n• Compliance certification an added advantage\n• Excellent communications and interpersonal skills\n• Detailed and analytical\n• Proficient in Microsoft Office applications\n\nIf you would like to find out more about this role, please click apply below. Alternatively please contact Lynda Tan at 6510 7413.\n\nEA: 94C3609 / R1223887\n\nskills\nno additional skills required\n\nqualification\nno additional qualifications required\n\nworking hours\nFull-Time\n\neducational requirements\nAssociate Degree/Diploma", "extensions": ["4 days ago", "Full–time"], "detected_extensions": {"posted_at": "4 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJLWUMgQW5hbHlzdCAtIENvcnBvcmF0ZSBCYW5raW5nIChDb250cmFjdCkiLCJjb21wYW55X25hbWUiOiJSYW5kc3RhZCBTaW5nYXBvcmUiLCJjb21wYW55X21pZCI6Ii9nLzExZzcwYjUwbXIiLCJhZGRyZXNzX2NpdHkiOiJTaW5nYXBvcmUiLCJhZGRyZXNzX3N0YXRlIjoiIiwiaHRpZG9jaWQiOiJPemFwekxIZl81M0FXU3ZrQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlUybHVaMkZ3YjNKbCIsImdsIjoic2ciLCJobCI6ImVuIiwiZmMiOiJFdmNCQ3JjQlFVNVZYMDV4VWpORlpVdHRhVkZoVURkTlZHeHhiRVpxVHpsdVpsQnRka1E1VHpsb01WZG9aRFIxWkVFMlQwOXJSMkpGV1haUE5sUTJNRWd0UzBOb1JXSm5SVmszTjJsM2RucDRPRVZmU1VZM0xUaGFXblZpUkhKUWJXOU5XbmRVTVhCNWFYUXhkRXRPTVVvNWVUQkdTeTF0WXpKWExWbGhZWGROZDBOa01rNXViVEY1ZWtOdWJtTlpUVzVaWkY5cU1XWkpWMkp5UW5Oa09UTjRVbmxLTVdoUVRuWlRWbEpQVTFJMGNqYzVlbE5mTVZGMmFWUlJFaGRvV0cxRFdVa3paVXM1UTNBeFprRlFhRFp4VG1sQmJ4b2lRVTlOV1ZKM1FVUk1NQzFHWkdRdGMzWmFhVE5aVW0wMFlXOVlOM1YzYmw5elFRIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNjEiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gUmFuZHN0YWQgU2luZ2Fwb3JlIiwibGluayI6Imh0dHBzOi8vd3d3LnJhbmRzdGFkLmNvbS5zZy9qb2JzL2t5Yy1hbmFseXN0LWNvcnBvcmF0ZS1iYW5raW5nLWNvbnRyYWN0X3NpbmdhcG9yZV8zNjcxNzIxMy8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="}, {"title": "IT Governance & QA Analyst", "company_name": "Singtel Group", "location": "Singapore", "via": "via Singtel Careers", "description": "Singtel, Asia’s leading communications technology group, provides an extensive range of telecommunications and digital services to millions of consumers and businesses across Asia, Australia, Africa and the USA. With over 140 years of innovation behind us, we continue to push boundaries in our networks and services, to enrich lives and transform businesses.\n\nOur core values – Customer Focus, Challenger Spirit, Teamwork, Integrity, and Personal Excellence – shape the way we work. We are passionate about making a difference and have an open and inclusive culture where everyone is empowered to do their best. Our diverse business means you will enjoy unique opportunities and rewarding experiences to learn and grow your career in a dynamic industry.\n\nJoin us and experience what it’s like to be with an Employer of Choice*. Together, let’s create a brighter digital future for all. *Awarded at the HR Fest Awards 2020\n\nAccountable for supporting and improving Group IT Quality Governance report... framework, reporting quality objectives KPIs results and data analyzing findings to enable Quality Management and IT Governance capabilities within Singtel Group IT.\n\nResponsibilities\n• Responsible to support and improve Group IT Quality Governance report framework\n• Provide report and data analysis on quality objectives KPIs results\n• Lead and manage end-to-end delivery of change programs in project reporting system implementation\n• Participate in internal audit process post-implementation review meetings and create report\n• Follow up with respective Group IT teams on areas of improvement identified during internal audit process\n• Build relationships with internal stakeholders and resolves any issues associated with the reporting and auditing services\n• Provide support in enhancing and simplifying project management, service management and solution delivery processes\n• Coordinate root cause analysis for major incidents and project most mortem findings with respective Group IT and ensure implementation\n• Ability to work on service management and dashboard reporting tool and extract relevant reports\n\nExperience\n• Degree in Information Systems or equivalent\n• ITIL foundation certified\n• 3+ years’ experience in support IT Quality Management System\n• 2+ years’ experience in internal quality review\n• 1+ years’ experience as a data analyst\n• Experience with Solution delivery methodologies and execution e.g. waterfall, agile\n• Experience with project management and service management processes in outsourced and offshore projects\n\nWe believe in the strength of a vibrant, diverse and inclusive workforce where backgrounds, perspectives and life experiences of our people help us innovate and create strong connections with our customers. We strive to ensure all our people practices are non-discriminatory and provide a fair, performance-based work culture that is diverse, inclusive and collaborative", "extensions": ["8 days ago", "Full–time"], "detected_extensions": {"posted_at": "8 days ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJJVCBHb3Zlcm5hbmNlIFx1MDAyNiBRQSBBbmFseXN0IiwiY29tcGFueV9uYW1lIjoiU2luZ3RlbCBHcm91cCIsImNvbXBhbnlfbWlkIjoiL20vMDIwemZsIiwiYWRkcmVzc19jaXR5IjoiIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiOUR2c25mQW9uVy1YWTFmNUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVJQkNxSUJRVTVWWDA1eFZFdEdPRkUyU0U4MFRqWXpTVEp6VEVkaFVsWkhZbUoyWVVkMmJHYzFORXRxY0hsbVlrMVNXRkpQTWpscmIyOWFNVlkyTFZSelVWZ3dZVjgxVTFGNVpYUldRbWRDYVZFNGNrcFVUMEk0VTBOV1RrNWZSamRSTms5alRtRjNRelE0V0hwbU9XMXdTbEExWDNwR1RXMVZNVlJzYTJ0cGQwMVZWMmx3ZEVZM2QzUlVXa0Z2T1V0b1FuRk5ZazFCY2pRMGJWWldkVGRzVUU1clQzaDNFaGRvV0cxRFdVa3paVXM1UTNBeFprRlFhRFp4VG1sQmJ4b2lRVTlOV1ZKM1FXVmZORE5TUkdsR2EydzVkMVJ4T1hvMFVWRldOVkJJTWpod1p3IiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNjkiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gU2luZ3RlbCBDYXJlZXJzIiwibGluayI6Imh0dHBzOi8vZ3JvdXBjYXJlZXJzLnNpbmd0ZWwuY29tL2pvYi9JVC1Hb3Zlcm5hbmNlLVx1MDAyNi1RQS1BbmFseXN0LVNpbmcvNTgxMTUzMzEwLz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"}, {"title": "Senior / System Analyst ( PEGA)", "company_name": "BGC Group", "location": "Singapore", "via": "via BGC Group", "description": "Job Responsibilities:\n• Perform system analysis, design and testing according to the project goal and needs\n• Gather requirements from users, designing,\n• implementing, maintaining application systems and project management.\n• Deploy, maintain, and troubleshoot core business applications, including application servers, associated hardware, endpoints, and databases\n• Meet and coordinate with internal and external stakeholders to establish project scope, system goals, and requirements\n• Develop, analyze, prioritize, and organize requirement specifications, data mapping, diagrams, and flowcharts for developers and testers to follow\n• Translate highly technical specifications into clear non-technical requirements\n\nRequirements:\n\nThe candidate must have the following requirements:\n• At least 2 years of working experience: Relational Databases: DB2 & MS SQL Server\n• At least 4 years’ in-depth hands on application development experience in Pega PRPC and Pega frameworks.\n\nPreferred:\n• Java... JavaScript, HTML/ CSS, Web Services (REST and/or SOAP).\n• PEGA PRPC configuration, installation, external systems interface and database integration.\n• PEGA PRPC Production BAU Support.\n• Pega PRPC CSA/CSSA/CLSA certification will be an added advantage.\n\nWorking Location:\n• Jurong/ Newton\n\nBenefits:\n• Basic range up to $ 7800\n• 18 Days Annual Leave\n• 14 Medical Leaves\n• Medical Benefits\n• AWS\n• Yearly Increment", "extensions": ["Over 1 month ago", "Full–time"], "detected_extensions": {"posted_at": "Over 1 month ago", "schedule_type": "Full–time"}, "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgLyBTeXN0ZW0gQW5hbHlzdCAoIFBFR0EpIiwiY29tcGFueV9uYW1lIjoiQkdDIEdyb3VwIiwiY29tcGFueV9taWQiOiIvZy8xMWcwajNmanY4IiwiYWRkcmVzc19jaXR5IjoiU2luZ2Fwb3JlIiwiYWRkcmVzc19zdGF0ZSI6IiIsImh0aWRvY2lkIjoiZjJQZkM1cUNVeFpib1F4cEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpVMmx1WjJGd2IzSmwiLCJnbCI6InNnIiwiaGwiOiJlbiIsImZjIjoiRXVJQkNxSUJRVTVWWDA1eFVXSm5VV0ZuV1hoNFZsbE1kMmh5YW5SVFNYVlZNVk0xY1VGMGVHbG9PVll4T0RWb1VUQXliRWhwTmpGaWNsTXhVMDVXYVdSS1NrVklMWFY2ZEdWWVJHc3RXSGRNUW5Oa1FXeG5aVkpMUVdabWVqRm1VSHBhYjFFeldYRlhlVTFJVVRZMkxUVTBaRnAxVkZKcmNURm1aa1EzYjJWcU1rMUljRWxhZFcxbVgzSm5hRTVTYTFkV1prOUhlRUY0ZVdZeVRWRk5TVzV5YlZOWldXOTNFaGRvV0cxRFdVa3paVXM1UTNBeFprRlFhRFp4VG1sQmJ4b2lRVTlOV1ZKM1FUTjRWRnB3UzNOeFpXRmZkbEphTlU1ZlVEUnpSR3B6ZFhWblp3IiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNzYiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQkdDIEdyb3VwIiwibGluayI6Imh0dHBzOi8vd3d3LmJnYy1ncm91cC5jb20vam9iL3Nlbmlvci1zbGFzaC1zeXN0ZW0tYW5hbHlzdC1wZWdhP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="}], "chips": [{"type": "Category", "param": "gcat_category.id", "options": [{"text": ".WGYX8{box-sizing:border-box;background:#fff;border:1px solid #dadce0;border-radius:18px;color:#3c4043;cursor:pointer;display:inline-block;font:400 12px arial,sans-serif;height:36px;min-width:36px;position:relative}.wf-b .WGYX8{font-family:}.WGYX8:after{bottom:-7px;content:'';left:-1px;position:absolute;right:-1px;top:-7px}.WGYX8:hover{background:#f8f9fa}.KymMLe:focus .WGYX8,a:focus .WGYX8,.WGYX8:focus{background:#f8f9fa;border-color:#9aa0a6;color:#e8eaed}.KymMLe:focus .WGYX8:hover:not(:active),a:focus .WGYX8:hover:not(:active),.WGYX8:hover:focus:not(:active){background:#dadce0;border-color:#9aa0a6}.WGYX8:hover,.KymMLe:focus .WGYX8,a:focus .WGYX8,.KymMLe:active .WGYX8,a:active .WGYX8,.WGYX8:focus,.WGYX8:active{color:#202124}.KymMLe:active .WGYX8:not([disabled]),a:active .WGYX8:not([disabled]),.WGYX8:active:not([disabled]){box-shadow:0 1px 2px rgba(60,64,67,.3), 0 2px 6px 2px rgba(60,64,67,.15);border-color:transparent;background:#fff}.WGYX8[disabled]{background:#f1f3f4;border-color:#f1f3f4;color:#bdc1c6;opacity:0.38}.WGYX8[selected]{background:#e8f0fe;border-color:#d2e3fc;color:#1967d2}.zAoYTe .WGYX8[selected]:not(:focus),html:not(.zAoYTe) .WGYX8[selected]{outline:1px solid transparent}.KymMLe:focus .WGYX8[selected],a:focus .WGYX8[selected],.WGYX8[selected]:focus{border-color:#8ab4f8;color:#174ea6;background:#d2e3fc}.KymMLe:active .WGYX8[selected],a:active .WGYX8[selected],.WGYX8[selected]:active{box-shadow:0 1px 2px rgba(66,133,244,.3), 0 1px 3px 1px rgba(66,133,244,.15);background:#e8f0fe;color:#174ea6}.WGYX8[selected]:hover{background:#d2e3fc;border-color:#d2e3fc;color:#174ea6}.KymMLe:focus .WGYX8[selected]:hover:not(:active),a:focus .WGYX8[selected]:hover:not(:active),.WGYX8[selected]:hover:focus:not(:active){background:#aecbfa;border-color:#d2e3fc}.AB4Jjf{font-size:14px;line-height:34px;padding:0 8px;text-align:center}.AB4Jjf,.qfpP8d,.ktgKbb{box-sizing:border-box;display:inline-block;height:34px;vertical-align:bottom}.AB4Jjf.gLDgs{min-width:46px;padding:0 11px}All", "value": null}, {"text": "Computer and IT", "value": "GC08"}, {"text": "Business Operations", "value": "GC06"}, {"text": "Accounting and Finance", "value": "GC01"}, {"text": "Science and Engineering", "value": "GC27"}, {"text": "Advertising and Marketing", "value": "GC03"}, {"text": "Customer Service", "value": "GC10"}, {"text": "Legal", "value": "GC17"}, {"text": "Protective Services", "value": "GC23"}, {"text": "Management", "value": "GC18"}, {"text": "Manufacturing and Warehouse", "value": "GC19"}, {"text": "Property", "value": "GC24"}, {"text": "Sales and Retail", "value": "GC26"}, {"text": "Social Services and Non-Profit", "value": "GC28"}]}, {"type": "Title", "param": "job_family_1", "options": [{"text": "All", "value": null}, {"text": "Business analyst", "value": "business analyst"}, {"text": "Analyst", "value": "analyst"}, {"text": "Security analyst", "value": "security analyst"}, {"text": "Systems analyst", "value": "systems analyst"}, {"text": "It analyst", "value": "it analyst"}, {"text": "Data analyst", "value": "data analyst"}, {"text": "Support analyst", "value": "support analyst"}, {"text": "System analyst", "value": "system analyst"}, {"text": "Test analyst", "value": "test analyst"}, {"text": "Associate", "value": "associate"}, {"text": "Operations analyst", "value": "operations analyst"}, {"text": "Soc analyst", "value": "soc analyst"}, {"text": "Intelligence analyst", "value": "intelligence analyst"}, {"text": "Management analyst", "value": "management analyst"}, {"text": "Senior", "value": "senior"}, {"text": "Senior analyst", "value": "senior analyst"}, {"text": "Control analyst", "value": "control analyst"}, {"text": "Manager", "value": "manager"}, {"text": "Project analyst", "value": "project analyst"}, {"text": "Research analyst", "value": "research analyst"}, {"text": "Researcher", "value": "researcher"}, {"text": "Risk analyst", "value": "risk analyst"}, {"text": "Service analyst", "value": "service analyst"}, {"text": "Technology analyst", "value": "technology analyst"}, {"text": "Accounting analyst", "value": "accounting analyst"}, {"text": "Application analyst", "value": "application analyst"}, {"text": "Behavior analyst", "value": "behavior analyst"}, {"text": "Business", "value": "business"}, {"text": "Center analyst", "value": "center analyst"}, {"text": "Cloud engineer", "value": "cloud engineer"}, {"text": "Compliance analyst", "value": "compliance analyst"}, {"text": "Coordinator", "value": "coordinator"}, {"text": "Desk", "value": "desk"}, {"text": "Desk analyst", "value": "desk analyst"}, {"text": "Finance analyst", "value": "finance analyst"}, {"text": "Financial analyst", "value": "financial analyst"}, {"text": "Functional analyst", "value": "functional analyst"}, {"text": "Hr analyst", "value": "hr analyst"}, {"text": "Operations assistant", "value": "operations assistant"}, {"text": "Operations center", "value": "operations center"}, {"text": "Process analyst", "value": "process analyst"}, {"text": "Programmer analyst", "value": "programmer analyst"}, {"text": "Project manager", "value": "project manager"}, {"text": "Qa analyst", "value": "qa analyst"}, {"text": "Senior associate", "value": "senior associate"}, {"text": "Senior consultant", "value": "senior consultant"}, {"text": "Specialist", "value": "specialist"}, {"text": "Sr analyst", "value": "sr analyst"}, {"text": "Support executive", "value": "support executive"}, {"text": "Technical analyst", "value": "technical analyst"}, {"text": "Technical architect", "value": "technical architect"}, {"text": "Trainee", "value": "trainee"}, {"text": "Treasury analyst", "value": "treasury analyst"}]}, {"type": "Location", "param": "city", "options": [{"text": "All", "value": null}]}, {"type": "Date posted", "param": "date_posted", "options": [{"text": "All", "value": null}, {"text": "Past day", "value": "today"}, {"text": "Past 3 days", "value": "3days"}, {"text": "Past week", "value": "week"}, {"text": "Past month", "value": "month"}]}, {"type": "Type", "param": "employment_type", "options": [{"text": "All", "value": null}, {"text": "Full–time", "value": "FULLTIME"}, {"text": "Contractor", "value": "CONTRACTOR"}, {"text": "Part-time", "value": "PARTTIME"}, {"text": "Internship", "value": "INTERN"}]}, {"type": "Company type", "param": "industry.id", "options": [{"text": "All", "value": null}, {"text": "Finance", "value": "/business/naics2007/52"}, {"text": "Computer Services", "value": "/business/naics2007/5415"}, {"text": "Information", "value": "/business/naics2007/51"}, {"text": "Consulting", "value": "/business/naics2007/5416"}, {"text": "Manufacturing", "value": "/business/naics2007/31"}, {"text": "Staffing", "value": "/business/naics2007/5613"}, {"text": "Health Care", "value": "/business/naics2007/62"}, {"text": "Retail", "value": "/business/naics2007/44"}, {"text": "Education", "value": "/business/naics2007/61"}, {"text": "Logistics", "value": "/business/naics2007/48"}, {"text": "Real Estate", "value": "/business/naics2007/53"}, {"text": "Research", "value": "/business/naics2007/5417"}, {"text": "Construction", "value": "/business/naics2007/23"}, {"text": "Engineering Services", "value": "/business/naics2007/5413"}, {"text": "Mining", "value": "/business/naics2007/21"}]}, {"type": "Employer", "param": "organization_mid", "options": [{"text": "All", "value": null}, {"text": "SingTel", "value": "/m/020zfl"}, {"text": "Accenture", "value": "/m/01rp2c"}, {"text": "GovTech Singapore", "value": "/g/11gh0528nq"}, {"text": "OCBC", "value": "/m/055r27"}, {"text": "Snaphunt", "value": "/g/11c74t61w8"}, {"text": "Trustwave", "value": "/m/0n3xjf5"}, {"text": "Credit Agricole Group", "value": "/m/028vbm"}, {"text": "HSBC", "value": "/m/01vq1f"}, {"text": "UL", "value": "/m/01q1gj"}, {"text": "VISA", "value": "/m/01kqjn"}, {"text": "Xcellink Pte Ltd", "value": "/g/11c73prcqy"}, {"text": "American Express", "value": "/m/01w6dw"}, {"text": "Avensys Consulting", "value": "/g/11g7022gjf"}, {"text": "Binance", "value": "/g/11hcz1r4wl"}, {"text": "BlueVoyant", "value": "/g/11h1y4qdlf"}, {"text": "Caterpillar", "value": "/m/0319hp"}, {"text": "Cognizant Singapore, Cognizant Technology Solutions", "value": "/m/03bf9h"}, {"text": "DBS Bank Ltd", "value": "/m/01q7n5"}, {"text": "Deloitte SEA", "value": "/g/11f_g4x9d_"}, {"text": "Dyson", "value": "/m/05cskg"}, {"text": "EPAM Systems", "value": "/m/0dlnrc"}, {"text": "Experis Singapore", "value": "/g/11dxpnwm3s"}, {"text": "JPMorgan Chase & Co.", "value": "/m/01hlwv"}, {"text": "Jobline Resources Pte Ltd", "value": "/g/11gp2647pn"}, {"text": "Marina Bay Sands Pte Ltd", "value": "/m/09mhd9q"}, {"text": "Medtronic", "value": "/m/03z4j3"}, {"text": "Mizuho Bank", "value": "/m/022103"}, {"text": "Public Service Division", "value": "/g/11g6__bv10"}, {"text": "RECRUIT EXPRESS PTE LTD", "value": "/g/11g706hzhq"}, {"text": "RHB Singapore", "value": "/g/11c73srg7f"}, {"text": "Randstad", "value": "/m/08pt1z"}, {"text": "Randstad Singapore", "value": "/g/11g70b50mr"}, {"text": "SITA", "value": "/m/06l20z"}, {"text": "Selby Jennings", "value": "/g/11fy2ds3gn"}, {"text": "Standard Chartered", "value": "/m/02hszk"}, {"text": "Xilinx", "value": "/m/03dwkc"}, {"text": "103 Golden Agri International Pte Ltd", "value": "/g/11fy210tb9"}, {"text": "AccionLabs", "value": "/g/11dxpqm16v"}, {"text": "Activate Interactive Pte Ltd", "value": "/g/11dxq192l5"}, {"text": "Amazon", "value": "/m/0mgkg"}, {"text": "Apple", "value": "/m/0k8z"}, {"text": "Aramco", "value": "/m/01qjg2"}]}]}